{
  "companyName": "SNDL Inc.",
  "companyTicker": "SNDL",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/sndl-inc-sndl-q2-2022-earnings-call-transcript/",
  "content": "SNDL Inc. (SNDL 1.95%)\nQ2 2022 Earnings Call\nAug 15, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning and welcome to the SNDL's second quarter 2022 financial results conference call. Friday afternoon, August 12th, SNDL issued a press release announcing their financial results for the second quarter ended on June 30, 2022. This press release is available on the company's website at sndl.com and filed on EDGAR and SEDAR as well. The webcast replay of the conference call will also be available on sndl.com website.\n\nSNDL has also posted a supplemental investor presentation found on the sndl.com website. Presenting on this morning's call, we have Zach George, chief executive officer; Jim Keough, chief financial officer; Tank Vander, president of liquor retail; and Andrew Stordeur, president and chief operating officer. Before we start, I would like to remind investors that certain matters discussed in today's conference call or answers that may be given to questions could constitute forward-looking statements. Actual results could differ materially from those anticipated.\n\nRisk factors that could affect results are detailed in the company's financial reports and other public filings that are made available on SEDAR and EDGAR. Additionally, all financial figures mentioned are in Canadian dollars unless otherwise indicated. We will now make prepared remarks. Then we'll move on to analysts questions.\n\nI would now like to turn the call over to Zach George.\n\nZach George -- Chief Executive Officer\n\nGood morning, everyone, and thank you for joining us on our second quarter 2022 earnings call. Andrew and I are thrilled to be speaking to you from Applebee New Brunswick in Maritime Canada today. Before we provide the details on our operations and second quarter results, I want to discuss our companies rebrand. Following our annual and special meeting of shareholders on July 25, 2022, Sundial Growers Inc.\n\nchanged its legal name to SNDL Inc. Our Nasdaq ticker symbol has remained unchanged. The rapid and material changes we have experienced over the past two years have led to our original Sundial Growers identity becoming less relevant as we expand and diversify our business operations. As we reevaluated our company's purpose and realigned our values, we believe the new SNDL brand acknowledges the evolution of our activities and operations as a company and the undeniable impact that investor support has had on the business.\n\nThe new SNDL brand embodies our commitment to excellence in the regulated product space as we focus on delighting consumers by providing unparalleled experiences coupled with our ability to curate and deliver a robust selection of offerings throughout the regulated retail market. Along with the new logo and brand identity, SNDL has launched a new Investor Relations website at www.sndl.com, along with a rebrand video that gives a quick look on who SNDL has become. As a reminder, with the Alcanna transaction having been completed on March 31, 2022, SNDL's business is operated and reported in four segments: liquor retail, cannabis retail, cannabis production and cultivation; and investments. In the second quarter, we made tremendous progress on our strategy and commitment toward becoming a leader in the Canadian-regulated products industry.\n\nSNDL delivered a 2,344% increase in net revenue year over year with a record net revenue of $223.7 million. SNDL's asset base and strong balance sheet position us well to develop unique competitive advantages that will lead to success in the Canadian market. SNDL's second quarter of 2022 gross margin grew to $43.1 million, up 1,627% from its second quarter 2021 loss of $2.8 million. This result is a record since SNDL's inception, which is especially meaningful given the sustained macroeconomic challenges we continue to navigate.\n\nDespite material cost inflation, rising interest rates, continued cannabis price compression, and intense competition, SNDL continues to drive toward improved results. Scale is mission critical to Sundial's success. The baseline costs of running a CPG-oriented company with a Nasdaq listing outrageous E&O insurance rates, internal and external SOX compliance costs, and the commercial cost of best practices in CPG put many of our peers in a position where they are wholly incapable of delivering sustainable profits in excess of the costs of managing this infrastructure. This dynamic is sure to drive further industry consolidation.\n\nAs a result of the Alcanna acquisition, SNDL is now Canada's largest private sector liquor retailer, operating 170 locations under its three retail banners: Wine and Beyond, Liquor Depot, and Ace Liquor. The liquor retail segment's stable and growing cash flow profile, along with best in class retail operations expertise, has accelerated SNDL's retail growth and vertical integration strategy. As COVID 19 restrictions have largely dissipated, we are seeing liquor retail sales revert to a more normalized run rate as on-premise consumption returns in force. That said, despite the fluctuation in sales due to market conditions and retail competition, we have stabilized our margins through pricing and mix initiatives and are working to position the business for greater future profitability.\n\nTank will provide more comments on our liquor segment shortly. Turning to our cannabis retail segment, the retail landscape remains highly fragmented and ripe for consolidation as we have begun to see more retail closures on the back of unsustainable saturation in certain markets. Our expanded retail networks solidifies SNDL's market share and its exposure to a broader consumer base. This past quarter, Value Buds and Spiritleaf's combined market share represented approximately 9.8 share in the privatized provincial markets, solidifying SNDL's position as a leading national multi-banner cannabis retail operator.\n\nMarket share for SNDL's products and our retail network continued to increase, highlighting the benefits of the company's vertical integration strategy. We see an opportunity to build a publicly listed, multi-banner, pure-play retail cannabis business with the scale and infrastructure to best serve Canadian cannabis consumers with distinct retail experiences. This will require the reorganization of our current retail license exposure into a single enterprise. This strategy may see benefit from the small loans we have made to Canadian retailers that could become acquisition candidates.\n\nWe expect to provide more detail on this opportunity in the coming months. We are pleased with our cannabis brand sales in the second quarter in an environment that continues to be highly competitive. This is the first quarter since inception that our cannabis operations have generated positive adjusted EBITDA. We continue to be encouraged by our THC potency and yield results, which have hit new all-time highs during the quarter.\n\nAnd SNDL's efforts in tailoring our product innovation strategy based on increased data analytics and access to a broader consumer base are starting to yield results. By the end of the first quarter of 2022, Sundial had deployed capital into several cannabis-related investments with an IFRS fair value of $561.7 million, including $462 million to the SunStream Bancorp joint venture. This joint venture has credit exposure to a handful of operators, including Jushi, Skymint, Ascend, Parallel, Columbia Care, and AFC Gamma. We have adjusted the fair market value of our investment portfolio to reflect current market conditions in the cannabis industry and credit markets.\n\nSunStream remains the largest Canadian funded credit portfolio in the industry. While our goal is to generate attractive returns as a strategic capital partner for these borrowers, in certain cases we may see defaults or other restructurings create an opportunity for SNDL to gain a meaningful operating footprint in a single or multi-state format. The broader North American cannabis markets are experiencing price and margin compression while facing a brutal mix of excess supply, tax, and regulatory regime challenges and a lack of access to capital. At this point in the cycle, we are seeing very few new potential credit deployment opportunities that meet SunStream's strict underwriting standards and view the repurchase of shares as attractive on a relative basis, given SNDL's current valuation, which implies a discount to the value of our cash and investments and a negative value for our liquor and cannabis operations.\n\nWe have shown this math with a net asset value buildup in our new investor deck, which I invite you to review. It's worth noting that we are one of the only LPs in Canada that can largely consider the repurchase of shares, and we do not need to dilute shareholders in the near term to solve balance sheet issues or to secure working capital. Despite our encouraging results, we are well short of our corporate goals and know that our business still has room for both improvement and growth. We expect to realize cost savings across all of our operating segments and our Canada integration work will continue into early 2023.\n\nThe reckoning that I've been talking about for the last two years is certainly here. We are focused on demonstrating prudent capital allocation and proving the efficacy of our strategy and its benefit to shareholders. SNDL is uniquely positioned with the potential to be a leader in the Canadian regulated product space. We continue to explore significant opportunities to enhance our capabilities in a manner that's complementary to our vertically integrated model.\n\nWe believe that our culture of continuous improvement with a focus on cost control and efficient operations will drive strong future results. I am humbled to work with and serve our more than 2,500 employees and thank them for their continued dedication to our mission. Thank you. And I'll pass the call to Jim for comments on our financial results.\n\nJim Keough -- Chief Financial Officer\n\nThank you, Zach, and good morning, everyone. I'd like to remind you that all amounts that I discussed today are denominated in Canadian dollars unless otherwise stated. All results for the second quarter of 2021 comparatives exclude the subsequent acquisitions of Spiritleaf and Alcanna, which closed on July 20, 2021 and March 31, 2022, respectively. Certain amounts that I will refer to on this call are non-IFRS measures.\n\nPlease refer to SNDL's Management Discussion and Analysis for the definitions. As we have previously discussed, SNDL now reports its financial results under four segments: liquor retail, cannabis retail, cannabis, and investments. I'll begin with our consolidated financial highlights. With this first full quarter subsequent to the acquisition of Alcanna, we achieved net revenue in the second quarter of 2022 of $223.7 million, compared to $9.2 million in the second quarter of 2021, representing a more than 2,000% increase.\n\nOur gross margin grew to $43.1 million in the second quarter of 2022, the highest since SNDL's inception, up over 1,600% from a loss of $2.8 million in Q2 2021. Net loss for the three months ended June 30, 2022 was $74 million, compared to a net loss of $52.3 million for the three months ended June 30, 2021. SNDL recorded an adjusted EBITDA loss of $25.9 million for the second quarter of 2022, compared to an adjusted EBITDA loss of $0.2 million in Q2 2021. Excluding the investment segment, which was primarily impacted by fair value adjustments for SunStream, adjusted EBITDA would have been $9.6 million.\n\nAs of June 30, 2022, SNDL had $900 million of cash, marketable securities, and long-term investments and no outstanding debt. And as of August 11, 2022, SNDL had $362.6 million of unrestricted cash. SNDL's general and administrative expenses for the three months ended, June 30, 2022 were $40.3 million, compared to $10.1 million for the three months ended June 30, 2021. This increase was mainly due to salaries, wages, and office and general expenses from the Alcanna and Spiritleaf acquisitions.\n\nEffective July 25, 2022, SNDL's common shares were consolidated on a one share for each 10 shares outstanding basis pursuant to shareholder approval at SNDL's annual and special meeting of shareholders. The company has now regained compliance with the Nasdaq minimum closing bid price requirements. In the quarter, SNDL repurchased 528,000 shares at a cost of $2 million. The company continues to see a significant dislocation in its valuation when compared to the underlying asset base.\n\nLet's take a closer look at our retail liquor segment now. The second quarter of 2022 is SNDL's first full quarter reporting liquor retail revenue subsequent to the acquisition on March 31, 2022. And the segment's stable and growing cash flow profile, along with best-in-class retail operations expertise, has significantly impacted SNDL's growth. Gross revenue for liquor retail sales for the three banners combined was $148.6 million for the second quarter of 2022.\n\nGross margin in the liquor retail segment was $33.5 million or 22.6% of sales. Despite fluctuations in sales due to market conditions and retail competition, we've stabilized margins through management of pricing and product mix. Now let's turn to cannabis retail. With the acquisition of our interest in Nova Cannabis Inc.\n\nthrough the Alcanna acquisition, our expanded retail network has significantly increased our retail share and exposure to a broader consumer base. Gross revenue from the cannabis retail segment for the second quarter of 2022 was $63.5 million, compared to $7.5 million for the first quarter of 2021, a 746% increase. Value Buds sales were the material driver of the increase with $56.3 million for the second quarter of 2022. Systemwide Cannabis retail sales, including sales from our franchise partners, was $92.8 million for the second quarter of 2022.\n\nGross margin for cannabis retail this quarter was $13.9 million or 21.9% of sales, significantly increased from $3.3 million compared to Q1 2022. Through our cannabis cultivation and processing operations, we remain committed to providing quality product offerings for our customers while focusing on cost optimization in the most competitive and profitable strains and brands. Our cannabis cultivation and production finance results are as follows. Gross revenue from the cannabis segment for the second quarter of 2022 was $15.4 million, compared to $11.3 million in the first quarter of 2022, a 36% increase and a 21% sequential improvement from the first quarter of 2022.\n\nNet loss for the cannabis cultivation and production segment was $8 million. Adjusted EBITDA for Q2 2022 was $3.5 million, compared to negative $11 million in the same period of 2021. This represents SNDL's first positive adjusted EBITDA quarter in the cannabis segment, which can be attributed to higher sales volumes, improved margin on an adjusted basis, reductions to SNDL SMG&A and a greater discipline over inventory management, driving a reduction in price discounts for provincial board sales during the first half of 2022. And lastly, I'd like to review our investment segment.\n\nRevenue from our investment segment for the second quarter of 2022 was a disappointing loss of $35.1 million, compared to $2.4 million in the second quarter of 2021. The decrease was primarily due to non-cash fair value adjustments, reflecting an increase in the assumed risk-free interest rate and the deterioration in overall cannabis credit market conditions during the quarter. As of the end of the second quarter of 2022, SNDL had cannabis credit and equity investments with a fair value of $562 million, including $462 million related to the SunStream joint venture and $100 million in Canadian credit and equity holdings. I would now like to invite Tank Vander, SNDL president of liquor retail, to provide further remarks on that segment.\n\nTank Vander -- President, Liquor Retail\n\nThank you, Jim, and good morning, everyone. I'm Tank Vander, the president of liquor retail for SNDL. As you have heard some Zach and Jim, we made some substantial progress this past quarter in the business. The liquor segment strengthened SNDL's ability to own the customer relationship and shape industry dynamics.\n\nIn terms of liquor operations, we have a total of 170 stores and we operate under three banners. Wine & Beyond is rest in Canada's largest liquor store. Our stores are known for their incredible selection, unique product offerings, and our staff's excellent product knowledge and customer service. Liquor Depot is a convenience retail liquor outlet with over 20 locations in Alberta.\n\nAce Liquor Discounter has more than 130 locations in Alberta, where you'll find a great selection, better prices, and friendly knowledgeable staff. We are targeting a broad range of customers with a diversified retail portfolio. The COVID-19 pandemic significantly affected consumer behavior with respect to retail liquor consumption. The unusually high volume trend has normalized as consumers return to bars and restaurants.\n\nAs a result, we have experienced a slight decrease in liquor sales compared to the past two years. We believe that sales are starting to stabilize as customers start getting back into a more normal routine. In terms of our financial highlights, gross revenue for liquor retail sales for the three banners combined was $148.6 million for the second quarter of 2022. Our adjusted EBITDA for the second quarter of 2022 was $15.5 million.\n\nGross margin in the liquor retail segment was $33.5 million. Despite fluctuations in sales due to market conditions and retail competition, we stabilized our margin through a pricing and mix strategy. SNDL is leveraging our scale store footprint and warehousing infrastructure to enable strategic buying decisions that drive margin and competitive pricing. While customer count is done by 5% year to date, largely due to a return to on-premise consumption in a post-COVID-19 environment, the average basket size is up 2%.\n\nThe company sees larger basket sizes at -- on our Wine & Beyond locations, where consumers come for the experiences destination shopping approach to liquor retail. SNDL's liquor banner's market share in Alberta was 17.6% in the second quarter of 2022, with Wine & Beyond representing 2.9% with only 11 stores showcasing the continued and increasing popularity of the banner. SNDL is exploring opportunities to expand the Wine & Beyond store footprint in Alberta, British Columbia, and Saskatchewan. Moving forward, the company will continue to optimize profitability and cash flow for the liquor retail segment by focusing on cost discipline and margin accretive products.\n\nWe will leverage SNDL's extensive inventory and retail footprint to enable leading e-commerce experiences and touchpoints. We are also planning on growing our preferred label program to increase our competitive differentiation and optimize gross margin. Thank you again for your time this morning and I will pass it on to Andrew.\n\nAndrew Stordeur -- President and Chief Operating Officer\n\nThank you, Tank. We made strong progress this past quarter in our cannabis operation segments, highlighting the early benefits of the company's vertical integration strategy. I'm very proud of our team's efforts as adjusted EBITDA was $3.5 million, which represents SNDL's first positive adjusted EBITDA quarter within its cannabis operations. The significant improvement in Q2 adjusted EBITDA can be attributed to higher sales volumes, improved margin on an adjusted basis, reductions to sales, marketing, general and administrative costs, and greater discipline over inventory management, which drove a reduction in price discounts for provincial board sales during the first two quarters of 2022.\n\nOur top line grew year over year by 21% and showed a 36% sequential improvement from the first quarter of 2022. While our business and industry face many headwinds, we remain consistent with our execution against a plan launched this year to drive sustainable profitability within our cannabis operations segment. Let me highlight some of our progress against this plan and how we're continuing to position are cannabis operations for the future. I'll start with cultivation excellence.\n\nOur cultivation outcomes through our indoor purpose-built facility in Old Alberta hit new high points in the second quarter of 2022, with average potency for the month of June, achieving north of 25% THC. Our average weighted yield continues to remain consistent at 57 grams per square foot. Our second key pillar for 2022 is around cost optimization. With better and more consistent cultivation outcomes, we've been able to attack our margin profile.\n\nFurther investments in process and automation remain a key focus for the second half of 2022, particularly around increasing our pre-roll and bottling throughput in several new formats. While price compression continues to be an extended headwind for the industry, we've been able to increase our provincial board price per gram by 32% on a year-over -year basis. We continue to believe that disciplined pricing through strong revenue management capability is a key enabler to accelerating margin growth for key customers. Further, our end-to-end supply chain improvements implemented over the past two years continue to drive discipline around cost optimization, which is helping partially offset higher power and inflation costs.\n\nMoving to the second half of 2022, we do expect margin pressure on our portfolio given the challenging industry backdrop. Monetizing sellable inventory through a national brand pack price and channel strategy is currently underway. We've enhanced our product portfolio. We continue to drive consumer value through a disciplined product innovation pipeline.\n\nThis is backed by access to a broad consumer base and intentional application of data analytics to meet the unique needs of the market. Some notable highlights include: on the Top Leaf brand, we launched two limited edition infused pre-roll offerings, Spaceberry Fuel and Pink Platinum Haze Caviar Cones. As the first producer to bring infused pre-rolls to the Canadian recreational market, we remain committed to the segment and view it as a significant opportunity to drive improved margins and better sales. We plan to deliver an expanded infused lineup in the second half of 2022 with additional formats and formulations.\n\nOur commitment to premiumization and quality has enabled the Top Leaf brand to claim the #1 spot for premium flower brands in Quebec market and holds the #1 spot for premium ounce offerings in Alberta. Under our Palmetto brand, we have expanded our large format offerings in two key segments with our Romulan and Blue Dream cultivars, both launching in new 28 gram formats. We have also relaunched our vape portfolio with one gram distillate vapes in four innovative new flavors: Raspberry Kush, Clementine Haze, Super Tropic Haze, and Dragon Fruit Kush. A minimal flower launched in the second quarter of 2022 and has received positive consumer views.\n\nIn British Columbia, Palmetto Middle Flower has exceeded tread in points of distribution, with more growth expected. Finally, we are excited to announce we have expanded our brand footprint into Newfoundland and Labrador to drive increased national market share. SNDL products are now available in all 10 provinces across Canada. We remain committed to proving our vertical integration strategy within Canada.\n\nWe're also looking to be optimistic internationally, given our indoor cultivation progress and flower demand. We have received our international export permit and are on track to dispatch our first shipment to Israel in the third quarter of 2022. To close, we're on track with our plan and the results are starting to show early signs of progress. I'm extremely proud of our team's effort to date and believe we have a clear path to further differentiate and shape a very competitive and challenging industry.\n\nI'll now turn back the call to Zach for closing remarks.\n\nZach George -- Chief Executive Officer\n\nThank you, Andrew. Our goal is to deliver sustainable profits and returns to shareholders. We believe that we are setting SNDL up for success by focusing on fundamentals and building credibility as a trustworthy partner to industry stakeholders and a source of delight to consumers. Through a vertically integrated model and an unapologetic focus on the Canadian market, SNDL continues to distinguish itself from the competition.\n\nI will now pass the call to the operator for analyst questions.\n\nOperator\n\n[Operator instructions] The first question is from Frederico Gomes with ATB Capital Markets. Please go ahead.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nHi, good morning. Thanks for taking my questions. My first question is on your liquor retail segment. So you mentioned that Wine & Beyond is becoming more popular and that could be expanded to other provinces.\n\nSo could you maybe talk a little bit more about any details you could share on the economics of the Wine & Beyond banner? How it's different from other -- the other vendors in your portfolio in terms of sales per store, no margins as well as the capex needed for opening new stores that you're planning on? Thank you.\n\nZach George -- Chief Executive Officer\n\nSure. Thanks, Frederico. I'll let Tank jump in to answer this one.\n\nTank Vander -- President, Liquor Retail\n\nThanks, Zach. So on the growth opportunities, we are looking at this Columbia and Saskatchewan and hopefully another two to three stores in the Alberta market. To answer your question on what's different between Wine & Beyond and other stores, Wine & Beyond attracts a much larger customer segment and it offers the highest selection and the most competitive pricing in the liquor retail segment in Alberta. On capex, Wine & Beyond usually costs -- the build out of the Wine & Beyond is anywhere between $1.5 million to $1.8 million at this current pricing in the market.\n\nIt might fluctuate a bit with current conditions due to increase in materials and whatnot, but it's usually -- the last few we have done are -- have gone under $2 million. Does that answer your question?\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nYes. Yes. That's really helpful. Thank you.\n\nAnd then maybe moving on to your cannabis retail segment. So it seems like the number of stores in the Spiritleaf network has remained relatively flat recently. And most of the revenue you have in that segment is coming from Nova Cannabis, which is performing really well. So could you maybe talk about how you see the different performance that both vendors are having right now? And do you have any specific plans to improve the performance of Spiritleaf, both in your corporate-owned stores as well as in your franchise network?\n\nZach George -- Chief Executive Officer\n\nYeah, sure. Absolutely. So the thing to remember, Frederico, is that the Spiritleaf model is a blend of corporate-owned locations along with franchise exposure. So it's not really an easy apples-to-apples comparison when you look at Nova.\n\nThe target shopper is also very different. So the discount brokers of Nova has turned those doors into highly competitive velocity machines and you can see a line of sight based on greater scale to profitability, which hasn't hit on a sustained basis yet, but the margin profiles are very different. And what I would say that we're seeing in the market -- my comments are in line with what we've been saying for the last several quarters in that we're really looking to optimize performance at retail and not looking to blindly open a large quantity of new doors into an already oversaturated market. We don't think that that's a smart strategy.\n\nAnd we're seeing now virtually most retail in the country on a private basis coming up for sale or looking for some type of strategic solution. This is a business model that requires scale. It's very hard to operate successfully and profitably at a small scale. So independent operators and even some small chains are having some significant problems.\n\nAnd what we're seeing is at this point, the build versus buy equation, when you think about relative capex obligations, has in some cases inverted. So we're carefully watching for instances where we may selectively open new doors versus acquiring other banners. We do believe that there are different and distinct target shoppers that exist in the retail cannabis space in Canada, and we also believe in the benefits of multi-banner retail. And so I think the steps we take to grow that platform well will reflect that going forward.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nOK. Thanks for that. I'll pass it along.\n\nOperator\n\n[Operator instructions] The next question is from Shaan Mir with Canaccord Genuity. Please go ahead.\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nHey, good morning and thank you for taking my question. Just the first one here. So in the release, it was noted that the company exported its first products into Israel in Q3. So congratulations on that.\n\nJust wanted to get some more color on your international strategy. Specifically, are there any other international markets of interest to you that SNDL would look to enter in the next 12 months or so? And if so, is there any commentary that you could provide on where the companies are in the regulatory process for tapping those new markets?\n\nAndrew Stordeur -- President and Chief Operating Officer\n\nHey, Shaan. It's Andrew here. Thanks for the question. Appreciate it.\n\nIn regards to export, just one bit of correction. We have not executed that transfer yet, our first one to Israel. That is pending in quarter here for Q3, but we're on track. And I'll touch a little bit around kind of our view in regards to domestic versus international.\n\nAnd I think one thing we've been pretty consistent on is it's focusing on Canada. We do believe Canada is worth fighting for and we certainly have a good position and good strategy, I think, moving forward here to prove that model out. So our focus remains on Canada would be the first thing I'd say. When it comes to looking at international, I think what we're doing is we needed to get our cultivation, we need to get our operations on the ground here done and set up to a position where we felt that we could look and have some optionality for exporting out of the country.\n\nAnd I think that's where we're at right now. We feel really confident on where our product quality is. We have demand for that product quality outside of Canada. We're starting in Israel.\n\nWe have a nice contract that we signed that we're going to be deploying against here for the back half of 2022 and potentially to 2023. So we're going to start there and we're going to be opportunistic as we think about where those other opportunities look like in other parts outside of Canada. And we're in Israel now focused, but we're certainly looking at other markets. Germany is interesting, obviously.\n\nThere's a lot of attention being there with regards to what that regulatory framework is going to look like in future. There's opportunities in places like Australia. So we're going to be, again, opportunistic where we go. We're certainly well-positioned to do that now.\n\nBut I would just say that our focus remains Canada in the short, medium term and we're looking at those opportunities as they come down and we'll certainly capitalize it if it makes sense for our business.\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nOK. Thank you for the color there.  And then my next question is on the retail side. So I've read a couple of recent media reports that show that OCS has shut down its delivery services just due to a cyberattack on its logistics network. I know many retailers I've spoken to in the past rely on weekly deliveries to keep their shelves stocked.\n\nSo I just wanted to get a sense for how you think this will have an impact on your two retail lines and if there's any steps that you're taking or any any protocol in place that's helping you mitigate the potential impact here.\n\nZach George -- Chief Executive Officer\n\nSure. Look, it's a great question and it's going to be a bit of a macro answer, Shaan. So we don't expect any material disruptions in our retail business from the some of the technology or cyber attack or cyber security issues that occurred with the OCS. What I would point out is that we're seeing movement in terms of the regulatory overlay at many different levels across the country.\n\nAnd so for example, you saw that the Alberta board, the AGLC has changed its stance on window coverings, which was becoming a significant security issue and making making the environment convenient for would-be thieves who have put some of our staff members at risk over time. So we think that those robberies will decrease as a result of the change in regs. And we're seeing some common sense regulatory reform come into the discussions across many different provinces. I think Ontario has had its own growing pains and is trying to sort out the appropriate role of government in this industry.\n\nAnd I would expect that to change over time. But certainly the -- that cyber attack got a lot of attention. We don't actually expect it to pose any material disruption to our business.\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nThank you. I'll pass it on.\n\nOperator\n\nThe next question comes from Pablo Zuanic with Cantor Fitzgerald. Please go ahead.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nMorning. Just questions regarding SunStream. So if you're going to expand, please, on the asset writedown. I mean, was this just related to one specific credit or was it just an adjustment for the portfolio as a whole? If you can give more color there? And I don't know if you disclosed this, but can you talk in more detail about the book? I know you mentioned some of the companies there but is this portfolio very concentrated, say, on Parallel? So that's one question.\n\nAnd then the second one, I think you mentioned that if some of these companies default, you may be able to take over the assets or take equity in the company. Just remind me of the regulatory side of things if you do that, right, because Sundial is Nasdaq-listed. Can SunStream actually owned U.S. plant touching assets? Thanks.\n\nZach George -- Chief Executive Officer\n\nSure. So, Pablo, because a number of these borrowers are private and we have confidentially obligations and we haven't given the broad detail on the individual loans themselves, wo we've prepared a no-names revenue waterfall in our investor presentation, so we'd be happy to walk you through that. In terms of the IFRS fair value assessment, that's something that we apply to all assets, including credit assets every quarter and we try to take the most conservative approach possible. Certainly we've seen an increase in the risk free rate, which feeds into the discount rate for all of our assets.\n\nThere have been some positive changes, which would actually improve value. Plus you have the contribution of interest income that nets against any write downs. So this is not something that we expect to continue in this magnitude sequentially or indefinitely for sure, but was something that was prudent that we need to do. And this will be similar to any investments or exposure that most of your coverage universe has in cannabis would have been subject to fair value adjustments over the last several quarters.\n\nAnd you're seeing that with Sundial as well. In terms of the second question, I don't want to get too deep into this, but I know that you're well aware of structural means of actually having capital exposure to U.S. single-state and multi-state operators without engaging directly in plant touching behavior activities. And so should an opportunity like that arise and become concrete, we will certainly be forthcoming with the structural details of how any such transaction would work.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nRight. But just another point. I mean, if I may follow up. Given the tough conditions of the market over there, right, and the difficulty for a lot of these companies to get access to capital, I mean, when this be an opportunity for you guys to be more aggressive on the equity side of things more than on the debt side? I mean, what am I missing something there? Meaning, sure, people that don't want to get diluted, they would rather borrow from you.\n\nBut you're saying you don't want to expand the book because of the quality there. But so if those companies need capital, I don't want to make it sound like you're a vulture fund here, but this would be an opportunity for you to take care of the stakes. Not necessarily convert the debt into equity, but just putting new money where that will make sense.\n\nZach George -- Chief Executive Officer\n\nYeah. Look, that's -- Pablo, that's exactly the question that would be on the table, but I would put it in the following terms. So if you think about equity performance across North American cannabis, it's been nothing short of horrific. You have most equities down 70% to 90% over the last year, and that's almost without exception.\n\nSo if you think about the modest non-cash impairments that we've put up on credit, they really pale in comparison to the broader equity performance. When you have a situation where any given hypothetical credit goes into a restructuring and may default and not be able to satisfy its obligations, and you would you would potentially face the acquisition of that credit, there's a lot of question as to what form new capital investment should take. And it may, as you suggest, be equity. But you're suggesting that somehow we're not being aggressive or proactive based on the decision as to whether it was going to be credit, or preferred or some other instrument, I don't think that's the right measure.\n\nI think that we have sufficient capital in a market that is short capital in a very distinct form. And so to the extent that that becomes a prudent opportunity for us to enter the U.S. market, we will execute on it. But I don't think that the bright line measure on it on sort of our level of aggressiveness or interest will be reflected in a decision as to whether the next dollar investment is done in the form of equity or debt.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nOK. And just to follow up, so regarding the $463 million you've committed, Canadian, of course. Just remind us. So you've contributed the money to SunStream, and that is the bulk of SunStream.\n\nSo -- but then you share the profits and the fees and the interest with the SAF Group. So I'm just trying to understand what does SAF bring in to the table here, why are they taking apparently such a disproportionate cut to the earnings when they are pretty much putting down no capital down?\n\nZach George -- Chief Executive Officer\n\nYeah. Good question. Pablo, I've answered this question for you two or three different times. So we are co-manager, non-controller, co-manager of the portfolio with SAF.\n\nSo SAF is a top alternative investment firm based in Western Canada. And in partnering with them, we gain access to analytic and back office expertise that we would otherwise have to build a pretty substantial team that would involve significant cost organically. So in terms of your comment around disproportionate share of returns, that's simply not true. We are the other half of the co-management team and so we receive basically a rebate on what is a very market-based management fee.\n\nAnd I know there's been potentially some confusion about who has -- who the actual LP capital base is attributed to, but that would be Sundial. So there's no sharing of the actual capital base with the co-manager of the fund.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nGot it. I don't want to be critical, I mean, in this open forum, right. But I just find that there's other people that have taken the risk and put money down in the industry, whether it's the REITS or somewhere in new IPOs we've seen or BDCs. And they didn't need the help or another partner for this analytics.\n\nI'm just -- again, I'm not trying to be negative here, but I'm just trying to understand. You have all these billion dollar on the balance sheet, you have the 463 that you put in here, but you still need the help from someone else and where there's been a lot of other companies that have been able to do this on their own and apparently with similar or even better results.\n\nZach George -- Chief Executive Officer\n\nYeah. So, Pablo, I think the -- when you look at the IPOs that have occurred and the other financing vehicles in the space, number one, I would just remind you that we have the largest Canadian funded credit portfolio in the cannabis space. Number two, a number of those IPOs which came out, they're now trading in the B2C realm and elsewhere. They're trading at a meaningful discount to book, which means that their access to capital is meaningfully restricted.\n\nAnd so -- and we're also keenly aware of the quality of credit and where we are in the cycle when it comes to U.S. opportunities. So I think you'll see those results from those financing vehicles really start to show in the coming quarters, but not getting into that. I'm just -- I'm not sure why having a partner is somehow a reason for criticism.\n\nBut clearly, that's the line of questioning that you're on. So happy to get into the track record of our partners and the benefits we see here or off line.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nThat's fine. Thank you. And one last one, if I may. Just on the $100 million credit portfolio for Canada, can you break that down? How much -- is that heavily retail or is it mostly producers? Just a little more color there.\n\nThank you.\n\nZach George -- Chief Executive Officer\n\nYeah. So that credit exposure would include the both Zenabis, a number of other small credits that we have out to select retailers and the small equity exposure we have in Canada as well.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nThank you.\n\nOperator\n\nThis concludes the question-and-answer session. I would like to turn the conference back over to Zach George for any closing remarks.\n\nZach George -- Chief Executive Officer\n\nThanks, operator, and thanks to everyone for joining us today. We really look forward to updating you on our progress in the near future. Thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nZach George -- Chief Executive Officer\n\nJim Keough -- Chief Financial Officer\n\nTank Vander -- President, Liquor Retail\n\nAndrew Stordeur -- President and Chief Operating Officer\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nShaan Mir -- Canaccord Genuity -- Analyst\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nMore SNDL analysis\n\nAll earnings call transcripts"
}