{
  "companyName": "SkyWater Technology, Inc.",
  "companyTicker": "SKYT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/skywater-technology-inc-skyt-q2-2022-earnings-call/",
  "content": "SkyWater Technology, Inc. (SKYT -2.07%)\nQ2 2022 Earnings Call\nAug 15, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, good afternoon. My name is Abbie, and I will be your conference operator today. At this time, I would like to welcome everyone to the SkyWater Technology second quarter 2020 financial results conference call. Today's conference is being recorded [Operator instructions] Thank you.\n\nAnd I will now turn the conference over to Claire McAdams, investor relations for SkyWater. Ms. McAdams, you may begin your conference.\n\nClaire McAdams -- Investor Relations\n\nGood afternoon, and welcome to SkyWater's second quarter fiscal 2022 conference call. With me on the call today from SkyWater are Tom Sonderman, president and chief executive officer; and Steve Manko, chief financial officer. I'd like to remind you that our call is being webcast live on SkyWater's investor relations website at ir.skywatertechnology.com. The webcast will be available for replay shortly after the call concludes.\n\nOn our IR website, we also have posted an investor slide presentation to accompany today's call. During the call, any statements made about our future financial results and business are forward-looking statements. These forward-looking statements are subject to risks and uncertainties that could cause our actual results to differ materially. For a discussion of these risks and uncertainties, please refer to our filings with the Securities and Exchange Commission, including our earnings release filed on Form 8-K today and our fiscal 2021 10-K filed on March 10.\n\nAll forward-looking statements are made as of today, and we assume no obligation to update any such statements. During this call, we will discuss non-GAAP financial measures. You can find a reconciliation of these non-GAAP financial measures to GAAP financial measures in our earnings release, as well as in our Q2 earnings presentation, both of which are available on our investor relations website. With that, I'll turn the call over to Tom.\n\nTom Sonderman -- President and Chief Executive Officer\n\nThank you, Claire, and good afternoon to everyone on the call. Today, we are pleased to report Q2 revenue of over $47 million. With total revenue up 15% year over year, wafer services revenue increased 23%, reflecting the significantly improved long-term pricing agreement secured at the end of Q1. ATS revenue grew 11%.\n\nHowever, net of tool sales, ATS revenues actually grew 20%, reflecting the momentum we are gaining with several key customers. With our quarterly revenue run rate now firmly established above the mid-$40 million level, our gross margin performance in Q2 demonstrates that we have now surpassed the breakeven threshold and that incremental revenue growth will bring significant flow-through to margins and profitability as we forecast sequential revenue growth in the forthcoming quarters. As promised last quarter, we have raised the revenue baseline from which to grow. After adjusting for the pooling of revenue in Q1 as a result of the new pricing agreement with our largest customer, we are now delivering on sequential improvements in revenue, both for the recently completed Q2, as well as expected growth through the forthcoming quarters.\n\nIn fact, we are seeing sequential quarterly growth with nearly every key ATS customer as we progress through the year. As a result, we are well on track to achieve revenue growth in 2022 approaching our long-term annual growth target of 25%. We are pleased with the progress made in Q2 to show sequential improvement and a revenue pipeline, increased fab efficiency and output, significant improvements to gross margin and EBITDA improving once again, closing in on breakeven at a negative $1.6 million for the quarter. The big news of the last quarter, however, has been the multitude of important announcements that, together, provide a strong foundation for consistent revenue growth and firmly established SkyWater as a critical player in the future of our country's semiconductor supply.\n\nThese announcements validate the momentum we are building in each of our strategic growth areas, which I will now discuss in more detail. With the signing of the CHIPS Act, our recent announcement of our partnership with Purdue University and the state of Indiana to build a $1.8 billion advanced semiconductor manufacturing fab will now move forward aggressively. SkyWater plays a crucial and strategic role in the onshoring of domestic semiconductor supply. Last week, I was honored to attend the signing ceremony of the CHIPS and Science Act at the White House.\n\nWe applaud Congress and the president for signing this historic bill into law which will bolster critical domestic semiconductor infrastructure for decades to come. SkyWater's Indiana facility will be an advanced, next-generation fab that will enable mass customization of highly innovative solutions through the use of intelligent automation that seamlessly combines R&D with high-volume wafer production. This fab will create more U.S. innovation-derived semiconductor capability and capacity for our country, and it will become the blueprint that will define how fabs are built and operated for decades to come.\n\nOur aim is to address the ongoing worldwide chip shortage to contribute to the reshoring of semiconductor manufacturing to position America to regain the leading edge and advanced technologies and to develop crucially needed technology talent while also creating a large number of semiconductor-centered jobs. This $1.8 billion investment will be made from a combination of federal funding via CHIPS, state funding, and industry partnership network and SkyWater. The ability to make this large investment will be the result of SkyWater working hand in hand with Purdue and the state of Indiana to successfully obtain federal incentives in the form of grants as defined in the CHIPS Act. These funds are designed to offset the high cost of building and operating manufacturing facilities in the U.S.\n\nand mere incentives that have been commonplace in foreign countries for decades. Specific contributions from each party will be determined as the process unfolds. As to when we expect to break ground, the process will take time. Now that the legislation has been signed into law, we anticipate funds will be awarded within the next several quarters.\n\nWe would then break ground as soon as possible after that, pending successful commercial partnerships and the associated contributions and funding commitments required to move the project forward. We anticipate our Purdue fab to be a major driver of continued revenue growth in the second half of the decade. As a reminder, the $52 billion CHIPS Act is spread over a five-year period and is divided into several programs, which, together, include funds allocated to domestic fabrication, assembly, testing, and advanced packaging, as well as funding devoted to the DOD and the Commerce Department for research and development programs, including public/private partnerships to conduct advanced semiconductor manufacturing R&D. Through our collaboration with Purdue, we are encouraged that SkyWater will be a major beneficiary of this important legislation.\n\nIt is well understood that SkyWater is relatively unique within the domestic semiconductor ecosystem and that we are a candidate for potential funding from all of the programs enacted in this legislation. We also see opportunities to benefit from the CHIPS Act funding at all of our sites, specifically Minnesota, Florida, and now Indiana. Since our last call, we have made notable progress regarding our rad-hard program that will result in increased rad-hard revenues, driving incremental quarter-on-quarter growth for SkyWater and the third and fourth quarters of this year. In Q2, we successfully completed the base prototype phase with the Department of Defense and a $27 million option from the total $170 million Phase 1 program has been funded and launched.\n\nRevenues from this award will be a major driver of our sequential revenue growth expected to start in Q3. With $105 million recognized to date, an additional $38 million, and additional potential Phase 1 options remains open for funding and supportive continued development. Last quarter, I described the follow0on activities that we were working on to bridge the gap between the phases and advance of the highly anticipated Phase 2 award. We continue to expect the award of Phase 2 productization and qualification will close very soon which will further contribute to our rad-hard revenues later this year.\n\nThe important rad-hard progress since our last quarter's call further increases our confidence in our second-half revenue ramp, enabling our 2022 revenue objectives toward the 25% target growth level. These developments are meaningful enough that I thought I would spend a few more minutes discussing the technological and process advantages we have at SkyWater that help explain why we think this will be a major area of growth for us. There are multiple ways an IC could be radiation-hardened, and our focus is on both rad-hard by design and rad-hard by process. By incorporating both approaches, SkyWater can provide the strongest solution available, meeting the most stringent reliability requirements for the strategic rad-hard defense market.\n\nOur technology is the most advanced option available for strategic applications with a finer node size of 90 nanometers and copper interconnects, making our process superior to competitive offerings. We are also leveraging these capabilities in less stringent radiation environments, such as deep space missions, medical diagnostics, and low Earth orbit missions for defense and commercial applications. We already offer rad-tolerant readout ICs for imaging applications on a different 90-nanometer technology variant which is a market we are gaining traction and due to our unique offering, and this work offering is also a strong growth opportunity for us. We also believe our ability to support embedded field-programmable gate arrays for a rad-hard by process technology is unique and valuable as programmability is a way of expanding the applicability of our process across multiple applications.\n\nThe recently announced partnership with Mobile Semiconductor where they will provide SRAM memory compilers for our RH90 platform is another way we are making it easier for our customers to design rad-hard chips with us. While not part of our RH90 offering today, we are exploring future opportunities to incorporate MRAM and pursuing ways to leverage our unique capabilities in Florida for the rad-hard market. We look forward to continuing to report on the expansion of our overall rad-hard revenue opportunity on future earnings calls. In our strategic growth area, biohealth, SkyWater's work with Rockley Photonics, enabling their revolutionary wrist-worn biomarker sensor continues to progress toward a production ramp.\n\nTwelve consumer device and seven med tech customers are actively contracted with Rockley in various stages of evaluation and pilot production for incorporation of their advanced biosensing technology. Earlier this summer, Rockley announced it had entered the evaluation phase with one of their tier 1 wearables customers, which marked another important milestone and their road to integrating noninvasive biomarker sensing into mobile devices. As we shared in past updates, other biohealth initiatives and rapid diagnostic technologies, including our program with NanoDx, continue to progress in manufacturing readiness, and this remains an area with significant growth opportunity for SkyWater. Next, our Florida operation continues to make good progress in all three elements of our heterogeneous integration technology road map.\n\nLast quarter, we reported on the first silicon milestone for our DOD-funded IBAS silicon interposer program. This continues to progress as scheduled. Phase 1 qualification lots were completed in Q2, and we expect to be communicating more in the near future about this milestone. The program has now transitioned into the next phase of refining the through-silicon via process in preparation for the qualification of this key new feature.\n\nAdditionally, our efforts to support backside redistribution layers and passive circuit device features for the interposer technology will enhance our capabilities for more sophisticated multi-chip module and high-frequency solutions. Our test vehicle efforts for the Deca Technologies M-series continue to move forward as we work to secure the key supplier relationships necessary to complete the tool chain for fabricating the demonstration vehicles. Our plan continues for producing initial test vehicle data packages in early 2023. In the second quarter, we announced our license agreement with Xperi, which provides our customers access to a Adeia's ZiBond and DBI wafer bonding technologies.\n\nThis technology transfer is currently underway, and initial test articles have been produced demonstrating copper hybrid bonding capability on our cassette loading production bonding tool. We view this as a critical pillar of our heterogeneous integration technology platform and a key building block that will enable our customers to develop secure state-of-the-art 2.5 and 3D technology solutions. Finally, in our strategic growth area, power management and connectivity, we recently announced $15 million of new investment from the DOD as part of the previously announced $27 million award funding the facilitation of open-source design of SkyWater's SKY90-FD process technology in partnership with Google. Our collaboration with Google and this new round of funding from the DOD helps to create an IP pipeline and pathway to commercial volume manufacturing of this novel process technology on fully depleted SOI 90-nanometer CMOS.\n\nWe expect this FD-SOI technology to expand SkyWater's SEM, as this technology is well suited to high temperature, low voltage, low power, and RF applications. Our customer and technology partner, Applied Novel Devices, continues their technology qualification work for a highly differentiated fast switching and low loss power MOSFET. Plans are also developing to expand this architecture into higher-voltage versions of the technology for the automotive and telecom markets. Within the overall power and connectivity semiconductor market, our legacy wafer services products continue to have value and a growth path in the market with longer-term and more favorable pricing contracts secured.\n\nThis gives us a solid base of business that will keep our Minnesota factory well utilized and absorb the fixed fab costs as we seek to diversify and grow our customer portfolio with many expanding customer engagements that will be accretive to both top-line growth and rapidly improving gross margins. To summarize, our 25% growth objective incorporates three elements of revenue appreciation: meeting technology development milestones and achieving better pricing, transitioning moreover ATS technology programs to volume production, and achieving greater fab efficiency. Our incredible team made progress on all these fronts in Q2, and we still have plenty of room for continued growth as we progress through the second half of the year. While investor concerns continue to increase stemming from the current semiconductor inventory correction and overall industry softness extending to multiple end markets ahead of a global recession, it's important to differentiate SkyWater from other semiconductor companies.\n\nThis is because two-thirds of our revenue comes from R&D budgets. The majority of the remaining one-third is now secure through long-term agreements. So depending on the severity of a global recession, which could certainly affect our customers' R&D budgets, it is important to recognize that through most cycles, the R&D funding for strategic growth areas tend to be relatively buffered from major economic swings. Furthermore, our strategic growth areas, such as biohealth, extreme environment microelectronics, advanced computing, power, and IoT are continuing to see strong levels of investment.\n\nAll of this is why we remain confident in continued sequential revenue growth and gross margin expansion as we progress through the forthcoming quarters. For 2022, our significant progress and revenue growth in the first half puts us well on the path to achieve revenue growth approaching our long-term goal of 25%. This is supported by important program design wins and awards and the expected progress of our radiation-hardened and biohealth platforms moving toward productization. Furthermore, now that we have established positive gross margins in the mid $40 million revenue range as we add these incremental revenue drivers, we expect to see very significant gross margin flow-through, and I look forward to continuing to report on our progress toward our near-term and long-term gross margin objectives in the forthcoming quarters.\n\nI will now turn the call over to Steve for more information on SkyWater's financial and operational performance in the second quarter.\n\nSteve Manko -- Chief Financial Officer\n\nThank you, Tom. Total revenue for the second quarter of 2022 was $47.4 million, which was slightly down from Q1 and up 15% from the second quarter of last year. Advanced technology services revenue was $29.8 million, and wafer services revenue was $17.6 million. There are a couple of important adjustments to make when comparing our revenue performance to prior periods.\n\nFirst, I will remind you that wafer services revenue in the first quarter of 2022 included an accounting adjustment of $8.2 million for work in process inventory being recognized as revenue pursuant to the new frame agreement with Infineon. This new ingredient included increased pricing, as well as other improved contract terms, that make all purchase orders non-cancelable, and which enables SkyWater to recognize revenue as the wafers move through the manufacturing process. Altogether, the more favorable contract terms are resulting in both higher levels of revenue, as well as greater predictability of revenue from this historical customer. So while the accounting adjustment in Q1 effectively pulled in $8 million of WIP revenue, or wafer services revenue in Q2 is a real-time reflection of current pricing and efficiency as these wafers move through the fab.\n\nThe comparable level of wafer services revenue was therefore 32% higher than Q1 and 23% higher than Q2 last year. Moving now to ATS revenues. The nearly $30 million recognized in the quarter represents an 11% increase year over year and a 12% increase over Q1 2022. After excluding tool revenues for each period, ATS growth in Q2 was 20% year over year and 15% quarter over quarter and effectively backfield all of the decline in wafer services revenue, which was expected due to the Q1 accounting adjustment.\n\nYear to date, increased revenue levels in both ATS and wafer services is tracking well toward our revenue growth targets for 2022. As we continue to ramp production and win new customers and programs, the higher level of legacy wafer services revenues provides a new higher base from which to grow as we continue to add more customers and programs. We added five new ATS program wins in Q2, and we now have a total of seven wafer services customers generating revenue in the current quarter. Importantly, it is incremental and more profitable customer programs above this higher revenue base are resulting in significant flow-through the gross profit.\n\nGAAP gross profit turned positive in the quarter, just over $2 million or 4.4% of revenues. On a non-GAAP basis, which adjust for the impact of episodic tool sales, equity-based compensation and Florida start-up costs gross margin improved to 5.6%, which was significantly higher than Q1 non-GAAP. The majority of the sequential improvement and gross margin was a result of more favorable revenue mix, given an ATS revenue increased to 63% of sales. We also achieved a higher level of overall ATS wafer moves in quarter, where we are able to find opportunities to push more ATS R&D wafers through the fab in order to achieve better utilization and margin performance.\n\nWe are also seeing a significant improvement in line balancing, which makes moving wafers through the fab steadier and more predictable. Now that we are firmly above the mid $40 million revenue level, all of these tailwinds are helping drive incremental gross profit flow-through of more than 50%. Certain headwinds persist, however, and we continue to see inflationary costs on the rise impacting both labor and materials. Without these higher costs, our gross margin would have been even higher in Q2.\n\nOne operational challenge that has materially improved since last quarter is labor turnover. We are now seeing historically low levels of turnover, certainly lower than anything we have seen since our IPO, which is helping us improve fab efficiency and cycle times. Also worth noting is that in Q3 to date, we are now very close to our full Minnesota fab headcount target, which means we will see fewer additional labor costs that will need to be added above our expected Q3 run rate as we grow revenues from this new hire base in the mid to high $40 million range. As you dig further into our gross margin profile and considering the high levels of incremental margin we expect to achieve as we begin the revenue ramp for several ATS programs, it may be helpful to look at our cost structure in three major components.\n\nFirst, we have the wafer services business, which accounts for the highest amount of fab utilization that absorbs the majority of fixed costs of the fab that will generate very little margin, given our current customer mix. Our ATS programs, on the other hand, are quite profitable. As we move more and more ATS wafers through the fab, that business contributes an increasing amount of gross profit dollars. While ATS R&D wafer volumes are relatively low compared to the overall fab output, they generate far more revenue per wafer, which will result in significant gross margin accretion, as we ramp major ATS programs such as rad-hard, as well as emerging biohealth and high-performance computing applications.\n\nThe third component of our cost structure relates to the investment we are making for the long-term growth of the company as we build out our rad-hard capabilities in Minnesota and heterogeneous integration capabilities in Florida. Both programs are expected to be significant drivers of future revenue growth for SkyWater, but they are currently adding a significant amount of unabsorbed fixed costs. In the second quarter of 2022, depreciation relating to the rad-hard program was $1.5 million, and we incurred $2.3 million in cost of revenue for Florida, excluding tool costs. Additionally, as a reminder, our acquisition accounting-related depreciation of about $4 million per quarter will phase out beginning in early 2024.\n\nSo as you consider these three components of our cost structure, wafer services keeping the fab full, ETS adding significant accretion to margin as we increase the volume of R&D wafers moving through the fab, and about $8 million per quarter of cost that will either phase out or become absorbed as we grow these programs in the next few years. You can see how we can quickly ramp gross margins toward our long-term targets. For the remainder of 2022, we will most likely be limited to single-digit gross margins, given the continued inflationary headwinds, our ramp to full headcount in Q3 in the expected margin profile from the early stages of the rad-hard revenue ramp, we see 2023 as the year where we can decisively begin to show steady increases above the 10% level. Moving to operating expenses, which were down a bit sequentially.\n\nGAAP operating expenses were $13.2 million, compared to $14 million in Q1. And on a non-GAAP basis, operating expenses were $11.5 million, compared to $11.8 million in Q1. Non-GAAP R&D remained relatively consistent at $2.2 million, while non-GAAP SG&A declined to $9.3 million. Adjusted EBITDA was a loss of $1.6 million, improving from a loss of $4.8 million in the first quarter as a result of higher gross margin relatively consistent operating expenses.\n\nWith continued revenue growth expected through the remaining quarters of 2022, with relatively minimal new fixed cost additions, we expect to begin generating positive EBITDA. Interest expense was $1 million in the quarter and with no tax benefit, the GAAP net loss was $0.32 per share, and then non-GAAP net loss was $0.27 per share. Now let's turn to the balance sheet. We ended the quarter with $11 million in cash and cash equivalents.\n\nTotal debt outstanding was $78 million as of July 3, including $44 million on our revolver and $34 million for our variable interest entities, excluding unamortized debt issuance cost. As you update your SkyWater models, the following is some additional color for the various components of our P&L for the remainder of fiscal 2022. Quarterly research and development expenses are anticipated in the $2.2 million to $2.4 million range, excluding stock-based compensation. Quarterly SG&A expenses are expected to be approximately $10 million to $10.4 million, excluding stock-based compensation.\n\nWe anticipate annual stock-based compensation to be approximately $9 million for fiscal 2022. Total depreciation for the year is expected to be approximately $26 million to $28 million, of which $6 million to $7 million is related to rad-hard program, and approximately $50 million is associated with acquisition purchased accounting. In cost of revenues associated with our Florida operations, we expect approximately $200,000 in second-half start-up costs after $560,000 in the first half. In total, heterogeneous integration investments and cost of revenue will continue to average approximately $2.5 million per quarter.\n\nWe expect neutral and no benefit from our tax assets in 2022 With that, I will turn the call back to Claire and welcome your questions on SkyWater.\n\nClaire McAdams -- Investor Relations\n\nThank you, Steve. Our upcoming investor activities include the Needham virtual semiconductor and semicap conference on August 24 and the Jefferies semiconductor conference in Chicago on August 30 and 31. Please visit the Investor Relations section of our website for other upcoming presentations. Operator, please open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] And we will take our first question from Raji Gill with Needham & Company. Your line is open.\n\nRaji Gill -- Needham and Company -- Analyst\n\nGreat. Thanks, and congratulations on all the momentum and being a real component of the success. That is great to hear. So just a question, Steve, on the gross margins.\n\nYou talked about now that the revenue is over the breakeven point, you will start to see some operating leverage. And then you mentioned that the gross profit falls through, I guess under normal life circumstances would be about 50% incremental gross profit fall through. As I just wanted to get some clarity on kind of the near term kind of given margin still being kind of in the single-digit margin range. You talk a lot about some of the -- at least elaborate further on what are some of the near-term headwinds.\n\nAnd as you go into 2023, as you mentioned, that you will be above -- kind of hopefully above 10% gross margin. Do you think those near-term headwinds are going to abate on the cost side, and then you will start to see the higher volume, plus the higher utilization, start to kick in, and you start to really see the margin leverage in 2023? Just trying to get some clarity on gross margin.\n\nSteve Manko -- Chief Financial Officer\n\nYes. Good afternoon, and thanks for the question. We are pleased with where we are on achieving, you know, the revenue levels and in the mid to high-40s. We talked about that on our previous call saying once we obtained that you would start to see some positive gross margin for the company.\n\nWe also believe that we have some good flow-through that could come in the future as we continue to grow revenue. It is important to see, not only is it the incremental revenue growth, but also the mix of revenue that comes through. We are getting back to our more normal model where ATS revenue was 63% of our overall revenue for the quarter. That is going to be a driver of any gross margin flow through that comes with that though on staying within the single digits for the rest of 2022.\n\nGiven the impact that are still coming through from the inflationary cost, the inflationary costs are probably about 6% to 8% of our overall revenue. So we are being impacted by those and planning on those staying with us for the course of 2022. And we are still continuing make those investments for the long term in the company. We talked about every quarter the importance of the rad-hard technology and heterogeneous integration and afforded that we are doing both of those doing about continued investment each quarter, the depreciation from the rad-hard, and the cost of revenue from Florida, $4 million to $5 million a quarter.\n\nSo with those headwinds that we expect to remain with us, that is why we are staying good gross margin flow-through will be on the horizon, but we will keep investing and dealing with the inflationary cost over the course of 2022.\n\nRaji Gill -- Needham and Company -- Analyst\n\nAppreciate that. And Tom, on the CHIPS Act, and congratulations on your role in pushing that, specifically for the Indiana fab update, can you give us some sense of what the total capex of the project could be? How much it will be split across the federal government, the state government, you guys, customer prepayments, if at all, and how to think about the potential revenue, how many wafers should come out of that? Any kind of quantifiable or at least some sense of how big the opportunity to be?\n\nTom Sonderman -- President and Chief Executive Officer\n\nYes. So all very good questions. I think very premature in terms of the clarity that we can really give. What we have said is that it is a $1.8 billion project.\n\nObviously, that will be composed of building the facility and then putting the necessary equipment in the fab. The model in terms of the federal investment, the state investment, and industry investment is still to be determined by the Department of Commerce. We are obviously all anxious to see what those rules become, but our goal right now is to work with the state of Indiana and Purdue to bring our approach to our customer base. I can say the enthusiasm for what we are bringing in how we are doing it, the fact that we are stationed at Purdue, their commitment to developing semiconductor curriculum, semiconductor engineers that feed right into our ecosystem, I think has a lot of excitement.\n\nAnd as this year on folds, I think we will be able to provide more clarity in terms of exactly how the project will unfold. But the key, of course, was getting the bill passed. I think, SkyWater for our company our size, we were able to really differentiate the approach we are taking. And as I said in my remarks, we are going to not only go after the dollars tied to building new facilities, but the dollars tied to innovation, the $12 billion for R&D-related innovation, the $20 billion a year over 10 years that will be tied to investment, not through the university system, as we build our national semiconductor technology road map these are all areas that SkyWater will participate in.\n\nAnd again, I think there will be revenue tied to what we execute here in Minnesota and Florida because we are going to go after funding for these facilities as well. I see that being more near term. And again, as I said, the second half of the decade, I think you will start seeing incremental revenue come from that Purdue project.\n\nRaji Gill -- Needham and Company -- Analyst\n\nAnd just last question from me, and I will step back in the queue. So the significant progress on the RH90 program, you talked about Phase 1 $27 million has been funded. And then you mentioned kind of Phase 2 productization qualification, and that should start to hit the model and help you hit the 25% target throughout the year. Can you maybe elaborate on the timing of that and the components of that Phase 2? How should we think about the breakdown of Phase 2 as we kind of look into Q3 and Q4? Thank you.\n\nTom Sonderman -- President and Chief Executive Officer\n\nAgain, the option component was to really build out the design ecosystem. We have already announced the partnership with Google to bring the RH90 platform to the commercial market. So that will be incremental, we will start seeing that revenue flow, beginning this quarter, there will be other announcements that will be tied to the remainder of that $28 million -- $27 million that are forthcoming. But again, that is essentially building out the design capabilities that will leverage the technology.\n\nThe productization and qualification or Phase 2, we expect to also be awarded this quarter that will be tied to investment for scale and capability, yield, capabilities, etc. So that we can prepare to bring to actual products as '23 and '24 unfold where the idea that you actually get into system designs as you exit '24 going into '25. So it is the next phase of this program, P&Q means you are preparing to go into privatization. And the qualification, of course, is dependent on what application if it is a new product that will move faster than a replacement product, but all of it is really geared for the next two years.\n\nIt'll drive incremental ATS revenue for us as we invest further with the government to stand up the capability. And then as we said, you will start seeing actual product-related revenues as you get under the latter part of 2024 and beyond. And once you get designed in, your designed in for a good five- to 10-year period for all these programs.\n\nOperator\n\nWe will take our next question from Harsh Kumar with Piper Sandler. Your line is open.\n\nMatt Farrell -- Piper Sandler -- Analyst\n\nHi, everyone. This is Matt Farrell on for Harsh. My first question is on the long-term growth rate of 25% and the recent momentum behind with the CHIPS Act and the new fab in Indiana. Does the further clarity on the CHIPS Act provide an upward bias on the growth rate in the future? And I guess how should we be thinking about the CHIPS Act and the new Indiana fabs impact on the 25% long-term growth?\n\nSteve Manko -- Chief Financial Officer\n\nYes. So none of the 25% commitments that we have talked about has anything to do with CHIPS. So as of today, they are completely independent. I would see CHIPS as being accretive to what we have been anticipating with -- our overall plan is obviously reduces the risk and the out-years because you have got a lot of new investment that is going to come in to SkyWater for capability and capacity, Purdue being one example.\n\nAnd again, ATS revenues are a key driver of SkyWater, and a lot of the dollars tied to CHIPS are for innovation. That innovation not only originates in the U.S., but it has to stay in the U.S. The IP has to stay in the U.S. The end products need to be manufactured in the U.S.\n\nAll that plays directly to the SkyWater model. But in no way should you think that our commitment about 25% ever had anything to do with CHIPS. We were pushing heavily to get CHIPS passed, but I see that just being an overall risk reduction in terms of our ability to continue to drive that level of growth as this decade unfolds.\n\nMatt Farrell -- Piper Sandler -- Analyst\n\nGreat. And maybe one more on -- I know it has only been a short period of time. But has customer conversation really changed in a meaningful way, again, now that we have some more visibility on the recent passage of the CHIPS Act? And can you kind of help us understand what it does on your end in any way when you go out to talk to customers, whether it is about assurance or supplier or the ability to work in a more meaningful way? Thank you.\n\nTom Sonderman -- President and Chief Executive Officer\n\nYes. So I would say, absolutely, conversations have changed, since literally, not just it got signed last week, but leading through the passage in Congress. And the reason, again, is because it became real. And what I would say is you are seeing companies begin to look at how can we take advantage of this, and I'm talking about customers in that particular regard.\n\nAnd if you look at our DOD partnership, the DOD said, \"We want to stand up a new technology. We are going to partner with SkyWater. We are going to invest in capability. When that capability comes online, we are going to apply that to our core suppliers, our prime suppliers.\n\nThey are going to get their solutions fabricated at SkyWater, and we are going to understand completely how that supply chain works from design all the way through final product.\" That exact model is what we are promoting with other customers and other verticals, and I can say the enthusiasm is as high as I have ever seen it. I don't think any major entity wants to be left without control their supply chain, and all of them are looking at new opportunities, new ways to achieve that, whether it is automotive, bio, you just go down the line, everyone is looking for a new formula. And our partnership approach, our collaborative approach is highly attractive, and we are seeing a lot of interest. And our goal, of course, is to get those customers formed into what we call a customer network.\n\nThey will provide the industry source of funding to complement what Purdue and the state of Indiana invest, along with the federal government for in the Purdue example.\n\nMatt Farrell -- Piper Sandler -- Analyst\n\nAwesome. Thank you so much.\n\nTom Sonderman -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nAnd we will take our next question from Krish Sankar with Cowen and Company. Your line is open.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nHi. Thanks for taking my question, and congrats on the good results. First question for Tom. Of the 25% revenue growth this year, how should we think about ATS and wafer service? And also, can you give us some color on how much of the growth is driven by volume versus pricing? And then I have a follow-up.\n\nTom Sonderman -- President and Chief Executive Officer\n\nYes. Great questions, and good to hear from you. The way to think of it is it is really higher ASPs, higher productivity, having more programs flow through our funnel. As we announced a lot of new customers last year, a lot of those customers continue to progress through the funnel.\n\nWe see the ATS two wafer services mixed in around the two-thirds, one-third, that is the model that we are kind of trying to adhere to on a quarter-by-quarter basis. I think this second half of the year, we now have the RH90 expansion that we talked about that you are going to start seeing incremental capability, incremental growth on. And then of course, we have Florida where we have six different active customer programs each at different stages. The Florida facility continues to ramp we are looking at, expanding our shift coverage and all those elements together is what is allowing us to stick with the two-thirds, one-third but also adhere to the 25% growth.\n\nAnd the fact that we have such a strong pipeline of ATS capabilities customers, coupled with a strong desire of all those customers to move as quickly as possible. As I said in my remarks, when you are in a kind of a down cycle potentially in the industry, that is when people really accelerate R&D investment in our industry, and we are seeing that exact phenomena. There is a lot of customers who keep saying, \"How can we move faster?\" The fact that we are getting better productivity out of the fab, we are at our target headcount, these are all things that are allowing us to incrementally drive toward that 25% level on an ongoing basis.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Thanks for that. Another quick question for Steve, I understand. It is still too early to figure out the funding dynamics for the Indiana fab.\n\nHow should we think about capex in the next couple of years?\n\nSteve Manko -- Chief Financial Officer\n\nYes. Capex for SkyWater for the next couple of years will be like we have talked about previously, I don't think that CHIPS announcement will change what we are trying to do in our investments for Minnesota and Florida. So anything that we would do from CHIPS funding and the potential fab that we announced in Indiana would just be incremental. And on top of that, we are still looking at our core business and our core business we want to invest in Florida and Minnesota with the opportunities that are at hand.\n\nSo again, this doesn't change our plans for investing in our core business. This would just be incremental investment on top of that that we would partnership with the various states, federal governments, and commercial partners as well to fund.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot you. But what seems -- is there a way to think about, as a percentage of this, what capex will be in next couple of years on the core business?\n\nTom Sonderman -- President and Chief Executive Officer\n\nYeah. The capex for the core business would remain the same that we talked about, probably between the $10 million to $20 million range on an annual basis, in addition to customer-funded capex on top of that.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Got it. Thanks a lot, Tom. Thanks, Steve, and congrats on the good results.\n\nTom Sonderman -- President and Chief Executive Officer\n\nThank you.\n\nSteve Manko -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nAnd we will take our next question from Natalia Winkler with Jefferies. Your line is open.\n\nNatalia Winkler -- Jefferies -- Analyst\n\nHi, Tom, Steve. Thank you for taking my question, and congrats on strong results. So the first one I had was about your ability to pass on the inflationary cost. And, Steve, I think you mentioned 60% sort of as a headwind.\n\nWould mind kind of explaining, diving deep a little bit into that and just kind of walking us through your ability to pass those costs? I appreciate some of that contract has been increased. The terms of the contracts have been improved for you guys. But outside of that contract with a main customer, how does it look for the rest of the customers?\n\nSteve Manko -- Chief Financial Officer\n\nSure. So the buildup was consistent with what we talked about. Starting in the fourth quarter, we were relatively lightly impacted by the inflationary costs until we saw that coming through in the fourth quarter. As we talked about, those continued in Q1, and we expect those remain for the remainder of 2022.\n\nReally, those costs relate to labor and inflation, attracting the right talent at all levels in all departments of the organization. No matter -- whether you are in finance or working in the manufacturing process, labor rates are going up. So that is one component of it. We are also seeing like we talked about previously, the freight and shipping costs have gone up significantly, as well as the chemicals and gases that are used to supply our ongoing manufacturing process.\n\nWith all the demand that is out there for tooling and all the growth that is taking place, we are also seeing our suppliers that come in and our equipment manufacturers sending in their technicians. They are having the same struggles as we are finding the right talent and paying higher prices to keep them as well. So we are seeing higher costs in our equipment maintenance component as well. So those are the key costs that have increased over the past couple of quarters, we would expect to be with us.\n\nWe will do our best to pass those on to the customers as appropriate. We want to be fairly compensated for the services that we provide. Our services are in high demand. And as we deliver those services, routinely, and on time to our customers, we feel that we should be adequately compensated for those.\n\nSo it is more so on a customer-by-customer basis that we have those discussions with our customers.\n\nTom Sonderman -- President and Chief Executive Officer\n\nAnd we have increased prices, not just for our largest customer in wafer services, but also with many of our ATS customers as well. So it has been kind of a universal strategy, as contracts come up for renewal, that we are implementing these price increases.\n\nNatalia Winkler -- Jefferies -- Analyst\n\nUnderstood. That is very helpful. And then the second follow-up I had was just around the Ugandan silicon program. Do you guys have any update for us on this? And then just to confirm that new facility with Purdue, would that also have that platform enabled? Or is that going to be kind of mostly driving in your existing clubs?\n\nTom Sonderman -- President and Chief Executive Officer\n\nYeah, great question. So we do continue to have multiple engagements with customers on -- again on silicon, nothing that we can report publicly. As far as the Purdue fab, that would certainly be an option, would be to stand up a 200-millimeter GaN line within that facility. There are many different scenarios we are looking at with the Purdue facility, as well as what we are doing here in Minnesota and in Florida.\n\nAnd now that again CHIPS has been passed, we can put together an integrated capacity and capability expansion plan, understand how the relative grants, etc., property tax, or tax offsets, etc., these are all things that we can begin to put into the formula for how we build out our capabilities over time. And the other thing that, again, makes us very unique is that we are able to go after these innovation dollars, and the innovation dollars have constraints on them in terms of where those technologies can ultimately end up. And again, the key is protecting IP and having a source to fabricate those in the U.S. And that is really going to be part of our strategy.\n\nWhat we put in Purdue what we put in any expansion will be tied to what our customers need to ensure that their innovation ideas can get to market as rapidly as possible.\n\nNatalia Winkler -- Jefferies -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nClaire McAdams -- Investor Relations\n\nTom Sonderman -- President and Chief Executive Officer\n\nSteve Manko -- Chief Financial Officer\n\nRaji Gill -- Needham and Company -- Analyst\n\nMatt Farrell -- Piper Sandler -- Analyst\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nNatalia Winkler -- Jefferies -- Analyst\n\nMore SKYT analysis\n\nAll earnings call transcripts"
}