{
  "companyName": "Upstart Holdings, Inc.",
  "companyTicker": "UPST",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/upstart-holdings-inc-upst-q3-2022-earnings-call-tr/",
  "content": "Upstart Holdings, Inc. (UPST 0.46%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day and welcome to the Upstart third quarter 2022 earnings call. Today's conference is being recorded. At this time, I would like to turn the conference over to Mr. Jason Schmidt, vice president of investor relations.\n\nPlease go ahead, sir.\n\nJason Schmidt -- Head of Investor Relations\n\nGood afternoon and thank you for joining us on today's conference call to discuss Upstart's third quarter 2022 financial results. With us on today's call are Dave Girouard, Upstart's chief executive officer; and Sanjay Datta, our chief financial officer. Before we begin, I want to remind you that shortly after the market closed today, Upstart issued a press release announcing its third quarter 2022 financial results and published an investor relations presentation. Both are available on our investor relations website, ir.upstart.com.\n\nDuring the call, we will make forward-looking statements, such as guidance for the fourth quarter of 2022 related to our business and our plans to extend our platform in the future. These statements are based on our current expectations and information available as of today and are subject to a variety of risks uncertainties and assumptions. Actual results may differ materially as a result of various risk factors that have been described in our filings with the SEC. As a result, we caution against placing undue reliance on these forward-looking statements.\n\nWe assume no obligation to update any forward-looking statements as a result of new information or future events, except as required by law. In addition, during today's call, unless otherwise stated, references to our results are provided as non-GAAP financial measures and are reconciled to our GAAP results, which can be found in the earnings release and supplemental tables. To ensure that we address as many analysts questions as possible during the call, we request that you please limit yourself to one additional question and follow up. Later this quarter, Upstart will be participating in Citi's 2022 FinTech conference on November 15 and Wedbush's disruptive finance conference, December 2.\n\nNow, I'd like to turn it over to Dave Girouard, CEO of Upstart.\n\nDave Girouard -- Chief Executive Officer\n\nGood afternoon, everyone. Thank you for joining us on our earnings call covering our third quarter 2022 results. I'm Dave Girouard, co-founder and CEO of Upstart. Our results in Q3 were certainly not what we wanted them to be, but I also believe they reflect the Upstart team making the right decisions in a very challenging economic environment for the long-term success of the company.\n\nOur revenue is down primarily because loan volume in our platform is down and secondarily, because credit markets are extremely cautious and even dislocated. Higher interest rates and significantly elevated risk in the economy means we're approving about 40% fewer applicants than we would have a year ago. And those approved today are seeing offers about 800 basis points higher than they would have a year ago. This accounts for the vast majority of the reduction in volume.\n\nMany of our lending partners have reduced their originations, raised their rates or both. This is generally out of an abundance of caution with respect to the economy that their Upstart-powered loan portfolios have met or exceeded expectations since the program began in 2018. But I want to be clear, contraction in lending volume in a time of rising rates and elevated consumer risk is a feature of our platform, not a bug. In fact, it's required in order to generate the returns lenders and investors expect.\n\nWhether due to an increase in expected loss rates, caution on the part of lenders or higher yield demanded by credit investors, higher interest rates and reduced volumes means that as unhappy as we are with the numbers, the system is working as intended. We're eyes wide open to the challenges of the current macro economy and determined to make the decisions that will optimize for the long-term success of Upstart. At the simplest level, we're improving our operational efficiency in the near-term so that we can continue to maximize investment in our AI platform for the long term. First and foremost, we're continually calibrating our risk models to the market.\n\nPerformance of credit is and always will be our highest priority. While we don't make predictions about the future, we've chosen to take a conservative position with respect to the direction of the economy in the coming quarters. In other words, we assume the worst is in front of us. We'll be pleasantly surprised if this turns out not to be the case.\n\nSecond, we're strengthening our unit economics both by increasing our revenue per loan as well as reducing marketing spend in our most expensive acquisition channels. And third, we're carefully managing our operational and fiscal plans to make sure that we're in a strong corporate footing for as long as this cycle lasts. In recognition of the reduction in loan volume in our platform, we unfortunately eliminated approximately 140 hourly positions within our loan operations team, representing about 7% of our workforce. This was disappointing for sure, but necessary to keep our operational capacity in line with the current environment.\n\nNo other teams at Upstart were affected. We're also limiting hiring in other functions to a small number of positions that are strategic to our business. With a healthy balance sheet, robust unit economics and strong pricing power, we believe we're well positioned to navigate an extended period of economic uncertainty, while continuing to invest strategically in future growth. Despite these challenges, I'm very optimistic about Upstart's future.\n\nThere's broad recognition among technology leaders and industry pundits that AI is perhaps the most transformational technology of our time, and risk-based industries such as lending are at the forefront of this incredible opportunity. As the leader in AI-enabled lending, we are well positioned to capitalize on these growing trends and believe that market volatility will only strengthen our position and differentiation over time. While we dislike a weakened economy as much as you do, the increase in default rates that accompany this weakness serve to train our AI models faster. While other platforms continue to retreat to serving super-prime consumers, Upstart is rapidly learning how to price and serve mainstream Americans in all market conditions.\n\nBeyond my conviction in AI and the impact it can have in lending, my optimism also stems from seeing the rapid progress made by each of our product and machine learning teams. Some of the areas where we're making fast progress include, first, model accuracy. Our AI models have never been more accurate relative to a traditional FICO-based model, and our pace of model development has increased significantly. To be more specific, the increase in Upstart's model accuracy in the last four months is as much as we saw in the prior two years.\n\nSecond, macro reporting and responsiveness. An important goal for Upstart is to help lenders understand the direction our economy is trending in order to make more informed decisions about their lending programs. To support this goal, we have developed and are beginning to productize the Upstart Macro Index, or UMI. This index is a monthly indication of the state of the economy, specifically with regard to consumer financial health and credit performance.\n\nAt the simplest level, UMI is designed to estimate the level of default to expect in a time period, holding underwriting models and borrowers constant. What's even more interesting is that we have determined that a handful of common economic variables present in the Dodd-Frank stress test can estimate UMI with a high degree of accuracy. We continue to iterate our methodology with the intention of translating widely available forecast of macro indicators into an expectation for future levels of default. We believe this is the first time that commonly understood and broadly forecasted economic indicators can predict credit performance and are looking forward to sharing more with you as we refine this tool.\n\nOur goal is to be the fastest platform to respond to macro changes and to provide the most relevant and up-to-date information to our lenders, and UMI is a big step in that direction. Third, automation. In the third quarter, we saw a record 75% of loans fully automated. This came from a variety of efforts, including an experiment to help applicants enter information more accurately that led to an absolute 1.8% lift in instant approvals.\n\nFourth, auto refinance. This quarter saw three significant improvements to our auto refi product. We launched a new model to more accurately identify loan payoff amounts. We fine-tuned our income verification models.\n\nAnd finally, we improved the process of reviewing registration cards. These upgrades collectively led to a 20% improvement to our auto refi conversion funnel. Fifth, auto retail. In Q3, we shipped our largest software release of the year, including a new build and price feature, which allows consumers to build, configure and price autos that the dealer doesn't yet have on the lot.\n\nOur software is in more than 700 dealers now. We've also turned on retail lending with three more dealer groups and are now in four states, representing 25% of the U.S. auto market by population. And more than one in three auto loan applications were automatically verified, about double the prior quarter.\n\nSixth, small-dollar loans. This team shipped too many improvements to name, but in Q3, we saw more than 9,000 small-dollar loans on our platform, almost 4x the prior quarter. And all these loans were to borrowers only otherwise would have declined. Smaller and shorter-term loans are critical to reach more consumers and to help our AI models learn as quickly as possible.\n\nSo we're very excited about this progress. And seventh, small business loans. I told you last quarter that we had reached our first $1 million in SMB loans. Well now, we're close to $10 million in loans originated, and the team is rapidly shipping improvements as we look to refine that product.\n\nWith the financial impact of these upgrades to our products is muted in the current environment, we're confident that they'll set us up for a giant leap forward once the economy and credit markets normalize. Finally, while there's no shortage of caution among banks and credit unions, I'm also happy to report that we deployed a record 17 new lenders onto our platform in Q3, including Alliant Credit Union, which is a top 10 credit union by asset size. This compares to 17 lenders launched in all of 2021. While these lenders are starting up cautiously, it's encouraging that we're planting seeds for funding capacity in our future.\n\nAs of today, we have 83 lenders under contract on the Upstart platform. Before I wrap up, I want to say again, we're not pleased with the results we shared with you today. But when interest rates are rising and the economy is in flux, lenders and credit investors naturally become cautious. Despite this caution, our lenders will tell you that the performance of the Upstart-powered credit has met or exceeded expectations over time.\n\nWe don't like volatility any more than you do, but we won't allow it to set us off course from our long-term goal to reinvent how credit works. Our goal is to become the destination with the best rates and the best process for all forms of credit for everyone. This can't and won't be done by a single bank, but it can be done by a vast network of banks, credit unions and credit investors powered by a modern cloud-based AI platform. Great companies separate themselves from merely good ones during the hardest of times.\n\nThey are clear-eyed about how the environment has changed. They make smart and fast decisions in order to ride out the turbulence, but they also retain an optimistic focus on the horizon as they continue to invest in the future. You have my full commitment to ensure Upstart is exactly that type of company. Thank you.\n\nAnd I would like to turn it over to Sanjay, our chief financial officer, to walk through our Q3 financial results and guidance. Sanjay?\n\nSanjay Datta -- Chief Financial Officer\n\nThanks, Dave, and thanks to all for joining us today. As Dave has alluded to, the external environment continues to be a challenging one, particularly for those less affluent borrowers with limited access to credit that are at the core of Upstart's mission. Consumers have simultaneously whittled personal savings rates from pre-pandemic levels of roughly 9% down to 3.3% in Q3, a level not seen since the great financial crisis, and have swapped credit card balances to all-time record highs. Savings rates have dwindled and credit card balances have inflated to pay for what has been a continuing expansion in real consumption, so far with no corresponding increase in either real wages or labor force participation since the advent of COVID.\n\nAs a consequence, defaults are on the rise. Industrywide data shows that less affluent borrowers are leading the way with impairment levels on unsecured personal loans that are about twice as high as they were prior to the onset of COVID. By way of comparison, highly affluent borrowers are now roughly back to being in line with pre-COVID impairment levels, although they continue to be on the rise. The Upstart Macro Index previously referenced by Dave is our internal way of articulating the impact of the external macro environment on loan defaults in our particular borrower portfolio by controlling for underwriting model changes and shifting borrower characteristics over time.\n\nThe most recent index level of around 1.7 tells us that Q3 environment produced 70% more defaults than we would expect from our borrower base in a long-run normal macro environment. This number is also approximately 20% higher than what we had observed when we last reported earnings in August. As a result of our model's adjustments to these changing macroeconomic conditions, our loans today are being priced at APRs that are significantly higher than those from the beginning of the year, which is one of the principal driving factors behind the overall volume contraction our business is currently experiencing. As David said, this is, in fact, working as intended.\n\nOn the loan funding side, a brief period of late summer optimism in the ABS market has since receded, and loan funding in general remains challenging. Overall financing costs for our securitization investors are up about 500 basis points since last year. These higher financing costs and the general scarcity of available capital has contributed to the volume pressure on the business. With the preceding context, here now are some of the financial highlights from the past quarter.\n\nOn the top line, revenue from fees of $179 million was largely in line with our expectations. However, negative fair value adjustments and losses on sale incurred by the loans on our balance sheet brought overall net revenue down to $157 million, short of our guidance and representing a 31% contraction both sequentially and year over year. The volume of loan transactions across our platform in Q3 was approximately 188,000 loans, down 48% year over year and representing over 125,000 new borrowers. Average loan size was up 14% versus last year.\n\nOur contribution margin, a non-GAAP metric, which we define as revenue from fees minus variable costs or borrower acquisition, verification and servicing, came in at 54% in Q3, up from 47% last quarter but still behind our guidance. We have been successful in expanding our margins through higher take rates and more efficient marketing spend, and we expect this to continue in Q4. Operating expenses were $215 million in Q3, down 17% sequentially. We reduced our sales and marketing by 46% sequentially to reflect a weakened conversion funnel, which has declined as a result of our higher offer rates.\n\nEngineering and product development grew 16% sequentially, and general administrative spend grew 2% sequentially. Across both areas, hiring has now largely been limited to only a few key strategic positions. Taken together, these components resulted in a Q3 GAAP net income of negative $56.2 million. Adjusted EBITDA was negative $14.4 million, and adjusted earnings per share was negative $0.24 based on a diluted weighted average share count of 81.7 million.\n\nWe continue to be in a favorable liquidity position with $830 million of total cash and $431 million in net loan equity on our balance sheet. Our gross balance of loan assets at the end of the quarter was $700 million, up $76 million from last quarter. Of that total, loans made for the purposes of R&D represented $451 million, principally within the auto segment, and our balance of core personal loans stood at $249 million. The near-term outlook for our business remains tied to the direction of the macro economy.\n\nAnd while this has historically proven hard to predict, we are currently pricing our loans expecting a further degradation in the environment and in our macro index. The volume assumptions underpinning our revenue and earnings guidance are consistent with this outlook. In order to provide some additional insight into revenue, we are splitting out our top-line guidance between revenue from fees, which reflect our baseline volume and fee expectations; and net interest income, which includes impacts from fair value and gain on sale. With these specifics in mind, for Q4 of 2022, we will expect revenues of between $125 million and $145 million.\n\nWithin that, we expect revenue from fees of approximately $160 million and net interest income of approximately negative $25 million, contribution margin of approximately 54%, net income of approximately negative $87 million, adjusted net income of approximately negative $40 million, adjusted EBITDA of approximately negative $35 million, and a diluted weighted average share count of approximately 89.3 million shares. As ever, we will take this opportunity to extend our gratitude to all of the employees at Upstart who continue to make daily progress against our underlying business and technology goals in what continues to be a challenging external environment around us all. And with that, Dave and I are now happy to open the call to any questions. Operator, back to you.\n\nOperator\n\n[Operator instructions]. We will take our first question from David Scharf with JMP Securities. Please go ahead.\n\nDavid Scharf -- JMP Securities -- Analyst\n\nGreat. Thanks, and thanks for taking my questions today. Dave or, I guess, for Sanjay as well, I wanted to maybe ask a little bit of a kind of longer-term strategic question as it relates to structure. Obviously, funding environment is going to go through dislocations here or there and ultimately resolve themselves.\n\nBut I guess in terms of the structure of the business, I know last quarter, you talked about seeking some more kind of longer-term partners. And reflecting on some of your all-digital lending peers, there seem to be a lot of different ways to skin the cat in your industry. LendingClub went out and got a bank charter. Pega's gone for pre-funding securitizations in investment vehicles exclusively.\n\nLendingPoint, they've always kind of opted for a 60-40 mix between loan retention and securitization. Obviously, as you noted, the macro environment is going to shift, and ultimately, will emerge on the other side. But in terms of strategically thinking about the types of dislocations that are happening right now, is it different longer-term funding structure something the company evaluates every now and then?\n\nDave Girouard -- Chief Executive Officer\n\nHi, this is Dave. That's a good question. We certainly think about funding on our platform pretty much constantly. But I will say this, we believe fundamentally in a marketplace structure in the sense that a lot of lenders making independent decisions over the long haul is going to get to the right answer.\n\nI mean marketplace -- market-based economies are historically far more efficient than centrally planned economies. That's a very -- I would just say a very basic truism. But having said that -- so that means we don't want to become a centrally planned economy. We don't believe us being a bank makes a lot of sense for what we hope to pursue for lots of reasons.\n\nBut having said that, we can certainly do a better job of securing supply of funding on our platform. And that can really be through some of the things we talked about getting longer-term funding agreements in place, being in more products -- a more diverse set of products, such as secured products like auto loans, mortgages, etc. So it is certainly something we have to think hard about and do more work on. But underneath it all, we do believe a market-based economy -- a marketplace where there's a lot of participants on both sides will ultimately have the greatest scale and the greatest opportunity.\n\nAlbeit we're dealing with volatility today, but over the long haul, we're confident this will lead to the greatest outcome for Upstart.\n\nDavid Scharf -- JMP Securities -- Analyst\n\nGot it. I appreciate the color, Dave. And maybe just as a follow-up, digging a little deeper on the funding side. Obviously, as Sanjay noted, I mean, the ABS markets remain a bit volatile.\n\nBut at the same time, even though spreads are wider, we've actually seen in the last couple weeks, months, a number of non-prime deals start to get done Inova, Opportune, Regional Management. So spreads remain wider, but investors are stepping up for the unsecured personal loan non-prime asset class. Any further updates you can provide based on -- either anecdotal, on discussions you have with existing bond investors or when you would think you might be able to return to the market?\n\nSanjay Datta -- Chief Financial Officer\n\nYeah. Hi, David. This is Sanjay. As you said, it's volatile.\n\nWe remain in the market. We completed a couple of deals in Q3, and we're going to be back in the market in Q4. Our cadence is generally every sort of two to three months or so, and I think we've been holding to that cadence. So like you said, cost of funds, spreads are all pretty volatile, and they will sort of dictate the economics in any given deal.\n\nBut there's always deals to be done or at least until now, there's deals to be done. So we're going to continue with that cadence. And we have a stable of investors who are contributing to those securitizations who are -- continue to have interest in contributing the collateral into the securitization as well.\n\nDavid Scharf -- JMP Securities -- Analyst\n\nGreat. Got it. Thank you very much.\n\nOperator\n\nWe will take our next question from Ramsey El-Assal with Barclays. Please go ahead.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thanks for taking my question this evening. I wanted to ask about the on-balance sheet loans. It looks like that number went up about $70 million, $80 million this quarter to around $700 million.\n\nI'm just curious in terms of going forward what your plans are there. Do you intend to stabilize that number here or ship will it go up, will it go down? How should we kind of think about that for modeling purposes?\n\nSanjay Datta -- Chief Financial Officer\n\nHey, Ramsey. This is Sanjay. Yeah, I don't think we've necessarily guided a specific guideline or a number with respect to our balance sheet. I think we gave some sort of high-level parameters last quarter, and I think we obviously operated within that.\n\nAnd I think that, that will continue to be the case. So I think that whether we draw it up or draw it down over the next quarter or so will continue to be an operating decision we sort of discussed and take, but I think it will be within the parameters of what you saw in this last quarter.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGot it. OK. And then a quick follow-up for me just on the conversion rate on the rate request. I think that, as you mentioned, it's a tougher environment.\n\nThat trended, I think down 300-plus basis points quarter over quarter. Also there, just curious from a modeling perspective, do we keep that sort of stable here? Or is that a metric that we could see deteriorate further? Or is the answer it's just contingent on the environment and how it evolves?\n\nSanjay Datta -- Chief Financial Officer\n\nYeah. Thanks, Ramsey. It's a good question. I mean, I think that I would bring it back to the vocabulary of this Upstart Macro Index, which Dave referenced, which, as we said, something we've started disclosing in our investor materials.\n\nIt essentially is sort of an index to try and capture the external macro's impact on defaults. And the simple way to think about our conversion rate is that index went up about 20% versus last quarter. So that's sort of an expression of the fact that the macro is impacting defaults in our portfolio by that amount. And when that happens, our models recalibrate, APRs go up, and essentially approval rates and acceptance rates both go down.\n\nSo in terms of how to think about it on the go-forward, it really kind of amounts to what you think about the macro conditions. And if defaults are going to continue to go up or normalize or stabilize or maybe even reverse course at some point, that will really dictate the offers that we're making and hence, the conversion level.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nWe will take our next question from Peter Christiansen with Citi. Please go ahead. One moment please. Mr.\n\nChristiansen, your line is now open.\n\nPeter Christiansen -- Citi -- Analyst\n\nThank you. Thanks for the question here. Good evening. I wanted to ask about, again, back to rate request, the previous question.\n\nIt looks like they were down considerably sequentially, not even looking at the conversion rate yet, but at the top, the very top of the funnel. Just wondering, are you taking a different go-to-market approach in terms of attracting new borrowers to the platform? And how should we think about that in context to this potential horizon like debt consolidation and those kind of themes? Just wondering how your go-to-market is changing their top-of-funnel new borrower adds. Thank you.\n\nSanjay Datta -- Chief Financial Officer\n\nHey, Pete. This is Sanjay. Go ahead, Dave.\n\nDave Girouard -- Chief Executive Officer\n\nNo. Go ahead. Go ahead, Sanjay.\n\nSanjay Datta -- Chief Financial Officer\n\nSo I was just -- I'll add, and I'm sure Dave can add to the response. But a lot of our marketing activities are in fact governed by the conversion funnel in the sense that when loss estimates go up, conversions go down. We target our marketing campaign size and our activities to some target for unit economics. And when the conversion funnel is weaker, we reduce marketing size accordingly.\n\nSo as all of this sort of like this two-step process, whereby conversion funnel improves, it converts more. And we expand marketing and then the reverse is true, of course, when the marketing funnel contracts.\n\nPeter Christiansen -- Citi -- Analyst\n\nI think the generic of the question is like, how are you thinking about spend on lead gen generally?\n\nSanjay Datta -- Chief Financial Officer\n\nThe spend on the lead gen is sort of an -- it's sort of a function of how perform in our conversion funnel is. So we will spend up until the point where the marginal return on the marketing dollar is zero in a sense. And so sort of what I mean is if our conversion funnel improves, we will spend more on lead gen because it will be more economical. We'll be able to spend more up until the point where the marginal cost is zero and vice versa.\n\nAnd so what's been happening recently is as our conversion funnel is impacted by higher losses in the portfolio, our target sort of unit economics contracts.\n\nPeter Christiansen -- Citi -- Analyst\n\nGreat. Thanks for the color, Sanjay.\n\nOperator\n\nWe will take our next question from Mike Ng with Goldman Sachs. Please go ahead.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nHey, good afternoon. Thank you very much for the question. I just had two. First, I was just wondering if you could tell us what the transaction fee rate as a percentage of funded principal was in the quarter, obviously, ex servicing fees and how we should think about the opportunity to continue to take pricing going forward.\n\nAnd then secondly, I was wondering if you could talk about how much of the principal in the quarter was self-funded off of the Upstart balance sheet versus just the core model. Thank you very much.\n\nDave Girouard -- Chief Executive Officer\n\nYeah. Thanks, Mike. This is Dave. I'll take the first part of the question and, Sanjay, perhaps answer the second.\n\nIn the first, we have -- we're able to basically increase revenues by increasing fees on a per-loan basis. And then also, as Sanjay was suggesting earlier, our acquisition spend per loan at a time like this can go down a lot. So in effect, the unit economics on each loan is significantly better, much more sort of gross profit per loan, albeit at a lower loan volume. So those are things within our control, which is why contribution margin has gotten higher during this time.\n\nAnd I think that's sort of a form of pricing power that means we can -- when we need to be in a little bit of a defensive mode can make sure that we're monetizing well enough to cover our expenses, etc. And we view that as a very positive part of our platform.\n\nOperator\n\nWe will take our next question from Simon Clinch with Atlantic Equities. Please go ahead.\n\nSimon Clinch -- Atlantic Equities -- Analyst\n\nHi, guys. Thanks for taking my question. I was wondering if we could just start with the contribution margin. I was just wondering if you could talk about, I guess, how -- because the guidance for 59% in the quarter, you've fallen quite short of that.\n\nBut it also implies, I think you're tracking well above that. That's probably entering the quarter. So I'm just kind of curious about the dynamics that go into contribution margins that are within your control and not within your control and how to think about that going forward.\n\nSanjay Datta -- Chief Financial Officer\n\nYeah. Hey, there. This is Sanjay. Yes, that's a great question.\n\nSo I guess the dynamics on the contribution margin was up from last quarter, 47% to approximately 54%. It was sort of our guidance. Maybe one simple way to think about it is, when we are funding-constrained as a platform, we tend to expand contribution margins. And we do that by expanding take rates.\n\nAnd it makes sense to do that when you're funding-constrained. Now when you're borrower-constrained, you sort of do the opposite. You want to sell for volume, and you can take down your take rates a little bit and expand volume. And I think we probably assumed, we'd be funding-constrained for all of this past quarter.\n\nIn reality, we've sort of bounced back and forth a little bit. We've been at times funding-constrained and at times borrower-constrained. And at those times where we've been borrower-constrained, we've actually acted to reduce contribution margins a little bit. And so I think that we are sort of bouncing around between those two states.\n\nAnd as we go into Q4, to the extent we are funding-constrained in any given period of time, our contribution margins would be above the numbers that we produced and probably closer in line to what we had guided. But to the extent we are borrower-constrained and again, the borrower constraints really come from the fact that our macro index is so high that the approval rates are low, you'll see sort of lower conversion rates more in line with how we looked in Q2 probably. So the outcome is sort of a function of where we are between those two states.\n\nSimon Clinch -- Atlantic Equities -- Analyst\n\nOK. Appreciate that. And I was wondering if you could -- just jumping back to the structure of your funding and sort of the appetite of the investor base at the moment. I mean, could you go a little bit -- I mean, how far have you got in terms of exploring the idea of having -- of shifting the base toward more long-term investors? And maybe you could just update about your thinking on that.\n\nSanjay Datta -- Chief Financial Officer\n\nYeah. Sorry, could you just repeat the very last part of your question? What is our thinking in terms of what?\n\nSimon Clinch -- Atlantic Equities -- Analyst\n\nAbout the shift toward funding more longer-term capital-type investors.\n\nSanjay Datta -- Chief Financial Officer\n\nI see. Well, just to describe it at a high level, I mean, historically, we've been sort of like three quarters institutionally funded and about a quarter bank-funded. That ratio has changed. And it's -- the percentage of bank funding on our platform has done quite a bit.\n\nIt's been a more stable source of capital. The institutional world has obviously been a lot more volatile. And then within the institutional side, I think there's a desire, as we talked to last quarter, to enter into some more strategic transactions, some more sort of committed sort of type partnerships. I would just say we're in a number of encouraging conversations, but they're all quite preliminary.\n\nAnd I think we view that as being something that's not going to happen overnight. It's something that -- to the extent we get into those types of partnerships, they're not out of a sense of urgency. It's more about doing the right thing for the future of the platform. And I think those partnerships are available, but they may take some time to put into place because they're important and large and strategic.\n\nSo nothing more concrete than that to report on that right now, but I think we're pretty encouraged at the opportunities that are out there.\n\nSimon Clinch -- Atlantic Equities -- Analyst\n\nOK, all right. Thanks.\n\nOperator\n\nWe will go next to James Faucette with Morgan Stanley. Please go ahead.\n\nSandy Beatty -- Morgan Stanley -- Analyst\n\nThanks, this is Sandy Beatty on for James. Question on the forward flow funding process. How volatile is that month-to-month? So you mentioned some summer optimism. And I'm trying to get a sense of how volatile is that, what factors determine that volatility.\n\nIs it cost of capital, opinions about future credit performance? How do those conversations typically go? And is there any insight that you can provide us into that process?\n\nSanjay Datta -- Chief Financial Officer\n\nSure. Yeah. Hi, this is Sanjay gain. I wouldn't necessarily characterize it as volatile in so far as volatile as ebbs and flows.\n\nI really would characterize it as a level of funding that degraded pretty steadily, let's call it, between, I'd say, March and August or July/August. And since then, it's been at a pretty stable level although obviously, one month that was much lower than earlier in the year. So since then, it's not like there's been a bunch of comings and goings. So I think there's -- you could sort of characterize it as there's been a number of partners of ours -- funding partners of ours, predominantly with those who have worked with us for a longer period of time, who have been steady and stable in their activity.\n\nAnd there's been a lot of people who -- maybe those who have been working with us for a lesser period of time and are a little bit more sort of dependent on the ABS markets. And they've largely sat on the sidelines as they're sort of waiting to see how the world plays out.\n\nSandy Beatty -- Morgan Stanley -- Analyst\n\nGot it. And then just a follow-up on profitability in terms of the quarter and also the guidance. How are you thinking about managing that cost structure going forward? And how should we think about impact from the recent workforce reductions and how that might reduce pressures or reduce costs on a run rate basis?\n\nSanjay Datta -- Chief Financial Officer\n\nSure. Yeah. I mean, I think of the components of our cost structure, we think about the contribution margin, obviously, and we sort of guided that at a level next quarter, that's, I'd say, comparable to where we are now, so something in the mid-50s. The reduction in force that we did really will have -- as that runs its course, a positive impact on contribution margins because really, that was about rightsizing the size of the onboarding team that's processing the incoming loans to be a bit more in line with the volumes that we have.\n\nWith respect to the sort of what we call the fixed sort of payroll between our engineering and technology teams and our general and administrative teams, there, we've pretty much paused hiring except for a couple of very strategic roles that are important to sell. And so I think you could expect to see a stable sort of fixed opex base. And that's something that we continue to sort of evaluate every quarter. And I think we like the size of that opex base given where we are now.\n\nAnd obviously, the world can take a number of different directions. And if we start to recover, we'll be in good shape. If we continue to degrade, we'll continue to sort of evaluate as we go. But beyond what we've done with the existing reduction in force, there's no plans in place to go any further at this time.\n\nSandy Beatty -- Morgan Stanley -- Analyst\n\nGot it. Thanks for taking my questions.\n\nSanjay Datta -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nWe will take our next question from Vincent Caintic with Stephens. Please go ahead.\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nHi. Thanks for taking my questions. First question actually on the Slide 12 in your deck, the Upstart platform performance versus target is recovering slide. Just wondering if you could talk about that in more detail.\n\nAnd seeing that's improved, just wondering if -- essentially wondering when you think maybe investor demand can come back or volume demand can come back if the customer is being priced at a 800 basis points higher and your investors are seeing 500 basis points higher. Is there -- when do you think we can maybe see visibility into improving demand, whether it's on the credit demand side or in the borrower demand side?\n\nSanjay Datta -- Chief Financial Officer\n\nHi, Vincent, this is Sanjay. It is a great question in the sense it's a million-dollar question. I mean, I think the return of sort of confidence and funding and the institutional side sort of requires the convergence of those two lines. And in a sense, we're chasing a trend that's on the prior slide -- or I guess it would be on Slide 10, the Upstart Macro Index, like that's the thing that is the moving target for us.\n\nAnd our models are calibrating as that is evolving. And so compared to where we thought in terms of those two lines converging where we thought we were last quarter, it turns out -- we're on the lower side of our confidence interval now because the defaults in the world has continued to rise. And so it really is a question of when will that default trend stabilize. And as and when it does, you will see those models can converge quite quickly.\n\nAnd in fact, the target returns themselves have gone up. I should clarify, this is obviously something that blends the returns and the performance of all of our loans, whether they're on the bank channel side or the institutional side. But if you look at the return targets on the institutional side, that's really where that the 500-basis-point sort of number has come in. So yeah, it's a bit down to how the macro evolves from here and how conservatively we're pricing with their models.\n\nSo I think we've signaled confidence in where we are now and where we're pricing loans now, but obviously, the world needs to play out a little bit so we can demonstrate that.\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nOK. Understood. Thank you. And then a follow-up question just on the costs.\n\nI guess when we're thinking about the long-term and thinking about some of the investments in new products that you're making versus maybe in the near term where maybe there's not a lot of volume or trying to be conservative on expenses, how do you kind of manage the two? Because it does sound like you're building out the small business portfolio, building out auto lending. Maybe there's some traction going on there. But maybe you could help us understand when do you -- when would you -- the balance between being conservative on the investments are on the expenses versus long-term opportunities with these products? Thank you.\n\nDave Girouard -- Chief Executive Officer\n\nYeah. This is Dave. Vincent, the way we think about that is we would like to, to the extent possible, continue to invest or even increase investment in the future products because that's obviously what our franchise is built on and what will lead to significant growth in the future. So what we've been able to do is maintain that growth and actually continue to invest in the products.\n\nAnd a lot of that, we can see internally. I've shared some of the metrics with it in terms of actual improvements made to each of the products, but we don't actually benefit from them until really the funding and the economic situation is on a better footing. So we're a little bit building toward the future. But I think the good news is we have not cut back on that investment in the future of our products.\n\nAnd when I think we're in a more normalized environment, we will very quickly see the benefit of things. Just by way of example, we have the highest-ever rate of automated loans, 75% of the loans on our platform in Q3 had no human intervention in them, and that's a record high for us. We're not really benefiting from that as a business until we get to a place where loan funding -- when loan prices aren't so high, loan funding is abundant, etc. And I think across the board, if you looked at each of our products, they're actually getting better very quickly.\n\nAnd the teams are making very good use of this time, though the payback won't be until some point in the future.\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nOK, that's very helpful. Thanks very much.\n\nOperator\n\nWe will take our next question from Arvind Ramnani with Piper Sandler. Please go ahead.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nHi. Thanks for taking my question. I just had a couple of questions. One, just as you think about the next kind of 12 months, have -- what are some of the downside scenarios? Like, I mean, if the macro gets a lot worse, would you expect like kind of further deterioration in your business just given sort of the strong exposure you'll have to the macro?\n\nDave Girouard -- Chief Executive Officer\n\nSure. Arvind, well, look, no doubt, any business looking to the future of the economy, there are downside scenarios for everybody. We're not different than that. I mean we're a fairly simple business in many ways that we have fixed costs, and then we have contribution margin to offset those.\n\nAnd certainly, if macro continue to deteriorate significantly, that would probably translate into lower volumes in our platform. And at some point, we will look at our fixed costs and ask whether we can afford that. So our first goal is, of course, retain solvency in the sort of solid footing the company is on. We have a large cash balance.\n\nWe have relatively low fixed costs, and that's really helped us all through our existence. But -- so we don't have any fear other than, look, the thing we want to keep doing and thus far, we're able to do so, is investing in the products. Certainly, there are scenarios we could imagine that are so bad that we would have to cut back investment or pause products, et cetera. But we don't see that today.\n\nI think today, we have enough volume and enough contribution margin to keep optimistically investing for the future, and that's what we would hope.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nRight. And as you think of your kind of, I would say, kind of existing cash burn and sort of projected cash burn in which country you're making adjustments with -- just on some of your expense line, when do you think you may need to go sort of raise kind of additional capital, whether in the form of equity or debt?\n\nDave Girouard -- Chief Executive Officer\n\nWe don't see any need to do that, Arvind. And honestly, our cash burn today is quite small even in the very constricted position we're in. I mean, I think our volumes are pretty dramatically lower than they were, yet our cash burn is fairly minimal. So we don't see a scenario where we have to raise cash.\n\nAs Sanjay said, we have over $800 million in cash as well as loan assets on the balance sheet. So that's just not something we anticipate at this time.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nThat's perfect. Thank you. Go ahead.\n\nSanjay Datta -- Chief Financial Officer\n\nI was just going to maybe put some quick back-of-the-envelope numbers to that. Our cash sort of fixed expense burn across payroll and opex every month is about $30 million. And even at zero origination scenario, we're getting a servicing stream of revenue that's about $15 million. So there's sort of -- maybe the sort of $15 million delta every month that we have to rely on contribution margin for to cover.\n\nSo that's sort of like on a downside scenario where the gap might be. And as you saw, we've got about $800 million in total cash on the balance sheet. So as Dave said, that can take us for quite some runway.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nRight. Right. I guess you can be quite patient in that case. Yes, that's pretty much the questions I had.\n\nSanjay Datta -- Chief Financial Officer\n\nThanks, Arvind.\n\nOperator\n\nWe will take our next question from David Chiaverini with Wedbush Securities. Please go ahead.\n\nDavid Chiaverini -- Wedbush Securities -- Analyst\n\nHi, thanks for taking the questions. So I'm looking on Slide 11 at the in-period losses versus expectations. Can you walk through what this is telling us? Is it basically saying that 25% -- that loss in-period defaults are 25% above what you're modeling it? And I guess marrying that with Slide 10 with the UMI at 1.7, should we expect this line on Page 11 to go up toward 70%? Just could you talk through that a little bit?\n\nSanjay Datta -- Chief Financial Officer\n\nHi David, this is Sanjay. Sure, these are important questions. So let me start with Slide 11. This is essentially in any given sort of calendar period along the X axis for all of the loans we have outstanding at that time.\n\nSo it's not a cohort of view. It's just of all vintages that are existing in Q3 of 2022, what were the losses incurred in that period versus what had been modeled at the time of origination. And so that would say that of all the vintages that were still active or outstanding in that quarter, the losses were 25% higher. And obviously, a lot of those same vintages compose the populations in the prior quarters that were below or on target.\n\nSo you're correct in that what is causing this in a sense is what you see on Slide 10, which is our sort of expression of the macro impact in the environment. Now the fact that the macro index is at 1.7 doesn't suggest that there -- we're 70% higher than what we had modeled. I guess the other side of the equation is where are we pricing loans. So today, we're pricing loans at a 2.0 sort of equivalent macro index.\n\nSo to put another way, if that macro index stays at 1.7 and we're pricing new loans at a 2.0, they should in fact overperform. It should come under losses by -- to the tune of 17% to 20%. So because we rapidly adjust the model to recalibrate to where the sort of UMI is trending, we are sort of able to, in a sense, price these trends into the loans. So to get back to your original question, what should we expect that line to do on Slide 11 going forward? A lot of the existing loans, to the extent the economy continues to degrade, they are already priced.\n\nAnd so yes, as the economy degrades, then those losses will increase. But then you also got fresh production of loans being put into the population that are priced at much higher UMIs. And so the answer will be similar in the balance of those two.\n\nDavid Chiaverini -- Wedbush Securities -- Analyst\n\nVery helpful, thanks for that. And then my second question relates to promotional activity in the third quarter related to gift cards. Was this new? And are you able to say how much that contributed to originations in the third quarter? And what level should we expect in the fourth quarter, if that's going to continue?\n\nSanjay Datta -- Chief Financial Officer\n\nSure. Yes, this is Sanjay again. So I guess taking a step back, I think that the way to think about that, and I sort of alluded to this in one of the prior questions. In Q3 itself, we had sort of gone back and forth between a funding-constrained environment and a borrower-constrained environment.\n\nSo in a sense that sort of the availability of funding or lack thereof is competing with the loss trends in the economy and our ability to approve. And so there was some period of time in Q3 where we were actually borrower-constrained, and we took that decision to sort of run a marketing campaign where we provided some incentives in order to get some of the origination numbers up a little bit. I think the overall impact on the numbers is pretty de minimis. It was de minimis within that month and certainly within the entire quarter.\n\nIt wasn't a very big impact, but just from the fact -- go ahead.\n\nDave Girouard -- Chief Executive Officer\n\nSorry, Sanjay, I was going to say, I mean, what you're seeing there is we are pretty constantly trying to find the lowest-cost source of borrowers. And in that case, I believe it was really incenting people that were already on our platform that essentially had no other acquisition costs associated with them. But what we're generally doing in all periods is trying to acquire users at the lowest possible cost. And gift cards to promote someone who has no other associated costs with them, meaning from digital or from direct mail or from a partnership, et cetera, can be a very good way to do that.\n\nDavid Chiaverini -- Wedbush Securities -- Analyst\n\nVery helpful, thanks very much.\n\nOperator\n\nAnd there are no further questions at this time. Mr. Girouard, I will turn the conference back to you for any additional or closing remarks.\n\nDave Girouard -- Chief Executive Officer\n\nThanks, all. Thanks for listening. We definitely appreciate. This has been -- it's a challenging time, particularly for the mission that we're on and the business that we've chosen.\n\nBut we are confident in it. We're committed to it and pretty -- need to make sure we make all the right decisions now, particularly in terms of credit performance and as well as being sort of fiscally responsible. But we're extremely confident that all the investments we're making today, continuing to do are going to lead us to a much stronger position, and we'll be in a growth mode again soon enough. So thanks all for listening today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJason Schmidt -- Head of Investor Relations\n\nDave Girouard -- Chief Executive Officer\n\nSanjay Datta -- Chief Financial Officer\n\nDavid Scharf -- JMP Securities -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nPeter Christiansen -- Citi -- Analyst\n\nMike Ng -- Goldman Sachs -- Analyst\n\nSimon Clinch -- Atlantic Equities -- Analyst\n\nSandy Beatty -- Morgan Stanley -- Analyst\n\nVincent Caintic -- Stephens, Inc. -- Analyst\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nDavid Chiaverini -- Wedbush Securities -- Analyst\n\nMore UPST analysis\n\nAll earnings call transcripts"
}