{
  "companyName": "Carnival",
  "companyTicker": "CCL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/30/carnival-ccl-q3-2022-earnings-call-transcript/",
  "content": "Carnival (CCL -0.25%)\nQ3 2022 Earnings Call\nSep 30, 2022, 10:00 a.m. ET\n\nJosh Weinstein\n\nGood morning. This is Josh Weinstein. Welcome to our third quarter 2022 business update conference call, my first as CEO. I'm joined today telephonically by our chair, Micky Arison.\n\nAnd with me here in our Miami offices are Chief Financial Officer David Bernstein; and our senior vice president of investor relations, Beth Roberts. Before I begin, please note that some of our remarks on this call will be forward-looking. Therefore, I must refer you to the cautionary statement in today's press release. Our business continues on a positive trajectory.\n\nWe've been closing the gap to 2019 as we put a stake in the ground internally and shifted from return to service to a relentless focus on return to strong profitability. The occupancy gap to 2019 has reduced from over 50 points in Q1 to less than 30 points in Q3. At the same time, our capacity in service has gone from approximately 60% in Q1 to over 90% in Q3. In fact, in the month of August, we achieved almost 90% occupancy at higher constant dollar revenue per diem despite the impact of future cruise credits.\n\nAnd the differential in adjusted cruise costs, excluding fuel per ALBD, has reduced from over $25 in Q1 down to $10 in Q3. As a result, we were able to generate over $300 million of adjusted EBITDA in the third quarter, overcoming a near doubling in fuel prices. We expect these favorable trends to continue as we finish up 2022 and head into 2023. And while we expect breakeven to slightly negative fourth quarter EBITDA given the seasonality of revenues and our increasing investment in advertising to drive revenue yield in 2023, we do expect second half EBITDA overall to be positive.\n\nWe've also been making strategic changes to our fleet composition that will pay dividends over time. Our global fleet of 91 ships has never been better positioned, thanks to the exiting of 23 smaller, less efficient ships and taking delivery of 9 large and very efficient ships. While we'll all be four years older than we were in 2019, next year, the average age of our fleet will actually be a year younger than in 2019 at 12 years. It also means our average berth count per ship is increasing nearly 20%, the largest among our public peers.\n\nWe expect benefits of this profile to include a fleet with 10% higher fuel efficiency, 6% more efficiency in remaining operating costs, a richer cabin mix and larger overall platforms to deliver onboard experiences and generate associated revenues. We have also begun to address the brand portfolio to improve ROIC and drive durable top and bottom-line growth. In light of the continued closure of cruise operations in China and our Costa brand's significant presence there pre-COVID, we are reducing Costa's capacity by 10% from 2019 levels, while bolstering our highly successful Carnival Cruise Line brand through the previously announced transfer of three ships, including two via our innovative Costa by Carnival initiative launching in 2023. All three ships will be placed on new itineraries, allowing Carnival to expand its drive to cruise offering.\n\nWe will continue to evaluate opportunities to further optimize our brand portfolio over time. These fleet and portfolio decisions will provide strong tailwinds. And while during the pause in operations being nearly twice the size of the next closest cruise company was a distinct disadvantage for our cash burn, we will once again benefit from our industry-leading scale. And there are even greater opportunities ahead to drive revenue as we return to full occupancy and march toward strong profitability.\n\nThroughout the pause, we have benefited from the dedicated support of our loyal guests. Now, as we grow capacity in 2023 and beyond, we are redoubling efforts to attract new-to-cruise guests. About one-third of our guests have historically been new to cruise. And as you probably know, two of the most important drivers of new-to-cruise are word of mouth and advertising.\n\nWith respect to word of mouth, after the pause, we have been building back our army of advocates that leave the ships, spreading the word about the unparalleled vacation experiences we deliver day in and day out. In the third quarter alone, we carried twice the number of guests we carried in all of 2021, and over 50% more than in just the prior quarter. On the advertising front, we've also been ramping up our efforts, having reached 2019 spend levels in just the last two quarters. In fact, until six months ago, we had spent less on advertising cumulatively over a two-year period than in all of 2019, and most of this was directed at more efficient channels like past guests.\n\nThis was a conscious decision to reprioritize our resources to withstand the pause. As our brands have now been increasing their advertising investment, we will increase awareness and consideration and actively target those new-to-cruise. While we're still carrying a higher proportion of repeat guests, we have seen an improving trend in new-to-cruise and are already two-thirds of the way back to 2019 levels. And newcomers will be absolutely thrilled once we get them on board.\n\nWe are delivering a great all-inclusive vacation experience, convenient, great dining and entertainment choices, fantastic itineraries, beautiful and innovative ships and the most amazing onboard teams, providing a higher level of personalized service than you can find anywhere on land or sea. Our net promoter scores are telling us, we are delivering a phenomenal product. The issue is we are way too much of a value. We should not be priced at a significant discount to land, which is exactly the case today, anywhere from 25% to 50% based on itineraries.\n\nBottom line, when it comes to generating demand and increasing our revenue profile, we can, should, and will do better. I have begun traveling to meet with each brand president and his or her commercial team to understand their strengths, capabilities, and areas for improvement. We are working through their strategies and roadmaps to seize opportunities, all while taking advantage of tactics to quickly capture price and bookings in the interim. This cuts across multiple areas of our commercial operations, driving further brand differentiation and clarity around each brand's optimal target segment, ensuring that creative marketing speaks to each brand's target audience, launching more effective digital performance marketing and lead generation approaches, a renewed focus on our trade relationships, another key driver of new-to-cruise demand to reduce friction points and allow our travel agent partners to more efficiently secure bookings, while continuing to support internal sales as we need all sales channels to perform at a high level to be successful.\n\nImproving revenue management execution as we continue to adapt to an evolving booking environment and using data, guests, and target audience insights and cross-brand learnings to aid in all of the above. The engagement and transparency that characterize these brand sessions has been fantastic, and the sense of urgency these leaders have to drive their brands forward is real. And speaking of leaders, we actually have new leadership at the brand and throughout the organization. Since the pause began, five of our nine brands have welcomed new energetic presidents, and these brand presidents have been actively bolstering the bench below them.\n\nAdditionally, I have made a half dozen changes across corporate leadership in just the last few months. It's worth noting that with the changes I've made to date, 6 of my 12 direct reports are now women. We are actively focused on diversity and inclusion, and we'll continue to invest in talent and talent management. Now, diversity fits alongside our overall sustainability agenda, and we've been making significant progress across the board.\n\nThere have probably been no greater strides than reducing our carbon intensity. Despite being over 25% larger, our carbon footprint peaked more than a decade ago. And we've set 2030 targets for carbon intensity to be 20% lower than 2019 levels. We will achieve this through technology upgrades currently being rolled out, investing in port and destination projects, even more focus on itinerary optimization and realizing the benefit of our fleet optimization efforts.\n\nWhile there is no silver bullet to decarbonization for our industry yet, we are committed to working toward a solution. To this end, I'm excited about three successful pilots we recently completed using biofuels in existing engines without modification. Turning now to the current tone of business. Pricing for our 2023 book business is currently at considerably higher levels than 2019, adjusting for FCCs.\n\nAnd it is very encouraging that since announcing our relaxation and protocols in mid-August, we have already seen a very meaningful improvement in booking volumes. We are now running considerably higher than 2019 levels. At the same time, we have seen a notable improvement in cancellation trends. We expect these favorable trends to accelerate as the impact of our current and planned efforts will continue to materialize as we move toward our important summer season where we make the bulk of our operating profit.\n\nWhen it comes to our capital structure, maintaining a strong balance sheet has always been a priority for our company. Pre-pandemic, we have been able to achieve this while investing significantly in our new build program, thanks to the substantial cash flow our company generated. Going forward, we are committed to using our cash flow strength to repair the balance sheet over time, and we'll be disciplined and rigorous in making newbuild decisions accordingly. We have two ships on order in 2024 and one in 2025.\n\nWe do not anticipate significant deviation annual levels for several years. This will significantly reduce our capital commitments and set us on the path to deleveraging. We have seized the opportunity to emerge as a company that is more efficient, more sustainable, and more energized for the future. We have a transformed fleet, an unmatched portfolio of well-recognized brands, and unparalleled scale in an underpenetrated industry.\n\nWe are strategically managing our portfolio to optimize our near and long-term performance. We now have a tremendous opportunity to drive revenue growth by delivering measurable pricing improvements, while returning to historically high occupancy levels over time. That opportunity will drive significant free cash flow and accelerate our path to profitability, investment-grade credit ratings, and higher ROIC. In the coming months, we'll talk specifically about long-term goals and targets so that we can track progress and maintain accountability along our path.\n\nOur travel agent partners, port and destination communities, suppliers, investors, lenders and, of course, our guests are also important to our business. I plan to speak with more of our stakeholders in the coming months to gather their perspectives as we strive for continuous improvement. I would like to end by personally thanking all of our talented and dedicated team members globally, ship, and shore for the heavy lifting it took to get us back to full operations. And now comes the exciting part.\n\nWe get to take all of the creativity, agility, and innovation that the team has built up in response to external factors throughout the pause and resumption of operations, and we now get to use that skill set to proactively drive our business forward, and to fulfill our mission are creating happiness by delivering unforgettable and much-needed vacations to our guests. And now, I'll turn the call over to David.\n\nDavid Bernstein -- Chief Financial Officer\n\nThank you, Josh. I'll start today with a review of guest cruise operations, and then provide booking trends and the current tone of business. Turning to guest cruise operations. Third quarter 2022 represents a significant milestone in the resumption of our guest cruise operations with adjusted EBITDA turning positive for the first time.\n\nWe were pleased to see that third quarter 2022 revenue increased by nearly 80% compared to second quarter 2022, reflecting a continued sequential quarter-over-quarter improvement. For the third quarter, occupancy was 84%, a 15-percentage-point increase from the second quarter. We ended the quarter on a high note with 90% occupancy in the month of August. We were encouraged by the continued very close-in demand we experienced during the third quarter for the third quarter, a trend we had anticipated.\n\nRevenue per passenger day for the third quarter 2022 decreased from a strong 2019, mainly due to the impact of future cruise credits, or more commonly called FCC, and currency given the stronger U.S. dollar, along with our large presence in Europe with four brands in the UK and Continental Europe. Once again, our onboard and other revenue per diems were up significantly in the third quarter 2022 versus third quarter 2019, driven by price increases, greater spending by our guests and the increased effect of the second wallet as more guests are participating in pre-cruise sales of onboard activities. In fact, year to date, we have seen over 50% growth in pre-cruise sales of onboard activities on a per-passenger cruise day, or PCD, basis as compared to 2019.\n\nOur teams have done an excellent job capitalizing on the opportunity in this area. As I indicated in my comments during our last business update, we expanded our bundled package offerings given their popularity. The new bundled offerings required us to make changes to the accounting allocations. As a result, in the third quarter, more of the revenue was left in ticket and less allocated to onboard, impacting the onboard and other revenue per PCD comparison for the third quarter as compared to the second quarter.\n\nJust another reason to add to the list of reasons why the best way to judge our revenue performance is by reference to our total cruise revenue metrics. On the cost side, our adjusted cruise costs without fuel in constant currency per available lower berth day, or ALBD, as it is more commonly called, for third quarter 2022 was up 14% versus third quarter 2019. We have seen a continuation of the sequential improvement quarter over quarter in costs throughout the year, and expect to see a continuation of the improvement in the fourth quarter of 2022, with a low double-digit increase compared to 2019, driven in part by higher advertising expense to drive revenue for 2023. We ended the third quarter 2022 with $7.4 billion of liquidity, essentially the same liquidity level as last quarter.\n\nIn addition, I am pleased to report that total customer deposits, both current and long term, were $4.8 billion at third quarter 2022, approaching the record third quarter of $4.9 billion in 2019. New bookings for the third quarter of 2022 offset most of the historical seasonal decline in customer deposits, which was over $1 billion in 2019. Furthermore, to facilitate investor engagement, I wanted to mention a couple of balance sheet-related items. First, let me clarify our debt-to-capital covenant test.\n\nOur current debt-to-capital percentage is in the mid-50s using the calculation methodology in our debt agreements. This methodology allows for the add-back to equity of noncash write-offs and other adjustments, which eliminates the volatility from the pause in guest cruise operations, leaving us well within the debt-to-capital covenant limit set at 75% at the end of the third quarter 2022. Second, we will provide and will continue to do so quarterly a detailed debt schedule and a listing of ships in our fleet by brand on our website, carnivalcorp.com. To find these supplemental schedules, refer to the Financial Information tab within the Investor Relations section of the website.\n\nNext, let's look at booking trends and the current tone of business. Booking volumes for all future sailings during the third quarter 2022 saw a continuation of the accelerated booking volumes during the second quarter and closed the gap to strong 2019 levels. We did not see any seasonal slowing of booking activity in the third quarter 2022 versus the second quarter 2022 despite the third quarter normally being a slower booking period. It is great to see booking volumes for all future sailings considerably higher than 2019 levels since the announcement of the relaxed protocols in mid-August, aligning us toward land-based vacation alternatives.\n\nHowever, we are still managing through the close-in nature of the booking curve caused by the omicron variant disruption to our important wave season earlier this year and the more restrictive industry protocols in effect until very recently. This left us with more inventory to sell closer in. To optimize in this environment, we have been working to increase near-term occupancy in part by using limited promotions and opaque channels, available only to a select group of people to protect overall price integrity for 2023. Therefore, while this resulted in the cumulative advanced book position for the fourth quarter below the historical range, we believe we are well situated with our current fourth quarter 2022 book position given current booking volumes that are running significantly ahead of 2019 levels as we capitalize on closer in booking patterns.\n\nPricing impacted in part by limited promotions in opaque channels results in our cumulative book position for fourth quarter 2022 lower compared to 2019 sailings, but primarily due to FCCs. With respect to occupancy, fourth quarter occupancy historically has been lower than third quarter given the seasonal dynamic of our business. It was a nine percentage-point drop in 2019. However, this year, that will not be the case.\n\nOur continuing build in cabin occupancy will more than offset the seasonal decline, which will result in slightly higher fourth quarter 2022 occupancy compared to the third quarter and represents another step forward in closing the gap to 2019. For the full year 2023, our cumulative advanced book position is slightly above the historical average and at considerably higher prices compared to record 2019 levels normalized for FCCs. While I do expect an impact on 2023 yields from the FCCs, the impact is likely to be less than one percentage point for the full year 2023. Additionally, during 2023, we expect improvement in occupancy, with occupancy returning to historical levels in the summer of 2023.\n\nWhile our return to guest cruise operations is essentially complete, we are still evaluating a few remaining deployment options as referenced in our business update release. As a result, for 2023, we expect our capacity increase to be somewhere in the range of 3% to 5% compared to 2019. Of course, with nearly 25% of our capacity in 2023 from new ships, we also expect to benefit from the efficiency gains from our fleet optimization efforts that Josh mentioned earlier, helping to mitigate inflation. In summary, looking forward to 2023, we have a strong book of business at considerably higher prices.\n\nPrices are higher in all four quarters of 2023. Onboard revenue per diems are up significantly in 2022, and this puts us on track for a record year in 2023 for onboard revenue. All of this clearly sets the stage positively for 2023, with Josh and I working together with all the brand teams to drive revenue growth over time. And now operator, let's open up the call for questions.\n\nOperator\n\n[Operator instructions] Our first question is from the line of Steve Wieczynski with Stifel. Please go ahead.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nYes. Hey, guys. Good morning. And, Josh, welcome to your first call as CEO.\n\nI guess, my question, we seem to be hearing a much different tone from some of your peers in terms of how the EBITDA or cash flow recovery is playing out versus what you guys just reported in the third quarter and your outlook for the fourth quarter. So, I guess, is it fair to assume that your Carnival Princess, your domestic brands, are doing very, very well right now, but it's your non-U.S. brands that are struggling at this point, and that's the issue right now versus your peers? And then, Josh, does that make you think a little bit differently about your portfolio ships, meaning do you still need 9 brands at this point?\n\nJosh Weinstein\n\nYes. Hey, Steve. Thanks for the welcome. So I think you asked a couple of things.\n\nLet me see if I can hit them all. So first of all, I can't speak to our peers. I won't speak to our peers. I'll speak to us.\n\nThe momentum is continuing, which is really promising, as you heard from my prepared remarks, as well as David's. Particularly over the last six weeks, things have ramped up incredibly strong, and the book of business is good. With respect to how we're looking at the brands, obviously, Carnival in the Caribbean has done a great job. They are Americas' cruise line, and it showed through loud and clear as we've been going through this past year.\n\nBut I wouldn't look at this as a North American versus European question. All of our brands are in varying points with respect to their pricing and their occupancy and how those play out, and they're responding to their target audience in their source markets and trying to optimize as best as they can. As you heard in my prepared remarks, and I think what we've talked about already before, is we can do better. I have high expectations for all of our brands to make significant improvement on the revenue side.\n\nAnd some of it's blocking and tackling. Some of it is really pushing the envelope in certain areas. And I actually feel pretty confident so far. I've managed to hit three brands in that type of setting.\n\nIt's been Costa, Holland America and Princess. And the activities that are underway are significant. And I really -- I don't think it's appropriate in this forum to get into any specifics, but we are tracking hundreds of things, some big, some small, that are going to ultimately lead to significant improvement.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. Got you. Thanks for that color, Josh. And the second question would be around 2023.\n\nAnd look, I understand you guys aren't going to give guidance for '23 at this point. But in the past, we've heard previous management at Carnival, kind of talked about it at a very high level, there was a good chance that 2023 EBITDA, there was a chance to exceed 2019 EBITDA. So, Josh, you're now at the helm, and how do you view that probability from what you can see today? Is this something that's still possible, or are you just saying, hey, look, it's too early to make that call?\n\nJosh Weinstein\n\nWell, we're certainly anticipating strong EBITDA in 2023. We're not providing guidance, obviously. So I don't want to get ahead of where we are in that process. Fuel and currency are obviously a big swing, and we'll see how that plays out in 2023.\n\nI have no idea, but we're working hard to generate as much as we can.\n\nOperator\n\nNext question is from the line of James Hardiman with Citi. Please go ahead.\n\nJames Hardiman -- Citi -- Analyst\n\nJosh, welcome aboard. So obviously, there's a lot of discussion about the booking -- I don't know if surge is the right word that you've seen since the relaxation of some of the COVID restrictions. I guess, I'm curious, what, if any, impact that is having on pricing, particularly in the context of we have this per diem decline. I think it's about 4% versus 2019 for the third quarter.\n\nBut then as we look to next year, the pricing seems like it's up meaningfully. And so I'm just trying to connect those two dots and maybe sort of the missing piece is a significant improvement coming off of these restriction relaxations. But maybe paint that picture for us.\n\nJosh Weinstein\n\nSo yes, the volumes have been incredibly encouraging. I can't speak specifically to price over the last few weeks. But I can tell you that the pricing of our business on the books for 2023 overall is actually higher today than it was earlier in the year. As far as what's driving that, I think there's a lot of things that are driving that.\n\nI do think that the fact that we are now able to be more aligned to land-based alternatives reduces a lot of friction and opens up more demand to us and our brands. You heard us mention advertising. We had a different advertising approach versus what our norm was pre-pandemic, and we really -- we scaled way back. And in the process of doing that, we were doing it in the context of the pause and how we wanted to prioritize our resources and focus in on those loyal guests and more efficient channels.\n\nBut as we've been ramping back up to full strength with our advertising strategy, it's starting to pay dividends. And in addition to that, we have, as you heard, we have more and more people sailing again and going back and telling folks that we are a great product, and all of that is helping. So, I can't give you -- I wish I could be scientific and tell you all the drivers and how they impact the pricing, but I'd be lying. I don't think anybody can do that.\n\nSo, we'll just have to see what's working and see what's not and leverage what we can.\n\nDavid Bernstein -- Chief Financial Officer\n\nAnd also, let me just add. When you're looking at the fourth quarter, clearly, we were in a situation where our wave season was impacted. And remember, we didn't start the increase in advertising expense until the third quarter. So that, too, impacted the revenue per diems that you mentioned in the third quarter.\n\nBut as Josh talked about, we are addressing that clearly as we move forward.\n\nJames Hardiman -- Citi -- Analyst\n\nGot it. And then my second question, maybe a bit -- well, it's an open-ended question. But Josh, since you've been at the helm, I don't know if you've had a chance to think through -- or maybe you could help us think through some of the challenges and opportunities facing the company. I guess what I'm trying to figure out is how much of that is sort of a cruise industry set of challenges and opportunities versus Carnival-specific.\n\nAnd take us -- wherever you want to take it, whether it's the mix of your customers, mix of geography, strength or weaknesses of your specific brands, but I'm curious how you sort of slice and dice those two.\n\nJosh Weinstein\n\nWell, overall, I'd say, I think I can say on behalf of the industry, all of us are way too good of a value when it comes to stacking us up versus non-cruise alternatives. And so, I think the more we can break through as an industry with how good of a product we are, how inclusive it can be, that will serve dividends. That's why I'm very committed to our travel agent partners because they are critical for us in that success in being able to communicate that story and convince first timers who don't know cruising, could be daunting, could be confusing and help them get on board because once we get them, they want to come back. I don't know, and so I can't speak to our peers and what they do and how they do it behind closed doors.\n\nI do think the things that we're seeing on the commercial side with all of our brands, and it varies brand-by-brand, but I think -- all I can tell you is specific to our corporation, and I think they're going to really pay dividends for us in a big way.\n\nOperator\n\nNext question from the line of Robin Farley.\n\nRobin Farley -- UBS -- Analyst\n\nSo just kind of looking at the language you've used over the years to describe forward bookings. When you say considerably higher, that's more upbeat language than you typically use. It seems like considerably higher is probably more than 5%, but should we think of it as being more than 10% or would that be a different adjective for that range?\n\nJosh Weinstein\n\nHi. This is Josh. I used to have a dictionary that David provided for everybody when we were doing these preparations back when I was a treasurer. I think it's safe to say this is mid-single digits.\n\nAnd so I guess I can -- there's your answer.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. No. That's very helpful. And then also on the nonfuel expense, it seems like -- and we're still digesting the release, but it seems like your guidance for second-half nonfuel expense is quite a bit higher than previous.\n\nIs it just the advertising that you've mentioned? Are there other things? And I sort of have a follow-up about the advertising, but maybe just to even frame what's happening with the nonfuel expense. Thanks.\n\nDavid Bernstein -- Chief Financial Officer\n\nSure. So if you take what we said about all the quarters and you actually weight average it with the ALBDs per quarter, you get something in the mid- to high-double digits. And we had said mid-double digits before. So, it is a tad higher as a result of potentially more advertising expense than we had previously anticipated.\n\nBut it's not a significant change on a full-year basis from what we said before, just maybe a point or something like that from the previous guidance.\n\nRobin Farley -- UBS -- Analyst\n\nOK. And then, just on the advertising piece, it's just -- you've talked about being ahead in price and volume in '23, and then you talked about this kind of sequentially how things are ramping up. So I guess, just thinking about -- so it seems like demand is growing naturally on its own. So, I guess, why the decision to do more advertising.\n\nAnd I don't know if that's targeted in certain -- I know it's a European demand issue, or just kind of help us think about when you're sort of naturally seeing such strong volume and price on how to think about that. Thanks.\n\nJosh Weinstein\n\nYes. So a couple of things. One is we have volume, but we want to get volume plus price and fill the ships at good pricing. So we just -- we need to be doing more to accomplish that.\n\nIt's not a European versus American phenomenon. And remember, advertising is not just for the moment and filling the ship in the next quarter. It's setting the groundwork for awareness consideration, and ultimately, making that booking decision. And we have to be thinking about this in the context of the fact that we're taking bookings for the next two and a half years, not just the next quarter.\n\nSo we need to be real thoughtful. And the point about new-to-cruise, that's where it makes a huge amount of inroads, particularly as we're building toward wave. And all this -- our goal is to be setting ourselves up really well for a very successful wave, and it has been years since we've had that. And so I think there's a lot of excitement in the organization actually because our game plans are out and we know what we want to achieve.\n\nRobin Farley -- UBS -- Analyst\n\nOK. That's helpful. Thank you. So it sounds like the advertising, it's up versus what you originally thought, but not higher than what you would typically do sort of pre-pandemic.\n\nIs that the right way to think about it?\n\nJosh Weinstein\n\nNo. I wouldn't say that yet, actually. We're back up to those levels. We have more capacity to sail.\n\nSo naturally, that should -- we'll always try to find efficiencies. But there's a lot of pluses and minuses in the equation, and we're working through our 2023 plan with all of our brands now. So, have more insight about how exactly that's going to shape up in a few months.\n\nDavid Bernstein -- Chief Financial Officer\n\nBut it's fair to say that if you look at the four quarters, remember, we had talked about -- we weren't doing much advertising in the first half of the year. And we did increase it in the back half. And I think I had said once before that we did expect advertising overall to be higher than it was in 2019. So what you'll see is a big ramp-up in the back half of this year versus 2019, even higher than the normal level that we would see in the fourth quarter in anticipation of wave season.\n\nOperator\n\nOur next question from the line of Jaime Katz with Morningstar. Please go ahead.\n\nJaime Katz -- Morningstar -- Analyst\n\nI'm hoping you guys can help us think through what the magnitude of FCC is left to work through might be, and when you think we may be sort of through digesting those.\n\nDavid Bernstein -- Chief Financial Officer\n\nSo I think I had indicated in my prepared remarks that we did expect to see FCC's impact yields in 2023, but it would be less than 1%. In 2022, we had seen a couple of points of an impact given our forecast and the expectation. And I think you'll see that it's the FCC sweeteners that you're talking about. And I think you'll see that end with 2023.\n\nJaime Katz -- Morningstar -- Analyst\n\nExcellent. And then from a capital spending perspective, I think there were some shifts in expenses in the table in the press release. Is there anything noteworthy, worth mentioning on different spending programs that have shifted or anything like that? Thanks.\n\nDavid Bernstein -- Chief Financial Officer\n\nYes. Well, just keep in mind that a lot of the capex, depending on which particular item you're looking at, a lot of the capex is in foreign currency. And with the changes in foreign currency, particularly the newbuilds, you will see a reduction in the newbuild capex. The non-newbuild capex, we've been looking at that very carefully and making sure that we optimize those numbers.\n\nSo you did see a decline in 2022 from the previous guidance. And we are relooking at 2023. As Josh had said, we're going to be going through with all the operating companies that plans for 2023. So at this point in time, we haven't made any changes, but we will continue to look at that and talk to them about optimizing capex for 2023.\n\nOperator\n\nNext question from the line of Ben Chaiken with Credit Suisse. Please go ahead.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nSorry if I missed it. I think that FY '23, the language surrounding FY '23 bookings changed slightly. Maybe I'm mistaken. I guess, simplistically, can you help us with the booked position in '23 and maybe how that's changed since the last update relative to '19? It sounds -- I mean, it sounded like bookings have accelerated since the vaccine vertical change, but just a little unclear on the total booked position for '23 relative to the last update.\n\nThanks.\n\nDavid Bernstein -- Chief Financial Officer\n\nSure. So keep in mind that what we're talking about here in terms of an acceleration of the book position or the bookings that occurred in mid-August with the relaxed protocols. And the booking patterns, as we indicated, accelerated. In fact, our North American brands were up 30% over 2019 in the last few weeks.\n\nSo the booking patterns have been tremendous. But the book position, previously we had said was at the higher end of the historical range. And now, we're saying it's at the average. Earlier in the quarter, we were slightly below 2019 levels, but closing the gap and now we have exceeded 2019 levels.\n\nSo, we feel very good about the overall book position, particularly with relaxed protocols and now exceeding 2019 levels. But from a pricing perspective, we are better priced than we were earlier in the year, and we feel very good about that as well.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nOK. That's helpful. And then is that -- are you able to break up -- so it sounds like a little bit of a deceleration in bookings for '23 position. Is there -- I know a few times, is there a difference between European and non-European itineraries in terms of driving that movement?\n\nDavid Bernstein -- Chief Financial Officer\n\nYes. I wouldn't have called it a deceleration during that period. Remember that for most of the quarter, we still had the protocols in effect. And as a result of that, while we were getting bookings, the booking levels were slightly below 2019 and level for 2023.\n\nBut since the relaxation of the protocols, we have seen things accelerate considerably. The other thing to keep in mind is that we have seen a much closer in booking curve than we had previously seen historically. And so that, too, has probably impacted 2023 as well. But with the relaxed protocols and putting us more in line, with the testing requirements gone, we're in great shape.\n\nAnd as I said before, I mean, we're now, in the last few weeks since the relaxation of the protocols, our North American brands were up 30% over 2019 levels, and we feel great about that. So we're looking forward to 2023.\n\nJosh Weinstein\n\nAnd our European brands are doing well, too. They're just operating in a closer in booking window. So, they have seen a significant spike as well. It's just more for a closer in period.\n\nBut again, same thing, mid-August, and it took off.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nOK. And then, just one more on the costs. It sounds like we're in this low double-digit range versus '19 exiting the year. Can you help us, just directionally, maybe how much of that is core underlying costs and how much of that are maybe like fleet ramp-up, COVID protocol related, etc.? Just ballpark splits.\n\nDavid Bernstein -- Chief Financial Officer\n\nSo for the fourth quarter -- well, first of all, let me just say that the fourth quarter, I don't think is a great indication of looking forward data. I think we can do better, and we're going to be having those conversations with our brands. But embedded in the fourth quarter, there's probably a little bit of start-up costs, but most of the ships and most of that was spent before the fourth quarter. But there are protocol costs.\n\nI had said earlier in the year, we were probably spending tens of millions of dollars a month on protocol costs. By the time you get to the fourth quarter, when you're looking at adjusted cruise costs without fuel, you're probably talking about maybe $1 to $1.50 of costs in there that are included in the forecast. So, there is something which is affecting that double digit -- low double-digit projection. But it is, like I said, maybe $1 or $1.50.\n\nAnd I'm not even sure we're going to spend that much, but that's what the brands have included. Given that forecast, we're prepared at about the same time as the relaxation of the protocols.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nNot to belabor the point, but why just call up? Why is 4Q not -- I think you said 4Q is not a good kind of like period to use.\n\nDavid Bernstein -- Chief Financial Officer\n\nYes. I think when you look at all the different things over a full year period. Keep in mind, just as an example -- I'll give you one example. So I've always said that looking at cost by quarter are not a good reflection of the year because things vary by quarter.\n\nAnd I just indicated, I think it was Robin who was asking the question about advertising, and I said that advertising was up considerably in the fourth quarter versus 2019. So if you just take that item alone, that would have had an impact on your double-digit number. And so, no one quarter is ever going to be a good indication of the full year because of the seasonality of the spending by quarter.\n\nOperator\n\nOur next question from the line of David Katz with Jefferies. Please go ahead.\n\nDavid Katz -- Jefferies -- Analyst\n\nI wanted to just get your thoughts on pricing and the value proposition strategy in the context that we look at other areas of hospitality that are driving price, and I recognize your model is different from that. But what are you doing? What can you do? What thoughts do you have about the ability to sort of drive price within the context of the value proposition now?\n\nJosh Weinstein\n\nI mean, it's a good question. There's a lot of answers, right? I mean, it does start with being able to clearly communicate, who the brand is, and then from a marketing perspective, are they targeting the right folks? Are they speaking to them the right way? Do they have the right digital performance marketing agenda that they can generate leads that are effective and turn them into conversion? I mean, it's that whole life cycle, right? And so the discussions that we have been having with our commercial teams at the various brands so far has really been focused on all of it. And it's revenue management, right? It's how we choose to do our pricing curves, how we introduced promotions at the right time, how we use the opaque channels. Yes, I mean, it's literally it's the whole way we do things in the commercial space.\n\nAnd there are opportunities for us. I can't speak to people outside our company. For us, we have a good amount of opportunity to drive significant improvement in our revenue profile by making improvements in varying aspects of that whole cycle.\n\nDavid Katz -- Jefferies -- Analyst\n\nI appreciate that. And just on another matter, I just want to be clear about the possibility of any sort of further capital raising out there. Are those categorically off the table? Are those largely off the table, or are they maybes at this point?\n\nDavid Bernstein -- Chief Financial Officer\n\nSo from a capital perspective, we are always opportunistic. We did indicate back, I think it was in March, that we were looking to refinance the $3 billion of maturities in 2023. We've worked through $2.5 billion of that. But we always look at -- we remain opportunistic.\n\nWe look at the capital market. We try to look longer term and to see what needs we have and what we should do rather than just looking at next quarter or the next six months. And we will evaluate opportunities, and we'll look at all options as we always do to make sure that we are in a good, solid position. So it's the best answer I can give at this point in time.\n\nOperator\n\nNext question from the line of Ali Naqvi with HSBC. Please go ahead.\n\nAli Naqvi -- HSBC -- Analyst\n\nJust on maybe some of your comments on the Q4 trends. Could you give us any sort of commentary on a like-for-like basis regarding volumes? And is any of your commentaries should suggest that there's any consumer weakness demand or is it mainly due to, as you said, the future cruise credits and closer in bookings? Thank you.\n\nDavid Bernstein -- Chief Financial Officer\n\nSo I'm not sure I fully understood your question, but you were talking about Q4. And as far as Q4 is concerned, one of the things that I had indicated in my prepared remarks, we did expect to see a slightly increased occupancy. Now, keep in mind, if I went back to 2019, we saw a nine percentage-point drop in occupancy from third quarter to fourth, which is pretty typical because of the third quarter is the seasonally strong summer season for the Northern Hemisphere, and we have all those kids on board. So a drop in occupancy is pretty normal.\n\nBut we aren't expecting this year a drop in occupancy in the fourth quarter. We're expecting an increase in occupancy, and that's a result of the cabin occupancy build that we are expecting. So we're moving in the right direction. And I think we're in good shape for the fourth quarter.\n\nHopefully, that answers your question. If not --\n\nJosh Weinstein\n\nYes. I think maybe there's a couple of other points to put out there as well. We started in a hole because we didn't have the benefit of our Q4 having gone through a successful wave in the beginning of the year. All the things that you heard us talking about with respect to the advertising spend and the change in tactics we had at the beginning of the year, the protocol changes, all those things left us where we were.\n\nThe great news is our brands have been doing a good job of adapting to a closer in booking window. And so as you probably heard by now, because we've said it a couple of times, the volume that we are getting in bookings is certainly not just for 2023, it is also closer in and benefit in Q4 as well. And the brands are doing a good job of optimizing the demand we're seeing on a shorter-term basis.\n\nAli Naqvi -- HSBC -- Analyst\n\nGot it. And maybe just with the benefit of your experience, what is the sort of impact to the wave season after you had sort of hurricane and the impact from that, please.\n\nBeth Roberts -- Senior Vice President, Investor Relations\n\nThe impact of the hurricane --\n\nAli Naqvi -- HSBC -- Analyst\n\nOn wave season.\n\nJosh Weinstein\n\nWell, so first of all, as we said in the press release, on behalf of Carnival Corporation, I would like to extend our deepest concern for those affected by both Hurricane Ian and Fiona, and our thoughts and prayers are with anybody who's been impacted. With respect to the current impact, we don't see anything significant on our business. At this point in time, we don't anticipate anything coming out of these hurricanes that would have any type of significant impact at all on our upcoming wave season.\n\nDavid Bernstein -- Chief Financial Officer\n\nYes. But by the way, if I had to estimate the impact on us at this point in time, clearly, because of some of the disruption, probably we have canceled a couple of cruises. And probably less than $10 million impact from both hurricanes, Fiona and Ian. But remember, in a normal year, there's always an impact from hurricanes, and the impact right now for these two is probably less than $10 million.\n\nOperator\n\nOur next question from the line of Brandt Montour with Barclays. Please go ahead.\n\nBrandt Montour -- Barclays -- Analyst\n\nSo I just wanted to maybe talk a little bit more about '23, and specifically put the issues that you guys are having with current sort of booking window lengths or the length of time of the average booking that you called out as impacting the current quarter into context, which is that looking at '23, right, you're ahead of historical volumes for '23, you're ahead of pricing for '23 against historical pricing. And your current run rate of booking volumes right now are well ahead of '19. And so, when you add all that up, I guess, I'm just trying to figure out what else -- what, like besides exogenous events, could sort of derail you from turning the calendar year in a normal position versus history. Like, why else would that not be a normal year, except for maybe the length of telling people are averaging their booking out into the future?\n\nJosh Weinstein\n\nYes. That's a good question. I mean, I think it points to what we were trying to express about how positive we are about the trajectory and how 2023 is already positioned. So, we're going to do everything we can to make '23 a fantastic year.\n\nAnd so far, we've got a good base upon which to do it. We're ramping back things, ramping up things that we hadn't been doing in the past few years, a few months, whatever that might be, depending on the actions. And our goal is to smash it in 2023.\n\nDavid Bernstein -- Chief Financial Officer\n\nAnd the only thing I'll add to that is our onboard revenue per diems have been up significantly in '22. And as I said in my notes, that also puts us on track for a record year in 2023 for onboard revenues.\n\nJosh Weinstein\n\nYes. And we keep leveraging more and more our presales of onboard spending, which is wind at our backs. We have a richer cabin mix as we talked about. So there are quite a few things that set us up for success that we thought we need to deliver.\n\nBrandt Montour -- Barclays -- Analyst\n\nAnd if I could just maybe ask a question about pricing and how to think about the effect of promotional activity this year, which for the whole industry was more elevated, or at least, we perceive it to be more elevated it was sort of as expected as the industry doubled its capacity essentially overnight earlier this year. But I guess, my question is, when you think about next year and headline prices versus net prices after promo, is there some kind of dynamic where it might be easier to lift pricing over the next several quarters just by peeling off promotional activity? It feels like that would be an easier exercise than raising headline prices, but I could be completely off.\n\nJosh Weinstein\n\nYes. Look, there's lots of levers that our brands use via opaque channels, via promotions and such. We have the same goal, right, in any event, which is to generate as high a price as we can and as much revenue as we can. And so to your point, there's opportunity when you look at what we've done this year versus how we're tackling next year, and we're going to do our best to perform at a high level.\n\nBrandt Montour -- Barclays -- Analyst\n\nThanks, guys.\n\nJosh Weinstein\n\nThanks, Brandt. I think, operator, I think that's all the time we have for calls today. But, thank you, everybody, for joining and listening.\n\nDavid Bernstein -- Chief Financial Officer\n\nYes. No. Thank you very much, everybody. And look forward to working with Josh.\n\n2023, as we said, with pricing being up considerably higher on our books and all the other things we indicated, we feel very good about 2023. So, thanks, and have a great afternoon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJosh Weinstein\n\nDavid Bernstein -- Chief Financial Officer\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nJames Hardiman -- Citi -- Analyst\n\nRobin Farley -- UBS -- Analyst\n\nJaime Katz -- Morningstar -- Analyst\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nAli Naqvi -- HSBC -- Analyst\n\nBeth Roberts -- Senior Vice President, Investor Relations\n\nBrandt Montour -- Barclays -- Analyst\n\nMore CCL analysis\n\nAll earnings call transcripts"
}