{
  "companyName": "Wix.com",
  "companyTicker": "WIX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/wixcom-wix-q3-2022-earnings-call-transcript/",
  "content": "Wix.com (WIX 1.48%)\nQ3 2022 Earnings Call\nNov 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Wix Q3 2022 earnings conference call. [Operator instructions] I would now like to hand the conference over to your speaker today, Ms. Emily Liu, investor relations analyst.\n\nPlease go ahead.\n\nEmily Liu -- Investor Relations\n\nThanks. And good morning, everyone. Welcome to Wix's third quarter 2022 earnings call. Joining me today to discuss the results are Avishai Abrahami, CEO and co-founder; Nir Zohar, our president and COO; Lior Shemesh, our CFO.\n\nDuring this call, we may make forward-looking statements, and these statements are based on current expectations and assumptions. Please consider the risk factors included in our press release and most recent Form 20-F that could cause our actual results to differ materially from these forward-looking statements. We do not undertake any obligation to update these forward-looking statements. In addition, we will comment on non-GAAP financial results and key operating metrics.\n\nYou can find all reconciliations between our GAAP and non-GAAP results in the earnings materials and in our interactive analyst center on the investor relations section of our website, investors.wix.com. With that, I'll turn the call over to Avishai.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nThanks, Emily. And good morning, everyone. Thanks for joining us today. I want to start today's call with a few highlights from the quarter and provide an overview of some exciting new products we recently announced.\n\nNir and Lior will then share more details on our operations and financial results, and then we will take some questions. Despite continued uncertainty, the strong fundamentals of our business, along with great execution, led to revenue growth ahead of our expectations and significant improvements in profitability. Revenues in Q3 were $346 million, or 8% growth year over year. On a constant currency basis, revenues were $351 million, or 10% growth year over year.\n\nWe consider our global reach to be one of our key competitive advantages. However, given the recent changes in foreign exchange rates, it has become a meaningful headwind to our financial results. Our free cash flow this year would be more than double if you assume year-over-year constant currency rates. While there is still a great deal of uncertainty and volatility in the macro economy, which we expect will continue into 2023, we are focused on what is under our control.\n\nWe are already seeing the results of the cost reduction plan we put in place last quarter, with improvements to margins and free cash flow this quarter. Our non-GAAP gross profit grew more than 10% year over year, resulting in a non-GAAP gross margins of 63%. We returned to positive free cash flow, excluding the investment in our new headquarters. Given this successful execution, I am happy to say that we are on track to achieve our free cash flow margin targets for this year and next year that we outlined in our three-year plan.\n\nWe also continue to focus on building our platform to be the leading destination for creating and managing an online presence for self-creators, professionals, and developers. Our platform is built to meet the needs of any type of user and any type of business, and we continue to add products, services, and solutions to the platform to deliver more value to our users and partners and help them succeed online and offline. As part of our strategy in growing partners revenue, we have built a more robust platform for designers and developers. And we intend to continue to expand and open our platform to accelerate more powerful solutions for developers.\n\nTo highlight our commitment to this community, in September, we hosted our first ever developer conference, Wix DevCon, in New York. Hundreds of developers joined us as we introduced new capabilities and heard their feedback on how they use Wix. At DevCon, we announced Wix Blocks, our new high-velocity ecosystem that enables professional designers to build responsive and customizable components. These components are then reusable across multiple websites built on Wix and Editor X.\n\nWix Blocks enables professionals to create an application with the ease of drag and drop, and allows them to work concurrently on the same project. All of these features increase developer productivity and efficiency. We have been using Wix Blocks internally, and I can say it has created very positive changes in our dev velocity here. We believe that this offering will bring more developers and projects to Wix and create a more rich experience for them and others.\n\nWe also announced our new eCommerce vision, a new open platform that provides developers the freedom and the flexibility to build scalable custom e-commerce experiences for any business need. Wix Blocks and the new Wix eCommerce platform are just two examples of how we are expanding our offering for professional coming to Wix and growing the value of our platform. We remain committed to delivering best-in-class products and services to all of our self-creators and partners to allow them to create and succeed online. Before I hand it over to Nir, I just want to thank the entire team here at Wix for all of their hard work and for their continued focus on our users and their needs.\n\nI'll now hand it over to Nir to talk a bit more about Q3 and provide an operational update. Nir?\n\nNir Zohar -- President and Chief Operating Officer\n\nThank you, Avishai. And thank you, everyone, who is joining us this morning. As Avishai mentioned, the fundamentals of our business remain strong as can be seen in the cohort bookings data. As you can see on Slide 12, cumulative cohort bookings for our Q1 2022 cohort increased to over $47 million through Q3.\n\nThis is 5% higher than the Q1 2019 cohort in its first three quarters and 8% higher on a year-over-year constant currency basis. This growth is a continuation of a trend we saw last quarter and evidence of our strong fundamentals. Conversion and retention rates remained at high level, and average booking per subscription continues to increase. Despite the volatile macro environment and unfavorable FX we are experiencing, we continue to improve the monetization of users through data-driven marketing and a robust product offering.\n\nOur user additions of 4.7 million in Q3 reflect the current demand environment. As the global economic slowdown continues, beginning in September, we adjusted our marketing spend to focus on high-intent users. This resulted in a slight headwind to new user additions in Q3 while meaningfully improving return on our marketing investments. We expect this effect to continue through Q4.\n\nOperationally, we continue to execute on our cost reduction plan that we outlined last quarter. We are hiring new employees only for high-priority positions, and we continue to drive operational efficiencies across our customer care, R&D, and sales and marketing teams. We have also continued to optimize overhead costs through reductions in our real estate footprint, software costs, and third-party advisory costs. I'm also excited to report that last month, we moved the first wave of employees into our new headquarters campus in Tel Aviv.\n\nWe also consolidated the rest of our Tel Aviv team that was spread out among about a dozen small locations in the city to a single location in the port. In addition to the operating cost savings we will realize from having a small number of offices, bringing our employees in Tel Aviv physically together is already delivering efficiencies to how we work. Building our new campus and relocating thousands of people has been a massive project, and I am incredibly proud of all the hard work from our team to make it happen. The second and final wave of employees will move to the campus next summer, at which point, all of us in Tel Aviv will be under one roof.\n\nBefore I hand it over to Lior, I also want to take this opportunity to recognize our team in Ukraine. I'm really proud of our people and how they remain strong during these extremely hard and stressful times. With all of the hardships they have experienced, which has actually intensified recently, our Ukraine team's efficiency and productivity remain high. Our thoughts are always with them and their families, while we continue to focus on everyone's safety and well-being.\n\nWith that, I will now hand it over to Lior to walk through more details on our financials. Lior?\n\nLior Shemesh -- Chief Financial Officer\n\nThanks, Nir. And welcome, everyone. As Avishai mentioned, we exceeded the top end of our guidance range for revenue in Q3, and we greatly improved our margins this quarter, leading to positive free cash flow, excluding our headquarters capex. We believe this trend of improving margins and free cash flow will continue into Q4 and next year.\n\nTo begin, I want to share an update on our cost reduction plan and the benefits we are already seeing. Total non-GAAP gross margin improved from 62% in Q2 to 65% in Q3, and we expect another 100 basis points of improvement in 2023. Non-GAAP operating income improved by over 280 basis points in Q3 compared to last quarter. And in Q4, we expect to generate positive non-GAAP operating income for the first time since Q4 of 2019.\n\nWe now expect total non-GAAP operating expenses to be roughly flat in 2023 compared to this year, driving positive non-GAAP operating income for the full year. This trend, along with improved gross margins, means that nearly all of our incremental revenue in 2023 will flow through to the bottom line. We generated positive free cash flow, excluding headquarters capex, of $4.6 million in Q3. To sum up, we are already seeing significant benefits from our cost reduction plan and are sticking to the commitment of cash flow margins we've made in our three-year plan.\n\nNow, I'll quickly go through some highlights of our Q3 results. Revenue was $345.8 million, or 8% year-over-year growth, which was slightly above the high end of our guidance range due to strong performance in our cohorts. On a year-over-year constant currency basis, revenue was $350.8 million, or 10% year-over-year growth. Transaction revenue, which is a subset of Business Solution revenue and is composed primarily of Wix Payments, was $36 million in Q3 or 12% year-over-year growth.\n\nGPV was $2.5 billion in the quarter, roughly flat compared to last quarter as we continue to see slower growth in online purchase activity. Our take rate, measured as transaction revenue as a percentage of GPV, continued to increase as the percentage of GPV running through Wix Payments grows. Partners revenue, which includes all types of revenue generated through designers and developers who build sites for others, as well as B2B partnerships, grew to $86.9 million, or 24% year over year. On a constant currency basis, the year-over-year growth was 26%.\n\nWe continue to see more partners building on Wix as we gain more traction in the professional community despite macro pressures impacting project pipelines. Total bookings in Q3 was $352.5 million, and on a year-over-year constant currency basis was $366.5 million. I want to highlight a few things related to this result. Note that FX rates impact bookings much more significantly than revenue as we collect the cash upfront for subscriptions and renewals.\n\nSlower growth in GPV also impacted bookings this quarter. Also, remember that in Q3 of last year, we recognized bookings related to B2B partnerships of $48 million, which included our largest ever B2B partnership, Vistaprint, creating a very difficult comp this quarter. If you remove this amount from bookings in Q3 of last year, our FX neutral year-over-year growth this quarter is 12%, which is the true indication of our growth on a year-over-year basis. Changes in bookings related to B2B partnerships do not indicate near-term changes in revenue because they have very different revenue recognition schedules.\n\nBookings associated with those B2B partnerships are recognized into revenue over multiple years, while bookings associated with our subscription packages, typically, are recognized into revenue over one year. Finally, as the macroeconomic conditions remain challenged today, we have seen companies we speak to about B2B partnerships tighten project budgets and risk appetite, slowing the magnitude of new agreements. We expect this trend to continue in Q4 and next year. Despite all of this, we are excited by the strength of our B2B pipeline and the growing contribution from existing partnerships.\n\nTurning to our outlook for the remainder of the year. We expect total revenue in Q4 to be $349 million to $354 million, or 5% to 6% year-over-year growth. Last quarter, our full year revenue outlook was for 8% to 10% year-over-year growth. Factoring in FX changes since the summer, we have narrowed our outlook to 9% year-over-year growth.\n\nThe midpoint of our full year outlook has not changed as we increased the bottom end of the prior range. For the full year, assuming constant currency, total revenue would be about $20 million higher, or 10% to 11% year-over-year growth. We expect free cash flow in Q4 to be $47 million to $50 million, excluding our headquarters capex. Achieving this range will produce the highest free cash flow quarter in our history.\n\nFor full year free cash flow, excluding headquarters capex, we stated last quarter that our expectations were for 2% to 3% of revenue. Due to FX changes, we now anticipate free cash flow margin to be at around 2% of revenue for the full year. Assuming year-over-year constant currency, our free cash flow for the full year would be $43 million higher, or total of 5% of revenue, which is the high end of the range we presented in our three-year plan. We will provide more detail on 2023 during our Q4 earnings call in February.\n\nBut I can comfortably say now that with the success of our cost reduction plan and the operational efficiency improvements, we expect to achieve the free cash flow margin in 2023, consistent with the three-year plan we shared in May. With that, we will now go ahead and take your questions.\n\nOperator\n\n[Operator instructions] Our first question will come from Brent Thill of Jefferies. Your line is open.\n\nBrent Thill -- Jefferies -- Analyst\n\nThank you. Lior, just on the cost savings plan, where do you still see the biggest opportunity you had to drive improved efficiency? And maybe for Avishai, just as it relates to overall demand, can you just give us a sense of where are the pockets of strength you're seeing and where maybe some of the weakness you're seeing show up a little more pronounced? Thanks.\n\nLior Shemesh -- Chief Financial Officer\n\nYes. So, I will start with the first question. I believe that the cost reduction that we've made will be enough to meet the targets that we set in our May analyst day. And I think that it's also very important to understand that we are committed to the free cash flow targets that we outlined in the May analyst day.\n\nSo, we will adjust, obviously, the cost accordingly based on the macroeconomics that we see. But I think that it's very important to mention that we believe that we can reach this goal even with a lower growth in terms of the top line.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nI'm not sure I understand how to connect the question about cost reduction and demand. But I can say, overall, on demand, what we're seeing is that the demand is pretty stable now, and we're still seeing the same fundamental strength that was before, conversion and retention and ARPU. And so, the top of the funnel is stable and back or a bit above pre-COVID levels. So, I found it encouraging.\n\nBut we see it with everybody. And I think all of our peers experience something similar. We're actually, on a relative base, again a bit ahead. So, stable, doesn't decline anymore.\n\nAnd I think that, as the recession will continue to evolve, we continue to see changes there.\n\nBrent Thill -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment please for our next question. Our next question will come from Andrew Boone of JMP Securities. Your line is open.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nHi, guys. Thanks much for taking my questions. Can you talk about the demand from partners versus self-creators? And then, I want to go to marketing. I believe the original guide was for no change in acquisition marketing.\n\nSo, can you just help us understand whether there's a change as you guys focus on higher-intent users? Is that an adjustment for near-term macro? Or is there something else that you guys are changing in terms of the payback targets? Thanks so much.\n\nNir Zohar -- President and Chief Operating Officer\n\nAndrew, I'll take the first question about the demand from partners. So, you know, you said, how is that related to what we're seeing demand from partners versus demand from self-creators. And, obviously, those two have a relation between them, right? Naturally, when the self-creators or generally small businesses have least tendency to onboard online to build a commerce website, or to expand their business online, that will also affect the amount of projects that our partners are getting. So, from that perspective, obviously, we've seen a decline from previous year's growth but still are seeing a very, very healthy growth even so.\n\nYou have to remember that for us, and again, we're still seeing the compounding effect on the cohorts of the partners. So, with that's a big strength even at these growth rate. And this is obviously something that's going to continue benefiting us as we go forward.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nOn marketing, so currently, we adjusted our marketing according to market demand as the -- well, of course, as the slowdown on the global economy continues. We think that the demand behaves differently in different kind of channels of demand. So, we're seeing that it made very little effect on the high-intent users and more of an effect on the low-intent users or people that for more of a casual interaction and then got into a bit more of a commitment. Of course, we adjusted our marketing activity according to that.\n\nAs far as the effect on the current, on the new cohorts, currently, it seems to be very small effect. So, I'm very optimistic that this actually allow us to be better, but we'll continue to update as it evolves.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And one moment please for our next question. Our next question will come from Ron Josey of Citi. Your line is open.\n\nRon Josey -- Citi -- Analyst\n\nGreat. Thanks for taking the question. I wanted to maybe follow up a little bit, Avishai, in your comments on macro in the letter. I think the letter talked about some delay in new signings of B2B partners, but then also a smaller competitive landscape here.\n\nAnd so, I just wanted to understand that a little bit more, both on just the partnerships and then the competitive landscape. And then, Lior, just a question on capex, because we're getting it from clients. But total HQ capex was 27 million, but it looks like total capex is 22. Can you help us understand the dynamic between the two, please? Thank you, guys.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nLior, you can answer both.\n\nLior Shemesh -- Chief Financial Officer\n\nYes. So, I will start with the B2B partnership. So, there are actually two cases over here that we need to understand. First of all is the obvious one, which is due to the macro uncertainty, those B2B partners less willing to commit to a long-term agreement.\n\nNow, let's remember how exactly we recognize the bookings for B2B partnerships. It is based on a multiyear commitment of our partners. So, for example, Vistaprint, we recognized $48 million as bookings. That was the level of commitment that we had in the agreement.\n\nSo, first of all, we see less appetite to provide a long-term commitment which is, you know, makes sense during an uncertainty time. The second thing is, obviously, the slowdown overall in the market also affect our partners because, at the end of the day, it's the same users, the same end users that they serve. But it's very important to mention that this does not diminish the potential of a deal. It only affects the amount recognized in booking upfront, meaning that the overall potential of a deal is remained the same, you know, in term of revenue is mostly impact, as I mentioned before, about the willingness to commit.\n\nSo, this is with regard to that. With regard to the capex of about 27 million in Q3, I'm not sure exactly what was the question, how -- what was not -- what was the question?\n\nRon Josey -- Citi -- Analyst\n\nSorry, it was more -- it looks as if the capex -- total capex was a little bit lighter than the capex spent on HQ. We can follow up about it later.\n\nLior Shemesh -- Chief Financial Officer\n\nOK.\n\nRon Josey -- Citi -- Analyst\n\nBut also, you touched on the smaller competitive landscape as well. I understood the partner side. Thank you, Lior.\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nYeah. If you're asking about small competitors that compete directly with us, then I think that we've seen that there is a slowdown everywhere as we had. Of course, in a recession, the economy, of course, is not growing as quickly. And I think that all of us that provide solutions for information of new businesses, for marketing department, the way that you advertise and where you monetize, of course, experience that.\n\nOn a relative basis, I think we are actually doing better than most or the one that we met. So, we actually managed to continue to increase our position in the market, which makes me very confident that once we're going to see a recovery from the recession, all the hard work we placed into our products and brand will bear fruit.\n\nRon Josey -- Citi -- Analyst\n\nThank you, Avishai.\n\nOperator\n\nThank you. And one moment for our next question. The next question will come from Elizabeth Porter of Morgan Stanley. Your line is open.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much for the question. The Q4 guidance implies about 5% to 6% revenue growth year over year exiting fiscal 2022. And how should we put that into context just relative to Street's 11% growth for fiscal 2023? My question is, do you think the business can accelerate growth into next year? And if so, how do the factors like B2B contribution or pricing start to net with some of the macro softness? Thanks.\n\nLior Shemesh -- Chief Financial Officer\n\nSo, again, I think that we explained before about the reasons for the revenue growth, but I want to provide a few numbers with regard to the FX that can explain, you know, at least a big part of the reason. The FX effect on a yearly basis is about, you know, more than $40 million. And a lot of it has actually happened in the last couple of quarters. And also in the last quarter, you know, what happened to the euro and the British pound.\n\nSo, I think that this is something that we need to take into account. Obviously, we see the effect of the slowdown. And it's important to mention that because, you know, we hope -- we all hope and assume that it will recover at some point of time. But we do believe that the fundamental of the business are very strong.\n\nWe don't see a change in those fundamentals. Therefore, once the economy will recover, I believe that we will be back to what we said during the analyst day in terms of what we see as a potential growth, both for self-creators but also for partners.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGot it. And then a quick question on retention. I know you mentioned it remained strong through September. And you rolled out new prices in the spring.\n\nSo, just wonder, what's the reaction for customers that have renewed over the recent months? And any difference in the ability to absorb higher prices in either the self-creator or the partner channel?\n\nNir Zohar -- President and Chief Operating Officer\n\nHey, Elizabeth. It's Nir. No, we haven't seen anything which is significantly different reaction to what we expected. Obviously, expectations were built on our past experience of doing this kind of price changes and exercises for our user base.\n\nSo, even in this environment, we didn't see any significant change or impact that came through that. Obviously, we've seen the positive impact of seeing higher ARPS coming from the price increase.\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nThank you. And one moment please for our next question. Our next question will come from Trevor Young of Barclays. Your line is open.\n\nTrevor Young -- Barclays -- Analyst\n\nGreat. Thanks. Just dovetailing on that last comment that you're seeing some lift from pricing. How much lift is embedded in the 4Q rev guide from price? And then, second question, on international, with both Latam and Asia continuing to lag in terms of growth, I know those are smaller as a percentage of revenue.\n\nBut how critical is it for you to get momentum going there? And what's going to be the strategy to, you know, get growth to come back in line with total company?\n\nLior Shemesh -- Chief Financial Officer\n\nYeah. So, I will start with the first question about the pricing. So, as you all know, we began to roll it out in April, May. So, a bit more than half of our customers were exposed -- already exposed to that.\n\nObviously, it will continue in Q4 and full effect halfway through 2023. There is a positive impact of our pricing. We mentioned before that we see a positive in terms of the value of the cohort, and this is part of our models also for Q4 and definitely for 2023, as we will talk about it on the February call. With regard to Asia-Pacific, most of the impact was actually on the GPV.\n\nThis is why you see that happening, meaning that we see a more kind of a slowdown on online purchasing, and that affected, you know, the overall GPV. And, you know, it is reflected in the Business Solution.\n\nTrevor Young -- Barclays -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. One moment please for the next question. Our next question will come from Ken Wong of Oppenheimer & Company. Your line is open.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nGreat. Thanks for taking my question. I just wanted to clarify some statements around just cash flow, Lior. You mentioned that you're on track to hit your three-year plan, so that would be 10%, 20% free cash flow margin.\n\nSo, for '23, let's say, 10% since that's the low end. You also mentioned that with the cost cuts that we could anticipate an additional 150 million of operating income. So, is it fair for me to layer that 150 on top of the 10% margin hypothetically?\n\nLior Shemesh -- Chief Financial Officer\n\nThe $150 million that we indicated in the shareholder update was to provide some kind of understanding about the differences between the operating loss that we assume in 2023 during the analyst day and the overall operating profit that we are going to have in 2023 as a result of the cost reduction. Meaning that it's all part of it. As I mentioned before, we are committed to the profitability targets in the three-year plan. And everything that we've done in the last few quarters is to make sure that we will meet it.\n\nSo, for your question, we will meet what we indicated as targets. It will not -- the 150 is not on top of it.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nOK. Great. That was just a clarification.\n\nLior Shemesh -- Chief Financial Officer\n\nOK.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nAnd then, just on the B2B side, recognizing that you guys are seeing a little bit of headwinds there, you guys still grew 12% kind of constant currency, excluding Vistaprint. Is that the right run rate to think about that business growing? Or should we kind of dial that down a little bit because of the incremental headwinds you're seeing?\n\nLior Shemesh -- Chief Financial Officer\n\nThe 12% that we mentioned before was after you take into account the effect of the tougher comp, meaning that -- trying to take out the Vistaprint effect and then you get to the 12% growth in terms of the overall bookings. Look, I think that we all understand that it is hard. This is why we didn't provide guidance for bookings rather than revenue. Booking is more lumpy because of those B2B partnership deals.\n\nSometimes, they push in one quarter, sometimes, two quarters. But we still have a lot of belief in this business. I think that it's -- even if -- it's even performing better when you see the pipeline, but also above the competition, that, you know, many of our competition in this market literally disappeared. So, I believe that we are positioned in a much, much better way business-wise to take more market share in this specific segment.\n\nWith regard to the overall booking and what we see for next year, it's hard to tell. I think that on February, we are going to share more light on what we believe will be the bookings -- the revenue for next year. But again, one thing that I can mention, that excluding the overall economy, the macro economy effect that we see right now, we are -- we believe that the target that we set in our three-year plan for the long-term is the one that we really believe in.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nOK. Fantastic. Thank you guys.\n\nOperator\n\nThank you. One moment please for our next question. Our next question will come from Naved Khan of Truist Securities. Your line is open.\n\nNaved Khan -- Truist Securities -- Analyst\n\nHi. Thanks a lot. Two questions from me. First one on the cost side.\n\nWe saw the Israeli currency weakened versus the dollar. And considering that all of your R&D is out of Israel, I didn't see a dollar impact on the cost side in Q3. How should we think about that? And then you talked about going after the higher-value customers. Where are you seeing the opportunities? Is that -- is it mostly geo-focused, meaning you're finding those customers here in the U.S.\n\nversus other markets? Just give us your thoughts there.\n\nLior Shemesh -- Chief Financial Officer\n\nSo, with regard to the Israeli shekel, it's a great question. Usually because we are exposed so deeply to the Israeli shekel and dollar as we pay most of the salary in Israeli shekel, we do a hedging program that was approved by our board of directors. So, we did it at the beginning of the year in order to make sure that we can meet the budget. So, therefore, most of the year or all of the year actually, even part of next year, is already hedged in a less favorable dollar to shekel as we see right now.\n\nSo, there is literally no difference when it go up and down because of those hedging program.\n\nNir Zohar -- President and Chief Operating Officer\n\nAnd then, about your second question, this is Nir. In terms of the opportunities for the higher-intent users, you know, naturally, we do not share, for competitive reasons, the details of how we operate our marketing. I can just generally say that the opportunities are global. And, obviously, we go after them wherever we see them.\n\nNaved Khan -- Truist Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment please for our next question. Our next question will come from Deepak Mathivanan of Wolfe Research. Your line is open.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for taking the question. I just have two. So, within the partner business, can you help us a bit more on the agency side? You've added a lot of people over the last few years to kind of onboard more agencies and professionals.\n\nHow are the returns there so far? What is the kind of best way for investors to track it? And then a second question maybe for Lior. You know, the $150 million cost savings is a good start. But if I kind of look at your fixed cost base in areas like, you know, customer support and then headcount in sales, etc., it's still somewhat elevated with the 2019 levels. Where do you see more opportunities to reduce cost if macro continues to weaken and returns on some of these investments that you've made in the past 12 months are maybe slow to come by? Thank you so much.\n\nLior Shemesh -- Chief Financial Officer\n\nSo, with regard to the -- I will start with the second question about the cost. Yes, the cost still -- they are still elevated from the 2019, obviously, because our business is also elevated. I believe that we took a $150 million cost reduction decisions. And it's on a run rate basis, meaning this is something that it's going to repeat.\n\nWhat we actually created, and we mentioned that, is that in 2023, for example, the entire growth in revenue is going to be shown as profits because we are not going to increase the expenses versus 2022. In some cases, we actually decrease it. Now, there is a kind of differences when you look at the overall expenses. So, for example, we, you know, still are investing in R&D and something that we will continue to do.\n\nBut I believe that, in terms of the efficiency, you know, as a company, we always look for efficiencies, and we will continue to do that. You know, for example with Care, it was not just about headcount reduction but also, you know, developing new technologies in order to support our customers in a much more efficient way. So, to your question, we will continue to do that to find more way to be more efficient, and by doing that, you know, to create more leverage on our expenses. This is one.\n\nWith regard to partners, I believe that Nir can answer that.\n\nNir Zohar -- President and Chief Operating Officer\n\nYeah. So, in terms of the partners and the agencies, you know, as we highlighted in our analyst day, obviously, we've invested into the product as well as the technology as well as the people who support that business. We've done so because -- and we demonstrated that when we broke out the partner cohorts, is that we're seeing that compounding revenue retention that is unique and so special for those specific cohorts. Obviously, with the slowdown, their own pipeline has slowed and to some extent.\n\nBut we assume that once there is a recovery, they will obviously benefit from that, like everyone else. In terms of the -- I think one of the things that is worth mentioning is that we do believe that the cost reduction measure that Lior mentioned will probably accelerate the margins of partners even better than what we thought about before.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGot it. OK. Thank you.\n\nOperator\n\nThank you. And I'm seeing no further questions in the queue. I would now like to turn the conference back to the company for closing remarks.\n\nEmily Liu -- Investor Relations\n\nThanks, everyone. Thanks to everyone who asked a question. And thanks, everyone, for joining. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEmily Liu -- Investor Relations\n\nAvishai Abrahami -- Co-Founder and Chief Executive Officer\n\nNir Zohar -- President and Chief Operating Officer\n\nLior Shemesh -- Chief Financial Officer\n\nBrent Thill -- Jefferies -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nRon Josey -- Citi -- Analyst\n\nElizabeth Porter -- Morgan Stanley -- Analyst\n\nTrevor Young -- Barclays -- Analyst\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nNaved Khan -- Truist Securities -- Analyst\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nMore WIX analysis\n\nAll earnings call transcripts"
}