{
  "companyName": "Credicorp",
  "companyTicker": "BAP",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/credicorp-bap-q2-2022-earnings-call-transcript/",
  "content": "Credicorp (BAP 0.04%)\nQ2 2022 Earnings Call\nAug 12, 2022, 10:30 a.m. ET\n\nOperator\n\nGood morning, everyone. I would like to welcome all of you to the Credicorp Limited second quarter 2022 conference call. A slide presentation will accompany today's webcast, which is available in the Investor section of Credicorp's website. Today's conference call is being recorded.\n\n[Operator instructions] Now, it is my pleasure to turn the conference over to Credicorp's IRO, Milagros Ciguenas. You may begin.\n\nMilagros Ciguenas -- Investor Relations Officer\n\nThank you, and good morning, everyone. Speaking on today's call will be Gianfranco Ferrari, our chief executive officer; and Cesar Rios, our chief financial officer. Participating in the Q&A session will also be Francesca Raffo, chief innovation officer; Reynaldo Llosa, chief risk officer; Diego Cavero, head of universal banking; and Cesar Rivera, head of insurance and pensions. Before we proceed, I would like to make the following Safe Harbor statement.\n\nToday's call will contain forward-looking statements, which are based on management's current expectations and beliefs, and are subject to a number of risk and uncertainties. And I refer you to the forward-looking statement section of our Earnings Release and recent filings with the SEC. We assume no obligation to update or revise any forward-looking statements to reflect new or change events or circumstances. Gianfranco Ferrari will start the call discussing our strategic initiatives followed by Cesar Rios who will comment on the macro environment in which we work, our financial performance and provide an update on our outlook for 2022.\n\nGianfranco, please go ahead.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nThank you, Milagros. Good morning, everyone. Thank you for joining us today. Please turn to Slide 3 of our earnings presentation.\n\nDuring the quarter, we continued to advance on the execution of strategic initiatives across our operations, increasing digital customers and advancing on financial inclusion. We delivered another set of robust financial results and closed the quarter with a solid balance sheet while maintaining healthy asset quality. Cesar will discuss this in more detail shortly. Importantly, we are well positioned to leverage additional opportunities, even as we navigate the current challenging geopolitical environment.\n\nBefore I turn to discussing the specific areas of our focus at Credicorp, I'd like to comment on the context in which we're operating, particularly in Peru. Private investment is expected to decline this year and with a lack of meaningful public investment, our country is underperforming. Unfortunately, we Peruvians have been spending too much time discussing the political turmoil and not enough on addressing those matters that will truly make a difference to the well-being of our fellow citizens and the long-term health of our economy. The country requires its authorities, and especially the executive branch, to direct its efforts at promoting political and legal stability in order to assure private investment, as well as to efficiently execute the public budget with a goal of securing better public services for all, instead of enacting short-term measures with damaging inflationary consequences.\n\nThe private sector is doing what it can, and we at Credicorp are committed to doing our part, but we certainly need the government to set up its execution capabilities across fundamental areas of our economy and safeguard our institutional framework to accelerate potential growth. I'd like now to review how Credicorp stands out in this context and how we are consolidating and strengthening our core businesses while advancing our strategy of building our own disruptors. Now, please turn to Slide 4. Over the years, we have built a healthy, profitable and resilient franchise with the ability to perform well, even in this environment.\n\nOur strong liquidity and well-capitalized balance sheet, together with our laser focus on risk management and asset quality, underpin our position. We've been very successful in attracting top-notch talent across the board, including those with strong tech capabilities through offering an attractive value proposition. As we look ahead, we will continue pushing out on this agenda of attracting and retaining more digitally focused talent to support our aggressive plans for strengthening not only Credicorp's position as market leader, but also the situation for all the stakeholders in the countries in which we operate. Finally, I would like to note that as management team, we pride agility and flexibility, which is particularly important considering how the environment has changed and how our vision for the future is evolving.\n\nAs such, we're continuously reviewing our entire business portfolio with a strategic long-term view. While we have no specific news at this point, it is important to note that we are guided by our goals of strengthening our leadership position and operating as a top player in each of our chosen markets and segments. Please turn to Slide 5. Today, we're fully committed to further consolidating our operations and driving technological innovation across our core business portfolio.\n\nIn universal banking, our focus is to strengthen our leadership in Peru, while focusing on markets where we can hold a leading position. Leveraging our work-class microfinance model, we expect to maintain our leadership position in Peru and prioritize the consolidation of our presence in Columbia. On the insurance front, the goal is to further expand our leading bancassurance channel while our investment banking and wealth management business, we're currently reassessing our midterm strategy, given the changing environment for this business. Simultaneously, we're leveraging our parenting advantage to enhance our overall operations.\n\nKey areas of focus include attracting and retaining topnotch talent, as I previously noted; ensuring that the sustained adoption of best-in-class digital capabilities; introducing our robust risk management capabilities across our businesses; while continuing to integrate ESG at the core of each of our lines of businesses, all this underscored by our priority of maintaining solid solvency and strong capital position while driving profitable growth. Turning to Slide 6. Complementing our current business portfolio, we are also selectively pursuing disruptive growth opportunities across three distinct horizons over time. The first horizon comprises strengthening our core profit pool.\n\nWe've already established some very attractive ventures on this front in Peru and Chile and encouraged in specific investments. This include Yape in Payments, Tenpo in the Neobank space, Culqi in Acquiring, and others around services for SMEs. The second horizon comprises entering new verticals and markets in Peru and the Andean region, where, for example, we are escalating Teba in Wealth Tech, which already has presence in Columbia, Chile, and Peru, and currently exploring Insurtech. And finally, our third horizon consists of exploring the most disruptive technologies as enabled of new business models.\n\nWe've determined an ambition for our disruptive portfolio that could impact our expected ROE in up to 150 basis points this year. We're funding our commitment through internal sources and are more than willing to sacrifice short-term ROE to benefit the strategic sustainability of Credicorp's businesses. In line with this, we will be actively monitoring and measuring the success of the innovation portfolio based on three complemental metrics we are building, thus ensuring efficiency and diversification of the portfolio, thus contributing to Credicorp's strategic goals, and thus securing financial performance. Please turn to Slide 7, please.\n\nAs shown on Slide 5, during the quarters, we achieved new milestones that reflect our efforts to become a sustainable business leader. On the environmental front, we focus on developing sustainable solutions for our clients, including BCP's issuance of the First International Green Bond of the Peruvian banking system. Advancing on the ESG risk management framework, we've completed the pilot of a green taxonomy for our representative sample of our loan book, which will be extended to our whole portfolio soon. This is a key enabler to find more sustainable finance opportunity.\n\nOn the social front, we continue to support financial inclusion and financial education through several of our businesses. Yape reached a milestone this quarter, reducing over 1.9 million financially included individuals since November 2020. Mibanco has used its lending products to financially include more than 600,000 people over the past seven years. Our financial education initiative through BCP and Mibanco reached over 140,000 beneficiaries in this quarter.\n\nOn the SMEs front, Yevo, Mibanco's virtual merchant ecosystem, continued assisting entrepreneurs with digital tools in managing and growing their businesses. Finally, we recently published our policies on corporate sustainability, human rights and corporate responsible investment, which are available in our website. Now let me turn the call to Cesar Rios, who will provide a brief overview of our operating and financial performance for the quarter. Cesar, please go ahead.\n\nCesar Rios -- Chief Financial Officer\n\nThanks, Gianfranco, and good morning, everyone. As Gianfranco mentioned, we delivered solid operational and financial results. I want to start by highlighting some key quarter-over-quarter dynamics. Structural loans grew 6.8% driven by BCP and Mibanco.\n\nWe decreased our liquid assets to fund the aforementioned loan growth. Regarding deposits, clients migrated to higher-yielding deposits to take advantage of rising rates. In terms of asset quality, the structural NPL ratio dropped to 4.9%, driven by strong origination levels, while the structural cost of risk rose to 1.1%, reflecting a less favorable macroeconomic outlook. From a year-over-year perspective, volumes for structural loans and low-cost deposits follow different trajectories.\n\nWhere structural loan volumes were up 14.1%, low-cost deposit volumes were down 6.1%, and represented 56.7% of the funding base. In this scenario, core income, including net interest income, fees, and gains on FX transactions, registered a strong growth of 18.7%, 6.7%, and 12.8% respectively. Prudent risk management during the pandemic set a stage that allowed us to keep current provision expenses under control despite today's challenging environment. We continue to maintain healthy structural allowances for loan losses equivalent to 5.9% of structural loans and our coverage level for structural non-performing loans stands at 120%.\n\nIn the insurance business, the loss ratio fell more than 37% points, which indicates that the business is on track to recover profitability. In summary, Credicorp consolidated its recovery this quarter and on the back of the banking and insurance businesses, secured an ROE of 16.9% while maintaining a sound capital base. Next slide, please. At the end of July, IMF cut its global growth forecast as central banks around the world tightened monetary policies to combat the highest inflation levels in a decade.\n\nThis scenario was exacerbated by the war in Ukraine and persistent lockdowns in China. Like many central banks around [Inaudible], the central bank in Peru has been decisive in controlling inflation expectation, has raised its reference rates, a tighter monetary policy coupled with reactive loans amortization, is affecting the liquidity in the Peruvian financial system. The Peruvian economy has remained resilient despite high inflation, a tight monetary policy, a 25% drop in copper prices since the end of the first quarter. We maintain our forecast that Peru GDP will grow around 2.5% this year.\n\nAdditionally, Colombia and Chile are expected to grow 6.5% and 2% this year. Next slide, please. In Peru, the presidential address in July 28 contained no new material announcements. It's important to note that this address touched upon no new measures to promote investments and economic growth neither.\n\nPresident Castillo did not accept its prime minister resignation last week and reshuffled his cabinet to implement six changes. Kurt Burneo, appointed as the new finance minister, is an experienced economist who previously served as minister of production under President Ollanta Humala and as deputy minister of finance under President Alejandro Toledo. On the legislative front, they said no to a bill stipulating that the minimum pension in the private system must be equivalent to the value of the basic consumption basket. This bill further allows affiliates to withdraw from their accounts, any amount in excess of the balance required to attain such minimum pension.\n\nWhen this law is published, the executive has 90 calendar days to publish its regulation. This legislation could trigger material levels of additional pension fund withdrawals, but given the lack of clarity on key aspects, we need to wait for the regulation to better assess potential impacts. On the regulatory front, the executive is implementing a more rigid labor legal framework by prohibiting the outsourcing of activities that are part of the core business of a company operations, and by expanding the scope of reasons for which unions can strike, which could disrupt business operation in some sectors. With respect to Colombia and Chile, both face important milestones in the near future.\n\nIn Colombia, Gustavo Pedro took office last Sunday, and his minister of finance announced the proposal for a new tax reform that seeks to eliminate exemptions for companies and high-income individuals, and to increase taxes on dividends and capital gains. In Chile, the referendum will be held on September 4th to approve or reject the new constitution. So far, the poll has slightly favored the rejection of the aforementioned constitution. Additionally, a new tax reform is being debated.\n\nNext slide, please. BCP continues to register a strong profitability. Regarding key quarter-over-quarter dynamics, net interest income growth was driven by an uptick on structural loans, mainly due to the SME PMIC corporate and consumer segments. And in a context of rising interest rates, this was partially offset by an increase in the cost of funds after low-cost deposits contracted in line with market trends.\n\nRegarding asset quality, NPL volumes increased within expectations and provision expenses grew 48.2%, driven by credit cards and consumer loans, reflecting an unusually low base last quarter. On a year-over-year basis, growth in net income was driven by a 20.2% increase in net interest income, which was bolstered by rising interest rates and 15.3% increase in structural loans measured in average daily balances. Expansion was mainly driven by wholesale banking, which rose 16.3% due to an uptick in disbursements of working capital loans in foreign currency to corporate clients, many of which had in the second quarter of 2021, prepaid financial secured during the pandemic. Retail banking structural loans expanded 14% year over year, driven by SME PMIC, where we were penetrating new lower ticket sub-segments by leveraging data analytics and digital channels.\n\nAdditionally, income increased 14.1%, fueled by an uptick in transactional levels, particularly through POS transactions and interbank transfers. Loan provisions decreased 22.9%, driven by an improvement in payment behavior in the mortgage and corporate banking sectors. Operating expenses grew 16% driven by higher expenses for IT to bolster transaction capacities, an uptick in transactional cost for loyalty program benefits accumulated to credit card use, growth, environmental compensation driven by surpassing business targets and more investment in disruptive initiatives. In this context, BCP efficiency ratio stood at 41.5% and ROE was 22.8% this quarter.\n\nNext slide, please. By focusing on achieving these three main ambitions. Yape is advancing its goal to become Peru's most important SuperApp. With more than 10 million users, Yape is becoming the main payment network in Peru.\n\nApproximately 6 million users are categorized as monthly active users and these affiliates made, on average, 15 transactions per month. Total transactions amounted to PEN 5 billion in June. In addition, since the launch of mobile top-ups in November 2021, Yape has achieved a market share of 8% approximately and registered more than 4 million top-ups in June. Yape is developing new functionalities to leave a footprint in users' daily lives.\n\nMost recently, we have been operating friends and family pilot of Yape functionality to offer affiliates unique promotions and discounts. We expect to launch this feature this quarter. Also, Yape has been operating friends and family pilot for the new microloans functionality. We expect to launch in this quarter.\n\nFor the first stage of this new service, Yape estimates that it can leverage 1.3 million leads to potential borrowers to place loans between PEN 100 and PEN 200 that can be paid in 15, 20, 25, or 30 days. Next slide please. Mibanco earnings grew 24.3% quarter over quarter. Our hybrid model base, centralized assessments and alternative distribution channel set a new high for loan disbursement that led structural loans to register a growth of 7.9%.\n\nThis dynamic, coupled with active yield management strategies, allowed Mibanco to boost its net interest income on this quarter. The structural NPL ratio fell and stood at 6.1%. The cost of risk also fell and stood at 3.3%. From a year-over-year perspective, net interest income registered solid growth, driven by 20.3% growth in the structural loans and by a yield increase through effective pricing strategies.\n\nThese dynamics were partially offset by an uptick in the cost of funds due to interest rate hikes. Other income was up more than twofold fueled by growth in bancassurance sales and by the fact that commissions paid to commercial partners have registered a steady decline as our own channels gains relevance. Provision expenses fell 15.2% due to an improvement in client payment performance. Growth in operating income outstripped expansion registered for operating expenses, which is stood at 6.9%.\n\nIn this context, Mibanco's efficiency ratio improved and its return on average equity rebounded significantly to stand at 20.3%. At Mibanco Colombia, year-over-year results were driven by 14% growth in net interest income, which was attributable to a strong loan growth, accompanied by an uptick in productivity. NIM's evolution continued to be challenged due to funding cost pressures. Next slide please.\n\nGrupo Pacifico's net income rose quarter over quarter, driven by an uptick in net earning premiums in the P&C business and by favorable investment results in the Life business. It is relevant to mention that this environment has negatively impacted our equity level through unrealized losses. From a year-over-year perspective, in the P&C business, net earning premiums increased primarily due to growing sales of car protection and household mortgage products, and to an uptick in sales of oncological products. P&C claims rose year-over-year driven by growth in claims through the cars' line and after pandemic restrictions were lifted.\n\nIn the Life business, net earning premiums increased primarily to credit life with registered growth in sales via BCP and Mibanco. This positive dynamic was further [Inaudible] drop in claims due to an improvement in the sanitary situation. These dynamics led to total loss ratio to situate at 70.8%, which stands closer to pre-pandemic levels. All in all, Grupo Pacifico's return on equity stood at 18.6%.\n\nNext slide, please. The investment banking and wealth management line of business continues to be challenged by the current environment, where geopolitical issues and macroeconomic downturn has impacted asset prices, market volatility and overall confidence. This context, combined with political noise in various countries in the region, negatively impacted our business revenues, assets under management and proprietary portfolios. On a quarter-over-quarter basis, total assets under management fell 10% and income generation dropped 8%, which was primarily fueled by capital markets, where our fixed income trading strategy is performing unfavorable and by -- and due to asset management, which was affected by a decrease in total management fees related to lower market value of funds.\n\nIn the year-over-year analysis, assets under management dropped 11%, which was primarily driven by a decrease in funds volumes in Peru and Chile within the asset management business. In this context, income fell 31%. This evolution is attributable to capital markets, asset management and wealth management businesses. The decline was fueled by a decrease in trading income, while in assets and wealth management businesses, reductions were mainly attributable to withdraws, a decrease in the market value of funds and a base effect given that in the second quarter of 2021, the strong gains were reported for anticipated redemption and third-party upfront fees through offshore platforms.\n\nWe continue to develop capabilities while we conduct a thorough analysis of our business focus in a context marked by reduced volumes and scalability challenges in the short to medium term. Next slide, please. Now we will talk about Credicorp consolidated dynamics. On a quarter-over-quarter basis, interest-earning assets reflected a drop in cash and due from banks and in investments, but registered growth in structural loans.\n\nThese dynamics resulted in a higher yield mix. On the funding side, low-cost deposits contracted while time deposits grew. Accordingly, the yield on our interest-earning assets increased 68 basis points, while the funding cost increased 26 basis points. On a year-over-year basis, Credicorp's structural loans portfolio grew 14% year over year, driven by BCP and Mibanco, while Reactiva loans, investment and cash and due from banks materially contracted.\n\nOn the liability side, total funding contracted, driven primarily by Reactiva repos and total deposits. Additionally, our deposit base became more expensive given that low-cost deposit volumes fell alongside growth in time deposits. At quarter end, around 57% of our funding base was comprised of low-cost deposits, a relevant competitive advantage that help us to keep our cost down. These dynamics, coupled with effective asset repricing strategy, led the interest-earning asset yield to increase 122 basis points, the cost of funding rose 41 basis points.\n\nNext slide, please. Now I will speak about core income year-over-year evolution. Core income grew 15% year over year, which was driven by net interest income and fee income. Credicorp net interest income grew 18.7% year over year, in line with the evolution of the balance sheet and yield dynamics explained early.\n\nThis was reflected in our net interest margin, which grew eight basis points year over year and stood at 4.9% this quarter, while structurally NIM stood at 5.18%. This NIM uptick, coupled with a decrease in cost of risk, drove the evolution of risk-adjusted NIM, which stood at 4.25% this quarter, very close to pre- pandemic levels. Fee income increased 6.7% driven by POS consumption and interbank transactions, which grew 64.3% and 51.3% respectively. Cashless transactions represented 43% of total transactions amount as of June.\n\nThe 13.8% increase in banking serving fees was partially offset by a drop in fee income from [Inaudible]. Net gains on FX transactions increased 12.8% year over year in a context marked by higher FX volatility where we leveraged our pricing and distribution capabilities. Next slide, please. I will now move to Credicorp's structural loan quality dynamics.\n\nOn a quarter-over-quarter basis, our NPL volumes registered an uptick, which was mainly attributable to BCP and driven by the SME and wholesale segments. In SME, the increase in NPLs was concentrated in the early delinquency tranches and driven by SME PMIC clients that also have Reactiva loans and were unable to service both debts simultaneously. Moreover, as we mentioned in the last quarter, SME NPL volumes are impacted by lower levels of write-offs of Reactiva-related clients, which we expect to regularize in the third quarter. In wholesale banking, delinquency is associated with specific clients from the real estate and tourism sectors in the middle market segment.\n\nHigher delinquency is within expectations as it is related to clients affected by the pandemic that benefited from reprogramming facilities and which are already provisioned. NPL volumes uptick at BCP were partially offset by NPLs decline at Mibanco due to an improvement in client payment behavior. Year over year, higher NPL volumes were mainly driven by BCP and BCP Bolivia. At BCP, higher NPLs mostly due to SME payment driven by a slight increase in delinquency of long-term loans.\n\nAt BCP Bolivia, increase in overdue loans was in line with expectations and driven by grace period expirations. This was attenuated by a decrease in delinquency at Mibanco. Structural loans grew at a faster pace than NPL volumes, leading NPL ratios to drop across segments. In this context, Credicorp's structural NPL ratio stood at 4.9%.\n\nAsset levels stand within our expectation. Nonetheless, we are closely monitoring increasing early delinquency indicators. Next slide, please. The increase registered in structural loan loss provisions remain within our expectations.\n\nOn a quarter-over-quarter basis, growth in structural provisions were mainly driven by individual segments at BCP, where the macroeconomic outlook impacted our risk models. On a year-over-year basis, structural provision expenses remain stable. We take a prudent approach to updating our model, which currently reflects a less favorable outlook for macroeconomic indicators such as GDP, inflation, internal demand, exchange rates, and interest rates. Additionally, the results reflect the gradual shift to retail.\n\nThe aforementioned dynamics were partially offset by positive payment behavior. As a result, the cost of risk stood at 0.7%, where higher expenses were offset by loan growth. At a cumulative level, the cost of risk stands at 0.83%. The coverage ratio continued to trend back to pre-pandemic levels and stands at 120% for structural loans.\n\nNext slide, please. Operating expenses grew 14.3% year over year, which reflected an increase in administrative expenses and in salaries and employee benefits. Growth in administrative expenses reflects an increase in the transactional costs in line with higher transactional levels, an uptick in IT expenses related to cybersecurity, new functionalities in our apps, software and cloud upgrades, and the acceleration of the disruption initiatives. The salary line was up this quarter due to an increase in variable compensation, which reflect levels of commercial and profit target accomplishments.\n\nIn this context, Credicorp's efficiency ratio deteriorated 60 basis points in the first half of the year. Thanks to its hybrid model, Mibanco's operating expenses were controlled and up only 8.1% year over year. Operating income was up 19.3% over the same period. Mibanco's efficiency ratio improved 520 basis points year over year and 700 basis points in the first semester of this year.\n\nIf we exclude opex for investment in disruptive initiatives, such as Yape and Krealo, the efficiency ratio stands at 41.8% this quarter, which represents a difference of 280 basis points from the reported figures. Next slide, please. ROE stands at 16.9% this quarter, driven primarily by the performance of our universal banking, microfinance, and insurance businesses. Over the last four quarters, our ROE has consolidated in the high teens.\n\nFinally, ROE for the first half of the year stood at 17.2%. Now I will move on to the outlook. Next slide, please. Despite current political volatility, Peru's macro fundamentals remain solid, and we expect GDP growth to stand within guidance at around 2.5%.\n\nA strong dynamism in Mibanco, SME premium consumer loans is expected to continue. As such, we expect the structural loans growth to be within guidance at year end. Given the interest rate continue to increase at a faster pace, the net interest margin will stand in the upper range of guidance at the end of 2022. With information that we have as today, the cost of risk is also expected to close the year in the upper end of guidance.\n\nAsset quality has evolved within our expectations, but nonetheless, we are carefully monitoring the impact of higher inflation in our clients' payment performance and the risk profiles. As transaction levels rise and our IT and digital investment increase, the efficiency ratio will move upward. Nonetheless, we expect this ratio to close the year within guidance. Finally, we expect our overall ROE for 2022 to remain without guidance.\n\nWith these comments, I would like to start the Q&A session.\n\nOperator\n\n[Operator instructions] And our first question will be from Ernesto Gabilondo from Bank of America. Please go ahead.\n\nErnesto Gabilondo -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Hi. Good morning, Gianfranco and Cesar, and good morning to all your team, and thank you for your presentation. My first question is on the regulatory framework.\n\nI would like to hear from you if you have some color on the new regulation approved by the Peruvian Congress to reduce interest rate for good payers for loans under $2,400. And also I would like to hear your first impressions on the potential impact to Africa Prima related to the large pension withdrawals. Thank you.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nYeah. Good morning, Ernesto. This is Gianfranco. Thank you for your question.\n\nThe regulation proposal you just mentioned is one of the -- I won't qualify the initiative, but one of the 100s of regulatory initiatives at Congress. As of today, there's nothing -- that proposal has not gained track whatsoever. And regarding pensions, sorry about that, regarding pensions, the law was passed at Congress. However, we do not have the answer for that.\n\nIt hasn't been published. Having said that, we're currently working on how to tackle the new regulation. But more importantly, I would say that -- actually, I've been saying this for the last, maybe the last couple of calls and in some meetings, is we as Credicorp are much more worried about the whole pension system rather than the specific regulation or the impact on Prima. What has been going on for the last maybe two, three years is that the whole pension fund system in Peru has been constantly perforated and therefore damaged.\n\nI strongly -- this is a personal opinion, but there's no pension fund -- there's no pension system anymore in Peru. And for us, it's much more relevant to have a formal and intelligent discussion with all the stakeholders in order to come up with a much more solid pension funds system -- pension system, sorry -- for the future. Otherwise, if we think that we have an issue regarding pension funds today, we will have -- as a country, I mean, we'll have a much more complicated situation in the future.\n\nErnesto Gabilondo -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. Thank you, Gianfranco. So just last question on your operating expenses. We saw the opex has grown roughly 16% in the first half of the year.\n\nSo I just wanted to understand how much has been related to inflation, how much related to FX, and how much to the digital transformation. And is this a level that we should expect for the rest of the year? And looking for next year, would it be reasonable to expect like a more moderate pace of growth in opex?\n\nGianfranco Ferrari -- Chief Executive Officer\n\nCesar, can you answer this?\n\nCesar Rios -- Chief Financial Officer\n\nYes. As I mentioned during the presentation, the speech, I think we have been -- various specific drivers of this significant growth has been related to transactional levels and also an accelerating in the transformational initiatives and the IT expenses. Part of this effect has been driven by inflation, also FX expenses. But I will say that mainly it is driven by intentional accelerating in the transformation.\n\nDown the road, we expect a moderation in this expenses growth, but what we are going to monitor, as we mentioned previously, is a sound cost-to-income ratio. As the income follows us and we can drive income higher, we are going to maintain a fast investment pace.\n\nErnesto Gabilondo -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. Thank you very much, Cesar.\n\nOperator\n\nAnd the next question will be from Jason Mollin from Scotiabank. Please go ahead.\n\nJason Mollin -- Scotiabank -- Analyst\n\nHello, everyone. Congrats on the solid profitability, despite the challenging economic and geopolitical context. Gianfranco and Cesar, thanks for your presentation and the opportunity to ask questions. I'm going to only ask one question as you requested.\n\nMine is related to Mibanco. We saw Mibanco, the microfinance subsidiary generate an improved level of return on equity, reaching 20%. Can you talk about the addressable market for this segment, the competition and Mibanco's market position now and going forward? Thank you.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nYeah. Good morning, Jason. The total addressable market for Mibanco Peru, and then I'll go slightly into Colombia, we believe is still -- this is still a big opportunity because the level of unbanked potential clients is still large there. And as you know, we at Mibanco have also a goal in terms of financial inclusion and bringing new customers to the financial system through this really tiny loans.\n\nSo as in your first -- actually your first sub-question is that we still see opportunity for enlarging in the pie in that segment. Regarding competition, it's a tricky question. Because of COVID, a lot of the superintendency provided or allowed the banking institutions, financial institutions, the government, municipalities, and so on, to relax the trade standards, create provisioning, capital requirements and things like that. Therefore, it is still not very clear how strong or weak are our competitors regarding that matter.\n\nFrom what we see in the market is that the risk appetite is not as strong as it was before. And at Mibanco, what we're doing, what we are currently doing is leveraging on the data we have, is targeting those really good risk clients from growth since we don't see them as aggressive as before. And, sorry, I missed your last question, the third one, sorry.\n\nJason Mollin -- Scotiabank -- Analyst\n\nWell, those two.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nOK. And maybe the third comment is both regarding Peru and Colombia, this hybrid model, which we've talked about previously is performing quite well. We're further implementing it at Mibanco Peru, and we're also implementing it in Mibanco, Colombia. Colombia's still I would say at the initial stages, but the performance is quite good.\n\nWe have some headwinds there regarding cost of funding. But already Mibanco Colombia already have roughly 12% of that market. So we're very positive also in Colombia and with longer vision, we're bullish in microfinance in Columbia.\n\nJason Mollin -- Scotiabank -- Analyst\n\nThank you for your comments. Appreciate it.\n\nOperator\n\nAnd the next question is from Andres Soto from Santander. Please go ahead.\n\nAndres Soto -- Santander -- Analyst\n\nGood morning to all. Thank you for the presentation and congratulations on the results. My first question is on your risk-adjusted NIM, which is already at the level it was pre-COVID. I'm curious to see your thoughts on how much upside are you expecting from this level.\n\nDo you think that this is what is sustainable, the 4.25% is what you believe are sustainable? Or we may have additional increases as monetary policy trickle down and you have a phasing out of the government programs portfolio?\n\nGianfranco Ferrari -- Chief Executive Officer\n\nYep. Thank you, Andres. I will make a quick comment and then pass it to Cesar Actually I would say we're already seeing upside because as we mentioned before, we were expecting, or in 2023, for the adjusted NIM to come back to pre-COVID levels. And actually, you just said it, we reached it in this quarter.\n\nSo we already see upside. In the long run, what we expect is basically to stay at those levels, but I would ask Cesar to be much more going into the detail.\n\nCesar Rios -- Chief Financial Officer\n\nYes. I will say that, as Gianfranco mentioned, we have been facing, I would say, a favorable dynamic that has accelerated the conversion that we were talking about. Why? Because the NIM has been growing faster due to the increase in market rates, and we have contained the risk in very low levels. Down the road, and I will say not for the long term but for the short term, we expect to have probably some improvement because the NIM is still growing at a healthy pace, and we still consider that we can maintain reasonable levels of cost of risk.\n\nDown the road is what is going to happen is what Gianfranco mentioned is that we are going to have not-as-high interest rates and a more stable level of risk that has inside an improvement in the underlying quality but has a change in the composition with an increasing part of retail banking and Mibanco as part of the overall mix. So I will say, in the short term, probably some improvement, but in the long term, following the dynamics of Gianfranco just mentioned. But we are having, I would say, at this point, a favorable perspective in both components of the indicator, NIM and cost of risk.\n\nAndres Soto -- Santander -- Analyst\n\nPerfect. That's very clear. Thank you. And then my second question is on dividends.\n\nYou have already BCP 11.6%, core equity tier one 15.3% at Mibanco. And outlook for both operations look pretty solid. You mentioned in the last quarter, the possibility of special dividend later this year. I would like to know your thoughts around this issue.\n\nCesar Rios -- Chief Financial Officer\n\nI think as we mentioned previously, this is a very dynamic process for us with very clear rules first, to fund the underlying growth of the business, set aside funds for a specific transaction. So probably later this year, we are going to meet with the Board and make a decision. At this point, we don't have any updated information regards to this point.\n\nAndres Soto -- Santander -- Analyst\n\nFair enough. Thank you, Cesar.\n\nOperator\n\nAnd the next question will come from Alonso Garcia from Credit Suisse. Please go ahead.\n\nAlonso Garcia -- Credit Suisse -- Analyst\n\nHi. Good morning, everyone. Thank you for taking my question. My question is on the outlook for loan growth going forward, especially this year -- next year.\n\nI mean, this quarter, you posted a very solid performance of your structural loan portfolio. So my question is, how do you think growth should look into 2023, considering probably a more challenging macro environment, but also the healthy trends that you are seeing in your total loans and the initiatives you have to address a larger share of the individual segment in Peru? That is my, like my question. Thank you.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nCesar, go ahead.\n\nCesar Rios -- Chief Financial Officer\n\nOK. Thank you. I think in the long term, we still maintain our general guidance of 1.5 times nominal GDP. In the short term, we have been seen and we maintain a positive view regarding [Inaudible] in general, at BCP and Mibanco, and the consumer segments.\n\nWe have been seeing significant challenges in the long-term portfolios, and this probably is going to be the wild card. At this point, we have been growing the portfolio mainly driven by short-term operations with very modest growth in long-term operations. And this probably can make a difference next year. If the environment, the political environment, remains volatile, we are going to face the same challenges.\n\nOtherwise, we could have an initial engine of growth because the investment has been very contained the last year.\n\nAlonso Garcia -- Credit Suisse -- Analyst\n\nVery clear. Thank you.\n\nOperator\n\nThe next question is from Tito Labarta from Goldman Sachs. Please go ahead.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thank you for the call and taking my question. My question on your ROE guidance for the year, 17% I think this quarter, a little bit lower probably due to a higher tax rate.\n\nHow do you think about the ROE target for the rest of the year? And then also, I think longer term, you mentioned about an 18% ROE. Is that still your thinking given some of the economic macro challenges? And then also just what do you expect for the tax rate? Thank you.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nHello, Tito. This is Gianfranco. I don't know why, but we didn't -- we weren't able to get your question quite clearly, but what we understood is basically, the ROE, real ROE for this year guidance and expectations for the upcoming years, if I'm correct, what Cesar mentioned before, we stick to our guidance of ROE of around 17.5%. And we are quite sure that we will end up around that figure.\n\nAnd in the long run, still, and we've discussed it before, we expect to come back to the high-teens ROEs which we've delivered in the past, with a positive caveat, I would say, is that we are strongly investing in our digital transformation at all of our lines of business, plus the disruptive investments we're doing at Krealo. So we strongly believe that in the upcoming years, our competitive position in this new environment is going to be as strong or even more strong -- even stronger than it was in previous years.\n\nCesar Rios -- Chief Financial Officer\n\nOnly if I can add a slight comment, that is going only a repetition of that we mentioned in the Digital Day, we are, as Gianfranco mentioned, investing heavily in the digital transformation. So when we expect a similar ROE down the road, is with a stronger business that can face a tougher competitive environment. That means that 17.5%, 18% three, four years down the road, reflects higher capabilities and stronger digital capabilities that allow us to compete better in a tougher environment. This is our underlying assumption.\n\nOperator\n\nAnd the next question will come from Thiago Batista from UBS. Please go ahead.\n\nThiago Batista -- UBS -- Analyst\n\nYes. Hi, guys. Thanks for the opportunity. I have a follow-up on cost of risk.\n\nThe cost of risk ended the first half on 0.8%, on the low part of the guidance, but you already stated that cost of risk should end the year close to the top of the guidance, the 1.1%. So can you give us a little bit more color of this cost of risk dynamics? And if you believe that this level of around 1% should be the recurring level for the medium term?\n\nGianfranco Ferrari -- Chief Executive Officer\n\nReynaldo, can you answer that one, please?\n\nReynaldo Llosa -- Chief Risk Officer\n\nSure. Yes. I mean, the cost of risk, we've watched in 2021, and the first semester of the year has been quite low as you know, at least 50 or 60 basis points below pre-pandemic levels. So what we expect to get back to normal numbers starting next year.\n\nBy the year, we expect them to get closer to -- as Cesar has mentioned, to the upper range of our guidance. So, I mean, we are positive this year. We see challenging macroeconomic outlook. The portfolios are still performing quite well.\n\nOperator\n\nAnd then the next question will be from Carlos Gomez-Lopez from HSBC. Please go ahead.\n\nCarlos Gomez-Lopez -- HSBC -- Analyst\n\nHello. Good morning. And again, congratulations on a very good strong result. I would like to address costs again.\n\nAs always, you mentioned that you're investing heavily in your technology initiatives. In the past, we have referred to an investment period that would eventually come to an end. Is that is still the case? Should we expect a decline in expenses once the heavy phase is over? And how much would that be? I mean, I think in the past you have referred to something like 150 basis points in terms of ROE. Is that still guidance? Is that something like the amount of money that you're spending right now? And could you quantify how much you have invested in Krealo? Thank you.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nHello, Carlos. This is Gianfranco. Great question because even though we -- at the beginning maybe of the transformation, we were thinking like that. We do not expect this transformation process to end up somehow.\n\nWhat we can say, and we publicly said it in our Digital Day presentations in February, is that the new ventures, which obviously today are cash flow negative, should be cash flow -- sorry, cash flow neutral as a portfolio by 2025. The more mature ones, like Yape, should be cash flow positive by that year. But obviously, since we will be investing and maybe assets are that most of the investments we're doing is we are registering it as an expense in order to be conservative. But the more new investments, which may show up down the road, obviously, will be cash flow negative.\n\nSo again, our vision is that by 2025, this disruptive portfolio, just to put a name on it, should be cash flow neutral by 2025. And therefore, it wouldn't cost that 150 basis points in terms of ROE we're discussing today. I don't know, Cesar, if you want to add?\n\nCesar Rios -- Chief Financial Officer\n\nYes, only complement. I will add the digital, the more disruptive parties, as Gianfranco mentioned. But in the internal business, we are conducting a thorough and profound transformation also of the business, changing the basic platform, the databases, improving cybersecurity capabilities and improving the operational capabilities. So this is also impacting the expenses.\n\nAnd what we have managed to do during the last year, and is very clear this year, in particular, is that the other part of the business has expense growth very well contained in the low single digits, and most of the increasing expenses is in digital. And you can see that in the report very clearly, is daily linked to IT expenses and marketing. And I would say, loyalty related, that is very linked to operational levels. So we intend to continue this path, building the capabilities inside and outside the core businesses.\n\nCarlos Gomez-Lopez -- HSBC -- Analyst\n\nIf I may translate what you're saying, it seems to me that you now see the level of expenditure as something that will be continuing, ongoing and the difference will be in the revenues of the new ventures that should increase, and that's what will turn it cash flow positive. But again, it seems to me that we should look at changes in revenue rather than changes in expenses going forward.\n\nCesar Rios -- Chief Financial Officer\n\nYes.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nThat's exactly right.\n\nCesar Rios -- Chief Financial Officer\n\nThat's exactly right. And as I -- sorry for repeating that self, what we monitor very closely is the ratio. We don't have the intention to reduce expenses, what we have the intention is to improve efficiency.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nThrough income. Yeah.\n\nCarlos Gomez-Lopez -- HSBC -- Analyst\n\nOK. Clear. Thank you so much.\n\nOperator\n\nThe next question is from Yuri Fernandes with J.P. Morgan. Please go ahead.\n\nYuri Fernandes -- J.P. Morgan -- Analyst\n\nThank you all, and good morning. Also a follow-up here on the Yape and Krealo-like investments. You provide some numbers on the efficiency ratio adjusted by those initiatives, right? And you have, I guess, 34 bps improvement for the semester and about 240 bps improvement for the quarter, if you exclude those vehicle initiatives. And we do back-of-the-envelope calculation here to estimate, it seems there was a big increase in the second Q on your investments here.\n\nAnd going back to that point, like, are you really kind of going to be more flattish on those investments for Krealo and Yape? Or should we continue to see an acceleration? Because again, the second Q kind of imply some acceleration, I guess, about -- we really don't know the breakdown between operating expenses and operating income from those initiatives, but something around like PEN 100 million being deployed on those initiatives. So just checking if that's really the message, like maybe second Q is the peak and we should see this kind of negative PEN 100 million per quarter on those things? Or if this calculation is too high and it's lower than that. And also on Yape, you mentioned new initiatives. And I guess that's part of the path to monetization, the microloans that you were testing, you had the pilot.\n\nMy question is how much those microloans may help you to be break even the initiatives. On the app is small, but like how big can be microloans for Yape? Thank you very much.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nThank you for your question, Yuri. Maybe from a broader perspective, what the whole new ventures, investments -- and when I say new ventures, it's not only Krealo or Yape, because we have a few other initiatives within the incumbents -- is costing us 300 basis points of cost to income. I don't know if that helps you. So it's roughly 150 basis points of ROE, 300 basis points in terms of cost to income.\n\nRegarding your question on, I would call it nano loans in Yape. Obviously, we have to -- the approach is actually to lend to learn at the beginning. We have over 6 million active users today. So the quantity and quality of data we're gathering is huge, but we have to be cautious.\n\nThis is a completely new segment. Loans are going to be disbursed and collected through a completely new channel. So there are challenges going forward. However, if you see it in a -- with a longer vision, the play is not necessarily -- and obviously, we're going to be profitable by lending money.\n\nBut the vision is much broader in the sense that what we want Yape to become is a super-app for Peruvian and Peruvians operating in that segment. Therefore, loans or lending is going to be one of the verticals in which Yape's going to play. But there are several other verticals so that the day-most of the daily necessities of these Peruvians can be figured out through Yape. That's the vision.\n\nCesar Rios -- Chief Financial Officer\n\nOnly to complement, being loans relevant is part of one of the verticals, that is the financial services, and we tend to be a super-app that provides payment facilities, a lot of support for the client, another vertical based on financial services and also in a marketplace. So [Inaudible] is not the only play, it's part of a portfolio of initiatives of the super-app.\n\nYuri Fernandes -- J.P. Morgan -- Analyst\n\nSuper clear, guys, and thank you and congrats on the 10 million clients for Yape and the better engagements on there. Thank you very much.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] The next question is a follow-up question from Jason Mollin from Scotiabank. Please go ahead.\n\nJason Mollin -- Scotiabank -- Analyst\n\nHi. I just wanted to ask about the government program loan, so the nonstructural loans, and we saw the balance decline to I think around 9.9% from over -- about 17% last year. What should we be expecting on that front going forward? Thank you.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nHey, Jason, again. The trend is that BCP, it's PEN 700 million per month, is being paid. So by year end, the figure you said, which is 10%, roughly 10%, should go to 7%. We do believe that it's a non-issue anymore.\n\nThere might be some refinancing, but it's not a non-issue anymore. Both the quality of that portfolio is much better of what we expected at the beginning, a couple of years ago. The whole process of executing collateral is working quite well. For us, it's not an issue anymore.\n\nAnd maybe an issue that some of you guys asked us before was about the concern of the pickup in interest rates, specifically -- more importantly, at Mibanco. That hasn't been an issue also.\n\nJason Mollin -- Scotiabank -- Analyst\n\nVery helpful. Thank you, Gianfranco.\n\nOperator\n\nIt appears there are no further questions at this time. I would now like to turn the call back over to Mr. Gianfranco, our chief executive officer, for closing remarks.\n\nGianfranco Ferrari -- Chief Executive Officer\n\nThank you all for joining us in this conference call. I'd like to reiterate that despite the continued political volatility, Peru's macro fundamentals remain solid and the economy remains resilient. As Cesar noted, we may face some regulatory challenges ahead, but, as always, we expect to navigate any changes and continue to generate solid returns. Furthermore, we acknowledge that high inflation and tighter monetary policy and the impact in our businesses are among the main concerns in the market.\n\nIn this environment, we are well positioned to continue to drive our businesses to meet our expectations. We anticipate structural loans to continue growing through the end of the year, although at a slower pace as compared to the first half. This dynamic, coupled with core income prospects and prudent risk management, led us to believe that there could be an upside potential to our ROE estimates. Going forward, while client payment activity is within expectations, we will continue to monitor closely any increases in early delinquency indicators and take appropriate steps to manage risk and protect asset quality.\n\nWe remain confident that the prudent approach we took at the beginning of the pandemic has put us in a good position today and especially for the future. Summing up, I am very pleased with the results of Credicorp and excited about the initiatives we're undertaking to strengthen and consolidate our position as a leading player in our markets while developing our own disruptors. We will continue to deliver on our strategy to drive sustainable, profitable growth, advance on our digitalization initiatives and attract and retain the best talent. Finally, as I noted in my opening comments, for our country to accelerate growth with a meaningful impact on the well-being of Peruvians, we need the government to focus on generating stability, securing our institutional framework and deploying the fiscal budget toward building capabilities across our economy.\n\nAgain, thank you all for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMilagros Ciguenas -- Investor Relations Officer\n\nGianfranco Ferrari -- Chief Executive Officer\n\nCesar Rios -- Chief Financial Officer\n\nErnesto Gabilondo -- Bank of America Merrill Lynch -- Analyst\n\nJason Mollin -- Scotiabank -- Analyst\n\nAndres Soto -- Santander -- Analyst\n\nAlonso Garcia -- Credit Suisse -- Analyst\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nThiago Batista -- UBS -- Analyst\n\nReynaldo Llosa -- Chief Risk Officer\n\nCarlos Gomez-Lopez -- HSBC -- Analyst\n\nYuri Fernandes -- J.P. Morgan -- Analyst\n\nMore BAP analysis\n\nAll earnings call transcripts"
}