{
  "companyName": "Excelerate Energy, Inc.",
  "companyTicker": "EE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/excelerate-energy-inc-ee-q2-2022-earnings-call-tra/",
  "content": "Excelerate Energy, Inc. (EE -3.06%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, everyone, and thank you for joining the Excelerate Energy second quarter 2022 earnings conference. My name is Terrence, I'll be moderating your call today. [Operator instructions] I now have the pleasure of handing over to your host, Craig Hicks, vice president, investor relations, and ESG Excelerate Energy. Please go ahead, Craig.\n\nYour line is now open.\n\nCraig Hicks -- Vice President, Investor Relations and ESG\n\nThank you, and good morning, everyone. Yesterday afternoon, we released our earnings press release, along with the presentation that our president and chief executive officer, Steven Kobos; and our chief financial officer, Dana Armstrong, will speak to you this morning. I would like to remind everyone that we will be making forward-looking statements on this call that involve a number of risks and uncertainties. Our actual results may differ materially from those expressed in these forward-looking statements, and we make no obligation to update or revise them.\n\nDuring the call, we'll also discuss some non-GAAP financial measures. We provided a reconciliation to the most directly comparable GAAP financial measures at the back of the presentation. With that, it's my pleasure to pass the call over to Steven Kobos.\n\nSteven Kobos -- President and Chief Executive Officer\n\nThanks, Craig, and thank you all for joining us this morning. Our second quarter results demonstrate our continued strong momentum. We are helping our customers enhance their energy security while supporting their decarbonization efforts, especially during these times of volatile energy prices and heightened attention to climate change. We are focused on strengthening our base business and expanding downstream into new and existing markets as we execute our strategy of deploying flexible LNG infrastructure and gaining valuable access to natural gas markets.\n\nI'll focus my remarks today on four topics: Excelerate's second quarter financial results, the value of our downstream business model, the current state of the global LNG market, and progress on our key projects. Dana will then walk through the details of our quarterly performance and our 2022 outlook before we open up the call to your questions. With that, now let's turn to the results for the quarter. Our financial performance during the second quarter was strong and in line with our financial outlook.\n\nWe delivered $39 million of operating income and $75 million of adjusted EBITDAR in line with our expectations. Our bottom line results during the quarter were driven primarily by another solid performance from our regasification business and increased gas sales at the Bahia terminal in Brazil. We achieved a significant milestone last week with our board of directors approving and declaring our inaugural dividend as a public company. This dividend demonstrates the confidence that our board and management team have in our downstream growth strategy and signals our commitment to returning capital to shareholders.\n\nOn the commercial front, we are fulfilling our commitment for regasification services at the Bahia Blanca GasPort terminal in Argentina. As we mentioned last quarter, the FSRU Exemplar arrived at Bahia Blanca in May. The Exemplar will provide regasification services through August 31st before being deployed to Finland. And then July, we signed an MOU with a subsidiary of Engro Corporation to study gas marketing opportunities in Pakistan.\n\nThis agreement builds on the momentum we have established by extending our reach downstream of our existing terminal to key regasified LNG markets. We also advanced several of our key growth projects during the quarter. The Finland regasification project remains on schedule and is progressing according to plan, and we have advanced our negotiations with the government of Bangladesh for our MLNG expansion and Payra LNG projects. I will talk about these projects in more detail later.\n\nAnd just this week, we signed a letter of intent with Hyundai Heavy Industries for a new 170,000 cubic meter FSRU to be delivered in 2026. This new FSRU, when delivered, will be a critical tool used to support the execution of our integrated projects. Before turning to market dynamics, I want to spend some time on our downstream business model and how it supports our strategy. As an established company, we've been successful in adopting our growth strategy to maximize value for our stakeholders in a myriad of economic conditions.\n\nToday, our strategy is focused on strengthening our positions in existing markets and opportunistically offering our customers increased capacity and downstream integrated services. By going downstream after we open a new LNG market, we expect to capture a larger percentage of the economics along the value chain, whether it's through our E-FIT flexible terminal offering or actually selling molecules downstream of our terminals via onshore pipelines. We have created a business model capable of significantly enhancing our growth trajectory. We are confident that going downstream will position Excelerate to thrive, not only in the currently tight LNG supply environment, which is attractive for FSRU charters, but also in a less constrained market as new LNG volumes come online in 2025 and beyond.\n\nNow I'd like to share with you some perspectives on the current state of the global LNG market. Since our last earnings call in May, we've continued to see strong demand for flexible LNG infrastructure across the globe as countries seek energy security and independence. This is not isolated to Europe. Although the energy crisis in Europe and war in Ukraine have indeed increased the necessity for flexible access to LNG.\n\nAs European countries continue to displace unreliable Russian pipeline gas deliveries, they are accelerating their efforts to secure flexible LNG infrastructure and available LNG supply. The increased competition for LNG supply has only exacerbated an already tight market, further elevating spot pricing amid strong demand from European countries and driving increased competition between Europe and non-OECD countries. The uncertainty around future flows of Russian pipeline gas and the increased European demand for regasified LNG, that's likely going to keep Dutch TTF gas pricing at an elevated level, heading into the winter season. And with exposure to further curtailments in Russian pipeline volumes, European governments are implementing measures to help manage winter demand.\n\nThese measures include curbing natural gas demand, mandating natural gas storage filled by October, switching from gas to coal for some power plants, and, of course, increasing imports of LNG. Notably, in June of this year, U.S. LNG imports in Europe exceeded the amount of Russian pipeline gas that flowed to the continent for the first time in history. We support Europe's efforts to enhance its energy security through increased access to global LNG supply.\n\nThis is why we have made securing access to Europe's gas sales market a priority for Excelerate Energy. During the quarter, we expanded the scope of our Albania project to include broader opportunities for gas sales in Europe's southern gas corridor. The planned Vlora terminal is situated to meet not only the regasified LNG needs of Albania, but also to deliver volumes both east and west via existing natural gas infrastructure in the region. In July, we signed an MOU with Overgas, Bulgaria's largest private natural gas distribution company, relating to the sale of regasified LNG downstream of our planned Vlora LNG terminal.\n\nWe have entered into negotiations with Overgas to sell them up to 1 billion cubic meters per year of regasified LNG for 10 years, using the proposed Vlora-Fier pipeline. Integrated LNG projects like the planned Vlora terminal are a logical solution to help meet the urgent energy needs of countries linked to Europe southern gas corridor, including Italy, Greece, Bulgaria, and Turkey. Our deployment of the FSRU Exemplar to Finland remains on track and is expected to commence in Q4. As a reminder, last quarter, we reached an agreement with the government of Finland for the Exemplar to provide up to 5 billion cubic meters per year of regasified LNG capacity through a new regasification terminal in Southern Finland.\n\nThis flexible LNG terminal will bolster the energy security of and diversified supply to Finland, while also serving more broadly the needs of the Baltic Sea region. In Bangladesh, LNG remains critical to the country's economy. Our two FSRU terminals currently deliver approximately 20% of Bangladesh's total natural gas supply needs. Due to current LNG price volatility, Bangladesh has minimized importing LNG from the stock market as it looks to relieve the effects of high spot prices on its economy.\n\nThe country is advancing plans to sign new long-term LNG supply purchase agreements to guarantee more affordable and predictable LNG pricing. The pricing we are seeing for long-term LNG supply remains affordable when compared to the spot market. This strategic action by Bangladesh dovetails with the gas sales agreements we are currently negotiating with the MLNG expansion and Payra projects. Bangladesh also celebrated a major milestone in June, the opening of the Padma River Multipurpose Bridge.\n\nThis is the largest national infrastructure project in Bangladesh's history. Prior to the completion of this four-mile-long bridge, the only way to cross the Padma River was by ferry. Now the western half of Bangladesh has greater connectivity to the country's East, which historically has outpaced the West in terms of economic development and growth. The Padma River Bridge is expected to serve as a catalyst for economic growth in Southwest Bangladesh.\n\nIt's sort of region with a population of over 30 million people and home to major urban centers such as Barishal and Khulna, the third largest city after Dhaka and Chittagong. This rapid economic growth in the Southwest Bangladesh will further increase energy demand in the region and advance the critical need for regasified LNG as a fuel source. Through the Payra project, Excelerate will play an important role in providing the energy to fuel economic growth in the region for years to come. Now let's turn to the key updates on our growth projects.\n\nDuring the quarter, we advanced the commercial negotiations for our Moheshkali LNG expansion and Payra LNG projects and our proposed long-term LNG supply agreement. As you know, these projects receive their formal approval in principle by the Bangladesh government earlier this year. The Ministry of Energy has since formed a proposal processing committee, or PPC for short, for each of these projects. Similar to the approval in principle, the establishment of these committees is an important milestone, and it's part of a predictable defined process by the government for the implementation of large-scale energy projects.\n\nThe PPCs are tasked with managing the formal commercial negotiations for projects and have the authority to finalize definitive contracts. The PPCs held their first meetings in July, and we expect negotiations for Moheshkhali LNG expansion, Payra, and our LNG supply agreement to advance in the coming months. In August, we officially engaged HSBC as our financial advisor to assist us with all financial aspects related to the Payra project. Once realized, long-term sales of regasified LNG into Bangladesh will significantly increase the scale of our global operations.\n\nBefore I turn the call over to Dana, who will walk through our financial results in more detail, I want to leave you with the following key takeaways. First, our base business has proven to be resilient and continues to drive strong financial results. Our downstream strategy, which is extending our reach in both new and existing markets, enables us to capture a larger percentage of the economics along the value chain. Having the option to deploy FSRUs for time charters or to use them in support of our gas sales business ensures that Excelerate is positioned well to grow through a variety of market cycles.\n\nSecuring access to Europe's natural gas sales market is a focus area for us in the current global LNG market. Our deployment of the FSRU Exemplar to Finland remains on schedule for the fourth quarter of 2022, and the commercial negotiations for Bangladesh projects are advancing as planned. With that, I'll now turn the call over to Dana.\n\nDana Armstrong -- Executive Vice President and Chief Financial Officer\n\nThanks, Steven, and good morning, everyone. Overall, we're pleased with the financial results we delivered for the second quarter, which were in line with our expectations. For the second quarter, we reported a net loss of approximately $4 million. The net loss reported for the quarter was driven by an expected IPO-related one_time charge of $21.8 million.\n\nThis one-time charge was incurred as a result of the extinguishment of the Excellence lease as part of the FSRU acquisition that was closed concurrently with the company's initial public offering in April 2022. Excluding the one-time charge, our adjusted net income was $20.4 million. As Steven mentioned, our adjusted EBITDAR was $75 million for the second quarter of 2022, up about $4 million versus the first quarter, driven primarily by the commencement of regasification services at the Bahia Blanca in May, and the FSRU expressed resuming operations under its long-term regasification charter in early April, along with higher gas sales volumes at the Bahia terminal in Brazil, partially offset by higher vessel operating costs. In comparison to the second quarter of last year, this year's second quarter adjusted EBITDA was up $10 million, an increase of about 15%.\n\nThe year-over-year increase was driven primarily by gas sales in Brazil, which commenced in December of 2021. Now let's turn to our liquidity and balance sheet. As of the end of June 2022, Excelerate had $386 million of cash and cash equivalents on hand. Our second quarter operating cash flow was $16 million, and we spent $56 million in cash capex in the second quarter, of which $50 million was for the two FSRUs acquired in conjunction with the IPO.\n\nOur leverage ratio, which we define as total debt plus finance leases divided by trailing 12 months adjusted EBITDA, was 2.7 times as of the end of June 2022. We have historically taken a conservative approach to capitalization. And as a result, we are realizing the benefits of having a strong balance sheet and the financial flexibility to fund our growth. Our strong cash position, in combination with our revolving credit facility, provides us with ample liquidity to fund our ongoing operations, near-term capex needs, debt service obligation, and our anticipated quarterly dividend payments.\n\nAs Steven mentioned earlier, on August 5th, our board of directors approved our inaugural dividend as a public company. The dividend payment, which is equal to $0.025 per share or $0.10 on an annualized basis, will be paid on September 7th to holders of record as of August 19th. Based on the commercial momentum we've established to date and our results midway through 2022, we are reaffirming our full year financial guidance. For the full year 2022, we still expect our adjusted EBITDA to range between $249 million and $269 million and our adjusted EBITDAR to range between $285 million and $305 million.\n\nWith that, we'll now open up the call for Q&A.\n\nOperator\n\nThank you. [Operator instructions] So the first question comes from Devin McDermott from Morgan Stanley. Please go ahead, Devin. Your line is now open.\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nSo my first one is on Vlora. And it's good to see the additional opportunities there in terms of gas sales in the agreement with Bulgaria. What I wanted to ask, though, is just an update on where we stand in getting formal approvals for that terminal and reaching FID on the project. And then also, how much gas is needed locally for the power gen? Any other local sales within Albania? And then how much is left to be used elsewhere, potentially?\n\nSteven Kobos -- President and Chief Executive Officer\n\nSuper, Devin. Thanks for joining us again. I appreciate having you. I would say the first thing I want to point out about Albania is that our emergency power situation or project that is intended as a bridge is fully underway.\n\nEPC is going on that. Power Barge is moving there, which is fantastic because they do have this immediate and pressing need for power that is only being exacerbated by the other actions in Europe. That does give us the confidence as we're advancing on the other negotiations, but really, I had to open that one up for Daniel, if you want our chief commercial officer to weigh in.\n\nDaniel Bustos -- Executive Vice President and Chief Commercial Officer\n\nSure. Devin, as the present means with the goal of delivering by the end of 2023, we are advancing the project in several fronts in parallel, engineering, permitting, and negotiations. So our ability to deliver will not be based on developing the project in a leaner way, where we have an FID. We're taking early actions to secure the timing, and we continue seeing the project second half of 2023 to start deliveries.\n\nIn terms of gas, that's a very good question. Our goal is to have an interconnector that will allow us to deliver up to five bcm per year to Europe. The capacity of the FSRU is roughly the same. But just to give you a better proportion, we expect about four bcm to be dedicated to the Albanian market and four bcm on some of the peaking capacity to be dedicated to the European market.\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nGot it. That's very helpful. And then just sticking with Europe more broadly. In terms of expanding the presence or opportunities there, can you talk a little bit more about the types of opportunities beyond Finland and Albania? And then specifically, I'm thinking about the access to additional open FSRU capacity you have over the next few years in your portfolio and whether or not converting an LNG carrier, I think you mentioned you have a kit for that, could be an option for faster time to market?\n\nSteven Kobos -- President and Chief Executive Officer\n\nYeah. Absolutely, Devin. I mean we've talked for some time about different approaches we're taking to tonnage, certainly, and we've made an announcement yesterday on one way we're growing the fleet. We're going to continue to look at the possibility of conversions.\n\nYou typically want a very specific opportunity there because it needs to be kind of bespoke in nature. We continue to see opportunities coming down the pike in Europe. We have our team over there pretty much constantly. I think everybody spent the summer in Europe.\n\nBut I think all I can really say is the events on the ground, the continual pressure that's being put on everyone in Europe, the growing insecurity about the coming winter has not slowed the pace of interest that we are receiving, but we haven't highlighted any of those opportunities as moving to the mature opportunity pile at this point. But we are definitely seeing the continuation of the interest that we've seen since March.\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nUnderstood. Great. We'll look forward to more updates on that in the future then. Thanks for taking my questions.\n\nSteven Kobos -- President and Chief Executive Officer\n\nThank you, Devin. Appreciate it.\n\nOperator\n\nOur next question comes from Michael Blum from Wells Fargo. Please go ahead, Michael. Your line is now open.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nThanks. Good morning, everyone. I wanted to ask about this LOI for potential newbuild FSRU. I guess my question is, would you be purchase -- would you be moving forward in purchasing this before you have a contract in a specific use for the vessel? Or would you first secure the contracts? Just wanted to understand the sequencing of how that would work.\n\nAnd then, assuming you go forward, what would be the cost and timing to deliver?\n\nSteven Kobos -- President and Chief Executive Officer\n\nThanks, Michael. We are absolutely moving forward to that. And what I can tell you is, that's for our fleet. We're limited in what we can disclose with Hyundai.\n\nWe've obviously been looking at this since the spring. As I just told Devin, we've obviously been looking at conversions as well. We're pleased amid all of the order book filling that's going on globally, tied to the FIDs that are being taken on liquefaction and the corresponding need for additional LNGCs. To push that, we're glad to be able to have a 2026 delivery.\n\nThe idea on this is, it's going to be another best-in-class asset that we will use as we've always used our fleet. Our fleet has been used on a portfolio basis. It's part of why we've succeeded over the years. The idea will be, frankly, that this will go and in all likelihood displace one of our existing vessels with a customer, so that we can take exactly the right asset with a combination of characteristics to the new opportunities that are assuredly coming with the supply balance on this asset class.\n\nWhat you should see from this is that while most owners of FSRUs seem to be in a mood to sell and capture short-term uplift, we assuredly intend to grow this fleet. So I can tell you, we've been looking at this for some time. We've evaluated all the possibilities. We're happy to go with Hyundai, the largest shipyard in the world -- shipbuilder in the world.\n\nAnd 2026, for a bespoke best-in-class vessel, is, we believe, an outstanding timeline. But we intend to move forward with this.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nGreat. Thanks. Very helpful. My second question, I just wanted to ask about the capex budget for this year.\n\nCan you just remind us -- I guess, has that changed at all? Or just remind us where that stands for 2022 and then potentially any early reads into 2023? Thanks.\n\nSteven Kobos -- President and Chief Executive Officer\n\nYes, Michael, I've got a look across the table at Dana, our CFO, because I don't recall that we gave capex guidance, Dana?\n\nDana Armstrong -- Executive Vice President and Chief Financial Officer\n\nWe did not, and we're not giving guidance on '22 capex right now.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from Matt Taylor from Tudor, Pickering, Holt, and Co. Please go ahead, Matt. Your line is now open.\n\nMatt Taylor -- Tudor, Pickering, Holt and Company -- Analyst\n\nYeah. Thanks for taking my questions here. I wanted to go back to that southern gas opportunity because I think it could be quite significant. So you got capacity at the terminal of five bcm a year.\n\nYou mentioned one of that could be for Bulgaria. But can you clarify how much of the four remaining will be for Albania? And then the rest, you highlighted various potential countries, but one that screens pretty attractively, at least to us, is Italy, which you signed an MOU last year with Snam on that Vlora-Fier pipeline. So any more color you could provide would be helpful.\n\nSteven Kobos -- President and Chief Executive Officer\n\nSure. Thanks for joining us, Matt. I appreciate it. The beauty of it, and I think I'm looking across the table, I think Bulgaria we're talking about one bcm a year there.\n\nSo we can do the math on that. Obviously, Italy is an attractive component of this, but we shouldn't take our eye off of the markets to the East as well. I mean this is -- at this part of the European market is integrated though, as you know, parts of Europe are fragmented in their connectivity. But certainly, Italy is a big part of what's driven our interest from the very beginning from the IPO and well before that.\n\nIt's what drove our interest in Albania, knowing that this upside was there. I'm going to hand it to Daniel because he studied some of these individual markets.\n\nDaniel Bustos -- Executive Vice President and Chief Commercial Officer\n\nThe best math for the utilization of the terminal, out of the five bcm, one bcm for Albania. We are in discussions for one bcm for Overgas, and we're going to continue discussions for three bcms for the different markets. There's capacity for physical delivery downstream to Italy, and it's one of the markets that we are focusing, as you mentioned, Snam is one of the critical players in the market, and they are interested in our project, of course, as they show with the MOU. But also, the commercial reverse of TAP can bring a lot of attractive markets to the terminal.\n\nMore of Bulgaria, of course, but also Greece and even Turkey. Our capacity to swap volumes in TAP is going to give us a lot of flexibility, and that's where we are actively involved on negotiations, not only downstream to Italy, which, again, is one of the critical markets, but also on commercial reverse.\n\nMatt Taylor -- Tudor, Pickering, Holt and Company -- Analyst\n\nGreat. That's helpful. And just to clarify, too, when you underwrote this, as you're going through the IPO, my understanding was you're focused on Albania and the rest of these opportunities would be upside. So I guess the question is, that return you underwrote for the opportunity and kind of shared, would it be materially getting better here? Is there capex for this pipeline and other infrastructure required that would offset?\n\nSteven Kobos -- President and Chief Executive Officer\n\nYes. I guess you have a couple of questions there, Matt. Yes, what we were presenting in the proxy and the red show and our discussions throughout was the base LNG to power deal for Albania and some native gas demands there within Albania. We always had on a horizon, just as we do in any market, where can we go further downstream? And frankly, we've always thought, well, what's the logical downstream for Albania, and it's further into the European market.\n\nSo to your first question, yes, the base deal did not include this. This should be accretive. We're still working on the shares and stakes of any JV partnership for the pipe and the interconnector to TAP. There will be some capex.\n\nIt'll be fairly modest, I would say, and you will see some uplift from it. But we're not in a position to guide you further on that.\n\nMatt Taylor -- Tudor, Pickering, Holt and Company -- Analyst\n\nThat's great. And one more, if I may. You mentioned Bangladesh has been load shedding due to elevated LNG pricing. And you've seen this demand reallocation across the world, just given how high gas prices have become.\n\nBut can you just share, perhaps, Steven and Daniel, what gives you confidence these countries you're targeting won't delay your projects and basically make the case for your projects, even despite these prices that we're seeing on the screen?\n\nSteven Kobos -- President and Chief Executive Officer\n\nYep. Matt, we've been calling this out for some time. I mean I don't want to act like we're Nostradamus or anything, but we've been saying for some time that \"Hey, these sovereigns got a little too heavy into the spot game.\" And while it makes sense for a while to optimize their delivered cost, it doesn't, right now. And they're doing what's sensible.\n\nBut at the same time, Bangladesh economy's need for energy, and we've highlighted the Padma River Bridge, which we think is just going to be like throwing kerosene on top of the economy in the West. It's chugging along and still needs this energy desperately. That's why we've been negotiating at length and continuing for long-term supply. And we've been approved as a -- as someone who can deliver that, and that's why we wanted to move with a critical component of the Payra project to be long-term supply because the reality is, what's out there right now for long-term supply is affordable for the Bangladeshis.\n\nI mean, they say it quite openly, but they need more of it. And it's why Excelerate has been laser-focused on being the critical lynchpin with our infrastructure to be in a position to offer that to them. So really, this is unfolding in a very predictable way. The Bangladesh government is making a mature pivot and one that we are wanting to be part of that pivot.\n\nMatt Taylor -- Tudor, Pickering, Holt and Company -- Analyst\n\nGreat. Thanks for taking my questions.\n\nSteven Kobos -- President and Chief Executive Officer\n\nThank you, Matt.\n\nOperator\n\nThe next question comes from David Havens from SMBC Nikko. Please go ahead.\n\nDavid Havens -- SMBC Nikko Securities -- Analyst\n\nGreat. Good morning, guys. Thank you. First question relates to the LOI for the heavy -- Hyundai heavy contract for new FSRU.\n\nIs there an option embedded with the contract as well for a second vessel?\n\nSteven Kobos -- President and Chief Executive Officer\n\nAt this point, David, we will discuss that as part of the shipbuilding contract. I mean, we're focused on the specification and advancing the shipbuilding contract. If not to put that into the LOI at this point, I would just be transparent about that. But that is something that we will be discussing.\n\nDavid Havens -- SMBC Nikko Securities -- Analyst\n\nOK. And then the second question relates to Filipinas. I know on the last call, you've talked about shifting that from 2023 to the very latter part of 2024. But do you have any updates as to the status of that project? I mean, obviously, being an open access terminal, natural gas prices had a very defined effect on the capacity being signed up there.\n\nCan you give us an update on where that project stands?\n\nSteven Kobos -- President and Chief Executive Officer\n\nYeah, David. I wouldn't -- you point to it being an open access project, which you're right. I mean we are unique and focusing on the fact that we think open access is the right play to make long term in Philippines. But I would say that the other folks who are looking at projects that are tied to power generation, are as sensitive to natural gas, as you say, as overall demand.\n\nDaniel, I know you've just been in contact with that team, but you might elaborate on some of the steps that are going on right now.\n\nDaniel Bustos -- Executive Vice President and Chief Commercial Officer\n\nSure. Yes. Philippines is fairly unique in Asia. It has a very mature wholesale power market, with private companies that are clearly playing on it and also on the long-term contracting for power.\n\nThe disadvantage is, it's a fairly small market. And Steven pointed out, when you try to bring international prices and you're a single player, it can be very difficult, particularly with the prices that we're experiencing. I think that is putting some dumping on the ability to develop the projects. Philippines needs the power.\n\nThey need the gas, and we believe the government is going to move toward facilitating access to LNG. Our bet is still the same. We believe that a terminal that serves the whole market is the best bet. We believe that the fundamentals that we're seeing will support that.\n\nDavid Havens -- SMBC Nikko Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question comes from Cameron Lochridge from Stephens. Please go ahead, Cameron. Your line is now open.\n\nCameron Lochridge -- Stephens, Inc. -- Analyst\n\nHey. Good morning, guys. Thanks for taking my questions. So I want to start on the Vlora terminal as well as the MLNG expansion in the back half of '23.\n\nObviously, in the case of Vlora and Albania, plenty of upside there in terms of potential gas sales. You talked about the four bcm of capacity that you still have. In terms of those two projects, both coming on in the back half of '23, any early indications or just kind of what the base earnings potential of those projects could be, forgetting about the upside of gas sales? Just how should we think about the earnings power? I mean you guys have been pretty steady at, call it, $250 million to $260 million, $270 million in EBITDA over the past several years. How -- what kind of upside to those numbers could we see from these two projects?\n\nSteven Kobos -- President and Chief Executive Officer\n\nCameron, I think what we've continued to tell the analyst community over the summer and even before that -- on anything we're bringing to the table right now, you should really be thinking in terms of capex deployed, something like a three to five times multiple of EBITDA. And the reason we've seen that is, historically, the FSRU business might have been around an eight times multiple, but we really see the advantages of going downstream, aggregating additional services, whether it's gas sales or anything else is including -- is helping us reach that three to five times multiple. So I don't think we're really prepared to give any better indication than that right now, but that's certainly what we're targeting.\n\nCameron Lochridge -- Stephens, Inc. -- Analyst\n\nGot it. That's super helpful, Steven. And then I guess just one more question. This is kind of a nuance, but any color you can give on either average realized pricing for the gas sales? I mean, over the second quarter, first half or just volumes sold, I mean you've been substantially on the top line for the past couple of quarters.\n\nSo just any help that we could get in terms of volumes or pricing on the gas sales would be very helpful.\n\nSteven Kobos -- President and Chief Executive Officer\n\nNow, this is principally -- and Dana, you're going to have to jump in here because I don't remember how we included some of the Q1 sales into New England. But I think this is largely a question about Brazil.\n\nDana Armstrong -- Executive Vice President and Chief Financial Officer\n\nYes, yes. For Brazil, I mean, definitely, if you look quarter over quarter, the revenue increase is driven by Brazil, obviously, higher volumes there. But as we've said on previous calls, we negotiate a fixed margin rate on our gas sales contract in Brazil. So even though the revenue will be somewhat lumpy and somewhat volatile, depending on how prices move, our margin rates and our EBITDA will be relatively constant on a rate basis.\n\nAnd so we'll see the benefit of that. Obviously, it's those increased volumes, but you won't see as much volatility in the margins [Inaudible] in the revenue.\n\nSteven Kobos -- President and Chief Executive Officer\n\nI think if I were looking at Brazil, Cameron, the real takeaway for me would be how the heck is that Brazil continues to want to buy so much from us? Why has this not resulted in demand destruction there on the sales? And I think this just goes to the fact that, hey, the need for LNG, I think back in April and May, everyone assumes that every molecule would go to Europe. And what we're seeing is, it's just not the case, even at these prices. And that's largely because everyone else has their own needs for energy security. We are understandably focused on Russia, but that takes our eye off of -- or people's eyes off of the failures on supply from Bolivia and the fact that some of these other markets do need what we're offering.\n\nSo I thank you for bringing that up because Brazil has been a pleasant surprise about the resiliency of demand in the face of what people thought would lead to demand destruction.\n\nCameron Lochridge -- Stephens, Inc. -- Analyst\n\nYep. That's super helpful. Thank you, both. And I'll turn it back.\n\nSteven Kobos -- President and Chief Executive Officer\n\nThanks, Cameron. Appreciate it.\n\nOperator\n\nThe next question comes from Marc Solecitto from Barclays. Please go ahead, Marc.\n\nMarc Solecitto -- Barclays -- Analyst\n\nHi. Good morning. So maybe just staying on Brazil. Just wondering if there's any update on a potential extension or expansion of the existing gas sales agreement there? It seems like a pretty strong demand picture.\n\nSo just wondering how we should think about that market, going forward?\n\nSteven Kobos -- President and Chief Executive Officer\n\nYes, absolutely, Marc, and thanks for joining us today. I think I've already commented on how happy I am to see this demand in excess of what we anticipated in Brazil, despite these prices. Daniel's regional teams in LatAm, I know, are busy on those negotiations, but any further color you want to provide?\n\nDaniel Bustos -- Executive Vice President and Chief Commercial Officer\n\nSure. Marc, we see strong fundamentals for 2023. The rest of 2022, Dana already commented. And the basis are a continuation of what we have seen.\n\nIt's a combination of a strong Brazilian economy, although they are experiencing some headwinds, inflation related, as the rest of the world. Brazil's, strong position on commodity exports, both farming and energy, have made the economy extremely solid. And that shows on the demand and on their capacity to pay premium prices for energy. And the second one is the continuous deterioration of Bolivia as a credible supplier that is bringing both a more capacity to import LNG or opportunities to sell gas in Brazil, but also an increased risk.\n\nLet's remember, we make money in Brazil, providing both security of supply and gas sales, and the two products are in high demand.\n\nMarc Solecitto -- Barclays -- Analyst\n\nGot it. Appreciate the color there. And then maybe just shifting to Pakistan. Can you just expand a bit on the MOU with Engro? What are the volumes being contemplated there? And would there be any investment on onshore infrastructure as part of that?\n\nSteven Kobos -- President and Chief Executive Officer\n\nI think the -- the thing -- my takeaway on Pakistan and why you should pay attention to that, this is a longer-term play, Marc. I mean the reality is, I'm bullish on Pakistan. He's bullish on Pakistan. It's the world's fifth most populous country.\n\nIt has a lot of gas connectivity among people who are connected to the wire, excluding those that have no access to the wire. Their domestic decline curve and their long-term production, especially out of Baluchistan, is -- continues to decrease. And so we see there to be a long-term need for this. Because of macro issues, you don't see a lot of people running to Pakistan right now.\n\nWe know what Pakistan will do long term. We're doing the heavy lift now, and the government needs to continue to work on open access. So you should really see this as our commitment to go downstream to take early action. This one will not pay off in the next two or three quarters.\n\nThis is a longer-term project, but we believe in it. We are confident that the IMF issues will be worked out with Pakistan, and we intend to be there in a catbird seat when the opportunity downstream further develops. But I can tell you, someone who's traveled to Pakistan many times, you can just see the unfulfilled need there for gas, and we intend to be taking steps like this partnership with Engro, one of the most mature and respected public companies on the Karachi Exchange. So you can just see this as a long-term commitment by Excelerate to this market.\n\nMarc Solecitto -- Barclays -- Analyst\n\nGot it. Appreciate the time.\n\nSteven Kobos -- President and Chief Executive Officer\n\nThank you, Mark.\n\nOperator\n\n[Operator instructions] It appears we have no questions at this moment. So I'm going to hand it back to Steven Kobos, president and CEO, Excelerate Energy, for any final remarks.\n\nSteven Kobos -- President and Chief Executive Officer\n\nSure. Thank you again to everyone who joined us on today's call. I hope as you can see, we're pleased with the progress we've made through the first half of the year and look forward to providing you with additional updates in the coming months. Until then, if you have any questions, please feel free to reach out to Craig Hicks, our VP of investor relations.\n\nAnd with that, thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCraig Hicks -- Vice President, Investor Relations and ESG\n\nSteven Kobos -- President and Chief Executive Officer\n\nDana Armstrong -- Executive Vice President and Chief Financial Officer\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nDaniel Bustos -- Executive Vice President and Chief Commercial Officer\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nMatt Taylor -- Tudor, Pickering, Holt and Company -- Analyst\n\nDavid Havens -- SMBC Nikko Securities -- Analyst\n\nCameron Lochridge -- Stephens, Inc. -- Analyst\n\nMarc Solecitto -- Barclays -- Analyst\n\nMore EE analysis\n\nAll earnings call transcripts"
}