{
  "companyName": "Express",
  "companyTicker": "EXPR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/08/express-expr-q3-2022-earnings-call-transcript/",
  "content": "Express (EXPR 9.09%)\nQ3 2022 Earnings Call\nDec 08, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Chris, and I'll be your conference operator today. I'd like to welcome everyone to the Express, Inc. conference call to discuss third quarter 2022 earnings, as well as the partnership with WHP Global.\n\nAll lines have been placed on mute to prevent any background noise. After the speakers' remarks, there will be a question-and-answer session. [Operator instructions] Thank you. I now like to hand the call over to Greg Johnson, vice president of investor relations.\n\nPlease go ahead.\n\nGreg Johnson -- Vice President, Investor Relations\n\nThank you, Chris. Good morning, and welcome to the Express earnings conference call and webcast to discuss the announcement of our third quarter 2022 results, as well as our partnership with WHP Global. Our third quarter 2022 earnings release and presentation and the press release and presentation relating to the partnership with WHP Global can be found in the investor relations section of express.com. These items will be archived, and our call will be available for replay.\n\nI'd like to open by reminding you of the company's safe harbor provisions. Today's call may contain forward-looking statements. Any statements made during this conference call, except those containing historical facts, may be deemed to constitute forward-looking statements within the meaning of the federal securities laws. Actual future results may differ materially from those suggested in forward-looking statements due to a number of risks and uncertainties.\n\nFor a description of the risk that could cause our results to differ materially from those described in forward-looking statements, please refer to our 2021 Form 10-K, third quarter Form 10-Q, and other filings with the SEC. These risks and uncertainties are further detailed in our earnings press release and the press release announcing the partnership with WHP that we issued this morning. These statements represent our current judgment and are subject to risks, assumptions, and uncertainties. Express assumes no obligation to update any forward-looking statements whether as a result of new information, future events, or otherwise, except as required by law.\n\nWe have two separate presentations on our investor relations website this morning. One for our third quarter 2022 earnings release and another stand-alone presentation for the partnership announcement. The consummation of the partnership is pending lender consent, regulatory approvals, and customary closing conditions. Our comments today will summarize the detailed information provided in both press releases and both investor presentations.\n\nIn addition, we may refer to certain non-GAAP measures. You can locate a reconciliation of any non-GAAP measures discussed in our comments to amounts reported under GAAP in our earnings release. We will also be providing financial comparisons to prior fiscal periods, and our prepared remarks today refer to 2021 unless otherwise noted. Please see explanatory notes in the earnings release for additional details regarding the definition of certain items.\n\nWith me today are Tim Baxter, chief executive officer; Matt Moellering, President and chief operating officer; Jason Judd, chief financial officer; and Yehuda Shmidman, CEO and founder of WHP Global. I will now turn the call over to Tim.\n\nTim Baxter -- Chief Executive Officer\n\nThank you, Greg, and good morning, everyone. I'll briefly review our third quarter results before turning to the strategic partnership with WHP Global that we announced this morning. Q3 was tougher than we anticipated and that is reflected in our results. The macroeconomic, consumer, and competitive environments were extremely challenging and became more acute as the quarter progressed.\n\nAcross the industry, we saw widespread aggressive promotional activity. Our strategy to elevate our brand through higher average unit retails and reduced storewide and sitewide promotions, which has driven steady growth for the past five quarters, came up against the consumers' reduced spending in discretionary categories and increased appetite for deep discounts. At the same time, we had some misses in our women's business that further impacted our performance. We did however post our sixth consecutive quarter of positive comps in our men's business.\n\nDespite these results, we remain confident in our ability to achieve our stated goal of long-term profitable growth in the Express brand. We are already working to realign our assortments based on customer purchasing behavior, recalibrate our opening price points, and address opportunities in our women's business. We are also taking decisive actions to right-size our cost structure and improve our profitability. This morning, we also announced some incredibly exciting news.\n\nWe have entered into a mutually transformative strategic partnership with WHP Global, a leading brand management firm to advance our EXPRESSway Forward strategy, scale our Express brand, and accelerate the growth of our company through brand acquisitions. Through this partnership, we begin a bold new chapter, one that we expect will drive greater shareholder value. Let me talk you through the key components of this partnership. First, we will leverage our fully integrated omnichannel platform and operating expertise to acquire, operate, and grow multiple fashion brands.\n\nSecond, we will establish an intellectual property joint venture with WHP to scale the Express brand through category and global licensing expansion. And third, we will immediately strengthen our balance sheet with $260 million in gross proceeds from the WHP investment. When combined, we expect these components will lead to accelerated long-term, profitable growth and increased shareholder value. Let me provide some additional detail on each one.\n\nFirst, our platform. This model furthers our transformation from a mall-based specialty retailer to a fully integrated omnichannel platform with the capability and reach to operate multiple brands. We expect to be well-positioned to take advantage of anticipated retail industry consolidation by pursuing brand acquisitions in partnership with WHP. Through these strategic acquisitions, we will leverage our platform to accelerate our growth, generate operating margin expansion, create cost savings, and drive profitability.\n\nSecond, the intellectual property joint venture. This will enable us to scale our multibillion-dollar Express brands through new licensing agreements with international partners and in non-core categories. Today, the awareness and profile of the Express brand are larger than its category and geographic footprints. And now, with the partnership, expertise, and reach of WHP, the intellectual property joint venture can help to unlock its untapped potential.\n\nTo be clear, EXPR will continue to operate the Express brand in the U.S. exactly as we do today through a 100-year license agreement with the new intellectual property joint venture. I have said many times that we are transforming Express from being known as a store in the mall to a brand with a purpose powered by a styling community and that remains true going forward for the Express brand. Third, the balance sheet.\n\nWHP will invest a total of $260 million into this partnership. Twenty-five million will be through a common equity pipe investment to acquire 5.4 million newly issued shares of Express common stock at $4.60 per share. This represents an approximate proforma ownership of 7.4%. The intellectual property joint venture is valued at approximately $400 million.\n\nWHP will invest $235 million for a 60% stake and EXPR will maintain a 40% stake. These cash proceeds will strengthen our balance sheet allowing us to pursue compelling synergistic brand acquisition opportunities, upgrade our platform capabilities, and eliminate our high-interest rate term loan. As we do so, we will maintain our disciplined approach to capital deployment. This is a bold and innovative partnership and realizing its full potential would only be possible with a highly experienced and equally committed partner.\n\nI have known Yehuda Shmidman, CEO and founder of WHP Global, for many years. I have great respect for the WHP model and their expertise and for Yehuda's personal and professional integrity. It is my pleasure to introduce Yehuda to tell you a little bit about WHP.\n\nYehuda Shmidman -- Chief Executive Officer and Founder, WHP Global\n\nThank you, Tim. I'm very excited to be here with you today. First and foremost, I share your enthusiasm for our new partnership, and I am 100% aligned with the vision you outlined. I believe strongly that it truly will be transformational for both of our companies.\n\nWHP Global is a leading brand management firm with significant capital backing and a strong portfolio of global consumer brands that include Toys\"R\"Us, Babies\"R\"Us, Anne Klein, Joseph Abboud, Joe's Jeans, and more. Today, we have a global network of more than 125 licensees across North America, Asia, the Middle East, Europe, and Latin America, and we are thrilled to partner with EXPR as we look to leverage our expertise to help drive growth for both Express and new brands to be acquired in the future. We believe that Express is an incredible brand with a powerful brand purpose and meaningful untapped growth potential, especially in major regions outside the U.S. Furthermore, our belief is that by aligning our respective capabilities, we can significantly enhance the value of our companies by growing Express together and by acquiring additional fashion brands in the future.\n\nOn behalf of the entire WHP Global team, I'd like to thank Tim, Chairman of the Board Mylle Mangum, the board of directors, the management team, and all of the EXPR stakeholders. We are thrilled to join forces with the team and confident that we will accomplish great things together.\n\nTim Baxter -- Chief Executive Officer\n\nThank you, Yehuda. Together, we partner a multibillion-dollar brand with high awareness and a steadily growing base of loyal customers with a forward-thinking brand management company that has a proven track record of unlocking brand value on a global scale. Together, we build a portfolio of fashion brands and expect to deliver accelerated long-term growth. In addition to the mutual opportunities and benefits of this partnership, a number of industry dynamics makes us an opportune time for such a bold move.\n\nOver the last few years, the retail apparel industry has been negatively impacted by a scarcity of capital, high SG&A expenses, which have led to operating margin pressure and ever-increasing expectations around the customer experience. The financial results and pace of growth for our company and so many others in our sector have certainly been affected by these conditions. As I said earlier, we will continue to operate the Express brand in the U.S. just as we have been doing, and we'll build upon everything that is working.\n\nWe will continue to drive growth in modern tailoring, denim, chinos, and tops. Through our fleet optimization strategy, we have had great results in our [Inaudible] pilot stores. We've opened six new Express Edit concept stores in the last five months and will continue to drive growth here. Our UpWest brand had a remarkable quarter with sales up 40%.\n\nWe opened our 14th store in Soho, launched our first wholesale partnership with Nordstrom, and will also continue to drive growth here. UpWest remains separate from our partnership with WHP and will continue to operate as usual. The EXPRESSway Forward strategy is grounded in four foundational pillars: product, brand, customer, and execution. These are the fundamentals of any sound and scalable retail apparel business, and every brand we bring into the fold in the future will be guided by our relentless commitment to putting products first, developing a relevant and compelling brand positioning, engaging existing customers, and attracting new ones, and ensuring seamless omnichannel execution.\n\nThis mutually transformative strategic partnership with WHP will advance our EXPRESSway Forward strategy, scale our Express brand, provide WHP access to a fully integrated omnichannel operating platform, and accelerate the growth of both of our companies. Through this partnership, we begin a bold new chapter and expect to drive greater value for our shareholders. I appreciate your interest in our company, and I'll now turn the call back over to the operator for your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Marni Shapiro with Retail Tracker. Your line is open.\n\nMarni Shapiro -- Retail Tracker -- Analyst\n\nHey, guys. Congratulations, Yehuda. It's so nice to hear your voice.\n\nYehuda Shmidman -- Chief Executive Officer and Founder, WHP Global\n\nThank you, Marni. \n\nTim Baxter -- Chief Executive Officer\n\nGood morning, Marni.\n\nMarni Shapiro -- Retail Tracker -- Analyst\n\nGood morning. So, I guess a couple of questions. I do want to dive into just the quarter and the trends. You guys are one of the last to report.\n\nSo, if you could talk a little bit just about your own trends, what was tough in the quarter? You mentioned that women's, you had a couple of misses. I'm curious also if you saw challenges in your denim business. And then if you could just talk a little bit more broadly about how you're seeing the consumer respond to product to promotion. Is traffic down? Your outlet stores were still flat.\n\nSo, I'm curious what you're seeing overall away from what you're seeing specifically.\n\nTim Baxter -- Chief Executive Officer\n\nAbsolutely. So, look, I think the quarter, as I've said, the challenges in the quarter got more acute as the quarter progressed, which I think is very consistent with what we've heard from many of our competitors who reported earlier. And for us, I think the challenges were somewhat different. We have, as I said, driven five consecutive quarters of growth over our pre-pandemic levels through elevating our average unit retails and reducing storewide and sitewide promotions.\n\nSo, those two things, you know, we've had average unit retails up in the teens for many quarters in a row. And those things, Marni, came in direct conflict with the consumers' desire to spend less in discretionary categories and their desire for deeper discounts. So, the strategy which has worked really very well for those five quarters just really came in conflict with the consumer's behavior and the consumer's mindset. And so, the outlook that we provided for the year gives you some indication of how the fourth quarter is playing out.\n\nI would expect those same dynamics to be in play in the fourth quarter. That being said, I also mentioned, we had some misses in our women's business and specifically in women's tops. That is a category that, as you know, is one of the most price sensitive. It's also one of the categories that drives the most new customers into the brand.\n\nAnd so, in that category, in particular, I think we saw really increased pressure based on those market dynamics that I just described. We also got a little out of balance. The versatility of our tops assortments in women's wasn't where it needed to be. And we are making those corrections and expect to have that business back on track as we move into the first quarter based on the corrections we've made.\n\nYes, specifically about denim. I think denim is certainly a category that has slowed -- did slow throughout the third quarter where we were seeing tremendous growth in denim through the second quarter and where we were grabbing market share. On this call, last quarter, I talked about grabbing a tremendous amount of market share in denim. I'm fairly confident that we will still -- when we see all the data that we still will have taken market share in denim, but it is not a category that's driving growth right now.\n\nIn men's, the denim business is being completely offset by our incredible chinos business, but in women's, there doesn't seem to be a casual bottoms offset to that drop that we're experiencing in denim.\n\nMarni Shapiro -- Retail Tracker -- Analyst\n\nAnd your women's not buying cargos and that kind of lock-up?\n\nTim Baxter -- Chief Executive Officer\n\nNot yet. Not yet. The biggest success we've had in bottoms in women's has been in the relaunch of our Editor Pants, an iconic – obviously, an iconic pants for us. And you'll see an expansion of that as we move into the first quarter, but she is not buying a cargo from us yet.\n\nMarni Shapiro -- Retail Tracker -- Analyst\n\nAnd then can you just -- I just want to clarify one thing, I think you said Express will have 40% ownership, WHP 60% ownership, is that of EXPR in total or of the new shares? And then --\n\nTim Baxter -- Chief Executive Officer\n\nYup. So, that's a great question and one we should definitely qualify. So, there are two things. Let's start with the IP joint venture that we have formed together.\n\nWHP is investing $235 million for a 60% stake in the joint venture -- in the intellectual property joint venture, and we will maintain a 40% stake. The second piece is they are investing $25 million for 5.4 million newly issued shares of common stock at $4.60 per share, which represents a 7.4% proforma ownership of EXPR.\n\nMarni Shapiro -- Retail Tracker -- Analyst\n\nOK. So, they're going to own 7.4% of EXPR and then they will own 60% of the joint venture, and you guys will own -- and the EXPR will own 40% of the joint venture?\n\nTim Baxter -- Chief Executive Officer\n\nExactly.\n\nMarni Shapiro -- Retail Tracker -- Analyst\n\nGot it. OK. Just want to clarify that. And then last question, I'm sorry, but you touched on AUR.\n\nIf you could just think forward to 2023, obviously, 2022 is wrapping up a little tougher, but there is prices to bring merchandise over here, freight costs, and things are down even though freight costs in the U.S. are still high. Can you just talk a little bit about opportunities or pressure you see going into 2023? And what the outlook looks like for AUR? Are your AUCs down in 2023 at all? So, is there room to kind of pick back up on that conversation?\n\nTim Baxter -- Chief Executive Officer\n\nYes, absolutely. So, as we move into 2023 and specifically in our women's business where we've seen the greatest price sensitivity, and as I said, Marni, and as you know in tops, very specifically, we have -- we are recalibrating our assortments to reintroduce more opening price points, more price points that are more in line with where we have been historically. The reintroduction of some very powerful fashion mix. I think what -- so I do -- our average unit cost, yes, will be going down in specific categories.\n\nIn other categories like jackets, where we've seen exponential growth in both men's and women's, we're winning in modern tailoring. We've seen very little price resistance actually there because the value we offer in those categories is so extraordinary. So, we will not -- we're going to continue to push forward putting products first and we'll get the right product. And in modern tailoring, we exist in a very powerful value bands.\n\nBut in the tops business specifically, we are recalibrating that. We're reintroducing opening price points into the mix. We're going to drive fashion very differently. We're going to have much more versatility and much bigger breadth.\n\nWe also got actually a little tight on our SKU counts, a little focused, too focused perhaps, and needed greater breadth in our top assortment. And so, all of the work we're doing, we believe we'll get the women's top business back on track as we move into Q1. And yes, there will be lower price points throughout the assortment.\n\nMarni Shapiro -- Retail Tracker -- Analyst\n\nGreat. Thank you. I'll take the rest offline.\n\nTim Baxter -- Chief Executive Officer\n\nThanks, Marni. Great to talk to you.\n\nOperator\n\nThe next question is from Eric Beder with SCC Research. Your line is open.\n\nEric Beder -- SCC Research -- Analyst\n\nGood morning. Congratulations.\n\nTim Baxter -- Chief Executive Officer\n\nGood morning, Eric.\n\nYehuda Shmidman -- Chief Executive Officer and Founder, WHP Global\n\nGood morning.\n\nEric Beder -- SCC Research -- Analyst\n\nGood morning. I want to ask a small question about current and one about the WHP. Inventories, so you made some progress in the inventories. How should we be thinking about inventories at end of the year and going forward?\n\nJason Judd -- President and Chief Operating Officer\n\nYeah. Sure, Eric. This is Jason. Good morning.\n\nWith regard to inventories, we've been very consistent with our language around the purpose for why the inventory balance was escalated at the beginning of the year and how we were going to work through that balance and have it more in line with our sales trend by the end of the year, that still absolutely holds. That should be where the expectation is for the end of 2022. And as we work into 2023, the expectation is that we continue to be on this trend of being in line with sales or growing slower than sales as we push for efficiencies there. Obviously, balanced with the comments that Tim just had around the work that needs to be done in balancing out the assortment, but that is again into a mix of different price points and cost points, but the trend that we're on right now is the trend that you should be modeling.\n\nEric Beder -- SCC Research -- Analyst\n\nOK. And for the acquisitions now, what is your -- going to be your criteria for acquisitions, I guess, both operationally and financially? And when you look at it, are those acquisitions going to be in EXPR and then paying the royalty to the joint venture, or is it envisioned they're going to be inside the joint venture?\n\nTim Baxter -- Chief Executive Officer\n\nWell, it's a great question, Eric. A really good question. So, I'll start with the first, which is the criteria. We're going to be exploring multiple opportunities, and we're going to be very, very focused on those opportunities that we believe will provide us with the most top and bottom-line growth.\n\nThat is -- put simply, those are the two most important criteria. Will this be accretive to our top and bottom line? Can we drive growth through these acquisitions? And so, it's more than just about the revenue and it's more than just about whatever brand it is. It's got to be able to drive both top and bottom-line growth for us. The bottom-line growth would obviously be driven through synergies that we believe we could create.\n\nAnd we also believe that as we look at these brands, we'll be able to identify very significant opportunities for top-line growth because of our expertise in brand management. So, those are the two most important criteria. Full stop. The second piece to your question, we have formed an intellectual property of JV for the Express brand, and Yehuda and I are aligned that we will form intellectual property joint ventures for future brands.\n\nAnd yes, any brands that we would be operating just like Express under a license agreement with the IP JV.\n\nEric Beder -- SCC Research -- Analyst\n\nGot it. So, there'll be potentially more of these joint ventures in the structure going forward for specific acquisition? [Inaudible]\n\nTim Baxter -- Chief Executive Officer\n\nYes. Those terms would clearly be different for each and every acquisition.\n\nEric Beder -- SCC Research -- Analyst\n\nOK. Thank you. All right. Good luck with the holiday season.\n\nTim Baxter -- Chief Executive Officer\n\nGreat. Thank you very much, Eric.\n\nOperator\n\nThe next question is from Jay Sole with UBS. Your line is open.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you so much. Tim, I know you touched on this a little bit, but just want to understand a little bit the trends that you've seen here in December because lapping omicron from last year, maybe weather compares a little bit easier, and there's some inventory challenges across the mall last year related to supply chain. Is what you're seeing now sort of just a change versus your expectation? Are you actually seeing the consumer get a little bit weaker? And where is it going? I think somebody asked a question about next year, just how are you thinking about the trends that you're seeing now from the consumer next year? And maybe connect that to how you're, sort of buying inventory at this point for what you're thinking about next year.\n\nTim Baxter -- Chief Executive Officer\n\nAbsolutely, Jay. So, the outlook that we provided for 2022 clearly indicates that we're seeing the same behavior in the fourth quarter from the consumers that we saw in the third quarter. And so that is slightly different than our expectation. Coming into the fall season, our previous outlook, we did expect to see improvement in the fourth quarter based on omicron and the impact of that last year and all sorts of other factors.\n\nBut the macroeconomic environment and the consumer sentiment that I described earlier, spending less on discretionary categories like apparel, and looking for deep-deep discounts, that still seems to be in play in the quarter. And I would say the discount side of that is even more in play in the fourth quarter as it is typically a more promotional quarter anyway. Thinking going forward, we have not shared an outlook for 2023, yet we will do that when we share our fourth quarter results, but we are approaching 2023 with conservatism, particularly in how we're buying merchandise. And we have a great go-to-market process that as the supply chain challenges and bottlenecks have sort of evened out, we're going to be able to get back into chase mode, which is something that works very, very well for us.\n\nSo, we are testing things right now in the southern part of the country that will influence product we chase into for the first quarter and the second quarter. So, we're going to approach it with conservativism, and we have the mechanisms and the ability to chase into trends as we see consumer behavior rebounding.\n\nJay Sole -- UBS -- Analyst\n\nGot it. And so, maybe just a follow-up on that. I mean, is your chase ability comparable today to what it was pre-pandemic? I mean, can you just talk about how much lead times have shrunk from like, sort of like the worst of the supply chain issues like the last couple of years versus where they are right now?\n\nTim Baxter -- Chief Executive Officer\n\nI'm going to let Matt Moellering, our COO, take that one, Jay.\n\nMatt Moellering -- Chief Operating Officer\n\nYeah, Jay. So, what I would say is they are getting better. They're not to pre-pandemic levels yet, but they're getting closer. There is a lot of capacity available out in the -- out of the factories right now, which helps out a lot.\n\nWe're still -- and the logistics is getting better, supply chain, timing is getting better. But it's not back to pre-pandemic levels. So, we're still being a little cautious about that to make sure we get the product in on time, but everything is definitely improving. And as it's improving, we are increasing our ability to chase into product, which is obviously really important for a fashion business.\n\nJay Sole -- UBS -- Analyst\n\nAnd, Matt, do you have visibility into when it really gets better? Is it sort of depending on China and lockdowns ending? And what does getting back to really pre-pandemic levels of lead times really depend on?\n\nMatt Moellering -- Chief Operating Officer\n\nI think once we get into the first half of next year, we're going to be in much better shape. We've already started to shorten our lead times based on certain quirks getting better. As it relates to China for us, specifically, we had low double-digit exposure to China this past year. We're down to single-digit exposure in product next year.\n\nSo, we feel good about our positioning, and China will have limited impact on us specifically. There obviously could be a knock-on effect as people move out of China into other geographies, if necessary. But we feel good about where we're positioned right now.\n\nJay Sole -- UBS -- Analyst\n\nOK. And then maybe one last one for me. Just on the promotions that you're seeing and the consumer looking for value, last year was sort of an exceptional year for a full price selling across the mall and this year feels like more of a normalization, return to normal clearance levels, normal types of activities, not necessarily as deep promotionally as it was in 2019 and 2018. What is your sense of where the mall is at, I mean, in terms of what the promotions have gone back to? Is it more like just kind of a reversal of last year? Or are we really seeing like a deepening of promotions getting back to 2019 with maybe potential for more potentially if the economy is weaker next year?\n\nTim Baxter -- Chief Executive Officer\n\nI think that throughout the year, we've seen significantly increased inventory levels in many of our mall-based competitors that were different than our increased inventory level, to be honest. We've talked for the past year about how we aggressively actually front-loaded receipts in the year in all of our core categories that don't age, so that -- to mitigate all the supply chain challenges and be sure that we had inventory in those categories. And so, we're seeing now that step down related to that. So, we didn't need to pull the trigger on aggressive promotions in order to drive that inventory down.\n\nIt was very strategic. In many of our other mall-based competitors, I think we saw much more aggressive promotion certainly than in 2021. But even, I would say, as high, in many cases, as pre-pandemic levels in 2019 because there were such cost of inventory throughout -- based on all the challenges from the pandemic, all the supply chain challenges, all the reasons that there were so many inventory glut. I do think that as we move into 2023, across the industry, we're seeing much better inventory management, much more normalized levels of inventory.\n\nAnd I believe that's going to allow for less promotion actually as we move into 2023 because there won't be a necessity or promotion to actually liquidate inventory. The promotion will actually be more offensive again versus defensive. So, I actually believe that as we move into 2023, we're going to begin to see less promotion again, a more normalized level of promotion versus the heightened level we've been seeing.\n\nJay Sole -- UBS -- Analyst\n\nGot it. OK. Thank you so much. Very helpful.\n\nTim Baxter -- Chief Executive Officer\n\nGreat. Thanks, Jay.\n\nOperator\n\nAnd the next question is from Will Gardner with Wells Fargo. Your line is open.\n\nUnknown speaker -- Wells Fargo Securities -- Analyst\n\nHey, guys. Thanks for taking my question. Just on the -- I know you've kind of -- not to beat a dead horse, and I know you touched on this, but maybe looking at same-store sales on a three-year basis, it looks like they're decelerated pretty substantially. Can you just discuss in more detail the cadence of the quarter and then perhaps what you're seeing quarter to date from a comps perspective?\n\nTim Baxter -- Chief Executive Officer\n\nSure. As I said, the challenges that we faced in the third quarter became more acute as the quarter progressed. So, started off much more in line with our outlook and obviously ended where it ended, which drove the miss to the outlook that we had provided, which came primarily in the back half of the quarter. In the back half of the quarter is where we really began to see very aggressive promotions from many of our competitors.\n\nWe were still staying very true to our commitment to being a less sitewide and storewide promotional store. We did end up at the end of the quarter pushing some sitewide and storewide promotion that was not anticipated in our outlook, which also drove our bottom-line outlook miss as we reacted to the competitive environment. I think that -- and as I said, as we've moved into the fourth quarter, the outlook that we've provided for the year, we are seeing that same consumer behavior, less spending on discretionary categories like apparel and much, much, much increased appetite for deep discounts. So, where we are promoting, we are doing it strategically.\n\nAnd that's when we get competitive and when we see the improved results. So, we are -- as we move into -- as we finish out the fourth quarter of this year certainly, and as we move into 2023, we will continue to be very strategic in our promotions. But in this environment, we've learned that we absolutely have to be competitive with what's happening around us. The customer is choosing, absolutely choosing based on really not just value, which is what had been driving our increases, but on promotion specifically.\n\nSo, that's sort of the state of the union. As we've gone -- if you look back at the five consecutive quarters where we actually drove growth versus 2019, it was driven actually through significantly higher average unit retails, which was both -- and that was driven by significantly improved product, mix of our assortment, and less promotion. So, the strategy that had been working for us for so long just truly became in direct conflict with what consumer behavior and consumer sentiment was. So, as I said, we're making those adjustments.\n\nWe're recalibrating our assortments. We're reintroducing opening price points. We'll continue to be very strategic in how we promote. And so, expect to see improvement as we move into the first quarter of next year.\n\nUnknown speaker -- Wells Fargo Securities -- Analyst\n\nGot it. And maybe one more for me. As far as your customers go, where are you seeing -- are you seeing different spending patterns between income levels, gender in different channels? Can you maybe just touch on those dynamics?\n\nTim Baxter -- Chief Executive Officer\n\nWe're certainly seeing differences by gender. Our men's business, as I said, just posted its sixth consecutive quarter of positive comps. So, our men's business remains very strong. We continue to gain a market share very aggressively in our men's business.\n\nSo, we're certainly seeing a very disparate performance by gender. In terms of price point, we don't have all that data from the quarter yet. So, I don't want to share any of that other than to say, it certainly appears as though our lower-income consumer is the most challenged. About a third of our consumer base makes over $100,000 a year, two-thirds make less.\n\nSo, it does -- it would appear, based on everything that's happening around us, that that consumer base is much more significantly challenged.\n\nUnknown speaker -- Wells Fargo Securities -- Analyst\n\nGreat. I'll pass it on. Thank you.\n\nOperator\n\n[Operator instructions] And it appears there are no further questions at this time. Mr. Baxter, I'll turn the call over to you for any closing remarks.\n\nTim Baxter -- Chief Executive Officer\n\nThank you, everyone, for joining us this morning as we begin this bold new chapter for our companies.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGreg Johnson -- Vice President, Investor Relations\n\nTim Baxter -- Chief Executive Officer\n\nYehuda Shmidman -- Chief Executive Officer and Founder, WHP Global\n\nMarni Shapiro -- Retail Tracker -- Analyst\n\nEric Beder -- SCC Research -- Analyst\n\nJason Judd -- President and Chief Operating Officer\n\nJay Sole -- UBS -- Analyst\n\nMatt Moellering -- Chief Operating Officer\n\nUnknown speaker -- Wells Fargo Securities -- Analyst\n\nMore EXPR analysis\n\nAll earnings call transcripts"
}