{
  "companyName": "FuelCell Energy",
  "companyTicker": "FCEL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/fuelcell-energy-fcel-q3-2022-earnings-call-transcr/",
  "content": "FuelCell Energy (FCEL 0.72%)\nQ3 2022 Earnings Call\nSep 08, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day. My name is Chantel, and I'll be your conference operator today. At this time, I would like to welcome everyone to the FuelCell Energy's third quarter earnings call. As a reminder, today's conference call is being recorded.\n\n[Operator instructions] Thank you. Tom Gelston, senior vice president of finance and investor relations, you may begin your conference.\n\nTom Gelston -- Senior Vice President, Investor Relations\n\nThank you. Good morning, everyone, and thank you for joining us on the call today. As a reminder, this call is being recorded. This morning, FuelCell Energy released our financial results for the third quarter of fiscal year 2022 and our earnings press release and our quarterly report on Form 10-Q are available in the Investors section on our website at www.fuelcellenergy.com.\n\nConsistent with our practice, in addition to this call and our earnings press release, we have posted a slide presentation on our website. This webcast is being recorded and will be available for replay on our website approximately two hours after we conclude the call. Before we begin, please note that some of the information that you will hear or will be provided with today will consist of forward-looking statements within the meaning of the Securities Exchange Act of 1934. Such statements express our expectations, beliefs and intentions regarding the future and include, without limitation, statements with respect to our anticipated financial results, our plans and expectations regarding the continuing development, commercialization and financing of our fuel cell technology and our business plans and strategies.\n\nOur actual future results could differ materially from those described in or implied by such forward-looking statements because of a number of risks and uncertainties. More information regarding such risks and uncertainties is available in the safe harbor statement in the slide presentation and in our filings with the Securities and Exchange Commission, particularly the Risk Factors section of our most recently filed annual report on Form 10-K and any subsequently filed quarterly reports on Form 10-Q. During the course of this call, we will be discussing certain non-GAAP financial measures, and we refer you to our website and to our earnings press release and the appendix to the slide presentation for the reconciliation of those measures to GAAP financial measures. Our earnings press release and a copy of today's webcast presentation are available on our website at www.fuelcellenergy.com under the Investors tab.\n\nFor our call today, I am joined by Jason Few, FuelCell Energy's president and chief executive officer; and Mike Bishop, our executive vice president and chief financial officer. Following our prepared remarks, we will be available to take your questions and be joined by other members of the leadership team. I would now like to hand the call over to Jason for opening remarks. Jason?\n\nJason Few -- President and Chief Executive Officer\n\nThank you, Tom, and good morning, everyone. Thanks for joining us on our call today. In the third quarter, we achieved our strongest quarterly revenue in five years, reflecting product sales and continued progress executing on the themes we presented during our investor day held earlier this year. Before getting into the business results, for anyone who might be new to the story, let's look at an overview of FuelCell Energy on Slide 3.\n\nWe are a leader in manufacturing stationary FuelCell Energy platforms, and our focus is leveraging our proprietary technologies to decarbonize power and produce hydrogen. We operate across three continents, and we are focused on entering more markets around the world. Our manufacturing locations are currently located in the U.S., Canada and Germany, which we believe enables us to meet local content requirements, create an efficient distribution network and leverage our centers of expertise. We have 95 platform installations in commercial operation, which we believe demonstrates the commercial feasibility of our energy platforms.\n\nIn fiscal year 2021, our revenue of nearly $70 million came from these three revenue categories, service and license, advanced technologies, and generation, all of which represent diversified sources of recurring revenue under multiyear contracts. In fiscal year 2021 and 2020, we had no revenue from product sales. However, product sales returned to our revenue mix with orders for 20 modules from Korea FuelCell in fiscal year 2022. We have delivered via X works 12 of those replacement modules to service Korea FuelCell's existing installations in South Korea.\n\nWe have made it a priority to focus on generating new product sales in South Korea,, in addition to other Asian markets, select countries in Europe, the Middle East, Africa, and North America. On Slide 4, you will see our purpose statement. Across our company, we are committed to a shared purpose of enabling a world empowered by clean energy. Looking to the future, every industry will be meaningfully impacted by the transition to net zero, and we believe our technology is well-positioned to be part of the solution.\n\nThere is an ever-increasing need for reliable power and now the demand has shifted toward energy that has created in an environmentally responsible manner. We believe FuelCell Energy is uniquely positioned to assist customers on a safe, secure and practical path to carbon zero. We propose to do this by decarbonizing power, producing hydrogen, and using hydrogen as a clean energy fuel and as an energy storage medium. We believe we have the only technology that can capture CO2 while producing power and hydrogen, produce hydrogen, power, and water from a single platform and produce hydrogen in multiple ways.\n\nFor example, utilizing electricity and water via electrolysis, or biogas using our TriGen platform. Importantly, FuelCell Energy's technology provides local solutions for clean energy that reduce Scope 1 and 2 emissions and delivers real-time benefits to the communities where our platforms operate. We do this in a manner which supports high standards of living and economic growth. while protecting the environment, minimizing land use when compared to wind and solar projects, avoiding costly transmission buildouts and adapting to new resource challenges.\n\nThis purpose drives our strategic focus and our passion for our work. Next, I would like to turn the discussion to the results and business developments during the quarter summarized on Slide 5. We continue to make progress advancing our strategic agenda, executing against our backlog, recognizing product revenue, and working toward commercialization of new technologies. We delivered six modules via X works to Korea FuelCell during the third quarter, and we have completed manufacturing the remaining eight modules from the initial aggregate 20 module order placed by Korea FuelCell this fiscal year and expect to deliver those modules via X Works and recognize the resulting revenue in the fourth quarter of fiscal year 2022.\n\nWe also delivered six modules in the first quarter of fiscal year 2022. We continue to invest in scaling our commercial organization in Korea in support of building a pipeline of opportunities in the Korean and broader Asian markets. Another key accomplishment for the quarter was beginning the initial conditioning phase of certain portions of the 2.3-megawatt tri-generation platform as civil construction work has significantly advanced for Toyota at the Port of Long Beach. This project is an example of FuelCell Energy's ability to deliver distributed green hydrogen today.\n\nWe continue to anticipate that the remaining construction and commissioning activity will be completed in late calendar year 2022 or early calendar year 2023. When the project achieves commercial operations, this energy platform will deliver carbon-neutral electricity, green hydrogen, and water, which is a significant benefit within the Western region of the United States that is experiencing extreme droughts. During the third quarter, we continued to invest in our internal R&D activities as we focus on commercialization of our patented solid oxide platform. And across our operations, we are making progress in optimizing capacity for our carbonate platform with the goal of achieving 100 megawatts of annualized integrated on-site manufacturing and conditioning capacity.\n\nWe provided an update on our progress on the U.S. Navy project located in Groton, Connecticut in our release and quarterly report on Form 10-Q filed this morning. Our plan is to achieve commercial operations by September 30, although at a reduced output of approximately 6 megawatts or 80% of the nameplate capacity for the first year of operation. In our disclosure, we outlined that during the restart of commissioning, we encounter performance anomalies at the plant, primarily in the mixer inductor Oxidizer or MEO.\n\nThe MEO is a sophisticated specialized component specific to the Groton project designed to optimize fuel and air flow to deliver higher electrical efficiency. As a result of our observation and commitment to quality, we are considering operating this platform at a reduced output of 3 megawatts per system for a total of approximately 6 megawatts at the start of commercial operations. Our engineering team believes this will allow us to optimize performance of each of the two MEO units and over a period of approximately one-year implement upgrades to each of the two MEO units in order to bring the platform to its rated capacity of 7.4 megawatts. Under a prior extension provided by the U.S.\n\nNavy, the deadline for achieving commercial operations is September 30, 2022. Therefore, we have approached both the U.S. Navy and the Connecticut Municipal Electric Energy Cooperative, or CMEEC, to discuss our findings and proposal to start commercial operations by September 30th at the reduced output of approximately 6 megawatts. While discussions are advancing commencement of operations at approximately 6 megawatts requires approval for both the U.S.\n\nNavy and CMEEC, and we cannot guarantee that they will provide their approval. Of course, we will provide updates as appropriate on our progress with this project. Like you, we are disappointed by the current challenge. We remain steadfast in our commitment to delivering quality platforms to our customers.\n\nWe believe the plan we have proposed to achieve commercial operations at approximately 6 megawatts by September 30th is the right path forward and provides benefits to all stakeholders in the project. As a team, we are working tirelessly to achieve resolution. We continue to expect this project to highlight the ability of FuelCell Energy's platforms to perform at high efficiencies while advancing the U.S. Navy's sustainability objectives and contributing to a reduction in Scope 2 emissions.\n\nIncorporation of the platform into a microgrid is expected to demonstrate the capacity of Poso Energy's platforms to increase grid stability and resiliency while supporting the U.S. military's efforts to fortify base energy supply. Next, we are continuing to progress toward commercialization of our advanced technologies. In the first quarter of fiscal year 2022, we achieved a technical milestone on our joint development agreement with ExxonMobil Technology and Engineering company or EMTEC, and at the end of the second quarter fiscal year 2022, we extended the term of the joint development agreement, enabling our companies to continue working to advance fuel cell carbon capture and storage technology.\n\nUnder the joint development agreement, we are also conducting a joint market study with EMTEC to define application opportunities and commercialization strategies and identify partners for a potential pilot or demonstration projects as we pursue carbon capture across a broad landscape of industrial applications. My third key message is that we are continuing to build our scale and growth path internationally. We are scaling our commercial organization in Korea in support of building a pipeline of opportunities in Korea and the broader Asian market, where we believe that FuelCell Energy's differentiated technology is a desirable choice for utility-scale projects. The South Korean government has announced an aggressive hydrogen economy road map, which we believe should create opportunities in this market.\n\nIn addition, Japan has also announced goals to expand hydrogen usage. In June, we announced a memorandum of understanding with Tanar Limited, an independent renewable energy, and green hydrogen developer focused on delivering low-carbon electricity and hydrogen to North Africa and Europe. We look forward to bringing our unique distributed generation and distributed hydrogen platforms to markets around the world as the hydrogen transitioning continues to develop. And to focus on domestic policy, we are very supportive of the recently enacted Inflation Reduction Act.\n\nWe expect that the various policy mechanisms within the Inflation Reduction Act will provide businesses with the long-term market and tax certainty needed to make important investment decisions, including in hiring, manufacturing, and partnerships. With this legislation, users and producers of fuel cell technology will be able to take advantage of investment tax credits, production tax credits for clean power and hydrogen, and carbon capture utilization and sequestration credits, which we have summarized on Slide 6. Together, we believe these are important incentives for building and deploying more clean energy assets across the country, ensuring the United States leverages its rich natural resources, and decarbonizing our most challenging sectors without the industrialization. The investments FuelCell Energy is making in our business are well aligned with these policy goals.\n\nNext, on Slide 7, we highlight our capabilities that are available today, as well as the technology solutions we are driving toward commercialization. We believe that our portfolio creates optionality for fuel cell energy as the energy transition evolves. Our distributed power platforms are versatile and can be located in brownfield locations in dense urban areas. This local deployment is made possible by the low noise profile and low emissions of our platforms, which makes them good neighbors and easy to site.\n\nThey can operate on a variety of fuels, including pipeline natural gas, renewable natural gas, on-site biogas, hydrogen blends, or a variety of other fuels. Once commercialized, our solid oxide platform will be capable of operating on 100% hydrogen. Shown here is our Bridgeport Fuel Cell Park in Bridgeport, Connecticut, which we believe demonstrates the ability of such an installation to play a part in revitalizing an urban community. We also have built several utility microgrid applications, including a microgrid fuel cell at the University of California, San Diego shown here.\n\nThese distributor platforms are located near the point of use and provide power to critical resources in the event of a utility grid outage helping to ensure that power remains available for central services. A great example of our distributed hydrogen solution is the facility we are building for Toyota in Long Beach, California, which I previously discussed. This platform is expected to illustrate the ability to deploy a green hydrogen solution at the point of consumption, reducing infrastructure requirements. I also want to highlight our carbon capture and carbon separation technology, which is being deployed at the Scotford Upgrader of Canadian Oil Sands bitumen processor.\n\nEach of these solutions is manufactured in the U.S. with more than 80% of all materials coming from the U.S. in a factory providing clean employment opportunities in a distressed municipality list on the Connecticut Public investment community list. And now I will turn the call over to Mike to discuss the financial results for the third quarter in more detail.\n\nMike?\n\nMike Bishop -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nThank you, Jason, and good morning to everyone on the call today. You've heard from Jason about the key developments during our third fiscal quarter of 2022, and now I will provide some details regarding our financial results. For the third quarter of fiscal year 2022, we reported total revenues of $43.1 million, compared to $26.8 million in the third quarter of fiscal year 2021, which is an increase of 61%. Looking at revenue drivers by category, product revenues were $18 million compared to no product revenues in the comparable prior-year period.\n\nThe increase in product revenues was a result of module sales to Korea Fuel Cell Company, or KFC, for which the company recognized $18 million on the X Works delivery of six fuel cell modules from our facility in Torrington, Connecticut in June of 2022. Service agreement revenues decreased 37% to $9 million from $14.3 million. The decrease is primarily due to fewer module exchanges and fewer non-routine maintenance activities during the third quarter of fiscal year 2022 than during the third quarter of fiscal year 2021. Generation revenues increased 75% to $10.9 million from $6.2 million, primarily due to the completion of the Long Island Power Authority or LIPA Japan project during the three months ended January 31, 2022, and the higher operating output of the generation fleet portfolio as a result of module exchanges during the last nine months of fiscal year 2021.\n\nGeneration revenues for the third quarter of fiscal year 2022 also include revenues from sales of renewable energy credits, which resulted in an increase of generation revenues by approximately $1.7 million. Advanced technology contract revenues decreased 17% to $5.2 million from $6.2 million. Compared to the third quarter of fiscal year 2021, advanced technology contract revenues recognized under our joint development agreement with ExxonMobil Technology and Engineering Company, or EMTEC, were approximately $3.1 million lower during the third quarter of fiscal year 2022, partially offset by an increase in revenue recognized under government contracts and other contracts of $2 million for the third quarter of fiscal year 2022. Gross loss for the third quarter of fiscal year 2022 totaled $4.2 million, compared to a gross profit of $1.1 million in the comparable prior-year quarter.\n\nThe increase in gross loss was driven by higher manufacturing variances, $6.9 million of costs that cannot be capitalized related to the construction of the Toyota project and lower advanced technology contract margin. These were partially offset by reduced generation gross loss, excluding the impact of non-capitalizable costs related to the construction of the Toyota project and higher service gross profit. Operating expenses for the third quarter of fiscal year 2022 increased to $23.8 million from $11.7 million in the third quarter of fiscal year 2021. Administrative and selling expenses increased to $14.2 million from $8.7 million due to higher sales, marketing and consulting costs as we continue to invest in rebranding and accelerating our sales and commercialization efforts, including increasing the size of our sales and marketing teams, which resulted in an increase in compensation expense from additional headcount.\n\nResearch and development expenses totaled $9.7 million during the quarter, up from $3 million in the third quarter of fiscal year 2021 and reflect increased spending on the company's ongoing commercial development efforts related to our solid oxide platform and carbon capture solutions compared to the comparable prior-year period. Net loss was $29 million for the third quarter of fiscal year 2022, compared to a net loss of $12 million in the third quarter of fiscal year 2021, driven primarily by a gross loss compared to a gross profit in the third quarter of fiscal year 2021 and higher operating expenses. Additionally, the provision for income tax was higher in the third quarter of fiscal year 2022 compared to the third quarter of fiscal year 2021. Adjusted EBITDA totaled negative $20.8 million in the third quarter of fiscal year 2022, compared to adjusted EBITDA of negative $5.2 million in the third quarter of fiscal year 2021.\n\nPlease see the discussion of non-GAAP financial measures, including adjusted EBITDA in the appendix of our earnings release. The net loss per share attributable to common stockholders in the third quarter of fiscal year 2022 was $0.08, compared to $0.04 in the third quarter of fiscal year 2021. The higher net loss per common share is primarily due to the higher net loss attributable to common stockholders, partially offset by the higher number of weighted average shares outstanding due to share issuances since July 31, 2021. Next, please turn to Slide 10 for additional details on our financial performance and backlog.\n\nThe chart on the left-hand side of the slide graphically shows some of the numbers we just reviewed for the third quarters of fiscal years 2021 and 2022. Looking at the right-hand side of the slide, we finished the quarter with backlog that was down just slightly year over year to $1.284 billion. Drivers were the reduction in service agreements and advanced technology contract backlog, which was offset by the addition of product sales backlog from the module order received from KFC. Drilling down further, advanced technology contract backlog primarily represents remaining revenue under our joint development agreement with EMTEC and government projects.\n\nNote that in the first quarter of fiscal year 2022, approximately $22.2 million of backlog, which was previously classified as service and license was reclassified to product as a result of the settlement agreement with POSCO Energy and KFC, and represents the value of the performance guarantee associated with KFC's module order. Please turn to Slide 11. This slide represents an update on our liquidity and the ongoing investment in project assets. As of July 31, 2022, we had total cash, restricted cash and cash equivalents of approximately $479.6 million.\n\nThis includes approximately $456.5 million of unrestricted cash and cash equivalents represented by the darker blue bar on the chart in the center of the slide, and $23.2 million of restricted cash and cash equivalents represented by the lighter blue bar. On July 12, 2022, we commenced an at-the-market offering program under which the company may from time to time, offer and sell up to 95 million shares of the company's common stock. During the quarter, we sold approximately 18.5 million shares under the program at an average sale price of $3.63 per share. Of the 18.5 million shares sold, approximately 7.8 million shares were issued and settled during the period ended July 31st, 2022, resulting in net proceeds to the company of approximately $27.2 million after deducting fees and commissions.\n\nThe balance of approximately 10.7 million shares were settled subsequent to July 31, 2022, resulting in net proceeds to the company of approximately $38.4 million after deducting commissions. Looking at the right-hand side of the slide, there is a chart illustrating our total project assets, which make up our company-owned generation portfolio. We intend to continue to develop, construct and grow our portfolio of project assets. Investments to date reflect capital spent on completed operating projects, as well as capital spent on projects currently in development and under construction.\n\nAt the end of the third quarter of fiscal year 2022, our gross project assets totaled approximately $274 million, which excludes accumulated depreciation. As detailed on Slide 20 in the appendix of this presentation, our generation portfolio totaled 76.3 megawatts of assets as of July 31, 2022. This includes 41.4 megawatts of operating assets and 34.9 megawatts of projects in process. As projects in process begin commercial operation, they are expected to contribute higher generation revenue.\n\nAdditionally, as these projects in process reach mechanical completion or achieve commercial operation, we expect to seek additional tax equity financing, as well as long-term back leverage debt transactions, to further reinvest capital back into the business. Finally, turning to Slide 12. We discuss the target areas of investment that we originally shared during our investor day in March and in our public filings. We are targeting investments in three primary areas: capital expenditures, research and development and continued build-out of our generation portfolio.\n\nCapital expenditures are in the areas of increased capacity expansion, additional test and laboratory facilities and upgrades and expansion of our business systems. We are decreasing our estimated full year capex to a range of $20 million to $30 million, owing to the timing of certain investments that we now expect to be made in fiscal year 2023 versus fiscal year 2022. Looking at research and development, our R&D efforts are focused on the commercialization of our hydrogen technologies, including long-duration energy storage. We estimate that full year 2022 R&D expenses will be in the range of $30 million to $40 million.\n\nWe are committed to continuing the build-out of our generation portfolio. As projects begin operation under long-term power purchase agreements, we expect to see growth in recurring revenues. As of July 31, 2022, we had 34.9 megawatts of projects under development and construction. To build out this portfolio, as of July 31, 2022, we estimate the remaining investment in project assets to be in the range of approximately $90 million to $100 million.\n\nFor fiscal year 2022, we forecast project expenditures to be in the range of $40 million to $60 million, which includes amounts being expensed to the Toyota project that totaled $14 million for the nine months ended July 31, 2022. We expect these investments to result in revenue growth for the company. As discussed in our investor day, we have established targets for revenue in excess of $300 million by the end of fiscal year 2025, and in excess of $1 billion by the end of fiscal year 2030. In closing, we are pleased with the continued progress being made.\n\nAs Jason mentioned, we believe that the passage of the Inflation Reduction Act provides a constructive tailwind for our sector and company alike and is another validation point for the investments that FuelCell Energy is making in commercializing our solid oxide and carbon capture technologies. These investments for the future, combined with our significant backlog, the recurring revenue from our generation fleet, and our continued sales focus, keep us well-positioned for long-term success. I will now turn the call back to Jason.\n\nJason Few -- President and Chief Executive Officer\n\nThanks, Mike. On Slide 14, as a summary of our Powerhouse business strategy, which serves as our guiding strategy toward achieving long-term growth, the first tenet is grow. We want to pursue growth in markets and customer segments where we see significant opportunities for our technology. The second is scale.\n\nWe plan to scale our existing platform by investing in, extending, and deepening our leadership and total human capital across the organization. And third, innovate. Over our 50-year history, we have never stopped innovating. We believe this will enable our participation in the growth of the hydrogen economy and carbon capture and drive us to deliver on our purpose.\n\nThe Powerhouse business strategy has evolved over the past couple of years to now focus on growth. With the current energy transition happening at an accelerated pace, we believe our technologies have an important role to play in helping society achieve our global sustainability goals. We are moving forward with investments in capacity, capability and global talent, which we believe will enhance our ability to capture more of the market opportunity over the coming years and deliver enhanced shareholder returns over the long run. Earlier this year, we published our first sustainability report, which was an important milestone for FuelCell Energy.\n\nI want to reaffirm and reiterate that our dedication to achieving net-zero remains in the forefront of priorities. We are committed to achieving net-zero in Scope 1 and Scope 2 emissions by 2030 and Scope 3 emissions by 2050. We are aligned with the leading standards organizations and the UN climate action goals that we believe we can impact. Beyond our environmental commitments, we are equally focused on our employees, the people in the communities in which we work and live, and being a diverse, equitable and inclusive organization.\n\nIn support of our journey, we took an important step by recently naming Betsy Schaefer as FuelCell Energy's sustainability officer reporting directly to me. We are thrilled to have Betsy apply her considerable talents to leading our sustainability efforts and believe integrating this critical effort will further solidify our commitment to achieving net zero. I will conclude my prepared remarks with some takeaways on Slide 16. The company has executed several strategic actions over the past few years that have strengthened our balance sheet, enhanced liquidity and reduced our cost of borrowing, which we believe positions us to execute on our growth strategy.\n\nWe have multiple sources of funding, including well-established relationships with financing providers. We have further expanded sources of liquidity through tax equity transactions that provide flexibility to scale our operations by allowing capital to be recycled as projects reach completion. We have $1.28 billion of backlog with recurring revenues from long-term contracts. Our financial foundation will enable us to grow, scale and innovate while we also explore strategic opportunities for partnerships.\n\nWe will be thoughtful about allocating capital to fund the next phase of growth aligned with the addressable market opportunity. Globally, policies to support the energy transition are gaining momentum as evidenced by passage of the Inflation Reduction Act in the United States. I will now turn it over to the operator to begin Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from Colin Rusch with Oppenheimer. Your line is open.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThank you so much, guys. Can you talk a little bit about the incremental production capacity that you're talking about? How much of that is being driven by improved efficiency at the stack level and how much of that is just really just more units coming through the factory?\n\nJason Few -- President and Chief Executive Officer\n\nColin, good morning. Thank you for the question. I'll turn that over to Mike Lisowski and let him give you an update on what we're doing to actually get to the increased capacity out of our factory.\n\nMike Lisowski -- Executive Vice President and Chief Operating Officer\n\nGood morning, Colin, and thank you for the question. Yes, so we're taking a series of strategic actions to fully integrate our carbonate manufacturing capabilities, both from a capacity and current technology and future technology generation standpoint. There's a number of actions that we're taking to optimize our operations, including the integration of our additional conditioning facilities, which will give us that 100 megawatts of on-site capacity. We also have plans and capabilities to double that on-site capacity in the future to support future growth demand.\n\nWe are also making improvements across our platform in a number of ways in the cell technology development, of course, to support longer life and extended output power levels.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nAll right. That's super helpful. And then just thinking about the balance of plant outside the stacks and all the labor around that, can you talk about the efforts that you're making around supply chain optimization and efficiency around labor? Certainly, those are big concerns for a lot of investors.\n\nMike Lisowski -- Executive Vice President and Chief Operating Officer\n\nYes, Colin. Thanks for the follow-up question. So, we have a long-standing foundational relationship with our supply chain. Like every company, we have experienced challenges across cost pressures, as well as extended lead times.\n\nAnd we have taken a number of actions some time ago to strengthen our supply chain. We have leveraged existing project execution work to qualify additional sources of supply to increase our capacity, specifically around balance of plant suppliers and other key engineered component suppliers. So we are actively working that and expanding our manufacturing footprint to be able to support our global growth demand. So there is a number of initiatives that we have underway, both domestically and abroad to increase that capacity to stay ahead of our demand curve to ensure that we can fulfill and meet unique customer requirements.\n\nJason Few -- President and Chief Executive Officer\n\nAnd Colin, this is Jason. I would just add one additional thing to that, Colin, that is important, I think, for us from a supply chain perspective, that we have eliminated a lot of those supply chain issues as a result of more than 80% of our materials in our platforms are sourced within the United States. So that significantly helps when you look at shipping lanes and other things that are causing significant challenges in supply chain, which we get to avoid a lot of those.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nPerfect. Thanks, guys.\n\nOperator\n\nOur next question comes from Chris Souther with B. Riley. Your line is open.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nHey, guys. Thanks for taking my question here. On the challenges that we are seeing with the Groton project related to the MEOs, can you provide a bit more color on why this is a unique project-specific challenge? Just wanted to get a better sense of why this is not something we should be concerned about with some of the other pipeline projects? And can you give more of a sense how there is confidence that this is like a one-year fix to get up to the full 7.4 megawatts?\n\nJason Few -- President and Chief Executive Officer\n\nYes. Chris, thank you for the question, and thank you for joining the call this morning. We tried to provide a real detailed update in the 10-Q. Our plan is to run the plant at 6 megawatts.\n\nThe thing that makes this different from our other projects is that the MEO in this configuration is unique to this particular plant. And the same configuration is not present on our other installed plants around, whether it's the U.S. or internationally. And so the issues are unique to this plant.\n\nOur engineering team feels very confident over the next year that we'll be able to work through the issues they have. They are well understood, and they know how we are going to drive those improvements. But that same issue is not present on our other platforms.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nOK. And then, maybe on the product sales for new customers, any update on the progress there? I am curious what we are seeing outside of some of the existing customer base in Korea for replacements. I am curious if you're seeing any impacts on the energy crisis in Europe on sales efforts with challenges in natural gas supplies. Maybe just talk about the scope of some of the MOUs out there in Korea and North Africa would be helpful for folks.\n\nJason Few -- President and Chief Executive Officer\n\nYes. We are seeing a lot of momentum in growing the pipeline that we have. As we announced a little while ago, we brought in a new Chief Commercial Officer for the company, and we're seeing a lot of strong momentum there. We are seeing a significant push, whether you're looking at Korea, as you mentioned, or other Asian markets or in Europe to have momentum toward hydrogen and trying to get faster to a hydrogen economy.\n\nWe're seeing that as a pretty significant driver as one way to maybe deal with the pressure that's being seen with rising natural gas prices and particularly in the EU. With respect to the markets overall, we are seeing strong demand for grid retention reliability. In addition to some of the things that we're doing with our platform around carbon separation we are seeing strong interest in carbon capture. And we think that is going to increase, and particularly here in the U.S.\n\nwith the passage of the IRA, given the improved economics around 45-Q. So across the board, we feel good about the pipeline that we're building and the commercial opportunities that we have, whether it be in the U.S. or EU, as well as the Middle East and Africa. With respect to the MOUs, those are all around the hydrogen economy and taken advantage of.\n\nIf you look at Tunisia and Northern Africa, you've got really strong coverage with the sun. It makes it a great market to produce green hydrogen using solar, and its proximity to Europe with some of the pipeline infrastructure that already exists there and the ability to move hydrogen via pipe into Europe as a very strong source of supply. So, we feel really good about those opportunities to participate in that. Given the high efficiency that we anticipate having with our solid oxide platform, we think our platform is very well-positioned to be a meaningful contributor to hydrogen production in that part of the world.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nGot it. No, that's really helpful. I appreciate the color there. I'll hop in the queue here.\n\nThanks, guys.\n\nOperator\n\n[Operator instructions] Our next question comes from Eric Stine with Craig-Hallum. Your line is open.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nGood morning, everyone. So, I just want to stick on the product side. I noticed in the presentation, you mentioned an MOU with KEPCO and I know that you have done a project with one of their operating subsidiaries many years ago. But to me, that seems new, unless I missed that announcement.\n\nSo maybe just talk about the opportunity there, obviously, on the utility side, especially South Korea as a great market. KAPCO's got a number of operating subsidiaries. And so just maybe dig down a little deeper into South Korea in that specific MOU.\n\nJason Few -- President and Chief Executive Officer\n\nYes. So as you mentioned, we have an existing platform in Korea that is a FuelCell Energy platform with KOSPO. That is a 20-megawatt platform that is grid-connected and then also providing thermal energy for district heating. That MOU then with KEPCO is about the opportunity to develop additional large-scale utility projects in South Korea that take advantage of the unique capabilities of our platform to deliver thermal energy all the way up to steam.\n\nAnd as you may know, in South Korea, District heating is a big part of the energy infrastructure in South Korea. So, we think we are well-positioned to provide those services and have a competitive advantage, we believe, over other fuel cell offerings in the market.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nI mean, is that something that we should view movement there as an indication that maybe with some clarity around the litigation that's not being cleared up with POSCO that that is part of the reason why that MOU was signed and that potentially there is some activity there?\n\nJason Few -- President and Chief Executive Officer\n\nSettlement with POSCO was really helpful with respect to just making it clear that we are back in the market, that the exclusivity that POSCO had no longer exists, and that we are the manufacturer and distributor of our technology in the Korea market, and that clarity has been quite helpful to driving interest and market activity for us in Korea and South Korea.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nOK. Got it. And maybe lastly, just on the product side, sticking there. You mentioned the interest in carbon capture around 45-Q.\n\nBut with regulatory certainty, I know that for a number of quarters, and obviously, it's been a focus for a long time, increased product sales in the U.S., and you've been more optimistic that you're making traction there, but they are long sales cycles, maybe where you stand now? And do you expect to start to see some product momentum in the U.S.?\n\nJason Few -- President and Chief Executive Officer\n\nWe do. We do expect to see product momentum in the U.S. And again, we continue to focus on areas where we have advantages and the right to win with our technology, really leveraging the platform. So we think with our ability to do carbon separation with our own platform, deliver carbon as a product.\n\nI mean, if you think about, I think it was a week ago in the Wall Street Journal, there was a pretty robust article about CO2 shortages and what's happening with food producers in the U.S. and around the world and the need for carbon. We believe our platform gives the opportunity for those customers to take advantage of not only our clean power generation, but the ability to create certainty not only around supply of CO2 but something they can't really get today in today's markets around CO2, and that is price certainty around CO2 over the long term, which our platforms are 20-year life platform. So being able to create effectively a 20-year hedge on CO2 pricing is quite attractive to customers.\n\nSo we're seeing momentum there. And then, of course, when you start to think about large-scale carbon capture and sequestration,which 45-Q plays into, the economics there increased the incentive for industrial customers particularly, to want to move forward with those kind of projects to take advantage of that and to capture those economics not only from an economic standpoint, but from what their customers are demanding that they do. following along with their own commitments around sustainability around their own reductions in emissions. And so we think the advantage of 45-Q whether it is sequestration and/or utilization creates quite an attractive opportunity for us.\n\nAnd then as we have communicated previously, we believe with respect to carbon capture that we are the only platform that has the ability to capture carbon, produce power, and hydrogen from a single platform. And we think over the long run, that would give us an advantage on the cost of capture versus competing technologies.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nGot it. That is helpful. Thank you.\n\nOperator\n\nOur next question comes from Noel Parks with Tuohy Brothers. Your line is open.\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nGood morning. Just a couple of things. One, I thought I heard you mention regarding the Exxon JDA that you were exploring other partnership opportunities. Was that with Exxon within the JDA or similar ones with other priorities?\n\nJason Few -- President and Chief Executive Officer\n\nYes. So within the Exxon JDA and the extension that we did through the balance of this calendar year, one of the things that we did in that extension was to agree to collaboratively work on a joint marketing plan. And that joint marketing plan is specific to going out and positioning our technology as a carbon capture solution for other prospective customers, and that is the work that's being done there. So yes, that would mean that the technology will be deployed at other customers outside of Exxon through that joint marketing plan work.\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nGreat. And then just one other one. You were talking a little bit about the Inflation Reduction Act. I was wondering, could you maybe characterize, are there any particular types of clients that, I am thinking maybe on the generation side especially, that might have, in particular, been waiting to get clarity on whether we were going to get new legislation? So do you have any sense of who might be, say, first out of the gate for a commitment now that we know what the incentive structure is like?\n\nJason Few -- President and Chief Executive Officer\n\nYes. That's a great question. We think that it actually helps kind of across the board in general, just because of the way that the new incentive structure is laid out. But particularly, with the ability to take advantage of the investment tax credit as more of a direct payment, we think municipalities are great examples, or non-taxpayers or great opportunities for taking advantage of the new structure.\n\nBut we think it opens the door with respect to just core power generation. We think it opens the door for distributed hydrogen as another attractive opportunity in that. And for us, that cuts across both what we can do with our TriGen platform like what we're doing in California and then ultimately with the commercialization of our SOEC platform to produce hydrogen. We think those become attractive opportunities.\n\nAnd then again, just going back to carbon and carbon separation and carbon capture, we think those are great opportunities.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I will now turn the call back over to Jason for closing remarks.\n\nJason Few -- President and Chief Executive Officer\n\nChantel, thank you very much for that, and I want to thank everyone for joining our call today. Again, we look forward to the opportunity to really leverage our technology and to help our customers reduce their carbon footprint and contribute to their sustainability goals, and we are excited to work and deliver against our purpose of enabling the world to live a life with power by clean energy. Thank you very much for joining our call today, and we look forward to speaking to you again soon. Thank you.\n\nOperator\n\n[Opeartor signoff]\n\nDuration: 0 minutes\n\nTom Gelston -- Senior Vice President, Investor Relations\n\nJason Few -- President and Chief Executive Officer\n\nMike Bishop -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nMike Lisowski -- Executive Vice President and Chief Operating Officer\n\nChris Souther -- B. Riley Financial -- Analyst\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nMore FCEL analysis\n\nAll earnings call transcripts"
}