{
  "companyName": "Atomera Inc",
  "companyTicker": "ATOM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/atomera-inc-atom-q3-2022-earnings-call-transcript/",
  "content": "Atomera Inc (ATOM -1.43%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:00 p.m. ET\n\nMike Bishop\n\nHello, everyone, and welcome to Atomera's third quarter fiscal year 2022 update call. I'd like to remind everyone that this call and webinar are being recorded. [Operator instructions] I'm Mike Bishop with the company's investor relations. [Operator instructions] We will open with prepared remarks from Scott Bibaud, Atomera's president and CEO; and Frank Laurencio, Atomera's CFO.\n\nThen we will open the call to questions. If you are joining by telephone, you may follow a slide presentation to accompany our remarks on the events and presentations section of our investor relations page of our website. Before we begin, I would like to remind everyone that during today's call, we will make forward-looking statements. These forward-looking statements, whether in prepared remarks or during the Q&A session, are subject to inherent risks and uncertainties.\n\nThese risks and uncertainties are detailed in the Risk Factors section of our filings with the Securities and Exchange Commission, specifically on the company's annual report filed on Form 10-K filed with the SEC on February 15, 2022 and in our prospectus supplement filed with the SEC on May 30 as defined by SEC Regulation G. Reconciliations of these non-GAAP financial measures to the most directly comparable GAAP measures are included in today's press release, which is posted on our website. Now, I would like to turn the call over to our president and CEO, Scott Bibaud. Go ahead, Scott.\n\nScott Bibaud -- President and Chief Executive Officer\n\nGood afternoon, and welcome to Atomera's third quarter 2022 update call. Heading toward the end of the year, we continue to be impressed with the depth of the relationships and engagements with our customers and believe we are moving closer to commercialization each quarter. The process takes time, but we are seeing good traction. I will highlight some of our progress in the third quarter, then I'll turn the call over to Frank to go through our financials.\n\nFirst, though, I'd like to address some industry trends and their impact on Atomera. Last quarter, I predicted the softening of demand in the semiconductor industry that's now playing out in earnings calls and analyst reports. Forecast reductions seem to be broad-based, driven by lower demand and export control restrictions. Associated with that, we are seeing some reductions in projected capital expenditures, although I would emphasize that this is a reduction from the record levels previously forecast by many companies.\n\nWhat does this mean for Atomera? Historically, in periods like this, we have seen an increase in development activity by our customers, resulting in additional wafer runs and a growing interest from new customers as they see competitive advantages coming out of the industry slowdown. This case does not appear to be an exception. We see strong and growing interest among our customers and introducing new specialty processes that can benefit from MST. Capacity is available in their factories to get the work done.\n\nAnd allocation of capex budgets, although somewhat reduced, is still plentiful to support the acquisition of new technologies and equipment. In short, this is the type of environment that provides a tailwind to adoption of Atomera technology. As you can see from our customer pipeline, we continue to work with a wide range of customers, together representing at least 50% of the world's largest semiconductor makers. The solid progress we experienced in prior quarters has continued into the second half of this year.\n\nWe maintain our focus on driving customers to adopt MST, in particular, those who are furthest along in their development. The semiconductor industry is known to experience the domino effect, where once a significant industry participant adopts a new technology, other players respond as fast followers. We are encouraged by the activity among early adopters and are working with urgency to move them toward production. On that note, I'd like to update you on some of our more important customer progress.\n\nIn the past, we've spoken about 2 JDA customers. During the last quarter, the Atomera team has been collaborating closely with each of these customers to find MST solutions to real-world problems being experienced in their fabs. We've been making very strong progress. In each of their applications, I believe we are bringing new technical capabilities that were not possible to achieve prior to their use of MST.\n\nAlthough we are restricted on what we can publicly disclose, let me assure you that we've been achieving the results that we have been hoping for since early this year and are now more assured that our solutions will progress through the development process toward volume production. Likewise, we are actively working with each of our four other licensees to advance plans we hope will ultimately lead to further stage of licenses and then on to commercialization. For some, we are awaiting data that will help us prepare for the next steps. For others, we have the proof that is necessary to shift from demonstrating MST benefits to planning for production.\n\nAs always, we will provide you with news on any significant milestones as they happen, subject to the confidentiality requirements of our customer engagements. In particular, when agreements are executed, we will disclose them in real time, and several of these are in the pipeline. Unfortunately, this process can be frustratingly slow. But given the positive developments we've driven, I believe it's only a matter of time for MST to become widely adopted.\n\nDuring this quarter, we continue to see strong interest and plans by more companies to adopt our two most mature and complete MST solutions or products, namely those around MST-SP and MST for RFSOI. In both those areas, we now are convinced of two important things. One is that the solutions we are offering here are only possible through the use of MST. Secondly, we now understand the complex mechanisms driving these solutions even better than our customers, which gives us a unique ability to not only license our technology but to meet our mission, which is to collaborate with customers to achieve financial benefit for both companies.\n\nMST technology is specifically designed to help customers shrink their die to put more product on each wafer, which leads to cost reductions and higher profitability. In times when capacity is tight, this may not be the first priority of semiconductor makers. But when they go into a slowdown like they are and now, this becomes absolutely critically important. I think it's a fair question to ask why, if these technologies and our associated economic benefit are so compelling, it takes so long to adopt.\n\nOf course, there are many answers to this question, but two stand out. Most companies have some kind of long-range product development road map. Perhaps they've been in production with Technology A for three or more years and it's time to work on an upgrade. Consequently, the engineering team focuses on Technology A for a period.\n\nSo Technology B and C will have to wait their turn even if they have identified a real breakthrough. Generally, after identifying the breakthrough, they immediately add that development plan to the next year's development efforts. So although they're committed, work does not begin for several months. This is no reflection on the interest or expected return; is just an example of allocating scarce resources.\n\nOnce they do begin, the development project time line can vary greatly, depending on how full the fab is. For the last few years, throughput was extremely slow, but we expect it to accelerate now. So, as I said earlier, it's only a matter of time. As an example, we introduced MST-SP to the market last year, and even though it generated a lot of interest, we are in more discussions about new customer engagements now than we were last year.\n\nAnd once new programs get started, I expect development to move faster than in the past. In the press, you frequently read about developers of the most advanced nodes and how they're experiencing delays due to yield problems, which prevent manufacturability and high volume. This is one of the principal reasons why it's taking longer to bring new notes to market, a phenomenon people call the slowing of Moore's Law. Atomera's technology is particularly versatile for use in these most advanced architectures of next-generation transistors, which are called gate-all-around transistors.\n\nDuring the last quarter, we have seen evidence of this in successful experiments conducted on our tools. A fundamental challenge designers are trying to deal with at these ultrasmall nodes is that their precise, highly dope structures are sitting only angstroms away from other precise, highly dope structures, and they need to keep these boundaries in place through the whole manufacturing process. But high-concentration dopants and nano-transistor structures tend to diffuse when exposed to the heat required in subsequent manufacturing steps. And there are a few mechanisms to prevent that diffusion.\n\nThe industry has reacted by trying to lower the temperature of its manufacturing process, but a certain amount of heat is still necessary, so they need more techniques to solve the problem. Atomera's MST is one of the best-known materials for preventing dopant diffusion and a gate-all-around transistor, that means it can be used to prevent, source or drain dopants from diffusing into the channel and, thus, preserve high-electron mobility. It can also help prevent punch-through between source and drain in the silicon substrate. Even beyond dopant engineering, MST can be used to lower contact resistance at the silicon metal interface.\n\nIt can reduce high-k metal gate stack height, and finally, it can improve carrier mobility and gate leakage by reducing high-k metal gate intermixing. For a process development engineer, each of these MST benefits provides a distinct tool for getting gate-all-around technology into production faster and at a higher yield. And implementation of MST in the manufacturing process is straightforward because epitaxial deposition is already used extensively for the process steps adjacent to the MST layers when building gate-all-around structures. Many of the ideas I've just spoken about have become apparent through our team's R&D efforts this year between progress with our customers, new emerging opportunities and the increasing expertise of the Atomera team in addressing critical industry issues.\n\nI believe our progress this past quarter is even greater than what we saw in the first half of the year. I wish you could experience the pace of customer and development activity inside Atomera. As I said before, this point in the industry cycle is ideal for our company, and we are doing everything in our power to take advantage. Our team is optimistic that these advances will soon lead to new customer growth and, even more importantly, licensing activity that will take more customers toward commercialization and will make Atomera a recognized semiconductor technology leader in the industry.\n\nNow let's have Frank review our financials.\n\nFrank Laurencio -- Chief Financial Officer\n\nThank you, Scott. At the close of the market today, we issued a press release announcing our results for the third quarter of 2022. This slide here shows our summary financials. Our GAAP net loss for the three months ended September 30, 2022 was $4.6 million, or $0.20 per share, up slightly from our Q2 GAAP net loss of $4.5 million, which was also $0.20 per share.\n\nIn Q3 of 2021, GAAP net loss was $4.2 million, or $0.19 per share. GAAP operating expenses in Q3 2022 were $4.7 million, an increase of approximately $210,000 over our $4.4 million of operating expense in Q2. This increase was primarily due to an increase of approximately $310,000 in R&D expenses, reflecting headcount growth, offset partly by a $100,000 decline in G&A expense as legal and other fees declined sequentially, while sales and marketing expenses were basically flat quarter over quarter. As compared to our Q3 2021, GAAP operating expenses last quarter increased by $521,000, primarily as a result of a $510,000 increase in R&D expense due to increased engineering headcount, recruiting expenses and higher total lease costs due to a full quarter of lease expense in Q3 2022 compared to only a partial quarter in Q3 2021.\n\nNon-GAAP net loss for the third quarter of 2022 was $3.7 million, compared to losses of $3.6 million in Q2 and $3.4 million in Q3 2021. The differences between GAAP and non-GAAP operating expenses and accordingly, between GAAP and non-GAAP net loss are almost entirely due to noncash stock compensation expenses. Our cash balance at September 30, 2022 was $23.3 million, compared to $21.8 million at the end of Q2, which is an increase of $1.5 million. Operating cash used during Q3 was $3 million.\n\nAnd during the quarter, we brought in approximately $4.6 million of cash from financing, net of expenses and commissions, reflecting sales under our at-the-market, or ATM, equity program. During the third quarter, we sold 386,415 shares at an average price per share of approximately $12.34 under the ATM. As of September 30, 2022, we had 23.9 million shares outstanding. Turning now to our outlook for the rest of this year and 2023.\n\nNever before has Atomera been engaged across such a diverse array of applications where our customers need innovative breakthroughs like MST. Obviously, we like these engagements to offer near-term revenue. And when additional customer wafer runs are required, licensing and go-to-market decisions get pushed out. Accordingly, our guide from revenue in Q4 is zero, and we are not providing revenue guidance beyond the current quarter, which is consistent with our past practice.\n\nOur last update call in July, I reduced our full year guidance for non-GAAP operating expenses to a range of $14.75 million to $15.25 million. For the nine months -- the first nine months of this year, our non-GAAP expenses totaled $10.6 million. And because we have good visibility through the end of the year, I expect our full year operating expense on a non-GAAP basis will be at or slightly below the bottom end of that guidance range. On our next earnings call, I'll provide more specific color on our planned 2023 spending.\n\nWith that, I'll turn the call back over to Scott for a few summary remarks before we open the call up to questions. Scott?\n\nScott Bibaud -- President and Chief Executive Officer\n\nThanks, Frank. As expected, the strong momentum we built in the first half of this year has given us a solid platform to build on for the accomplishments of the second half, and we are taking full advantage. Customer visits and associated progress and development are accelerating. And with the dip in semiconductor backlog, companies have the capacity and inclination to implement new solutions like MST to add capacity, cut product cost and achieve competitive advantage.\n\nAtomera is perfectly positioned in this environment with a variety of tools to meet their needs. We continue to believe that this combination of our technical capabilities in the context of this market provide an ideal environment to add to our license portfolio and to move forward to commercialization. And we look forward to sharing news of those efforts with you in the future. Mike, we will now take questions.\n\nMike Bishop\n\nThank you, Scott. [Operator instructions] And now, our first question comes from Richard Shannon of Craig-Hallum. Richard, if you could kindly unmute and turn on camera, you may begin.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nThanks, Mike. And thanks, Scott and Frank, for having me. I apologize in advance here for trying to listen to two calls at once here. So you may have touched on some of these topics here.\n\nBut maybe just touching on your first JDA customer. I think you've talked about being in central engineering and working with one business unit. Have you expanded that beyond the first business units? Or -- and if not, any visibility or work being done to expand that relationship?\n\nFrank Laurencio -- Chief Financial Officer\n\nYeah, thanks for the question, Richard. So we aren't really talking about expanding into different business units. But what I can say, when we get to kind of a license agreement, we'll be able to say, we've definitively expanded with the business unit, that's when we'll be able to disclose it. But I can say, and in my prepared remarks, I made a few comments about the work that we're doing with JDA Customer 1 and the breakthroughs that we've kind of achieved on our R&D team here.\n\nSo obviously, we are continuing to work very closely with them and continuing to development work that we believe positions us well to get to that type of agreement in the future.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK. Fair enough then. Scott, I think you had some comments, and again, I probably missed all -- or missed some of them, but it sounds like you're fairly excited about the environment here that allows a little bit less utilization and offers more opportunity to run more R&D wafers. To what degree are you seeing that? I mean, do you get a full view on what utilization customers have and to what degree they're prioritizing work with you versus other avenues they may have for those -- the small number of R&D wafers they run?\n\nScott Bibaud -- President and Chief Executive Officer\n\nYeah. I mean, we definitely -- with the customers that we have that are running wafers that they're planning to do additional wafers, it's been no problem, whatsoever, to get new runs planned and started. For our newer customers, one of the challenges that we've had in the past is a customer that was interested in working with us may say, hey, we think your technology has a lot of promise, but I can't get any wafers through the fab. And we've seen that concern go away.\n\nSo now, we have a lot of new customers that we're talking about, and we think we'll be able to engage with them quickly. And then, finally, sometimes even when we had wafers running in fabs with folks in the past couple of years, has taken a very long time to progress through just because they're fully utilized for revenue-bearing wafers. And so, we're starting to see that loosen up as well. Although I would say, when analysts like yourself are talking about the slowdown in semiconductors, it's about bookings, right? And it's about things that are going to happen in the future.\n\nThe slowdown in practice has not entirely hit the factories yet. So -- but people can see it coming.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK. OK. Fair enough then. And I think on the topic of leading edge, which had some nice comments, I think I heard most of them there.\n\nI guess, a couple of questions there. Obviously, there's a lot of work that needs to be done here both in your end, as well as the industry work here. To what degree of confidence do you have of not only getting licensees for the kind of gate-all-around technology, but also intersecting with the introduction of those technologies to the market versus some updates they may have down the road? How do you think about that?\n\nScott Bibaud -- President and Chief Executive Officer\n\nYeah, it's always a challenge trying to get on the train at the right point, so that you can be there when it leaves the station. But I've talked about this on other technologies before. Everything that we're talking about are additive technologies that will help the gate-all-around processes and, even if they move to the process beyond that, it makes it easier for them to manufacture and get higher performance out of those waivers. So even if they don't use it on the first round, they may use it on a follow-on version of it to get higher yield or get better performance.\n\nIf you look at TSMC's 5-nanometer product portfolio, you can see that they had a whole bunch of variations of five, right? The first version, the second version, the third version. And we believe that we can definitely -- if we don't intersect with the first, we definitely believe we'll be able to intersect with the later ones. And now there's only three players that are developing this type of technology. But the techniques that we've developed for gate-all-around are also very applicable to some of the more advanced work that's being done by memory players as well.\n\nAnd so we're very optimistic about it.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK. Great perspective there, Scott. Thanks. Maybe a couple of quick questions for Frank.\n\nIf I missed this, my apologies, but did you update the capex spend rate for this year? Did you change it? And would you have us think about a different rate for next year? It sounds like there's a little bit hiring plans or other work that might lead us to think there's something of an increase next year. And just kind of qualitatively, can you help us think about that?\n\nFrank Laurencio -- Chief Financial Officer\n\nYeah. No. Happy to do that, Richard. So in terms of for the rest of the year, I'd give a band of $14.75 million to $15.25 million.\n\nAnd given that we ended Q3 under -- was that, yeah, $10.6 million through the first three quarters of the year, I'd expect that we'd come in kind of right around the bottom of that range, so the bottom end being $14.75 million. I think we'll be at or below that. Directionally, we're in the middle of our planning process for next year. I wouldn't expect there to be big step functions.\n\nBut if you look back sort of for the last four or five quarters and looked at sort of the sequential growth rate, I don't expect that we would grow spending less than that, but I'm not prepared to kind of give any specific guidance for next year. But I think if you look at sort of the trends quarter on quarter that we've seen throughout this year and carry that into next year, that's a reasonable place to think about where we'll be.\n\nOK. That's helpful, Frank. And last question for me. On the comments you had on the ATM, I caught the price per share average that you had there, but I missed the number of shares that you took down there.\n\nYeah. So the number of shares we sold last quarter was 386,415, and that's in our 10-Q also.\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nOK. Perfect. Thank you. That's all for me, you guys.\n\nThanks a lot.\n\nFrank Laurencio -- Chief Financial Officer\n\nThank you.\n\nMike Bishop\n\nThanks, Richard. And our next question comes from Cody Acree of Benchmark. Cody, if you wouldn't mind turning on your camera and unmuting.\n\nCody Acree -- The Benchmark Company -- Analyst\n\nYeah, thanks, guys. Thanks for taking my question. Maybe, Scott, if I can start off with your Chinese exposure. To what extent are you exposed to the China market and those partners that may or may not be having any of the economic malaise that we're seeing around the rest of the industry?\n\nScott Bibaud -- President and Chief Executive Officer\n\nYeah, so thanks for the question, Cody. First, we have been -- for years, we were hesitant to get involved in China too heavily because we just had IP concerns. Later on, we started to get engaged with China a little bit more, but we -- but then, we backed off during the Trump administration because of some signals that we're seeing coming out of Washington. So right now, we don't really have any significant exposure to China.\n\nI think if this trade war ever turns around, then we would probably go in and be looking for opportunities there. But right now, I wouldn't say it impacts us, whatsoever. As a matter of fact, I would say that the fact that there's a lot of folks trying to move process technologies into their own kind of domestic country fabs gives us an opportunity to help those fabs differentiate by bringing our technology in as they're adopting.\n\nCody Acree -- The Benchmark Company -- Analyst\n\nBut you're not currently working with any partners in China.\n\nScott Bibaud -- President and Chief Executive Officer\n\nThat's right.\n\nCody Acree -- The Benchmark Company -- Analyst\n\nOK. OK. If I can just get you to talk a bit about the macro again. Just the difference in the customer attitude, as the belts are being tightened across the industry, I definitely see where the facilities being lesser used could be an opportunity to move you in.\n\nBut at some point, that pendulum goes so far that then it's a customer attitude of restraints and tightening. You've been through some of these cycles before where that could be a point for you at some point in the future.\n\nScott Bibaud -- President and Chief Executive Officer\n\nYeah, that's a good question. First of all, we're very early in that pendulum swing, as you know. So right now, we're really in the sweet spot. It's where people -- one of the things that's interesting is, this past few years, the capacity has been so thin that development activity inside a lot of these companies was slowed down.\n\nThey were really focused mostly on how to improve the yield to get more wafers through a fixed capacity fab, right? So now, they have all this pent-up R&D that they're ready to do. And I don't believe that we've seen a situation so far in our company's life where the pendulum has swung so far to the cost savings side that they aren't doing development work. We -- I think it doesn't get -- I don't think it happens. Once people get to the point where they say, hey, we really need to save money, they start looking at what can we do on our product costs or something to lower our cost, so we can drive more profitability through the limited manufacturing capacity that we have.\n\nAnd that's a sweet spot for us. So I really think if this slowdown lasts for a while, it's going to be great for us, and really think it puts us in a great position.\n\nCody Acree -- The Benchmark Company -- Analyst\n\nAnd your comments around MST's application to gate-all-around is very encouraging. But like you said, there's a limited number of players that are developing that, and it's still very much in development process. So I guess, are you having active discussions toward your implementation? Or is that more of a -- or was that more of a commentary of thought on your part that we should be applicable here and makes sense logically, but we're not seeing it yet more partners?\n\nScott Bibaud -- President and Chief Executive Officer\n\nYeah, what I'd say, Cody, is we definitely are in contact with players that are doing this type of work. They know about our technology, and we have different levels of engagement, direct engagement with different guys there. But certainly, that's something that we are constantly kind of promoting and something that we want to get more deeply involved with each of them on. I really believe that in the most bleeding edge, that's probably where you also see the most NIH in companies, all the best engineers that the foundries want to work on this.\n\nAnd they may be somewhat hesitant to seek outside help like what we can bring, but there's no denying, I mean, the comments I made on the call, there are at least five and maybe six different benefits we can bring. And each one of them is separate. It's not like -- I mean, you could choose just to implement one or you could implement all six. And they're not very hard to implement because like, let's say, we're putting our technology in an older process node, we need to convince people to add epi and run epi on their production line.\n\nIt's not hard to do, but it's just a new piece of equipment. But on the most advanced nodes, they're using epi everywhere. And all they would have to do is add in some extra steps to put in MST after the prior piece of epi that they were doing. So I think we're very optimistic about this.\n\nIf we get in at the bleeding edge, of course, it will probably be included in all future nodes that are developed as well.\n\nCody Acree -- The Benchmark Company -- Analyst\n\nAnd let's see, lastly, I guess, just, Scott, your discussions on 2023 budgets for your customers. You've obviously been having those. You're getting some thoughts on their broader capex plans. And I would just like to hear your thoughts on what were your customers' attitude toward spending next year.\n\nAnd are those -- is that in sync with your encouraging thoughts?\n\nScott Bibaud -- President and Chief Executive Officer\n\nRight. Yeah.. So absolutely. Six months ago, I think, in my Q1 earnings call, I was talking about basically every one of our customers making record forecasts for what they were going to do for capex spend more than they've ever spent in their -- in the company's history.\n\nAnd now, some of them have scaled back those forecasts. But you got to imagine that still means they're spending far more than they had planned to spend two years ago. So yeah, I think I'm very optimistic. I think, they have plenty of money.\n\nI mean, there -- a lot of the guys were talking about their R&D budgets are in the billions of dollars, working with us is a few millions of dollars of peanuts. And so this -- I don't anticipate that we're going to see problems with cutbacks from customers because of cost concerns, at least in the next year to 18 months.\n\nCody Acree -- The Benchmark Company -- Analyst\n\nOK. Great. Thanks. And then, I'm sorry, one last thing.\n\nI just wanted to talk about your visibility. And I know that your standard has been to guide toward zero in lack of certain deliverables. But we've been sitting here at zero for the last few quarters, as far as the Street estimates go. And I guess, I'm wondering, is there a point on your horizon that you could start to think about getting more positive? Are there milestones or hurdles that you believe are coming that you might see a quarter in 2023 where you can actually predict revenue? Or are we looking at this situation for the foreseeable term?\n\nScott Bibaud -- President and Chief Executive Officer\n\nNo, actually, I share your frustration on that question, Cody. We -- the challenge -- and I've always said this in Phase 3, where we're doing kind of integration licenses, they're very hard to predict. Once a customer gets a manufacturing license, then we get a little more visibility into what they're doing. And we do have what we believe are a number of customers in the portfolio who are -- who could do a manufacturing license soon.\n\nWe're always hesitant to say exactly when that will happen because maybe they do a wafer around that takes nine months, and we hope it happens right after that, but they might need another wafer run it will take nine months more. So -- but I can say we have several in our portfolio that we hope get there. Once they get through the manufacturing license and then we can get them into Phase 5 distribution license, at that point, we can almost start to make real revenue forecast not only for the license payments like upfront license fees but also for royalty payments down the road. So I'm hopeful we get there soon.\n\nDefinitely, I am tired of zero revenue forecast, and we'd love to give you more than that.\n\nCody Acree -- The Benchmark Company -- Analyst\n\nSure. Sure. And Frank, one last thing for you. Your ATM program, is there a range of valuation estimates that you have your thumb on that -- where you believe that it's just so cheap you've got to be buying more aggressively and not for into the range where you might buy less?\n\nFrank Laurencio -- Chief Financial Officer\n\nI think of it's the opposite, right? I mean, because this -- that would be sort of a stock buyback. I mean, you're thinking more in terms of the range of where we would sell in the ATM. And no, we don't stick to sort of ranges like that. I think the average execution price last quarter shows that we're pretty judicious about using the program.\n\nBut frankly, we have rebalanced two things, right? One is maintaining sufficient cash on our balance sheet to cover our anticipated needs. And then, the second one is trying to execute at the best price to be as -- to have as little dilution as possible. I think we've proven in using ATM instruments that we've executed well to those metrics. But I can't look forward and say that there are sort of absolute ranges because it's just going to depend on -- part of it within our control, how are we executing? What are we delivering? What are our capital needs? But the one that I can't control is what's the broader equity market doing.\n\nBecause I do think that without addressing our own stock price, I mean, overall, equities have been hurt pretty badly in the last year. So we're not immune to that, and we don't have a crystal ball as to when that will change. So there's no hard and fast formula for that.\n\nCody Acree -- The Benchmark Company -- Analyst\n\nOK. Great. Well, thanks, Frank. Thank you, Scott.\n\nAppreciate it.\n\nScott Bibaud -- President and Chief Executive Officer\n\nThank you, Cody.\n\nMike Bishop\n\nThank you, Cody. And some questions coming here on the Q&A chat. One of them -- there's a couple of questions, Scott, on the wafer runs that we've talked about before. And so, the question is, can you give some more color on the wafer runs that you've announced or discussed on prior conference calls?\n\nScott Bibaud -- President and Chief Executive Officer\n\nYeah. I think on prior conference calls, what we said was that we had a number of different wafer runs underway. We have gotten some preliminary results that looked very promising. Some of those wafer runs have made to the end, and unfortunately, some of them haven't yet.\n\nSo, what I can tell you is that we've seen data come out of those runs that we were hoping to see at the beginning of this year. And we -- then there were some -- there are some technical challenges with one of the runs that have nothing to do with our technology but may delay the results further. So I don't want to say what type of decisions the customers have made based on those, but I can -- I'll just say we're continuing to work with them. And we hope that what we're doing will lead us to a next generation -- I mean, a next step, which would be license agreements in the near future.\n\nMike Bishop\n\nOK. And I know we touched on it a little bit in the prepared comments, but there's a couple of questions about updating on the status of the JDA. So, maybe address what things are needed for your JDAs to make it to production.\n\nScott Bibaud -- President and Chief Executive Officer\n\nOK. I did make some comments about our JDAs, I think. On JDA No. 1, as we've spoken about in the past, so we're -- we had been working with the central engineering organization, and we continue to work with that customer, various groups who've asked us to look at some other technology that they really need help solving, and we've been working on that jointly with them.\n\nI mentioned in my prepared remarks that we've seen really compelling results there. And -- but we -- and we're talking to multiple business units. But we haven't gotten to the point where a business unit has signed up and said, OK, we're going to take a license and start moving forward. That's something I can announce, and that's the point where I can give you -- I mean, I'll give you at least as much color as I can there, but right now, we're not quite at that point, so I can't say much more about it.\n\nThe other JDA customer we have, we're working directly with a business unit. It falls in the category of one of those guys who had wafers in the fab, but we don't quite have results yet, so I can't really give you much update there either. But still working very closely with them, and we hope to kind of get to the point where we can push into the license day soon.\n\nMike Bishop\n\nOK. And so, there's a question about the intellectual property. And the question is, how does your IP portfolio create a moat around the -- where the semiconductor industry is moving?\n\nScott Bibaud -- President and Chief Executive Officer\n\nYeah. This is -- that's actually a really good question. So our IP portfolio is composed of -- we have more than 300 patents granted and pending, and they cover -- I like to think of it as a cloud. If you look inside each patent, there are dozens and dozens of claims in there, and each claim is something that protects us.\n\nAnd so, what we try to do whenever possible is we try to take fundamental MST capability, and we try to build patents around applications, how people would use that in certain areas. So for example, today, I talked a little bit about gate-all-around technology, and we may have some patents that cover MST and gate-all-around technology. Now, for somebody who would like to use MST, we have such a cloud of coverage around that technology that they would be crazy to try to figure out how to work around the cloud or find a hole in it because there's just too many intersecting kind of lines that they would have to try to get around. And so, we believe we have very good coverage not only for our core technology but also for a lot of the most likely future uses of it with ongoing patent applications that are application-specific.\n\nMike Bishop\n\nOK. And final question here. What has Atomera done in the memory sector?\n\nScott Bibaud -- President and Chief Executive Officer\n\nYeah. So most of our work in the memory sector has been R&D work internally here that is targeted toward needs that we know the memory market has. And the reason why we know what they are is because we're working with memory makers, and we're consulting with them, and we're trying to find ways that our technology can solve some of their problems. I think one of the areas that we're particularly excited about and have been for a little while is in DRAM and our ability to use MST to make smaller stamps, which are -- which make up about half the size of an overall memory chip today.\n\nSo if we could really help them shrink those that could save enormous amounts of power and area and it would be very valuable. In order to engage with memory companies on those things, though, we need to do a lot of R&D work to get the actual data to prove our claims. So there's three pieces we need in almost any engagement with the customer. We need to have a theory about why it would work.\n\nWe need to have some modeling. So Tecan modeling software to show people exactly how it would be implemented and how it would work. And then, finally, ideally, we'll have some measured silicon results that show the benefits that we're promising to customers. And if we can do those three things, we have a very strong chance of engaging with them and trying to move forward.\n\nSo that's one of the key things that we have going on in the memory market. We have a number of other ideas that we're working on at a little bit more in the background, but -- so that's what's going on.\n\nMike Bishop\n\nOK. Thanks, Scott. And we'll turn it back to you for closing comments.\n\nScott Bibaud -- President and Chief Executive Officer\n\nRight. Well, I just want to thank everyone for attending today's presentation. I'm very pleased to share with you our recent strong progress and to give you a sense of the optimism we're experiencing inside Atomera. Please continue to look for our news, articles and blog posts to keep you up-to-date on our progress, which are available, along with investor alerts, on our website, atomera.com.\n\nWe look forward to seeing some of you during our scheduled marketing activities, including the Benchmark Discovery conference. Should you have additional questions, please contact Mike Bishop, who will be happy to follow up. Thank you again for your support. And we look forward to our next update call.\n\nMike Bishop\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Bishop\n\nScott Bibaud -- President and Chief Executive Officer\n\nFrank Laurencio -- Chief Financial Officer\n\nRichard Shannon -- Craig-Hallum Capital Group -- Analyst\n\nCody Acree -- The Benchmark Company -- Analyst\n\nMore ATOM analysis\n\nAll earnings call transcripts"
}