{
  "companyName": "Sierra Metals Inc.",
  "companyTicker": "SMTS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/sierra-metals-inc-smts-q2-2022-earnings-call-trans/",
  "content": "Sierra Metals Inc. (SMTS -2.10%)\nQ2 2022 Earnings Call\nAug 12, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to today's Sierra Metals second quarter 2022 financial results. My name is Candice, and I will be your moderator for today's call. [Operator instructions] I'd now like to hand the conference over to our host, Christiana Papadopoulos, manager of investor relations, to begin.\n\nChristiana Papadopoulos -- Manager, Investor Relations\n\nThank you, operator, and good morning, everyone. Welcome to Sierra's second quarter 2022 results conference call. On today's call, we are joined by Luis Marchese, our CEO; and Ed Guimaraes, our CFO. Today's call will be followed by a question-and-answer period as mentioned.\n\nThe accompanying presentation for today's call is available for download through the webcast or from the company's website at sierrametals.com. Yesterday's press release, the financial statements and management discussion and analysis are also posted on the company's website. I'd like to note that this morning's earnings call contains forward-looking information that is based on the company's current expectations, estimates and beliefs. These forward-looking information is subject to a number of risks, uncertainties and other factors.\n\nActual results could differ materially from our conclusions, forecasts or projections as reflected in the forward-looking information. Additional information about the material factors that could cause actual results to differ materially from the conclusions, forecasts or projections in the forward-looking information and the material factors or assumptions that were applied in drawing a conclusion or making a forecast or projection as reflected in the forward-looking information is contained in the company's annual information form, which is available publicly on SEDAR or EDGAR via Form 40-F or the company's website. Please note that all dollar amounts mentioned on today's call are in U.S. dollars unless otherwise noted.\n\nI'd now like to turn the call over to our CEO, Luis Marchese, for an overview of the quarter's highlights, as well as a summary of what's ahead for the second half of 2022, followed by Ed Guimaraes, our CFO, for the financial highlights.\n\nLuis Marchese -- Chief Executive Officer\n\nThank you, Christiana. Good morning, everyone. Looking at Slide 4. Following the release of our Q2 results and the summary in the press release, you can see that this quarter provided for mixed results.\n\nAt agriculture, although the mine processed 317,000 tonnes during Q2, in line with throughput in Q1 2022, high-grade in all metals with the exception of lead resulted in an 11% increase to copper equivalent pounds produced. Also, to highlight, during the quarter we reached the new high-grade Cortina area, which has started supplying ore to the plant feed. Nonetheless, the improvement of agriculture on a quarter-over-quarter basis has helped offset lower production coming out of Bolivar. On a consolidated basis, copper equivalent production has achieved within guidance for the first half of the year.\n\nThe turnaround effort continues at Bolivar albeit at a slower pace than expected. Restricted split for operations and limited [Inaudible] due to the delays on new credit report in the Bolivar Northwest zone contributed to the overall delay, which resulted in lower throughput and raised non-recurrent [Inaudible]. The Bolivar mine processed 256,000 tonnes during Q2 or 37% higher as compared to Q1 2022. In the ground, mining is being slowly discontinued at the Bolivar West zone due to the decision and phasing into the Bolivar Northwest zone and [Inaudible].\n\nHigher copper, silver and gold rates resulting in a 52% increase in copper equivalent pound production when compared with the previous quarter. When compared to Q2 2021, throughput at Bolivar was 33% lower and grades were lower for all metals except for gold resulting in a 46% decrease in copper equivalent produced. The change in rate profile is due to the depletion of Bolivar West and the new contribution of the Bolivar Northwest ore valley together with the low-grade [Inaudible]. I would like to mention that Bolivar has been operating in a difficult security environment over the last few months due to intense police, military presence in the area following recent criminal activity.\n\nOur priority is to ensure the well-being of all personnel, and appropriate measures have been taken by Sierra Metals in this regard. At Cusi, throughput was 66,722 tonnes during Q2 2022 or 24% lower as compared to Q1 due to the unexpected flooding in the underground mine. Lower throughput and lower grades resulted in a 38% decrease in silver equivalent production. When comparing Q2 2022 to Q2 2021, the mine processed 9% lower chemical ore.\n\nSilver production decreased 4% to 0.3 million ounces. Gold production increased 15% and lead production increased 112%. Silver equivalent production of 223,000 ounces for the quarter was in line with Q2 2021. The unexpected potential upturn price during Q2 coupled with lower metal prices resulted in a 13% decrease in quarterly revenue over last quarter and 37% over the same quarter in 2021.\n\nSpecifically, growth in prices for Q2 for copper, zinc, metal, silver were 20%, 24%, 22% and 18% lower than the company prices at the end of Q1, resulting in $11 million mark-to-market adjustments to the asset on sale provision at the end of this quarter and impacted revenue. And finally, when analyzing the overall picture, one cannot ignore the global inflationary cost pressures affecting the sector right now. In the second quarter, we were not immune to this. We experienced cost increases related to input such as fuel and plant consumables, reagents using chemical analogies, explosives and drilling.\n\nThis also impacted costs related to the higher contractor during the quarter for increased [Inaudible] work and positive improvement, particularly at agriculture and Bolivar. As a result of all these factors, EBITDA, net inflow and cash flow generation were all negatively impacted. Adjusted EBITDA for the quarter was $1.4 million. Now, turning to Slide 5.\n\nTurning to Slide 5 and looking ahead. In the second half of 2022, at the agriculture, we are focused on meeting maximum levels of throughput at 3,600 tonnes per day and continue making up the lost production earlier in the year. Higher throughput, along with higher grades from the new high-grade Fortuna to help maximize our metal production within our current mining constraints. We expect that the agriculture copper equivalent production will now fall within 49 million or 53 million copper equivalent pounds.\n\nDrilling infrastructure, project [Inaudible] and the required [Inaudible]. At Bolivar, we continue to our plan to increase plant throughput while still in a difficult and highly uncertain operating environment, reflected in late in the first half of the year and continued operating difficulties, Bolivar production guidance has been revised to a range of 14 million to 15 million copper equivalent pounds for the year. In addition, with the continued monitoring of the project of our turnaround plan for the mine, we have scaled back on our capital expenditure guidance for the year, reducing Bolivar expenditure by $10 million. This includes the return of the foreign [Inaudible].\n\nWe will continue with critical infrastructure projects in ventilation, communication and [Inaudible]. Of course, with the help of the auxiliary production for range of 1.2 million ounces. The area of focus remains on mine development into high-grade areas, pending projects, including replacement and tailings dam development. And with that, I will turn to Ed to review the second quarter financial highlights.\n\nEd Guimaraes -- Chief Financial Officer\n\nThanks, Luis, and good morning, everyone. Turning to Slide 6. In Q2, we reported a 19% decrease to our consolidated throughput and with the decline in all grades, this equates to a 28% decrease in consolidated copper equivalent production compared to the second quarter of 2021. With lower production and metal prices declining over the quarter, revenue from metals payable decreased 37% when compared to Q2 '21, as discussed earlier.\n\nThe adjustments on the open sales position as of June 30 relative to the end of the first quarter of the year was $11 million. This impacted revenues from the first quarter -- sorry, this impacted revenues from Yauricocha, Bolivar and Cusi by negative $8.4 million, negative $2.4 million and a negative $0.2 million respectively. Adjusted EBITDA was $1.4 million, a 97% decrease resulting from lower revenues and lower gross margins when compared to Q2 2021. We reported a net loss attributable to shareholders of $15.3 million or negative $0.09 per share and an adjusted net loss of $11.6 million or negative $0.07 per share.\n\nWe finished the quarter with approximately $16.4 million in cash. Our three-month revenue mix by metal continues to be led by copper, followed by silver and zinc at 48%, 20% and 20% respectively. Lead and gold continued to contribute revenue in line with previous quarters at 5% and 7% respectively. Looking at the average realized prices compared to Q2 2021, copper has gained much strength during this time last year, but more recently, increased scares of a global recession and climbing demand in China impacted copper demand, resulting in a 2% decline in Q2 2022.\n\nZinc and lead on the other hand, increased by 34% and 3% respectively. In the precious metals category, silver declined by 15%, with gold increasing by 3%. Turning now to Slide 7 to review balance sheet and financing and liquidity highlights for the quarter. The company reported $16.4 million in cash as of June 30, 2022.\n\nOur total debt at the end of the second quarter was $80.8 million, with a net debt of $54.4 million. Cash and cash equivalents decreased during the six-month period due to $22.5 million in investing activities, $1.5 million used in financing activities, offset by $5.5 million of cash generated from operating activities. For the remainder of 2022, the company's focus will be on improving operating cash flows through improved production and cost reduction. Management will continue to review metal prices and retains the option to adjust the capital expenditures should metal prices experience any further dramatic changes within the year.\n\nIn June 2021, the company commenced the quarterly repayment installments on its $100 million six-year credit facility with Banco Credito del Peru and Banco Santander. The repayment period is four years from its installments in the amount of $6.25 million for a total of $25 million annually and ending in March 2025. In June of this year, through our subsidiary through Sociedad Minera Corona, the company received approval for a $25 million loan facility to refinance the quarterly installments payable in 2022. $12.5 million has been used to repay the installments that were due in March and June, with the remaining $12.5 million to be used to repay the installments during September and December of this year.\n\nThe $25 million loan facility will become payable beginning in June 2025 with quarterly installments of $6.25 million ending in March 2026. Interest on this $25 million facility is 3.65%, but three-month standard overnight rate, which at the end of June 30, 2022, was 0.29%. $1 million in loan interest is paid during the six months on the loan facilities during the six months ended June 30, 2022. The company also has further access to approximately $25 million of available credit lines with local banks, as well as opportunities for other short-term lines and prepayment facilities with its commercial comp takers should it be necessary.\n\nTurning now to Slide 8. At Yauricocha, while we saw an improvement to cash and all-in sustaining costs over the first quarter of the year when compared to Q2 2021, a 46% increase in cash cost and a 32% increase in all-in sustaining costs were driven by an 18% decrease in copper equivalent payable pounds in addition to higher operating costs. At Bolivar, again, unit costs improved over the first quarter of 2022, but when compared to Q2 2021, cash cost increased by 93% and all-in sustaining costs by 43%, driven by higher operating costs and a 40% decrease in copper equivalent payable pound. Sustaining costs, including treatment and refining costs and capital expenditures decreased during the quarter, but could not compensate for the decrease in copper equivalent payable pounds, resulting in all-in sustaining costs for copper equivalent payable pound of $5.49, a 43% increase from the all-in sustaining cost of $3.85 during the same quarter of 2021.\n\nWe are seeing some improvements quarter over quarter, and we hope to see that trend speed up during the remainder of 2022. At Cusi, cash costs are up by 15% due to higher operating costs, while all-in sustaining cost decreased by 5% when compared to the same quarter of 2021. Silver equivalent payable ounces reported during the quarter went along with Q2 of 2021. All-in sustaining costs decreased by 5% when compared to the same period as a result of lower treatment and refining charges and general and administrative costs, as well as sustained capital expenditures.\n\nTurning to Slide 9. Given the delay in the turnaround program at Bolivar, the decline in metal prices and rising costs due to inflationary pressures, we have revised production costs, production, cost, EBITDA and capex guidance to reflect the company's current position. Production guidance has been lowered to a range between 70 million and 78 million copper equivalent pounds for the year from the original guidance of 80 million to 90 million copper equivalent pounds. While the delays in development and ventilation in Bolivar and the flooding event in Cusi are still into the temporary issues, we believe that this requires downward revision to the production estimates for these sites for the second half of the year as appropriate.\n\nAt Yauricocha though, throughput and grades are expected to improve due to the mining in the Fortuna zones, resulting in positive adjustments to the mine's production for the second half of 2022. EBITDA guidance has also been lowered to a range between $61 million and $67 million from the previous amount of $90 million to $105 million to reflect the decrease in expected revenues due to the decline in metal prices and lower expected throughput at our Mexican operation. Cost guidance revisions have also been applied. At Yauricocha, a decrease in cash cost is expected for the remainder of the year, given that we expect an increase in copper equivalent production.\n\nHowever, we have revised all-in sustaining costs slightly upwards. While sustaining costs such as treatment and refining charges actually declined at Yauricocha in the first half of the year, it was not enough to offset the sustaining capital actually required to run the mine. We expect this will be the case in the second half of the year. At Bolivar and Cusi, we have also adjusted cash costs, as well as the all-in sustaining costs to reflect higher costs associated to the lower production guidance.\n\nWe have made efforts to reduce expenditures and preserve cash in order to position the company to weather any additional events that we cannot control occur. As a result, capital expenditure guidance has been lowered to $59 million from our original guidance of $69 million. This includes a reduction of $10 million at Bolivar due to the slower-than-anticipated ramp-up of planned throughput initially planned for 6,000 tonnes per day. At Cusi -- sorry, tonnes per day by the end of the year.\n\nAs we continue to focus on the turnaround program at Bolivar, we have decided to suspend the dividend for 2022 and allocate the funds internally where they can generate returns at a higher level than what we would be realized if the dividend was paid out. Our priority is to ensure we can get the company back on track operationally and improve our cash position and ultimately return to the clearing [Inaudible]. With that, I will now turn the call back to Christiana.\n\nChristiana Papadopoulos -- Manager, Investor Relations\n\nThanks, Ed. That ends the presentation portion of this call. We would now like to open the call to questions from participants. In the interest of time and fairness, again, we ask participants to keep their questions to a limit of two to give all participants an opportunity.\n\nOperator, you can open the lines, please.\n\nOperator\n\nThank you. [Operator instructions] So our first question comes from the line of Heiko Ihle of H.C. Wainwright. Your line is now open.\n\nPlease go ahead.\n\nHeiko Ihle -- H.C. Wainwright -- Analyst\n\nHey, there. Thanks for taking my questions. In your presentation, you state that the, \"Turnaround program at Bolivar is progressing,\" unsurprisingly here, but arguably the site has been a turnaround story for quite a while. And so, just thinking bigger picture here, I mean, what tangible changes have happened in Q3 thus far? And we're halfway through the quarter on Monday.\n\nAnd on that same token, what do you think you'll accomplish at the site by the end of the quarter, maybe even by the year given that you're currently also talking about in that quarter, again, a uncertain operating environment?\n\nLuis Marchese -- Chief Executive Officer\n\nOur turnaround will be going on for some time still cycle because we -- there's quite a number of issues that we are addressing in Bolivar to bring it to the required efficiency. In terms of what changes we have during the year is basically that we are moving from the Bolivar West zone, which is pretty much depleted. There is only some recovery areas into the new Bolivar Northwest zone for the bulk of the production. So as we move into Bolivar Northwest, we can develop that area, we can increase production from it.\n\nAnd we are adding to the production from Bolivar Northwest, but we have remaining also from the [Inaudible], the areas that we have from [Inaudible]. So that's going to go on for some time as we can bring more and more production from Bolivar Northwest. Eventually next year, we will be able also to develop an area called Penalita, which is further up from Bolivar Northwest. So by next year, we should have both Bolivar Northwest and Penalita driving most of our production and with better grade than what we have now.\n\nThis takes time because of the nature of the business of developing the tunnels and the [Inaudible] construction. Now, when we talk about uncertainty, we are referring to the resource categories that we're working with. You are aware we have quite a large part of our resource in the inferred category. So as we move from infer -- we have a very [Inaudible].\n\nAs we move from infer to indicate it to measure, then we have more certainty. But in that process, we are still mining. So we are in this transition to get into the position where we get more certainty into the resources that we mine, but this has all sorts of ramifications in what we do. So that's what we refer in terms of uncertainty.\n\nHeiko Ihle -- H.C. Wainwright -- Analyst\n\nBuilding on the last question a bit. Now, listen, I mean, you know we love Yauricocha and think it's a great asset. So I'm really sorry to keep picking on Bolivar here. But just looking at the guidance that you put out, so you essentially cut guidance in half with really only a decent upside for Q2.\n\nAt the midpoint, you're implying 15 million tonnes of copper equivalent, so then deducting the 6.8 million that you have in the first half, you're looking at a 21% growth rate, given that you need 8.2 million obviously. That's actually pretty good and it leads to two questions that build on my prior one. What's the mental planning looking like for next year? And what do you think this asset could realistically do once all your transformational changes and whatnot are completed in a couple of years? In other words, how do you think the analyst community should look at the asset longer term?\n\nLuis Marchese -- Chief Executive Officer\n\nI think it's going to be much better than what we have now, Heiko. We are going to move into a Penalita, which has better grades. We are looking at increasing the throughput, reaching 5,000 tonnes per day. And then, if appropriate we can expand it into 6,000 tonnes per day.\n\nAs I said our turnaround product is also focusing on improving efficiencies and productivity and by adding the higher grade infrastructure that the mine requires, saving facilities, the integration tunnel, the drainage, ventilation and the rest. So as we move to the future, we should have a fairly more efficient mine operation with better grade than what we have now operating at full capacity, but we are still some time from that. The other obvious side of the equation here is that we've had a hit on the price, as I highlighted during my presentation. The drop has been over 20% in most of our metals.\n\nSo that's taking flexibility out of how we do this process into the new position, operating position. So we're looking at other options to manage this transition more effective and carrying this reduced flexibility and reduce options on the way forward.\n\nHeiko Ihle -- H.C. Wainwright -- Analyst\n\nThat's very helpful. I appreciate and get back in queue.\n\nLuis Marchese -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Mark Reichman from NOBLE Capital Markets. Your line is now open. Please go ahead.\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nThank you. I guess, on the bright side, with the delay at Bolivar, you might be bringing new production on in a better pricing environment in a couple of years. But my question is really would you elaborate on the security situation at Bolivar that you mentioned earlier and its impact on operations and your mine development initiatives?\n\nLuis Marchese -- Chief Executive Officer\n\nYes. Thank you for that question, Mark. A couple of months ago, there was a very -- in nearby Bolivar, being a town called Serrocavi, which is between Bolivar, it's like one hour from Bolivar and it's on our access road pretty much to the mine, a local [Inaudible] is being blamed for having killed two 80-year-old Jesuits together with a couple of local residents. This has been certainly a major issue that has highlighted the security issue that we've been facing over time in the area.\n\nWhat has happened after that is that now we have a very strong military police present in the area, over 1,000 officers. And this has obviously impacted the way we operate. We've got to be very careful on our -- on the movement of our people, our suppliers and contractors. And for a few days, when this happened, it also impacted our operations because we certainly couldn't move some of our concentrate, for example, for all security issues.\n\nSo that -- now it's better, but it's still ongoing. So that's something that we addressed very seriously, and we have a plan in place. And we are talking with the authorities and they have been quite supportive. But it still is an ongoing issue, less risky than when it happened, but it's still something that we have to check securities.\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nOK. And then, just on the deferral of the $10 million of the capital expenditures. I understand that that will help you in terms of financial flexibility. But does that delay the ramp-up at Bolivar in terms of turnaround? Or do you think it's just better times -- it's a better time to the ramp up? In other words --\n\nLuis Marchese -- Chief Executive Officer\n\nReich, in terms of the ramp up --\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nThe expenditures that you are delaying.\n\nLuis Marchese -- Chief Executive Officer\n\nThis isn't time to ramp-up. Mark, we don't have some idle capacity.\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nYes.\n\nLuis Marchese -- Chief Executive Officer\n\nI'm sorry. We don't have --\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nOK. OK. No, that's helpful. Yeah.\n\nYeah. Thank you. Thank you very much.\n\nLuis Marchese -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Our final question comes from the line of Lee Cooperman of Omega Family Office. Your line is now open. Please go ahead.\n\nLee Cooperman -- Omega Advisors -- Analyst\n\nTwo questions and a suggestion. Question No. 1, do you have any concern about your financial solvency, the ability to pay all your bills? And question No. 2, as a best guess with all the moving prices, you have any kind of sense of what the capability of producing EBITDA is in 2023, assuming present prices? And my suggestion to get the other way is most brokerage firms charge you $0.01 per share to trade stocks and the price of stock is very, very low relative to the cost of commissions.\n\nAnd I would suggest that the company consider a reverse split and put us back in the world of respectability. So the first two questions, any comments on, please?\n\nEd Guimaraes -- Chief Financial Officer\n\nHi, Lee, it's Ed. So to address your first question on solvency. There are no going concern uncertainties at this time with our expected production and cash generation over the next 12 to 15 months. We're still focused very much on the turnaround plan at Bolivar.\n\nWe have gone out and secured more lines of credit to help should those -- should the production estimates fall off from that. We have recently seen a strengthening in the metal prices environment from the lows that we saw in June. So that's all helpful. But to answer your question No.\n\n1, no. And as far as question No. 2, we're in the process of revising our life of mine plans. So I'm reluctant to comment on 2023 EBITDA until we have our strategic meetings and complete our 2022 budget.\n\nLee Cooperman -- Omega Advisors -- Analyst\n\nOK. And you have an attitude about the suggestion of a reverse split?\n\nEd Guimaraes -- Chief Financial Officer\n\nI think we should be looking, considering all options here and that's certainly something we're looking at. Internally, we have talked about it, and it's one to do something like that. Right now I think it would be better to do something like that on a more positive uptrend is when we can really show the turnaround taking place. My concern with doing a reverse split now when you still potentially haven't come, but we're not out of it yet with Bolivar, and that could even cause a further share price decline subsequent to the reverse split.\n\nBut it is something we're looking at for sure.\n\nLee Cooperman -- Omega Advisors -- Analyst\n\nOK.\n\nOperator\n\nThank you. We have a follow-up question from Mark. Your line is now open. Please go ahead.\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nYeah. Thank you. I just wanted to know if you could just kind of touch on that mark-to-market adjustment on the unsettled open sales position? And how can you kind of manage that? And would you -- how much of that would you expect to realize?\n\nEd Guimaraes -- Chief Financial Officer\n\nThanks, Mark. So we have -- with our off-takers, we have potentially sales positions where once we deliver the concentrates, so that's the -- at the port, they have the option to either pay us either one month out or four months out and they've been choosing to pay between three to four months out. So you do have that exposure. And given the significant declines from March to June, we had copper dropped 24% in that period.\n\nZinc and silver were also around 20% margin. So it's an accounting adjustment essentially where they haven't finalized, it's just the mark-to-market as of June 30. These have somewhat reversed themselves subsequent to June 30, but it's a point in time, Mark. So that should -- some of that should be reversed should metal prices continue where I see them or even where they are now, you get a reversal of that $11 million coming in Q2.\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nOK. Well, that's very helpful. And then, just to follow-up on that. Is that a change in behavior that you've seen from that one month versus the three to four months out? Is that -- are they just choosing to do that because of the uncertainty? Or do you think that's becoming more normal?\n\nEd Guimaraes -- Chief Financial Officer\n\nI can't really speak --\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nOr is [Inaudible] for you.\n\nEd Guimaraes -- Chief Financial Officer\n\nYeah. I can't speak on behalf of the traders and their views on that, Mark.\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nOK. Well, thank you very much. That's helpful.\n\nEd Guimaraes -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThnak you. As there are no more questions registered at this time, I'd like to hand the conference call back over to the management team for closing remarks.\n\nChristiana Papadopoulos -- Manager, Investor Relations\n\nThank you, operator. That concludes today's call. On behalf of the management team, I'd like to thank all participants for joining us today. A replay of the webcast and all materials can be found on our website at sierrametals.com.\n\nIf there are any further questions or concerns, you may reach out to us after today's call. Our contact information can be found in today's presentation, as well as on the company's website. Thank you, operator. Please conclude the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChristiana Papadopoulos -- Manager, Investor Relations\n\nLuis Marchese -- Chief Executive Officer\n\nEd Guimaraes -- Chief Financial Officer\n\nHeiko Ihle -- H.C. Wainwright -- Analyst\n\nMark Reichman -- NOBLE Capital Markets -- Analyst\n\nLee Cooperman -- Omega Advisors -- Analyst\n\nMore SMTS analysis\n\nAll earnings call transcripts"
}