{
  "companyName": "Snowflake",
  "companyTicker": "SNOW",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/snowflake-snow-q3-2023-earnings-call-transcript/",
  "content": "Snowflake (SNOW 0.81%)\nQ3 2023 Earnings Call\nNov 30, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and thank you for attending today's Snowflake Q3 fiscal 2023 earnings conference call. My name is Austin, and I will be your moderator for today. [Operator instructions] I would now like to pass the conference over to our host, Jimmy Sexton, head of investor relations with Snowflake. Jimmy, please go ahead.\n\nJimmy Sexton -- Head of Investor Relations\n\nGood afternoon, and thank you for joining us on Snowflake's Q3 fiscal 2023 earnings call. With me and both in Montana are Frank Slootman, our chairman and chief executive officer; Mike Scarpelli, our chief financial officer; and Christian Kleinerman, our senior vice president of product, who will join us for the Q&A session. During today's call, we will review our financial results for the third quarter fiscal 2023, discuss our guidance for the fourth quarter and full year fiscal 2023, and discuss our fiscal 2024 outlook. During today's call, we will make forward-looking statements, including statements related to the expected performance of our business; future financial results, strategy, products, and features; long-term growth; and overall future prospects.\n\nThese statements are subject to risks and uncertainties, which could cause them to differ materially from actual results. Information concerning those risks is available in our earnings press release distributed after market close today and in our SEC filings, including our most recently filed Form 10-Q for the fiscal quarter ended July 31, 2022, and the Form 10-Q for the quarter ended October 31, 2022, that we will file with the SEC. We caution you to not place undue reliance on forward-looking statements and undertake no duty or obligation to update any forward-looking statements as a result of new information, future events, or changes in our expectations. We'd also like to point out on today's call, we will report both GAAP and non-GAAP results.\n\nWe use these non-GAAP financial measures internally for financial and operational decision-making purposes and as a means to evaluate period-to-period comparisons. Non-GAAP financial measures are presented in addition to and not as a substitute for financial measures calculated in accordance with GAAP. To see the reconciliations of these non-GAAP financial measures, please refer to our earnings press release distributed earlier today in our investor presentation, which are posted at investors.snowflake.com. A replay of today's call will also be posted on the website.\n\nWith that, I would now like to turn the call over to Frank.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nThanks, Jimmy, and good afternoon, everybody. Snowflake continues to drive strong growth at scale, coupled with strengthening unit economics, operating profit, and free cash flow. While we acknowledge the weakening global macro context, we remain resilient in terms of our results. We believe this resilience reflects the importance of data strategy in modern enterprises and institutions.\n\nData is becoming deeply ingrained in how global enterprises think, act, decide, and strategize. Relying on anecdotal observations will increasingly take a backseat to data-driven operations. The company is reporting 523 million in product revenue, growing 67% year on year. Our remaining performance obligations, or RPO, grew 66% year on year to 3 billion.\n\nOn a non-GAAP basis, product gross margin came in at 75%, operating margin at 8%, and adjusted free cash flow margin at 12%. Snowflake's Data Cloud strongly resonates in large enterprises and institutions. The idea of getting your data siloed again in the public cloud stack holds limited appeal. Data Cloud maximizes the power and promise of data science and artificial intelligence, a high priority in the modern enterprise.\n\nIn the quarter, we added 28 Global 2000 customers. Product revenue from the Global 2000 outpaced the company as a whole, growing 14% quarter over quarter. Global 2000 customers now represent over 40% of revenue. Our mission is the Data Cloud, a single data universe across geographies, data sources, compute clouds, and cloud regions; a single point of inquiry, analytics, and intelligence; maximum enablement of data sciences, analytics, and intelligence.\n\nToday, Snowflake operates across 37 regional deployments. Year over year, we've expanded our footprint by more than 30%. Customers are embracing this division. Twenty-two percent of the customers have at least one stable edge, up from 17% a year ago.\n\nSixty-six percent of customers with over 1 million in trailing 12-month product revenue have at least one stable edge. Snowflake's marketplace listings grew 11% quarter over quarter, now with more than 1,700 data listings. Our strategy is a global data sharing network, coupled with unlimited workload enablement. Work needs to find its way to the data instead of the historical habit of moving data to the work.\n\nMuch of the work in the announcements you've seen from Snowflake in recent years reflects our progress in and across the workload spectrum from data engineering to data warehousing to data science to data applications and transaction processing. We recently announced the general availability of Python for Snowpark. This is foundational for many workloads and user types. Global 2000 customers, Charter Communications, EDF Energy, and Northern Trust have adopted Snowflake for Python.\n\nEarlier next year, we will offer native Streamlit integration in private preview. With Streamlit, we're helping developers and data engineers build applications in Snowflake. Since acquisition, the Streamlit community has grown more than 60% and now has approximately 70,000 developers. We're enabling data science workloads with Snowpark optimized work houses -- warehouses, now in public preview.\n\nOptimized warehouses represent a step function improvement for compute-intensive workloads and allow customers to bring ML training into Snowflake. In Q3, we hosted our Data Cloud World Tour, which brought our product announcements to a global audience. We traveled to 18 cities across 12 countries and reached over 12,000 attendees. In November, we hosted our annual developer conference, BUILD.\n\nA virtual kickoff at over 4,000 attendees and local breakouts are scheduled in 16 cities across 10 countries. Aside from world-class scale performance and economics, Snowflake differentiates with a relentless focus on enterprise-grade high trust implementation. Our security and compliant capabilities enable the largest enterprises and institutions worldwide to deploy Snowflake for the most critical use cases and applications. The privacy and compliance, of course, have become far greater challenges in recent years and created new challenges in data operations.\n\nFor example, our data clean room operations, which originated in the world of advertising, are now spreading to other vertical industries. Snowflake continues to deepen and strengthen its industry orientation. We expect to understand our customer challenges, solve their problems, and speak their language. Leading industries for Snowflake are financial services; advertising, media and entertainment; followed by retail and consumer packaged goods, technology, and healthcare and life sciences.\n\nIn Q3, product revenue from the financial services industry grew 13% quarter over quarter. From financial services clients, the Depository Trust & Clearing Corporation, or DTCC, recently announced their use of Snowflake Marketplace. Providing clearing and settlement services, DTCC has access to a vast amount of training data. DTCC allows clients to engage with its data through Snowflake to better understand market liquidity and investor sentiment.\n\nDuring the quarter, at advertising week, we announced an investment in OpenAP, the advanced advertising company. This will accelerate the development of the OpenAP Data Hub, which is a new cross-publisher and cross-platform clean room solution for the television industry by Snowflake. Addition of Snowflake validates the commitment FOX, NBCUniversal, Paramount, and Warner Bros Discovery have made to transforming the TV ad industry. We are aware of the weakening macro economy.\n\nCustomer behavior informs our outlook and investment approach. In Q3, we demonstrated our ability to execute through different economic environments. Our focus remains on revenue growth, balanced with free cash flow generation. We are well positioned to drive efficient and durable growth, which Mike will discuss further.\n\nThe opportunity ahead is massive and will take years to unfold. With that, I will turn the call over to Mike.\n\nMike Scarpelli -- Chief Financial Officer\n\nThank you, Frank. Q3 product revenues were $523 million, representing 67% year-over-year growth. And our remaining performance obligations grew 66% year over year, totaling $3 billion. Of the $3 billion in RPO, we expect approximately 55% to be recognized as revenue in the next 12 months.\n\nThis represents a 68% increase compared to our estimate as of the same quarter last year. Our net revenue retention rate of 165% includes 14 new customers with $1 million in trailing 12-month product revenue and reflects durable growth among our largest customers. With a focus on the acquisition and growth of the largest enterprises in the world, we added 28 Global 2000 customers in the quarter, our largest quarterly addition in the last five periods. We have confidence in our growth opportunity in these accounts because G2K customers only represent 1.3 million of trailing 12-month product revenue on average.\n\nThis compares to an average of $3.7 million among customers over 1 million in product revenue. We will continue to grow these accounts through value selling and workload enablement. We are seeing this in our largest accounts today. Quarter over quarter, six of our top 10 customers grew faster than the company overall.\n\nWe are monitoring our key business metrics, which we believe are leading indicators of the macro economy impacting our business. In the quarter, we saw varying degrees of strength and weakness worldwide, making it challenging to identify a consistent trend. Our largest segments, North America and EMEA, outperformed SMB and APJ. The strength in North America includes the headwind from the consumer internet companies we mentioned earlier this year.\n\nThis shows the resiliency of Snowflake as enterprises continue to prioritize data operations. Taking a closer look at specific industries, financial services, our largest vertical, grew faster than the company overall, while advertising and media entertainment grew slower. Technology as a sector underperformed in the quarter. Each geography and vertical had unique circumstances in the quarter, which will always happen with the consumption model.\n\nWith that being said, Q3 results reflect strong consumption overall. While we did experience a foreign exchange revenue headwind in the quarter, less than 5% of our revenue is invoiced in currencies other than the U.S. dollar. At the moment, we do not evaluate our business on a constant currency basis, given the immateriality.\n\nNow, turning to margins on a non-GAAP basis. Our product gross margin was 75%. Scale in our public cloud data centers and continued growth in large customer accounts contributed to year-over-year gross margin improvement. Operating margin was 8%, benefiting from revenue outperformance and favorability on headcount and marketing spend.\n\nOur adjusted free cash flow margin was 12%, positively impacted by strong collections. We ended the quarter in a strong cash position with $4.9 billion in cash, cash equivalents, and short-term and long-term investments. Now, let's turn to our guidance. We remain committed to driving toward greater profitability.\n\nWe are focused on revenue growth through expanding operating and free cash flow margins. Over the past six weeks, we have seen weaker consumption in APJ and SMB segment. However, recent consumption patterns give us confidence that our largest and most strategic customers will continue to grow. With the holidays approaching and uncertainty with how customers will operate, we believe taking a more conservative approach is responsible as we resource plan for Q4 and fiscal 2024.\n\nEven with slower-than-expected growth, we are committed to generating meaningful free cash flow. For the fourth quarter, we expect product revenue between $535 million and $540 million, representing year-over-year growth between 49% and 50%. Turning to margins. We expect on a non-GAAP basis, 1% operating margin.\n\nAnd we expect 360 million diluted weighted average shares outstanding. For the full fiscal year 2023, we expect product revenues between $1.919 billion and $1.924 billion, representing year-over-year growth between 68% and 69%. Turning to profitability. For the full fiscal year 2023, we expect, on a non-GAAP basis, approximately 75% product gross margin, 3% operating margin, and 21% adjusted free cash flow margin.\n\nAnd we expect 359 million diluted weighted average shares outstanding. Year to date, we've added over 1,500 net new employees. We view the current hiring market as favorable for Snowflake, and we'll continue to focus hiring in product, engineering, and sales. While we are currently in our planning cycle, we would like to discuss next year's growth outlook based on the consumption we are seeing today.\n\nFor the full fiscal year 2024, we expect product revenue growth of approximately 47% and non-GAAP adjusted free cash flow margin of 23% and continued expansion of operating margin. This outlook includes a slowdown in hiring, which we evaluate on a monthly basis, but assumes adding over 1,000 net new employees. Our long-term opportunity remains strong, and we look forward to executing. With that, operator, you can now open up the line for questions.\n\nOperator\n\n[Operator instructions] Our first question is with Raimo Lenschow from Barclays. Raimo, your line is open.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nHey. Thank you. Congratulations on [Technical Difficulty] and especially the cash flow. My question was, as you think about next year, how should we think about existing customers versus new customers? You obviously had a record new customer adds.\n\nWhat are you seeing in terms of customers' willingness to do it like normally in the olden days in, you know, people would stay with the incumbent in tough times and just gotten down the hatches, etc. It seems to be different for you. So, could you speak a little bit of what you're expecting for new customers and existing customers in that guidance? Thank you.\n\nMike Scarpelli -- Chief Financial Officer\n\nYes. Well, Raimo, in terms of -- from a revenue perspective, most of the revenue is really driven by our existing customers because it takes customers time to get their data into Snowflake and ramp up production. But with that said, we're still very much focused on landing new customers. It's not really the quantity.\n\nIt's the quality of new customers. We tend to focus very much on the largest enterprises. And Global 2000 is one of the metrics that we give, but it's not just Global 2000. It's large public sector clients, as well as a lot of the big private companies in the world as well, too.\n\nAnd so, we're going to continue to do that. And as you can see by the Global 2000, they're still willing to do -- bring in new vendors.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is with Kirk Materne from Evercore. Kirk, your line is open.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nYeah. Thanks very much. You know, Mike, you mentioned that there weren't any patterns to decipher just given you guys are across a number of different verticals and geographies. But I was curious -- you know, and the verticals that are doing well, like financial services and the like.\n\nAre you starting to see that the network effects that come along with Snowflake are really helping, you know, those verticals do well despite the macro backdrop. It's just interesting to note that your stable edges are up. And I expect, you know, those verticals where you've really built out, you know, industry-specific functionalities playing out and perhaps those customers are able to grow faster, you know, just because they're more locked in, you know, across the entire industry. Can you just talk about that? Thanks.\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. Well, I'll start and then I'll let Frank. Well, clearly, the network effect is important, and we really do see that in financial services, which have the biggest concentration of stable edges. And you can see that in the outperformance of financial services.\n\nBut definitely, we are seeing the network effect. And it's really the data sharing is one of the things that -- things that is driving that.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nYes. The other thing, Kirk, is every industry has its own unique set of, you know, dynamics that we're calling, in other words, you know, things that are driving data networking relationships, you know, between entities. For example, in healthcare, it's through relationships between payers and providers in media and entertainment. There's enormous amount of data sharing going on there in terms of consumer packaged goods, the advertisers, retailers and so on.\n\nSo, they're all a little different. As Mike said, financial is very much driven by the fact that historically in financial services institutions are pumping massive amounts of data around every single night to all these different destinations, especially in asset management and subsectors, you know, like that. So, we really view -- I mean, data networking plays out differently in every industry sector and subsector, but they become -- there's a lot of data gravity is what we call it that starts to happen that benefits us enormously. It really lowers the friction of getting access to new accounts, and you see that very pronounced in verticals like financial services.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is with Keith Weiss from Morgan Stanley. Keith, your line is open.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThank you for taking the questions. This is Sanjit Singh for Keith. I wanted to go back, Mike, to some of the guidance framework that you laid out for us, particularly with respect to fiscal year '24. I think you talked about 47% growth.\n\nIs there any way you can sort of draw the bridge for us in terms of next quarter you're guiding to think about 49% at the high end; and then for the full year next year, you know, approximately 47%. What sort of gives you the confidence that, you know, your Q4 exit growth rate is going to be durable going into next year?\n\nMike Scarpelli -- Chief Financial Officer\n\nSure. Well, I'll say Q4 is -- it is a quarter that has a lot of holidays in it. And we do think we've lived through COVID that people are traveling more. And there is a big human component as well, too.\n\nSo, we all along have been forecasting that Q4, we'd see the impact of that. But we also have a number of significant customers that we have signed up, that we see them ramping up next year on Snowflake, as well as some of the things we're doing with Snowpark with Python. We're starting to see traction in that as well, too. But we think that's going to be more of a 2024 impact.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nMakes total sense. And then, I was wondering if you could give us a little bit of sense of the consumption, the cohorts and how they're sort of behaving. So, you've talked, you know, quite positively about the top 10 customers. And obviously, new customers don't contribute even though that's coming in at a very fast clip.\n\nBut, you know, if we strip out just the top 10 customers and the new customers, that sort of core customer base, how has those underlying expansion trends materializing over the quarter and as we've gotten past the October quarter into November, December, what are some of the underlying trends for the core of the business outside of the top 10?\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. Well, let me clarify something on the top 10. When I said six are growing faster than the pace of the company, we actually have three that actually sequentially were down in the quarter, which was expected. And those are some of those companies we talked about early in the year, and they're all in the technology sector that wouldn't surprise you if you knew their names.\n\nBut what I will say is we continue to see strength, in particular, in financial services, the advertising and media space. Where we do see weakness is we do see weakness in APJ. And a lot of that has to do with the fact the FX is really impacting them. And then you do see weakness -- I didn't see it in the bookings but in consumption in the more of the SMB customers.\n\nWe do see that as we call them our corporate accounts, but these are the 500 or less employees. And I definitely did see some consumption weakness. But I want to stress, I didn't see they need bookings that they have that added RPO, but definitely out of consumption.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThat's super helpful. Thank you. I really appreciate it. Thanks.\n\nOperator\n\nOur next question is with Alex Zukin from Wolfe Research. Alex, your line is open.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for taking the question. So, I guess if I -- it sounds like there's a lot of nuance across a lot of different industries and customer sizes and geographies. If we think about the guidance for next year, are you guiding to -- you mentioned the guide for next quarter, it's prudent to assume a more riskier or a more prudent scenario around the continuation of macro trends.\n\nWhat are you assuming for next year? Is there a linearity where you're assuming a second half better than the first half or continuing to get worse? Walk us through some of the puts and takes around that guidance trajectory.\n\nMike Scarpelli -- Chief Financial Officer\n\nI'm factoring in that we're going to continue to stay consistent where we are right now through the balance of next year. And if the things turn around, that's upside for us. And as I said, this is just as we're doing planning right now, we're not expecting things to change. And I really don't know and probably maybe you have a better sense, but all I can do is forecast based upon what we see today.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nGot it. And for some of the customers or cohorts that you're seeing where like they're sequentially declining, are you starting to see kind of we're working with them around a new baseline? Like, basically, when do some of these optimization patterns, you know, kind of rebase and start growing in some of these new areas like Streamlit and others that you're out there in the market with?\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, what I would say is these are three customers that's unique to them with the challenges that they've been placing or had in their businesses that have been pretty public. And I think one of the reasons why as I said, technology has underperformed. We are seeing a lot of technology companies you're hearing in the news that are either freezing, hiring, or cutting headcount, and they're definitely looking to optimize on cost. But these three customers, in particular, I think we're at their baseline right now.\n\nAnd as long as their business is kind of stabilize and grow, then we'll see some growth out of them, but I'm not factoring any growth in them this quarter.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. Thank you, guys.\n\nOperator\n\nOur next question is with Brad Zelnick from Deutsche Bank. Brad, your line is open. Brad Zelnick from Deutsche Bank, your line is open. You may proceed.\n\nMike Scarpelli -- Chief Financial Officer\n\nOK. Next.\n\nOperator\n\nOur next question will be with Gregg Moskowitz from Mizuho. Gregg, your line is open.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nOK. Thank you for taking my question. Congratulations on delivering very healthy product revenue in this environment. My question relates to Q4, where, obviously, the product revenue guidance was below where consensus was.\n\nAnd I'm curious, how much of this, Mike, is a reflection of a moderation in consumption in the month of November or over the last six weeks, as you said, in APJ and across the SMB, as opposed to embedding more conservatism amid the existing macro uncertainty. Would you say it's tilted more toward one versus the other?\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, the way we do our forecast is based upon historical performance, and we definitely did see a slowdown in the month of October. Not that dramatic, but we typically would see week-over-week growth. And we saw a number of weeks where it was pretty flat. I will say November is starting to tick back up again, and that's all factored into the guidance, given the macro backdrop we have right now.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question is with Simon Leopold from Raymond James. Simon, your line is open.\n\nVictor Chiu -- Raymond James -- Analyst\n\nHi. This is Victor Chiu in for Simon. Previously, your commentary seemed to imply that slowing consumption in a weaker macro environment would be more concentrated around customer groups or verticals. Is that still the case? It seems that that's still the case.\n\nI just want to confirm. And, you know, what, I guess, has changed versus your expectations in the past? You know, what kind of trends are you observing that are kind of falling out of what you were expecting previously?\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, to be clear, it hasn't changed that much from what we've been expecting all year. And as I said, there are certain verticals that are not performing as well, technology being one of them, that we mentioned from where we were six months ago. Financial services, doing extremely well and expect that to continue. Actually, we landed a very nice deal in the financial services sector that that customer will ramp in the second half of next year and will be a meaningful customer, will be a top 10 customer one day.\n\nAnd the other area that, as I mentioned, is doing very, very well, is the whole advertising media space. And a lot of that is driven by our clean room technology and what we're doing there as well, too. I would say the only thing that's really changed this quarter, and it's a very small piece of our overall revenue is the SMB segment. You're really seeing a slowdown in consumption by those customers.\n\nIt's not going away, but it's just not growing like it was at the pace of growth. And same with APJ. But the U.S. verticals, large enterprises, doing extremely well.\n\nVictor Chiu -- Raymond James -- Analyst\n\nOK. That's helpful. And I guess can you just give us an update around some of your new initiatives like Snowpark and unstructured data and just kind of the traction and progress you're having with those initiatives?\n\nChristian Kleinerman -- Senior Vice President, Product\n\nSure. Christian Kleinerman here. Snowpark saw GA in November 7. And as a percentage of customers that are evaluating the technology, it's a very healthy rate.\n\nThe consumption has not yet materialized because they're planning premigration doing POCs, etc., but it's quite promising. And as Frank mentioned, Streamlit will be in private preview at the beginning of the year, which we also think will have a good number of interesting use cases to our customers.\n\nVictor Chiu -- Raymond James -- Analyst\n\nThat's helpful. Thank you.\n\nOperator\n\nOur next question is with Kamil Mielczarek from William Blair. Kamil, your line is open.\n\nKamil Mielczarek -- William Blair -- Analyst\n\nYou've done a great job growing the sales force this year, the pace of hiring seems to have accelerated in the quarter. Can you talk about where you're focusing incremental investments? And should we expect these new hires to begin to contribute in fiscal '24 to revenue? Or will the impact to come in 18 to 24 months, given the time it takes for new customers around?\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, we're very much focused this year on our hiring and our sales force to go into existing markets. We're not opening many new territories this year, and it's really to go deeper into core markets, both verticals, North America; but in particular, Germany, France and the U.K., as well as Australia and Japan and APJ. And we do believe these people will be contributing to bookings more in the second half of next year. And remember, when a booking comes in, it takes a while before you really start to see meaningful revenue from those customers.\n\nGenerally, it's a six-month lag before they really ramp up.\n\nKamil Mielczarek -- William Blair -- Analyst\n\nThat's helpful. And just a quick follow-up. Can you update us on the competitive environment? Are you seeing any changes, particularly on the product side?\n\nMike Scarpelli -- Chief Financial Officer\n\nSorry, I didn't quite get that. Update on what?\n\nKamil Mielczarek -- William Blair -- Analyst\n\nThe competitive environment?\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nIt's Frank. You know, I would say that the competitive dynamic, you know, is substantially unchanged. You know, we're -- I think the balance of partnership versus competition shifts, you know, marginally from one period to the next. I think we've set publicly that, you know, our partnership with AWS Amazon has been incrementally stronger and less competitive over time and that continues.\n\nMicrosoft has been healthy and with Google GCP, you know, has been about the same. Most of our competitive reality, if you will, is really dominated by the public cloud companies, and that's been true, you know, for as long as we've been here.\n\nKamil Mielczarek -- William Blair -- Analyst\n\nThat's helpful. Thanks again.\n\nOperator\n\nOur next question is with Derrick Wood from Cowen & Company. Derrick, your line is open.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGreat. Thanks. I always like that you guys highlight the average G2K spend, I think you said it was 1.3 million. As you look at other companies that are more mature, have larger revenue scale, or even as you look at your own more mature customers, what do you think the longer-term level of spend out of an average G2K customer could be down the road? And then, I guess, more specific to the quarter, you did have a strong G2K add, strongest in five quarters.\n\nAre you seeing any pickup in migration activity or anything to call out in terms of strength this quarter?\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. I'll just say on the G2K, there's no reason why a G2K can't spend well north of $10 million a year on Snowflake, and that's a conservative number. But it will take time to get there. This is really a marathon.\n\nIt's not a sprint for our customers, and it will take time. And we are starting to see very large customer relationships. We did sign a $100 million contract in the quarter, again, with an existing customer on renewal. And we will have $100 million plus contracts this quarter in Q4 with customers that I know are running out of credits and want to lock in for long term.\n\nSo, it's just going to take time to grow these customers. Just like it took us, I think Capital One is one of our -- is our largest customer. It's taken them 5.3 years to get to where we are now. Most of our top 10 customers, with the exception of one, have all been 4.5, five-years-old customers to get into that top 10.\n\nAnd we think that trend will continue, that it will take customers that long to ramp to get to those sizes. And then, sorry, Derrick, what was the second part of your question?\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nJust the strength in the G2K adds in the quarter and if there was anything to call out, if you're seeing perhaps a pickup in kind of legacy migration activity.\n\nMike Scarpelli -- Chief Financial Officer\n\nNo. What I want to remind you, though, too, is selling into a Global 2000 is not a one- or two-quarter event. These are one- to two-year sales cycles. So, it wasn't surprising to us that we landed these.\n\nWe've been working on these for quite some time, just like we have a very healthy pipeline of one for all of next year. What quarter they'll land in is really hard to say. But even if I land them, it takes me six, nine months to ramp them.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nRight.\n\nMike Scarpelli -- Chief Financial Officer\n\nBut we're very focused on those, and we know who they all are, and we have reps assigned to them.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGreat color. Thanks.\n\nOperator\n\nOur next question is with Sterling Auty from SVB. Sterling, your line is open.\n\nSterling Auty -- SVB Leerink -- Analyst\n\nHi. I'm just wondering with the macro uncertainty, if you're seeing any customer behavior changes in terms of the type of data that they're ingesting or even if they modify and reduce some of the data ingestion that maybe they were doing previously.\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nThis is Frank. Not really seeing that. We have done a lot of traveling during the quarter inside and outside the country. You know, and I think one of the sentiments that I want to mention is, you know, that we're sort of past sort of the bleeding edge earlier adopter class customers that we have acquired over the last, whatever, five, six, seven years.\n\nAnd, you know, we're now into the people that didn't sign up early on. And their overriding sentiment is a sense of somewhat a fear of missing out. And they're looking at us like we can't be left behind, help us catch up. And a lot of times, the challenges around that are based on their ability to harness the technology in terms of the skills and the expertise.\n\nSo, in other words, our mix of tools is going to evolve to really help customers address that gap because of anything they want to accelerate, they want to lean in, they want to move faster. They literally overriding sentiment is we're afraid to be left behind. This is how important this is. And they are clearly identifying what they think is holding them up in terms of getting there.\n\nSterling Auty -- SVB Leerink -- Analyst\n\nMakes sense. Thank you.\n\nOperator\n\nOur next question is with Brad Reback from Stifel. Brad, your line is open.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. Mike, as we think about the macro backdrop, what, if any, impact should we expect for that to have on an RPO in 4Q?\n\nMike Scarpelli -- Chief Financial Officer\n\nI don't see it having a big impact on Q4 based upon the pipeline of deals and knowing the number of customers I know are running out of credits. And I should say, from a current RPO, the big question is whether customers in this environment will do multiyear deals or just choose to renew for one year, which they have the option to do as well, too. But with that said, I know Q4 will always be our largest addition to RPO. And based upon all the sales calls that we have, I feel pretty good about that right now where we're sitting.\n\nBut obviously, there's still two months left in the quarter.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nGot it. Thanks very much.\n\nOperator\n\nOur next question is with Will Power from Baird. Will, your line is open.\n\nWill Power -- Baird -- Analyst\n\nGreat. Thanks. You know, Mike, it was great to see the higher free cash flow guidance, I guess, this year initial expectations for next year. And I guess the longer-term target looks pretty conservative, I guess in light of that.\n\nBut it would be great just to get kind of perspective on kind of the key upside drivers there relative to what you were previously anticipating.\n\nMike Scarpelli -- Chief Financial Officer\n\nWell, part of it is just what we guided to. This year is going to come in where we thought it was going to come in for the second half of the year. But a lot of it is driven by customer consumption with some of our largest customers and knowing the RPO that they have and the timing of when those things are going to get billed. But coupled with the fact that we are slowing our hiring down next year, we're seeing very positive gross margin improvements.\n\nI do think there's more opportunity next year for gross margin improvement, but wait until we guide just based upon some things we're in discussions with the cloud providers. And I feel pretty good about those numbers sitting here right now on our preliminary planning for next year.\n\nWill Power -- Baird -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is with Mike Cikos from Needham and Company. Mike, your line is open.\n\nMike Cikos -- Needham and Company -- Analyst\n\nGreat. Thanks for getting me on, guys. I had a question about the optimization trends that we're seeing from customers and really, it relates to the cohorts here. But given the current macro backdrop, is it fair to think that newer customers who maybe were onboarded in the most recent six or nine months and are on that growth trajectory? Are they at a slower rate versus previous cohorts? Can you elaborate at all as far as what the more recent cohorts are demonstrating from a growth perspective?\n\nMike Scarpelli -- Chief Financial Officer\n\nI really haven't looked at that, but I'm not -- what I will say is customers today, we spend a lot more time with them on making sure they use Snowflake efficiently. And there's a lot more people that have experience with Snowflake that it's -- I think the customers that were growing on Snowflake today that are starting out are much, much more efficient in how they use Snowflake. But I'll turn it over to Christian, who actually talks to a lot of our customers.\n\nChristian Kleinerman -- Senior Vice President, Product\n\nYeah. We're very focused on helping our customers do not go through a cycle of grow, optimize, grow, optimize, but just being a smoother curve all along. And it is, as Mike said, expectation setting, explaining with training and other material, but also product enhancement. And we're seeing that type of behavior, both with existing and new customers.\n\nMike Cikos -- Needham and Company -- Analyst\n\nGot it. And one more house cleaning, if I could -- but sorry, housekeeping, if I could, but can you just remind us what the revenue exposure is from a contribution standpoint from that SMB segment that we have called out?\n\nMike Scarpelli -- Chief Financial Officer\n\nIt's less than 10% -- it's right around 10%.\n\nMike Cikos -- Needham and Company -- Analyst\n\nTerrific. Thank you, guys.\n\nOperator\n\nOur next question will be from Steve Koenig from SMBC. Steve, your line is open.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nGreat. Thanks fort my question, guys. So, your ability to grow revenue 67% year on year in this environment speaks to very strong long-term adoption trends. But I'm wondering more on a short-term basis, if we look at quarter-on-quarter product revenue additions, I think it's kind of gone flattish in Q3 year on year and may go negative next quarter.\n\nSo, I'm wondering, how do you think about planning your sales additions, you know, and maintaining sales productivity? I'm curious about your thought process there. That's all I have. Thanks very much.\n\nMike Scarpelli -- Chief Financial Officer\n\nYeah. I will say in a consumption model, quarter-over-quarter additions is not as meaningful because so much of the consumption is tied to what customers are doing at specific times in their business. And also Q4, as I said, is one that has seasonally higher number of holidays with people taking -- and remember, about 70% of our revenue is tied to human interaction with our system, 30% is really driven by scheduled jobs. So, that has an impact.\n\nBut also, I want to remind you that a lot of the stuff we've been doing around hardware improvements and stuff is really hitting us in Q4.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nOK. Great. Thanks very much.\n\nOperator\n\nOur final question shall be from Brent Bracelin with Piper Sandler. Brent, your line is open.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. Thanks for squeezing me in here. I totally get how consumption could slow here just given some of the challenges in these verticals.\n\nObviously, recessionary headwinds. I'd be curious and more curious to hear the offset to consumption, which is expanding number of use cases. So, do you have any sights or visibility into how in a recessionary environment, customers' appetite to expand either the new departments or expand into data science. Some of our job postings data suggests that there are people aggressively hiring for Snowflake and data science scenarios.\n\nI'd love to get the view here on how quickly over the next year or two you could see use cases drive an offset to consumption?\n\nChristian Kleinerman -- Senior Vice President, Product\n\nYeah. Just having visited with lots of customers during our Data Cloud World Tour, we see pretty high interest on a number of new use cases, Snowpark for data engineering, as well as data science. Cybersecurity is a new workload. We see a lot of interest from our customers.\n\nAnd even though it's a little bit later when to materialize on our end, unit store and the ability to build applications in Snowflake is definitely driving a lot of interest. So, the willingness to expand the use cases seems unaffected by the broader context.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJimmy Sexton -- Head of Investor Relations\n\nFrank Slootman -- Chairman and Chief Executive Officer\n\nMike Scarpelli -- Chief Financial Officer\n\nRaimo Lenschow -- Barclays -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nVictor Chiu -- Raymond James -- Analyst\n\nChristian Kleinerman -- Senior Vice President, Product\n\nKamil Mielczarek -- William Blair -- Analyst\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nSterling Auty -- SVB Leerink -- Analyst\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nWill Power -- Baird -- Analyst\n\nMike Cikos -- Needham and Company -- Analyst\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nMore SNOW analysis\n\nAll earnings call transcripts"
}