{
  "companyName": "Acumen Pharmaceuticals, Inc.",
  "companyTicker": "ABOS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/acumen-pharmaceuticals-inc-abos-q2-2022-earnings-c/",
  "content": "Acumen Pharmaceuticals, Inc. (ABOS 0.56%)\nQ2 2022 Earnings Call\nAug 15, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day. Thank you for standing by, and welcome to the Acumen Pharmaceuticals second quarter 2022 update call. At this time, all participants are in a listen-only mode. There'll be a brief overview followed by a question-and-answer session.\n\n[Operator instructions] Today's call is being recorded. And I would now like to turn the call over to John Woolford from Westwicke. Please go ahead.\n\nJohn Woolford -- Investor Relations\n\nThank you, operator. Good afternoon. Thank you for joining us today to review Acumen's second quarter 2022 update on operational progress and financial results. Before we start, we encourage you to read the operational and financial results press release issued this afternoon, which is accessible on our website in the Investors section.\n\nPlease note that during today's conference call, we may make forward-looking statements within the meaning of the federal securities laws, including statements concerning our financial outlook and expected business plans. All these statements are subject to risks and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. Our actual results could differ materially due to a number of factors, including the extent and duration of the effects of the COVID-19 pandemic, geopolitical events such as the conflict between Russia and Ukraine, related sanctions, macroeconomic conditions, such as risking inflation and uncertain credit and financial markets. Please refer to our recent filings with the SEC for a full review of the risks and uncertainties associated with our business.\n\nForward-looking statements speak only as of the date on which they are made, and Acumen undertakes no obligation to update or revise any forward-looking statements. Daniel O'Connell, president and chief executive officer, will begin today's call with a review of select second quarter 2022 business highlights. Dr. Eric Siemers, chief medical officer, will then discuss the recent development in Alzheimer's disease field and provide an update on the ongoing INTERCEPT-AD trial.\n\nFinally, Matt Zuga, chief financial officer and chief business officer, will provide a brief financial update. We will then open the call for Q&A. I'll now hand the call over to Dan O'Connell, president and chief executive officer. Dan?\n\nDan O'Connell -- President and Chief Executive Officer\n\nThank you, John. Good afternoon, and thank you to everyone joining the call today. I'm delighted to be here to review our second quarter and provide a business update. Picking up from the momentum generated in early 2022, we continue to make progress with our INTERCEPT-AD clinical trial of ACU193, the first monoclonal antibody developed to selectively target soluble a-beta oligomers to enter the clinic.\n\nRegarding site activation enrollment, we are continuing to activate new clinical trial sites. INTERCEPT-AD enrollment is now ongoing at 15 active sites, up from 11 active sites as reported in our first quarter conference call in May. Given our continued progress in the trial, we believe we remain on track to report top-line results in the first half of 2023. In parallel to conducting the INTERCEPT-AD trial, we have also made progress in preparing for future phase 2/3 trial of ACU193, the chronic GLP toxicity study is ongoing, and we expect our new drug substance production process and drug product formulation should be finalized in the near term.\n\nThe phase 2/3 study design and planning for an end-of-phase 2 meeting with the FDA are underway. Our plan is to be prepared to initiate the next trial of potential phase 2/3 trial after the results of the ongoing INTERCEPT-AD trial are available and assuming they demonstrate proof of mechanism. As I highlighted during our last call, we continue to grow the organization and make key additions to the senior leadership position. Most recently, we have appointed Liean Schenck as our VP, head of CMC, who brings to Acumen over 25 years of pharmaceutical industry experience in biologics process development, manufacturing, and CMC project management.\n\nLiean started her career at Lonza Biologics before spending more than 20 years at Eli Lilly and Company in various CMC roles. In her most recent position, she served as head of CMC program management at Novavax. Since 2016, she has been responsible for CMC delivery of three commercial products in connections with these positions. Liean is leading our CMC efforts working closely with Kent Iverson, who continues to serve as a senior consultant on CMC matters.\n\nEnsuring timely and economical clinical drug product for potential late-phase development is a strategic imperative for Acumen and we are confident in Liean and her colleagues' abilities on this front. On a different note, I do want to acknowledge the departure of Dr. Jeff Sevigny, the chief medical officer of Prevail Therapeutics, which recently became a wholly owned subsidiary of Eli Lilly and Company. Jeff has recently stepped off our board as was required by his current employer.\n\nJeff joined Acumen's board in 2019 and has been a major contributor. I want to thank Jeff for his service and support of Acumen over the last three years. He will be missed. Our Nomination and Corporate Governance Committee has initiated a search for a potential new director.\n\nAs many of you know, there are a number of anticipated upcoming clinical and regulatory developments for the novel Alzheimer's disease programs in the coming quarters, including phase 3 data readouts for [Inaudible] bapineuzumab versus gantenerumab and Lilly's donanemab. Two weeks ago, Acumen and others attended the AAIC meeting in San Diego. The meeting served as an informative event to gauge the latest developments in the AD research field. On that note, I'll now turn the call over to Eric to discuss some of these recent developments from AAIC, including our poster on a potential standardized assay for evaluating soluble amyloid-beta oligomers binding properties or monoclonal antibodies.\n\nEric?\n\nEric Siemers -- Chief Medical Officer\n\nThanks, Dan, and good afternoon to everyone. First, I wanted to highlight that Frontier's and Neuroscience published a review article in late April that outlined an extensive rationale for targeting soluble amyloid beta oligomers in early Alzheimer's disease, as well as the preclinical evidence to characterize ACU93 selectivity and differentiated profile. The article is entitled ACU193 and immunotherapeutic poised to test the amyloid beta oligomer hypothesis of Alzheimer's disease. We have observed what we believe to be a broad and emerging scientific consensus that oligomers are the most toxic form of AB and that the development of a product that reduces the toxicity of oligomers, it's one of the most promising approaches for the potential treatment and prevention of the progression of Alzheimer's disease.\n\nAs detailed in the publication, multiple studies suggest that AB oligomer-mediated neuronal toxicity is directly responsible for Alzheimer's associated neurodegeneration, as well as memory and cognitive problems. AB oligomers have been found to interact with brain cells called neurons and more specifically with the synapses that allow neurons to communicate with each other, leading to older neuronal function. Additionally, AB oligomers appear to initiate and perpetuate the process of neurodegeneration, ultimately leading to cell death. At the recent AIC meeting in San Diego, Acumen presented a poster detailing a method designed to assess antibody binding properties using amyloid-derived diffusable ligands or ADDLs.\n\nAs you may recall, ADDLs were used as the antigen leading to the eventual development of ACU193. We believe that the use of ADDLs in the described method to characterize binding properties of ACU193 and other monoclonal antibodies has the potential to advance the field by providing a detailed description of how these experiments could be consistently executed. In addition, we also believe that this is an exciting time in the field of AD research broadly, particularly given the anticipated near-term data readouts expected from other companies in the field. As a quick reminder, ACU193 is unique and differentiated from other monoclonal antibodies studied in Alzheimer's disease, given its high selectivity for AB oligomers relative to other anti-amyloid or anti- AB monoclonal antibodies that are less selective or target different amyloid species such as deposited AB amyloid plaques or AB monomers.\n\nWe hypothesized that the selectivity may lead to improved clinical efficacy compared to other monoclonal antibodies. Importantly, we expect the lack of ARIA-related safety concerns, which are seen with several other monoclonal antibodies. Based on laboratory data in animals, we believe there is a potential for possible cognitive improvement in addition to disease slowing with ACU193 treatment. Given the strong rationale and differentiation, we look forward to reporting top-line data from INTERCEPT-AD in the first half of next year.\n\nAs a reminder, INTERCEPT-AD are randomized placebo-controlled phase 1a/b trial as two portions as is common in drug development, including a single ascending dose portion and a multiple ascending dose portion. The trial design for the single ascending dose portion includes four cohorts with eight patients per cohort at doses of two, 10, 25, and 60 milligrams per kilogram or placebo. The multiple ascending dose portion includes three cohorts to be given three administrations of ACU193, with 10 patients per cohort at doses of 10 milligrams per kilogram and 60 milligrams per kilogram dosed every four weeks and 60 milligrams per kilogram dosed every two weeks or placebo. For each of these cohorts, two patients are to be given placebo, which will be pooled for data analysis.\n\nIncluded in the trial design is the ability to initiate the first cohort of the multiple ascending dose portion, assuming positive safety and tolerability in the second cohort of the single ascending dose portion. The trial is being conducted in patients with what is now frequently termed early Alzheimer's disease. In other words, those with mild cognitive impairment or mild dementia due to Alzheimer's pathology. To participate in the trial, patients must be amyloid positive as determined by test scans.\n\nA key objective of the trial is to demonstrate target engagement and proof of mechanism as determined by demonstrating that ACU193 is bound to oligomers in cerebrospinal fluid. Other important objectives include the evaluation of safety and tolerability, pharmacokinetics, and measures of cognition. The trial is expected to provide a significant amount of data that we expect will be crucial in the design of our potential phase 2/3 trial, as well as our regulatory strategy. Assuming INTERCEPT-AD demonstrates an acceptable safety and tolerability profile and assuming that ACU193 enters the central compartment and that target engagement is confirmed, we plan to advance the program into a phase 2/3 study.\n\nWith that, I will turn the call over to Matt Zuga, our chief financial officer and chief business officer.\n\nMatt Zuga -- Chief Financial Officer and Chief Business Officer\n\nThank you, Eric, and thanks to everyone for joining the call. To start, I want to emphasize that, as a result of planning and executing on our private and public financing strategy in 2020 and 2021, we believe we are well capitalized and have the resources to achieve multiple clinical development milestones. As of June 30, we had approximately $210 million in cash and marketable securities on hand. Looking ahead, based on our current operating plan, we expect our cash runway to last through 2025.\n\nOur strong balance sheet is the result of the proceeds from Series B and IPO financings completed in 2021. Our complete financial results for the second quarter of 2022 are available in the press release we issued this afternoon and in our 10-Q, which we expect to file shortly. I'm not going to review our results in detail, but I do want to highlight a few items. R&D expenses were approximately $7.3 million in the second quarter.\n\nThe increase over the prior-year period was primarily due to increased activity in the ongoing INTERCEPT-AD trial compared to Q2 2021. G&A expenses were $3.1 million in the quarter, with the increase over the prior-year period, primarily the result of increased headcount and the cost of going public and being a public company. This led to a loss from operations of $10.4 million in the second quarter. Note that our comprehensive loss for the quarter was $10.3 million in the second quarter, compared to $61.4 million in the prior-year period.\n\nThe loss in 2021 was primarily driven by a noncash expense of $57.9 million that represented the changes in fair value of our Series B tranche liability and our Series A-1 warrant liability. The tranche liability and the warrant liability were initially recorded at fair value as a liability on Acumen's balance sheet and are subsequently remeasured at fair value at the end of each reporting period. Both liabilities were extinguished by the conversion of our preferred shares and warrants to common shares at the IPO. We will continue to work hard over the coming quarters to enroll INTERCEPT-AD and look forward to reporting top-line data in the first half of 2023.\n\nImportantly, we will continue to operate Acumen efficiently and cost-effectively. We thank our shareholders and partners for their ongoing trust and support. And we'll now open up the floor for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Judah Frommer with Credit Suisse. Your line is open.\n\nJudah Frommer -- Credit Suisse -- Analyst\n\nHi, guys. Good afternoon. Thanks for taking the questions. Just a couple for us.\n\nFirst, I was just hoping maybe, Matt, can you help us with any assumptions underlying cash runway through 2025 and what that contemplates for maybe size of a phase 2/3 study. It sounds like that might start maybe middle of 2023 potentially. And then of kind of the late-stage abetamabs that we're going to have readouts on near term. Any thoughts on which could provide the best read across to 193 and why that might be?Thank you.\n\nMatt Zuga -- Chief Financial Officer and Chief Business Officer\n\nSo, why don't I let Dan take the second part of that question? And then I'll come back to the first.\n\nDan O'Connell -- President and Chief Executive Officer\n\nSure. I'll take a stab at it. Thanks, Judah. Good question.\n\nI think everybody is on the edge of their seat to see how these results play out. We don't anticipate any of these late-stage products being directly through to ACU193, principally because ACU193 was developed with a different purpose and through a different methodology. If you look at those products, I would say that lecanemab is sort of the most comparable yet distinctly different from 193. And I think that's probably the next one to read out.\n\nAnd I think ESI's got it for maybe September. And then we'll be looking at gantenerumab and donanemab data Q4 and I think Q1, respectively. So, we're hopeful that there will be some success to report on in the space. We think that's a helpful positive development for patients generally and for the field at large.\n\nAnd I can't really comment beyond what I've suggested in terms of read-throughs and relevance to 193.\n\nJudah Frommer -- Credit Suisse -- Analyst\n\nOK.\n\nMatt Zuga -- Chief Financial Officer and Chief Business Officer\n\nAnd then just back to your cash question, Judah. So, the way that we look at the earliest that we would start a phase 2 study is the beginning of 2024 because even after we've reported data from INTERCEPT-AD, we would still need to go spend time with the FDA and agree on the final design the study, etc. So, we don't think we'd start until the beginning of 2024. That's a pretty big study as designed, about 550 patients.\n\nNow as we've talked about with all of our shareholders in the past, we're setting this up to have an interim look so that we could potentially flipped this into a phase 2/3 study. But we're going to start it as a phase 2 if that's all we do is run a phase 2 study.\n\nDan O'Connell -- President and Chief Executive Officer\n\nDid we lose Matt's audio?\n\nMatt Zuga -- Chief Financial Officer and Chief Business Officer\n\nCan you not hear me, Dan?\n\nDan O'Connell -- President and Chief Executive Officer\n\nNow I can.\n\nMatt Zuga -- Chief Financial Officer and Chief Business Officer\n\nI'm sorry. Judah, did you hear any of that response?\n\nJudah Frommer -- Credit Suisse -- Analyst\n\nYeah. I think we lost -- you started as a phase 2.\n\nMatt Zuga -- Chief Financial Officer and Chief Business Officer\n\nRight. So, we started as a phase 2 study with the goal being 550 patients. The question will be when we do an interim look, does it make sense to roll it into a phase 3? And so, the way we look at it is we certainly would be well into the phase 2 study in 2024 and 2025. And then we would do that interim analysis prior to meeting the finance, so to speak.\n\nJudah Frommer -- Credit Suisse -- Analyst\n\nOK. That's really helpful. And then maybe just a follow-up on Dan's response to question. We get just kind of the mechanistic potential for combo in ACU193 with any of these late-stage mabs.\n\nPresumably, you're not going to run a combo arm in the phase 2 or phase 2/3. But how do you think about these drugs potentially being administered together?\n\nDan O'Connell -- President and Chief Executive Officer\n\nSo, Judah, I think the way I respond to that question is we think that probably the best means of patient treatment and management in the future will involve combination approaches, and it's potentially multi-mechanistic in the approach. So, I think the AB space is playing out. I think the late-stage assets have a primary effect on amyloid plaques as measured on the B plaque. I think 193 is positioned as a selective antibody toward soluble AB oligomers.\n\nWhether you target oligomers and plaque is something that may be explored in the future, whether you target -- whether you would target oligomers and a tau or an inflammatory mechanism with another agent is something that we also think has a possibility in the future. So, for us right now, I think the important thing is to demonstrate the proof of mechanism in this INTERCEPT-AD study, established the sort of the -- the initial safety profile PK and target engagement, and that does set us up, we think, for the phase 2/3 and future possibilities of combination strategies that, again, might offer increased patient safety and potential benefit.\n\nJudah Frommer -- Credit Suisse -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Geoff Meacham with Bank of America. Your line is now open.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nGood afternoon. This is Hao calling in for Geoff Meacham. Thank you very much for the question. So, I think my question is really for the phase 1 study, you said you're going to test the concentration of antibody 193 binding to the oligomers, so it will be tested.\n\nJust wanted to give a little bit of sense about how sensitive is that test. And what level of bounding that you think may be transferred to good therapeutic effect in human testing? Thank you.\n\nEric Siemers -- Chief Medical Officer\n\nYeah. This is Eric. I think I can take that one. So, the assay, which is being refined at this point, we'll look at the concentration of the antibody down to oligomers.\n\nSo, in other words, really, by definition, target engagement. For most monoclonals and actually drug development in general, as long as you have safety, the more target engagement you can have, the better off you will be, so there's no strict number that we've determined that the cut-off. We need to show some target engagement. But assuming that we continue to see good safety, more target engagement will be better.\n\nSo, hopefully, to answer your question a little bit, there isn't a firm number that we determined that the cut-off, we need to show that it's there. But again, as long as you have safety, more target engagement is better.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nAnd how about the sensitivity of the test?\n\nEric Siemers -- Chief Medical Officer\n\nWell, I can't give you a number right now, based on some projections made, based on the laboratory studies of PK, what we expect to see in spinal fluid in terms of drug concentrations versus the concentrations of oligomers in spinal cord. We're at sufficient sensitivity right now that we think we'll be able to show that in our trial. Now, we're actually working on methods to make the assay even more sensitive so that we may be able to pick that up at even lower doses than we might with the current assay. But we certainly feel like we have the assay developed to the point where we can make the measurement now.\n\nAnd by the way, we won't need to do this until the study in. So, we have some months before we actually need to run this. But we are working on some other methods to either increase the sensitivity in this method, or even use a different method that would be more exploratory like mass spec that has the potential to give you even more sensitivity, but that would be more of an exploratory approach. But right now, based on the laboratory data and the animal data, we have an assay currently that has sufficient sensitivity, and we expect the sensitivity will be even better by the time we actually need to run the assay.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nAwesome. Great. Thank you so much.\n\nOperator\n\nThank you. Our next question comes from the line of Paul Matteis from Stifel. Your line is now open.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nHi. This is James on for Paul. Thanks for taking our question. Maybe just a couple of quick ones.\n\nOne, as the trials continued to enroll, have you guys taken any sort of look at blended safety data? I guess is there any color there you can share around any signals of -- already that have been seen so far? And then, two, can you remind us just -- are you taking one dose forward into the phase 2/3 or multiple, I guess, again, just trying to understand kind of the decision criteria as you guys are thinking about taking a dose forward, and I know you've addressed it some, but outside of the assay, is there any other kind of data points that you're going to look to, to help give you kind of confidence that you're taking the right dose forward? Thanks so much.\n\nDan O'Connell -- President and Chief Executive Officer\n\nEric, do you want to comment on that, yeah?\n\nEric Siemers -- Chief Medical Officer\n\nYeah. Sure. So, one thing just to point out is that, as we advance through the various cohorts at the end of each cohort, we actually do a pretty extensive safety review blinded, of course. So, yeah, that's just part of the criteria for advancing through the study.\n\nAnd we have been looking at that. Now, we've elected, we're not going to disclose real specific results for each cohort, while the study is ongoing. We don't think that would be appropriate. But I think what I can tell you is so far, so good, that the study is going well.\n\nWe look at the safety data very carefully.\n\nDan O'Connell -- President and Chief Executive Officer\n\nAnd on the dosing phase 2/3, I think we do anticipate launching the phase 2 with two dose arms. The level of which will be determined coming out of the INTERCEPT-AD study. Is that correct, Eric?\n\nEric Siemers -- Chief Medical Officer\n\nYeah, right. So, two active and one placebo, so three total arms.\n\nDan O'Connell -- President and Chief Executive Officer\n\nCorrect.\n\nEric Siemers -- Chief Medical Officer\n\nAnd that, of course, will depend on the results that we see in the phase 1 study, but at least that's what we're planning right now when we do the interim for the phase 2/3, it's possible that we would drop one of the arms depending on what the data show us. But at least to start with what we're envisioning is a total of three arms with two active and one placebo.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. Our next question comes from the line of Tom Shrader with BTIG. Your line is now open.\n\nTom Shrader -- BTIG -- Analyst\n\nGood afternoon. Thanks for taking the questions. I have some formulation questions. How subcu-friendly is 193? Do you have a sense of what concentration you could get to? And do you think it's attractive if you don't need it for safety? I mean, one of the other companies is doing it probably for a Cmax reason.\n\nBut is it an attractive route overall?\n\nEric Siemers -- Chief Medical Officer\n\nYeah. So, maybe I can take that, and Dan, you might want to follow up, too. So, as you enter phase 1, well let's say, before you enter phase 1, you don't really know enough about the pharmacokinetics to know whether or not it's feasible to go subcu. So, we will be IV in this first study.\n\nNow if it turns out that the dose that's required is low enough that that would become a profitability, I don't know that we would immediately change that for the phase 2/3, but certainly, we would look at that down the line. But at least to start with, I think it's important that you don't make too many assumptions and over-index. And actually, in terms of a lot of discussions, which we've had, I'm not sure that subcu is as much of an advantage as a lot of people do -- versus a once-a-month IV infusion at a clinic. So, we'll be actively tracking that.\n\nBut for right now, its IV. The one other thing, the good point that you brought up was the way it's tied up that's looking at subcu because they think that they can get less RDA with that. So, in our case, we don't expect to see REA. And so, I don't think we're going to have to deal with the Cmax versus AUC issue.\n\nAnd so, we'll wait and see what the data show. But I think there's -- at least based on what we've seen so far, there's good reason to think that REA won't be an issue for us and so we won't have to deal with that AUC versus Cmax issue.\n\nDan O'Connell -- President and Chief Executive Officer\n\nAnd, Eric, I will follow up on that. And, Tom, just to note that as was announced in our earnings release, we've just designated Liean Schenck as our VP of CMC. So, future manufacturing, formulation types of opportunities for us are very much part of the way we kind of wrote up -- map out the product road map, if you will. And so, we're paying attention, but don't see an immediate obvious need to move to a subcu formulation based on the information we have right now.\n\nTom Shrader -- BTIG -- Analyst\n\nAnd if I can ask Eric one nerdy follow-up, how toxic is your preparation? How toxic are your ADDLs? Are they -- do they approach in-vivo isolated particles? And do you understand why the stuff isolated from human brains is so much more toxic? Is that a big area of effort for this assay?\n\nEric Siemers -- Chief Medical Officer\n\nWell, no, it's a great question, and it's one we've talked about a fair amount recently. So, we know that the adult preparation that was used to create the antibody ACU193, we know based on various studies that those are very toxic to neurons. In terms of the Alzheimer's that are in the brain of humans with Alzheimer's disease, it's a little bit more difficult to do those experiments. And actually, just recently been talking about the comparison between adults and what you actually see in the human brain.\n\nSo, those are experiments that are a little bit difficult to do, but it's a good question and it's under discussion.\n\nTom Shrader -- BTIG -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Colin Bristow with UBS. Your line is now open.\n\nTing Liu -- UBS -- Analyst\n\nHi. Good afternoon. This is Ting Liu for Colin. So, we have questions about the INTERCEPT-AD, the upcoming readout.\n\nThe one thing we have discussed before is that you'll be looking at the potential increase in blood flow. So, could you provide more color here is it the increase in the cerebral blood flow you'll be detecting or the blood flow in the brain? And we have two follow-up questions. Thank you.\n\nDan O'Connell -- President and Chief Executive Officer\n\nSo, maybe I'll start off with the blood flow question. So, just for others who might not be as familiar with the study, the patients are having MRI scans done in the study actually primarily to look for ARIA -- but there's also a, what's called a pulse sequence that can be used in an MRI and that has sort of advanced fairly rapidly in the field recently. It's called ASL or arterial spin labeling -- and what that enables you to do is look at changes in cerebral blood flow. So, this is sort of a total amount of blood flow that goes to the brain.\n\nSo, there's a long history of research in Alzheimer's disease, showing that there's decreased blood flow in patients with Alzheimer's and that decrease continues to get worse with disease progression. So, it's really part of the disease. So, if -- and we don't know that this will happen. But if we see some more immediate effects ACU193, which is possible, one of the effects that you might see would be an increase or improvement in cerebral blood flow.\n\nAnd so, really, the thought was these patients need to have the MRIs anyway, but let's get this sequence that can give us some information on blood flow and see if we do have one of these more immediate effects of ACU193, even in a phase 1b study.\n\nTing Liu -- UBS -- Analyst\n\nThank you. That's really helpful. And we have a separate question. So, you also mentioned there's a computerized cognitive test, which will be used over INTERCEPT-AD.\n\nWe're wondering, say, the daily self-testing assets for patients, or can you just provide more details about this test?\n\nDan O'Connell -- President and Chief Executive Officer\n\nYes, sure. So, we work with a small company called Cogstate, who, actually, for a long time, has been involved in computerized cognitive testing. They were one of the first companies to actually do that. I think one of the things you might be asking in that question is there's a lot of ongoing research now about people doing cognitive testing at home, just on their computer over the Internet.\n\nWe're not going to be doing that in this study, all the computerized testing will be done in the clinic in the SAD portion in the single, those portion actually patients are briefly in the hospital for a couple of days, but one of the advantages of this computerized testing is you can do it multiple times, there should be less variability in it then with sort of traditional scales like say, the ADAS-cog in Alzheimer's disease. And so, it gives us the opportunity to, again, if there should be some immediate effect of the drug to pick that up, we will do all the traditional scales that ADAS-cog and the CDR and the ones you heard about before. But in a study, this is small, I think, it's just almost impossible to pick up a signal with those scales. But with this computerized battery, again, it's not a sure thing, but it gives you the potential to pick up an immediate or relatively immediate effect of the drug if that should happen.\n\nTing Liu -- UBS -- Analyst\n\nThank you. And we have a follow-up question. So, in your recent ClinicalTrials.gov update, you made one minor change of the enrollment criteria, which is on the MMSE score of 20 to 30 and then you lower it to 18 to 30. So, could you provide more details what's the rationale for this change? Thank you.\n\nDan O'Connell -- President and Chief Executive Officer\n\nYes. That's a very good question. As we started to enroll people and screen people for the study, again, our study population is what people are calling early Alzheimer's disease, which consists of people with MCI due to Alzheimer's disease to have that positive amyloid PET scan, but MCI or mild dementia. Exactly where the cutoff is between mild and moderate dementia is, it's -- you'll see different cutoffs used in different studies, basically.\n\nBut as we got some experience with this trial, there were certain people that had a minimum say, 2019 or even 2018 that really seem to have mild dementia. I mean, in the clinician's view these people really had mild dementia. And we didn't really think it was appropriate to exclude them from our study based on a somewhat arbitrary cutoff. I mean, it's a cutoff of 20 that's used in other studies.\n\nBut as we got some experience with this, we just thought it was more appropriate to actually lower it just a little bit because these people after all really did have mild dementia. There's no reason to exclude them from our study.\n\nTing Liu -- UBS -- Analyst\n\nThat's really helpful. Thank you.\n\nOperator\n\nAnd I'm currently showing no further questions at this time. I'd like to turn the call back over to Dan O'Connell for closing remarks.\n\nDan O'Connell -- President and Chief Executive Officer\n\nThank you, and thank you, everyone, for joining today's call. We look forward to updating you again later this year and what is promising to be an exciting and hopefully successful period for the field and for us as we continue to push forward on ACU193 and the INTERCEPT-AD trial. So, thank you very much. That concludes our call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Woolford -- Investor Relations\n\nDan O'Connell -- President and Chief Executive Officer\n\nEric Siemers -- Chief Medical Officer\n\nMatt Zuga -- Chief Financial Officer and Chief Business Officer\n\nJudah Frommer -- Credit Suisse -- Analyst\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nTom Shrader -- BTIG -- Analyst\n\nTing Liu -- UBS -- Analyst\n\nMore ABOS analysis\n\nAll earnings call transcripts"
}