{
  "companyName": "Sterling Bancorp, Inc.",
  "companyTicker": "SBT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/sterling-bancorp-inc-sbt-q2-2022-earnings-call-tra/",
  "content": "Sterling Bancorp, Inc. (SBT -1.30%)\nQ2 2022 Earnings Call\nAug 15, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning, everyone. Thank you for joining us today to discuss Sterling Bancorp's financial results for the second quarter ended June 30, 2022. Joining us today from Sterling's management team are Tom O'Brien, chairman, CEO, and president; and Karen Knott, chief financial officer and treasurer. Tom will discuss the first quarter results, and we'll open the call to your questions.\n\nBefore we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of Sterling Bancorp that involves risks and uncertainties. Various factors can cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These two factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call.\n\nAdditionally, management may refer to non-GAAP measures which are intended to supplement but not substitute for the most directly comparable GAAP measures. The press release available on the website contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. At this time, I'd like to turn the call over to Tom O'Brien. Tom?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nThank you. Good morning, everyone, and welcome to our second quarter earnings call. We have reported this morning a net loss of $0.04 a share or $2.2 million, predominantly, as I noted in a press release, related around some extraordinary items, and, you know, what we got to call noisy entries we made. And I guess the problem with these noisy quarters is it tends to mask some of the important progress that we make.\n\nBut nonetheless, let's kind of go through them quickly here, and then we'll get to the more critical stuff at the end of my comments. But first, you know, expenses are still stubbornly high of $19.5 million. And, you know, an awfully large part of that excess is due to the legal and related costs of dealing with the various investigations and the process that takes, a lot of time and energy and obviously money. Also, in the quarter, we had some significant noise related to the surrender of a pretty large split-dollar life policy and some smaller, older policies that were former executives.\n\nAnd the split-dollar policy thing for controlling shareholders. So, there was, you know, tax implications for that and reversal of some accrued liabilities. And Karen can probably go through any of that, but you might have a particular interest. And more importantly, we did move to an outsourced platform, the Promontory MortgagePath program for the origination prospectively of our residential home lending in our markets.\n\nMortgagePath will basically handle kind of like in a turnkey basis all of the origination work, including quality control compliance and, originating subject to our final review and approval, all of the mortgage loan products that we might offer at any given time. It's an innovative program. And we were all pretty impressed with it. We spent a fair amount of time and due diligence.\n\nAnd I think from our perspective, it appeared to be a simpler program, which has some variable origination costs but very limited fixed costs as opposed to the previous platform we had in-house. We anticipate, you know, fixed cost savings of around $3 million a year. And I guess equally critical for the decision was that many of the burdens in residential lending reside in the compliance space and the disclosure world. And that is all assumed by MortgagePath.\n\nAgain, we would certainly have our oversight and audit of that process. But, you know, the critical parts of that are in this outsourced program and I think gets us away from a lot of the inherent risks in residential mortgage lending. And frankly, given the radical downturn in the residential business in the last couple of months with a slowing economy and significantly higher rates, for us, the timing could not have been better with the adoption of that program, though we did have some severance costs in the quarter. And again, that was about, I think, $400,000 of more noise.\n\nThe margin, I don't know if I can -- if I can be a little bit creative with numbers here, actually, you know, improved about 13 basis points on a basis that doesn't consider the $1.5 million we had in recovered income last quarter. We reported the margin of 295 versus 303 last quarter. And the 303 was favorably impacted by about 21 basis points in the first quarter. So -- but with a one-time recovery.\n\nSo, you know, I guess one of the ways to look at it, I guess, most favorable is, you know, we went from a 282-basis-point margin to 295. And if you want to look at it, then the reported numbers, we went from 303 down to 295, a decline of 8 basis points. But directionally, I think, you know, I feel pretty confident in terms of where we go with margin. Deposit costs will begin to go up.\n\nThey already have in some instances. And, you know, depending on what happens with the Federal Reserve and inflation, I think our expectations are that there will be several more increases certainly in the current year and probably going into 2023. The magnitude of those increases, I think, the Fed's already put a stake in the ground with 275 basis points increases. You know, perhaps, they might be a little more moderate the next time around, depending on what the inflation numbers look like.\n\nBut at the -- at the current rate, you know, of 9%, 8.5%, however you want to look at it, it is an enormous cost for most people in the country to bear. And certainly, my expectation is the Fed will adhere to its mandate and address inflation as aggressively as it needs to break that cycle. So, I guess the more important thing for most of us to talk about here is where we stand with these investigations. The work involved, I think, you probably all appreciate the fact that it's been backbreaking for all of us.\n\nAnd then certainly the patience of our shareholders, as I hope you realize, always acknowledge, and appreciate, it's just been a very big undertaking. And dealing with two separate investigations takes a lot of time and energy and obviously costs. But I think it's safe to say here that the formal agreement, which has been outstanding since 2019, you know, all of the requirements in formal agreement are, of course, public. But I think it's safe to say that the requirements were pretty extensive.\n\nAs I noted in my remarks in the press release, I think we're now in a position where we have satisfied 100% of these findings and the requirements in the formal agreement. And our expectation is that it will be lifted with the formal conclusion of our exam. It's an achievement that's hard for me to underestimate how critically important it was. And it's really a testament to the hard work and the expertise of Sterling's support, management, and staff from the start of our efforts.\n\nI think it's been about 18 months since we've been able to fully attack the formal agreement with the new management group and, you know, the direction we've followed in terms of satisfying it. But it's, you know, it's been a -- if you've dealt with formal agreements before or different enforcement actions from the bank regulators, I think it's usually safe to say it's a, you know, generally, at best, a two-year process, and a more typically a three-year process. But it's important to understand that the satisfaction of the formal agreement requirements is really critical to closing out the OCC enforcement. It's -- I would guess I'd say I have a reasonable level of confidence that both the DOJ and the OCC investigation will conclude this year.\n\nAnd again, we expect to be in a position to have much more clarity in the third quarter report. These investigations are independent of each other, so it can be a laborious process, which means time and expense. Again, we are complying with all of the requests and pushing as expeditiously as possible for, you know, finality. Again, only with respect to Sterling and non individuals.\n\nBut the process is well-underway. Again, as I said, I think we've got finality by the end of the year. But the timeline with respect to getting all the I's dotted, T's crossed. And, you know, coming up with what ultimately the fines and penalties are going to be takes some time.\n\nWe don't have any insight at this point into what the fines and penalties are going to be or even proposed to be. So, that is -- you know, it remains to be discovered as we at least get initial proposals from the agencies in the weeks and months ahead. As I said, I think by the end of the third quarter, we will have a pretty good sense of where these are going and hopefully have everything documented and completed by the end of the fourth quarter. There's, you know, good business and legal reasons to make that timeline, and I think that's the sense we've been given.\n\nSo, with that, it'd probably worthwhile if, Karen, if you just want to go through the noise with the insurance policy surrenders, how it will impact taxes and operating expenses.\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nYeah, I'd be happy to. So, as Tom mentioned, we surrendered about $25 million worth of policies. With regard to that, the largest was the split-dollar policy, which had a cash surrender value of around 19 million. Before that policy, we had two liabilities on the books recorded: one for the cost of the insurance, which is just an accounting way to account for the portion of those proceeds that would have gone to the beneficiaries that were not the bank; and then another smaller piece to cover taxes for the increase in the value.\n\nSo, those two totaled about 4.5 million. And those were reversed through the salary and benefit line on the expense side of the balance sheet. So, additionally to that, we had to book taxes on the life-to-date gain in those policies. These were modified endowment contracts.\n\nAnd if we would have not surrendered them and waited to receive a death benefit, that would have been 100% tax-free. But because we surrendered them, we had to pay tax on the gain. So, the gain was about 13.1 million. And so, that equated to about 3.6 million additional income tax expense in the -- below the line.\n\nAnd then lastly, just like if you cash in something of your own early, since we cashed in the policies early, there was a modified endowment contract, additional tax of 10%. And that is the other expense line on the income statement. So, all in all, it netted to about $500,000 of expense. It just happened to hit three different line items on the income statement.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nThank you. And that's why I said it was -- it created some noise on several different lines in the income statement. But, you know, the net result is the policies were surrendered, and we booked them accordingly. So, with all of that, I'm happy to take questions on any of the topics I covered.\n\nOperator\n\n[Operator signoff] And our first question will come from Ben Gerlinger with Hovde Group. Please go ahead.\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nHey. Good morning, guys.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nGood morning, Ben.\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nI just kind of thinking big picture here about the expense base. I get that there's a lot of moving parts, especially given the all the noise in the quarter. With the kind of the new process on mortgage payout and that new endeavor and kind of thing with the bowl, you know, all the tax, things stripped out of 2Q, I mean, thinking about 3Q, is there just like kind of a core run rate you guys would be guiding to excluding professional fees? I mean, that can always be a bit of a wild card for any one quarter. Like I'm just trying to think when you think holistically, the new expense base is X.\n\nIs there something you would guide to for a core?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nI'll give that to Karen.\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nYeah. I mean, so, obviously, salaries and benefits needs to be higher than it was. So, if you're excluding the professional fees. Going to do a little math here.\n\nYou know, I would say around 15 million or so, excluding professional fees.\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nGotcha. And then if you were to strip out all the DOJ and OCC type -- kind of actions you guys are doing behind the scenes, does professional fees account for anything else? Like, is there something else that's also baked into that? Obviously, it would be minimal. But can professional fees go to zero? Or is that still something in there?\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nNo, there's definitely still expenses in there. You know, just the expenses of being a public company, general legal fees from doing business. But by far, you know, it's extremely bolstered by these investigations.\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nGotcha. Yeah. That's what I was thinking, too. And then when you think there's kind of bigger picture here, obviously, I think everyone is well-versed that the balance sheet is shrinking.\n\nWith rates higher on mortgage properties and just in general, do you think -- the melting of the ice cube, as Tom would put it here, do you think that that slows at all? Or are we still time on the same path that we've seen over the past couple of quarters?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nWell, I'd say, Ben, you know, with higher rates and liquidity on the balance sheet, you know, we're getting some benefit in the margin. And that's certainly is helpful to us. But, you know, it's still a concern as you get into, you know, second half of 2023, depending on your forecast for rates and volumes. I mean, we've been pretty patient with even investing the banks money when the rates were quite so low.\n\nWe invested a little bit as rates went up, but even that was too soon from, you know, a yield perspective. But, you know, we're fairly short-term invested. So, you know, I think we can we can manage through the process if the rates had stayed down basically at zero. I think, you know, the ice cube theory was more of a current concern.\n\nI think, you know, we buy a little time with higher rates, but we still have, obviously, to address some significant strategic issues once we get through the -- you know, to sign off on the various investigations. And it's a little tough because not having a clue where, you know, the fines and penalties may come out, you just don't know what you're dealing with.\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nGotcha. No, I appreciate that. I think that's everything I got. Thanks for color.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nGood. Thank you.\n\nOperator\n\n[Operator instructions] Our next question will come from Nick Cucharale with Piper Sandler. Please go ahead.\n\nNick Cucharale -- Piper Sandler -- Analyst\n\nGood morning, Tom and Karen. How are you?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nVery well, Nick. And you?\n\nNick Cucharale -- Piper Sandler -- Analyst\n\nGood. Thank you. So, I just wanted to follow up on the professional fees. So, making the assumption that the DOJ and OCC investigations are concluded by year-end, do you have an estimate for a normalized level of professional fees?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nI don't. Karen, what do you --\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nYou know, one thing that I'm not sure will be resolved or not and maybe time can provide some color is the legal expenses we're incurring for third parties. So, if that was all resolved to both the company and the third party, you know, you're looking at minimal, minimal amounts, right? Like, 300,000 to 500,000 a quarter in a normal fixed situation.\n\nNick Cucharale -- Piper Sandler -- Analyst\n\nOK. That's helpful.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nYeah. And, Nick, the Indemnified parties. I mean, there are obviously people in the bank who, you know, might be in a position to provide some information to either or both of the agencies. They are each entitled to advancement of legal fees under certain conditions.\n\nAnd that's, you know, another thing that starts to get a little easier once we get to sign off on the final terms and conditions of the various investigations.\n\nNick Cucharale -- Piper Sandler -- Analyst\n\nThat's very helpful.\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nYeah. And you know what, Nick, I want to [Technical Difficulty] there a little bit because I was looking primarily at legal and professional, and I wasn't considering some regular, you know, audit expenses and stuff that we have. So, that's probably going to be closer to 750 on a normalized quarter.\n\nNick Cucharale -- Piper Sandler -- Analyst\n\nOK. Thank you for the clarification. You've made considerable progress in derisking the balance sheet and bringing down higher risk credits from an asset quality perspective, what are your remaining concerns at this point?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nYou know, it's funny, I didn't -- in my remarks here, I didn't get into much into the credit picture because I -- as I noted my quote, last year, at this time, I think, you know, I expressed a fairly high degree of concern with the aggressiveness in the commercial portfolio. You know, we've got some really good credit people now who, you know, taken apart the loans we were most concerned about. We got, you know, accurate risk ratings on them. And, you know, in some cases we worked with borrowers.\n\nOther cases we exited out of the relationships. And, you know, in a significant case, we sold a large pool of those single [Inaudible]. So, that brought the risk down a little. I think, just as I noted in the press release, we'll probably look at one more commercial sale in the next quarter or two of loans that -- that perform but are always going to be substandard, and the risk that they start to perform erratically.\n\nAnd then with respect to the residential loans, you know, our experience with those continues to be quite good in terms of ultimate loss exposure. I think of, you know, the group that we reported as nonaccrual; 18 or so million was, you know, paying under some delayed terms or modified terms, but not really ready for primetime accrual status. And the rest are, you know, loans that either are about to hit foreclosure or are in foreclosure. And we might look -- once we get clear to the investigations, then we might look at, you know, a significant sale of the nonperforming or under-foreclosure advantage loans and to clean it up that way.\n\nIt's not too different if you follow what we did at some national bank when I was there. You know, a couple of big transactions and all of a sudden the, you know, the risk profile was extremely modest. And that's our goal here. You don't want to make high-risk loans in an economy that's slowing down.\n\nAnd, you know, the challenge for us will be to, you know, balance that against the net interest margin. But first and foremost is the credit. I think we're adequately reserved in the case of potential losses. And as I mentioned today, you know, we've lost exposure on the advantage loans that went into foreclosure or otherwise off the balance sheet.\n\nIt's pretty insignificant. You know, we had one that was a fire in the house and, you know, we lost some money on that. But, you know, for the most part, they go to foreclosure. We tend to -- at the foreclosure sale, we tend to be outbid because the loan to values at origination were, you know, fairly low.\n\nAnd -- but more importantly, prices have also improved in most of those markets. So, there's, you know, plenty of equity in those. But it is, you know, the advantage loans are the major part of our nonaccruals.\n\nNick Cucharale -- Piper Sandler -- Analyst\n\nThat's great color. Just one final one for me. Can you remind us how much remains in the mortgage repurchase liability allowance and where you stand with respect to further repurchases of advantage loans?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nI can't, but Karen can.\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nSure, just under $2 million left in that repurchase reserve. There's about just under $90 million worth of total advantage loans that have been sold to third-party investors. We were expecting to get a pullback, hopefully in the third quarter, might be pushed to the fourth quarter of about probably 35 million by the time we get there, maybe a little less. And then there's another -- a couple of others, one under agreement, one not.\n\nBut those seem a little less likely at this point, given where the market is.\n\nNick Cucharale -- Piper Sandler -- Analyst\n\nGreat. Thank you so much for taking my questions.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nAnd I guess I'd add, Nick, just to put it in perspective. When I joined the bank, the loans sold to others, which were all advantage loans, was, I think, if memory serves correctly, around $850 million. So, we're down to pretty much the tag ends of our exposure to the loans sold to others. And I think most of them -- you know, the performance levels, we look at in terms of the loan sold to others that we service remains quite good.\n\nSo, my guess is they'll just hang on to them.\n\nNick Cucharale -- Piper Sandler -- Analyst\n\nYeah, really big difference. Great job. Thank you very much.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nSure. Thank you.\n\nOperator\n\nOur next question will come from Ross Haberman with RLH. Please go ahead.\n\nRoss Haberman -- RLH Investments -- Analyst\n\nGood morning. Good morning, Tom. How are you?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nHi, Ross. I'm fine. And you?\n\nRoss Haberman -- RLH Investments -- Analyst\n\nI just wanted to go back one more further, some further questions on the on the nonaccrual and nonperformers. Generally, would you say -- I don't know. Would it be too aggressive to say you can knock that number in half by the end of the calendar year?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nNo. You know, if you take the -- well, it depends on when we satisfy the sign-off on the formal agreement and the DOJ investigation. But let's just say, for argument's sake, you know, say that's about 12/31 right now.\n\nRoss Haberman -- RLH Investments -- Analyst\n\nRight.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nThen we could look at selling the portfolio of advantage loans that are 90 days or more delinquent, under foreclosure. And that's more than half of more than half of the total. So, yeah, very -- that would all work. The timing, I can't quite pin it down to a quarter.\n\nBut there's a market for those, and it just requires us to get through the DOJ investigation.\n\nRoss Haberman -- RLH Investments -- Analyst\n\nCould you remind us, did -- have you adopted CECL yet? And if not, are you running parallel programs and you hopefully not going to shock us in March with the multimillion dollar addition? You seem pretty well-reserved.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nYeah. Well, I'll say what I think, and then Karen can add color to it. But we've had a CECL, you know, team in progress. We have, you know, we have outside experts guiding us on the, you know, the issues in and around CECL.\n\nAnd we've hired another firm to validate everything we've done. So, I think, you know, we're in a very good position to be providing a little more information directionally in the third quarter and even more in the fourth quarter. And then we should be fine with adoption first quarter of '23. I would say, in my opinion, you won't see any shocks.\n\nBut hear from the CFO, too.\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nYeah, I would agree with that. You know, we've been running the models parallel without adding the qualitative factors, so we're really just working on finalizing those and seeing what makes sense, given, you know, the models are more robust since they already bake in the economic forecasts and such. But I think we're pretty well-reserved, and I would be surprised to have any shocking news come the end of the year when we report a number. And just one follow-up regarding the investment securities.\n\nThe held for sale portion of that, what was the average yield or average duration of that?\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nI don't think we have any investment securities on held for sale. Do we, Karen?\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nWell, the whole portfolio itself --\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\n[Inaudible] so, I figured that you would --\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nYou know, I don't have the data in front of me, but the duration is relatively short.\n\nRoss Haberman -- RLH Investments -- Analyst\n\nOK.\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nYou know, when we buy things, we're always looking at, you know, two to three years. So it's pretty, pretty short.\n\nRoss Haberman -- RLH Investments -- Analyst\n\nOK. All right. Thanks so much. Best of luck.\n\nHopefully, you can wrap up -- can wrap everything up by the Christmas. Thank you.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nThat would be a nice holiday, yup. And I was thinking of trading portfolio and not held for sale. OK. Anything else?\n\nOperator\n\nOur next question is a follow-up from Ben Gerlinger with Hovde Group. Please go ahead.\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nHey. Sorry for the double question. You kind of answered half of it. I was just thinking, the negative AOCI in the quarter with rates up pretty notably over the past 180 days or so.\n\nAnd I know you guys have a different liquidity strategy relative to most banks. Is it safe to say we've probably seen most of our loans here in the AOCI and actually starting back to even? Or do you think we're going to have another negative -- I'm just thinking because of the curves, all over the place, so the 10-year is lower, but the two-year is higher. Just kind of think from that perspective on the balance sheet.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nYeah. From the -- you know, with the yield curved the way as it is, I mean, as Karen mentioned, we tend to invest, you know, three years and in. So, we're probably a little more exposed to higher rates there from an AOCI perspective. But the, you know, in a sense, my view is generally the rates will go where they go and the, you know, the marks will be where they are.\n\nThere's no credit risk in anything that we buy. So, it's hard to predict valuations other than even if those two-year kind of rates and shorter say, you know, inverted, it'll impact the, you know, the value of the securities. But at the end of the day, you know, we get our money back. And I don't lose a lot of sleep over it.\n\nI'd be more concerned, obviously, if we're at longer-term investments with greater exposure. Because then it just, you know, can drop like a stone and we're back where we were when I first started in this business.\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nRight? Yeah. No, I agree. I was just double checking. And it seems like from a liquidity perspective, we are not going to have to sell for a loss.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nNo.\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nSo, like you said, it's -- marks are where they are, you're not going to get it back in three years or less.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nYeah, no matter how you look at these things. They're either -- you know, they either come back here, their yield adjustments, their -- you know. But, you know, the timing is always difficult for any institution-buying securities, whether it's equities or bonds, or -- you know, you try to buy smart, you don't always do it.\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nRight. Gotcha. Well, I appreciate the color. Thanks.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nSure.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Tom O'Brien for any closing remarks.\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nNo. Just hope everybody enjoys the balance of the summer. And year is going incredibly quickly, but we will be talking to you again and -- at the conclusion of the third quarter. So, that'll be in October.\n\nAnd I think we'll have, you know, more to say at that point. And I think, you know, obviously, as I mentioned earlier, more clarity. But as always, we appreciate your time and your interest. And I wish you the good rest of the day.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTom O'Brien -- Chairman, President, and Chief Executive Officer\n\nKaren Knott -- Chief Executive Officer and Treasurer\n\nBen Gerlinger -- Hovde Group -- Analyst\n\nNick Cucharale -- Piper Sandler -- Analyst\n\nRoss Haberman -- RLH Investments -- Analyst\n\nMore SBT analysis\n\nAll earnings call transcripts"
}