{
  "companyName": "Twilio",
  "companyTicker": "TWLO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/05/twilio-twlo-q3-2022-earnings-call-transcript/",
  "content": "Twilio (TWLO 1.77%)\nQ3 2022 Earnings Call\nNov 03, 2022, 4:30 p.m. ET\n\nBryan Vaniman\n\nTwilio's 2022 Investor Day. I'm Bryan Vaniman, Twilio's SVP of investor relations and corporate development. Thanks for joining us virtually today. We're hosting our Investor Day in conjunction with SIGNAL, our annual customer and developer conference.\n\nHopefully, you've had a chance to tune into some of the broader SIGNAL programming, including yesterday's keynote where the team talked about some of the great examples of how companies are using Twilio products to better engage with their customers, drive higher lifetime value and reduce acquisition costs. We held our last Investor Day during our 2020 SIGNAL and a lot has changed since then. So, we're excited to have you join us today to get an update on our business and the opportunity ahead. Before we begin, as a reminder, all financial measures are presented on a non-GAAP basis except for revenue, which is a GAAP measure unless otherwise specified.\n\nReconciliations between our GAAP and non-GAAP results, and further information related to guidance can be found at the end of this investor presentation. The information provided and discussed today also will include forward-looking statements, including statements about our future outlook and goals. However, reconciliation of non-GAAP forward-looking information to these corresponding GAAP measures cannot be provided without unreasonable efforts due to the challenge in quantifying various items. These forward-looking statements are only projections and expectations regarding future performance involving risks, uncertainties, assumptions, and other factors that are described in more detail in our most recent periodic reports filed with the SEC, including our most recent report on Form 10-K and subsequent reports on Form 10-Q, and any amendments to any of the foregoing, and are available on our website and at sec.gov.\n\nForward-looking statements represent our beliefs and assumptions only as of the date such statements are made. Actual results may vary significantly, and we expressly assume no obligation to update any forward-looking statements. Now, in terms of agenda, Jeff is going to get us started with the introduction and vision, followed by Eyal Manor, our chief product officer, who will go deeper on our innovation and product strategy. We'll then have Elena Donio, our president of revenue, provide more details on our go-to-market strategy.\n\nAnd Khozema Shipchandler, our COO will close out the presentation with a financial overview of the business in a discussion of key metrics. After the presentation, we'll take a short break, and then we'll come back for an executive Q&A session with today's presenters covering the Investor Day session, as well as our Q3 earnings, which we released this afternoon after market close. Throughout the webcast, you'll be able to submit questions using the built-in Q&A feature. So, if you have questions at any time, please submit them there.\n\nI'll be moderating the Q&A. So, we will aggregate the questions submitted and during the Q&A session I will announce who submitted the question and then I'll read the question for the group. And finally, we will be posting today's presentation on our Investor Relations website following the conclusion of today's event. Now, with all that out of the way, let me hand it over to Jeff Lawson to kick things off.\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nThanks, Bryan. Hello, everybody, and welcome to Twilio's 2022 Investor Day. I'm Jeff Lawson, Twilio's co-founder and CEO. And look, I'm going to get straight down to business because I know there's a lot of discussion among the investor community around Twilio.\n\nI'm accustomed to Twilio being hard to classify because we don't fit cleanly into one box or another. But this is also part of what's given Twilio a unique opportunity in the market. Here are some of those dynamics. I mean, we're a developer-led and API-first company.\n\nWe have both a usage-based pricing model and a more traditional SaaS-based pricing model with our software products. We have a platform approach versus a solution approach. We have both a product-led and enterprise go-to-market motion, and our messaging products have a markedly different gross margin profile than many of our other products. So, as you can see, we have a number of unique elements to our business that don't easily map to any single comparable.\n\nSo, I hope today's presentation will help to shed more light on our business, our opportunity, and our path forward. So, let's get to it. There are really four things that I want to focus on today. First, I want to discuss our messaging product.\n\nIt's strong and can become even more efficient as it grows, and I want to show you how we intend to do that. Second, we see an even bigger opportunity with customer engagement even though, it's early for us, but I want to give you visibility into our path here. Third, I want to talk about why these two things, communications and data, are better together as a customer engagement platform and why we're going to win. And last, I want to outline our focus on operating leverage and profitability as a key priority for myself and the company.\n\nOK. First, messaging. I know there's a lot of discussion about gross margins and look, I get it. I acknowledge that historically we've guided to a 60%-plus gross margin in aggregate for Twilio and that we'd achieve that level by mixing more and more software into our revenue mix.\n\nBut the telecommunications ecosystem and our business has changed since we set that goal. So, I want to shed some light on what's driving our recent decline in gross margins and why as a business we're more focused on driving gross profit dollars. Messaging is the biggest and fastest-growing portion of our communications portfolio and has been the key contributor to our recent gross margin decline. Carriers charge a fee to access their customers and we pass that fee along both in the U.S.\n\nand internationally. And internationally, it's generally higher. Those fees have gone up over time as this space has matured and taken off over the years. The international market has operated this way for several years and more recently in the U.S.\n\nthose fees we call 10DLC fees were recently introduced because we passed these through to customers at no additional margin, our gross margin percentage has dropped. Furthermore, our international messaging traffic has seen strong growth, which has put further pressure on our gross margin percentage. We've outlined these dynamics in our recent earnings calls, but here's the important part. Our gross profit per message has actually increased over the last few years and we believe that's what really matters.\n\nKhozema will walk through this in more detail in his section. So, net-net, we believe that gross profit per message is a more meaningful signal for Twilio, even more so than gross margin percentage. So, we're going to give you that visibility today. Now, with that principle in mind, I want us to go grab as much messaging volume in the world as we can with a stable gross profit per message.\n\nAnd when we do that for you all to say, hey, that was the right decision, but we can be far more efficient in generating that gross profit. So, off of those aggregate gross profit dollars, we intend to continue driving leverage, which means that more and more of those dollars will drop to the bottom line over time, and then drive the whole business with positive and increasing operating profit. As Khozema will tell you, we expect to drive incremental non-GAAP operating profits year over year starting in 2023 and beyond. These are the goals that we're orienting around top-line market capture and bottom-line profitability.\n\nThe gross margin percentage in the middle is really not what we're managing the business for. And then we can use our growing leverage in communications and the large customer base more than 280,000 customers as the launching point for Twilio's act two in customer engagement. So, that's what I want to talk about next. OK.\n\nSecond, the opportunity in customer engagement, so until recently, brands never knew who their customers were. Think about it. They shipped products to the store that sat on the shelves, and nobody knew who bought the product or if whoever bought it even liked it. But the Internet-enabled companies to build a direct relationship with their customers to know who they are, what they want, and to cross-sell more products and even subscriptions, creating loyal fans.\n\nSo, now every company can connect with their customers from the website or on their cellphones, via text, chat, or email directly. There have never been more digital interactions between companies and their customers than there are right now. But when those interactions aren't relevant to us, what do we do? We tune them out, we unsubscribe, we don't visit the site again, we delete the app. Therefore, companies who want to take advantage of this direct relationship have to remain relevant.\n\nNow, compare this to the digital companies like Amazon, Netflix, or Google who know us and are able to tailor every interaction to us. They take every data point and turn it into a better product experience, which in turn builds a better digital relationship. Think about it. Your and my Amazon homepage is look completely different.\n\nYour and my Google Search results for the exact same phrase generate completely different results. In fact, the more you use these products, the better they get for us. This is what's possible in the digital economy. And look, the stakes are high.\n\nIf Amazon and Google become our one-stop shops than every other company has to buy through them. Companies can't afford to be disintermediated and pay a big percentage of revenues to continually reacquire their own customers for every purchase. If I'm selling shoes, then my biggest competition is my customers typing in google.com when they want to new pair of shoes or opening up their Amazon app. No, I want them typing in my site name or opening my app, and that's what's fueling the whole direct-to-consumer trend.\n\nBut there's technology that's promised to enable these kinds of customer relationships, right? It's called CRM, but the reality is that CRM systems SaaS are bought by a bunch of different departmental leaders. The head of sales buys a sales cloud, marketing buys a marketing cloud, service buys a service cloud, etc. And these solutions are very siloed. They don't integrate well with each other even if you've bought them from the same vendor, but they also weren't built for B2C.\n\nCRM comes from the B2B world where notes from salespeople are the source of truth about a customer account, but in B2C there often is no salesperson. Think about it. When I go to amazon.com, there's no salesperson creating an opportunity that I might buy a Spatula today. Now in B2C, it's all about volumes of data collected in real time that tell an actionable story about me as the customer.\n\nThe software industry has sold a solution that's not working. $69 billion was spent worldwide in 2020 on CRM, yet only 13% of consumers in the U.S. rate their customer experiences as excellent. SaaS is optimized for the buyers of the technology, not for the customer outcomes.\n\nIt's interesting to me that the best companies at this aren't using these apps at all. They're built on internal customer platforms that start with the great use and activation of customer data. So, the big question is, how do companies turn a one-time transaction into a long-term customer relationship? And the answer to the question of how do I turn transactions into relationships is data, which brings me to my third point, why communications and data are better together. This is why we acquired Segment.\n\nTo build strong digital relationships, you need to understand your customers and to use that understanding to engage better than the competition. I mean, when I talk to customers, they often observe that this is the flywheel they're trying to create. The better they understand their customers through data, the better more personalized each interaction can be. And when that's true, their customers are more likely to engage, browse the site, open the app, read the email, click the ad, all of which creates more data.\n\nThis is a virtuous cycle that companies are seeking. When these parts of the technology stack and the customer lifecycle are integrated, the cycle breaks, buying from different vendors, having to manually integrate, these things are the impediments, and the customer feels disconnected as a result. They get bad marketing, frustrating customer service calls, lack of context, and personalization. That's what so many companies are fighting and it's the secret to the digital giant's success.\n\nThis is exactly what a customer engagement platform provides, and the reason why we're so excited about the general availability of Twilio Engage. Engage is our first software application that natively brings segments leading customer data platform and Twilio's world-class communications APIs together into a single integrated platform. We believe this native integration is what differentiates Twilio from anyone else in the market. Eyal and Elena will walk you through Engage in more detail in their parts of the presentation.\n\nBut beyond just engage, it's important to understand why data and communications, the two key parts of customer engagement are better together. Companies have had to choose historically between best-of-breed SaaS that didn't work together or to build a ton of workarounds. The platform approach solves that, and this is why I think we'll win. We've been building a platform to solve customer engagement pain points since day one of Twilio.\n\nOur first platform was cloud communications across voice, messaging, email, and more. Our second platform was for the contact center with Twilio Flex. Our third platform is via the communications app for frontline sales reps, Twilio Frontline. Our fourth platform is for customer data with Twilio Segment and now our most recent platform for growth automation for marketers with Twilio Engage.\n\nWe started with communications, and we added the data layer, which informs the communications. So, the more consumers our customers bring in, the more interactions they have, and the more data they have, the more data our customers have, the more personalized the interactions get, and so on. We're leveraging data as a platform and not just a database. It's used to inform every single customer interaction across the customer journey, not just in one silo, but across marketing, sales, service, inside the product, and more.\n\nThis is what the digital giants have built, and this is what we are enabling for every other company to build. Now, this is the opportunity that we're building for. However, it's not yet growing as quickly as we'd like due to some internal missteps. Elena will talk about some of the recent go-to-market changes we've made to improve our execution there, but from my perspective, these are unfortunate but common acquisition integration challenges.\n\nDespite that, we're uniquely positioned to win. We're cloud first, data first, developer first, platform first. We're a leader in CPaaS, a leader in CDP, and a leader in customer engagement platforms. We have the foundation to win, now we just need to execute.\n\nFinally, my fourth point, our focus on operating profit and driving leverage. In the past, we'd oriented the company primarily toward revenue growth with an eye on opex. That's what we've said multiple times at our IPO and earnings calls, etc. And we've delivered great growth over the last several years.\n\nBut we've also heard from you, our investors that growth is not the only thing that matters, especially as we've reached this scale and we agree, which is why earlier this year, we committed to delivering full-year non-GAAP operating profitability starting in 2023. When I look at our communications products and messaging in particular, I see a really good portfolio, but one that can be a lot more efficient in how we grow. So, that's what we're focused on. We're focused on gaining leverage in our communications portfolio, while we are investing more aggressively in our customer engagement software and data software.\n\nWe aren't immune to macroeconomic effects and we're seeing short-term choppiness as the uncertainty as the economy continues. But despite headwinds, we are very much focused on non-GAAP operating profit in 2023 with increasing leverage in the years to come. I see a lot that we can do internally to find that efficiency. And as CEO, I and my team are fully committed to our operating profitability.\n\nKhozema is going to show you our company operating profit goals and our annual targets for operating leverage increases. Elena will also discuss some of the changes we've made to our go-to-market motions to drive more leverage across her team and continue to build momentum around our software sales. And Eyal will show you that innovation continues. So, in closing, we and many other businesses around the world are facing short-term macro headwinds and resulting choppiness, but despite that, we are committed to non-GAAP profitability starting in 2023 because we see ample internal opportunities to drive operating leverage and efficiency.\n\nAnd despite all the macro that's going on, I've never been more excited about the opportunity ahead. As we continue our journey to build the world's leading customer engagement platform, our mission is to unlock the imagination of builders. And when the world changes as rapidly as it has for the past few years, the world and our customers have more challenges than ever, and therefore, we have more opportunities to help them solve those challenges. I'm excited to partner with our amazing customers as they continue to build their customer engagement strategies to become more efficient themselves and to build relationships with their customers.\n\nWe have the right team and the right roadmap in place to capture this market and execute on our plan. And lastly, I'm also excited to gain alignment with all of you, our investors, on the nature of the messaging business and how we're investing in the customer engagement opportunity. Thank you all for attending today, but also for being vocal supporters of Twilio and even constructive critics at times as we build this incredible business together. With that, I want to pass it along to Eyal who will go deeper on our product strategy.\n\nEyal?\n\nEyal Manor -- Chief Product Officer\n\nHi. I'm Eyal Manor, the chief product officer at Twilio. I've joined Twilio exactly one year ago. Before that, I spent 14 years at Google driving innovative products to scale.\n\nI first helped build the ads business to reach phenomenal growth. Then I led the large portfolio of Google Cloud platform products from inception to a scale of $19 billion in revenue. Since joining Twilio, I've hired senior product and engineering leaders the best in the business from companies like Salesforce, Meta, and Microsoft, all extremely experienced at scale with background in data and API. I joined Twilio because of its focus on innovation.\n\nTwilio has fundamentally changed the way businesses communicate directly with customers. It is Twilio's builder mentality and track record of delivering exceptional products that attracted me and I'm honored to be a part of its leadership team. Today, we're going to talk about Twilio's customer engagement platform and its strong foundation in both communications and data, which is the way of the future. Our ability to bring together the leading CPaaS solution and the leading customer data platform in market share for IDC is what will allow us not only transform the customer engagement space but to win it.\n\nImportantly, you'll hear how we're going to deliver it for our customers and investors, and that's by focusing our investment on the highest impact product areas for the future, where we know Twilio can add differentiated value, positioning us to win in the market. Since its founding, Twilio has been at the forefront of innovation and has repeatedly capitalized on secular trends. Twilio virtualized the complexity of telcos and democratized communications for every developer. With Twilio, businesses could finally text consumers or make calls at scale easily.\n\nWith the explosions of online services, companies had to respond rapidly to changing customer expectations. Some customers prefer texting or chat while other preferred email or voice. So, introduced Flex, a programmable contact center build for this new world of tailored experiences and omni-channel communication. More recently, we've seen customers expecting personalized experiences.\n\nThis is where data comes into play to create a unique profile of each customer data must be unified across the customer journey for personalizations at scale. So, Twilio acquired Segment, the industry-leading customer data platform. This brings us to our most recent launch Engage, Twilio Engage brings together the unified profiles and the communication layer for marketers to build data-driven customer experiences. And this is just the beginning.\n\nWhile all of these solutions create immense value on their own right together the makeup Twilio's future for customer engagement platform. The combinations of communications and data make Twilio greater than the sum of its parts. Our customer engagement platform is how all of our industry-leading products come together with one single unified platform, we're able to maximize the value unlocked for our customers. Our platform combines the deliverability and reach of Twilio's CPaaS offering with a data-first foundation of our CDP to create a differentiated offering.\n\nThis provides businesses with the power to build one-on-one relationship at scale through real-time context and intelligence, low-code orchestration, easy-to-use APIs, and extensible software products like Engage and Flex that give business users the power to meaningfully connect with customers on any channel. I talk to our customers every week and I hear that these are the critical elements a business needs to create ideal experiences with their customers. This innovation is redefining how the industry views data-driven customer engagement. One reason Twilio's customer engagement platform is so powerful is because it already integrated into Twilio CPaaS portfolio.\n\nIt harnesses the throughput, deliverability, and reach of our communication APIs. We enable businesses to communicate with consumer at an enormous scale globally. We power 144 billion messages and host 54 billion voice minutes annually, and we send over 127 billion emails monthly reaching consumers in over 180 countries. To make it easy, we also provide advanced compliance management to ensure companies can connect with their customers without needing to sort through the complexity of the evolving regulations on their own.\n\nWho are able to achieve those wins because of Twilio's builder mentality, we provide differentiated experience with easy-to-use APIs that developers love making product-led growth, a core tenant of our product strategy in an area we will continue to invest in. We tightly integrated the strength of our CPaaS with our CDP, the second pillar of our customer engagement platform. With Segment, we have the world's leading customer data platform, which empowers businesses to gain deep understanding of their customers. Our CDP collects contextualizes and activates first-party data, eliminating silos across the customer engagement stack through our ability to make real-time customer profiles accessible to all business teams in any tool of their choice.\n\nSegment collects first-party data across touch points, data generated from websites, applications, and even data warehouse. The privacy and security feature we've built help our customers comply with privacy laws like GDPR. This data is then synthesized into one unified customer profile that can be activated in real time. With over 400 integrations, open architecture, and easy-to-use APIs, companies are able to use that data to build a customer experience that connects to any other system they use.\n\nFor example, Domino's, Mexico used Segment to collect customer data and create eight distinct customer cohorts. They created a customer journey that was unique and personalized based on each group's behavior and triggered ad campaigns in Google and Facebook with targeted messages at the right time. This data-driven approach drove 23% increase in Facebook conversions and a 700% ROI increase on Google Ad spend. The data in Segment help Domino's understand their customers more deeply.\n\nIt seems simple, but it's not. The quality and accessibility of real-time unified data is crucial to get this right and our CDP solves for all of that. Customer data inform personalized engagement, and the engagement with each message builds a better understanding of consumers, creating a flywheel that makes each part of our solution stronger together. Delivering on our vision requires ruthless prioritization and focus.\n\nAs we continue to derive innovation, we're also working toward non-GAAP operating profitability in 2023. We've taken a hard look at the work we're doing in R&D and whether it's fully aligned with our vision for the customer engagement platform. We are investing strategically into our core CPaaS products to improve margins and maintain our market leadership position. To reduce costs, we're adding additional self-service capabilities and modernizing our infrastructure.\n\nWe are focusing on speeding up development in Segment, Flex, and Engage where we can deliver differentiated solutions by combining our data foundation and communication channels. This includes fully integrated CDP data into our engagement software. And all of this will generate increased value for Twilio and for our customers. The market opportunity for our customer engagement software exists because we help businesses solve real problems.\n\nBusinesses need to be able to measure the ROI of every interaction they take, and this has become even more critical in the current challenging macroeconomic environment. Today, they face three main challenges in accomplishing this. First, even as the privacy landscape has shifted over 81% of businesses still rely on third-party data. In fact, the number of businesses relying exclusively on first-party data to part personalization has increased six points year over year.\n\nIn order to craft personalized messaging or targeting, companies will need to shift to first-party data and deprecate third-party cookies. Second. Today, we understand more than ever that personalization is tied to revenue growth with over 60% of consumers saying that there will likely be a repeat buyer after a personalized shopping experience. However, to drive that personalization companies need a unified profile of their customers.\n\nLegacy software stacks, including CRM, keep this data siloed. That means that customer data available to business teams is often out of date, especially when it comes to customer intent. This creates barrier to delivery, tailored experiences in real time. Finally, consumers want to make a decision of how business engages with them.\n\nThey want to be able to communicate with businesses directly on channels they use every day. We see that 70% of companies that invest in engagement tools see an increase in revenue. When I speak to customers, I hear over and over that Twilio's customer engagement platform solves these challenges for them. Twilio Flex is Twilio's contact and service center platform is a great example of the value delivered by Twilio's customer engagement platform.\n\nTo deliver tailored experiences, we saw our customers start to build alternative contact centers using our APIs. They wanted to drive revenue and customer satisfaction scores and create loyal customers and not just improve operational efficiency. So, we created Flex, software that allows companies to create a unique differentiated experience for their customers that could be customized to their own specific workflows without having to build from scratch. Flex can adapt to individual business needs and integrate with their CX stack, including with partners like Google Cloud, Call Center AI.\n\nOur approach also allows companies to provide agents with all the context and customer data they need to personalize their responses and drive better customer outcomes much faster. So, when Nubank, one of the world's largest digital banking platforms, wanted customer service to set them apart from traditional banks, they chose Flex to serve their 54 million customers saving 113 million hours of wait time and achieving an NPS score of over 90. With Twilio powering communication, Flex customers like HubSpot and Bosch have the ability to reliably scale to serve millions of their customers globally. This is the strength of Twilio software.\n\nThis is why we're excited for our future and the opportunity that lies ahead. As Jeff mentioned, the combination of CPaaS and CDP, it's even more powerful when offering differentiated marketing experience, which is why we're so excited that Engage is now generally available in market. While Flex was originally designed to reimagine the contact center, Engage brings marketing into the digital-first era. With Engage marketers no longer need to rely on the entire data team to target the right group of customers or personal life content.\n\nEngage removes data silos because it's built on top of the segment CDP. Engage enables marketers to create customer journeys built on real-time data, triggering personalized messages at critical moments like abandoned shopping cart reminders or an onboarding message that helps the customer pick up right where they left off. You'll hear more about how customers are using this new product for our president of revenue, Elena, in just a moment. But with Engage and with Flex, we are creating high-margin avenues for future growth for Twilio by solving real business problems for our customers.\n\nAs we look forward, we are committed to continue and help businesses deliver exceptional customer experiences. This means continuing to build one unified reliable platform with global reach, a platform that is built on modern infrastructure and accelerated by Twilio's foundation in product-led growth and self-service. Our unified platform allows Twilio to act as a strategic business partner to businesses, advising them on their end-to-end customer engagement strategy, because we have the unique ability to provide solutions across the entire customer journey. The customer engagement platform unifies the customer and communication data, customer profile that include communication history can drive more relevant engagement, deeper relationship, and improve ROI for our customers, and that is Twilio's sustainable competitive advantage.\n\nLast but not least, our software will bring intelligence to the customer engagement stack. Using AI, Twilio will make recommendations on how business should act on their customer data and the journeys those customers should take, whether that means predicting the right next step for a customer or generating a lookalike audience. So, as you've heard, we are extremely excited for the future of Twilio's products and for what our teams will continue to build on these pillars. And more personally, I'm honored to charge forward and execute against the opportunity ahead with a team of incredible product leaders.\n\nNext up, Elena will share with you our plans for getting all of these great products into the hands of our customers.\n\nElena Donio -- President of Revenue\n\nThanks, Eyal. I joined Twilio six months ago into the president of revenue role, but I'm not brand new to Twilio. Prior to taking this role, I was a member of the board for just over six years. So, I've had some cycles on the journey with our customers, our products, and with our team.\n\nI change seeds because I love the business and the opportunity ahead and because I have a huge appetite for this particular stage of evolution and associated type of work, leaning into the transformative software solutions that are still in their early days while delivering more efficient scale for our communication solutions. And that's what's really top of mind for me right now. What excites me most is the massive opportunity we have in our market. Our software solutions are unlocking new value for our customers, providing them with the data and insights they need to truly know and engage their customers.\n\nAnd combined with our communications products, they allow our customers to deliver the right message or email at the right time informed by those insights. We know that our software solutions require solution-oriented selling and deep customer relationship building, and we're now being much more deliberate about developing those skills, those customer relationships, leveraging the trust and reputation we've built while solving new and broader problems for our customers. And finally, we've made some recent changes to our go-to-market model to continue to grow our messaging products much more efficiently, relying more on digital self-service capabilities, automation, and better calibration of our talent to the work to be done. Despite the short-term headwinds that Jeff mentioned, I feel extremely confident about our long-term opportunity, and I'm excited to talk through the details of how I think we'll get there.\n\nOne of the most powerful leverage points we have at Twilio is our vast and growing customer base. Historically, we've excelled at reaching our developer audiences, but we've also reached into enterprises. As we now have more than 280,000 active customer accounts around the world with approximately two-thirds of our revenue coming from the large enterprise and mid-market categories. As I've spoken to customers over the past few months, I consistently walk away excited by their excitement, they're loyal, consistently trying new things, and looking forward to seeing what we'll do next that they can build on.\n\nWe have an opportunity to introduce those customers to new value via our high-margin software solutions. We need to be able to cross-sell while also effectively hunting for new customers. We have the scale and breadth to do just that. We're investing in our strategic solutions selling capabilities so that we can expand within our existing accounts and acquire new logos with a highly skilled team and tailored sales motion catered to enterprise decision makers.\n\nWe've also identified many areas where we can build greater self-service capabilities and let customers discover and deploy our solutions on their own with help from us only when they need it. Finally, we have one of the largest messaging email and voice platforms in the world, as well as the leading customer data platform upon which to build customer engagement solutions for multiple parts of the enterprise as Eyal talked about. So, I'm really exciting about the key levers we have here, a large customer base to bring more value to our scaled team and the strategic selling capabilities we're building, as well as opportunities to drive much greater efficiencies through automation. And we have this incredible product portfolio to leverage to place and to connect, creating wins for customers that are super hard to replicate.\n\nCommunications and conversations are so often about engagement. This drives the exciting synergies between our products and the cross-sell opportunity we're pursuing. Adding Segment provides deep insights about a customer's journey and preferences to better use our messaging products or Flex when engaging with users. If you look at just our messaging customer base, the use cases fall into roughly three categories, marketing, verification, and conversational sales support.\n\nIn the marketing use case, a customer might use Twilio's messaging products to promote special offers to existing customers, but without the right data to build their target profiles and map their customer journeys, our customer can't consistently deliver the right message to their customer on the right channel at the right times. That's where Segment comes in. And if the customer adds Engage on top of Segment, they can not only trigger the right interactions in real time, but they also know when not to engage with a customer. For example, if that customer just purchased a product that's being currently promoted, other customers use Twilio messaging products for conversational sales support, which gives us another opportunity to cross-sell.\n\nBy adding Flex, our customers can engage and interact with their prospects at the moment of consideration by immediately connecting them with the right sales rep or expert in one click. A great example of this is our customer HubSpot. Their reps used to use their own personal devices to manage customer relationships on WhatsApp, but Twilio was able to enable a complete WhatsApp integration in just a few weeks. Then the company added the chat on WhatsApp option to their talk to sales pages, which connected them directly to a rep in one click, which drove a 4% increase in people clicking through to talk to sales.\n\nOver time, as customers add Segment to Flex, they can see the right target profile, what we call the golden profile, which gives them crucial insights about their customer and the data they need to optimize the experience for that customer. Finally, even in our most basic messaging use case where we're doing simple verification, there's an opportunity to cross-sell additional Twilio products such as silent network authentication, which gives users a seamless onboarding experience by validating them in the background with the carriers. These use cases can create the connection to incremental customer value through additional solutions. And they also demonstrate how we're expanding our target audience, giving us multiple land and expand paths within companies.\n\nWe've historically sold to product builders and developers with our messaging products being a typical land. We now have a large global customer based across all our software solutions too, all across the enterprise. More recently, we're also targeting and actively landing software deals with new expanded personas. We're landing enterprise data teams and marketing teams with Segment CDP.\n\nTravelPerk is a great example where the marketing team wanted to build customer lifecycle campaigns to keep users engaged. Segment gave their data analytics team clean customer data to build an attribution model to find out what specifically attracted customers to their website. With Flex, in addition to cloud contact centers, we're beginning to sell inbound sales support scenarios where a digital contact center solution like Flex can provide key capabilities with a future opportunity to amplify value with Segment, CDP, and Frontline. Marketing teams overall are projected to spend over $20 billion in MarTech in the U.S.\n\nin 2022. These organizations are used to running countless tasks and living with opaque results. We can do better for marketers and Twilio has an important role to play in this large and developing market. Our expansive partner ecosystem is another lever we'll continue to use to efficiently capture new business and grow within existing customer relationships, but we're prioritizing a few key partner motions that we think will support greater long-term leverage for go-to-market.\n\nWe'll continue to focus on consulting and reseller partners so that we can deploy our solutions quickly and support customer implementations. We'll also continue to invest in our technology partners as they strengthen our industry offering and drive broader platform solutions. ISVs have been a critical path to our indirect product growth, and we believe BPOs can also contribute to that as well, so we will continue to build on those partnerships to increase our go-to-market efficiency and distribution. Our customers are validating the compounding value they can achieve by consuming more products with us over time.\n\nWe're addressing real problems and delivering the right solutions one step at a time. We've already closed some very strategic deals with large Fortune 100 companies in the U.S. who chose Twilio as their technology partner to reinvent how they engage with their customers, and we'll give them the data they need to efficiently drive customer loyalty through real-time engaging interactions. And the momentums building just in the last few quarters, we've successfully cross-sold Flex, Segment, or both into over 300 CPaaS customers.\n\nA great example of this is a Fortune 500 financial services company whose journey with us began with our messaging API some years ago. They then added voice and email. They added Segment last year to drive more personalization for customer retention and cross-sell opportunities. And then recently they built a mobile app leveraging Twilio messaging and they're now implementing Flex to directly connect their contact center via the mobile app.\n\nIn 2013, our annual revenue with this customer was about $350,000. Today, we expect this customer to generate approximately $8 million in annual revenue. These solutions are enabling this customer to collect all of the unique signals generated by their financial products, develop a more trusted and comprehensive view of their customers, and personalize the engagement experience to drive greater adoption of their products. Another example is a large Fortune 100 retailer in the U.S.\n\nThey started as a voice customer with some messaging in 2016 and then began a pilot of Flex starting in 2021. After completion of the pilot, the customer decided to replace all of their contact centers with Flex. Before we expanded this customer relationship with Flex, our expected annual revenue was approximately $700,000 a year. After the full implementation of Flex is done at the end of 2023, our annual revenue is projected to be over $7 million a year, and now we're learning how to replicate these successes over and over again.\n\nTwilio Engage is where the value we provide compounds yet again. When we first started talking to potential customers about Engage, a key conversation point was around the ability to deliver individualized interactions with all their customers on any channel from a single platform. As we moved into our early beta phase with customers, it became clear that engages most powerful capability was the ability to act on customer data from our CDP in real time. So, we're working hard to upgrade existing CDP customers to take advantage of Engage, as well as pitching the power of what Engage can do for marketing teams across the world.\n\nOne of our beta customers, a large Canadian retailer just went into production and is a great example of the value Engage is delivering. The marketing and analytics data team historically spent weeks batching up data, going into multiple databases, and struggling trying to find the right tables. By the time they synthesized the data for the marketing team, the insights were likely already outdated, but then the marketing team would develop at their outreach campaign over the course of additional days and weeks, making the data even more outdated by the time the campaign finally launched. Deploying outdated campaigns based on outdated data wasn't working for them, so they implemented Engage to drive real-time action powered by the segment CDP.\n\nNow, their marketing analytics team can instantly get all the data they need in one source. They can update their campaigns in real time to match the customer's activity and utilize trigger events like abandoned cart to reengage them at the right moment. Businesses have always wanted to know their customers to engage them personally one on one, but it hasn't been possible at scale until now. With Engage now generally available, we expect to see and cultivate strong demand for this, especially as budgets tighten and companies must continue to do more with less.\n\nInvesting in our software sales growth will unlock more customer value while changing the economic profile of Twilio. Those software solutions will also fuel more messaging growth and as we drive more efficient placement of messaging and servicing of messaging customers, our operating margin grows. These principles drove the changes that we implemented as part of our restructuring that we announced at September. We believe this will set up our go-to-market team for long-term selling success.\n\nOne of the key things I did when I joined Twilio was to dig deep into the lessons learned from the initial integration of Segment into Twilio, and while I don't think that the end goal was off-base, our approach for integration of the sales force and sales process were overly aggressive. We didn't properly enable Twilio field sales. We also made some decisions that led to significantly elevated attrition across the sellers that were most knowledgeable of the Segment product. Selling communications, APIs and software is different from selling a customer data platform from methodology to buying persona and behaviors.\n\nWe needed to develop strong sales plays that would be relevant to Twilio customers and take the time to fully enable the right segment of our sales team to drive success before integrating the entire team into our existing Twilio sales team. We've learned a number of lessons from these missteps. We've now hired the capacity we need, and we're onboarding new segment and engaged focused talent, while we also enable our enterprise sellers to originate segment and engage business. As such, we've stabilized the team.\n\nWe anticipate new segment lands to reaccelerate in the coming quarters. We're also shifting to a self-service sales model at the lower end of the customer base to maximize efficiency, so I'm excited by these changes and the strengths I see in capability and capacity as we head into 2023. At the end of the day, our goal with the go-to-market organization is to operationalize a very different sales model, one where our small accounts can drive profitable growth on their own through self-service motions and only targeted engagement from our team and where our product AEs and strategic global AEs are focused on driving high-value revenue growth across the top segments of our go-to-market model. In summary, it comes down to driving efficiency, where we've been overweight and investing for profitable growth where we see the potential to create enormous client value in a large and growing market.\n\nThe go-to-market transformation journey has begun, and we've kicked off multiple initiatives to support it. First, we're amplifying our self-service capability and ensuring more automated acquisition and support of our smaller customers and developers. Our product-led growth capabilities will be critical to profitably growing the volume customer base and retaining them with innovations and features that create more value and drive more consumption. By cross-selling our software solutions into messaging customer base, we can grow the overall share of wallet that's at the top end of our customer base.\n\nThis is both a go-to-market motion and work our products can do for us. In addition, we've invested heavily in building out our Segment and Flex sales teams to ensure coverage and capacity for cross-selling and new logo growth. And finally, longer-term partners will be a key leverage factor for us to efficiently scale sales and implementation. These actions will begin to move the needle in the coming quarters and drive a fundamental shift of our go-to-market model across the next two to three years.\n\nWhile the current macro environment is leading to some delays and purchase decisions and slightly longer sales cycles, we continue to have strong demand and we're going to play through it. The market is there. We have a fantastic product portfolio and I'm excited about the opportunity ahead. And now, I'll turn it over to Khozema, who will walk us through the financial overview and key metrics.\n\nKhozema Shipchandler -- Chief Operating Officer\n\nThanks, Elena, and thanks to all of you for joining us here today. My name is Khozema Shipchandler, and I'm Twilio's chief operating officer. Before getting to the meat of the discussion, I wanted to quickly reflect on a few key things that are top-of-mind for me as COO, which you'll hear reiterated throughout my presentation. First, as a company, we are laser-focused on driving disciplined organic growth.\n\nOver the past few years, we've oriented the company more toward growth at the expense of profitability, in an effort to execute against the significant market opportunity ahead of us, which allowed us to capture share. While we continue to be focused on driving attractive levels of growth going forward. We will do so in a balanced fashion. As we tune the dials more toward profitability and begin to recognize economies of scale.\n\nIn addition, we maintain a strong balance sheet, which provides a significant flexibility as we continue to evaluate our broader capital allocation strategy and the trade-offs between organic investment, strategic M&A, and potential capital returns to investors. However, our predominant focus in the immediate term is continuing to accelerate organic growth in our software portfolio. Second, we are committed to delivering non-GAAP operating profitability starting in 2023 and to meaningfully growing our operating margins each year thereafter. While I know there have been a lot of recent questions regarding our gross margin trajectory, as Jeff highlighted, our plan has us delivering non-GAAP operating profit in 2023 irrespective of the short-term gross margin volatility.\n\nI'll explain why this is the case later in the presentation. Finally, as a business, we're focused on delivering consistency and repeatability in performance and metrics. We began this effort earlier this year by tightening our guidance policy to give investors a better sense of where we expect our results to come in. And we'll continue by giving more consistent metric disclosures for the areas that matter.\n\nNow, let's dive in. I'd like to remind investors that the financial references are to non-GAAP measures except for revenue or unless I specify otherwise. This afternoon, we announced another solid quarter of results for Q3 delivering $983 million of revenue, representing 33% total year-over-year growth and 32% growth on an organic basis. Our operating loss came in at $35 million on a reported basis or $6 million if you exclude the $29 million noncash accrual for the implementation of our new sabbatical program for tenured employees.\n\nAnd we continue to see strong expansion from our customers with DBNE at 122%. For Q4, we've guided to revenue of $995 million to $1,005 million and an operating loss of $15 million to $5 million. This implies total 2022 revenue of approximately $3.8 billion and an operating loss of $23 million to $13 million, excluding the noncash accrual for the sabbatical program in Q3. Based on this guidance, our total year-over-year growth is expected to be 34% or 29% on an organic basis, which is below the 30% annual revenue growth target that we established at our 2020 Investor Day.\n\nUp until now, we have consistently over delivered on the 30% organic revenue growth target. That said, I think the question that's on most investor's minds is how we think about this commitment moving forward. As I mentioned in our prepared remarks for our Q3 earnings, while we had a strong third quarter, there are some short-term macro headwinds that were going to have to navigate over the coming months. Like many of our software peers, we are starting to see impacts from the slowing macro environment, including some delays in purchasing decisions in instances of longer sales cycles.\n\nIn our Q2 earnings, we mentioned pockets of softness in certain verticals including crypto, consumer on demand, and social. These trends persisted in Q3 and have also extended to the retail and e-commerce verticals. As such, we think it's prudent to pull the 30% guidance today, because of the rapidly evolving external environment. We'll continue guiding on a quarter-to-quarter basis and while we believe we'll still deliver attractive levels of growth moving forward.\n\nOur focus is on building a great business, not just a big business. And we're orienting the company driving meaningful levels of non-GAAP operating profitability moving forward. We're going to emerge a materially better company out of 2022 and an even better company out of 2023. As you've heard from Jeff, Eyal, and Elena, we have the right products, the right team, and a massive market opportunity to execute against and we continue to feel very confident about the future for Twilio.\n\nToday, I'm going to walk you through a detailed financial overview of our business. I'll unpack our communications and software products to provide you more visibility on how these are performing. I'll also provide a double click on our messaging product, some of the key metrics that we track, and ultimately how messaging continues to contribute attractive gross profit dollars at scale, despite pressuring our overall consolidated gross margins. I'll then discuss how we're continuing to drive leverage as we scale, before closing things out with a few thoughts on what all of this means moving forward.\n\nLet's start with a look at where our overall business stands today. Today is our third Investor Day and it's exciting to see the progress that we've made in such a short period of time. Since our first Investor Day in late 2017, we've grown our quarterly revenue by over 8x, and based on our Q4 guidance, we're expecting to deliver approximately $1 billion of revenue this quarter. For context, in 2019, we generated $1.1 billion of revenue for the entire year.\n\nNot only have we driven impressive growth, but we've done this while maintaining incredibly strong dollar-based net expansion. In fact, our DBNE in Q3 was 122% nearly the same level that it was in Q4 2017, despite the massive increase in revenue. This is a testament to the continued value we're creating for our customers. And while revenue has grown by over 8x, our active customer accounts have grown by over 5x, evidence that we continue to deliver meaningfully more revenue per active customer account.\n\nAnd we've started to drive more efficiencies across our business, reducing non-GAAP opex as a percent of revenue from approximately 57% in Q4 2017 to approximately 51% in Q3 2022, excluding the $29 million noncash accrual for our employee sabbatical program that was recently introduced. At our last Investor Day in October of 2020, we acknowledged that we had experienced some modest tailwinds from COVID and there were some questions in terms of how resilient that growth would be. At the time, we said that we believed a lot of the acceleration sparked by COVID was sustainable, as it ultimately created new expectations from customers in terms of how they wanted to engage with brands. The continued growth that we've seen since then is validation that digital transformation and a focus on more personalized customer engagement is here to stay.\n\nAnd we believe Twilio is incredibly well-positioned to continue to win in this market. And it's an attractive market to be in, through a combination of organic and inorganic growth, we've been able to significantly expand our addressable market since our IPO. And we define our TAM as the combination of the following three categories. One, core messaging, two, other communications products, and three, customer engagement software, which includes CDP, marketing campaigns, and CCaaS solutions.\n\nBased on industry analyst estimates and internal Twilio analysis, the combined TAM of these three markets is $80 billion in 2022, growing to $116 billion in 2025, representing a 13% overall CAGR with the customer engagement software portion of the TAM being the fastest growing. Our overall market opportunity is massive. As we continue to execute against our customer engagement platform strategy, we believe we will continue to drive attractive levels of growth across this TAM moving forward. As we've executed against this TAM, we have delivered consistently strong revenue growth at scale.\n\nSince 2017, we've driven a 57% revenue CAGR and increased annual revenue more than ninefold based on our 2022 estimated revenues. We've added scale and expanded into new strategic adjacencies through some of our larger acquisitions including SendGrid and Segment. While organic growth has remained comfortably above our 30% target. We're currently approaching a $4 billion revenue run rate and we continue to benefit from a number of key tailwinds that will help drive that growth moving forward.\n\nWe are proud of this achievement, but know that we still have more to do and we are now facing a more difficult macro environment. We continue to believe will be in a position to deliver attractive growth going forward, but we're taking a more disciplined approach and orienting the business more toward growth combined with profitability. In addition to delivering strong revenue growth, we've consistently grown our gross profit dollars at attractive rates, ending Q3 at a 56% five-year CAGR. This is a key metric for us as we're focused on driving meaningful levels of gross profit dollars that we can then reinvest back into other parts of the business, namely software to drive future growth, as well as providing a substantial base upon which to drive operating profit leverage.\n\nWhile I know there has been a lot of commentary over the past several quarters on our gross margin trajectory, given the elevated growth of our international messaging product, in particular, we're most focused on the unit economics of our products and ensuring that all new business generates attractive levels of gross profit dollars. And as Jeff mentioned, we believe gross profit per message is more meaningful for Twilio and I'll share some data with you today to help unpack how we think about messaging and its impact on our business. We continue to add more strategic value to our customers, given the majority of our revenue is usage-based. We ultimately succeed when our customers succeed.\n\nAnd as you can see from this chart, we've made significant progress in growing our larger customer accounts. In just two years, we've more than doubled the number of customers who paid us more than $100,000 and increased customers who are paying us more than $1 million per year by almost 3x. In our larger enterprise accounts, we've grown the number of customers who pay us more than $5 million and who pay us more than $10 million per year, both by almost 4x since our last Investor Day. And speaking of enterprise, we've previously discussed how this has been an important area of investment for us over the past few years.\n\nWe continue to make solid traction here and we exited Q3 with 1,028 GDK customers, when $216 million of revenue from those customers for the quarter, or over 20% of our total revenue for Q3. While we're just over 50% penetration of the GDK, we are still early in product adoption with many of them. And we believe we have the ability to move many of these to seven and eight-figure customers over time. We also believe these accounts will continue to be sticky, particularly as they begin to adopt more of our software products.\n\nAs mentioned earlier, we have an impressive DBNE, and this attractive expansion is seen across all of our cohorts of customers. New customers adopt a product and we then get to see the benefits as they expand their usage, add new use cases, and add new products over time. This is one reason we continue to be excited by our messaging product. Given its high ROI and broad range of use cases, it tends to be an easy land for new customers.\n\nThis offers an initial foot in the door, enables us to build a relationship, and ultimately provides an opportunity to then cross-sell our other higher-margin communications and software products. We are well-diversified across our business. In addition to a diverse range of products and use cases, we benefit from our revenue mix being largely balanced across enterprise, mid-market, and growth companies. We also service a broad range of industries, and we are not overly exposed to any specific sectors.\n\nTwilio's foundation is in communications. And over the last 14 years, we've built a comprehensive omnichannel communications platform, enabling developers and businesses to easily integrate capabilities like messaging, voice, email, video, and account security features into their apps using a set of powerful yet simple APIs. These products are predominantly usage-based and generate $3.1 billion in last 12-month revenue as of Q3 2022. Messaging continues to deliver elevated growth, but it has a lower overall gross margin profile relative to the rest of Twilio's business.\n\nOur other communications products maintain a range of different growth profiles, but all offer higher gross margins to messaging. As Jeff, Eyal, and Elena have all highlighted, we're leveraging our strength and communications and first-party data to move up stack and accelerate our momentum in software, which we define as Segment, Flex, Frontline, Engage, and Marketing Campaigns. These tend to be subscription-based products, generating high revenue growth and maintaining more traditional SaaS-like gross margins. Note we have retired the use of the definition application services and will no longer be using that terminology going forward.\n\nOur communications products and in particular messaging make up the vast majority of our revenue today, 84% over the last 12 months. From a gross profit perspective, messaging is again the vast majority, but software with its higher gross margin profile makes up 17% of the total gross profit mix versus 11% of total revenue. Although we're still relatively early days in software, we're incredibly excited by the opportunity ahead for Segment, Flex, and Engage. We will continue to prioritize our investments in these products as we believe they'll generate highly attractive levels of future growth and returns over the next several years.\n\nAs they continue to grow, we expect the product contribution mix to evolve and that software will become a larger portion of our revenue and gross profit. I'll spend the next few minutes discussing our communications products, and in particular, unpacking some of the current trends we're seeing in messaging. As previously highlighted, our communications products currently represent the majority of our revenues. At an aggregate, grow at a strong rate, largely driven by the solid growth we've seen in messaging over the past several years.\n\nSince Q3 2017, we've delivered a five-year CAGR of 54% in communications revenue and we're currently at a $3.3 billion annual run rate. We have a number of API-centric products in our communications portfolio, with messaging, email, and voice being the largest and most established. These three products alone contributed approximately 90% of the overall communications revenue over the last 12 months, with messaging delivering 64% of the total. As mentioned previously, messaging continues to grow at elevated rates relative to our corporate average, but carries a structurally lower gross margin profile, particularly for our higher-growth international messaging revenues.\n\nThe majority of non-messaging-related communications revenue is high gross margin. Account security, which includes our verify product is a high-growth area that we're excited about and benefits from these high overall gross margins. The balance of our other communications products carry more moderate growth rates but is previously stated deliver very attractive gross margins. The scale of our messaging product is significant.\n\nOver the last 12 months, we've delivered over 144 billion messages on behalf of our customers, serving over 180 countries around the world. It's an incredibly effective channel with a high ROI for our customers. And we continue to see strong demand for a wide variety of use cases. For Twilio, messaging often serves as a highly effective initial land with new customers.\n\nThis provides a foot in the door, allows us to establish a new relationship, and over time, gives us the opportunity to cross-sell our other products, all of which are higher-margin. That being said, as we've discussed in the past, messaging carries structurally lower gross margins relative to our other products given the fees set by various telco networks around the world. Furthermore, our messaging gross margin has been pressured over the last several quarters as we've seen an increase in international growth and its domestic carriers have introduced new a2p fees, which we recognize as revenue but are pass-through to our customers at zero margin. Given carriers have a lot of latitude to set the fees to reach their subscribers and we pass those through to customers, we do not believe that gross margin percent is the right way to evaluate the health of this business.\n\nRather, looking at the gross profit dollars created and ensuring that the gross profit dollars are stable or growing and that these gross profit dollars are able to be efficiently turned into operating profit. Through this lens, we continue to believe messaging is a solid product. It delivers elevated levels of growth and benefits from attractive unit economics, which can be used to drive operating profit. I'll explain more in the coming slides.\n\nAs you can see from the chart on the left, our total messaging portfolio has experienced accelerated growth over the last two years. With last 12 months Q3 2022 revenues growing to $2.0 billion. International has been a key contributor to this growth, driven both by new international messaging customers, as well as an increased volume of messages sent from our domestic customers that terminate internationally. This dynamic has shifted the mix of our messaging revenues from 51% terminating outside the U.S.\n\nin 2020 to 60% over the last 12 months. Given the lower gross margin profile of international messaging, this has contributed to a reduction in our blended messaging gross margin rate, which declined from 41% in 2020 to 33% over last 12 months Q3 2022. While the overall blended gross margin rate for messaging has declined as the mix has shifted to more international revenue, it's worth unpacking the U.S. and international markets separately.\n\nLooking at the U.S., as you can see from the chart on the left, our gross margin excluding fees has actually seen a slight increase since 2020 on an organic basis with a further increase attributable to M&A. However, with AT&T and T-Mobile's introduction of 10DLC fees in 2021, following Verizon's introduction of similar fees in 2020, you'll see from the chart in the middle that this has had a material impact on U.S. gross margins. When looking at these two charts in conjunction with one another, you can see that the fee pressure has significantly increased and what was an almost 6% point margin delta without fees in 2020 has turned into an almost 17 percentage point margin delta in 2022 year to date excluding M&A.\n\nUltimately, these fees are recognized as revenue, but are pass-through to our customer at zero margin. They have no impact on our gross profit dollars, but they created drag on overall domestic gross margins. Internationally, as you can see from the chart on the right, we've seen some variability in the overall gross margins since 2020 with a slight improvement in 2022 gross margins relative to last year. As we've mentioned previously, the gross margin profile for international messaging has markedly lower than the U.S.\n\nand varies country by country. As a result, we'll tend to see more variability in our blended international messaging margin depending on the specific country revenue mix each quarter. Our messaging product has attractive gross profit unit economics across both the U.S. and international.\n\nLooking at our gross profit per message over the past couple of years, we've seen stability in the U.S. at an increase in the gross profit we receive per message internationally. In fact, even though our international gross margins are lower, we actually generate more gross profit per message internationally than in the U.S. With over 144 billion messages being sent annually, we're able to generate increasing levels of gross profit that we can use to reinvest strategically back into the business.\n\nAs highlighted, the drivers behind the reset reduction in messaging gross margins have been twofold. First, our strong growth internationally has shifted the mix of our revenues, which has reduced gross margins by 470 bps since Q2 2020. Second, the introduction of 10DLC fees by the U.S. carriers has reduced our messaging gross margins by further 280 bps as these fees are passed onto our customers at no margin.\n\nGiven the size and scale of our messaging product, the reduction in our messaging gross margin has also had a meaningful impact on our consolidated gross margins, reducing margins from 55.9% in Q2 2020 to 50.8% in our most recent quarter. However, if you adjust the 10DLC fees in the most recent quarter, our Q3 gross margins would've been 54.1%. To summarize, the drivers behind the recent reduction in messaging gross margins have been fees and mix, not a pricing nor competitive dynamic, put simply, we make gross profit on messaging. In fact, we make even more gross profit per each message internationally that gross profit has been steady and even increased a little over the past two years.\n\nWhile the gross margin percent has decreased over that period of time, we see no reason to slow down this product, as it generates attractive unit economics. So, our intention is to continue growing it. While that may mean our gross margin percent has continued variability, we think generating significant gross profit dollars that we can reinvest back into our software portfolio, as well as growing our customer base to whom we can upsell over time makes a ton of strategic sense. Doing that, while driving operating leverage is our plan.\n\nWe believe there are opportunities to operate and sell our messaging products more efficiently. And as Elena mentioned, we've started to take action within our go-to-market approach to drive these efficiencies going forward. Now, let's turn to our software products, which we expect to drive high growth with high margins over the next several years. While Twilio started as a communications platform, we've expanded both organically and inorganically to include a strong portfolio of software products.\n\nWe define software products as Flex, Segment, Marketing Campaigns, Frontline, and our newest product, Engage. The shift to software was driven by customer demand. It started with Flex as we consistently heard feedback from customers that they needed a customizable contact center platform. Then data started to become the main topic of conversation, as companies were looking for ways to leverage their existing customer data to provide even better experiences in the digital age.\n\nThat led us to acquire Segment, the leading customer data platform. And now, we've announced the general availability of Engage, our omnichannel journey orchestration product built natively on top of Twilio segment. This combination of data and how it is activated provides real-time engagement over whichever channel a customer prefers. As you heard from Elena, this does require a different sales motion.\n\nAnd in many cases, we are working with different buyers that our core CPaaS offerings. Software requires an experienced sales team who know how to sell to sophisticated buyers, and we've been investing in our sales capacity around that skill set. We're already seeing some great results from those investments and from the sales portfolio overall. Twilio Segment is processing more than 1 trillion events each month, enabling companies to leverage the first-party data they have on their customers for better engagement.\n\nFlex continues to deliver great results as well. In fact, Flex crossed the $100 million revenue run rate mark in the third quarter, just four years after launching the product. This is a great milestone for Flex, but we're just getting started. Looking a bit closer at our software products, you can see that Segment is our largest software product today, followed by Flex and Marketing Campaigns.\n\nWe've also included Frontline and Engage in our software portfolio. However, with both of them being relatively new, they're not driving material revenue today, but they represent important pieces of the customer engagement platform. Importantly, when you look at the right side of this page, you'll see that in addition to our customers telling us how important these products are for them, these products also have great financial profiles. This portfolio generally delivers high growth with 75%-plus gross margin, meaning as this portfolio of products continues to grow and becomes a bigger portion of our total revenue, we'll see an uplift to our consolidated gross margins.\n\nAgain, we have work to do here, but as Elena mentioned, we're reorienting our sales organization to put the full power of Twilio behind our software portfolio, and we're confident that over time we'll continue to grow and scale these products as customers embrace our customer engagement platform vision. Speaking of Flex, I wanted to provide a little bit of a closer look at what the revenue ramp looks like for Flex customers. While a majority of our CPaaS products are usage-based, our software products are primarily subscription based, meaning they have a bit of a different revenue ramp that takes a little longer. This is true for Flex as it's extremely rare for a company to change their entire contact center footprint at one time.\n\nThese two reasons are why despite our progress with Flex, you don't see an immediate impact on our financials. This chart shows the average quarterly revenue since the start of last year from our top 10 Flex customers as of the end of Q3 2022. You'll see that since the start of last year, our top 10 customers have more than doubled their spend on Flex as they continue to find value in the platform and expand their usage across multiple teams and organizations. Again, when customers are rolling Flex out to thousands of agents, this is typically done over several quarters or even years.\n\nThis is a great sign for what's to come with Flex as our unique and flexible platform allows our customers to truly customize Flex to support their customer support and customer experience. We see a similar growth trend with Segment. This chart shows the average ARR expansion for the top five Twilio Segment customers from when they first signed a contract through the next three years. Again, this shows a great growth trajectory, but you can see that it doesn't happen overnight.\n\nThis is why there may sometimes be a disconnect between our excitement for the traction we're seeing in software and what you're seeing flow through to the financials early on. Our software portfolio is much earlier in its life cycle compared to our communications products, but we're happy with the progress we've made thus far and the feedback from customers has been very positive. And with Twilio Engage, officially GA, we're adding yet another growth factor to our software portfolio. We have more work to do from continuing to innovate and adding new features and functionality to continuing to hire and enable additional experienced software solutions salespeople.\n\nBut we're on the right track and we believe that the combination of our leading communications products combined with our software portfolio is a unique differentiator that will help us win this market. Now that we've discussed several of the growth aspects of the business, let's turn to discuss how we will strike the balance between growth and profitability and how we plan to drive operating leverage going forward. For the last several years, we've been clear that our focus has been investing in growth. And we've seen the payoff from those investments in our top-line results.\n\nHowever, even with our focus on growth, we have driven improvements and our total opex since 2019, while also absorbing several acquisitions over that same time period. We've made focused efforts to shift our hiring to locations outside of the Bay Area and we've started to see the benefits of scale and automation in areas like G&A. As you can see, sales and marketing has stayed relatively flat over this time period as we've invested in building out our software, enterprise and international sales teams, which are producing strong results. But while we've made some progress in reducing our overall opex given the need to drive further prioritization across the organization combined with the dynamic macro environment, it became clear that we needed to make more significant actions to rightsize our expenses and put ourselves in the path for delivering consistent non-GAAP operating income starting in 2023 and driving annual improvements that thereafter.\n\nFirst, as you're likely aware, we announced a restructuring in September, resulting in an 11% reduction in our workforce. I'll talk more about the details in a moment, but that action removed approximately $200 million of annual costs from the business. Second, as we discussed on our second-quarter earnings call, we have slowed the pace of new hires in a majority of the business. While we continue to focus our hiring efforts on high-priority strategic areas like Segment, Engage, and Flex, we are limiting the number of new hires and backfills in the other areas of the business.\n\nThis is expected to save approximately $100 million of annual costs. And finally, we also announced our decision to become a remote-first company and made a significant reduction in our real estate footprint, which has driven approximately $30 million of annual savings. We'll continue to closely monitor the returns on our investments, make adjustments as needed, and evaluate opportunities to increase efficiency and improve profitability as we scale our business. Let me take a moment to provide a bit more detail in the restructuring actions.\n\nAs you can imagine, this was not an easy decision, but ultimately, we felt like this was the right decision for the long-term health of the business. The restructuring was largely focused on our sales and marketing organization. We made changes to shift more of our sales focus to support our software portfolio while promoting more self-service in areas where a high-touch model isn't necessary such as messaging. We also reduce the size of our support teams and consolidated teams who are duplicating efforts.\n\nAnd as I discussed earlier, we are continuing to shift hiring away from high-cost locations as we scale the organization. In R&D, we move from a general manager-led model to a functional model, allowing us to fully align our product, engineering, onboarding, and other teams to avoid duplicative work, break down silos, and allow us to move more quickly. We also implemented more consistent span of control guidelines to help us reduce unnecessary layers of management. In G&A, we move transactional roles to lower-cost regions, and as a result of the changes in go-to-market, we also reduced size of our team supporting go-to-market within the G&A organization.\n\nAnd finally, given the current hiring freeze and limited backfills, we also scale down our recruiting organization. Again, this was an extremely difficult decision. Twilio has always been a growth company, but we grew our headcount too quickly in the last couple of years and we needed to refocus and align our investments more squarely with our corporate priorities. With our focus on profitability, I wanted to give you a quick look at how to think about our opex as we move forward.\n\nIn the medium term, which we think of being three to five years out, you should expect sales and marketing to come down by 300 to 600 basis points and both R&D and G&A to gain some modest efficiencies. We expect that we'll be able to drive these results through a combination of taking advantage of our scale, more automation, and leveraging more hiring in lower-cost regions. When we look out longer term, we expect that we'll be able to deliver the most additional leverage in our sales and marketing line item while R&D and G&A will continue to decline at a bit of a slower rate but still improve as the business further scales. Ultimately, it's important to understand that we are increasingly focused on driving operating leverage throughout the business as we scale and that even if we see continued pressure and gross margin, we will deliver incremental profitability through this additional leverage.\n\nAnother important area of focus as we build leverage throughout the company is stock-based compensation, which averaged approximately 22% of revenue in Q3 year to date. As we look at 2023, we do expect SBC to show some increase as we continue to absorb the impact of the high levels of headcount growth we've seen the last couple years. However, we do have a target to reduce SBC in the medium term to 15% to 20% of revenue, and we've been proactively taking steps to achieve this leverage over time, including the recent restructuring and slowing of headcount growth, diversifying the locations where we hire employees and targeting lower cost geographies and tying annual equity awards to performance. We've heard your feedback and while this is not a number we can decrease immediately, we're confident that the actions we're taking will drive this number down over the next several years.\n\nNow, let's take a few minutes to discuss what this all means moving forward. As we've discussed throughout this presentation, our three main priorities are to, one, grow our messaging business more efficiently, two, accelerate momentum in our software business, and three, drive operating leverage across the business to deliver non-GAAP operating profit beginning in 2023. We have been taking proactive actions to ensure we can effectively execute as a company, and we're committed to delivering against all of these moving forward. We also remain committed to our 20% plus long-term non-GAAP operating margin target, which remains unchanged from our last Investor Day.\n\nWe've developed a financial framework to highlight our key areas of focus in the short to medium term that are aligned to these priorities. The goal is to have a short list of metrics that provide more clarity and targets, which can then be used to assess our overall performance. These targets exclude the impact of any potential future M&A. Starting with the top line, we're going to continue driving attractive levels of organic growth and really focus our efforts on accelerating software.\n\nGiven the current macro headwinds and our recent go-to-market shift toward software, we're going to continue to guide quarter to quarter for 2023 and over the medium term, which we define as being three to five years out, we're targeting our organic revenue growth to be in the 15% to 25% range per year and we'll be targeting 30% plus for our software products. Given the majority of our revenues continue to be usage-based today together with the current volatility we're seeing from the macro environment, we've provided a wider range for organic revenue growth that reflects the fact that usage-based revenues are harder to forecast over the longer term. However, as our software products grow at more elevated rates relative to the rest of the business and as the macro headwinds subside, we expect that we'll be able to tighten this range over time, given software revenue tends to be more predictable than usage-based revenue. As previously discussed, we'll continue to grow our messaging business assuming the unit economics remain attractive.\n\nAnd therefore, we anticipate that our gross margins will see continued variability throughout 2023. In the medium term, we do see stabilization and ultimately gross margin appreciation as software continues to become a bigger portion of revenues. We're committed to delivering non-GAAP operating profits starting next year, and we expect this to grow each year thereafter. We're targeting annual non-GAAP operating margin improvements of 100 to 300 basis points in 2024 and through the medium term.\n\nFinally, we'll continue to actively track our stock-based compensation and take steps to reduce this in the medium term. As previously mentioned, we expect SBC to increase modestly in 2023 as we continue to absorb the impact of the high levels of headcount growth we've seen in the last couple of years. However, in the medium term, we're targeting to bring down SBC to 15% to 20% of revenue. Netting everything out, here are the key takeaways in terms of how to think about the financial framework moving forward.\n\nWe anticipate that the current macro headwinds will have an adverse impact on our growth rate in the short term. This is why we've moved away from the 30% annual organic growth target. While we believe we'll still be able to deliver attractive levels of growth moving forward, we acknowledge that there could be some choppiness in the short term. As Elena discussed, we've made a number of changes in our go-to-market organization to optimize for more effective selling of software.\n\nWe believe these will begin to move the needle in the coming quarters as reps continue to ramp to capacity. It will ultimately take some time to move from bookings to revenue and software, but we're confident we can deliver against the 30% plus annual revenue growth target in the medium term. We're committed to delivering non-GAAP operating profit next year and to drive meaningful operating margin increases each year thereafter. Excluding any impacts from potential future M&A.\n\nWe expect SBC to moderate over time and our plan is to deliver free cash flow in the near to medium term. We'll continue to actively assess our capital allocation strategy. We have a strong balance sheet, which provides us significant flexibility in terms of how we best optimize capital allocation between organic investments, strategic M&A, and potential returns to share owners. And with that, let me turn it back over to Jeff to provide some closing remarks.\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nThanks, Khozema. We provided you all with a lot of information today between myself, Eyal, Elena, and Khozema. Before we take Q&A, I wanted to go back to where I started with a summary of our plan. First, messaging is a good business.\n\nWe provided a lot of disclosures to unpack unit economics and mix, but at its core, we generate a lot of gross profit dollars in messaging. We're using product-led growth to get much more efficient in how we run and distribute the product. So, long as we continue doing this at increasingly profitable rates, we will continue to grow this business as fast as we can. Second, our customer engagement software products Segment, Engage and Flex are the next act for Twilio.\n\nSegment in particular, because data is at the core of every B2C company's execution, and we have a world-class and leading CDP that they need. And for Twilio, data unlocks so many other ways to add value to companies by infusing context into every interaction, insights into every campaign, and intelligence through machine learning and more. We know how to sell Segment. And we have rebuilt sales team with the goal of growing this business at high rates over a long period of time.\n\nThird, we will bring together our leading CPaaS and leading CDP products to unlock more value in our software applications layer. We believe our products together are uniquely positioned to deliver exceptional value through integrating these products such as in Twilio Engage and via upselling and cross-selling as Elena articulated. This is still early, and thoughtful integrations take time, but this is our plan. Fourth, we are laser-focused on generating near-term profitability and will continue to drive operating leverage in successive periods afterwards.\n\nWe've already made some difficult decisions to put us on this path. But our plan is simple, drive more leverage from our scaled communications business through product-led growth and more efficient distribution while putting more and more of those go-to-market resources on selling our software products over time. We have the right team in place to ensure we will gain this leverage over a long period of time. Finally, we've provided you with a financial framework, which we think is the best way to think about and run our business going forward.\n\nWe will use this as a means to assess and report on our performance every quarter. Four of the five metrics you can already see in our reported financials and software growth called out as the fifth metric in our financial framework we will begin disclosing quarterly, top-line growth, gross profit growth, and bottom-line growth are ultimately what matter. That's where we are focused. And lastly, not only are we focused on profitability, you should expect to see ongoing leverage in each of our cost categories with special emphasis on sales and marketing, and G&A going forward.\n\nAs I've said many times, it's day one for Twilio. We have the products we need, we have an amazing customer base, we have the financial framework, and we have the team, and we just need to keep executing. Thank you for your time today and for coming with us on this journey. And with that, we'll take a short break before opening things up for Q&A.\n\nBryan Vaniman\n\nAll right. Welcome back to the Q&A portion of our Investor Day event. This is Bryan Vaniman, Twilio's SVP of investor relations and corporate development, and I'm joined with today's presenters, Jeff Lawson, Eyal Manor, Elena Donio, and Khozema Shipchandler. Thanks to those who have submitted questions thus far.\n\nI'll be moderating the Q&A session. So, if anyone has further questions throughout the discussion, please submit them through the built-in Q&A feature in the webcast. And with that, let's get started. The first question is from Derrick Wood of Cowen.\n\nJeff, in your letter around the restructuring announcement, you talked about wanting the company to be doing fewer things better and that you found that some investments no longer make sense. What areas of the business are you doing to dial down and how should we think about the impact to revenue and margins?\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nYes, thank you for the question, Derrick. Really, it's about simplifying. We're focused on growing messaging profitability. We're focused on growing segment and engage.\n\nWe're focused on growing Flex. And for each of these three areas, we have our areas of focus that are making them better. For messaging, it's investing in product like growth. For Segment, it's really a focus on our go-to-market enablement and growing our sales team.\n\nFor Flex, it's about our platform scale and being able to sign deals like we did this quarter for more than 20,000 seats. Internally, we're also undertaking to simplify. We're replatforming our data and our compute platforms to both save money, but also to get more consistency. So, if you think about it, many of our products, which historically have had their own go-to-market motions.\n\nOur aligning -- we're aligning them more efficiently behind the primary go-to-market motions of those three products and helping them to contribute to their success. There is only so many land products that a company can do well, so this is where focus, I think, really helps. For example, voice works best when it's sold in the context of a contact center buyer, which Flex is attracting. So, we're kind of looking at it and saying if other activities that we're doing aren't relevant to the success of messaging's profit generation segment or Flex's customer growth, then we're really looking for that relevancy and alignment ASAP.\n\nThat's kind of where I take it.\n\nBryan Vaniman\n\nExcellent. Next question is Meta Marshall from Morgan Stanley, and also, Derrick Wood from Cowen had the same question. How much of the Q4 slowdown is a direct result of the restructuring effort and changes in compensation structure versus a slowdown in the macro environment? And we'll have Khozema answer that.\n\nKhozema Shipchandler -- Chief Operating Officer\n\nGreat. Thank you, Derrick. Thank you, Meta. But there's not actually a near-term impact to revenue from the restructuring.\n\nIn fact, one way to think about it is that if we actually had the same number of salespeople today, there would actually not be a difference in our revenue guide. And really what it is, is that the business is still growing, it's growing nicely, but it's just growing at a rate that's a little bit lower than what we would have expected a few quarters back just because of the macro headwinds that we talked a lot about during the course of the presentation. And as you can see from, for example, our cohort chart, as well as our expansion rate, we're still driving growth certainly with our existing customers in a lot of different industries, but we do have some exposure to customers that are in macro sensitive industries and that's causing us to see some slower instances of growth going forward, which is why we got it the way that we did.\n\nBryan Vaniman\n\nAll right. Next question from Rishi Jaluria from RBC. How should we think about political contribution in the fourth quarter given the strong midterm advertising spending environment? And we'll have Jeff answer that.\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nYes, thanks, Bryan, and thanks, Rishi, for the good question. Now, unlike prior years, our Q3 and Q4 this year largely exclude a political spike in traffic and revenue because we made the decision to off-board a lot of that traffic from our platform after the 2020 election. And the reason why is that traffic was from customers who did not intend to honor our acceptable use policy with regards to consumer opt-ins, and therefore we decided to refuse their business in this election cycle. I presume they went to other providers, but to us the short-term revenue benefit in the election cycle is not -- it's just not worth the friction with consumers who get really annoyed by this traffic or with carriers who've raised repeated concerns about this traffic.\n\nAnd when those campaigns really refuse to get opt-in, and I'm sure as consumers, we all feel that. I think that creates a lot of problems.\n\nBryan Vaniman\n\nAll right. Next question is from Ittai Kidron from Oppenheimer. Is there no way to offload international messaging traffic to a third party to avoid the margin pressure? Is there no low bar margin-wise in chasing international messaging traffic? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nGreat. Thanks for the question, Ittai. As we showed you in the presentation, we actually generate very attractive gross profit unit economics internationally even more so than domestically. And we wanted to provide that disclosure so that you have visibility to the way that we think about running that part of the business.\n\nAnd as long as it's the case that we generate continued strong gross profit unit economics, we're going to continue investing in growing our international messaging business because it obviously provides gross profits that we can reinvest back into the business and as also previously discussed messaging serves as an effective land with new customers. And so, as we grow internationally, we believe that this enables us to establish relationships with new customers and then we can obviously ultimately up-sell our portfolio of higher-margin software and other communications products. What I would add as well is, is that obviously the gross profit unit economics are quite good based upon the charts that we showed you, but ultimately, we want those sales to be up profit accretive and that's what we're really laser-focused on.\n\nBryan Vaniman\n\nAll right. Next question is from Matt VanVliet from BTIG. With so many customers and SI partners, viewing the connection of CRM systems and customer data and thus CDPs as inseparable. How can Segment break down this mindset and outsell Salesforce and Adobe on the CDP front? What else needs to be sold with segment to clearly change your customer's perceptions? And we'll give that to Elena.\n\nElena Donio -- President of Revenue\n\nHi, Matt. Thanks for your question. First Segment is the market leader and we're strategically focused on distributing that product more and more efficiently. I'm super confident that we have the right team and strategy to grow and scale our software business overall.\n\nWe've got a good starting point with Segment and now we've got and just go continue to execute. It is not lost on us that they are both big, formidable competitors, as well as some small ones along the way as well. But they don't have our same product capabilities and they don't have our strong synergies across other Twilio products. We're currently at SIGNAL at the moment, our annual customer conference.\n\nIt's been really fun to talk to existing customers, as well as prospects while we're here. I had a chance this morning to sit down with a large segment customer and they described their large and complex ecosystem of sales and marketing systems inside their four walls. Their data is siloed. It's disconnected.\n\nIt's really slow to propagate. And the implications to what they can do for their customers and prospects is really profound. It means multiple messages are going to customers for multiple products in an uncoordinated and sometimes even conflicting manner with no ability to draw cross-product correlations within that construct. So, Segment and Engage, especially when they're coupled together, can bring this all to a head and bring it all together regardless of what's already in place behind the scenes.\n\nSo, net is we see our capability separate from the incumbent CRM or MarTech stack. But as an API-first real-time and straightforward to integrate set of solutions, it's an actual benefit, not a hurdle to overcome, especially as we build the right relationships with our buyers.\n\nBryan Vaniman\n\nGreat. We'll move to Mike Walkley from Canaccord Genuity. With pulling the 30% revenue growth target, where are the key leverage points in the model to achieve operating margin targets and that'll be for Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nGreat. Thank you, Mike. As I walk through in the presentation, we actually expect leverage on all the opex line items, and we think there is actually further opportunity in S&M, R&D, and G&A. On the sales and marketing side, one of the things that Jeff talked explicitly about is that we're actually shifting more of our resources to software and then also moving to product like growth in self-service and in messaging and Elena spent a lot of her presentation articulating how we would do that as well.\n\nOn R&D and G&A, we'll continue to shift to lower-cost GOs, for example, and leverage automation, which we think drives a lot of leverage. And ultimately, it's important to understand that we'll continue to drive operating leverage throughout the business actually as we scale. And that even if we see continued pressure on gross margins, we will deliver incremental profitability through this additional leverage.\n\nBryan Vaniman\n\nGreat. And we have another question from Rishi Jaluria from RBC. A little surprised to see Flex is only at $100 million ARR. Could you walk through your plan to turnaround the business and get it to a similar scale to other CCaaS vendors? Khozema, do you want to take that?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nSure. Hi, Rishi. Thanks for the question. I wouldn't say that it's really a turnaround.\n\nWe're actually quite pleased with the performance of Flex and we're excited to see that we've actually crossed the $100 million dollar run rate just four years actually after the product became GA. And as we mentioned in the last couple quarters, we've signed our two largest deals and that's a good sign of the momentum that we're seeing and that revenue is obviously not yet in the business, given that we just signed those customers. The other thing is, as we mentioned in our presentation, for every dollar of Flex software revenue that we recognize, we also receive over $0.70 of additional revenue through pull-through of our communications products. And that amounted to about $62 million of additional communications revenue over the last 12 months.\n\nAnd for us, Flex has largely performed in line with our expectations since the launch. Though, as we previously have said, the messaging around Flex probably got a little bit ahead of the product in the early days, but we've made great progress. We've built a great go-to-market organization, and we're really excited about the opportunity ahead. And I think we've also learned a lot from the launch of Flex, and we've applied a lot of those learnings to how we approached the GA for Engage in terms of making sure that the product was really ready to meet the expectations of the market.\n\nBryan Vaniman\n\nAll right. We've got another follow-up question for Khozema, this is also from Rishi at RBC. Can you talk about your plan to ran in SBC over time?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nSorry, Rishi who?\n\nBryan Vaniman\n\nRishi Jaluria.\n\nKhozema Shipchandler -- Chief Operating Officer\n\nRishi Jaluria. Thank you, Rishi. Fundamentally, I mean, we do need to slow the growth of our headcount relative to the growth of our revenue. And it will slow down, right, relative to our expense growth.\n\nAnd that will lead to some leverage on that line relative to the revenue line. As you know we committed to slowing our headcount growth given some of the recent actions that we took with respect to the restructuring. And as we showed them presentation, we've also aligned stock-based compensation with employee performance, and we're also planning to make additional changes, as I referenced in the prior question from a geo perspective. And in particular, we've heard from some candidates, especially in international markets, that stock is just like a very different dynamic relative to cash.\n\nAnd so, we'll make some changes there as well. And we'll continue evaluating our SBC practices, of course, going forward. We do recognize it's an important metric for our investors as it relates to GAAP profitability over time. And so, we are quite focused on it.\n\nBryan Vaniman\n\nNext question is from Meta Marshall, from Morgan Stanley. When did you start to identify some of the growth issues at Segment? And was Elena's hiring the beginning of identifying and acting on those changes? I think we'll give that to Jeff.\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nThanks, Bryan. Yes, we launched our new combined sales model at the very beginning of this year, and we gave this new motion some time to succeed, but it gradually became clear that a more dedicated selling effort for Segment would set us up better for success. Elena joined us around the time of this transition, and we're thrilled to have her leadership not just on this, but on every aspect of our go-to-market strategy. But as we saw it beginning to not work the way we intended it to, we took very quick action to identify the root cause and to start setting up the solution.\n\nBryan Vaniman\n\nGreat. Next question is from Derrick Wood at Cowen. This one is Eyal. Eyal you mentioned that in order to reduce CPaaS costs, you are adding self-service capabilities and modernizing infrastructure.\n\nCan you double-click on how this may lower COGs or opex of the messaging business into what magnitude this can move the needle of messaging profitability?\n\nEyal Manor -- Chief Product Officer\n\nYes. Thank you, Derrick. As one of the earliest companies to realize the benefits of product-lead growth, it is part of Twilio's DNA to build products that are easy to implement, easy to understand, and accessible to test the value of the product. With our API today, a builder can send a message or make a call in just minutes.\n\nWhen we think about improving self-service, we're working to simplify the complexity of not just our products, but the telecom ecosystem. As an example, our 10DLC registration process makes compliance with telecom regulations easy through our APIs. We're also planning on things like simplifying our product skews, so it will be easier for customers to understand which products they should buy, what is their use case without the need to talk to a salesperson. Delivering a streamlined billing process across all of our products and removing identified point of friction that will block the builder from realizing maximum value as they get into our products.\n\nBryan Vaniman\n\nGreat. Next question is from Siti Panigrahi from Mizuho. It's good to see focus on Engage in CDP and first-party data, however, Google has pushed its third-party cookie deprecation to the second half of 2024. How would that impact the demand for Engage platform in Twilio growth in 2023? I think we'll give that to Elena.\n\nElena Donio -- President of Revenue\n\nThanks, Siti. I don't think that this will impact the demand for Segment nor Engage. Customer privacy is just top of mind for companies. They want to make sure that they're really on the right side of what consumers are demanding today, and they want to know those consumers well from a first-party perspective.\n\nSo, there is more value in this than sort of just how the rules are changing on people. It's something customers are already wrestling with, given all kinds of other dynamics in the market. And it's why we continue to be so excited about segment. Segment CDP capabilities are critical in this context as our customers seek ways to leverage their own first-party data to optimize the dollars that they are putting against those customers and against those outcomes.\n\nSo, they are looking to build deeper relationships, and the only way to do that is through first-party data and through capabilities of a solution like Segment. I'd argue it's more critical in the current environment with the economy in the state that it's in. Each one of those dollars really counts and being close to the customer is just the best way to spend those dollars.\n\nBryan Vaniman\n\nAll right. Next question from Rishi Jaluria from RBC. Can you walk us through how increased mix in non-SMS channels, especially WhatsApp, impact your messaging gross margins? Math would suggest WhatsApp is less than 30% gross margin. We'll do Khozema.\n\nKhozema Shipchandler -- Chief Operating Officer\n\nThanks again for the question, Rishi. So, just to be clear, in the slides that we reviewed today, WhatsApp is not actually included in the messaging data as what we do is classify that separately under our advanced communications or ACP, which is in the other bucket on that slide in the communications revenue chart that we shared earlier today. That said, the WhatsApp channel it grows fast, but it's a relatively small revenue contributor to our overall revenue today. So, it doesn't really have a significant impact on our gross margins.\n\nAnd while we're not commenting specifically on the gross margins for WhatsApp, given its size, it is important to note though that while WhatsApp doesn't have carrier fees like SMS does, we do still have to pay fees for using that channel.\n\nBryan Vaniman\n\nAll right. Next question from Mason Marion from Jefferies. Twilio was always known for a light touch sales model with CPaaS business. What happened over the last few years that pushed you away from this strategy? And maybe we will start with Jeff.\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nYes. Thanks. I'll start. I would say that several years ago we were probably actually underinvested in sales.\n\nAnd so, it was the right decision to grow our sales team. And we saw really strong results in terms of sales growth and new customer relationships formed. But that's, of course, expensive, and sometimes, it's unnecessary for customers to land and succeed on our platform. So, I'd say that we've moved more recently, and we've realized that while we love the sales motion and building those relationships, it makes more sense to put that energy behind our software products versus our CPaaS products.\n\nSo, we're continuing to invest in our product-led growth where we're already best in class, by the way, and to further to make it easier for customers to adopt CPaaS, while we point our sales team though toward our software-oriented products. And Elena, I don't know if there is something you would want to add.\n\nElena Donio -- President of Revenue\n\nYes. So, what that's looked like in practice is a focus in go-to-market on three key things. And I mentioned most of this in my prepared remarks. It's increasing our focus and reliance on automation and self-service, particularly in messaging, focusing our time and attention on strategic solutions, selling rhythms where that's what our client needs and demands of us as we place these more pervasive software solutions.\n\nAnd then third, ensuring we're placing our software solutions much more broadly and deeply. So, it's across those changes that we've made in the organization that are in support of that. And we believe that that's really going to set us up for success for the long haul.\n\nBryan Vaniman\n\nGreat. We have another question from Meta Marshall, Morgan Stanley. Did management turnover at Segment cause some of the underperformance that was discussed today? And maybe Elena will continue with you on that one.\n\nElena Donio -- President of Revenue\n\nSure. Thanks, Meta. No, not at the executive level. I did in my prepared remarks talk about turnover.\n\nBut one of Peter's legacies when he left was that the management team that he built was strong and is largely still in place. So, as I mentioned, we did experience elevated attrition across our sellers. And in particular, that was important because those sellers were the ones that were most knowledgeable about the segment product, about the segment market, competitive landscape, and the customer. As we tried to integrate the sales teams, in my opinion, too quickly.\n\nSo, at this point, we have reramped the sales force, we intend to win the CDB category full stop, with the best product in the market and a newly rebuilt team. Our software solutions require working with sometimes a different buyer. And it requires time to field to build that relationship and that experience. So, there is terrific synergy with certain use cases in messaging.\n\nThere is still, sometimes, new relationships to be built. And so, we feel like the changes we've made within go-to-market, where we're creating that very explicit and specific focus to our software solutions individually, we're just creating deep specialization that we think is required around those buyers. Over time, though, you should expect to see more and more of our sales force ramped. We're starting with them originating business for those solutions.\n\nAnd over time as we get more and more reps under our belts, I think, we'll start to see a lot more lift as well from the field in general.\n\nBryan Vaniman\n\nExcellent. And another question for Elena from Matt VanVliet from BTIG. How much of the company's growth or mix of revenues comes through the systems integrator channel? And how is the company evolving its relationships with these firms to drive more growth?\n\nElena Donio -- President of Revenue\n\nWe have some great relationships with Sis, and as I mentioned during my presentation, those SIs include PwC, Capgemini, Slalom, and others. We do see some revenue generated through those partners, though it isn't necessarily a large contributor today. That said, I see a lot of potential for both global SIs, as well as regionals, especially as our software products mature and claim a growing slice of our customers marketing and engagement strategies, there's going to be a bigger and bigger role for them to play.\n\nBryan Vaniman\n\nAnd the next question is from Mason Marion from Jefferies. How sales team incentives changed to sell Engage rather than CPaaS. And we'll stick with Elena for that one.\n\nElena Donio -- President of Revenue\n\nSure. Thanks, Mason. We have adjusted our sales incentive structures to align them with accelerating software. Put really simply those incentives will be highly biased to selling segment Flex and Engage, plus a couple of other higher margin communications products.\n\nAll that said, we'll continue to grow messaging too. We just want to grow it a lot more efficiently and effectively so that we can begin to drive op margin accretion through all of those channels.\n\nBryan Vaniman\n\nGreat. And moving on to Mark Murphy from JPMorgan. Which pieces of the messaging business are seeing the most deceleration in the Q4 marketing verification or conversational sales and support? And specifically, is the verification piece growing or shrinking? And I think that's another one for Elena.\n\nElena Donio -- President of Revenue\n\nYes. Thanks, Mark. We see the headwinds less correlated to use case and more correlated to external macro trends that impact specific verticals. So, it's more vertically aligned than tied to a specific use case.\n\nAs we mentioned in our Q2 earnings, we saw a couple of areas of softness, areas like crypto, social, and consumer on demand, and this certainly persisted through Q3. We also saw in Q3 some extension of those headwinds into retail and e-commerce. So, that's really where we see it. It's less use case-oriented and more kind of customer-oriented.\n\nBryan Vaniman\n\nGreat. Derrick Wood from Cowen. Elena, it sounds like integrating data platform sale and software solutions sales has been challenging. Could you further explain what changes you've made to drive more effective selling between these two motions?\n\nElena Donio -- President of Revenue\n\nThanks, Derrick. Yes, you're right. We have seen some recent sales performance issues with segment as we tried to integrate too quickly and experienced elevated attrition across the sellers that again, were those that were closest to the product, closest to the customer, or the most knowledgeable. However, as I highlighted in my prepared remarks, we've revamped the sales force, we've rehired, and we intend to win the category with the best product.\n\nOur software solutions require working at times with different buyers. It requires some time in the field to kind of build those cycles, build that experience. But with the changes we've made to my organization overall, we're creating a really deep and specialized organization that is specifically aligned to those solutions and buying personas. But as I mentioned earlier, over time, you should also expect more and more of our sales force to ramp become proficient and expert, and we'll see segment play a much deeper role in the hands of all of our teams over time.\n\nBryan Vaniman\n\nAll right. Got another question from Mason Marion from Jefferies. On the 3Q results, gross profit dollars added year over year continued declining so $99 million versus $120 million last quarter. What's driving this? We understand the gross margin is declining, but we are trying to understand the gross profit dollars and why they're slowing, Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Mason. I think you have the numbers on the revenue growth and the gross margin side for both Q2 and Q3. And so, you can see that revenue growth was slower in Q3 than it was in Q2. So, 41% versus 33%, and during that same time period, gross margins were down slightly more in Q3 year over year than they were in Q2 year over year.\n\nAnd so, the margin decline was largely driven by the higher messaging international mix, which we talked about during the presentation, as well as the new A2P, 10DLC fees in the U.S. The latter obviously doesn't impact gross profit, but some of the other dynamics would.\n\nBryan Vaniman\n\nAnd another question for Khozema from Mark Murphy at JPMorgan. What do you see as the optimal level of organic revenue growth target going forward? Assuming this type of macroeconomic backdrop continues for a while and allows Twilio to deliver non-GAAP op profit? In other words, what is an attractive level of growth?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Mark. I mean, we obviously can't control the macro. And so, what we're really focused on is what we can control.\n\nAnd what we can control is driving more profitability into the business. And we feel very good about our ability to do that. We think we provided you all with a financial framework that we feel very good about in terms of both our revenue, overall revenue guide over the next several quarters, as well as the medium term, our software guide at 30% plus over the medium term. And that's guidance that we feel comfortable with.\n\nAnd I think the one thing to maybe underscore is, is that whatever the economic cycle and in spite of how gross margins or anything like that plays out, we feel very, very good about our ability to continue growing the top line but, in particular, to drive op margin accretion.\n\nBryan Vaniman\n\nAnd a follow-up question from Mark Murphy, again, for Khozema. Mechanically, how will revenue growth in Q4 fall below the Q3 DB&E level of 22% expansion?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Mark. I mean, it's obviously driven by macro right now. And we are feeling the impacts across a variety of industries that Elena called out a moment ago.\n\nGiven the majority of our revenue is usage-based and tied to consumer activity, when the economy comes down, that slow down does impact our revenue faster than a subscription-based model would, for example, and when the economy improves, kind of goes the other way. And so, we would anticipate that we would see some downs relative to that expansion rate play out over the next quarter or so or for however long the macro plays out in this way.\n\nBryan Vaniman\n\nGreat. Next question. Meta Marshall, Morgan Stanley. Understand that cross-sell opportunity within customers but how often is it the same buyer between messaging and the software business? And that's probably a good one for Elena.\n\nElena Donio -- President of Revenue\n\nYes. I mentioned during my prepared remarks, our most common messaging use cases in each of the logical buyers of these use cases across marketing verification and conversational sales support. Each messaging customer in these areas, it could be a logical buyer of our software solutions, but it doesn't always necessarily mean that we have relationships across the board. So, they certainly can ladder up to those incremental sort of software needs because ultimately that's where the need for the message may have originated, but it doesn't mean it's the same people all up and down the chain.\n\nAnd so, we think there's a very natural door opener there, and we're working to make sure we push through that door. But we also recognize that, to do our jobs well, we've got to not only do that, and we've got to not only leverage the relationships we have with the existing customers and those existing specific buyer personas and relationships, but we have also got to build relationships with the key decision makers where we don't already have them. So, good sort of functional alignment, not always necessarily the same people, but we think that gives us a lot of room to go and build the right relationships if we don't already have them.\n\nBryan Vaniman\n\nGreat. Thanks, Elena. Another question from Rishi Jaluria from RBC. How do we think about the authentication business given what Apple's doing with biometrics? Maybe that's a Jeff question.\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nSure thing. Yes. So, the majority of our one-time password use cases are to prove that the phone number or device is owned by that user. And Twilio's Verify and our programmable messaging products continue to be a key SMS solution for establishing phone and device ownership.\n\nBy the way, you also see our silent network off that we just announced, does a similar thing proving you are the identity that you claim to be. Now, Fido is used to simplify returning users logging back in only after that phone number, device ownership has already been established. Furthermore, Fido typically replaces the password factor of 2FA. So, for true 2FA, you would still need a second factor, which we expect to remain predominantly SMS OTPs for that verification of, are you who you say you are? Now, we do see the industry adoption of Fido and WebAuthn as a really important step in simple and secure authentication.\n\nAt the same time, it all also adds to the matrix of technologies a developer needs to integrate with. So, we see it as an opportunity for Twilio to help simplify that developer experience overall, including integration with Fido WebAuthn, which is something we're actively exploring. And I know they can look similar, but for a person who gets a new phone, Fido, WebAuthn, or a new computer or any of that is not set up. So, you need a different way to establish the customer mapping to that device and that's with a identifier that you use to communicate with them.\n\nGenerally, a phone number or an email address. Once you set that up, then Fido, WebAuthn can be useful. And I think that's the real distinction.\n\nBryan Vaniman\n\nGreat, Jeff. And maybe a follow-up from Rishi as well. Can you expand more on why your end of life being the Zipwhip business messaging and what the plan is for that asset going forward? And remind us of why you bought Zipwhip.\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nI got Eyal sitting next to me. I'm going to have Eyal answer it.\n\nEyal Manor -- Chief Product Officer\n\nThanks for the question. Well, I want to be clear that we announced these plans last year at the time of the acquisition with the target of end of life of the software at the end of 2022. However, we recently extended the end-of-life date to the end of 2023, but this isn't all of Zipwhip. This only refers to the software part of Zipwhip business and SMB app for small business to text, which was relatively small from revenue standpoint.\n\nWhen we look at it compared to Frontline and our other products, there is some duplicative functionality. So, we're going to combine efforts and make it so that we jointly deliver on products that really provide the best of everything that Frontline's offer, as well as what we've done in those teams and technologies together to deliver first-class product experiences to our customers.\n\nBryan Vaniman\n\nAll right. We've got a question from Oscar Tejada at Wolf Research. Are you willing to start guiding the gross profit dollars instead of revenue growth? And that sounds like a Khozema question.\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Oscar, that's a really good question actually, especially given what we highlighted today and given our focus on gross profit dollars. I don't want to say anything definitive today necessarily, but I think it's definitely something that we're going to have to consider.\n\nBryan Vaniman\n\nGreat. Next question, Meta Marshall, Morgan Stanley. You've been hiring enterprise sales reps since Flex was introduced in 2019. And in investor conversations, you noted that you were in the fifth inning of these at the end of 2021.\n\nWere some of the missteps with these reps that caused the need for continuous hiring? And that's a good question for Elena.\n\nElena Donio -- President of Revenue\n\nThanks, Meta. I'm confident that we've built a strong sales team and we'll execute on our software plan as we continue to roll it out and embrace that motion. We have now dedicated focused reps on Flex and Segment. For the first time, they're 100% oriented to winning customers for these solutions entirely.\n\nThat's a big part of the change that we made here in 2022, less dilution in focus, more alignment to software. Segment and Flex both have good product market fit, too. I feel great about our solutions, but I also feel really good about the steps we've taken to address the issues that we're getting in our way. And as we've said the Segment team now is rebuilt and Flex is gaining new and exciting traction as well in these new contacts and how we've set up those teams for success.\n\nBryan Vaniman\n\nGreat. And we have a question from Rishi at RBC. Ninety days ago, you talked about being cautiously optimistic on 30% growth. Now you're talking about 15% growth.\n\nWhat got that much worse in the macro environment in the last 90 days? And Khozema, do you want to answer that?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. I mean, we got a little bit higher than 15% in Q4, and we obviously provided you with a range over the medium term, but it's a fair question, Rishi. During the course of Q3, we like many other companies, and I think you've seen this in their results too. We just noticed a much broader impact as a result of macro slowdown across a variety of industries.\n\nAnd I think previously we called out, for example, crypto and social. I think more recently we're seeing additional impacts, for example, in retail and e-commerce. And given that the majority of our soft -- excuse me, as with the majority of our software peers, we're just kind of feeling the impacts of this kind of broader macro slowdown. And given that we're predominantly usage-based, we are tied to consumer activities such that when the economy declines, we feel those slowdowns a lot faster in our business model than you just would in a subscription-based business model.\n\nAnd I think equally, when the economy improves, we would expect to see a faster overall recovery than what some of the subscription folks would feel. We feel good about what we put up in Q3 and I think it just made more sense to us to be a bit more cautious in the near term, certainly based on the way that we're guiding.\n\nBryan Vaniman\n\nAll right. Next question is from Michael Turrin from Wells Fargo. Appreciate all the detail here. On the messaging side, is there anything you can do to control the scale of fee impacts? Is there a level of gross margin you wouldn't allow the business to dip below? And how to think about free cash flow in the context of the margin targets?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Let me just take those in reverse order, Michael. So, first of all, in terms of free cash flow relative to margins, what we said during the course of the day is that we intend to be non-GAAP operating profitable and to continue driving additional leverage in the coming years. And so, I think what you should really read that as, as an indication that free cash flow will follow shortly thereafter.\n\nI mean, a company that generates profitability, obviously you would expect to be cash flowing, and so there's always some timing impacts associated with these sorts of things. But ultimately, we should expect that cash flow to come through kind of behind the operating margin that we'll deliver. In terms of the gross margins, I think the line for us would be if the gross profits that we were delivering wouldn't hurdle what it would cost to distribute them, such that we weren't a profitable business. And so, what we think about all the time is, is that as we drive top line, as we generate gross profits that we ensure that we do that in an efficient fashion.\n\nAnd as long as it drives up margin accretion, I think we'd feel quite comfortable based on the unit economics that we took a lot of time to explain during the courses of today. The fee impacts, I mean, that's not really something that's within our control. What I will say about it is, is that while the fee impacts create some noise around our gross margins, at least they don't impact the economics of the business. They don't impact the profits that come in, but we haven't really seen any real impacts on demand either.\n\nBryan Vaniman\n\nAll right. Moving on to Will Power of Baird. It's great to see the commitment to non-GAAP operating profitability in 2023. What's the timeline for positive and growing free cash flow? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Will, it's kind of the same answer. We talked about our plan to deliver free cash flow during the course of the presentation in kind of the near to medium term. We define the medium term is three to five years, so that really gives you the timeframe. Obviously, from our standpoint getting to cash flowing starts with delivering non-GAAP operating profitability and I think as we do that, the cash flow will follow shortly thereafter.\n\nBryan Vaniman\n\nAll right. Back to Michael Turrin from Wells Fargo. What gives confidence that the software business can outpace the overall business? Is there a target mix for how much software you're looking for medium-term? We'll go to Elena for that.\n\nElena Donio -- President of Revenue\n\nThanks, Michael. As I discussed during prepared remarks, as well as a couple of the prior questions, we are shifting a good deal of our sales focus and resourcing to software, as well as our sales incentive structure will also be highly biased toward selling Segment and Flex in the near term. We're not going to provide a target mix for software, but obviously, over time, we do expect that the portion of our business -- that portion of our business becomes more and more meaningful over time.\n\nBryan Vaniman\n\nAnd another one for Khozema from Will Power at Baird. Can you break down the sources of the weaker Q4 growth messaging versus voice versus software, etc.? And was there any geographic breakdown of softness that you felt?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Will. I'm not going to provide more disclosure than we gave today. But the macro decline that we're seeing, it obviously impacts our usage-based businesses more significantly. And so, given that messaging is a pretty large contributor, you can imagine that it's also contributing to the lower growth than we're seeing versus prior periods.\n\nBryan Vaniman\n\nAnd another question for Khozema from Meta Marshall of Morgan Stanley. Are all international regions at a higher gross profit dollar per message? And have you evaluated stepping away from regions where the economics don't work?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHi, Meta. Great question. Yes, and we have, actually. There are regions that we won't operate in because of the economics that I described before.\n\nIf we don't generate gross profit dollars, that hurdle our ability to distribute those efficiently, and such that we can't generate operating profits, we will not participate in those markets. And there are some around the world. What we showed in the presentation though, is that we do generate attractive gross profit unit economics, and look, they do bounce around from time to time just given that we're constantly terminating messages in different places based upon the needs of our customers. But as long as we can do that efficiently, as long as it drives up margin accretion, I think we'll continue taking that business.\n\nI think the other thing that you obviously know being a long-term follower of the business is that messaging also serves as like a very effective land with new customers. And you heard Elena talk a lot about the engagement side of our business and what we want to do specifically with Segment and Flex engage. And I think as we grow internationally, it provides us a really unique opportunity to distribute -- excuse me, to distribute some of those products as well.\n\nBryan Vaniman\n\nAll right. Next question, Mark Murphy, JPMorgan. How are customers responding this far to the SMB pricing priest, which went into effect back in May? Do they view it as a reasonable ask during these inflationary times? Or could it adversely affect some of the messaging volume by making some of it less economic? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Mark. They don't really affect customers who are locked into a fixed-price contract. And so, we really haven't seen a material impact as a result just yet. I think over time, obviously, those fixed price contracts will come up for renewal, and as they do, we would anticipate that those price dynamics flow into those new contracts.\n\nObviously, one of the reasons that we did it was because we saw inflation in the environment. And so, we felt it was a fair response given what we were seeing.\n\nBryan Vaniman\n\nAll right. Moving on to Ryan Koontz from Needham. If we should focus on messaging profits, will you be reporting that metric every quarter? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Ryan. No, that's probably not going to be a metric that we provide on a quarterly basis. We will give software. Jeff talked about that in his closing remarks, that that's an additional disclosure that will give you quarterly.\n\nAnd I think there's a smart question asked earlier in the Q&A about guiding toward gross profits, and I think that's something that we'll think about.\n\nBryan Vaniman\n\nOK. Ryan McWilliams from Barclays. How should we think about the year-over-year AR growth for the software segment? How should we think of the potential for Engage and is it a stand-alone option? Or is it a up-sell on top of Segment? Maybe Khozema you want to start with that?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. I mean, we feel pretty confident with the profile, as well as the growth of software, and I'd say for Engage that given that the product just launched. And given that segment is it'll be predominantly subscription-based. I think we'll be focused on just building up our bookings really over the next year.\n\nThe pricing for Engage is pretty similar to Segment where companies pay to manage the data for a specific number of their monthly customers. And so, there could be some overall excuse me, some small overages if they exceed the contracted number. But I think that's something that we're still evaluating. I think also, like some of our other software products, Engage has a high gross margin profile.\n\nSo, over time we would expect that that'll contribute to both growth, as well as margin expansion as it becomes a larger part of our revenue stream. And early customer feedback is such that it's pretty strong. So, we're pretty optimistic about the future of the product.\n\nBryan Vaniman\n\nAnd maybe -- Jeff, do you want to talk about whether or not stand-alone or an up-sell on top of Segment?\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nYes, sure. I mean, they go together. I mean, the short answer is you can't buy Engage without having a CDP, the data that powers it. And so, Engage is built natively on top of Segment and all the Twilio's channels.\n\nAnd this is a key advantage for us because as we enter this multi-channel space. By being built on top of CDP, natively integrated real-time, great data foundations, we can produce real dollar results for companies by having that real-time data, and really about, it's about activating that data. So, as a consumer forms an action, like, they're browsing the site, they're scrolling, they're clicking, they make a purchase, we're able to activate or for example, suppress audience actions in real time. That means consumer makes a purchase, and our customer wouldn't have to spend more money on Facebook or Google to try to get that ad.\n\nAnd that's sort of how we've talked about in our conference today, how certain customers like Domino's was able to get a 700% increase in the return on ad spend because they're getting a lot smarter about how do I understand my customer base and, therefore, target ads better and save a ton of money. And I think that is where the real value of a CDP comes into play. Like you first of all get the data in real time and assembled in very sophisticated ways, do the identity resolution, know who those customers are, but then you don't just have data sitting there, you actually act on it. You do something with it.\n\nYou buy ads more intelligently. You trigger campaigns, personalized journeys including conversations between a sales rep. I mean, there's all sorts of things that can be triggered based on what you know about the customer at that point in their journey. And so, that's where we see the value of Engage.\n\nBut the short answer is yes, there's like a basic version for our marketing. There is a segment CDP version, and then there's the full version, which is Twilio Engage, which activates all those capabilities, data plus marketing together.\n\nBryan Vaniman\n\nGreat. Thanks, Jeff. Moving on follow-up question from Mark Murphy from JPMorgan. What effect do you expect to realize from the employee sabbatical program you recently put in place, for instance, better retention of tenured employees? Or do you expect to see a wave of employees coming back to work with their batteries recharged at some point next year? Maybe, Jeff, want to answer that?\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nI mean, in short, yes, right. We want our employees to be productive and energized, and the sabbatical program is a unique benefit we've decided to provide that allows for that. Longer term, we think it'll be attractive for employee retention, too.\n\nBryan Vaniman\n\nGreat. Moving on next question Marcelo Lima from Heller House. How do you think Twilio achieves the 20% operating margin target? Is it fair to say, at 3%, it'll take six years? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Marcello. We provided a clear framework today for you all to think about non-GAAP profitability. We do expect to be profitable starting in 2023 and then to increase our operating margins by one to 300 bps per year after that, beyond that we're just not going to give specific targets by here.\n\nBryan Vaniman\n\nGreat. Next questions from Bilal Chaudhry from Blackstone. If you were to pursue M&A, what would be the most attractive areas to look? Khozema, you want to follow up?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. I mean, I would say with emphasis that we talked in the presentation about the fact that we're very focused on organic growth right now. I think we've got some fantastic products in our portfolio. Elena talked a lot about what we can do with Engage with Segment.\n\nEyal talked a lot about the innovation that he's driving into those products. And so, right now I think we're really, really focused on what we can do there, as well as in the big opportunity that we see in Flex. And so, M&A, quite frankly, is a lower priority option. I think we want to maintain some optionality.\n\nThat's why we have the cash that we do in part at least. And so, I think if we were to do something, we would probably do it around some of those areas and, probably in particular look at stuff that was AI-oriented that would advance the capabilities of those products.\n\nBryan Vaniman\n\nGreat. Next question, we actually had a similar question from Ryan McWilliams at Barclays and Taylor McGinnis at UBS. How should we think about the balance of how macro in recent go-to-market changes could have impacted the growth stepped down implied in the Q4 guide? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Ryan. I would say the go-to-market changes had no impact. We talked about the fact that if in fact, we had the exact same workforce size and the go-to-market organization even now that I don't think it would've really impacted the way that we ended up guiding in Q4.\n\nI think in large part what we're seeing is, is that there's going to be kind of a macro environment here that we're feeling the impacts of like a lot of other software companies out there in the marketplace. We called out some of the categories in which we're seeing that, and I think that's really what's impacting our guide, and the fact that we're usage-based, it probably tends to impact us a little bit faster on the way down. And I think as the economy recovers, I think you can probably anticipate that we'll recover faster on the way up.\n\nBryan Vaniman\n\nGreat. Next question we have from a few of the analysts, I think more of a clarification question. Are the business metrics provided today only going to be made available annually? And will you break out software quarterly?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes, the framework that we provided you with today, we're going to provide those metrics quarterly. You get four out of the five of those on a quarterly basis anyway, you can see them in our published financials. And then as Jeff commented in his closing remarks, we're also going to give you software quarterly.\n\nBryan Vaniman\n\nGreat. Next question is from Nick Altman at Scotiabank. You guys seem to be more focused around profitability than ever, but I think some are confused as to why you didn't put a stake in the ground around 2023 op margins. Can you give us a bit more color around how we should be thinking about 2023 op margins, especially on the heels of the restructuring, and whether you're going to reinvest those and whether you're going to reinvest those dollars? Khozema, you want to speak to that?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Nick. We're not going to provide a range for 2023. I mean, I think we've been saying actually as far back as a year ago that we intend to be profitable in 2023.\n\nAnd that's really what we're committed to. I think importantly we're also going to drive leverage over the medium term, and we called out driving a 100 bps to 300 bps annually. And so, you can anticipate that there's going to be not just profitability next year but op margin accretion thereafter. And otherwise, we're not really reinvesting what we did through the restructuring.\n\nHowever, we have continued to make investments in software, as I all articulated, because we do think there's a lot of really interesting innovation that we can drive there for our customers.\n\nBryan Vaniman\n\nAnd it looks like Michael Funk from Bank of America and Ittai Kidron from Oppenheimer both had a similar question around what are we assuming for pricing/competitive environment in your medium-term revenue forecasts.\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes, I don't think that there's really going to be material differences in either relative to what we've seen historically. I mean, I think there was a question earlier about the price increase that we pass through and in a number of our products in particular U.S. messaging. And I think at some point, that'll probably have somewhat of an impact on our financials especially as these fixed-price contracts roll off.\n\nI think competitively, we have competitors in a number of different products. They're different product to products, so it's kind of hard to answer that question as well. But those competitors range from agile digital natives to some of the larger software giants. And I think in spite of whatever happens in the competitive environment, we feel really, really good about our positioning.\n\nIt's helpful to have a leading CPaaS. It's helpful to have a leading CDP and when you have the best products in the marketplace the next step is ensuring that you distribute them effectively and efficiently. And I think Elena's given you a lot of evidence that we'll be able to do that in the coming years.\n\nBryan Vaniman\n\nAll right. Taylor McGinnis from UBS asks, you mentioned annual opex savings from restructuring slower pace of hires and reduced real estate of roughly $330 million. Would that be incremental to the guide to hit profitability next year? If we extrapolate the growth implied in the 4Q guide to next year, it seems to imply 700 basis points to 800 basis points of margin tailwind. So, can you help us think through the potential benefit here?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. I think, Taylor -- this is Khozema. I wouldn't anticipate that we're going to drive 700 bps to 800 bps next year in terms of op margin, op profitability. I think what we've committed to is being non-GAAP op profitable next year, and we're going to do that.\n\nI think what you can count on is 100 bps to 300 bps thereafter. And if you look at the financial framework, as well as some of the restructuring that we talked through, we gave you some ranges in terms of some of the actions and what kind of cost out that took, as well as where those impacts were felt in terms of our different opex lines. And we feel good about our ability to be profitable and then to drive up margin accretion going forward.\n\nBryan Vaniman\n\nGreat. Ryan McWilliams from Barclays asks, how should we think about the medium-term trajectory for international messaging gross margins? Kho, you want to talk to that?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Ryan. I mean, we gave you a sense of it in the charts that we shared today. I mean, it's generally pretty stable.\n\nI mean, the unit economics, as we showed you, are actually -- they have been improving over a period of time. So, we feel pretty good about that. I think in general as we tried to explain a number of times today, like gross margins aren't per se the focus relative to the way that we think about the messaging business, as long as we can drive incremental gross profits into the business, as long as we can distribute those gross profits efficiently and drive additional op margin accretion, I think we want to take on that business. And the margin rate will be less of a consideration than the gross profit dollars and the overall op profit dollars that we bring into the business.\n\nBryan Vaniman\n\nGreat. Next question from Phillip Santos. What makes Engage's value proposition so special for customers versus competitors like Breeze? Activation through Twilio's CPaaS is something they can do as well. Is it more about the cross-sell into your customer base? Maybe, Eyal, do you want to talk about the product?\n\nEyal Manor -- Chief Product Officer\n\nYes. We've seen a lot of customer excitement and momentum around Engage, time and time again we receive feedback that marketers have to wrangle data and then manually upload CSVs or wait 12 hours to send real-time messages. We now offer a fully integrated offering. With Engage, Twilio puts the power of data teams and the reach of our reliable Twilio channels into the marketers' hand, so they can focus on building engaging campaigns, instead of dealing with challenges around infrastructure or integrations, marketers have been able to reduce the time for real time messages to truly real time and send smarter more targeted messages to more detailed segments and the appropriate time on the customers' journey.\n\nAnd that's a big differentiator for them.\n\nElena Donio -- President of Revenue\n\nYes. So, in addition to Eyal's points about product, we really believe we need to be market-leading across all of these dimensions to compete effectively. But its early days in this market, I think there's still so much land to be covered. Breeze's share is small, and we're going after a huge market with legacy players with new and unique needs on the behalf of our customers and a lot of change in dynamics.\n\nSo, we think all of that creates an environment for us to really win, whether there are point competitors here and there, there's still a massive open market opportunity for us.\n\nBryan Vaniman\n\nAll right. Michael Funk from Bank of America asks, how are you thinking about discounting within your complete set of customer engagement, messaging, or other comp solutions to gain market share and retain customers? Maybe, Elena, you want to follow up on that?\n\nElena Donio -- President of Revenue\n\nYes, you bet. And I think Khozema laid out a little bit of framework for thinking about our messaging products, for example, and really the name of the game there is profitability. We don't think we need to be doing a lot of discounting there. And what we need to be doing is creating efficiency below the line in our sales organizations and elsewhere.\n\nAnd we talked a little bit already about how we're going to do that, so I won't get in into that too much. Holding the line on pricing is really, really important to us, and we believe we can do that because we've got solutions that warrant it. On the software side, where there are places where we want to work on massive sort of land grabbing, and we've got room to do it. We will, but that said, we have -- we believe we have the best products out there.\n\nAnd so, we think we've got power in this area, and we intend to make sure that our values really recognized in the market that we're selling that value, that we're creating the right solutions, and that we maintain the right kind of unit economics across all of our products. But really, the dynamics of these products economically are different. And so, we might have more room to be creative in other -- in some areas and less room in others, but I think when you have great products to bring to bear, it's not as difficult as it might sound to thread that needle.\n\nBryan Vaniman\n\nNext question from Mike Walkley, Canaccord Genuity, with the comments that have short-term headwinds, given the macro environment, are there certain end markets harder hit than others? While I realize you're providing quarterly guidance for 2023, is the macro environment so uncertain that it might be challenging for Twilio to meet the lower end of your 15% to 25% medium-term target in 2023? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Mike. I mean, we gave you some of the end markets that have been impacted where we've seen impacts in our business. For example, we called out crypto.\n\nWe called out social. I think we've called out retail, e-commerce, for example. So, those are all pretty consumer-sensitive areas and you've seen other companies call out headwinds in some of those industries as well. And so, not surprisingly, given the usage-based nature of our business, we felt those impacts in ours as well.\n\nI'd say the macro environment certainly is creating some uncertainty, but I mean, I think we provided guidance for the fourth quarter that we certainly feel comfortable with, and I think we feel pretty confident in our medium-term guidance, and we think that's a really good framework for the next several years.\n\nBryan Vaniman\n\nAnd maybe a follow-up question to that from Nick Altman at Scotiabank. How should we think about revenue and gross profit growth in 2023?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Nick. We're not going to guide to 2023 beyond what would we've said in our financial framework. We provided a guide for the fourth quarter. We provided a medium-term framework.\n\nWe mentioned that we're going to be guiding to quarter to quarter just given them volatility in macro. And I think we feel good about the financial framework that we put out there. And I think you should think about our results being in that range with a particular focus on being profitable.\n\nBryan Vaniman\n\nAnd Alex Zukin at Wolfe has the following question: How are you thinking through the incremental execution risk of changing your go-to-market strategy in a fourth quarter as the macro conditions deteriorate? And how should we be thinking through modeling those impacts into fiscal year 2023?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Alex. This is Khozema. Maybe I can start and then if Elena wants to add anything she can.\n\nWhat I would say is, is that the financial framework that we provided you all with today is based on the fact that we took a number of actions in Q3, and we did so with eyes wide open. And as we mentioned, nothing that we guided to in Q4 was impacted by any of the changes that we made in that organization. And in particular, we also feel quite good about the way that the medium-term setup looks. I think we feel great about the different products that we have in the portfolio.\n\nMacro definitely does create some uncertainty, but I think our framework is a good one. I think that both between our ability to innovate, as well as our ability to distribute and then obviously drive leverage across all of our cost categories over time. I think we feel really good about the medium-term setup.\n\nElena Donio -- President of Revenue\n\nI would just add that, though, we did take these cost actions recently. The movement toward focus is something we started a bit before that and we coupled it with cost actions here in September and just feel like that drive toward focus across our buying personas and products was the right answer, whether or not there's economic headwinds. And the cost actions just give us a moment where we're going to get more creative, we're going to demand more of our -- of automation and of self-service, and we believe those are the right things to do. And as Kho mentioned, we don't think they created incremental risk.\n\nWe think they put the onus on us to continue to execute in this dynamic environment.\n\nBryan Vaniman\n\nGreat. And Mason Marion from Jefferies has a question. If you think back to the 2020 when you issued the 60% gross margin expectations, what were your assumptions around messaging growth versus software? And then how did reality compare? And I actually think the 60% gross margin was -- part was made at the 2016 IPO. Just to clarify, but maybe, Khozema, you want to talk about that?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes, sure. Thanks for the question, Mason. So, a couple things there. I think number one, as you think about the 60% back in 2016 relative to where we are today, what we definitely did not anticipate is a series of fees that have taken place within that timeframe.\n\nAnd I think what a lot of folks don't even remember sometimes is that we broke out just today that there's been a 240 bps drag over the -- on our corporate gross margin rate just as a result of fees. Zero impact whatsoever on the economics of the business, don't impact gross profits, but the math of it impacts gross margins without driving any underlying changes in the business. And for long time -- long-term followers of the story, what you'll probably remember is, is that we've had prior instances of fees as well that have driven similar margin drags again, no economic difference in the business. What I would say, as well as is that messaging growth has just been really, really strong.\n\nAnd quite frankly, that's a problem that I love to have. I mean, I want that dynamic all day long. Definitely, it accelerated during COVID for sure. We had higher international growth.\n\nThat was in part because we have been making investments internationally. And so, I think all of those dynamics are upside dynamics that we didn't originally forecast. Yes, they had some impacts on gross margin. But where we're really focused going forward is that as long as we're generating gross profits across the board, whether it's domestically or internationally, we feel really good about the setup for the business.\n\nAs far as software goes, as we mentioned with respect to Flex, I mean, it's a $100 million run rate business, its $162 million if you include some of the pull-through revenues that I think our competitors would include. We feel really good about the progress of that business. I mean, we're just four years in to be able to have that sort of a run rate, it feels quite good. And now we've obviously got Segment.\n\nWe've organically developed Engage, and we feel great about kind of the next wave.\n\nBryan Vaniman\n\nAll right. And Nick Altman with Scotiabank has a question. How do you guys ensure sales attrition doesn't continue given your changing comp plans in tweaking the go-to-market on the messaging side? And that's probably a good one for Elena.\n\nElena Donio -- President of Revenue\n\nThanks, Nick. It's ultimately my job as the leader of the go-to-market organization to ensure we've been able a plan where each AE can achieve, can earn their on-target earnings, can develop as a sales -- as a salesperson or a sales leader, and that they see a path to winning as a team. I think coupled with that we want people that can attach to our mission and purpose. All those things together I feel like are very achievable going forward and I think we provide a great overall employee value proposition at Twilio.\n\nAnd just the number of things that people can come here and achieve and grab onto is high. And so, I -- while attrition is certainly always on our mind, and we've always got to stay sharp and build the path to that execution and delivery I feel comfortable that we're going to land that.\n\nBryan Vaniman\n\nGreat. And a follow-up question from Nick. When did you guys make the choice on the political side to stop working with some of those customers? I think some people are a bit confused giving you messages earlier, how there was going to be a benefit in the second half. So, was that more of a recent decision? Jeff, do you want to take that one?\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nSure, I'll take it. Look, we have set out acceptable use policies and along with the carriers have rules about when you can text a customer and that requires an opt-in. You have to opt in to receive a text message. The political campaigns have long maintained that they don't need to have an opt-in that just taking a phone number from a voter roll is enough to enable them to text a customer.\n\nAnd I think as many folks in U.S. have found, like that's pretty annoying. And while it is technically legal, I believe because there was a carve-out in legislation it is not what consumers want and it creates a lot of complaints with carriers. And so, after the 2020 election, we worked with carriers to refine the rules about how a political texting should be governed.\n\nAnd we rolled those out to our political texting customers and those who said they would abide by the rules of getting opt-in for customers. Those are the organizations for whom we still have traffic. But a whole lot of them said they did not want to abide by that, and we said we would part ways with that traffic. And we weren't entirely sure exactly which customers would say they were going to follow these rules and which weren't.\n\nBut I do think we've always said that political traffic while it could provide a bump is immaterial to the general story of Twilio. And I think that continues to be true, although we did exit a bunch of this business because we thought they were not good for carriers and not good for consumers.\n\nBryan Vaniman\n\nAll right. And Matt Stotler from William Blair asks, it's good to see the announcement of general availability for Twilio Engage; however, this is a marketing focus product and marketing budgets tend to be impacted by weak or uncertain economic times like we are currently experiencing. How does this setup impact your expectation for the pace of adoption for Engage going forward? Elena?\n\nElena Donio -- President of Revenue\n\nYes. Thanks, Matt. Engage and Segment are making our customers more efficient with their spend, and I think that's actually particularly important during these kinds of economic times where even one wasted ad or wasted click on a less well-targeted customer is reason for concern. And so, this is a time and space where of course there's more scrutiny.\n\nWe talked a little bit about sales cycles and people wanting to have a try before they buy experience and things like that across all of our products. We understand that and those things we're prepared for, but we think largely in an economic time like this, when each marketing dollar is very precious and difficult to come by, our customers actually need Segment and Engage more than ever to make sure that those marketing dollars are the highest efficacy possible. So, we think that's what customers are looking for in this market. That's certainly playing out in our conversations both in one-on-ones and walk-in-the-halls this week at SIGNAL 2.\n\nBryan Vaniman\n\nOK. Meta Marshall, Morgan Stanley. Since you don't appear to commit -- to be committing to the restructuring being incremental in 2023, what changed in the environment that made you need to make the change late in the year when the goal had been out there for much of 2023? Or did it just take a while to identify what changes needed to be made to drive to the non-GAAP operating profitability commitment in 2023? Khozema, you want to take that?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Meta, that's a good question. I mean, I think as you can probably appreciate, like, it was a really difficult decision for us to undertake and in concert with that it was an incredibly confidential thing that we were evaluating for some time. We wanted to be very planful about the way that we did it and it was just like not a set of information that we could really share with investors in advance of determining what needed to be done internally, sharing it with employees first, and then only after we did all that was it appropriate to share it externally.\n\nAnd so, I think it had been kind of part of our framework for 2023 as part of getting to profitability, and it just wasn't something that we could share previously.\n\nBryan Vaniman\n\nNext question is from Taylor McGinnis at UBS. You mentioned the potential to see gross margins stabilize/appreciate in the near term. When you look ahead, what are you seeing in the growth trajectories and view of the market opportunities and messaging versus software that gives you comfort that this mix shift could start to occur given the focus on continued messaging growth in some of the go-to-market hurdles in the software business? Are you able to provide color on the level of growth you're currently seeing from these businesses and the path to how they could evolve over the medium term? Kho, you want to follow up on that?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Taylor. Just to maybe parse the question a little bit because I think it's important to provide a few clarifications. I think first off, you know, we do anticipate some variability in terms of gross margins, and I think it's worth underscoring, again, that with messaging, in particular, we really want to orient the business around gross profit dollars.\n\nWe think that there are a lot of gross profit dollars out there to go get, as long as we can distribute those gross profit dollars efficiently and drive op margin accretion; we think that's a good way to grow the business. And we also think it, and it lands us a number of customers with whom we can grow off of over time. So, that's important to us in, in two different ways. I think beyond that, look, it's going to take some time, but I think that the software business is growing well, it's obviously growing based on the framework we provided you today.\n\nWe intend for it to grow at a faster rate than the other parts of the business and it's just going to take some time to catch up. I think that we're working through some changes obviously that both Jeff and Elena alluded to with respect to segment. I think we're seeing great momentum on the Flex product, and I think as time goes on, we have a chance that -- growing at materially higher rates than what we've talked about today. And I think as that happens, it'll change the mix of gross margin over time.\n\nBryan Vaniman\n\nGreat. And Matt Stotler from William Blair asks, give him the substantial headwind that pass-through fees create on the gross margin line. Why do you recognize that revenue on a gross basis instead of a net basis is a net basis a possibility? Kho, you want to take that one as well?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Matt. I mean, it's not really a possibility in that. We're obviously, I'm not trying to be flipping or anything, but we are an SEC filer, and we have to report that revenue on a gross basis.\n\nI mean that those are the regulations that we have to contend with, and so that's why we do it the way that we do it. That said obviously the way that we run the business has to be very much from the standpoint that whatever the gross profit dollars are that we generate are the ones that allow us to pay for the various opex categories that sit within the business. And so, to the extent that the fees are not just the incremental fees, but the carrier fees altogether are a pass-through that hits both the revenue line, as well as the cost line that is kind of how we think about running the business. And I would say increasingly the way that we even think about our opex categories is such that we view them as a percentage of gross profit versus as a percentage of revenue because we just think that's a more responsible way to run the business.\n\nBryan Vaniman\n\nAnd we have another question from Philip Santos. Can you please explain exactly what are the differences between Segments product and Engage? What is the additional value proposition and how does it differentiate from competitors? That's probably a good one for Eyal.\n\nEyal Manor -- Chief Product Officer\n\nYes. Thanks for the question. Segments takes data from multiple sources and turns it into usable profiles and customer audiences, then Engage activates and deliver a highly powerful marketing automation solution that creates massive customer value. Data is no use if it's just sitting there.\n\nSo, Engage activates the data. There are markets for both, but they are much, much better together, using segment CDP capabilities data can be leveraged in real time to help create personalized marketing campaigns, which can be sent to end consumers via communication platform. This ultimately helps our customers deliver higher lifetime value while lowering their customer acquisition costs and building lasting meaningful relationship with their customers.\n\nBryan Vaniman\n\nPerfect. And another question from Nick Altman at Scotiabank. Following up on the SBC question, what delusion are you guys targeting on an annualized basis? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Nick. We're not actually providing specific dilution targets. However, we are very focused on driving SBC costs down as a percentage of revenue, and we've given you a framework to think about that over the medium term.\n\nBryan Vaniman\n\nGreat. And another question from Rishi at RBC. The details today implied that software is roughly a 79% gross margin. Is that a fair steady-state margin, or is there a plan to drive software gross margin expansion? Kho?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Rishi, your math is about right. I would say -- and I think that as we experience success as we intend to and certainly scale in the marketplace. I think over time, we do have an opportunity to grow those margins. But I think right now, we feel good about the starting margin rate and we're just very focused on distributing the product effectively and efficiently.\n\nAnd as we do that, we'll see the benefits of that over time.\n\nBryan Vaniman\n\nGreat. Question from Ittai Kidron at Oppenheimer. Can you talk about the competitive environment? Are you seeing more pricing pressure? Are customers fully interested in consolidating into one platform and anything you can share on win rates? Elena?\n\nElena Donio -- President of Revenue\n\nSure. Given our broad product portfolio, we see various levels of competition and there's certainly different competition within different product areas, as well as different markets. While areas like messaging are pretty fragmented, CDP is a little bit more crowded space with some large software companies involved. I think we talked a little bit about that earlier.\n\nSimilarly, with the launch of Engage, we expect that we'll be competing against some of the established marketing cloud vendors in the market. And I think I hit earlier why we believe we continue to win in that environment as well. We have seen a couple of instances of longer sales cycles, which we've talked about, but broadly speaking, the changes haven't been material and our win rates remain solid across the board, even though growth is down from the highest scene in 2021, we don't believe we're losing share. We continue to price competitively.\n\nAnd we have raised prices across some of our comms channels over the past year as well. So, the average price per unit for core messaging, for example, while influenced by geographic mix and other factors continues to rise across all sales segments. So, we feel good about the competitive environment and our ability to continue to win within it.\n\nBryan Vaniman\n\nGreat. Next question, Michael Turrin from Wells Fargo. How should we think about timing of when to expect to realize those annual benefits that were mentioned from the restructuring and the slowing of the hiring pace from earlier this year? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Michael. You'll start to see them in Q4. Just one thing about Q4 is that you've got kind of the idiosyncratic cost event of signal, and so that tends to drive a little bit of the guide and then obviously especially next year as we've committed to non-GAAP profitability in 2023.\n\nBryan Vaniman\n\nAnd we have another question for Khozema from Spencer Morris at Matrix. Is the messaging business EBITDA profitable today?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Spencer. We're not going to provide Segment-specific disclosures per se, but what you can imagine is that we're investing in the software businesses, and we intend to use those profits. We intend to use profits from communications to fuel that ongoing investment.\n\nBryan Vaniman\n\nAll right. And Alex Zukin from Wolfe asks, will you be breaking out software revenue quarterly and guiding to its quarterly as well? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Alex. Yes and no.\n\nBryan Vaniman\n\nAll right. Meta Marshall from Morgan Stanley asks, at the 2020 Analyst Day, you gave a stat as to how much of DBNE was from expansion into other products. You gave some examples, but is there a stat of either how many customers are multi-product or a refresh of the previous DBNE multi-product stat?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Meta. This is Khozema. That's a really good idea. We actually didn't disclose that today, but it is something that we'll consider providing in future updates.\n\nBryan Vaniman\n\nAll right. Next question is from Nikhil Gupta from 2N Capital. Why is holding $3.2 billion in net cash on the balance sheet, the right amount to be holding, particularly if you can improve free cash flow as you improve operating profit going forward? Is there any possibility of a shared buyback program? Khozema?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Nikhil. I think that's a reasonable question. I mean, we have a capital allocation strategy that we articulated a little bit during the course of today's presentation. I think that for us, it's been important to have a fortress balance sheet.\n\nThat's why we have the amount of cash that we do. I think certainly during economic down times; it's good to be more cash-rich than otherwise. That said, I think you're right that as we become more profitable and as we start to generate free cash flow, you do have different directions that you can take that, I think, historically, we've done M&A, but a share buyback is certainly not something I would take off the table either. It wouldn't take signal from that.\n\nThat's something that we're necessarily planning, but I think it's got to be among a list of options.\n\nBryan Vaniman\n\nAnd it looks like another question for Khozema from Alex Zukin at Wolfe. Can you please help us bridge the big chart where you highlight sales and marketing, R&D, and G&A from year-to-date 2022 to medium term? How do we think about that for next year? And where's the implied op margin going in fiscal year 2023? Kho?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Alex. I mean, as you can appreciate, we've committed to non-GAAP profitability in 2023. Like detailing that by cost categories is, is just not something we're going to do. We're not going to guide to that beyond the financial framework that we showed you today.\n\nBryan Vaniman\n\nAnd just a quick follow-up from Alex for Khozema. Can you help us understand how we should think about gross profit dollar growth over the short and medium term?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Alex. We haven't provided that kind of a framework. I think what we did say is that we're going to continue growing gross profit dollars so long as we can distribute those gross profit dollars efficiently.\n\nI think there was a question in the very beginning of the Q&A intimating that it'd be a good idea to potentially guide on a gross profit basis. I think that is something that we'll take into consideration. We'll get back to you, guys.\n\nBryan Vaniman\n\nAll right. Question from Matt Stotler at William Blair. What is the impact in Q4 2022 related to the winding down of the Zipwhip texting platform? Kho?\n\nKhozema Shipchandler -- Chief Operating Officer\n\nYes. Hey, Matt. It's de minimis. It's not going to have a material impact on the business whatsoever.\n\nBryan Vaniman\n\nAll right. And I think we're going to close this out as the last question. Coming in from Arjun Kapoor at Kinetic Partners Management. You provided a medium-term target on SBC as a percent of revenue.\n\nBut what is a reasonable assumption for the long-term target on SBC as a percent of revenue? I think that's a Kho question.\n\nKhozema Shipchandler -- Chief Operating Officer\n\nHey, Arjun. I mean, we gave you a medium-term target today. I'm not going to further provide a long-term target. I think that it is a topic that we've been talking a lot about as a management team, certainly with our board and our comp committee.\n\nIt is something that we're quite focused on. We provided you today with some of the dynamics in terms of, how we're thinking about it. I think growing our employee count at a slower rate relative to our revenue is obviously going to be an important piece of the equation. We've taken a restructuring action that was really, really hard, but we thought it was the right long-term move for the company, and obviously, that's a step in the right direction.\n\nWe talked about the slowing of hiring other than in segment and flex. So, obviously, that's a big piece of how that employee count gets affected. And then I think beyond that, we also give you some dynamics around the way that we're thinking about hiring and different geographies and how stock is valued internationally relative to in the domestic market. And then also, the way that we leverage equity compensation relative to performance will be another dynamic that we'll think through.\n\nThere may be others over time, but I think we've given you medium-term target, and I think that's what we're prepared to do today, and we feel good about our ability to hit that.\n\nBryan Vaniman\n\nExcellent. And with that, I'm going to turn it back over to Jeff Lawson for a few closing words.\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nThanks, Kho. You did a lot of talking today. Did someone get this guy glass of water for like -- I want to thank everybody for joining today. We've provided you all with a lot of information.\n\nBut the key points really are, first messaging was a good business and we're focused on gross profit generation and growing the operating profit off of a large gross profit base of messaging. Second, our customer engagement software products of Segment, Engage, Flex, they're the next act for Twilio. Segment, in particular, is an area of focus due to the quick ROI that we can get for our customers and the importance of data. We know how to sell Segment.\n\nWe've rebuilt our sales team with the goal of growing that business at high rates over a long period of time. Third, we're bringing together our leading CPaaS and leading CDP products to unlock more value in our software applications layer. And fourth, we're laser-focused on generating near-term profitability. You've seen us take hard actions already.\n\nOur plan is simple, drive more leverage from our scaled communication businesses through product-led growth and more efficient distribution. While putting more and more of our go-to-market resources on selling our software products. We got the right team in place to ensure that we're going to gain leverage over a long period of time. So, thank you for joining us today, and thank you for following Twilio.\n\nI appreciate the thoughtful questions that you all had, and I really look forward to working with you all our investors or analysts on the huge opportunity ahead. Thanks, everybody.\n\nDuration: 0 minutes\n\nBryan Vaniman\n\nJeff Lawson -- Co-Founder and Chief Executive Officer\n\nEyal Manor -- Chief Product Officer\n\nElena Donio -- President of Revenue\n\nKhozema Shipchandler -- Chief Operating Officer\n\nMore TWLO analysis\n\nAll earnings call transcripts"
}