{
  "companyName": "GoPro",
  "companyTicker": "GPRO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/gopro-gpro-q3-2022-earnings-call-transcript/",
  "content": "GoPro (GPRO 1.63%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nHello, everybody, and welcome to today's GoPro's third quarter 2022 earnings call. My name is Drew, and I'll be coordinating your call today. [Operator instructions] I'm now going to hand over to Jalene Hoover, vice president, investor relations to begin. Please go ahead.\n\nJalene Hoover -- Vice President, Investor Relations\n\nThank you, Drew. Good afternoon everyone and welcome to GoPro's third quarter 2022 earnings conference call. With me today are GoPro's CEO, Nicholas Woodman; and CFO and COO, Brian McGee. Today's agenda will include a brief introduction from Nick and some commentary from Brian, followed by Q&A.\n\nFor detailed information about our third quarter 2022 performance and our outlook, please read the management commentary we posted to the Investor Relations section of GoPro's website. Before I pass the call to Nick, I'd like to remind everyone that our remarks today may include forward-looking statements. Forward-looking statements and all other statements that are not historical facts are not guarantees of future performance and are subject to a number of risks and uncertainties, which may cause actual results to differ materially. Additionally, any forward-looking statements made today are based on assumptions as of today, including, but not limited to, uncertainty related to the duration and impact of the COVID-19 pandemic and the war in Ukraine.\n\nThis means that results could change at any time. Our commentary about our business results and outlook is based on the information available as of today's date. And we do not undertake any obligation to update these statements as a result of new information or future events. To better understand the risks and uncertainties that could cause actual results to differ from our commentary, we refer you to the most recent annual report on Form 10-K for the year ended December 31st, 2021, which is on file with the Securities and Exchange Commission and is updated in future filings with the SEC, including the quarterly report on Form 10-Q for the quarter ended September 30th, 2022.\n\nToday, we may discuss gross margin, operating expense, net profit, and loss, EBITDA as well as basic and diluted net profit and loss per share in accordance with GAAP and on a non-GAAP basis. We believe that non-GAAP information is useful because it can enhance the understanding of our ongoing economic performance. We use non-GAAP reporting internally to evaluate and manage our operations and we choose to provide this information to enable investors to perform comparisons of operating results in a manner similar to how we analyze our own operating results. A reconciliation of GAAP to non-GAAP operating expenses can be found in the press release that was issued this afternoon, which is posted on the Investor Relations section of our Website.\n\nIn addition to the earnings press release and management commentary, we have posted slides containing detailed financial data and metrics for the third quarter of 2022. The management commentary, slides as well as a link to today's live webcast and a replay of this conference call are posted on the Investor Relations section of GoPro's website for your reference. Unless otherwise noted, all income statement-related numbers that are discussed in the management commentary other than revenue are non-GAAP. Now I'll turn the call over to GoPro's founder and CEO, Nicholas Woodman.\n\nNicholas Woodman -- Chief Executive Officer\n\nThanks, Jalene, and hi, everybody. Thanks for joining us today. As we shared in the management commentary, which we posted to the Investor Relations section of our website, in Q3 2022, GoPro delivered revenue of 305 million at the high end of guidance and cash flow from operations of $41 million. GAAP EPS was $0.10 and non-GAAP EPS was $0.19.\n\nLike many companies, GoPro's results for the quarter were impacted by a stronger U.S. dollar. On a constant currency basis, Q3 revenue would have been approximately $18 million higher year over year, or up 2%, gross margin over 40% versus 38% actual results, and EBITDA to revenue approximately 16% versus 12% actual results. Considering global FX and macroeconomic challenges, we're pleased with our Q3 '22 results.\n\nQ3 was an exciting period of new product launches and milestones. In September, we introduced our new HERO11 lineup of cameras; HERO11 Black, HERO11 Black Creator Edition, and HERO11 Black Mini, and we're happy to report that many will begin shipping to GoPro.com customers the week of November 7th, and will be available at retail beginning the week of November 14th. We also launched an enhanced cloud experience that automatically sends highlight videos to subscribers. And in August, we surpassed 2 million GoPro subscribers and are positioned to generate more than $100 million in annual recurring revenue with gross margin between 70% and 80%.\n\nGoPro subscription continues to drive value for our customers while serving as a powerful financial engine for our business. At the end of Q3, GoPro subscribers and subscription and service revenue grew respectively by 55% and 48% year over year to 2.1 million and $21 million, which positively contributes to gross margin and our bottom line. We are on track to achieve 2.2 million subscribers by year-end. GoPro's resilience during these challenging macroeconomic times is testament to the meaningful role GoPro plays in people's lives, helping them capture and share experiences that would otherwise be impossible to document.\n\nWe believe we're advancing our global relevance as a digital imaging solutions company that serves the world's most active and creative people. And our ongoing execution is thanks entirely to our talented and passionate employees. Looking ahead to 2023, we plan to invest in people, technology, and innovation that yield leading-edge products and services with an emphasis on subscription value creation and growth. While we anticipate continuing macroeconomic headwinds in 2023 and potentially beyond, we are confident in our ability to operate GoPro as a profitable company and to strategically position the company for when the global economy improves and currency exchange rates normalize.\n\nOur business is strong. Our products are market leading. And we feel well-positioned for the future. Before jumping into Q&A, Brian has a few comments to share.\n\nBrian McGee -- Chief Financial Officer, Chief Operating Officer\n\nThanks, Nick. I'd like to provide some color on our Q4 and full year 2022 outlook. As a reminder, both CEO and CFO comments and the extended management commentary posted in the Investor Relations section of our website. Looking ahead, we anticipate continued impact from key macro dynamics on our business which we've contemplated in the fourth quarter and full year 2022 guidance.\n\nWe expect to exit 2022 with cash of approximately $400 million, which contemplates continued share repurchases with 68 million remaining under our existing program. We expect the U.S. dollar to remain at current levels relative to the Australian dollar, British pound, euro, and Japanese yen. Our 2022 outlook reflects anticipated FX impact to revenue, margins, and earnings of more than $55 million compared to 2021 and that more than 20 million since our August earnings call.\n\nUnlike last year when retailers struggled to secure inventory, many have an abundance of merchandize resulting in reductions in open to buy dollars. Consumers are prioritizing living expenses and experiences over things while also paying more for food, housing, healthcare, and other items as inflation hovers around a four-decade high. As a result, retailers are accelerating and increasing their promotional activities to reduce inventory, such as Black Friday deals being announced weeks in advance. Looking ahead into 2023, we will manage the business with the following priorities; laser focused on remaining cash flow positive, laser focused on subscription growth and retention, develop leading edge technologies and innovative products, grow our total market share, manage appropriate levels of channel and owned inventory.\n\nWhile challenging in the present, currencies and the macroeconomic environment will improve over time. We are the market leader with an effective business model, which we believe will once again generate impressive earnings once macroeconomic conditions improve and currency exchange rates normalize. We expect to be profitable in 2023 while continuing to drive operating cash flow. We have the balance sheet strength to navigate the current economic environment and believe we will emerge an even stronger GoPro in the future as our business fundamentals are sound.\n\nOperator, we're now ready to take questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question today is from Martin Yang from Oppenheimer. Please go ahead.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nHi. Good afternoon. Thank you for taking my question. Can you talk about the margin expectations for next year? In very general terms, what are the puts and takes assuming no further currency headwinds?\n\nBrian McGee -- Chief Financial Officer, Chief Operating Officer\n\nYeah. So Martin, on a constant currency basis, we'd expect to be at the low end of our operating model which is 40% to 43%. On an actual results basis, it's going to look a lot closer to the guidance we provided for the fourth quarter, so mid 30s plus or minus around that I would think just given currently what's going on with exchange rates. And it's all driven by exchange rates, by the way.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nGot it. And the follow-up, GoPro Mini, is there any early signals you can get versus from reviews, from maybe core customer feedback on the mini and whether or not mini's delay has any meaningful impact on your 4Q guidance?\n\nBrian McGee -- Chief Financial Officer, Chief Operating Officer\n\nOn the guidance question, no. As we've talked I think on the last call, our expectation is that mini would be from a cellphone perspective in the fourth quarter I think number four in the lineup and HERO11 will be the best, HERO10 I think nine and then mini. So that's been our expectation and we expect that to hold. I'll let Nick comment on the reviews.\n\nNicholas Woodman -- Chief Executive Officer\n\nThanks for that. I didn't catch the first part of that question.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nYeah. So what are the customer feedbacks on mini? What are core users saying about this new product?\n\nNicholas Woodman -- Chief Executive Officer\n\nWell, the media reviews haven't come out yet. Those are embargoed until we actually start shipping mini. But the feedback that we've received just through the coconut wireless, if you will, is very positive. Mini is a result of continued demand for us to bring back the section-like experience that we previously had in the Session camera.\n\nThose of you may remember that we had Session and HERO5 session, which is a cube-shaped camera that was distinct for its one button simplicity and really convenient form factor. And I can assure everybody who is interested in seeing that form factor come back, we've hit it out of the park with mini. It's everything that that Session camera was and so much more, as it features all of the resolution frame rates, performance of the full HERO11 Black camera but in a much simplified and slimmed-down camera, and it's become my favorite GoPro of all time. So I'm really excited for this product to get in the hands of our customers.\n\nAnd I think it's going to be another hit for GoPro.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nGot it. Thank you very much. I appreciate the color.\n\nOperator\n\nOur next question today comes from Jim Suva from Citigroup. Please go ahead.\n\nJim Suva -- Citi -- Analyst\n\nThank you, Nick and Brian for the details. A question on -- you've been hearing about the electronic stores working down consumer electronics inventory levels. I know GoPro.com has been a great success, and you've been able to manage your inventories there a little better. Just wondering about your external inventory levels, how are they, what are you kind of hearing? And I'm sure it's building expectations, but what should we think about inventory levels there kind of at the big box retailer, storefronts, and also just small retailers also?\n\nBrian McGee -- Chief Financial Officer, Chief Operating Officer\n\nYeah. Jim, this is Brian. Let me comment on big box retail. In the third quarter, they reduced their inventories along with weeks of supply on a year-over-year basis.\n\nTheir on hand inventory declined about 25% year over year, so they're definitely bringing them down. And I mentioned that in my opening remarks that the open to buy dollars is definitely down, and we're seeing it. And we're seeing I think they were down to eight weeks of inventory. They're normally around nine, 10, 11 this time of year going into the holidays.\n\nSo they're definitely squeezing inventory down. By the way, that's not related just to GoPro. I think this is more of a broader industrywide issue regarding kind of demand and what retailers are willing to hold. So we're seeing it across the board.\n\nIt's not just big box. We're going to see it everywhere. On the dot-com, we're pretty pleased. It was up to 32% of revenue in the quarter.\n\nI think that was up from 30% last year. I think overall last year, we were about 34%. We should be between 35% and 40% on dot-com this year, so we're definitely making good progress on driving more demand to GoPro.com. And of course, that's improving, helping our margin front but it also helps to drive subscribers, right, because we have 95% of [Inaudible] on the GoPro.com front.\n\nSo that's pretty exciting as we've made that business model change and it's proving to be pretty sound.\n\nJim Suva -- Citi -- Analyst\n\nAnd on your opening comments, Nick made some comments about of course focusing on cash flow. But what caught my ear was the increase in subscriptions and market share. To do that, does it take like more employees, more assessments, reshuffling? Are those bodies already in place, because you have seen great success with your subscriptions? Nick kind of alluded to even a bigger increase or focus, or maybe I'm just reading too much into that.\n\nBrian McGee -- Chief Financial Officer, Chief Operating Officer\n\nNo. If you -- and Nick can comment maybe on top of me. We expect to be 2.2 million subscribers by the end of this year. That's up 40% over 2021.\n\nAnother thing we pointed out is retention of our annual subscribers who make up 85% of the total subs has improved about 5%, actually better than 5% from this time last year and we're seeing some companies reported their storage business was actually down in storage, we're the opposite. Our storage has doubled year over year for GoPro content. So we're seeing real usage by the consumers. And now we're providing auto-highlight videos for people who put their content up in the cloud, which is another great service.\n\nSo we'll continue to drive more software engineering into 2023 to continue to build out our subscription and service offerings, because it's the most profitable portion of our business, right? As a product, our subscription is 70% to 80% margin and the fastest growing product we've got. So we call it the financial engine for GoPro and it's turning out to be the case.\n\nNicholas Woodman -- Chief Executive Officer\n\nYeah. And I would just add that we really want to emphasize to investors how laser focused we are on growing our subscription business and investing in it to add ongoing value for our subscribers. It's proving to be very valuable to our subscribers. It's a differentiator for GoPro that goes beyond our already market-leading cameras.\n\nAnd it's just clearly proving to be the financial engine for our business. And so it's really everyone wins strategy when we emphasize our efforts around growing the value and scale of the subscription business. So I think Brian said it well, and I'm glad that you picked up on it, Jim.\n\nJim Suva -- Citi -- Analyst\n\nYeah. And again, I meant the question in a very complimentary manner, because it's been a great success. Thank you so much for the details.\n\nNicholas Woodman -- Chief Executive Officer\n\nThanks for that.\n\nOperator\n\n[Operator instructions] Our next question today is from Erik Woodring from Morgan Stanley. Your line is now open.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nHi, guys. Thank you for taking my questions. Maybe, Nick, if I ask you the first one. Now that you've launched all of the new flagship and derivative cameras, can you maybe just elaborate on why you changed your strategy? Was it something in the data? Was it something that you thought was kind of low hanging fruit? I just love to kind of understand now that you can look back, what the driving force was behind the strategy change? And then almost getting to Brian's comment earlier, just how we should think about each of the new cameras in terms of important to sell-in and sell-through? And then I have a follow-up.\n\nThanks.\n\nNicholas Woodman -- Chief Executive Officer\n\nAre you referring to not just having a good, better, best of the same camera, but rather coming out with different types of cameras at different price points?\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nExactly.\n\nNicholas Woodman -- Chief Executive Officer\n\nOK. Well, what we learned before -- what we learned through customer research was that people -- what we thought before was people just broke into categories of different price sensitivity. You have your entry-level buyer, your value buyer who wants to buy last year's flagship at a discount, and then you have your tip of the spear buyer that needs the latest and greatest and is willing to pay for it. We learned that there's a lot more to it than just price and that there are also different interests at different price levels.\n\nSo it's a bit of a matrix. And so what we went to work on was developing not just products at different price points, but different experiences, different solutions for different types of consumers at different price points. And that gave us the confidence to go in both directions to the higher end with the HERO11 Black Creator Edition, which builds on the success of HERO10 Black Creator Edition the year before where we really are pushing the boundaries of features and performance and also a price. So it's our highest price to GoPro and it's done quite well.\n\nIt exceeded our expectations and stayed there and we're really happy with that, and that's why we came out with the HERO11 Black version of that. And then as we moved into different products, we realized that as you come down the price stack, people are also looking for more simplicity. And we're not done there yet. We're still learning about how simple, how straightforward yet still how capable ultimately in terms of the quality of video and photos that it captures can we make a GoPro and make GoPro more accessible to more people who are maybe interested at a lower price point, but they want something new from us, and they not necessarily just want to buy yesteryears product at discount-after-discount.\n\nSo we're not done yet with innovation and exploring new products that can court customers in an exciting way to grow our TAM. But we're really happy with how it's gone this year. And kudos to GoPro's product development engineering teams and operations team for getting out such great products this year during challenging supply periods where there's challenges in supply and so forth. Once again, team GoPro got the job done and the products are just outstanding.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nOK. That was really helpful. Thank you, Nick. And then maybe, Brian, if I just direct one to you.\n\nYou've obviously alluded earlier in Q&A and in your prepared remarks to big box retailers reducing inventories and weeks of supply. I'm just curious if from your seat, is there more inventory reduction to come or have we seen most of it, and now it's just kind of waiting for whatever reorders might come? And then any other color that you can share on how holiday demand is shaping up? How it might look different from last year would be great. And that's it for me. Thank you.\n\nBrian McGee -- Chief Financial Officer, Chief Operating Officer\n\nIn our prepared remarks, I did comment that our sell-through in the month of October was right on track to where it needed to be. So that's been a positive. It's great for -- our demand planning team has been doing a heck of a job predicting what our demand levels would be. And again, they did it in Q3.\n\nWe're able to kind of beat our numbers, so good job on that. This is a pretty challenging environment. And you'll see, even in my guidance, the range actually is pretty wide for Q4. And I think there's a bunch of dynamics at play here.\n\nConsumer behavior I think is going to be difficult to predict in the quarter, because of living expenses and paying more for food, housing, and care, inflation at all-time highs, interest rates rising, those are going to be difficult predictors. And at the same time, we have retailers who are absolutely not willing to carry as much inventory as they have historically. And those two dynamics are playing out. And that's why we definitely took our numbers down for Q4 as have so many.\n\nWe're not alone or unique in this given what's going on. That said, I think our teams got a pretty darn good handle on kind of the demand dynamics. Like I said, we hit October. We're feeling good about kind of what our offers will be in the month of November and December.\n\nSo I think those are positives. And so we came out in the midpoint of this guide. I'd also point out that we continue to track very well to the 2.2 million subscriber number. We still have two months to go, the big months, but so far we're tracking ahead.\n\nSo the key pieces of our business that drives this model are moving in the right direction.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nThank you, Brian.\n\nOperator\n\nThank you. We have no further questions at this time. So I will now refer you back to the management team for closing remarks.\n\nNicholas Woodman -- Chief Executive Officer\n\nThank you very much, operator, and thank you, everyone, for joining today's call. As I said earlier, our business is well-positioned to weather these challenging times and we're confident in our ability to operate GoPro as a profitable company until macroeconomic conditions improve and foreign exchange rates normalize. Despite the challenges ahead, we are very excited for the future. Many thanks again for joining today's call.\n\nThis is team GoPro signing off.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJalene Hoover -- Vice President, Investor Relations\n\nNicholas Woodman -- Chief Executive Officer\n\nBrian McGee -- Chief Financial Officer, Chief Operating Officer\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nJim Suva -- Citi -- Analyst\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nMore GPRO analysis\n\nAll earnings call transcripts"
}