{
  "companyName": "Veeva Systems",
  "companyTicker": "VEEV",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/veeva-systems-veev-q3-2023-earnings-call-transcrip/",
  "content": "Veeva Systems (VEEV -1.10%)\nQ3 2023 Earnings Call\nDec 01, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Anna, and I will be your conference operator today. At this time, I would like to welcome everyone to the Veeva Systems' fiscal 2023 third quarter results conference call. [Operator instructions] Ato Garrett, senior director of investor relations, you may begin your conference.\n\nAto Garrett -- Senior Director, Investor Relations\n\nGood afternoon, and welcome to Veeva Systems' fiscal 2023 third quarter earnings conference call for the quarter ended October 31, 2022. As a reminder, we posted prepared remarks on Veeva's investor relations website just after 1 p.m. Pacific today. We hope you've had a chance to read them before the call.\n\nToday's call will be used primarily for Q&A. With me today for Q&A are Peter Gassner, our chief executive officer; Paul Shawah, EVP, commercial strategy; and Brent Bowman, our chief financial officer. During this call, we may make forward-looking statements regarding trends, our strategies, and the anticipated performance of the business, including guidance regarding future financial results. These forward-looking statements will be based on our current views and expectations and are subject to various risks and uncertainties.\n\nOur actual results may differ materially. Please refer to the risks listed in our earnings release and the risk factors included in our most recent filings on Form 10-Q. Forward-looking statements made during the call are being made as of today, December 1, 2022, based on the facts available to us today. If this call is replayed or viewed after today, the information presented during the call may not contain current or accurate information.\n\nVeeva disclaims any obligation to update or revise any forward-looking statements. We may discuss our guidance on today's call, but we will not provide any further guidance or updates on our performance during the quarter, unless we do so in a public forum. On the call, we may also discuss certain non-GAAP metrics that we believe aid in the understanding of our financial results. A reconciliation to comparable GAAP metrics can be found in today's earnings release and in the supplemental investor presentation, both of which are available on our website.\n\nWith that, thank you for joining us, and I'll turn the call over to Peter.\n\nPeter Gassner -- Chief Executive Officer\n\nThank you, Ato, and welcome, everyone, to the call. We had a strong Q3, delivering results ahead of our guidance. Total revenue in the quarter was 552 million, up 16% year over year, and subscription revenue was up 16% to 442 million. Non-GAAP operating income was 219 million or 40% of total revenue.\n\nDespite the difficult macro environment, we continue to execute well. Our innovation engine is strong, and our strategic partnerships with the industry are increasing. We also had a record hiring quarter and a very strong quarter in clinical with some significant wins. We also announced that we are moving Veeva CRM to the Veeva Vault platform over time.\n\nThis will allow us to deliver a better application and a better customer experience. At this point, we'll open up the call to your questions.\n\nOperator\n\n[Operator instructions] Your first question today comes from the line of Ken Wong with Oppenheimer. Your line is now open.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you very much. And, Peter, I wanted to, I guess, just dive straight into the move to Vault with CRM. You guys are definitely keeping us on our toes these last few quarters.\n\nMaybe just for some clarity, when we think about the contract ending in '25 and then a grace period through '30, does the noncompete with Salesforce also end in '25? And just would love your take on what that migration path looks like, what would be some potential hurdles that might slow down that transition. And then I got a follow-up for Brent.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah, Ken, it is the contract goes until 2025. So, that's, you know, where we're not competing together in the market there. That's according to the contract. And then, there's a wind-down period for existing customers that starts in 2025, and that goes to 2030.\n\nSo, it's business as usual. There's nothing could change about today and the customers are supported with Veeva CRM until 2030. We expect to have early adopters on the Vault CRM in 2024, some early adopters, and then, you know, the majority moving on 2025 or so, that's when we'll be selling mainly Vault CRM. And customers will migrate over time.\n\nThey have plenty of time. So, that's the basic of how to think about it, Ken.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nOK. Fantastic. And then, Brent, just quickly on the numbers. In terms of the slight reduction in the clinical subscription or R&D subscription, is that due primarily just to FX? Or are there some impact from the billing dynamics that you called out in the prepared remarks or, perhaps, some macro?\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. Overall, yeah, we're happy with R&D solutions growing at about 18%, adjusted for FX on a full year basis. The little bit of reduction you're seeing is a combination of two things. One is the FX incremental as well as a little bit of deal timing.\n\nSo, the two things, what drove a little bit of reduction.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nGot it. Thanks a lot, guys.\n\nBrent Bowman -- Chief Financial Officer\n\nYou bet.\n\nOperator\n\nYour next question comes from the line of Brian Peterson with Raymond James. Your line is now open.\n\nBrian Peterson -- Raymond James -- Analyst\n\nHi, gentlemen. Thanks for taking our questions. So, we're getting a lot of questions from investors on the new agreement. And from a financial perspective, is it right to use accrued fees payable to Salesforce that you guys disclosed and kind of annualize that number on the potential impact that you guys would save? Or would there be some offsetting cost to that? I think everyone's just trying to think through the potential margin impact here over the long term.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. I mean how I would think about it is, first off, you know, if you look out to our 2025 targets, we don't expect there to be a material impact. We're still tracking about a year ahead inclusive of this new announcement. We don't anticipate there to be any real significant investments required.\n\nWe're going to largely leverage our internal resources and also the power of our Vault platform. You know, beyond 2025, that's a long time out there, yeah, there is some accounts payable. You can see in our quarterly financials. That's a monthly number.\n\nSo, you can use that as a ballpark estimate.\n\nBrian Peterson -- Raymond James -- Analyst\n\nThanks, Brent. And maybe just a follow-up, you know, you mentioned last quarter that we've seen some volatility in sales cycles. I'd just be curious how that progressed throughout the quarter? It sounded like there were some really strong clinical results, but would love to get any color there. Thanks, guys.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. So, really happy with the momentum. Those few deals we talked about in Q2 did close in Q3. So, we're very pleased about that.\n\nSo, overall, from a macro perspective, we've seen kind of similar to what we said 90 days ago, not better, not worse. And that's basically a little bit of additional scrutiny that we saw 90 days ago, but nothing, you know, significantly different than that.\n\nBrian Peterson -- Raymond James -- Analyst\n\nThanks, Brent.\n\nBrent Bowman -- Chief Financial Officer\n\nYup. Thanks, Brian.\n\nOperator\n\nYour next question comes from the line of Dylan Becker with William Blair. Your line is now open.\n\nDylan Becker -- William Blair and Company -- Analyst\n\nHey, guys. Thanks for taking the question. Maybe Peter, to -- I think you highlighted some strength in EDC. We spend a lot of time talking about the complexity of a clinical data management piece and the opportunity to expand beyond just pure EDC.\n\nI know you guys have introduced a number of functional areas here, but can you give us a sense of how you're thinking about putting together that I think you guys have logged those, right, the proverbial Rubik's cube around the sources and stakeholders there, not just from an existing process perspective, but unlocking and addressing almost an entirely new set of workflows and capabilities.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. So, in the clinical, it's right that those are two very significant wins in the quarter. Two top 20s that selected our EDC. That's a very, very core application at the heart of the clinical data management.\n\nAnd then there are more applications that we are bringing out and have bought out the RTSM, randomization and trial supply management, patient-reported outcomes, our CDB product. So, you know, that's -- you know, when you look at clinical operations, us getting eTMF in there early with a sign of very good things to come. And us getting EDC in at these large companies, that's a sign of very good things to come in clinical data management. And then, you're right, that's -- will read into broader future for us in clinical as we connect up the clinical research sites.\n\nAnd there's many, many applications we can make on top of this as we connect. So, clinical, I'm super excited about we're in the very, very early days of clinical, especially the clinical data management area.\n\nDylan Becker -- William Blair and Company -- Analyst\n\nGot it. That's helpful. Thanks. And then, maybe from a hiring perspective, as we look at it, to already added kind of more headcount than any prior period here or any prior year.\n\nI guess how should we think about investment? Obviously, a lot of new initiatives and kind of that 2020 -- that 2030 growth framework. But how should we be thinking about kind of the resource allocation and obviously a further pace of hiring down the road here?\n\nPeter Gassner -- Chief Executive Officer\n\nYes, it's a great hiring environment. People are looking for quality companies, stable companies doing great work, where they can feel aligned to the values and do their best work. The shiny penny of the crazy start-up idea is not so shiny anymore. So, it's a great hiring environment.\n\nWe'll really invest across all areas of the business: sales, services, and especially product. But you're not going to see anything dramatic from Veeva. You know, you'll see the measured pace that we go at. We really focus on the quality hiring.\n\nWe've often come in under our hiring targets. And, you know, if this grade environment continues, we -- hopefully, we won't come in under our hiring targets anymore. So, I'm really pleased about that. That's a leading indicator for Veeva when we can hire great people.\n\nDylan Becker -- William Blair and Company -- Analyst\n\nYeah. Thanks, guys.\n\nOperator\n\nYour next question comes from the line of Anne Samuel with J.P. Morgan. Your line is now open.\n\nAnne Samuel -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking the question. I was hoping maybe you could speak a little bit to the rationale behind moving away from the medtech CRM. You know, you spoke fairly positively to at the investor day.\n\nSo, just wondering maybe, you know, what shifted?\n\nPeter Gassner -- Chief Executive Officer\n\nYes, Ann, this is Peter. medtech CRM and the pharma CRM, they share a common foundation. You have to do those things together. So, with moving need the CRM to the Vault platform.\n\nWe really had to prioritize pharma CRM first, take care of our existing customers, get that base set up. And then, yes, medtech CRM, that may come later. But we needed to prioritize the sequence since these applications are tightly interrelated.\n\nAnne Samuel -- JPMorgan Chase and Company -- Analyst\n\nThat makes a lot of sense. And then, just, you know, you had a lot of really nice outperformance on the operating income line in the third quarter. You held on to the full year guidance. So, I was just wondering, is there any shift of expenses there or anything incremental in 4Q that we should be thinking about?\n\nBrent Bowman -- Chief Financial Officer\n\nYes. Regarding Q4, it's always our seasonally lower operating margin quarter. Why is that? Services utilization with the holidays is always a factor, as well as kind of the reset on, you know, benefits and payroll tax type items. So, that's a big seasonal reduction you will see.\n\nAnd then we're continuing to invest for long-term growth. Those are the two factors, but nothing else unusual.\n\nAnne Samuel -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for the color.\n\nOperator\n\nYour next question comes from the line of Craig Hettenbach with Morgan Stanley. Your line is now open.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nYes. Thank you. Just following up on some of the macro commentary. Any sense in terms of just what you're seeing from a number of add-ons and any tightening on that front kind of quarter to quarter?\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nYeah. The others are pretty similar to what we've seen over the last couple of quarters. You know, I think in we were talking to you back in June, we highlighted a little bit of a slowdown in the SMB space, particularly the lower-end fewer expansions, not getting any -- not improving significantly or not worsening either. So, really haven't seen much of a change there.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nGot it. And then just a question on Crossix you called out is growing about 10%. And, clearly, the broader advertising market has been under pressure, but that's an area of relative strength. Just what you're seeing in that market.\n\nAnd any sense of when that market could maybe start to reaccelerate again? Any visibility into that?\n\nPeter Gassner -- Chief Executive Officer\n\nYes. Certainly, the overall, a little bit of caution in the advertising spend. As far as, you know, when that would turn around or stay the same or get worse, I really don't have a crystal ball on that. What our focus on that project is just increasing the value from the application.\n\nSo, increasing functionality, increased integration with our other CRM-related products and moving to more multiyear agreements, enterprise license agreements with customers to provide a baseline of revenue and stability and service for the customers. So, really excited about the Crossix business. I think we have a clear road map, and it's going quite well.\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Gabriela Borges with Goldman Sachs. Your line is now open.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nGood afternoon. Thank you. For Peter, could you walk us through what the transition looks like for a customer to switch from CRM with Salesforce to CRM with Vault? And more specifically, is there a risk that they look to evaluate competitive products when they do that transition?\n\nPeter Gassner -- Chief Executive Officer\n\nSo, what it looks like really we're you could think about as moving the back end of the application, the back-end platform. And we'll have migration tools that will bring the data across, including the customers customization and still be able to use all their content that they've developed, their multichannel email templates. And we'll use the same front-end applications, such as on the iPad. So, that's what it will look like.\n\nWe'll develop a lot of tooling. The customer will have integrations to ride, things like that. And in terms of competitive it's only out there, right? It's always a competitive market, whether you're moving platforms or not, and you have to continue to mind your customer relationships, continue to add value and innovation. So, I don't really see anything different there.\n\nAnd the main thing is we're replatforming the application CRM. We're not rewriting it. We're not introducing any kind of a new paradigm. So, I feel comfortable that the vast majority of customers will migrate over time.\n\nAnd I guess the other thing is that the Veeva Vault platform is a very mature application. The bulk of Veeva's revenue is on the Veeva Vault application, and that's where our customers actually have the majority of their Veeva business for most of them is on the Veeva Vault platform. So, I think overall, for customers, this is a positive that simplifies their landscape.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nThank you for the details. The follow-up is for Paul. I believe last quarter, you talked about budget planning at your customers hitting full swing into the second half. So, just looking for an update here.\n\nWhat are you hearing on commercial budgets into 2023 and willingness to invest? And specifically, the response to the pricing increases, is there any negative impact on your ability to cross-sell because perhaps budget is fixed?\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nYeah. No significant change on the budget side. You know, our customers have gone through that timing process, and we haven't really seen any pricing pressures. When you think about the industry, particularly in the large enterprise, they're not -- it's not as susceptible to, you know, some of these macroeconomic changes, and we haven't seen any change there.\n\nYou had a second question, which was around the inflation increase that we've had. And by and large, we haven't seen any -- you know, it really has been pretty seamless with our customers. And the reason is we, you know, built that have a long history of being a trusted partner. We haven't historically had any license pricing increases.\n\nSo, our customers know this is a different environment. And by and large, it hasn't been an issue.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nThank you for the detail.\n\nOperator\n\nYour next question comes from the line of Joe Vruwink with Baird. Your line is now open.\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nHi. Great. Hi, everyone. Just staying on the CRM conversation.\n\nIn the past, I think you've acknowledged that typically customer conversations are separate and distinct between commercial and R&D orgs. Yet, the shareholder letter made some comments about how, you know, a common platform for both now makes sense. So, I'm wondering, are customers approaching you differently, thinking about procurement differently? Or is Veeva seeing new product opportunities that will benefit by uniting the two offerings?\n\nPeter Gassner -- Chief Executive Officer\n\nSo, no change in customer behavior, Joe. And I would say, yes, primarily, our customers are concerned with the excellence of the application in their area. But as they get more Veeva applications and more Vault applications, they do look for synergies there, synergies in -- they might create a Veeva Vault center of excellence, that type of thing for efficient operations. Or they may be auditing the Vault platform, and it's easier just to audit on platform.\n\nSo, we see that there. And then, the connectivity between the applications, between R&D and commercial, specifically, between clinical, medical, and commercial, that's something we do see opportunity there. And I think Veeva will help drive that. Some customers are asking for that.\n\nBut I think mainly, we're going to be leading the way there. And you really haven't had great solutions for that connectivity, and I think we'll bring innovation there and connectivity that will create the market there.\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nOK. That's great. And then I have one question on the numbers and specifically just on 4Q billings, I think the outlook last quarter implied something like 927 million. And now, the guidance is 909 million.\n\nBrent, is that just the deal timing that's influencing the Vault, the new guidance. So, we're kind of looking at an annual impact and one number and the quarterly impact in the other?\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. I mean part of it, Joe, you're right. There always is some quarterization. So, that's why we always say kind of look at it on a full year basis.\n\nQ3 benefited about $6 million. So, just more annual billers that would have otherwise likely build in Q4. So, that's part of the equation. But it's just a little bit of timing of renewals in those annual billers.\n\nSo, there's nothing fundamental to the business. We're very, very happy with the momentum, as Peter mentioned, around the clinical space in the EDC space. So, really good business momentum, and no underlying business concerns around the billings.\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nOK. Great. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Ryan MacDonald with Needham and Company. Your line is now open.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThanks for taking my questions. Maybe first one for Peter. You talked about in the prepared remarks about the impact of sort of having the first milestone Vault Safety customer live now. I would just be curious, given that you spoke at the R&D Summit, what you're seeing in terms of increased customer conversations or pipeline development sort of off of that event and the go-live here?\n\nPeter Gassner -- Chief Executive Officer\n\nExcellent question there. I guess to step back, where we have a safety application that's a very complex applications. It's case processing of what's called adverse events, somebody takes a medicine and they either have a bad reaction or they think they have a bad reaction and then has to be classified and routed and recorded to health authorities, etc., around the world. So, it's a very complex application.\n\nWe're really the first company able to do that as a cloud-native application. That means just like we do everything else, there's one version of the code, and all customers run it. So, that's a breakthrough. Our customers are used to on-premise applications.\n\nThey have to upgrade lots of issues. Now that this customer is live, this -- you know, it's a top 20 -- one of the larger top 20 customers. Now, there's proof that, that works. And I think, I wouldn't say all the way, but mainly, customers are thinking, \"I probably will go with Veeva for safety.\" And then, the question is when, is it next year? Is it three years from now, five years from now, seven years from now? So, that's really the significance of it.\n\nNow we have, of course, the work's never done. I'll never be satisfied with our safety application side. It always has to get better and better and better. But it was a very significant milestone to go live for the industry and for Veeva.\n\nAnd also, just the other thing I'd add, the speed that that implementation happened, I won't quote the exact numbers of days, was probably about half the time that most customers would have expected that it would have taken. So, that was also seriously noticed by the industry.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThat's a pretty impressive implementation time and go live. That's helpful color.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. Can you tell that I'm enthused about that?\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nJust a bit, just a bit. Maybe my second question is around the Merck strategic relationship or partnership there. I'm curious, and this sort of relates to the CRM strategy here. But in a strategic relationship like that, I'd be curious within your discussions how important it was to Merck to have sort of this unified platform of everything being involved in a type of, you know, long-term 10-year strategic relationship there? And how much that sort of guided the strategic decision-making here on the CRM change? Thanks.\n\nPeter Gassner -- Chief Executive Officer\n\nIn terms of Merck, I won't get into any details specifically there on Merck. I would say that in a strategic agreement of that nature, generally, we're not talking at the platform level there. We're more talking about operating model, how we operate together, how we -- the governance model. And it's only done based on trust over many years.\n\nWhen they see repeated patterns of a customer success orientation of a strategic partnership orientation, and then it's really the governance model that we put in. So, it would be at a higher level versus individual products or platforms.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThanks for the color.\n\nPeter Gassner -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Tyler Radke with Citi. Your line is now open.\n\nTyler Radke -- Citi -- Analyst\n\nYes. Thank you for taking the question. Wanted to ask you just -- you talked about some large Vault EDC customers, I believe, that you signed in the November time frame. Could you just give a little bit of color on that? Is that -- you know, were those kind of some displacements of kind of the main, you know, incumbent in the market? And just give us a sense on the size of these contracts and kind of the opportunity in those accounts.\n\nThanks.\n\nPeter Gassner -- Chief Executive Officer\n\nYes, these were wins with top 20 customers. And they were -- yes, they have to be displacing one of the market leaders because people do need an EDC application. And so, in both cases, we're displacing one of the top two market leaders there other than Veeva. And then in terms of the deal sizes, I won't specifically say in that area, but EDC is one of our larger applications.\n\nSo, it would be one of our -- you know, these are larger deals. They're certainly some of our largest deals. Now, these will ramp over multiple years because with the EDC application, you start study by study by study. So, it's a commitment for a long-term approach, but the revenue ramps very slowly, actually, slower than most of our applications.\n\nThat's the way that goes. So, right now, our -- we are progressing faster with EDC than I would have thought. If you would have asked me in '20 -- in the start of 2020, would we be where we are today with EDC, I probably wouldn't have been as bullish as what's actually happened. So, our focus is going to be extremely on the customer success there because the EDC also is the -- it's the first part of clinical data management.\n\nSo, that's we're focused on. We're really happy with it, and we're going to be laser-focused on having implementations just be outstanding and improving our product through the feedback of these large customers. We have to do a lot of things there, right? Customer success, staffing, and services. It's a great work to do, but we got to get better all the time.\n\nTyler Radke -- Citi -- Analyst\n\nYes, that's great to hear. And maybe on Compass, turning to that, it sounded like you made some comments around, you know, continuing to optimize the approach there. Could you just give us an update on how that's tracking relative to plan? And, you know, kind of when you're expecting that revenue ramp and the timing of, you know, when we start to see that in the numbers.\n\nPeter Gassner -- Chief Executive Officer\n\nYes. Compass, that's certainly a marathon. That's a tough market. You have a very entrenched player there that has some questionable business practices that make it hard.\n\nWe're happy with our progress on the product, and we have a smallish set of early adopters. I won't go into the specific count of customers. As to when we really start to generate momentum in the revenue, it's going to be low. It's not going to be next year.\n\nIt's a very long-term play. I'm confident in our position in the market and our product strategy. I'm confident that the market needs competition. But that one is going to be a marathon, and you just have to stay tuned for milestones.\n\nThat's the thing about great milestones. You don't actually know when they're coming, but we'll let you know when they get here.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nPeter Gassner -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Stephanie Davis with SVB Securities. Your line is now open.\n\nStephanie Davis -- SVB Securities -- Analyst\n\nHey, guys. Thanks for taking my question. I know we've beaten this to death about the risk when we've been off of the Salesforce platform, but I thought I'd add to it. Could you walk us through the WIP associated moving off of it.\n\nIs this hiring platform engineers? Is this resources that you already have? Or should we think of this as effectively built out as you've already had entrants like med tech built on the Vault platform?\n\nPeter Gassner -- Chief Executive Officer\n\nYes. Stephanie, I'll take that one. The main thing to know is that when we build applications on Vault, we're highly efficient. We're highly efficient on that.\n\nSo, there's a lot of work that has gone into the platform. So, we don't see really material incremental investment. And then, we're using much of the parts of the CRM application. We're just porting over the back end.\n\nSo, for example, we have a very robust iPad client for Veeva CRM. It has all types of functionality into it. We're not going to rewrite that application at all. So, that's why the investment is just -- it's not material to the rest of Veeva, it's because of the leverage, both in the existing application footprint, template and code and then the leverage we get from the Vault platform.\n\nStephanie Davis -- SVB Securities -- Analyst\n\nAsking this in kind of a different way from a user perspective, are you taking more of an origin approach and bringing the same look and feel as you move to the new platform? Or are there any opportunities in the three platforms you switched to either improve the CRM platform in your experience or offering?\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. Excellent question. In general, we're going to replatform the back end. So, we're not going to change up the user experience or do dramatic things at that time.\n\nNow having said that, we have an existing road map for CRM that's been -- we've really been executing on. So, our customers have a lot of new functionality for example, Engage. New features that we have with Engage, Engage Connect, that allows compliant messaging between doctors and sales reps. That's just starting to get adopted now.\n\nbecause that's a thing that needs compliance oversight. That's going to continue right into Vault CRM. So, I would think of it as replatforming the back end and reinvigorating the front end and the functionality that just keeps going on. That's been going on for a while, and that will continue on.\n\nStephanie Davis -- SVB Securities -- Analyst\n\nOn top of [Inaudible]\n\nPeter Gassner -- Chief Executive Officer\n\nAll right. Thank you.\n\nOperator\n\nYour next question comes from the line of Brent Bracelin with Piper Sandler. Your line is now open.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThank you for taking the question here. Peter, you've lived through a few economic cycles. I'd be curious to get your view around what aspect of the pharma/medtech industry is a little unique that maybe investors don't appreciate. We're seeing obviously a pretty material slowdown in growth profiles of some of the largest cloud software vendors.\n\nAnd so what parts of the market you serve, maybe are underappreciated levers that allow you to kind of sustain durable growth? I mean is it a trusted partner relationship? Is it having these multiyear road maps that they're going to continue to execute and expand products? Is it just the fact that it's tied to really large, strong vendors? Just trying to think through some of the slowdown we're seeing in other vendors in the cloud space and, perhaps, a bit of a different picture here from your lens. Thanks.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. There's a lot of ways to think about that one. I will start with last year and the year before, it's been quite unusual, right? We haven't seen the interest rate rise this far or this high since the early '80s. And the same with inflation going up this high and raise this bad, not since the early '80s.\n\nAnd the war in Europe like this, you know, I haven't seen in my lifetime. So, these are, you know, unusual times. Having said that, what makes Veeva -- the factors that are going in Veeva's favor, first, I would say our customer feeling, our customer success viewing and track record of success that we've built up over time. That is a tremendous insulator in downturn -- in downtimes.\n\nAlso the nature of the industry. The industry, when it's not recession-proof, but very recession resistant. This is not like our airlines or hotels or luxury items, things like that, restaurants. People need their medicine in good times and bad.\n\nMedicine is a critical part of healthcare without medicines, healthcare costs go up, etc. So, the spending doesn't change too much. The segment where it is affected a little bit is in smaller private companies that if the funding environment goes down, they can't get as much funding. They have to be more conservative with their expansions.\n\nAnd then, I would say the last thing is the type of products we do. They are mission-critical systems of record. Good times or bad, you need your clinical trial management system, just like you need your financial system and you need your ERP system. What you may not need is the speculative piece of technology or add-on on the top of that.\n\nThat's maybe what you don't need. And we focus really on system of records. So, we have that going in favor for us. So, I think a lot of things going in our favor for stability.\n\nWe do best in times of relative stability. When things go booming up fast, maybe that's not actually the best for Veeva. And when things downturn a bit, maybe that's not all the best for Veeva either. We operate the best when things are pretty stable.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nVery helpful color. Thank you.\n\nOperator\n\nYour next question comes from the line of Rishi Jaluria with RBC Capital Markets. Your line is now open.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks so much for taking my questions. I wanted to ask one CRM question and one non-CRM question to balance things out. So, on the CRM side, maybe I want to ask a little bit more explicitly, right, so the non-compete goes away in 2025.\n\nYou know, Salesforce has obviously been vocal about wanting to get deeper in vertical software. They're obviously trying to find more avenues for growth now that the market continues to get saturated away. How should we think about the potential for over time Salesforce to actually become a competitor and start selling their solutions directly into life sciences, whether it's the out-of-the-box functionality or actually verticalizing the solution themselves? And then I've got a follow-up.\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nYeah. Hey, Rishi. This is Paul. So, yeah, the way that -- first the way to think about the -- our partnership with Salesforce, a very long history of a really great partnership with Salesforce.\n\nAnd the agreement goes through 2025. And through 2025, what that means is we are Salesforce's preferred partner for the life sciences industry. So, I don't expect that to change at all between, certainly between now and then. We can't comment on where Salesforce decides to invest, and how they decide to focus after that.\n\nSo, I don't see any change there. You know, we do know that the life sciences space is -- it's a highly regulated, very specialized industry. It takes a lot of time to get it right. It's a complex space.\n\nWe're the market leader here, and we expect to make, you know, the transition super easy for customers and continue to innovate here. So, we can only focus on our horse and not on what others do.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nOK. That's totally fair. And then, Peter, in the prepared remarks, you talked about maybe some of the progress that you're making on the CDMS side with CROs. I was wondering if you can expand on that, what you're seeing out of them.\n\nAnd maybe has there been any pushback from CROs to adopting the CDMS solution so far? What needs to happen for that to become a significant part of that business? Thanks.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. CROs, we just get continued interest and momentum in the CROs. Now they're not -- they're going to be somewhat hesitant, somewhat not hesitant, but measured in their response. They have their policies and procedures that are set up the way they do things with their existing vendors.\n\nSo, change happens a little bit slowly there. But what is causing the momentum is more sponsors asking about Veeva, more sponsors asking about Veeva, and then some of the CROs seeing proof in that it's actually more efficient to operate with Veeva. So, I think it's just a slow gradual change. The CROs, in general, will tend to use the market-leading technology.\n\nI think Veeva is on its way to being the market-leading technology, and the CROs will come along with that.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nGot it. Really helpful. Thank you so much.\n\nOperator\n\nYour next question comes from the line of Jack Wallace with Guggenheim Securities. Your line is now open.\n\nJack Wallace -- Guggenheim Partners -- Analyst\n\nYeah. Thank you for taking my question. One more on the CRM, Salesforce. Just trying to think about kind of why now to make the change in replatforming to Vault.\n\nI think I understand the reasons why the switch. But why now? Why not before the last contract resigning? And were there inflationary pressures going forward that you wanted to avoid and because the cost savings better and maybe a better platform in-house. Just thinking about the timing around, you know, the change in platforms.\n\nPeter Gassner -- Chief Executive Officer\n\nIn terms of the timing, first, it's always good to make changes when things are good. The application is strong, the customer feeling is strong. So, that's a good time to make a change. Also, if you look at why now versus, you know, five years ago or four years ago, the Vault platform is very mature now, very robust now.\n\nAnd we have safety going, and we have CDMS going. Maybe four years ago, maybe the Vault platform maybe you couldn't have done that because maybe it wasn't quite mature enough and also it had safety in CDMS really stressing it out about four years ago. So, I think that would have been too early. And why now is why not wait? I guess that's the other question.\n\nIt's the right time. It gives our customers plenty of time to move, plenty of heads up. Vault platform is clearly ready and it's just timing. We can have a better customer experience and a better application.\n\nThe bulk of our application revenue now, as you saw from the analyst day, is on the Vault platform, and its own -- that percentage is only increasing. So, it's time to bring CRM in the fold. It will be better for Veeva and our customers. It's just the right timing.\n\nJack Wallace -- Guggenheim Partners -- Analyst\n\nGot it. That's helpful. And then, Brent, this one is for you. The R&D list, it sounds like that's ongoing and, you know, will continue through next year and probably '25 to support the migration.\n\nJust thinking about the context of that spend relative to the '25 targets. I say next year is going to be a little bit of an odd year with the revenue cadence on the TFC changes. But thinking about the percentage of revenue targets there, is that 17% to 18% still a good target for the, you know, '25 period?\n\nBrent Bowman -- Chief Financial Officer\n\nSo, yeah, we're not going to provide future guidance right now, but, you know, we're happy with the momentum and the execution, as Peter mentioned, growing at 18%. And we have our 2025 targets out there. We're tracking about a year ahead. And remember, that's a run rate target.\n\nSo, we're on track for that about a year ahead, and we're pleased with the broad portfolio we have to execute against.\n\nJack Wallace -- Guggenheim Partners -- Analyst\n\nGot you. Thank you.\n\nOperator\n\nYour next question comes again from the line of Ken Wong with Oppenheimer. Your line is now open.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nGreats. Thanks a lot, guys. Lots of stuff spinning in my head right now. So, maybe just back on the Vault CRM, would just love a sense of like any thoughts on how this could potentially impact pricing? Would that possibly change? And then second, just one for Brent on the impact of kind of the TFC that you called out at investor day, is that something that should hit at the start of the year for fiscal '24? What's the right way to think about when we should start rolling that impact in?\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nHey, Ken. This is Paul. Yes, I'll take the question on pricing. So, the way to think about it is the licensing model and the pricing will all stay the same and all of the same add-ons that we have will also be available with Vault CRM.\n\nSo, nothing really changes there. It will be pretty seamless and easy for our customers.\n\nBrent Bowman -- Chief Financial Officer\n\nAnd then, on the termination for convenience, Ken. So, yes, the $60 million is effective February 1 going forward. And how you should think about that is about 60% of that, we expect to have an impact Q1 of next year. And with the balance of that kind of diminishing over the balance of the year.\n\nAnd one other point there is it's -- the vast majority will be on the R&D Solutions side of the business. So, it's going well. We're working with customers and, yeah, we're on track.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nOK. Perfect. Thanks so much for the clarity, guys.\n\nBrent Bowman -- Chief Financial Officer\n\nYeah. Thanks, Ken.\n\nOperator\n\nYour next question comes from the line of Brad Sills with Bank of America. Your line is now open.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks so much. I wanted to ask about the new hires. You mentioned 483 new hires this quarter.\n\nJust curious where are the areas where you're focusing on new hires from a product standpoint and R&D versus, you know, sales and marketing, please? Thank you.\n\nPeter Gassner -- Chief Executive Officer\n\nYeah. I believe that was 483 net additions in the quarter. It's really broad-based. You know, it is true, right? If you look at our account executives, our account partners, it's there.\n\nIt's in our engineering, our product management, our services team, our support team I think the area where the growth is a bit lower in the G&A. We have a pretty efficient model there. So, it's customer-facing and product-facing people is where the growth is.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Peter. One more, if I may, please. Outside life sciences verticals, not something you've talked about a whole lot here at the analyst day and here. Just any update on where you are with those verticals? And is -- could that be an increasing focus going forward? Or are you still very much in that kind of early reference selling approach?\n\nPeter Gassner -- Chief Executive Officer\n\nYeah, our main focus is in the pharma and biotech. That's where our product portfolio is the broadest. That's where we have the bulk of our revenue. We're doing well in the consumer products area.\n\nI think we just passed 100 customers, which is a sort of a milestone I noticed on the sheet there. So, it continues to grow and that customer reference model is pretty strong there. Our product footprint is just smaller in that segment. And medtech is growing well as well, the medtech R&D side.\n\nIt's just life sciences is bigger for us, and our product footprint is broader.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Peter.\n\nOperator\n\n[Operator instructions] Your next question comes from Saket Kalia with Barclays. Your line is now open.\n\nSaket Kalia -- Barclays -- Analyst\n\nHey, guys. Thanks for fitting me in here. I joined the call late, so apologies if some of these questions were asked. But maybe I'll start with the Merck deal.\n\nCongrats on that, by the way. It feels like one of those all-in Veeva deals that we were talking about at the beginning of this fiscal year. I guess the question is, how is the pipeline of those types of opportunities? I mean, clearly, not, you know, to the extent of Merck, right? But these types of all-in consolidation deals. can you just talk about that pipeline and how you're thinking about it?\n\nPeter Gassner -- Chief Executive Officer\n\nYes, I'll take that one. Merck was not a deal but a strategic partnership over the long term. And we have strategic partnerships with many customers, none quite to the level of structure that we achieved with Merck. We may get some more of those, but those are there's none of those -- I can tell that there's none of those imminent right now, but we may get to more of those over time.\n\nAnd it's just a way to formalize our strategic partnership. They'll happen -- those will happen when they happen. And you shouldn't think of them as deals or product bundles. They're really partnership agreements.\n\nSo, that in Merck's case, it was so it made it easier to evaluate, consume and operate and purchase the Veeva products, just make it simpler for everybody the idea to say we're going with Veeva, when we need to make change and Veeva has a product we go with Veeva, that is what we do. And it makes it very efficient and pleasurable to work on in an environment like that.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. Got it. That makes sense. Maybe I'll direct the next question to Paul.\n\nI understand the CRM might have been beat to death, but maybe the question I have here is with the switching platform. Is there any sort of joint IP or anything that will go away? Or is there anything that -- and, of course, the time frame for one of the way I understand is very long, but just thinking about this. Is there anything that will change with the look and feel with Vault as the back end. I'm just curious whether the customer will see anything different with the change in platform.\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nYeah. So, on the first one with regards to CRM IP, it's pretty clear where there's IP in the platform that what Salesforce has, and there's IP in the application, and that's Veeva. So, there's a pretty clear line there. So, I wouldn't think about it as kind of anything kind of that's joint or going away that's combined.\n\nRegarding change in look and feel, part of our strategy is to migrate just the back end and to keep the front end as similar as possible. So, that will make it much easier for our customers to make that transition. It will do things like limit retraining. The front-end experience is working for our customers.\n\nThere's a reason why much of the industry is using it. So, we're not focused on changing a lot of that. Now, having said that, this does give us an opportunity over time to make some changes and deliver a better application. So, it's kind of that balance.\n\nWe'll keep things very familiar and are common in the short term. And then over time, it will give us a platform to further innovate on.\n\nSaket Kalia -- Barclays -- Analyst\n\nMakes sense. Thanks, guys.\n\nOperator\n\nWe are showing no more questions in the queue. I'll turn the call back over to Veeva management for closing remarks.\n\nPeter Gassner -- Chief Executive Officer\n\nAll right. Thank you, everyone, for joining the call today. And thank you to our customers for your continued partnership and to the Veeva team for your outstanding work in the quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAto Garrett -- Senior Director, Investor Relations\n\nPeter Gassner -- Chief Executive Officer\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nBrent Bowman -- Chief Financial Officer\n\nBrian Peterson -- Raymond James -- Analyst\n\nDylan Becker -- William Blair and Company -- Analyst\n\nAnne Samuel -- JPMorgan Chase and Company -- Analyst\n\nCraig Hettenbach -- Morgan Stanley -- Analyst\n\nPaul Shawah -- Executive Vice President, Commercial Strategy\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nStephanie Davis -- SVB Securities -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nJack Wallace -- Guggenheim Partners -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nSaket Kalia -- Barclays -- Analyst\n\nMore VEEV analysis\n\nAll earnings call transcripts"
}