{
  "companyName": "RH",
  "companyTicker": "RH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/09/rh-rh-q3-2022-earnings-call-transcript/",
  "content": "RH (RH -0.43%)\nQ3 2022 Earnings Call\nDec 08, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the RH third quarter fiscal 2022 earnings conference call. I would now like to turn the call over to Allison Malkin of ICR. Allison Malkin, please go ahead.\n\nAllison Malkin -- Investor Relations\n\nThank you. Good afternoon, everyone. Thank you for joining us for our third quarter earnings conference call. Joining me today are Gary Friedman, chairman and chief executive officer; and Jack Preston, chief financial officer.\n\nBefore we start, I would like to remind you of our legal disclaimer that we will make certain statements today that are forward-looking within the meaning of the federal securities laws, including statements about the outlook of our business and other matters referenced in our press release issued today. These forward-looking statements involve a number of risks and uncertainties that could cause actual results to differ materially. Please refer to our SEC filings, as well as our press release issued today or a more detailed description of the risk factors that may affect our results. Please also note that these forward-looking statements reflect our opinion only as of the date of this call.\n\nAnd we undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements in light of new information or future events. Also, during this call, we may discuss non-GAAP financial measures, which adjust our GAAP results to eliminate the impact of certain items. You will find additional information regarding these non-GAAP financial measures and a reconciliation of these non-GAAP to GAAP measures in today's financial results press release. A live broadcast of this call is also available on the investor relations section of our website at ir.rh.com.\n\nWith that, I'll turn the call over to Gary.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nGreat. Thank you, Allison, and thank you, everyone, for joining us today. I will start with our prepared remarks from our shareholder letter to our people, partners and shareholders. We're pleased to report better-than-expected results for the third quarter with net revenues of $869 million versus $1.006 billion a year ago and up 28% versus third quarter 2019 net revenues of $678 million.\n\nGross margin contracted 50 basis points in the third quarter, primarily due to fixed occupancy deleverage, partially offset by an increase in product margins as we continue to resist promoting the business. As previously mentioned, widespread discounting continues across our industry. And while it's been almost two years since we've deployed a promotional email, we've been receiving two sale emails per day for many home furnishings retailers. Although the stark contrast in strategy may lead to a short-term risk of market share loss, we believe there is certain long-term risk of brand erosion and model destruction for those who choose the promotional path.\n\nIt's that discipline and long-term thinking that has enabled us to set new standards for financial performance in the home furnishings industry and our results now reflect those of luxury brands as we delivered 20.8% adjusted operating margin in the third quarter, also exceeding our outlook despite the dramatic slowdown in the housing market. Our results are inclusive of investments related to the launch of RH Contemporary, the opening of our first RH Guesthouse, the development of RH International, and the rollout of RH In-Your-Home, which led to approximately 200 of the 640 basis points of adjusted SG&A deleverage in the quarter. Additionally, we experienced adjusted SG&A deleverage due to lower revenues versus a year ago. Our business generated $102 million of adjusted free cash flow in Q3, ending the quarter with $12.5 billion in cash on our balance sheet -- $2.15 billion in cash on our balance sheet, total net debt of $375 million, and trailing 12-month adjusted EBITDA of $1 billion.\n\nFiscal 2022 outlook. As noted in our previous shareholder letter, we expect our business trends will continue to deteriorate as a result of accelerating weakness in the housing market over the next several quarters and possibly longer due to the Federal Reserve's anticipated monetary policy and the cycling of record COVID-driven sales and backlog reductions. Based on our current trends, we now expect fiscal 2022 revenue growth of negative 3.5% to negative 4.5% versus our prior outlook of negative 3.5% to negative 5.5% and adjusted operating margin in the range of 21.5% to 22% versus our prior outlook of 21% to 21.5%. While we expect the next several quarters to pose a short-term challenge as we cycle the extraordinary growth from the COVID-driven spending shift and shed less valuable market share, we believe our long-term investments will enable us to continue driving industry-leading results.\n\nRH business vision and ecosystem, the long view. We believe, \"there are those with taste and no scale, and those with scale and no taste,\" and the idea of scaling taste is large and far reaching. Our goal to position RH as the arbiter of taste for the home has proven to be both disruptive and lucrative as we continue our quest to build the most admired brand in the world. Our brand attracts the leading designers, artisans, and manufacturers, scaling and rendering their work more valuable across our integrated platform, enabling RH to curate the most compelling collection of luxury home products on the planet.\n\nOur efforts to elevate and expand our collection will continue with the introductions of RH Couture, RH Bespoke, RH Color, RH Antiques & Artifacts, RH Atelier, and other new collections scheduled to launch over the next decade. Our plan to open immersive Design Galleries in every major market will unlock the value of our vast assortment, generating revenues of $5 billion to $6 billion in North America and $20 billion to $25 billion globally. Our strategy is to move the brand beyond curating and selling product to conceptualizing and selling spaces, by building an ecosystem of products, places, services, and spaces that establishes the RH brand as a global thought leader, taste and place maker. Our products are elevated and rendered more valuable by our architecturally inspiring galleries, which are further elevated and rendered more valuable by our interior design services and seamlessly integrated hospitality experience.\n\nOur hospitality efforts will continue to elevate the RH brand as we extend beyond the four walls of our Galleries into RH Guesthouses, where our goal is to create a new market for travelers seeking privacy and luxury in the $200 billion North American hotel industry. Additionally, we are creating bespoke experiences like RH Yountville, an integration of food, wine, art, and design in the Napa Valley; RH1 and RH2, our private jets; and RH3, our luxury yacht that is available for charter in the Caribbean and Mediterranean where the wealthy and affluent visit and vacation. These immersive experiences expose new and existing customers to our evolving authority in architecture, interior design and landscape architecture. This leads to our long-term strategy of building the world's first consumer-facing architecture, interior design and landscape architecture services platform inside our galleries, elevating the RH brand and amplifying our core business by adding new revenue streams while disrupting and redefining multiple industries.\n\nOur strategy comes full circle as we begin to conceptualize and sell spaces, moving beyond the $170 billion home furnishings market into the $1.7 trillion North American housing market with the launch of RH Residences, fully furnished luxury homes, condominiums and apartments with integrated services, that deliver taste and time value to discerning time-starved consumers. The entirety of our strategy comes to life digitally with The World of RH, an online portal where customers can explore and be inspired by the depth and dimension of our brand. Our authority as an arbiter of taste will be further amplified when we introduce RH Media, a content platform that will celebrate the most innovative and influential leaders who are shaping the world of architecture and design. Our plan to expand the RH ecosystem globally multiplies the market opportunity to $7 trillion to $10 trillion, one of the largest and most valuable addressed by any brand in the world today.\n\nA 1% share of the global market represents a $70 billion to $100 billion opportunity. Our ecosystem of products, places, services, and spaces inspires customers to dream, design, dine, travel and live in a world thoughtfully curated by RH, creating an emotional connection unlike any other brand in the world. Taste can be elusive, and we believe no one is better positioned than RH to create an ecosystem that makes taste inclusive and, by doing so, elevating and rendering our way of life more valuable. Climbing the luxury mountain and building a brand with no peer.\n\nEvery luxury brand, from Chanel to Cartier, Louis Vuitton to Loro Piana, Harry Winston to Hermes, was born at the top of the luxury mountain. Never before has a brand attempted to make the climb to the top, nor do the other brands want you to. We are not from their neighborhood, nor invited to their parties. We do have a deep understanding that our work has to be so extraordinary that it creates a forced reconsideration of who we are and what we are capable of, requiring those at the top of the mountain to tip their hat in respect.\n\nWe also appreciate that this climb is not for the faint of heart, and as we continue our ascent the air gets thin and the odds become slim. We believe the level of work we have introduced this year, inclusive of RH Contemporary, The World of RH, RH San Francisco, RH 1, 2, and 3, as well as the opening of our first RH Guesthouse in New York begins to demonstrate the imagination, determination, creativity, and courage of this team, and our relentless pursuit of our dream. I mentioned at the start of this year that, in over two decades leading RH, I've never been more excited about our future, and I've never been more uncertain about the present. Although my uncertainty regarding the short-term has expanded due to a complete collapse of the luxury housing market, my excitement for our long-term opportunity has grown exponentially as I believe the investments we are making to elevate and expand our product and platform will once again be transformative.\n\nAs we look forward to 2023, we will introduce the largest collection of new product in our history across RH interiors, modern, contemporary, outdoor, beach and ski house, baby and child, and teen. To amplify this historic launch, we will once again unveil a revolutionary new gallery design, as well as redesign and remodel all of our current galleries. We will be introducing RH to the UK and the rest of Europe this spring/summer in the most inspiring and unforgettable fashion with the introduction of RH England, The Gallery at the Historic Aynho Park, a 16th-century, 73-acre estate that will feature three restaurants; The Orangery, The Conservatory, and The Terrace plus The Aynho Architectural Library and The Deer Park, inclusive of the largest herd of white deer in Europe with viewing from the grand lawn. We are also under construction on RH Paris, The Gallery on the Champs-Elysees, scheduled to open in 2024, and RH London, The Gallery in Mayfair scheduled to open in '24, '25.\n\nWe have also secured locations in Milan, Madrid, Munich, Dusseldorf, and Brussels, some of which will also open in '24 and '25. RH also announced today the following acquisitions and hires to accelerate the brand's transformation and climb up the luxury mountain: The acquisition of Dmitriy & Co, a to-the-trade custom upholstery atelier; and the hiring of Dmitriy founders, Donna and David Feldman, to create RH couture upholstery. The acquisition of the business of Jeup, Inc., a to-the-trade custom bespoke furniture workroom; and the hiring of Joseph Jeup to create RH bespoke furniture. The hiring of Margaret Russell, former editor-in-chief of \"Architectural Digest\" and Elle Decor, to create RH media, an editorial-content platform that will celebrate the most innovative and influential people and ideas that are shaping the world of architecture and design.\n\nToday's announcements, plus our previous acquisition of Waterworks, firmly plant four RH flags at the very top of the luxury mountain and clearly state our intention of establishing RH as an arbiter of taste and design. These brands and businesses, thoughtfully integrated and amplified on what we believe will be the world's most innovative and dynamic global design platform, will begin to fundamentally change the landscape of the luxury home furnishings market and the to-the-trade design industry. As we approach the holidays and New Year, I would like to express our gratitude to all of our people and partners around the world for your contributions and commitment to our cause, and for bringing our vision and values to life. It's not easy striving to become the most inspiring brand in the world, and it's surely not for the faint of heart.\n\nIt takes courage to lead rather than follow. It takes collaboration to build a brand that can break through the clutter in this world. It takes teamwork to reach the top of a mountain no one else has attempted to climb. Twenty years ago, we began this journey with a vision of transforming a nearly bankrupt business with a $20 million market cap and a box of Oxydol laundry detergent on the cover of the catalog into the leading luxury home brand in the world.\n\nThe lessons and learnings, the passion and persistence, the courage required, and the scar tissue developed by getting knocked down 10 times and getting up 11 leads to the development of the mental and moral strength that builds character in individuals and forms cultures in organizations. Lessons that can't be learned in a classroom or by managing a business, lessons that must be earned by building one or by reaching the top of the mountain. Happy holidays Team RH, carpe diem.\n\nAllison Malkin -- Investor Relations\n\nReady for questions.\n\nOperator\n\nThe floor is now open for your questions. [Operator instructions] You will be provided the opportunity to ask one question and one follow-up question. We will take a moment to render our roster. Our first question comes from the line of Simeon Gutman from Morgan Stanley.\n\nPlease proceed.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey, good afternoon, everyone. I wanted to ask a question about written orders in the third quarter. I don't know if you'll comment, but if you use that run rate as a proxy for the business, does that get worse? And then my question is that we now -- since you beat in the third quarter, we have a slightly steeper slope to the fourth quarter. Is that less backlog? Is it more macro risk? What's changing from third down to fourth?\n\nJack Preston -- Chief Financial Officer\n\nMaybe starting with the second part, Simeon. Look, in the beat in Q3, I think most of that I would characterize as just timing of sales from Q4 to Q3 not necessarily -- some of that is obviously relieving backlog faster than expected, but we had expected to relieve that backlog and continue to do so throughout the year. So, look, I think on the year, we're still talking about $3.6 billion in sales. I don't think our sort of numbers changed materially in terms of that outlook, slightly steeper sure, but it's not kind of rounding error, in a sense, with all due respect.\n\nBut I think it's pretty consistent with what we talked about before and simply just Q3 had some pull forward of sales from Q4 and a little bit of faster backlog belief.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. And then as a follow-up, maybe more for Gary, knowing that you're going to continue to invest for the future and still be somewhat responsible here for the near term. Question is what -- are you looking at prioritizing things differently? Does anything get sacrificed, love to hear how you think about this, especially as the year keeps evolving with the Fed still tightening?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. How do you define responsible?\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nYeah, I don't know, if I can answer --\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nI'm just trying to understand the question. So, I think --\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nCut back on that --\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, we're communicating what we're doing. We believe everything we do is responsible. So, I don't quite know how to answer that.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nWell, maybe this as the second part, which is, is anything getting sacrificed meaning or some of your longer-term investments putting on pause or no, and that's maybe that's just the right way to look at it.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nWe're not putting any longer-term investments on pause. I mean, we're playing for the long-term. So, we're not doing irresponsible things that other people are doing like promoting their business and selling. Sending, I don't know, 30 emails to a customer a week with sales time out.\n\nThat, I think, might be irresponsible. But I guess it depends on your strategy. If your strategy is to stand for price, then maybe that's an OK strategy. Our strategy is to stand for design and quality and innovation.\n\nSo, it's positioned the company around product, not price. So, I think we've been really consistent with our strategy. And as you think about priorities, we reprioritize all the time here. We like to say, you've kind of got to get going, get to know, \"Are we strategically right? Are we directionally right?\" We believe we're strategically and directionally right.\n\nWe believe that we make the right long-term investments and build this business for the long term we'll become one of the few brands in the world that exist over a long-term period of time. So that's unusual in our industry. Most people build a concept and then they roll out 300 or 500 stores. And at the end of 10 years, it's an old concept.\n\nSo, we would like not to get old, and we like to continue to reinvent the business. And whatever the cycles are, if you look at it for us, if you look back at history, since I joined in 2001, there was a recession at that time, and we elevated the product and kind of transformed the brand. We did the same thing in 2008, '09, the financial crisis. We went through another cycle again in '15, '16, '17, when we made the move to membership and rearchitect the back end.\n\nWe also introduced Modern and continue to evolve and make the brand relevant and make sure we're leading the industry. And we think the work that has begun with the introduction of RH Contemporary, which will triple in size next year from an assorted midpoint of view. And the introductions we're going to make across the entire portfolio, but the new gallery design that we're going to unveil, and we'll go through and remodel and redesign all of our current galleries and refresh all of those, as well as the platform we're building globally for the brand is going to once again transform RH and then put us in a position where we create massive strategic separation. So, we're kind of comfortable being the others and going the other way.\n\nSo, a lot of people are hunkering down right now and slowing down. We're kind of speeding up. We're more excited, less fearful. I think we saw this coming.\n\nThis is not a game that's the first time we've seen it. It's just different. But our moves over the last 22 years have been very consistent. I think we're pretty disciplined in the things we do.\n\nThey're unusual. When we were opening 50,000 to 60,000 square foot stores, the rest of the industry was closing stores and shrinking footprints and trying to move all their business online. Now everybody is opening stores. And I don't know, maybe we're just a little bit ahead of everybody else.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. Thank you very much. Happy holidays.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nThank you. Happy holidays to you.\n\nOperator\n\nOur next question comes from the line of Steven Zaccone from Citi. Please proceed.\n\nSteven Zaccone -- Citi -- Analyst\n\nGreat. Good afternoon. Thanks for taking my question. I wanted to focus on RH Guesthouse.\n\nThe last time you're on the call, you talked about some of the initial interest. How has that performed the first three months that it's been open? What are some of the early learnings for the hotel? And do you see opportunity to open more of these concepts going forward?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. I mean we just opened. We think it's extraordinary. The feedback we're getting from our guests is incredible.\n\nThe feedback we're getting on the restaurant has been incredible. And so, we're just in early learning period. We're not -- I missed the first time we've ever done this. So far, we're really excited.\n\nWe're going to be opening our champagne and caviar bar soon. We've got our feet underneath on our new live-fire restaurant. And so, we couldn't be more excited about it. I mean the feedback from our guests is -- a lot of people are saying, gosh, how am I going to be able to get in long-term because it's just not that many rooms.\n\nBut we're excited -- it's going to be learnings here that will help us evolve and make ad spend better and yes, so on and so forth. So, this is just very early, big test. It's kind of a small thing in a very big organization that if it becomes a big thing long-term, great. But right now, it's really positioned to be something that helps redefine the brand and have people look at us differently.\n\nSo, I think it demonstrates the kind of creativity and passion and attention to detail to do something extraordinary. People from the hospitality industry have come and seen it and toured it. Luxury CEOs that have come and toured it said they haven't seen anything like it anywhere in the world. So, we just let it kind of unfold here.\n\nSteven Zaccone -- Citi -- Analyst\n\nOK, great. Very helpful. The other question I had was on gross margin. So, the first quarter of the business has seen a decline, obviously, on occupancy deleverage.\n\nBut as we look forward is that the likelihood that you probably see gross margin decline again in the fourth quarter? How should we think about the trajectory from here?\n\nJack Preston -- Chief Financial Officer\n\nYeah, I think, look, when you look at the sequential just change in our absolute sales. So, when we went from revenue in Q2 of $992 million and gross margin of 52.8% million and going to $869 million in Q3 and 49.7%. As Gary mentioned, a lot of that is occupancy deleverage. And if you think about Q4, there's a further sequential decline, right? Q4 is a smaller quarter for us.\n\nSo, at the midpoint of the guide, we're at $789 million. So, if you do -- if you just -- we were not guiding gross margin, but if you do sort of like similar sort of math and transposition of numbers going from Q3 to Q4, as you did from Q2 to Q3, you'd naturally see a gross margin decline built into that because, again, the absolute sales are lower than Q3. So, it's just math. I mean, directionally, probably 100 basis points-ish, but again, we're not officially guiding gross margin.\n\nIt's just a correctional number.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, I would just say, look, if you look at the housing industry and track the housing industry and if you track the performance of home furnishings retailers against past housing downturns, that would tell you things are going to get worse before they get better here. The housing industry is in a free fall. I think the National Association of Realtors just reported that housing demand was down 37% in October. We've never -- at least in my lifetime, I've never seen interest rates rise so quickly.\n\nI don't think anybody on the phone has either and the impact on the housing market, especially when you look at it versus the housing market that was overinflated and run up by COVID, you're going to have some wild swings here. And it's happening first to the luxury market. If you look at the numbers and if you track the last, yes, nine months or the reporting on Redfin, I think it started -- the luxury housing market started going down in the Q4 last year. And the luxury housing market went up faster and higher, and the luxury housing market is going to go down faster and lower.\n\nAnd that's just an outcome. And so, the question is, there's going to be people that rode it up and they're going to try to stay up and they're going to promote their business, and I think they're going to break their models. And next thing you know, you got to send out 1,000 emails to let next year, too, and you're just going to what I call the downward spiral. We're in the dish.\n\nAnd so, we've kind of expected from the beginning that this COVID lift wasn't anything that we manufactured. And generally, when that happens, those kind of things go up and then they go down. And you try to stay focused on the long term. But we're not going to try to break our model to try to and promote the business in a period.\n\nI mean, we have people that are in our industry right now that has some pretty good sales. Their whole website is 30% to 40% off. If I put our whole website, 30% to 40% off, we changed the sales trend by 50 points. Problem is you're just going to have a much less productive business because doing more volume and lower margins and all that volume also creates costs that are inefficient through a model.\n\nI've already run companies like that. So yeah, we have a different model. Someone asked me the other day, \"Hey, what if you're wrong on your long-term view? What if the market is not $25 billion? Right? OK. What if it's not? What if it's half that? What if it's $12.5 billion? \" And we have 30% EBITDA.\n\nI don't know that directionally looks like some other people like Hermes, and people like that, like, I mean, their EBITDA is higher than that. But we've been a ZIP code where this company would be worth a lot of money. And so, whether we become $12 billion or $25 billion, it's not really what's most relevant is do we get there. And do we become really the first integrated luxury home brand in the world? And that's just going to be a different path than anybody's taking because no one's ever done it.\n\nSo, there's going to be some ups and downs here. But the housing market has been a free fall, and it's going to get worse before it gets better. So far, we've been more right than wrong about that because we don't really try to lead our business based on hope. We try to run our business the best we can based on back facts and math and logic and patterns.\n\nAnd so, I may not sound really optimistic right now short term. I'm not. I'm super optimistic long term. So, if you want to play a short-term stock, don't play ours.\n\nDo you want to invest for the long term, this is a good place to put your money.\n\nSteven Zaccone -- Citi -- Analyst\n\nDuly noted. Thank you. Happy holidays.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nHappy holidays.\n\nOperator\n\nOur next question comes from the line of Max Rakhlenko from Cowen. Please proceed.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGreat. Thanks a lot. So, the way that you're seeing your margins play out over the past couple of quarters with upside, both 2Q and 3Q, does that give you more confidence in keeping at least 20% EBIT margins next year if the environment remains challenging? And then just more broadly, how are you thinking about the durability and margin power of the business today given some of the moves that you've made recently?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nIt depends on our -- that always going to depend on your investment and your investment timing. Our underlying core business -- if we wanted to, yeah, we can crank it all back and stay at 20%. I'm not sure that's a long-term priority. I don't know how bad this market is going to get.\n\nAnd we don't want to promote the business over the short term to try to create some short-term outcome that's going to be a relevant two quarters after that. So, there's going to be a lot of decisions to make, really difficult environment for those of us in the home industry. And especially if you're at the higher end, it's more challenging. And for some people, it's not intuitive.\n\nBut you've got to think about it. With the greatest migration of people moving from cities to suburbs in the history of America during COVID and to second home markets. The people that did that could afford to do that. The people that move the most and bought the most homes were the luxury customers that have the capability to do that.\n\nThat's why the luxury market went up so high and the housing market, the luxury housing market benefited the most, and we're going to have a flip side here. So, look, we didn't -- all that extra money we made during COVID, we didn't waste it. And on the flip side, if we have a bigger give back, that's OK. If you look at every home furnishings retailer and look at where their operating margins were in '19 when they entered COVID and where they exited in '21, we had the highest operating margins going into COVID, among all of the furnishings retailers, and we exited with even higher margins than anybody else.\n\nWe picked up more margin than we hit more strategic separation. And I believe, as we should, our consumer move more, our consumer had more urgency. And in some cases, where other people promote it, maybe they got a little bit more top line than us, but we just didn't promote it. But it's like trying to act like, oh, this is a surprise.\n\nNow like -- I mean, the Fed pumped so much money into the economy. They created inflation. They held interest rates at such low levels, they made it easy for people to buy homes. Now we're on the other side of that.\n\nQuantitative easing, interest rates are up. We've got inflation. Who's seen this game before? Anybody on this phone, not unless you were in the market in 1975 to 1982. This is a whole new ball game that no one's even seen.\n\nWe're trying to just look at the patterns and look ahead and say, what's the best way to play this, where we come out and we really are positioned for the next five to 10 years, not the next two to three quarters or even the next five or six quarters. That's not relevant long term. Relevant long term is what's the next five to 10 years is going to look like. And what are the decisions we're making today that are going to -- that are going to impact that vector, right, that helps us slightly more up and over the long term makes a big, big difference.\n\nSo that's how we're focused. We're not managing this business. We're leading this business, somewhere bigger and brighter and our journey is going to be a little longer. It's going to take a little longer.\n\nSo, there's going to be people that have patience and there's kind of people that don't have patience. We have patience. You need patience if you really want to be extraordinary in this world.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGot it. It's really helpful. And then can you just separately speak to the customer reception to contemporary. How is that going compared to your expectations? And then just any updates on the timeline of the rollout to other galleries?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. We're very happy with the initial response. We wish we could get more product faster. It's two things, a lot of it got impacted by the supply chain backup, which are now just kind of all coming unlock.\n\nBut also, almost all of the new products is really new product that has never been made at scale before. So, one of the things that is going to happen to us during cycles. This happened to us in '08, '09 when we kind of transformed the assortment in the business. It happened us in '15, '16 when we moved the Modern, and it's happened to us now.\n\nWhen we make these big moves and they're generally every seven or eight years because those are kind of the big cycles in our business. I mean trends can last 10 to 15, but there's generally -- I think every brand needs a major refresh every seven or eight years. And so, our just having to be timed to economic downturns. And a lot of that is coincidental, quite frankly.\n\nIn '15, '16, it wasn't really an economic downturn. We created somewhat of a downturn when we moved to membership because that was a kind of a year transition to do that. But when you bring in this much new product that the world hasn't seen before that no one's ever scaled Travertine furniture or Burl wood at scale, you can see pieces out there. Antique stores or some retailers have a piece or two, a couple of pieces.\n\nThey don't have collections with 130 SKUs. And no one's out there making that stuff at scale. So, we are going to constantly for the rest of time have to continue to build the supply chain capability that enables us to invent. I mean if you're going to invent something new and scale something new, it means it hasn't been done before.\n\nSo, it can take longer, it's going to be bumpier. And it's the difference between leading a business, managing a business, invention, and innovation versus duplication. And so, I think we're going to go through the same thing with temporary. It's taken longer to scale this stuff.\n\nI mean we just got back from the quarries in Italy, meeting some of the best families and quarry owners and building partnerships for stone. And so, we can make stone furniture at scale and we can have better economics and a better supply chain. I mean, I don't know, two weeks ago, we went around the world for 10 days. I think we were in seven countries or something like that and -- in the factories and meeting with the factory owners and talking about scaling not only what they're scaling up now, but what's coming next, which is -- I mean, you've just seen the first little introduction of contemporary.\n\nWhen you see what happens next year, it's extraordinary and revolutionary. I mean I think it's going to be -- we're going to own this entire kind of esthetic and look and be no different than how we approach '08, '09, when we took kind of the European Belgian kind of aesthetic and we went out there and owned it and did it at scale. And it became kind of the RH Look in the industry. And then we didn't just dabble and modern.\n\nWe launched with a 450-page book or something like that, 545-page book, yeah, 545-page book. And you have bumpiness on getting the supply chain up on both of those, by the way, but we wind up building a $1 billion business at a Modern. I think Contemporary is going to be the most extraordinary thing we do. So, you've seen like the first kind of -- the first course of the meal.\n\nThere's, call it, a four-course meal. And next year, there'll be two more big courses and there'll be another big course in '24. And by '24, I think we'll have it rounded out. But it's going to be -- I think it's going to be the most extraordinary thing we've ever done.\n\nSo, we're really excited about it. I wish we had more goods right now, which we could roll it out to more galleries right now. But so far, every dollar we put it in, there's been really good response, and we're really excited about getting into more galleries.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nAwesome. Thanks a lot, Gary, Jack, Allison. Happy holidays, everyone. Speak soon.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nHappy holidays, Max.\n\nOperator\n\nOur next question comes from the line of Curtis Nagle from Bank of America. Please proceed.\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks very much for taking it. So, maybe kind of one longer-term question then a quick model one. So, first, Gary, I'd love to talk about the acquisitions and kind of how much the step-up your high-end trade and interior design business for us kind of a little less than now and how big an opportunity from a revenue perspective you could see.\n\nAnd then just as a follow-up, I just wanted to clarify that comment, kind of loosely made about 20% margin next year if you pull back investments, maybe I misheard, but just if you could clarify what you were talking about there?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, I think -- yeah, as you think about the high-end design and trade, how big is the revenue opportunity. The people at the very top of the mountain own the most homes, not only do they own the most homes, the homes are more expensive. On average, someone spends about 10% of the home costs on furnishings, decor and art, right? So, when they buy nicer homes, they buy nicer furniture. They furnished the whole house.\n\nThey have multiple houses. And so that's the most lucrative part of the business. It will be the most profitable part of the business. It has the most leverage.\n\nYou make the most money there. So, we think it's really important strategically. And we went out and met who we believed had the best reputation and quality and design in upholstery and the same in kind of case goods and furniture. And they're big believers of trying to scale this level of quality and design.\n\nAnd so, we're really excited about it. It's going to take a while. We've got to get it up and going and test it and see how it goes. We've got to figure out exactly how it's integrated.\n\nBut the long term -- yeah, I would just say probably today right now, there's a bunch of people in the high-end trade industry that just kind of said, WTF. And then like now what is going to happen? And this is a big move for us strategically. But we've got to build capability. There could be other acquisitions to build capability here.\n\nAnd you think about the investments we're making, building a media platform and a content editorial platform that will position the brand as an authority in the industry. I'm not speaking about ourselves, speaking about the people who are really shaping the world of architecture and design. We want to become an authority and a voice in that. So, you don't really do that by talking about yourself.\n\nYou do that by talking about other people. And so, we're just going to take a different path and to build a different market. We're going to continue to evolve and change. I mean not too different.\n\nIf you think about Apple, right? I mean, Apple, I mean, they started pretty high up with a $400 phone or something we started out. And what's the latest Apple phone like $1,100 or something, $1,200? Yeah, I mean, they kind of created a high-end market for phones. But I think the average phone back then was like $69 in Motorola Razr or something. So, I think we're -- one, we're not just going after a market and how big is the revenue opportunity there.\n\nWe're also going to create a market because that product at that level of the market is not accessible. You can't go into those showrooms. The goods aren't priced. You're kind of blind and you have to go through a middle person to even to have quality of -- that quality and that design.\n\nSo, we think it's going to be a big unlock just starting to make that level of quality and design available. We think we will grow the market. We think it will be a big, big plus to our brand to get us into those customers' main rooms. I think today, we mostly play in the family room, the second bedroom.\n\nI don't know we get that customer's living room, master bedroom, main house. I think it's just going to open up a lot of opportunity. But a lot to test, a lot to learn, a lot to figure out. We thought about it for a long time.\n\nWe've worked on this for a long time. Today, we decided to tell you officially that we're doing it before everybody knows. We're super excited about the talent. It's also -- what I'd say is the talent acquisition, too.\n\nI mean these people are just incredible culturally, creatively, entrepreneurially just incredible, incredible talent. We've all, in the short time we've been together. We've learned from each other, and they've rendered us more valuable. I think we've rendered them more valuable.\n\nSo, it's kind of an upward spiral.\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nYeah, for sure, some really impressive resumes there. And then just going to the follow-up question, Gary, just a comment you made about could have 20% margins if you pulled back or something like that, I may have misheard, but I just wanted to clarify that.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, the underlying model, I think we've already said it can withstand a 20% down and probably hold the margins around 20%. So that doesn't necessarily mean that's what we're going to do, that we're going to pull back investments when we should be investing. So, right now, again, I don't think the idea here -- I don't think it's strategic to go, \"Hey, let's have 20% operating margins in 2023.\" I don't think a lot of people get up in the morning and go to work and fight for 20% operating margins. They get up and they go fight to do incredible inspiring work that they think is going to create great long-term opportunity.\n\nAnd if we didn't have a whole lot of things to do, we didn't have a lot of great ideas that we're pursuing right now. Yeah, I say, \"Hey, you know what? We don't have anything that's really that big worth investing in.\" So, like \"Here we go, let's hit 20% operating margin. Let's make that the goal, but we have some incredible stuff what we're working on. The most exciting stuff we've ever worked on by far.\n\nAnd the kind of stuff that you're so excited, you don't -- you can't sleep, you can't even go home, you're just so excited. And we have groups of people that are here, have been through all kinds of hours, like figuring stuff out because the work is really that special.\" So, we're investing in that work as we think that work will change the vector and will change everything and will create massive strategic separation. So, we're not really looking at -- I wouldn't say -- if you said, \"Hey, Gary, is your focus on financial outcome in 2023?\" Not really. Our focus is on creating a leapfrog in 2023 and 2024 that when we come out of this cycle, that people look around and go, where did they go? That we've just made such a leapfrog that we're so much farther ahead of everybody else on every level.\n\nAnd that will create big returns. And we know how to create big returns. We built the best model in the industry. So, we're going to do things that make the model better.\n\nBut you can't do that by not investing and go, \"OK, we're 20, let's hang on, let's do less.\" That's the downward spiral. That's the long-term death spiral. And that's not the game we play.\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. Thanks very much and happy holidays.\n\nOperator\n\nOur next question comes from the line of Jonathan Matuszewski from Jefferies. Please proceed.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nGreat. Good afternoon and thanks for taking my question. Gary, you mentioned 2023 will mark the largest introduction of new products in company history. So, how should we be thinking about your Source Book strategy next year? How are you thinking about mailings relative to maybe this past year, given all the new product launching? And should we be planning for elevated Source Book costs, that's my first question.\n\nThanks.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, you should. And probably a big advertising campaign that I think it's the best work we've ever done. So, we're going to shout from the rooftops.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nGotcha. And then my follow-up question on supply chain. Can you help us understand the cadence of how supply chain cost tailwinds may flow into gross margin next year? The reason I ask is I think 70% of your cost of goods sold is sourced from Asia. So, how should we be thinking about the timing once we're on the other side of elevated inbound container rates next year? Any color there would be helpful.\n\nThanks.\n\nJack Preston -- Chief Financial Officer\n\nHi, Jon, so we're kind of getting some of that already. If you think about the ocean-freight contracts, they reset roughly June 1. So that's where we saw the initial burden of those much higher rates, as we've talked about in various calls. But I would say every month since then, we have actualized a number lower than contracted.\n\nAnd the way you achieve that, obviously, you're not always going to contract at the spot rates lower. So, you're going out in the spot market, and those rates have been coming down, there is excess availability, especially along certain Asia Pacific routes. And so, while we initially saw margin pressure from the higher rates in, I would say, the first four, five months, we're at a point now where we -- like this last month, we're lower than we were for the sort of contracted rates for the prior year. So, and if you think about our turn, call it, two, three times depending on the product category and a lot of our business is special order so there's an immediate impact on that.\n\nBut the part of stock, I mean, we felt pressure and we're kind of now getting into the -- some of the initial tailwinds, and that's reflected in our guidance obviously. But that we expect, honestly, as we look at it and we think about what's happening with the supply chain, I think there's probably more to come there, more opportunities. And so those are starting, and we'll continue to see that in the next year, we believe.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nThat's helpful. Best to look for the rest of the year.\n\nJack Preston -- Chief Financial Officer\n\nThank you.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur final question comes from the line of Michael Lasser from UBS. Please proceed.\n\nAtul Maheswari -- UBS -- Analyst\n\nGood evening. This is Atul Maheswari on for Michael Lasser. Thanks a lot for taking our questions. Gary, your stock buybacks slowed quite a bit this quarter.\n\nThe question is, why did you go slow on buybacks so much? Was it because of the M&A or has anything fundamentally changed about how you view buybacks in the current landscape given you still have over $2 billion of cash in the balance sheet?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. Look, I think that the housing market has collapsed. And it went down pretty viciously as interest rates have went up. And so, I think Simeon's first question was about being responsible.\n\nSo, we're not going to necessarily change the world through a buyback strategy. And when you're going into kind of a storm that you haven't seen before, you don't want to sail -- or let's say, you're not in a sailboat, but you're in a boat -- you don't want to spend all your fuel before you can see the shore and run out and be floating around out there. So, there's lots of examples of people who went out and spent a lot of money on buybacks and went bankrupt. And Bed Bath & Beyond will probably be the next one that does.\n\nThey're pretty famous for how much stock they bought back. So, I don't know exactly how this housing market is going to play out. I don't know if the housing market is going to -- almost always, the housing market is in a recession. I mean if somebody doesn't think that I'd love to just to zoom and put our numbers up for you.\n\nBut the luxury housing market has trailed down since last September, right, it is down 8%, down 16%, down 17%, down 16%, down 12% in January, down 13% in February, down 15% in March, down 18% in April, down 18% again in May, down 21% in June, down 24% in July, down 28% in August. And the new numbers will come out for the next quarter, and we'll never know how far it'd go down. But the odds are it could be down 35%, it could be down 40%. So, when we start seeing trends like that, I don't know how it comes all apart.\n\nDid anyone see 2008 coming because the way the market reacted, it didn't seem like it, right? And nobody sees the big implosions. And we're not greedy. Again, we're not going to accomplish our goals here based on a buyback. So, we're spending our -- we'd rather just go, look, like where is the world going right now? We've never pumped these many trillions of dollars into the economy.\n\nNow, interest rates have never raised -- accelerated this fast. Inflation hit numbers that we haven't seen in 40 years. It seems like Powell kind of sounds relatively confident when he's up there, but he's the guy that raised interest rates way too slow. He's the guy that didn't start easing.\n\nI mean, he should have raised interest rates and not let the housing bubble happen. Housing prices went up from 2020 to 2022 by 45%. That's never happened except in the '70s. The two-year period, housing going up 45%.\n\nAnd so, I don't want to sit here and have all kinds of debt and not have any clarity of what it looks like out there. So let the storm, become clear. Let's make sure we can see the shore. Does that mean, oh, maybe the stock runs a little bit, and we buy a little less? It's not -- we're not here spending all our time trying to figure out how to optimize the buyback.\n\nWe think our stock is undervalued today. Could it get worse? I think business will get worse before it gets better. Will our stock get worse before it gets better? I don't know. But I haven't been here for 22 years.\n\nI spend all my time thinking about that. We've got much more exciting things to focus on. When we have a better view of the shore, that we'll make the right decisions.\n\nAtul Maheswari -- UBS -- Analyst\n\nGot it. That's fair, Gary. Thank you for that. And as a related follow-up, at this point, how much visibility do you have on some of the planned gallery openings in Europe and even the US over the next 12 to 18 months? And if the macro does turn further worse, would you look to maybe delay some of the openings until when the macro stabilizes so as to get the most customer attention to some of the great work that you and your team have been doing?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. It's a little tough to do that because when you're in construction, if you stop, you're just going to make a gallery cost twice as much. And you're still paying rent. And you still have cost.\n\nSo, I mean, I don't think we've ever opened a gallery that doesn't make money. So, our new galleries, I anticipate will do well. I mean, business goes down 30%, 70% of the people still buy. All our galleries are really productive in the company today.\n\nSo again, so we opened a little slower and then it just means when we come out of this, those galleries have big comps. So, we don't try to time things like that. I mean we're not -- if we were a company that had like 5% to 8% operating margin or even 10% or 12% operating margin, and you hit a downturn like this, that could be sustainable and it pulls you down and you might have a cash flow problem, yeah, then you're going to make decisions like that. We're not going to have a cash flow problem.\n\nSo why would we stop building stores that we know are strategic and they're going to make a lot of money? So that doesn't make sense to me. Maybe other people have to do it because they have the cash flow problem. We're not going to let ourselves have a cash flow problem. That's why we haven't deployed $2 billion buying our stock back yet, because I don't know.\n\nDoes Powell and his team know what to do? Are they just tinkering around? They haven't seen this before. And is someone going to make some calls here and we go into a ditch? It's not going to be a subprime thing, but it could be something else. Nobody has seen any of these big things coming except for one or two people. The guy in the big short, he got it. Maybe a few others.\n\nThe most people don't get it right. And right now, I've never seen more confusion. You read the headlines of the top papers in the world. And I mean who's saying what.\n\nWho thinks -- I mean, the KPMG Consulting Group, they think housing prices are going to drop 20% next year? Goldman Sachs thinks housing prices are going to drop 7.5% next year. The Natural Association of Realtors think housing is going to go up 1.2%. Prices are going to go up 1.2% next year. Generally, people speak from a place of self-consideration.\n\nLike if you're a realtor, you need to sell houses to make money. So, you're going to have the rosiest outlook. If you're a banker, you don't want transactions to stop. You don't want the banking industry to slow down, right? And if you're a consultant, you don't mind telling everybody the bad news because people hire you when they're all screwed up and panicky.\n\nSo maybe they're the ones that going to tell you the worst case, I don't know. But that's a big spread. Don't you think? Housing prices are going to go up 20%, go down 20% or they're going to go up 1%. That sounds like everybody is on the same page.\n\nSo, it's just a lot of uncertainty right now. But one thing I'm certain of the housing market is collapsing at a level I haven't seen since 2008. I haven't seen this kind of drop since 2008. So go look at how far housing dropped in 2008 and 2009 because these numbers look just like that.\n\nAtul Maheswari -- UBS -- Analyst\n\nThat sounds ominous. So, thanks for that, Gary, and happy holidays.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nThank you.\n\nJack Preston -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nAnd we do have one final question from Seth Basham from Wedbush Securities. Please proceed.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks for taking my question. First, Gary, I'm sorry, I jumped on late but if you already addressed this. But we noticed in some of your work that you're partially rolling back some price increases on select products. We've also seen a higher level of clearance on your website.\n\nCan you characterize that relative to your pricing and brand strategy?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nSure, sure. Well, the -- as Jack mentioned, freight costs are coming down. Raw material costs are coming down. Pricing is coming down.\n\nAnd we're not going to not want to have a good value in the marketplace. So of course, we'll adjust pricing as our pricing comes down. And sales are down. So did we plan for sales to be down this far? No.\n\nDid we think that housing market was going to collapse this fast? No. Did we think interest rates are going to go up this fast? No. So, do we have more inventory than we'd like? Yeah. Should we be accelerating the things that we don't want to have in our assortment long term that we're clearing out because we have new product coming in? Of course.\n\nWill we have more than normal? Of course, we will. That shouldn't surprise anyone. It's the retail business. You have new products coming in, you've got to get rid of old products.\n\nSo, you mark it down. If your sales are down, you've got more old products. So, you're going to mark it down a little faster. Otherwise, your DC can't process it.\n\nSo yeah, that's all that's happening. And if prices go up, raw materials go up, shipping goes up like everything that happens in COVID. You're going to take your pricing up. The customer -- consumers going to understand it.\n\nIt's well now, but they're also going to understand when things come down. And so, our whole business, you look at everything through a lens of design, quality and value in that order. If the design is not beautiful and inspiring, nobody buys it. if the design is great, then they get closer to the product and they assess the quality.\n\nIf they love the design and they believe it's really good quality, it's great quality then they look at the price. And then the consumer makes the decision for that design and that quality. Is this a good value and do I buy it? We try to guess where that best point is. Sometimes we're right, sometimes we're wrong.\n\nSo, we adjust pricing all the time. We're never going to price anything exactly –and we're never going to buy it exactly right.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nAs it relates to your clearance strategy, Gary, is the primary channel of clearance through your full-price stores and website as opposed to your outlets?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah. Yeah. You want -- like we've got way more galleries with way more people coming into them, right? And so -- and we have a website, our full-price website is where we have the most traffic. So, you don't want to move products out of that channel right away.\n\nLike we have -- yeah, we would -- you just back up inventory really fast. I mean this isn't the luxury apparel business where they just throw it in a dumpster and burn it. This is furniture. We're never going to run it exactly like the luxury apparel people or the luxury jewelry people and stuff like that.\n\nI mean, our business, we can't throw away the product, and it's just got a different thing. We're going to have a different kind of outlet clearance model all the time. Something comes back as a return, you can't take it back at the store, can't put it back on the shelf. I mean once it goes on a truck and it's out of the box, you got to take it somewhere, so you have outlets because customer doesn't like it or it's got a tiny scratch or that you can't fix or something is wrong, you've got to figure out what to do with it.\n\nBut when you have plans to say, OK, here's the collections, there's things that are going to be going out that you're going to be marking down and your demand falls pretty rapidly. That's going to change your pricing strategy. It has to because you've got inventory that's on order that's coming in. Bulky goods like ours, you better keep that inventory moving because Fernando is sitting here, if we don't move the inventory, he will figure out -- he'll have to figure out where to put it, and we might not like what he does with it.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nOK. Lastly, if I may, a point of clarification. Did you say earlier that you could do 20% operating margins next year if you pulled back on a lot of investments? So, with this tough macro environment, should we think of 20% as sort of the high watermark for next year?\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nWell, I think it all depends on where demand goes, what happens to the housing market. What's going to happen with interest rates, inflation in the housing market? And are we in -- how long of a downturn are we in? Is this downturn get worse? If housing falls off at a greater rate, just demand is going to go down. Our business is tied to the housing market because if you look at our business, it's tied to events. Someone bought a new home, they're remodeling a home, or they are redecorating their home.\n\nThe core of our business is not like the person that goes, yeah, I need some new bedding. That's -- our business is tied to those three things. So, if people are not buying homes, if people are not remodeling home. And by the way, when people remodel a home, they're generally buying a home to live in, our customer is while they're remodeling.\n\nSo, that's actually kind of good for our business. But if the real estate activity stops, it hurts our business. So, if you have a 20% downfall in the housing market, two out of 10 people didn't buy a home. If it's 30%, three out of 10 people didn't buy a home.\n\nAnd then -- or didn't move or are not remodeling it. Activities -- I mean what is it, mortgage applications were down 47% in October. That's just the number. I'm not the doomsday guy.\n\nThat's just the number. And we look at these numbers. So, mortgage applications down 47%. Isn't good for the outlook of our industry.\n\nIt's the highest print yet. So, next year, it's like a month and a half away. That slowdown -- like that -- they don't buy a house and they buy the furniture the next day. So, there's a whole tale to all this stuff.\n\nAnd so how it cycles through, I just don't know where it's going yet. I don't think anybody does. I think anybody tells you they think -- know where the housing market is going. I don't know who's been right yet.\n\nThis is not -- by the way, from the housing point of view, there is no soft landing. We're way beyond the soft landing. This is a really hard landing or a crash landing, and it's looking more like a crash landing in the housing market. It's looking like 2008, 2009.\n\nAnd that sounds like whatever Aaron said like I'm a pessimist or whatever.\n\nJack Preston -- Chief Financial Officer\n\nOminous.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nYeah, ominous or whatever. OK. OK. Maybe I'm a truth teller, and I'm not a BSer.\n\nBut sometimes the truth isn't what everybody wants to hear. But it's just the truth, the fact. You guys can read out, yeah, so.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nUnderstood. Thank you for your candor, and happy holidays.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nHappy holidays.\n\nOperator\n\nThat does conclude today's questions. I would now like to turn the call over to Gary Friedman for closing remarks.\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nGreat. Thank you, everyone. Well, as we said in our letter, we really want to thank all the people and partners, all the world that contribute to our cause, our shareholders for believing in us. And we just wish everybody, happy, happy holiday, and we look forward to speaking with you in the New Year.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAllison Malkin -- Investor Relations\n\nGary Friedman -- Chairman and Chief Executive Officer\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nJack Preston -- Chief Financial Officer\n\nSteven Zaccone -- Citi -- Analyst\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nCurtis Nagle -- Bank of America Merrill Lynch -- Analyst\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nAtul Maheswari -- UBS -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nMore RH analysis\n\nAll earnings call transcripts"
}