{
  "companyName": "Seagen Inc.",
  "companyTicker": "SGEN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/seagen-inc-sgen-q3-2022-earnings-call-transcript/",
  "content": "Seagen Inc. (SGEN 0.11%)\nQ3 2022 Earnings Call\nOct 27, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day and welcome to the Seagen third quarter 2022 financial results conference call. [Operator instructions] Please note, today's event is being recorded. I would now like to turn the conference over to Doug Maffei, vice president, investor relations. Please go ahead.\n\nDoug Maffei -- Vice President, Investor Relations\n\nThank you, operator and good afternoon everyone. I am pleased to welcome you to Seagen's third quarter 2022 financial results conference call. This afternoon, we issued a press release with our results. The press release and supporting slides are available on our website in the Investors section, Events & Presentations page.\n\nSpeakers on today's call will be Roger Dansey, interim chief executive officer and chief medical officer; Todd Simpson, chief financial officer; and Chip Romp, executive vice president, commercial U.S. Following our prepared remarks, we will open the line for questions. We aim to keep this call to one hour and ask that you limit yourself to one question to give everyone an opportunity to participate in Q&A during our call today. Today's conference call will include forward-looking statements regarding future or anticipated events and results, including the company's 2022 financial outlook, anticipated product sales, revenues, costs and expenses; potential clinical and regulatory milestones, including data readouts and regulatory submissions, potential marketing approvals and commercial performance.\n\nActual results or developments may differ materially from those projected or implied in these forward-looking statements. Factors that may cause such a difference including the difficulty in forecasting sales, revenues, costs and expenses, impacts related to the COVID-19 pandemic and the uncertainty associated with the pharmaceutical development and regulatory approval process. More information about the risks and uncertainties faced by Seagen is contained under the caption Risk Factors included in the company's quarterly report on Form 10-Q for the quarter ended June 30, 2022 filed with the Securities and Exchange Commission and the company's subsequent reports filed with the SEC. Now, I will turn the call over to Roger.\n\nRoger Dansey -- Chief Medical Officer\n\nThank you, Doug. Good afternoon, everyone and welcome to our third quarter call. This was a quarter where we delivered strong financial results with total quarterly revenue of $510 million, representing growth of 20% compared to the same quarter last year and reflecting robust sales across our approved portfolio. We also made substantial progress on multiple fronts, including clinical, regulatory, research and corporate development.\n\nWe presented pivotal data for PADCEV and TUKYSA and we submitted supplemental regulatory applications to the FDA for PADCEV, TUKYSA and ADCETRIS. We opened a new IND in our early stage pipeline with a product candidate that targets immune cells in the tumor microenvironment and we extended the geographic footprint for TIVDAK with a new commercialization partnership in China and other parts of Asia. Turning to our overall strategy, we are an ADC company at our core as demonstrated by three of our four commercial products and five of our last six INDs and TUKYSA we continue to acquire complementary assets that target tumors through mechanisms different from ADCs. In that vein, we recently licensed an innovative bispecific technology from Nova, which addresses a target not readily amenable to an ADC construct and fits in well with our overall focus on targeted drug development.\n\nBeginning today with PADCEV, our first-in-class ADC for metastatic urothelial cancer together with Astellas and Merck, we presented data from Cohort K of the EV-103 trial at the ESMO meeting in September. As a reminder, this is a study primarily evaluating PADCEV in combination with KEYTRUDA in frontline cisplatin ineligible patients with unresectable, locally advanced or metastatic urothelial cancer. This combination demonstrated a confirmed overall response rate per independent radiographic review of 64.5% with a median duration of response not reached. The combination had a manageable and tolerable safety profile.\n\nThe PADCEV monotherapy arm showed a confirmed overall response rate of 45.2% with a median duration of response of 13.2 months, demonstrating its contribution to the combination. Frontline patients who are not eligible to receive cisplatin have a high unmet medical need, and we are encouraged by these data. We have submitted a supplemental BLA to the FDA to support a potential accelerated approval in the United States in mid-2023. Further development for PADCEV continues, including our EV-302 global phase 3 trial in combination with KEYTRUDA in a broader population of patients, regardless of cisplatin eligibility.\n\nWe expect enrollment to complete before year end and our intention is to use EV-302 as a confirmatory study in the United States and to support submissions around the world. Beyond the frontline metastatic setting, additional studies evaluating PADCEV in muscle invasive and non-muscle invasive bladder cancer are ongoing. Together with Astellas, we are also considering PADCEV's potential in other Nectin-4 expressing solid tumors and look forward to sharing data next year. Moving to TUKYSA, we recently filed a supplemental NDA for patients with previously treated HER2-positive metastatic colorectal cancer.\n\nThe combination of TUKYSA and trastuzumab resulted in a confirmed overall response rate of 38% with a median duration of response of 12.4 months. Based upon the strength of these data, we have been granted Breakthrough Therapy designation, as well as priority review by the FDA with a PDUFA action date of January 19, 2023. As a reminder, our phase 3 trial has been initiated in frontline HER2-positive metastatic colorectal cancer with a goal of serving as a confirmatory trial in the United States and supporting global submissions. We continue to explore TUKYSA further in breast cancer with our partner, Merck.\n\nThis includes HER2CLIMB-02, our phase 3 study of TUKYSA in combination with KADCYLA, which completed the enrollment in June. We anticipate reporting top line data in the first or second quarter of next year. Despite the evolving treatment landscape, KADCYLA remains an important treatment option for patients with HER2-positive metastatic breast cancer. If successful, the combination of TUKYSA plus KADCYLA has the potential to strengthen TUKYSA's position in the second-line setting, particularly in patients with brain metastases and could provide an alternative important option in the third-line setting for those patients who would otherwise have received KADCYLA monotherapy.\n\nNext to highlight our three key updates for ADCETRIS, which is a foundation of care in CD30-expressing lymphomas and is being commercialized outside of the United States and Canada by our partner, Takeda. First, data from the pediatric trial has been filed with FDA with a target action date of November 16, 2022. ADCETRIS plus chemotherapy demonstrated superior event-free survival in the treatment of pediatric patients with previously untreated high-risk classical Hodgkin lymphoma when compared to a chemotherapy regimen that included bleomycin. Second, the statistically significant and clinically meaningful improvement in overall survival demonstrated in ECHELON-1 for ADCETRIS in combination with AVD in patients with advanced Hodgkin lymphoma was recently published in the New England Journal of Medicine.\n\nWe have submitted these data to the FDA for possible inclusion in the label. Last and important to note, the NCCN guidelines have now been updated based on the overall survival data to designate A+AVD as a preferred treatment option for adult stage 3/4 Hodgkin lymphoma patients. Now transitioning to TIVDAK, our fourth approved product and first-in-class tissue factor directed ADC, which we co-develop and co-commercialize with our partner Genmab. We recently announced a regional strategic collaboration and license agreement with Zai Lab that gives them exclusive rights to develop and commercialize TIVDAK in Mainland China, Hong Kong, Macau and Taiwan.\n\nWe partnered with Zai Lab given their expertise and track record of developing and commercializing innovative medicines in the region. The collaboration will support regional patient enrollment for innovaTV 301, our phase 3 study of TIVDAK in patients with recurrent or metastatic cervical cancer. This global study is enrolling well and is intended to serve as the confirmatory trial in the United States and to enable global regulatory applications, including in Asia. Additional clinical development for TIVDAK continues in frontline cervical cancer and other solid tumors, including head and neck cancer.\n\nWe look forward to data readouts in the coming year, which will inform our next steps in these two cancers. The tisotumab vedotin or DV is a late-stage novel HER2-directed ADC that utilizes our vedotin-based technology. Our clinical development program is evaluating monotherapy and combination approaches in a variety of cancers. We recently began enrolling patients into the pivotal phase 2 monotherapy trial in second-line HER2-expressing metastatic urothelial cancer.\n\nWe plan to initiate additional pivotal study in bladder cancer over the next several months while continuing to explore development in other HER2-expressing solid tumors. Turning to our earlier stage pipeline, we are advancing multiple drug candidates in phase 1 clinical trials in a range of solid tumors and hematologic malignancies. Next month at the Annual Society for Immunotherapy of Cancer Conference, we look forward to disclosing initial phase 1 data for SGN-B6A, a vedotin ADC targeting integrin beta-6. This is an antigen, which is highly expressed in a variety of solid tumors, including non-small cell lung, head and neck and esophageal cancer.\n\nIn addition, we will be presenting preclinical data on SGN-BB228, a novel bispecific molecule, which provides a potent co-stimulatory bridge between tumor-specific T-cells and CD228 expressing tumor cells. We look forward to initiating a phase 1 trial for SGN-BB228 in the coming months. In September, we announced an exclusive worldwide license to develop and commercialize LAVA-1223, a bispecific T-cell engager targeting gamma delta T-cells in the presence of EGFR-expressing solid tumors. We find the science compelling and look forward to advancing LAVA-1223 into the clinic in the near-term.\n\nNext, I will turn the call over to Todd, who will discuss our financial results and provide updated guidance then Chip will provide an update on our commercial performance before we turn to Q&A. Todd?\n\nTodd Simpson -- Chief Financial Officer\n\nThank you, Roger and thanks to everyone for joining us on the call. Our financial results continued to reflect significant advancements made across the business. Today, I will briefly summarize our financial results and then discuss several updates to our outlook for the full year. To begin, all components of revenue showed increases in the quarter and for the year-to-date over 2021.\n\nThis reflects strong commercial execution across our products, continued performance by our partners as well as new collaborations. With that, total revenues were $510 million in the third quarter of 2022 and $1.4 billion for the year-to-date, representing year-over-year growth of 20% and 25%, respectively. Net product sales increased to $428 million in the third quarter of 2022 and $1.2 billion for the year-to-date, representing year-over-year growth of 17% and 22% respectively. Royalty revenues were $44 million in the third quarter of 2022 and $111 million for the year-to-date.\n\nRoyalty revenues for the third quarter increased by 7% over the prior year, driven by strong commercial performance by our partners, most notably Takeda with the sales of ADCETRIS partially offset by foreign currency headwinds associated with the strong U.S. dollar. Collaboration revenues were $38 million in the third quarter of 2022 and $80 million for the year-to-date. These reflect royalties on sales of PADCEV by Astellas in its territory as well as other collaboration activities, including an upfront license fee of $30 million from our new deal with Zai Lab signed in the quarter.\n\nCost of sales, were $108 million in the third quarter of 2022 and $302 million for the year-to-date. This included cost of product sales and royalties for each of our four brands, profit share amounts owed to our collaboration partners, Astellas and Genmab, as well as non-cash amortization of acquired technology costs for TUKYSA. R&D expenses were $385 million in the third quarter of 2022 and $987 million for the year-to-date. These reflect continued investment to expand the potential of our approved products and to advance our product pipeline.\n\nThird quarter results also reflected a $50 million upfront fee to Lava Therapeutics. SG&A expenses were $210 million in the third quarter of 2022 and $605 million for the year-to-date. This was driven by ongoing commercialization efforts, legal costs related to Daiichi Sankyo and other corporate activities. Regarding our financial outlook for the full year, we are increasing our guidance for ADCETRIS sales to a range of $805 million to $820 million.\n\nWe are narrowing our guidance for PADCEV sales to a range of $435 million to $445 million and we are increasing our guidance for TUKYSA sales to a range of $340 million to $350 million. Chip will provide further context on market dynamics related to each of our brands in a moment. We are adjusting our guidance for royalty revenues to a range of $155 million to $160 million, reflecting foreign currency headwinds and we are increasing our collaboration revenue guidance to a range of $85 million to $90 million. Moving to expenses, we are increasing our R&D expense guidance to a range of $1.3 billion to $1.35 billion, primarily related to the upfront fee under the Lava deal in Q3.\n\nAnd we are tightening our SG&A expense guidance to a range of $800 million to $850 million. Our other guidance remains unchanged. Looking forward, we plan to provide 2023 financial guidance on our next quarterly call. As we exit 2022, we have four transformative drugs that are well established within their current indications.\n\nWe have a number of ongoing trials, several with registrational intent that are intended to support label expansions for each of our approved brands. We also have two pending FDA regulatory submissions intended to support new indications during 2023. The most significant of these is Cohort K for PADCEV. However, this will not be included in our initial guidance due to the anticipated time of a potential label approval.\n\nThese factors will be taken into consideration in our initial 2023 guide. With that, I will turn the call over to Chip for an overview of our commercial performance.\n\nChip Romp -- Executive Vice President, Commercial U.S.\n\nThank you, Todd. Performance across the portfolio this quarter was strong and reflects continued commercial execution for our best-in-class or first-in-class product portfolio. PADCEV third quarter sales were $105 million, an 11% increase over the third quarter of 2021. There were no clinical trial supply orders in the third quarter of this year compared to $7 million in the same quarter a year ago.\n\nExcluding clinical trial supply orders, year-over-year growth for the quarter was 20%. Underlying growth was primarily driven by continued use of checkpoint inhibitors as frontline maintenance therapy, a dynamic that has helped PADCEV becoming a U.S. standard of care in the second-line setting post-platinum, post-CPI. Checkpoint inhibitors have been used in the maintenance setting for over two years and uptake has flattened, which is limiting PADCEV's near-term growth in its current indications.\n\nMeanwhile, we are looking forward to a potential label in the frontline setting in the U.S. and we are encouraged by the positive reaction to the EV-103 Cohort K results presented at ESMO in September. Our commercial teams are preparing for a potential launch in mid-2023. As a reminder, there are approximately 20,000 total addressable patients in the frontline metastatic setting in the U.S.\n\nwith around 80% of these being drug-treated; 40% to 50% of these are ineligible for cisplatinum-based chemotherapy. If approved, the PADCEV regimen will represent an important treatment option for these patients. Moving on to TUKYSA, third quarter sales were $88 million. TUKYSA performed well in the quarter despite competitive headwinds related to HER2's recent approvals and increased use in the second line plus setting, which is expected to continue into 2023.\n\nTUKYSA's performance is benefiting from extended treatment duration in approximately a third of patients, which we believe underscores its efficacy and tolerability. We have established TUKYSA's market position as a valuable treatment option for patients in the second line plus setting, especially for those with CNS involvement. Our TUKYSA commercial teams are ready for a potential launch into the second line plus setting in patients with HER2-positive metastatic colorectal cancer. Although a modestly sized market, the population represents a high unmet need as existing approved colorectal cancer therapies typically offer limited response rates.\n\nLooking beyond the U.S., in the third quarter, we successfully concluded the TUKYSA pricing negotiations in Germany and Canada, adding to our success in the UK, and we look forward to potentially further expanding access across the rest of Europe in the coming months. Merck is progressing regulatory submissions and reimbursement activities intended to expand TUKYSA's reach in their territories and have recently received approval in Israel and Argentina. ADCETRIS third quarter sales were a record $219 million, an 18% increase over the third quarter of 2021. Growth was driven by a return toward pre-COVID diagnosis rates, as well as price and incremental share gains in frontline Hodgkin lymphoma.\n\nThe latter of which has benefited from the unprecedented overall survival data from the ECHELON-1 trial announced earlier this year. We are pleased to see the strength of the OS data result in an elevated Category 1 preferred recommendation in the NCCN guidelines and we are working to ensure broad awareness of this positive update. And finally, TIVDAK sales were $16 million for the third quarter. The Seagen and Genmab commercial teams are focused on ensuring early treatment experiences with TIVDAK are positive with best practices being shared between clinics.\n\nWe continue to promote this important treatment option for patients with such high unmet need. With that, I'll pass the call back to Roger.\n\nRoger Dansey -- Chief Medical Officer\n\nThank you, Chip. As discussed today, we continue to make solid progress across the business. Looking forward, we plan to provide multiple data readouts in the coming year for TUKYSA, PADCEV, ADCETRIS, TIVDAK and pipeline candidates, such as SGN-B6A and SGN-B7H4V. Seagen is in a position of strength to continue advancing our mission of delivering cutting-edge innovation that positively impacts the lives of people with cancer.\n\nNow we will open for your questions. Operator, please open the line for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Today's first question comes from Michael Schmidt at Guggenheim. Please go ahead.\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nHey, guys. Thanks for taking my questions, and congrats on the quarter. I had a question around TUKYSA market dynamics. The drug obviously has performed better than initially anticipated.\n\nCan you comment a bit more on how you think about the competitive dynamics with an HER2 in breast cancer longer term and how we should think about the incremental growth opportunity should HER2 succeed next year?\n\nRoger Dansey -- Chief Medical Officer\n\nHey, Michael. It's Roger here. Thanks for the congrats on the quarter and it's an important question. And perhaps I could ask Chip to make some comments on the commercial dynamics.\n\nChip Romp -- Executive Vice President, Commercial U.S.\n\nSure, Roger. As we've discussed in previous calls, in HER2 has gained market share in the second line setting, for HER2-positive metastatic breast cancer patients. This has impacted the patient flow into the third line and later lines of therapy. We continue to anticipate this shift is going to grow.\n\nAnd HER2 will be sequenced in the second line in front of TUKYSA with increased use in the second line based on our label and approval. This is going to result again in delayed patient flow into the third line. TUKYSA has established itself as an important option for treatment in the second-line setting with patients with brain mets. And we expect to continue to hold there and have a foothold as it's been valued by physicians.\n\nRoger Dansey -- Chief Medical Officer\n\nJust to add some more comments on that, Chip. From a -- our initial evaluation of what the impact of HER2 could have on TUKYSA and our sort of timing of when that impact would occur was based in the earlier part of the year on an expectation that in HER2 would move quite quickly. And that did not actually happen. It took some time for to gain momentum.\n\nBut that competitive headwind that Chip described, I think we believe will exist into 2023. And it may be through to the sort of second half of '23 when we see things start to stabilize.\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nAnd then what about HER2CLIMB-02, you said we could see data in the first half of next year. How impactful would that potential extension be if successful?\n\nRoger Dansey -- Chief Medical Officer\n\nYeah, that's a great question. Thank you. Perhaps I'll make some comments and then Chip again, if you could complete on the commercial color. Yeah, we're excited by the combination of TUKYSA with KADCYLA.\n\nKADCYLA is an important drug. It has a place for use in HER2 metastatic breast cancer. And as you know, patients cycle through therapies. Fortunately, they live very good long time and have the opportunity to switch therapies.\n\nJust to remind you, HER2CLIMB-02 has the same design elements of searching client. So it includes a population of brain metastases and includes in that population, patients who will have active brain metastases. And so that is an important component of that trial. So from a -- if the trial is successful and the profile of the combination is compelling both from a general perspective and also in the brain mets population, we see TUKYSA increasing its use in that combination with KADCYLA.\n\nChip, do you want to add some comments?\n\nChip Romp -- Executive Vice President, Commercial U.S.\n\nYeah. I think there may be two meaningful outcomes from a commercial standpoint. The first is, I think we can potentially expect to see increased utilization in patients in the third line regardless of brain metastasis. And the second piece of that is it really puts us in a partnership position rather than a competitive position with KADCYLA.\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nOK, thank you.\n\nOperator\n\nThank you. And our next question today comes from Andrew Berens of SVB Securities. Please go ahead.\n\nAndrew Berens -- SVB Securities -- Analyst\n\nHi, thanks for taking my questions, and congrats on the progress, guys. A couple. I was wondering if you could give some color on the PADCEV duration of treatment that was in cohort K. I know you reported the treatment duration for the cocktail, but it's my understanding that patients could have dropped off of one of the agents and still be considered on treatment.\n\nAnd then what are your thoughts on the possibility that the FDA may want to see the randomized data for PADCEV and KEYTRUDA to better understand how a cocktail should be used in just ineligible patients that have the option to get carboplatinum plus maintenance checkpoint inhibitor?\n\nRoger Dansey -- Chief Medical Officer\n\nYeah. Andy, thanks for the question. With regard to duration of therapy, you're right, we have only disclosed the -- at what point is treatment discontinued for one or other components of the combination. And that sits at an average of around about 10 cycles of therapy.\n\nI think it was nine cycles of therapy with Cohort A, which is the same essential population and then 10 cycles of therapy with Cohort K, and that's a median duration. We have not gotten into the details of how much of which particular drug is being used. I will just remind you that for this combination, as well as for the individual drugs, the major driver for discontinuation is progressive disease and progressive disease generally triggers both drugs to be stopped and that in the main drug like PADCEV do not have a major sort of adverse event burden that necessarily stops they use. The most common one being peripheral neuropathy, and that's generally in the sort of single-digit range.\n\nWith regard to what the agency may view, we think we have a strong package. There is a high unmet need in patients who are cisplatin eligible. The data that we've presented based on the regulatory framework, which is overall response rate and duration of response is substantially better than what you can expect with the carboplatin-based regimen. From an evidentiary perspective, we've run -- we've done this experiment twice.\n\nWe've had Cohort A and Cohort K. Those results have been remarkably close to each other. So we're confident that this combination will reproducibly result in the types of results that we've seen with Cohort K. In -- from the point of view of the agency, we can't speak on their behalf.\n\nIn the end, it is an FDA call as to whether they see this as being appropriate to take regulatory action. But I can say, we are confident in our position. And it's important to note in sort of partly in relation to your question, because confirmatory trials are part of the conversation right now that we are in a very favorable position. So, EV-302, which is obviously a much larger trial, which has populations that include both cisplatin ineligible and cisplatin eligible with a sample size in the 900 range and including endpoints such as PFS and OS as the dual primary endpoints, but other endpoints such as ORR are also included.\n\nEnrollment is expected to finish this year. It is an event-driven trial. And so obviously, we will turn our focus from completing enrollment is starting to map out when these events will occur. But it's important to note that that confirmatory trial is very, very well advanced.\n\nAnd I think that's an important part of our arguments around looking for accelerated approval based off a single-arm study, which is Cohort K.\n\nAndrew Berens -- SVB Securities -- Analyst\n\nOK. Thanks, Roger. Just if I could squeeze a quick one in on BV, I didn't hear you mention breast cancer and that with that molecule, I might have missed it. But is it still a priority for this drug? And do you think it could have a meaningful [Inaudible] effect like in HER2?\n\nRoger Dansey -- Chief Medical Officer\n\nIt absolutely is a priority. And so focusing -- we are very interested in HER2 -- the HER2 low breast cancer population. We have not disclosed any details, but I think from an internal working perspective, we are looking hard at that as a possible opportunity. And as you know, one of the important features of a vedotin payload and we strongly believe this and cohort K actually supports this argument is that combining vedotin, together with a PD-1 inhibitor does have an added advantage over the combination of two active agents.\n\nAnd so utilizing or leveraging that potential value in the combination strategy is something that we're thinking about, not only for breast cancer, more broadly, obviously, in other tumors, but it may be relevant in that space as well. And obviously, from our perspective, generating data is an important first step in understanding what our opportunities are. But I think just stay tuned. We're focused on breast cancer.\n\nWe just have not brought the specifics forward here.\n\nAndrew Berens -- SVB Securities -- Analyst\n\nOK. Thanks a lot and congrats on the progress.\n\nRoger Dansey -- Chief Medical Officer\n\nThanks, Andy.\n\nOperator\n\nThank you. And our next question comes from Salveen Richter with Goldman Sachs. Please go ahead.\n\nTammy Kiely -- Goldman Sachs -- Analyst\n\nHi, thanks for taking our question. This is Tammy on for Salveen. Can you provide an update on the CEO search and provide a framework that you're using in finding someone? Thank you.\n\nRoger Dansey -- Chief Medical Officer\n\nSure. Thanks for the question. Yes, I'm happy to report that the board is making good progress. Obviously, the characteristics of the company, we are a multi-drug global oncology company.\n\nSo anyone who comes in to lead the company will need the skill sets to do that. We have confidence that the board will identify and will name a strong new CEO. I don't have a time frame for you. Obviously, it's an important deliverable, and it is something that the board is actively pursuing.\n\nBut again, timing is something that I can't share. What I can say, though, is the focus of the management team, myself included during this interim period is to move the ball forward. And we think we're comfortable that we've been successful at doing that. I think as evidenced by the progress that we've shown over the last two quarters.\n\nTammy Kiely -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question today comes from Matthew Harris at Morgan Stanley. Please go ahead.\n\nJeff Hung -- Morgan Stanley -- Analyst\n\nHi, thanks for taking our question. So this is Jeff Hung for Matthew. So I just want to confirm maybe some base. So I think in earlier call, you mentioned that you may present some of the readout on the basket studies for both TUKYSA and PADCEV.\n\nSo I'm just wondering what kind of -- I just want to first confirm that those you're going to present like some data for both TUKYSA and PADCEV from those basket studies. And also I'm wondering whether you can provide more color on any particular indications you are most interested in for those two drugs? Thanks.\n\nRoger Dansey -- Chief Medical Officer\n\nThanks for the question. So just a minor correction. The basket trial data we're talking about is with PADCEV, you are right. And there are multiple tumors that are nectin-4 expressing.\n\nAnd we haven't shared the data. We have some top line data available, and as I indicated in the prepared remarks, we will present that data in '23. The other basket trial, I think we're talking about or a focus of another molecule not so much TUKYSA, it's actually TIVDAK. And hopefully, that's what you were thinking.\n\nAnd for TIVDAK, as you know, as with many of these ADCs, there are multiple possible shots on goal from a tumor perspective. We're obviously excited with the cervical cancer opportunity. We're looking potentially to take TIVDAK into frontline cervical cancer, and we presented our logic and our thinking behind that and building the blocks for the regimen to understand whether we have something competitive that would include TIVDAK. And then the other tumor, which is coming into focus is head and neck cancer.\n\nWe have presented some data initially, and we plan to share some more data with head and neck cancer patients with our partners, Genmab, sometime in '23. But I can't be more specific on that, but that's the plan.\n\nJeff Hung -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from Jessica Fye with J.P. Morgan. Please go ahead.\n\nUnknown speaker\n\nHi, this is [Inaudible] for Jess. Thank you for taking our questions. So we have a couple on PADCEV and a couple on TUKYSA probably. So on PADCEV regarding the first lines ineligible setting, just wanted to confirm, do you expect priority review with the filing that you submitted? And then do you expect any off-label use in the eligible population following the potential approval in the first line is ineligible probably next year, for example, could physicians attend to label the patient -- the eligible patients as is ineligible in order to give them access to PADCEV? And then on the other hand, questions on TUKYSA.\n\nSo just wondering kind of your latest thinking on the evolution of the treatment landscape with in HER2 penetrating in the earlier line setting? So do you believe TUKYSA would probably most be used after in HER2 from now and in the future? And if so, what's the time frame that we should think about, like in HER2 penetrate into the second line and how long it would take for the patient to sequence through HER2 and probably become more eligible in the lack of better world to TUKYSA. And lastly, is there any insight you could share with us regarding the proportion of TUKYSA patients with or without brain mets? Or in another way, do you have a split between patients with brain mets and patients without brain mets you have treated with TUKYSA so far. Thank you very much.\n\nRoger Dansey -- Chief Medical Officer\n\nThank you for the many questions. I hope we can get to answer them all. And I apologize if we missed you can remind us. So, with regard to the sort of details around our regulatory approach for PADCEV and KEYTRUDA in that frontline cisplatin eligible population, I think we've shared we have submitted an application.\n\nWe don't share details exactly what our requests are to the agency. But just in general, it is relatively correct to say that accelerated approvals are often reviewed under priority review schedule. That is just like a testament effect. With regard to off-label use, perhaps, Chip, would you like to comment a little bit on that for PADCEV and then we will move on to TUKYSA?\n\nChip Romp -- Executive Vice President, Commercial U.S.\n\nYeah. What I would say is that physicians can choose to prescribe the product in ways that they see best fit. We don't actively promote anything that is not in our label. Moving forward, we are looking forward to the potential of having an additional label in PADCEV and the teams are ready for when that happens.\n\nRoger Dansey -- Chief Medical Officer\n\nGreat. And then with regard to TUKYSA, you did have quite a few questions in there. I think maybe what we can do is just sort of reposition TUKYSA for you in general. To remind you, we have, in the pivotal trial HER2CLIMB outstanding results.\n\nIn a population, HER2 not studied, including patients with brain metastases, including in that group patients with active brain metastases. And we improved overall survival. So the value that TUKYSA brings to patients with HER2-positive late-line metastatic breast cancer is really remarkable and extremely valuable for individual patients. With regard to the sort of competitive dynamics from a -- because we have such a strong argument about brain metastases, and as I said earlier, because the KADCYLA and TUKYSA combination is essentially the same design and the same eligibility criteria as we had with HER2CLIMB, we would expect a meaningful number of patients in that trial to have brain metastases.\n\nI'm not going to disclose the actual number, but we expect that to be meaningful. With regard to dynamics and choices that physicians make as to how their sequence therapies, I think that often comes down to the individual patients and their requirements. We certainly don't see and Chip can support me in this. We don't see any switches away from TUKYSA, what we're seeing sort of competitively as patients perhaps more likely to start on HER2 versus TUKYSA.\n\nChip, do you want to comment a little bit about the mix of TUKYSA versus in HER2?\n\nChip Romp -- Executive Vice President, Commercial U.S.\n\nYeah. I think we're continuing to see strong utilization in second-line patients with active CNS involvement. TUKYSA become an important and established treatment for those patients. It is well tolerated, as I mentioned in the opening remarks, we've seen about third of patients stay on extended therapy for a time.\n\nAnd I think this has helped to support TUKYSA and the revenue it's generating in a dynamic and changing and evolving breast cancer marketplace.\n\nRoger Dansey -- Chief Medical Officer\n\nRight. And again, just on the [Inaudible] perspective, I think your last question was around what is the proportion of patients with brain metastases. What is true is the more successful therapies are in HER2 metastatic breast cancer, the more likely are that brain metastases develop. It's sort of like a century site, which can actually -- and surprisingly patients relatively early on may have brain metastases.\n\nSo, we will see when we see in the results from HER2CLIMB-02 exactly what that proportion looks like. But it's certainly enrolling in the trial. We enrolled in the trial.\n\nOperator\n\nThank you. And ladies and gentlemen, our next question will come from Geoff Meacham of Bank of America. Please go ahead.\n\nUnknown speaker\n\nGood afternoon. So, this is Hao calling in for Geoff Meacham and thank you for the question. So, congrats on the quarter. My question is regarding ADCETRIS and great performance for the quarter.\n\nSo, it's really two parts. So, you mentioned about normalizing back notes rate. I am just wondering, do you see it coming back to the pre-COVID level is maybe still slightly a lag compared to pre-COVID level? And then the second part is the incremental share gains. I guess the long-term OS data was really providing that momentum.\n\nSo, do you see that incremental share gain sort of continue into the 2023 timeframe, or maybe we see the market dynamic to suggest that maybe flatten a little bit moving forward?\n\nRoger Dansey -- Chief Medical Officer\n\nYeah. Thanks for the question. We are very proud of ADCETRIS. We've -- this is a relatively mature brand by age, it's 10 years plus.\n\nIt continues to grow, which is remarkable. I believe the last two quarters have sort of been record-breaking quarters for ADCETRIS. And obviously, the factors that you mentioned, things like changes in epidemiology and such do play a role, as incrementally new data, impactful data, we will do that. And so we are very pleased with ADCETRIS and its progress.\n\nAnd Chip, do you want to speak a little bit more about what our sort of thinking is going forward with regards to shifts in epi and such?\n\nChip Romp -- Executive Vice President, Commercial U.S.\n\nYeah. Thank you, Roger, and thanks for the question. So, we have seen a normalization of epi back to relatively close to pre-pandemic. We saw a dip in the first quarter of this year in newly diagnosed HL patients.\n\nIn addition to that, the frontline OS data results have been very well received. We are pleased with the elevated category one preferred recommendation that we have in the NCCN now. And we do think there is continued incremental growth for us in frontline.\n\nUnknown speaker\n\nAwesome. Great. Thank you.\n\nOperator\n\nAnd our next question today comes from Gena Wang with Barclays. Please go ahead.\n\nSheldon Chuan -- Barclays -- Analyst\n\nHi. This is Sheldon on for Gena. Thanks for taking our question and congrats on the quarter. So, maybe one quick question on ADCETRIS and another one on PADCEV.\n\nFor ADCETRIS and KEYTRUDA combo trial, is it still on track to report initial data in late 2022? And it seems like the trial is focused on non-small cell lung cancer and melanoma patients after progressing on PD-1. So, what would be your benchmark to determine whether to move forward with this indication? For PADCEV, have you got any feedback from POLs -- FDA -- PADCEV is approved with the cohort K data under accelerated approval, how would you say what the expected uptake relative to after the confirmatory 302 data? Thanks.\n\nRoger Dansey -- Chief Medical Officer\n\nYup. Thanks for those two questions. I will take the ADCETRIS plus KEYTRUDA in solid tumors questions. Chip, if you want to address the PADCEV question.\n\nSo firstly, there is a strong scientific argument for why we are combining ADCETRIS in a population of PD-1 failed patients. In that we focused the trial on melanoma and non-small cell lung cancer. And the reason for that is not that ADCETRIS has any activity that we believe that will be meaningful against the solid tumor, even if it necessarily express CD30, but much more importantly because it turns out that ADCETRIS has the potential to be an immunomodulator. And we have very good preclinical evidence demonstrating that a population of T regulatory cells.\n\nSo, these are the cells that basically inhibit the immune system from doing its work. Particularly, when they express CD30 where they are activated. So, it's an activated population of T regs that ADCETRIS can remove that population and removing a T regulatory cell population from the tumor microenvironment in a situation where there has been progression or lack of response potentially. But progression on something like a PD-1 inhibitor, we think is a very important scientific concept to answer.\n\nWe did indicate that we were hoping to get data out in 2022. It's more likely that that information that we will share data in 2023. Again, no specific timeframe, but the science is compelling, and we are conducting the clinical experiments. And when we have the data at the level of maturity and completeness that we can share, we will go ahead and do that.\n\nChip on the PADCEV side?\n\nChip Romp -- Executive Vice President, Commercial U.S.\n\nYeah. Thanks, Roger. So, first on the commercial end, we don't have a label yet. So, we will have some additional insights once we understand the parameters of the label.\n\nI will say that the KOL interactions at ESMO this year were very positive. The data was viewed as favorable and an important advancement for patients in the frontline setting.\n\nRoger Dansey -- Chief Medical Officer\n\nRight. And it is -- just to add to that, it's important to note that both PADCEV and KEYTRUDA are approved actually in urothelial cancer. So, the drugs themselves are not -- in terms of their use are not problematic for urologic oncologists to use. And so it's not -- if we are successful with this application, it will be with two approved drugs in a combination.\n\nAnd bear in mind that to-date, anyway, successful combinations with PD-1 inhibitors that are clearly active in urothelial cancer have not led to approvals. And this is really the -- from the point of view of changing the therapeutic landscape and bringing potentially meaningful interventions to these patients particularly cisplatin in elderly patients who are often older and frail. We are really compelled by a high response rate and a duration of response that was not reached. I mean that is a remarkable outcome.\n\nAnd we think that that makes the value proposition on this combination in this vulnerable population, very strong.\n\nSheldon Chuan -- Barclays -- Analyst\n\nThank you so much.\n\nOperator\n\nAnd our next question today comes from Jay Olson at Oppenheimer. Please go ahead.\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nHey, congrats on the quarter and thank you for taking the question. We are curious about the target product profile for disitamab-vedotin and how it compares to in HER2? Can you just talk about some of the key points of differentiation and also comment on the potential to combine DV with TUKYSA? Thank you.\n\nRoger Dansey -- Chief Medical Officer\n\nYeah, that's a great question. Thank you and thanks for the congratulations. So, just some comments on disitamab-vedotin. Obviously, the payload, we know well, it's vedotin.\n\nThe antibody, which was selected by our partners at RemeGen, we believe is optimized for an ADC construct. It has high internalization rate, which we think is important. And obviously, it bones to the HER2 target. So, the actual -- the drug construct, we think is a very good one.\n\nFrom a -– as I mentioned earlier, with regard to differentiation, the second piece of that is PD-1 inhibitors or PD-L1 inhibitors are part of the general landscape of oncology. And in -- certainly from multiple points of the compass, we have been able to show that a reductant based ADC pairs very well with a PD-1 inhibitor. And so that's something that we need to work on further, but data that's been presented so far in urothelial cancer, metastatic urothelial cancer is very compelling using the combination of the disitamab-vedotin together with a PD-1 inhibitor. So, I mean we are excited by this compound.\n\nOur first efforts are in urothelial cancer where there is a meaningful amount of HER2 positivity or expression. We are interested in the sort of traditional HER2 either over-expressed or amplified. But we also, as is appropriate for an antibody drug conjugate, we are looking at lower levels of HER2 expression as well because potentially, we will see value there. And there has been some initial data which is encouraging in that regard.\n\nAnd our focus is on bladder, and we are interested in moving ahead in breast cancer and potentially other cancers. And your point about TUKYSA is extremely well taken, which is we basically have two assets that are in the same area. We are working on what is appropriate to do from a clinical perspective, looking at that combination, including some novel aspects, such as the impact of TUKYSA on the expression of HER2 on the surface and whether that's something that we can potentially leverage. So, I think just stay tuned.\n\nWe don't have plans that we can share with you in detail, but we are very interested in exploring what value could we potentially bring forward with our two assets.\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nThank you very much.\n\nOperator\n\nAnd our next question today comes from Gregory Renza of RBC Capital Markets. Please go ahead.\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nHey, good afternoon, Roger and team, let me add my congratulations on the quarter as well and thanks for taking my question. Roger, my question primarily centers around the Inflation Reduction Act. I just wanted to give you an opportunity to comment on the Seagen commercial portfolio as well as the pipeline. I think namely, how is your view on the pipeline prioritization, as well as your external pursuits for other assets being influenced by the IRA considerations? And then even maybe more appropriate for Chip as well.\n\nHow should we think about longer term and any impacts of IRA with respect to ADCETRIS and the other commercial products? Thank you very much.\n\nRoger Dansey -- Chief Medical Officer\n\nYeah. Thanks for the question. And obviously, the law is now passed. I think at the sort of highest level, we together with others in the industry see this as a negative event for innovation.\n\nIt has the potential to stifle innovation and some unintended consequences of the legislation, which I think you are addressing around how do we prioritize our development programs in order to optimize the value that a drug can bring and within the confines of the act. I would say we have some very simple answers for the three main components just so you can understand how we are thinking inside Seagen. I would remind you also, we are essentially a large molecule company, which may be somewhat more favorable in that environment. But at that sort of real macro level, oncology is -- and rightfully so has this mechanism or as utilizes the mechanism of accelerated approval to get drugs to people that are making a difference and that have the highest unmet need.\n\nHowever, they are often at the end of therapies. And so the addressable population is relatively small. And certainly, in my experience, oncology drugs are developed with that first step into late line therapy, bringing value and then there is momentum built, and you can see it in the PADCEV program is exactly how we would think how to develop a drug logically in oncology. And that may need to change that the lead indication potentially being very small and limited may not be the best way for us to develop drugs going forward.\n\nSo, that's certainly in our thinking. Maybe, Todd, would you like to comment a little bit about the specifics of the act?\n\nTodd Simpson -- Chief Financial Officer\n\nSure. Happy to. I think Roger gave a really nice sort of overview of how the industry is thinking about it. I think when we look at it, and bear in mind, there are a lot of elements to this that are still being defined.\n\nBut I think specifically as it relates to us, there is the inflation cap, there is the Part D redesign and there is price negotiations. I think with respect to the inflation cap, this is actually something that we are dealing with now and have for a while. Our goal will be to include at least our thinking at the time as best we can into the '23 guide that we will put out in February of next year. With respect to the Part D benefit redesign, we think this is an element that would affect Kaiser more so than the other brands.\n\nThere, I think there are a lot of dynamics that need to be played out. And frankly, it's more rulemaking that needs to play out. But we don't think that that will affect us prior to kind of the 2025 timeframe. And then on price negotiations, we have also looked at this and don't feel that the portfolio.\n\nAgain, this is the biologics would be affected by this prior to sort of the 2030 timeframe. So, obviously, a lot of this is in a state of flux. The law was enacted mid-August. And again, there continues to be a lot of sort of work to understand it, frankly, and clarify it.\n\nAnd we are, by all means, tracking on it.\n\nRoger Dansey -- Chief Medical Officer\n\nAnd just to reiterate, I think from a development perspective, we are thinking very carefully about what would a new drug profile need to look like in the context, in the framework what we think this act will end up creating from a sort of landscape and potential value perspective.\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nThat's great. Thanks for all the color guys.\n\nOperator\n\nAnd our next question today comes from Andy Hsieh with William Blair. Please go ahead.\n\nAndy Hsieh -- William Blair and Company -- Analyst\n\nGreat. Thanks for squeezing me in. I have two questions. One is related to innovaTV 205 Cohort H, that's the triplet plus or minus Avastin in solid tumors.\n\nJust curious about how you think about the design? Should we think about this kind of like analysis to Cohort K, which can be changed to a randomized portion and potentially be open to an accelerated approval pathway. My second question has to do with the bladder cancer strategy, specifically in the HER2-positive population. Obviously, PADCEV has shown exceptional activity there. Just curious, if we know the activity of PADCEV in the HER2-positive population as you plan to add PADCEV in that setting and that's kind of motivated by the fact that sometimes PADCEV has shown activity outside of just Nectin-4 expressing tumors, even FGFR genetic alteration that's shown really, really good activity? Thank you.\n\nRoger Dansey -- Chief Medical Officer\n\nYeah. Andy, thanks for the question. With regard to innovaTV 205, the focus in that triplet and quadruplets cohort is to really to define what a profile would look like for a frontline cervical cancer study. I don't think it's in our thinking right now that if you were to head to the front line that -- and I accept the analogy with PADCEV.\n\nBut I think the cervical cancer landscape is a little bit more complex for example, KEYTRUDA is in it. I wouldn't discount the possibility, but I think we are still trying to determine whether we have a competitive regimen. Once we have determined that we will define if that's what we choose to do to move ahead, we will define exactly how we are going to get there. At first blush, it feels like this would be a randomized trial, but it's -- we are not there yet.\n\nWith regard to -- it's a good question around urothelial cancer. The data that's been generated with DV in urothelial cancer, particularly in the high expressing HER2 is very compelling. The response rate as a single agent in the 60% range. And bear in mind, a HER2-directed ADC is not the same as a Nectin-4 directed ADC.\n\nThey may have the same payloads. But the potential for a differentiated profile based on a biomarker-defined population, together with whatever the benefit risk looks like, the efficacy and the safety and tolerability put together, we think it's appropriate to move another option in urothelial cancer with disitamab-vedotin forward. I hope that answers your question. I may have missed part of another question, if I have, please just repeat it.\n\nAndy Hsieh -- William Blair and Company -- Analyst\n\nNo. Thanks Roger and that's a very comprehensive answer. Thank you so much.\n\nOperator\n\nAnd ladies and gentlemen, this concludes our question-and-answer session. I would like to turn the conference back over to Doug Maffei for closing remarks.\n\nDoug Maffei -- Vice President, Investor Relations\n\nThank you, operator and thanks everybody for participating in our call this afternoon. Have a great rest of your day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDoug Maffei -- Vice President, Investor Relations\n\nRoger Dansey -- Chief Medical Officer\n\nTodd Simpson -- Chief Financial Officer\n\nChip Romp -- Executive Vice President, Commercial U.S.\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nAndrew Berens -- SVB Securities -- Analyst\n\nTammy Kiely -- Goldman Sachs -- Analyst\n\nJeff Hung -- Morgan Stanley -- Analyst\n\nUnknown speaker\n\nSheldon Chuan -- Barclays -- Analyst\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nGregory Renza -- RBC Capital Markets -- Analyst\n\nAndy Hsieh -- William Blair and Company -- Analyst\n\nMore SGEN analysis\n\nAll earnings call transcripts"
}