{
  "companyName": "Bumble Inc.",
  "companyTicker": "BMBL",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/bumble-inc-bmbl-q2-2022-earnings-call-transcript/",
  "content": "Bumble Inc. (BMBL 1.35%)\nQ2 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Bumble second quarter 2020 financial results conference call. At this time, all participants are in listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Cherryl Valenzuela, vice president of investor relations. Please go ahead.\n\nCherryl Valenzuela -- Vice President, Investor Relations\n\nGood afternoon, and thank you for joining us to discuss Bumble's second-quarter financial results. With me today are Whitney Wolfe Herd, founder and CEO; Tariq Shaukat, president; and Anu Subramanian, CFO of Bumble. Before we begin, I'd like to remind everyone that certain statements made on this call today are forward-looking statements. These forward-looking statements are subject to various risks and uncertainties and reflect our current expectations based on our beliefs, assumptions, and information currently available to us.\n\nAlthough we believe these expectations are reasonable, we undertake no obligation to revise any statements to reflect changes that occur after this call. Descriptions of these factors and other risks that could cause actual results to differ materially from these forward-looking statements are discussed in more detail in our earnings press release and filings with the SEC, including our annual report on Form 10-K for the year ended December 31, 2021, and our subsequent periodic filings. During the call, we also refer to certain non-GAAP financial measures. These non-GAAP measures should be considered in reconciliation to and not as a substitute for or in isolation from our GAAP results.\n\nReconciliations to the most comparable GAAP measures are available in today's earnings press release, which is available on the Investor Relations section of our website at ir.bumble.com. And with that, I'll turn it over to Whitney.\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nThanks, Cherryl. Good afternoon, and thank you all for taking the time to join our call today. We delivered strong second-quarter results, reflecting the power of our product, the relevance of our mission, and the enduring human need for love and connection. We built on our momentum from last quarter into Q2, delivering total group revenue of $220 million, driven by strong growth in Bumble app revenue.\n\nTotal paying users across Bumble and Badoo apps reached over 3 million, with Bumble app adding over 149,000 paying users sequentially, a greater increase than in each of the past two quarters. We also reported adjusted EBITDA of $55 billion and nearly doubled free cash flow from last year, a strong bottom-line result, reflecting both revenue growth and continued financial discipline. Bumble apps continue to power our overall growth with revenue up 33% year over year to $170 million, primarily driven by a 31% increase in paying users. Before we dive deeper, I wanted to provide some more context around the resilience we have seen so far within Bumble App.\n\nI founded bumble to make relationships better, safer, and more equal for women. That remains our North Star, and it's as important now as at any time in our history because of the unprecedented challenges women are facing. We are grateful to be in the consumer business that helps people with one of their most fundamental needs, building kind, and meaningful connections. That need exists, whether you are in a pandemic or in a high-inflation and recessionary environment.\n\nWe believe Bumble App's unique brand and trust with our users, especially women, combined with our leadership and product innovation, is what's driving our success in the face of overlapping macro challenges. Our app provides tremendous value when you compare the cost of a monthly subscription with the cost of a typical first date, especially once you factor in the convenience, selection, discovery, fun, and safety features that we offer. Turning back to our Q2 performance. We delivered strong results in Bumble App's traditional markets, as well as its international growth market.\n\nAccording to third-party data sources, in the second quarter, we gained download share in almost all of our major markets, including the U.S., Canada, and the U.K. Our authentic women first positioning and our products continue to resonate in both our core markets and internationally. In the U.S. and Canada, we are seeing existing users engage, retain and reengage at a high rate.\n\nImportantly, we are also seeing early signs that new users are coming into the fold now that COVID has become more endemic. Our marketing programs, including Bumble IRL, our expanded college program, and our, It Started on Bumble success story platform are resonating with users and helping us increase brand awareness and user engagement. Outside of the U.S. and Canada, we are very pleased with our continued download share gains as well.\n\nAs a reminder, our international market expansion, like our U.S. growth, is built on the back of our brand and is powered on the foundation of organic user demand. We amplified this demand through our decade-long experience in product localization, our best-in-class field marketing programs, and through influencer and performance marketing. This approach ensures that we build sustainable growth and market depth, not just toeholds in each market.\n\nLet's talk about this by region. First, in Western Europe, our market expansion efforts continued to deliver strong results. We are seeing robust user growth across the region and even faster revenue growth. In Germany, Bumble was the No.\n\n2 most downloaded dating app in Q2. The momentum continued into July, and we ended the month with Bumble as the No. 1 most downloaded dating app in Germany according to multiple third-party data sources. We are incredibly proud of this result, and believe it continues to demonstrate the power of our model.\n\nWe expect to focus over the next several quarters on deepening our presence across our launch markets and expanding into other parts of Western Europe. Next, looking at Latin America. Mexico continues to perform well, and our recent launches in Brazil and Chile have established a strong initial market presence for us. We are continuing to build depth in these markets to drive both user and revenue growth, and we'll be extending our efforts to Colombia and Argentina in the second half of this year.\n\nFinally, turning to Asia. We are particularly excited by the traction we are seeing. A lot of activity this year has been focusing on improving the localization of our products in key markets, including for Japanese, Mandarin, and Cantonese speakers, while amplifying organic demand in our launched markets. India, for example, is a market that continues to deliver for us.\n\nAnd our recent localization improvements and brand initiatives are delivering rapid user growth, with revenue more than doubling year over year. Similarly, our efforts last year in Southeast Asia, including Singapore, Indonesia, and the Philippines, continue to perform well. Looking forward, we are particularly excited by the early results of our localization efforts in North Asia and expect the region to be a focus of our 2023 effort once the situation on the ground allows. We are also very pleased with our team's execution against our product priorities for this year.\n\nWe continue to take a thoughtful and user-focused approach to product development, all centered on providing an experience that is designed with the needs of our women's customers top of mind. We test our products extensively to make sure they lead to the right outcomes for our users. We then expand to the market to learn from our users and really understand how to land the product at scale. We then roll out to other markets at a fast but responsible pace.\n\nIn Q2, we brought a broad portfolio of discovery-oriented products to market. We've been testing complements our message before match offering in Australia and Germany. And based on the positive results we're seeing, we expanded the test earlier this month to select markets in the U.S. We've been encouraged with early results, which suggests that those who send compliments have better, higher-quality matches in conversations.\n\nIn some markets, we have also been testing a broader suite of product enhancements such as video and audio that provide our members with richer and more dynamic profile. We are encouraged by the engagement in these new product features and anticipate rolling these out to other markets in the future. To better serve our underrepresented communities on Bumble, we also launched substantial product enhancements for LGBTQIA+ people, and we began investing in features that will deliver a significantly improved experience for underrepresented ethnic and cultural background. These product initiatives are important for our mission and to our user base, especially Gen Z, and we'll continue to expand our addressable market.\n\nFinally, we are experimenting with new engagement models to better serve our women users and help drive matches. To that end, we recently launched a new weekly astrology-oriented event within Bumble app. With over 75% of active Bumble members in the U.S. adopting a Zodiac badge on their profile, this is something that our user base has asked for through the year.\n\nAstrology Tuesdays have led to increases in daily active users on those days and are an example of how we're working to expand the frequency of use on Bumble by designing through a women's lens, which enriches the experience for all. We paired these engagement-driving features with our highly efficient and innovative monetization program. Q2 was focused on a number of paywall pricing optimizations to drive payer conversion. And as we look to the second half of this year, we have an exciting set of new monetization features being planned.\n\nWe are just starting our monetization test for compliments, and we continue to be excited with tests around vertical goods. Later this year, we will start launching our segment-specific offering, starting with college students and women users. Lastly, I'd like to spend a moment on Bumble BFF. As you know, we are building out our next-generation offering, which centers on helping people find platonic connections through small communities, which we are calling Hive.\n\nAs we have shared before, our approach is built on the insight that people want to find friends, acquaintances, and connections through shared struggles and common joys: moving to a new city, navigating parenthood, finding a partner for hiking, or really anything else in between. We have recently expanded our alpha testing to the whole of the Greater Toronto area, and we are excited about the results we have seen. With no external promotions, BFF members have created thousands of Hives. Within these new ways to connect, we're seeing a deepening of engagement.\n\nWe've seen the weekly average number of sessions for these members increase by two-thirds, and their weekly time spent in-app is up 16%. We are listening closely to feedback from our early adopters to continue to make it easier and more joyful to discover relevant Hives to join, get to know other members in your Hives, and coordinate events to spend time in person. Now, turning to our other dating apps, Badoo and other revenue, including Fruitz, totaled $51 million in Q2, down 14% year over year. It has been a challenging first half for Badoo.\n\nWe, of course, exited Russia and Belarus earlier this year. As Badoo serves a more economically sensitive user base, it has also felt the effects of COVID and now the macro environment, much more than Bumble app. Despite these monetization headwinds, Badoo continues to be the second most downloaded dating app in the world with a very broad geographic footprint and a high proportion of long-tenured and highly engaged members. We appointed a new General Manager for Badoo in Q2, and we are actively working on defining the go-forward product strategy and operating model for the business.\n\nIn the immediate future, we are focused on simplifying our user experience to make the product easier to understand with the primary goal of driving higher adoption for our paid features. For example, we've been optimizing our consumable offerings such as shop for credits and extra shows, which enable users to message before a match and increase their overall activity. While it is early days in recent months, we have seen improving revenue trends in many markets and a return to revenue growth on a constant FX basis. In some of our large markets such as Poland and the Netherlands, given the Badoo's brand and scale and its organic traction in many long-tail markets such as Southeast Asia, where we have historically spent very little on product or marketing.\n\nWe are going to take a more active approach to these by testing both localization and marketing efforts in countries within Southeast Asia. Finally, Q2 marked our first full quarter with Fruitz. Fruitz is aligned with Bumble Inc.'s mission by focusing on encouraging transparency and honesty and dating. It particularly resonates with Gen Z users in Western Europe and Canada.\n\nWe are pleased with the progress of -- on integration. Fruitz is already leveraging the expertise of Bumble Inc. in areas such as safety and moderation and strengthening its monetization platform. It continues to be fueled almost entirely by organic demand and has established itself in a close competition for the most downloaded dating app in France.\n\nIn closing, our business has been resilient, and I am proud of the execution and results our team has delivered. It really is an extraordinary time. We are grateful for the opportunity to earn the support and trust of our users, partners, teams, and investors by focusing on our mission and customers through operational excellence and financial discipline. Now, I will turn it over to Anu to talk about the financials.\n\nAnu Subramanian -- Chief Financial Officer\n\nThank you, Whitney, and good afternoon, everyone. We delivered another strong set of results in Q2 with total revenue approaching the top end of our guide and adjusted EBITDA exceeding our guidance. I'll begin with a discussion of our second quarter trends and results before turning to our outlook for Q3 and the full year. Unless stated otherwise, the comparisons I will make refer to the second quarter of 2022 versus the second quarter of 2021.\n\nTotal Bumble Inc. revenue in Q2 was $220 million up 18%, driven by strength in Bumble App. FX was a $9 million headwind to our top line this quarter with the continued strength of the U.S. dollar relative to the euro and British pound.\n\nWe saw an additional $5 million of negative impact from our decision to discontinue operations in Russia and Belarus, primarily impacting Badoo App. In aggregate, FX and the Ukraine conflict impacted our Q2 year-over-year growth rate negatively by eight percentage points. At a group level, both paying users and our ARPPU contributed to our revenue growth with paying users up 3% to just over $3 million and ARPPU increasing 13% to $23.65, primarily driven by mix shift toward Bumble App. As Whitney mentioned, we have seen strong gains in download share of Bumble App in Q2, and we are very pleased that this is translating to healthy revenue growth as well.\n\nQ2 revenue grew 33% to $170 million, above the high end of our guidance range. FX headwinds were approximately $5 million, which impacted our year-over-year growth rate negatively by four percentage points. Paying users for Bumble App totaled $1.9 million, up 31% year over year. On a sequential basis, we added 149,000 paying users, marking the third consecutive quarter we've increased net adds.\n\nA number of factors contributed to the strong growth in paying users, including active user growth and product enhancements that drove payer conversion. Bumble App's ARPPU was $29.38, up 2%. ARPPU pool increased 1% sequentially, primarily due to pricing initiatives, partially offset by geographic mix shift as a result of our international expansion efforts and the negative impact from FX. Now, moving on to Badoo App and Other.\n\nBadoo App and Other revenue in Q2 was $51 million, down 14% year over year. We saw significant headwinds related to both FX and the Ukraine conflict, which amounted to approximately $10 million, which together impacted growth rates negatively by 16 percentage points. Excluding the impact of this, Badoo App and Other revenue would have seen modestly positive year-over-year growth. Badoo App and Other paying users declined 25% to 1.1 million.\n\nOur total paying users decreased 136,000 sequentially in Q2 compared to the decrease of 106,000 in Q1. This included 128,000 impact from Russia, Ukraine, and Belarus, which was in line with the expectations we laid out in our prior outlook. Excluding these countries, Badoo and other paying users declined by 8,000 users compared to Q1 this year. Badoo App and Other ARPPU was $13.60, up 6% year over year and flat versus the prior quarter.\n\nThe year-over-year increase in ARPPU was due to pricing optimization work and impact of two-tier partially offset by FX headwinds. As a reminder, we currently include Fruitz revenue within Badoo app and other revenue but exclude Fruitz paying users from Badoo app and other paying users while we complete the merger integration. Turning now to expenses. Total GAAP operating costs and expenses were $223 million for the quarter, up 14% year over year.\n\nOn a non-GAAP basis, excluding stock-based comp and other noncash or one-time items, I'd note the following. Our total non-GAAP operating expenses were $166 million, up 23%. Cost of revenue was $62 million and grew 23% year over year. The increase was primarily driven by higher app store fees as revenues have grown.\n\nAs a percentage of revenue, cost of revenue was 28%, compared to 27% in the year-ago period, reflecting adoption of Google Play billing in many of our markets starting in Q2. Sales and marketing expenses grew 22% year over year to $57 million. This represents 26% of revenue, up from 25% in the year-ago period. G&A expenses were $31 million or 14% of revenue, compared to $21 million or 11% of revenue last year.\n\nProduct development expenses were $15 million or 7% of revenue, and Q2 GAAP net loss was $6 million, compared to a net loss of $11 million in the year-ago period. Q2 adjusted EBITDA was $55 million, up 6% year over year and represented a 25% margin. We generated $22 million of free cash flow this quarter, compared to $12 million in the year-ago period. We have a strong cash position and ended Q2 with total cash of $335 million.\n\nWe continue to maintain financial discipline with regards to potential uses of cash. Now, moving on to our financial outlook for the full year and Q3. For full-year 2022, we are revising our total revenue outlook to be between $920 million to $930 million which represents a growth rate of 21% year over year at the midpoint of the range. This includes headwinds related to FX and the conflict in Ukraine of approximately $36 million and $20 million, respectively.\n\nThe current FX environment remains highly volatile, and if the current rates continue through the rest of the year, we estimate we will see an additional $8 million of FX headwind not anticipated during our prior earnings call. Excluding the impact of FX and the Ukraine conflict, our year-over-year revenue growth would be approximately 28% at the midpoint of the range. For Bumble App, as Whitney noted, we made excellent progress on our product road map in Q2 and continue to be very excited about the plans in place for the rest of the year. Our revenue outlook reflects our latest view and timing of initiatives on our product and marketing road map, as well as current seasonality trends.\n\nWe expect Bumble App revenue growth of 32% to 34% year over year. This includes $18 million of year-over-year FX headwinds, $7 million higher than at the time of our original guidance, and $3 million higher than our prior earnings call. Excluding FX, we expect the growth rate would be 35% to 37% year over year. We are maintaining our adjusted EBITDA margin outlook of between 24.5% to 25% of total revenue.\n\nThis includes our updated views on FX impact and the previously communicated approximately $16 million of negative impact to our margin as a result of enforcement of Google Play billing. We continue to compete for talent in the global market but are maintaining retire financial discipline as we strive to meet our hiring goals. We have not yet seen materially adverse effects on our spending due to growing inflation concerns in the broader market. This is an area we continue to keep a close eye on.\n\nFor Q3, we expect total revenue between $236 million and $240 million, representing a growth rate of 19% year over year at the midpoint of the range. Our outlook assumes $12 million of year-over-year FX headwind. Our outlook also assumes $6 million of year-over-year headwinds related to the conflict in Ukraine, primarily in Badoo. Excluding the impact of FX and the Ukraine conflict, our guidance for total revenue growth would have been 27% to 29% year over year.\n\nWe expect Bumble App revenue to be between $184 million and $187 million, representing a growth rate of 29% to 31% year over year, supported by continued growth in net paying user additions. The revenue outlook assumes a negative impact from FX of $6 million. Excluding FX headwinds, our guidance for Bumble revenue growth would be 33% to 36% year over year. We estimate adjusted EBITDA will be between $58 million and $60 million, representing 25% margin at the midpoint of the range.\n\nThis includes our updated views on FX and the impact of expected changes to aggregator fees on our cost of revenue. Throughout this ever-changing global environment, we remain intensely focused on delivering the best service to our users while delivering sustainable, profitable growth for our shareholders. We intend to realize the opportunity in front of us for quarters and years ahead by prioritizing the execution of our long-term growth strategy. We will do so with a sharp focus on operational and financial discipline we have consistently demonstrated.\n\nAnd with that, we can open it up for Q&A.\n\nOperator\n\n[Operator instructions] Our first question will come from the line of Cory Carpenter from J.P. Morgan. Your line is open.\n\nCory Carpenter -- J.P. Morgan -- Analyst\n\nThanks for the question. Anu, I have two, and they might both be for you. I was hoping, first, you could just expand on the drivers of the change in the Bumble App 2022 guidance, maybe flesh out how much is FX versus other items and what those other items are. And then secondly, just your expectations for Bumble App net adds and ARPU in the second half of the year.\n\nThank you.\n\nAnu Subramanian -- Chief Financial Officer\n\nSure. Cory, I can take that. So, let me start with Bumble App full-year guidance first. So, if you remember, when we gave our original guidance back in March, we had said we would be at about 34% to 36% growth rate.\n\nObviously, we've seen significant pressure on the pound and the euro since then. So, we've seen approximately $7 million of impact to our top line as a result of this, which is about 1.5% to the growth rate that we are talking about. So, if the midpoint of the device changes, most of the reduction is really as a result of the FX. Additionally, as we've been working on the second-half road map, we've been thinking about the timing of when some of these features will launch.\n\nAnd based on a lot of the testing and user feedback that we've done, we've moved some things around from between Q3 and Q4. So, to give you an example, we've talked a lot about college bundles, and we were originally hoping to launch college bundles before students were back on campus. But again, based on the feedback that we've received from the users, we believe that they will be better served to start getting these bundles once they've settled down on campus. So, again, we're just moving some things on the road map, just again, based on what makes sense for the user.\n\nThis is very normal course and par for what we do based on the test, iterate, and expand approach that we take to our overall product road map. So, that's largely what you see reflected in the new guidance range that you see for full year. And I want to reiterate what Whitney said in the earlier remarks, which is -- we continue to be very pleased with the top of the funnel growth and the download trends that we've been seeing in the business so far. So, again, all of those are trending very much in the right direction.\n\nAnd we just want to make sure that we get the user experience right for our Bumble App users. And the full-year guidance obviously translates into the split between Q3 and Q4 based on, again, the timing of the things that we are expecting on our road map that we talked about. And in terms of net adds, if you remember what I said back in March, the overall philosophy of where we expect to end for the end of the year hasn't changed at all. So, for the second half, I still expect to end up in the same place in terms of overall net adds.\n\nAgain, I think we may see a little bit of, again, puts and takes between Q3 and Q4. So, you may see a slightly lower number for Q3 than maybe we had originally planned, and you'll see the number move into Q4. But again, if you look at the year in aggregate, I'm not expecting any major changes as a result of this.\n\nCory Carpenter -- J.P. Morgan -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Alexandra Steiger from Goldman Sachs. Your line is open.\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nThanks for taking my questions. Could you maybe give us a few more details on how Bumble PR growth has been trending in the different international markets? Any positive and/or negative surprises that you can share as you're expanding your geo footprint? And then I wanted to briefly touch on virtual goods. How do you think about the monetization potential of like virtual goods in the long term? And how do you feel about the current state of the offering? And also, if we're still on track to launch beta this year. Thank you so much.\n\nTariq Shaukat -- President\n\nHey, this is Tariq. Thanks for the question, Alexandra. So, I'll maybe take those in turn. On the international markets, we are seeing very robust user growth, as Whitney mentioned.\n\nThat's true in Western Europe. It's true in the markets in Latin America and in Southeast Asia. So, we generally are seeing very, very strong reception to the brand proposition to the product to our marketing efforts in all of those markets. And I would say that if you look at most of those major markets that we have launched in, we are seeing revenue growth outpace user growth.\n\nThere's a phase of these markets where we focus primarily on user growth to get this market to a certain scale. And then after that, we let users and revenue kind of grow with each other. And the reception on the monetization features, I would say, is quite high, really in the international markets that we've been prioritizing. So, I wouldn't say there's any warning signs or places that we consider to be stumbles.\n\nWe've talked about Germany, Western Europe as being a particularly bright spot that is continuing in Q2. And as Whitney mentioned, in Q3, where the momentum in Germany continues to be very strong. And then Latin America and India and Southeast Asia are also very positive. On virtual goods, we mentioned in the last call that we're very pleased with the tests that we're doing.\n\nWe're continuing to do the test. The offerings are continuing to resonate with Gen Z users that we're testing with. And in particular, they are not just engaging with the product, but they are kind of finding that it's leading to an enhanced engagement, more fun in the experience, which is really one of the goals. It's both a monetization feature and an engagement feature for us.\n\nAs we think about this moving forward, we are, I'd say, likely -- this is all subject to change as we look at our product road map, but likely going to be prioritizing virtual goods within the context of the college offerings that we talked about. At least we see there being a high appetite for it there. So, some of the bundles will have -- as the school year progresses, in particular, we'll have virtual goods components to them. Still working out the exact details, but I think we're still on track for Q4, seeing those appear at a broader scale within these college bundles.\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nTariq Shaukat -- President\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Andrew Marok from Raymond James. Your line is open.\n\nAndrew Marok -- Raymond James -- Analyst\n\nHi. Thanks for taking my question. You mentioned that Badoo customers are a bit more macro sensitive, which has been brought up in the past. But if that's the case, are there learnings that you can take from that user contingent that could help maybe insulate Bumble App from similar macro headwinds in case they get worse in some of the Bumble App core markets?\n\nTariq Shaukat -- President\n\nThanks for the question, Andrew. You know, we have, I think, consistently said that the Badoo user is more economically disadvantaged, more economically, sensitive tends to be sort of middle class and emerging middle-class segment. And as Anu mentioned, we're starting to see some green shoots there sequentially month-over-month where we think that we are -- that some of the initiatives that we do have around our products, streamlining our products, some of the marketing activities that we're doing are really, like I said, starting to result in some green shoots there. The customer base is quite different than the Bumble customer.\n\nAnd so, while we operate a shared platform, we take learnings back and forth. I'm not sure that there's a tremendous amount of learning specifically around economic headwinds on Badoo that we would apply to Bumble. If I take an example of how different these customer bases are, if we look at travel behavior during the summer, we have found that the Badoo user is generally less likely to have traveled this summer than last summer, I think, reflecting some of the macro headwinds. We are seeing a substantial increase in the number of Bumble users in the U.S.\n\nwho are spending days, weeks in Europe this summer. And so, we think that speaks to the higher affluence of the Bumble user base and the much lower economic sensitivity that they have.\n\nAndrew Marok -- Raymond James -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Shweta Khajuria from Evercore ISI. Your line is open.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you for taking my questions. First one is on compliments. Possible to please get a sense on where you are in terms of testing and scaling.\n\nAnd just to repeat what you said earlier in your prepared remarks, is a little bit more color on the back half, how you're thinking about the timeline for that for scaling, and then how you're thinking about monetizing that product as well? I guess that's the first question. And then the second question is really around when we think about beyond product launches, just the macro environment, could you please go over how you're thinking about macro headwinds and tailwinds in the back half or maybe in the next, call it, quarter to three quarters as we look ahead? Thank you.\n\nTariq Shaukat -- President\n\nHey, thanks, Shweta. So, maybe I'll take compliments, and then Whitney and I will tag team on the macro piece. So, what we mentioned in the call -- or in the prepared remarks was that we've been live with compliments in Australia. We then followed that with Germany, and we recently -- I think it was early this month, maybe the last day of July, but early this month, launched in select markets in the U.S.\n\nThe reception that we are seeing is exactly what we want to see. We are seeing an increase in activity related to compliments. Compliments are getting sent. These are the message before matches are getting sent.\n\nThey're getting opened. We are finding that they are leading to higher levels of engagement generally. So, we're very pleased to see those results. Part of the trick with all of this is making sure that the lessons you learn in a country like Australia or Germany is replicated in a country like the U.S.\n\nSo, we, again, are pretty cautious when we are launching products. We hope -- so far, we're seeing similar results, so we're hoping that that continues, and that will lead to a broader market rollout, I think, globally, if we do see that. So, stay tuned for more on that. On the monetization front, we launched our first test on the monetization side earlier this week actually.\n\nAnd essentially, at the moment, you can think of it as you get a certain number of compliments for fee that you can send per day, and then you would have to pay for additional compliments, right? It's really a sort of sender type of experience that would be a consumable offering at the moment. We're looking at different configurations of that if the test proved to be successful, it could be consumables and subscriptions in different ways. So, more to come as we learn what's happening here. But we think the level of engagement we're seeing points to a very monetizable opportunity over time.\n\nWhitney, do you want to take some of the macro questions?\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nThanks for the question. So, as far as the outlook on the macro environment goes, I think it's important to note that we're very fortunate to be in a business really centered around this core human need and finding human connection ultimately. So, people want that connection no matter what is happening with the economy. And remember, our apps are such a great value compared to many other ways of meeting.\n\nOur monthly subscription is quite literally cheaper than drinks in a nice bar in New York City on just one date. So, the access you can get to our product is it's almost unparalleled. So, for Bumble App, we are not noticing any impact on the business so far as it pertains to these macro moving trends. We tend to have a more affluent customer base on Bumble Apps.\n\nAnd the behaviors we have seen, to Tariq's point earlier, suggests that they are continuing as they always have. So, to borrow Tariq's example earlier, we've seen U.S. Bumble customers traveling to Europe much more this summer than they did last year. And of course, I want to be clear that on Badoo, we do have a more economically disadvantaged customer base who has struggled throughout the pandemic.\n\nSo, we're seeing some of those struggles continue with that audience. Their travel is slightly down, as Tariq said. But as we mentioned, we are starting to see some green shoots in that business, as well as our new initiatives, start to take hold. So, continue to, of course, watch this very closely as it continues to be a very evolving situation, but we are positive as it stands.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you, Whitney. Thanks, Tariq.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Lauren Schenk from Morgan Stanley. Your line is open.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Just a few quick ones. I guess you mentioned the Bumble App net adds in the third quarter might be probably below where you were expecting before.\n\nAre you still expecting sequential acceleration in net adds in the third quarter? And then second, how confident -- or how do you gain confidence in there being acceleration in the fourth quarter on the tougher comparison? And then lastly, any update on your conversations with Google on a potential Spotify-like deal? Thanks so much.\n\nAnu Subramanian -- Chief Financial Officer\n\nYeah, sure. So, just to be clear, for Q3, I'm still expecting net adds to be higher than what we had in Q2 of this quarter, right? Obviously, we had originally said that we may potentially have a hockey stick just given that some of our lower-priced bundles were going to launch in the earlier part of Q3. So, now with that potentially shifting to the later part of Q3, we -- that hockey stick may be less of a hockey stick than we thought. But again, just to be clear, it will be more than what we saw in Q2.\n\nIn terms of Q4, again, remember, we are very methodical about how we test our products. And if you remember, even last year, we saw -- we had very specific product launches that we had coming up in Q4, and that's what we launched and we delivered on those. So, again, we feel, based on extensive testing that we've done, that the stuff that we have in the pipeline for Q4 is all stuff that we feel very confident about. A lot of these will start launching in the latter part of Q3, and then we'll start to ramp up in Q4.\n\nAnd again, like we've said all throughout this year, we are taking a very sort of 360-degree approach to how we are planning to launch the products. It's not just us launching a product and letting it out in the wild, it's going to be accompanied by a very robust marketing program that will also accompany the product launch. So, we, especially this year, found that that 360-degree approach to product launch really works well for us and resonates with our users. So, we are feeling really, really good about the stuff that's on our road map.\n\nAnd there are some really cool and fun and exciting things that are happening, so I think the teams are working very hard and feeling very good. And again, just overall, the strength that you're seeing from a top-of-the-funnel perspective makes us pretty confident that we will achieve the numbers that we've set out for payers for the second half of the year. And then with respect to Google, again, I'm sure all of you have been following the news as closely as we have. I think the latest news is the announcement that Google has made in the European economic area around allowing third-party payment providers.\n\nSo, that is definitely a change that is sort of new on the horizon. We are talking to Google about how that gets implemented. There is an approval process that you have to go through. So, that is something that is likely going to come down the pipe.\n\nJust for everyone's benefit, that is largely going to still involve us paying 12% to Google, and then the balance to a third-party payment provider. So, from a margin perspective, we don't expect to see any saving with respect to that, where that is beneficial is obviously this makes the user flow for our users, and it makes for a much better experience for them. So, obviously, we're taking a close look at that. And then around the larger user choice billing program, we are in active conversations with Google.\n\nAnd as we've always said, we have a good relationship with them. So, when we can have something to say, obviously, we'll share it with everyone.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Brad Erickson from RBC Capital Markets. Your line is open.\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nThank you. So, I think, you know, when you rolled out -- when you expanded the plans from one to two, I think you said you saw two-thirds adoption to the higher price plan. Maybe just talk about your expectations for how that mix will look with the new lower-priced bundles. And I guess how much of the payer inflection you're pointing to in Q4 is expected to come from existing free users versus just attracting new users with this more attractive pricing? Thanks.\n\nAnu Subramanian -- Chief Financial Officer\n\nYeah. So, you know, it's likely to be a mix of both. I think we are always very, very conscious about making sure that when we launch new pricing programs, that we don't cannibalize existing payers in any way. So, the way we are designing the college bundle is going to be, again, targeted toward students that are not paying for any of our paid programs.\n\nSo, these will be both new college students that enter the dating ecosystem for the first time, as well as existing students, whether they're in the senior or junior, that don't pay for anything today because they don't see value in the Bumble boost or Bumble premiums here, but they will start to see value in the sort of new college bundle that we put together. So, it is a mixed approach. We are always making sure that we continue to drive payer penetration up. But at the same time, we're also very focused on getting new users into the fold as part of this process as well.\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nGot it. And then you're -- it sounds like you're rolling out the college plan, obviously, later in the year than you previously anticipated, but not really changing much of the full-year revenue guidance. So, is it fair to assume there really wasn't that much contemplated in the original guidance around that plan? And I guess, how should we think about that ramping over the next year, particularly maybe any color on the geos that lie beyond the U.S. and so forth? Thanks.\n\nAnu Subramanian -- Chief Financial Officer\n\nYeah. I mean, you're right. So, from an overall, what do we have planned for the year? I think other than the fact that we are moving some things between Q3 and Q4, really, there isn't any other change in terms of how we're thinking about the full-year guide. Obviously, that means that it pushes some revenue from this year into the early part of next year.\n\nBut again, from what we want to do and from an overall growth perspective, there's really no big change in the story other than that. Obviously, FX continues to go down. And so, we've just incorporated that in our guidance for this year. Tariq, I don't know if you want to talk about our international plan for how we are thinking about the first half of next year.\n\nTariq Shaukat -- President\n\nYeah. I think if the question is around international growth, I think we are going to be really taking a methodical regional approach. So, we've talked about the countries that we're in at the moment that we are excited about at the moment, countries like Germany, like France, like Benelux, Mexico, Chile, Brazil, etc. What you're going to see us really focusing on next year is both depth within those markets, as well as expanding kind of methodically into new markets.\n\nWe are very focused, getting the first marketing campaign going, and Germany was not the end of the story for us. It was really a lot of work on the ground to continue to build momentum and depth and get us to the place that we're at today. We still think there's a tremendous opportunity in the countries I just mentioned that we've launched in. So, a lot of focus on that.\n\nWe'll be adding countries. Whitney mentioned a number of them for the second half of the year. And I think that the one we're taking a close look at, at the moment, as you mentioned, is North Asia for some time in 2023. There are some challenges on the ground at the moment as it relates to COVID, etc.\n\nSo, we're just trying to pick our time carefully there. One of the advantages about the segment-specific bundle capability that we are building and launching, and college is one example of that is it gives us the opportunity to do more local market bundles over time as well. So, we know that in some markets, like say India, it may be better to do a locally tailored bundle, right, than what we have available globally. So, that is something we'll be taking a harder look at in 2023 as well.\n\nOperator\n\nOne moment for our next question. Our next question comes from the line of Deepak Mathivanan from Wolfe Research. Your line is open.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGreat. Thanks for taking the questions. So, a couple of ones. First, your competitor noted that the inclination from first-time users to use dating products hasn't really returned to pre-pandemic levels yet.\n\nI'm not sure if you are seeing similar trends on top of the funnel. Any thoughts of you can provide on that would be very helpful. And then second, can you talk a little bit more about the marketing spend? It came in a little bit below us, and I believe you are hoping to ramp to spend ahead of summer. Is that due to maybe better ROIs you're seeing on advertising channels? Or is that due to kind of the delay in call it subscription to launch? Any color you can add there would be great.\n\nTariq Shaukat -- President\n\nSure, Deepak. So, on first-time users, I'll focus my answer on the U.S. as a sort of a very mature market for us. We are actually seeing, for the really first time since the pandemic started, we are seeing early signs that the user base is really coming back more actively, more like it was in pre-pandemic times.\n\nI think that we are very happy with the results of the marketing programs that we have rolled out in North America. This combination, as we've talked about before, of Bumble IRL really leaning into that hybrid experience online plus off-line, leaning into our success stories to generate word of mouth and really build that organic demand. So, initiatives like that. And we are seeing that that new user is -- we think, got more spring in the step than it has historically.\n\nReengaged users and existing users continuing to also perform strongly. So, it's not that we're trading up one for the other. It very much is kind of a new ad that we think is both a macro point as the pandemic becomes endemic, but also a result of these very deliberate actions we've taken on the marketing and product side to tailor ourselves for the post-pandemic world, right, where people do want to go out and meet people in real life. So, very pleased with that.\n\nStill pretty early days, but it was a very nice thing to see this quarter. In terms of marketing spend, the -- there's a couple of things going on there. We are very disciplined ROI-oriented marketers. And so, we are getting good ROIs.\n\nWe are taking advantage of those wherever we find those opportunities. And I think that we are -- you'll see us leaning in certain markets, and then leaning back in other markets, depending on how the ROI trends are shaping up. We are finding that there's a lot of really good opportunities in some of the social platforms and iOS as an example at the moment and less so at this particular moment on Android. That's been a trend that's been happening for a little while now.\n\nSo, we are shifting our mix, always keeping that return on ad spend target in mind. Part of how we spend our marketing dollars is to support new product launches. And so, with some of the timeline shifts a couple of weeks here and there that Anu talked about, we have moved around some of the marketing dollars to make sure we're fully supporting the marketing -- the product activities, the product road map activities that we have. So, that will be the other thing on the margin that you're seeing.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGot it. Thank you so much.\n\nOperator\n\nThank you. One moment for our next question. Our next question will come from the line of Benjamin Black from Deutsche Bank. Your line is open.\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nGreat. Good afternoon, and thank you for the question. So, your competitor is obviously launching a product geared toward monetizing women. I guess the question here is, do you get the sense that competition is rising in the space? And how do you feel positioned competitively? And then secondly, with the launch of student subscription tier complement, virtual goods, how should we be thinking about Bumble App ARPPU growth for the balance of the year and into next? Thank you very much.\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nThank you so much for the question. I'll start with the competition piece. I'll break it down in two parts. I'll start just with the broader view on competition more generally, and then we'll take the women piece second, and then I'll turn it over to Anu on the last question.\n\nSo, first and foremost, we're very happy with our performance versus our competition this quarter. Based on third-party data sources, we believe that we gained download share against our major competitors in almost all of our major markets. So, as I mentioned in the prepared remarks, this momentum is continuing into July. And the same data sources are showing the Bumble is the No.\n\n1 most downloaded dating app in a number of our major markets, including Germany. We believe that there is a number of reasons for this. So, first of all, our brand promise, and this comes to the woman piece, which we'll get to in a second, but our brand promise to women continues to resonate. So, according to Morning Consult, we've substantially gained in our net promoter scores within U.S.\n\nwomen more so than our competitors. And second, our product continues to see high and increasing engagement. This really reflects the success of our product, and our marketing road maps, including our increasing focus on hybrid, that off-line, and online approach to dating. And then lastly, we know that people are really successful on Bumble.\n\nWe have a platform that we have called, It Started on Bumble, and this really celebrates this. So, for example, we're seeing increasing integration of our brand into weddings. We receive a lot of wedding invites, engagement announcements, and baby announcements at our office. This generates that word of mouth, which then, in turn, drives organic growth.\n\nSo, all of these have worked together to create what we believe is this unique ecosystem. That's all to say, we are really gaining market share in this organic way, and this is sustainable over the long term. This really resonates on a global level. So, let's move to the women piece.\n\nWe are, first and foremost, very grateful to see the larger Internet space taking an interest in making the Internet safer for women. We, of course, support that. That said, the safety of women on these platforms cannot just be a road map add-on or an afterthought. So, since starting this company in 2014, our consistent goal has been to make dating better kinder, and safer for women, and this is truly at the foundation of everything we've done.\n\nTherefore, we've earned our stripes by being known as this woman-first brand. That is not something that can be replicated easily. And we don't believe it can be replicated at all. This is really why we have such a strong audience among women and a high propensity to pay, and an industry-leading NPS score with women.\n\nSo, that all to say and to conclude, just turn it over to Anu, we have not seen a large impact to date from competitors' add-ons for women. And we believe that it's really what I just attribute that to is, that it's just not fundamentally focused in their DNA. So, over to you, Anu, on the revenue bit.\n\nAnu Subramanian -- Chief Financial Officer\n\nSpeaking on ARPPU, again, as I've said before, we largely expect it will be flat year over year on ARPPU. Obviously, FX will play a part in it, and then, again, some of the lower price offerings that we have will also play a part in it. So, again, nothing has really changed fundamentally from what we've said before. On a full-year basis, I expect Bumble will be around the flat ARPPU range that I had provided before.\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nGreat. Thank you. Thanks for all the comments.\n\nOperator\n\nOne moment for our next question. Our next question comes from the line of John Blackledge from Cowen. Your line is open.\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nGreat. Thanks. Just curious if you could provide an update on the Fruitz acquisition. And more broadly, if you could discuss kind of how you're thinking about potential M&A opportunities? Thank you.\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nSure. Thanks. I'll start with M&A and then I'll give you a quick update on fruits. So, it's important to note that we remain really excited by our organic growth and the potential there.\n\nBut as we've showed with our fruitz acquisition, quick update to come there in a moment, we are very open to M&A when it fits with our mission, our strategy, and our shared technology and marketing platform. So, I would say there's five key bullet points to keep in mind when we -- for you to keep in mind as we think about M&A. So, No. 1 is mission alignment.\n\nCan this drive kind connections? Two, does it introduce a new engagement model, something that we don't already offer at scale? Three, does it capture a new geography or a hard-to-reach user group? Four, does it add tech/talent, equally both, while being financially accretive? And five, does it capture adjacencies close to our core dating and connection business, which would just extend TAM and LTV? So, where we see attractive opportunity is we are open to actively exploring those, and we will be opportunistic. We have a strong balance sheet and a really strong resonance with founders. We believe that founders are really intrigued by what we do, by our mission alignment and our shared infrastructure to help them scale and find monetization, and so on and so forth. So, we definitely have capacity to do more.\n\nAnd as always, we'll, of course, be extremely disciplined in our approach to this. So, let's just turn to Fruitz really quickly. So, Q2 marked our first full quarter with Fruitz since we acquired the app in January, and we have successfully and smoothly integrated it with our group. Fruitz is already leveraging the expertise of Bumble Inc.\n\nSo, focusing on foundational elements of its business like safety and content moderation, data science, AI and monetization, and so on. We are excited to see the potential for Fruitz. It is solidly the No. 2 most downloaded app in its home country of France as of May, and it competes actively for the top spot.\n\nSo, its growth continues to be almost all organic at this point, and we have good line of sight on how we can unlock more growth opportunities in the future. And just in case anyone is unclear on what Fruitz's key differentiator is, it's all about intentions and honesty and transparency when you date. So, you select the fruit to indicate what your relationship intention is, and you can match accordingly. So, it's very mission-aligned.\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nMay I ask a follow-up?\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nSure. Certainly.\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nYeah. So, would you or any of the offering to the Bumble app or Badoo?\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nSo, you know, it's very interesting, and this is part of the shared resource infrastructure that we have. We can really evaluate what certain features and functionalities are working in one product versus another. And there's always options to test and iterate on that and to try it in new markets, new audiences and even cross-platform. So, there's definitely opportunities in the future to test on other products.\n\nBut right now, we're really exciting -- we're very excited with what we're seeing on that product, and we're excited to watch that journey to scale.\n\nOperator\n\nThank you. That is all the time we have for Q&A today. [Operator signoff]\n\nDuration: 0 minutes\n\nCherryl Valenzuela -- Vice President, Investor Relations\n\nWhitney Wolfe Herd -- Founder and Chief Executive Officer\n\nAnu Subramanian -- Chief Financial Officer\n\nCory Carpenter -- J.P. Morgan -- Analyst\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nTariq Shaukat -- President\n\nAndrew Marok -- Raymond James -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nBenjamin Black -- Deutsche Bank -- Analyst\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nMore BMBL analysis\n\nAll earnings call transcripts"
}