{
  "companyName": "Credit Suisse Group",
  "companyTicker": "CS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/credit-suisse-group-cs-q3-2022-earnings-call-trans/",
  "content": "Credit Suisse Group (CS -2.56%)\nQ3 2022 Earnings Call\nOct 27, 2022, 2:00 a.m. ET\n\nOperator\n\nGood morning. This is the conference operator. Welcome, and thank you for joining Credit Suisse Group's third quarter 2022 results conference call for analysts and investors. [Operator instructions] I will now turn the conference over to Kinner Lakhani, head of investor relations and group strategy and development.\n\nPlease go ahead, Kinner.\n\nKinner Lakhani -- Head of Investor Relations and Group Strategy and Development\n\nGreat. Thank you, Alice. Good morning. Welcome, everyone.\n\nThank you for joining our third quarter '22 results call. So, we have a busy schedule ahead of us with our third quarter earnings presentation, followed by the 2022 strategy update presentation, which, as you know, begins at 9:30 GMT. So, please note that this call will very much be focused on earnings, and I kindly ask you to respect that in the Q&A that follows. Before we begin, please note all the legal disclaimers in the presentation.\n\nAnd let me remind you the important cautionary statements, including in relation to forward-looking statements, non-GAAP financial measures, and Basel III disclosures. For a detailed discussion of our results, we refer you to the Credit Suisse third quarter 2022 earnings release published this morning. Let me remind you that our third quarter financial report and the accompanying financial statements for the period will be published in early November. I will now hand over to our group CEO, Ulrich Korner; and our group CFO, Dixit Joshi, who will run through our numbers.\n\nUlrich Korner -- Chief Executive Officer\n\nThank you very much, Kinner. And thank you, all, for joining today. We appreciate your participation and engagement. For the purpose of this call, we intend to focus on our third quarter performance only.\n\nAnd I will share some brief remarks before handing over to our new chief financial officer, Dixit Joshi. We will discuss the outcomes of our strategic review later today starting at 9:30 London time. I hope that many of you on this call will be able to join us then. Let me turn to performance.\n\nOverall, our results for the third quarter 2022 were significantly impacted by the continued challenging market and macroeconomic conditions. They were also reflective of underperformance compared to peers in certain business lines and, importantly, the effects of some of the strategic decisions that we have announced today. Starting with the headline numbers here on Slide 4 of the presentation, we reported a net loss of 4 billion Swiss francs in the quarter, including a 3.7 billion Swiss francs impairment related to the reassessment of deferred tax assets resulting from the strategic review. Our reported pre-tax loss was 300 million Swiss francs and included 200 million Swiss francs in major litigation provisions, which I will expand on shortly.\n\nThe adjusted pre-tax loss of 100 million Swiss francs was mainly due to an investment banking and weak investment banking performance, as well as somewhat lower client activity across all our divisions. In terms of our capital position, our CET1 capital ratio for the quarter was 12.6%, down 90 basis points. This was primarily due to the impact of deferred tax assets of approximately 50 basis points relating to the strategic review, together with the pre-tax loss and increased risk weighted assets. Today, we have announced a capital raise of 4 billion Swiss francs, which would increase the pro forma CET1 ratio to 14%.\n\nThis means that we begin our strategic transformation from a position of capital strengths. Now, let me turn to the details on the progress we are making toward resolving legacy litigation issues with the next slide. Total litigation provisions for the quarter were 245 million Swiss francs, of which 178 million Swiss francs were major litigation provisions primarily related to previously disclosed matters as we continue to take a proactive approach to reducing our litigation docket. The two most prominent recent examples of resolutions are, first, the settlement agreement with the New Jersey attorney general related to a legacy residential mortgage backed securities case, which was already fully provisioned.\n\nThis resolved the largest of the bank's remaining exposure in the RMBS docket with transactions going back to before 2008. Second, the successful settlement in the French legacy case announced this week both represent major milestones in our efforts to achieve a significant reduction in our outstanding litigation docket and are supported by a \"reduction\" in the range of reasonably possible losses of around 19%. Let's look at the breakdown of the third quarter results by division with the next slide. The loss in the quarter was predominantly driven by the weak performance in the investment bank, which was impacted by higher volatility, widened credit spreads, and muted primary issuance resulting in an adjusted pre-tax loss of the division of 640 million Swiss francs.\n\nThe difficult macro environment also impacted the year-and-year performances of our wealth management division, which posted an adjusted pre-tax income of 78 million Swiss francs, including a 145 million of impairments related to certain IT-related assets. The Swiss bank and asset management division boast solid performance with adjusted pre-tax income of 383 million Swiss francs and 104 million Swiss francs, respectively. With that, I hand it over to Dixit, who will walk you through the results in more detail.\n\nDixit Joshi -- Chief Financial Officer\n\nThank you, Ulrich. And good morning, everyone. I am pleased to be presenting my first set of quarterly results at Credit Suisse and look forward to speaking to some of you in person later today. I will now provide some details on our performance of the group and the divisional levels.\n\nAs you all know, challenging conditions continue during the third quarter with heightened market volatility, weak customer flows, and ongoing client deleveraging. And our financial performance reflects these challenges. So, let's start with the group numbers. Reported net revenues for the group decreased 30% year on year to 3.8 billion Swiss francs.\n\nThe key drivers were substantially lower levels of activity across the industry in equity capital markets and leveraged finance, which contributed to a weak performance in the investment bank, and subdued client activity in wealth management, especially in terms of transaction-based activity. Total reported operating expenses were 10% lower year on year at 4.13 billion Swiss francs. Ulrich has already mentioned the major litigation provisions of 178 million Swiss francs and the progress that we are making with regard to our legacy issues. Overall, our reported pre-tax loss for the quarter was 342 million Swiss francs.\n\nAdjusted operating expenses were down 6% year on year at 3.87 billion Swiss francs, mainly driven by lower compensation and benefits expenses. This was partially offset by an impairment of IT-related assets in wealth management totaling 145 million Swiss francs. On an adjusted basis, we recorded a pre-tax loss of 92 million Swiss francs in the third quarter. We also reported an income tax charge of 3.7 billion Swiss francs in the quarter, of which the majority 3.66 billion, was an impairment related to a reassessment of deferred tax assets resulting from our strategic review and so is not related to our third quarter operating performance.\n\nThe net loss attributable to shareholders, including the income tax expense, totaled 4.03 billion Swiss francs for the quarter. Turning now to assets under management on the next slide. Market movements were the main driver of a 53 billion Swiss franc decline in assets under management for the group quarter on quarter. This includes net asset outflows of 12.9 billion Swiss francs.\n\nAt this point, I would like to provide some additional context and commentary on asset flows at the start of the fourth quarter. We did see a significant level of deposit in AUM outflows during the first two weeks of October. Whilst these outflows have stabilized since this period, they have not yet reversed. We have plans to address these matters after 27th of October through, among other things, accessing capital markets and executing the strategic initiatives we have announced today.\n\nWe would note that the execution of these measures is also expected to generate liquidity and reduce the funding requirements of the group. Let us now turn to costs on the next slide. As I mentioned earlier, adjusted operating costs were 6% lower year on year at 3.87 billion Swiss francs. This was mainly due to a reduction in our compensation and benefits accruals of 398 million Swiss francs, reflecting our revenue performance and pre-tax loss in the third quarter.\n\nThe figure also includes the charge of 145 million Swiss francs that I mentioned earlier as we took the decision to impair IT-related assets and wealth management following a review of our technology and platform strategy in the division. We continue to make investments in technology and in wealth management, though the associated costs were partly offset by savings and business exits. Later on today, we will provide details of our strategic plan to reduce costs further over the next three years. The IT impairments taken in the second and third quarters are evidence of our willingness to take action in the short term for longer-term benefit.\n\nLet's now turn to our capital ratios on the next slide. Our quarter-end CET1 ratio was 12.6%, a decrease of 90 basis points compared to the end of the second quarter. Let me take you through the key drivers. First, we saw a 12 basis-point reduction from the pre-tax loss for the quarter.\n\nSecond, certain CET1 capital movements accounted for a further 20 basis-point reduction. And third, net increases in RWAs in the quarter accounted for a net reduction of 11 basis points. This takes us to a CET1 ratio of 13.1% before the impacts of today's announcements. Taking these in turn, the strategy-related deferred tax assets impairment reduces the CET1 ratio for the third quarter by 48 basis points to the reported 12.6%.\n\nThis is more than offset, though, by the 4 billion Swiss franc capital raise, which adds around 140 basis points, taking us to a pro forma CET1 ratio for the third quarter of 14%. Our Tier 1 leverage ratio was 10 basis points lower at 6% compared to the previous quarter before the strategy impact. The 21 basis-point reduction due to the strategy-related deferred tax impact is more than offset by an increase of around 45 basis points coming from the capital raise. And this takes the pro forma Tier 1 leverage ratio for the quarter to 6.5%.\n\nA few points on return capital. As a result of our strategy announcement, in particular, the capital raise, the Credit Suisse AG Swiss CET1 ratio has reduced significantly due to further participation valuation adjustments. In contrast, the announced capital actions are expected to strengthen the group's CET1 ratio. In light of the bank's transformation, FINMA has reduced the size of the capital surcharges for the bank's market share and its size, according to the Capital Adequacy Ordinance.\n\nThis results in a lower total capital requirement for Credit Suisse Group AG and its domestic subsidiaries. In addition, the bank parent company will temporarily use capital buffers until the end of 2025, in line with the capital adequacy ordinance and the regulatory guidance by FINMA. This allows the bank effective and efficient capital management during the transformation period. Let's now turn to our business divisions, which we will discuss as usual on an adjusted basis.\n\nAnd I'll start with wealth management. Total net revenues in wealth management were 1.36 billion Swiss francs, down 14% year on year, impacted by lower client activity volumes and recurring revenues. Net interest income improved 20% due to higher deposit revenues, which reflected higher interest rates, especially in U.S. dollars.\n\nThis was more than offset by lower recurring commissions and fees, which down 18%, and a reduction in transaction-based revenues of 40%. Looking at the revenue lines in more detail, the decline in recurring commissions and fees reflected lower average assets under management and lower service-driven fees. In terms of transaction-based revenues, clients continue to be cautious, especially in our Asia Pacific franchise, which impacted global trading solutions revenues. We also saw further mark-to-market losses on our fair value portfolio of 35 million Swiss francs related to the APAC Financing Group.\n\nOperating expenses were 9% higher at 1.27 billion Swiss francs, mainly driven by an impairment of IT-related assets of 145 million Swiss francs, following a review of the wealth management technology platform strategy. We continue to simplify our technology state and position wealth management for the implementation of our new strategy, though the costs associated with this were partly offset by lower compensation and benefits expenses. Overall, adjusted pre-tax income for the division was 80% lower year on year at 78 million Swiss francs. There were net outflows of 6.4 billion Swiss francs in the quarter due to a combination of clients deleveraging and proactive derisking.\n\nLet's turn to the Swiss bank. The Swiss bank delivered a resilient performance, notwithstanding the impact on threshold benefits as Swiss interest rates have risen, with total net revenues 9% lower year on year at 956 million Swiss francs. Net interest income decreased 11%, mainly driven by lower threshold benefits from the Swiss National Bank. As a reminder, this special benefit has been worth around 350 million Swiss francs per annum, while rates have been at minus 75 basis points.\n\nBut as Swiss interest rates have moved toward zero, that benefit has eroded. The effect of this should bottom out around the middle of 2023. Recurring commissions and fees were down 3% year on year due to lower assets under management, partially offset by higher fees generated from lending. Transaction-based revenues were 17% lower year on year.\n\nHowever, we did see a transition gain relating to [Inaudible] in the third quarter of last year. If we exclude this, as well as gains on certain equity investments, transaction-based revenues were 4% lower year on year. Operating expenses were 7% lower year on year at 552 million Swiss francs, mainly due to reductions in compensation and benefits. This translated into a pre-tax income of 383 million Swiss francs, 15% lower than the same quarter last year.\n\nThere were net outflows in the quarter of 1.5 billion Swiss francs, with outflows of 1.7 billion Swiss francs from private clients, partly offset by inflows of 200 million Swiss francs from institutional clients. Let's now turn to asset management. Revenues here improved compared to the second quarter, but were down year on year as a result of market uncertainty and reduced client appetite. Overall, net revenues were 15% lower year on year at 346 million Swiss francs.\n\nManagement fees declined by 13% year on year, in line with a 13% decrease in assets under management, mainly the result of market movements and currency effects. A 47% improvement in investment and partnership income was more than offset by a 56% fall in performance, transactions, and placement revenues. Operating expenses were 11% lower year on year, mainly driven by lower expenses related to the supply chain finance fund matter and reduced compensation and benefits. Overall, pre-tax income decreased 21% year on year to 204 million Swiss francs.\n\nThere were net asset outflows of 4.2 billion Swiss francs over the quarter across both traditional and alternative investments, partly offset by inflows from investments and partnerships. Let's now turn to the investment bank. The investment bank faced challenging conditions in the third quarter with higher volatility, widened credit spreads, and muted primary issuance. As a result, total net revenues were 58% lower year on year at $1.14 billion.\n\nWithin primary, our performance this quarter has been broadly comparable with peers in a depressed market, whereas a comparatively weak sales and trading performance is largely reflective of our business mix. As we have evolved in recent years, we have de-emphasized certain business lines, such as macro, where our peers have been able to benefit from higher volatility. Later this morning, we'll discuss the steps that we're taking to address this, including refocusing our markets business. Capital markets revenues were impacted by substantially lower activity in the equity capital leverage finance markets and also include mark-to-market losses of $120 million in leveraged finance.\n\nWe continue to take steps to derisk our book. And our noninvestment grade underwriting portfolio was down 40% compared to the end of 2021. Advisory revenues were 39% lower year on year with lower deal closings. And again, this was in line with peers.\n\nEquities revenues were down 54% against a strong third quarter in 2021. This was driven by reduced equity derivatives and cash trading revenues and also reflected the exit from prime services. Fixed income revenues were 32% lower year on year due to a decline in securitized products and global credit products, partially offset by higher macro revenues as a result of higher volatility. Operating expenses were 12% lower year on year at $1.78 billion, reflecting lower compensation and benefits and revenue-related expenses.\n\nThis resulted in an adjusted pre-tax loss of $640 million. Clearly, this is not an acceptable outcome. And again, we will outline the steps we are taking to reshape our business model later on this morning. Risk-weighted assets and leverage exposure were down 10% and 20%, respectively, year on year, reflecting reduced business activity as well as management actions.\n\nLet me finish with a look at the corporate center. Net revenues were 35 million Swiss francs, while operating expenses were 62% lower year on year at 76 million Swiss francs. As a result, the corporate center delivered a pre-tax loss of 41 million Swiss francs, down from a pre-tax loss of 212 million Swiss francs for the same period last year. The Asset Resolution Unit, which sits within the corporate center, generated a pre-tax loss of 28 million Swiss francs compared to a pre-tax loss of 73 million Swiss francs in the third quarter of last year.\n\nRWA has declined by $2 billion to $6 billion and leveraged exposure by $5 billion to $14 billion over the same period, as we continue to wind down the book. With that. Thank you very much. And I'll it hand over to Kinner.\n\nKinner Lakhani -- Head of Investor Relations and Group Strategy and Development\n\nGreat. Thank you. So, we will now begin the Q&A part of the conference. I would kindly remind you again to focus on earnings.\n\nThere'll be time for strategy later this morning. Also, given time restriction, if everybody could stick to a maximum of two questions, please. So, over to Alice. Thank you.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Stefan Stalmann with Autonomous Research. Please go ahead.\n\nStefan Stalmann -- Autonomous Research -- Analyst\n\nYes. Good morning, gentlemen. Thank you very much for the presentation. My two questions are as follows.\n\nThe first one, on your deposits, customer deposits in the group balance sheet, they are down by 5% during the quarter. And I guess on an FX-neutral basis, given the strength of dollar, it would be even more. Can you give any color, please, on what drove this reduction maybe by business line, geography, currency, whatever makes sense? And the second question, on your capital situation at the AG. The U.K.\n\nauthorities approved a roughly 5 billion capital repatriation in early September. Has that actually been executed, please? Thank you very much.\n\nDixit Joshi -- Chief Financial Officer\n\nI'll take both questions. And thank you for joining the call. You know, I'll take the second one, you know, first. You know, the answer is yes.\n\nYou know, we did repatriate the 5 billion out of our U.K. entities. And that was supportive of our parent capital ratio in the third quarter. You know, quite frankly, that follows a legal entity simplification strategy that, you know, we've been investing in over the years.\n\nThat's contributed in the region of about 18 billion of efficiencies, you know, to date. We will continue investing in that initiative over the next three years, and we'd expect that to free up more parent capital during that period as well. On the deposit front, you know, what you have seen, you know, in the third quarter, you know, as we show on Slide 9, is really that, you know, a combination of market moves and NNA outflows have led to, you know, reduction in AUM in the third quarter. You know, net new asset outflows were in the region of 13 billion in the third quarter.\n\nYou know, as you know, the negative social media news around our name at the beginning of October, you know, did lead to outflows, you know, across our franchise. You know, it's something that we're looking to address today through the strategic announcements that we're making, including the 4 billion capital raise and ensuring that, you know, we're well capitalized through this transformation period, while we make the transformational announcements and restructuring across our investment bank and other business areas.\n\nStefan Stalmann -- Autonomous Research -- Analyst\n\nThank you very much.\n\nOperator\n\nThe next question comes from the line of Magdalena Stoklosa with Morgan Stanley. Please go ahead.\n\nMagdalena Stoklosa -- Morgan Stanley -- Analyst\n\nThank you very much, and good morning. I am going to have to follow up on the question about the outflows. Because, of course, I think from one perspective, I think the market was prepared for them, given what you've just kind of discussed in terms of what we have kind of seen in the markets and the media as well. But, you know, could you give us a sense of how concentrated those outflows were versus, you know, more broad-based? And, you know, we've seen the outflows, I think, across -- because, you know, you've provided us with so much information, but there seems to be outflows in APAC and MENA but, for example, not in EMEA.\n\nWould you be able to kind of to -- give us a sense of kind of what actually happened during the quarter and maybe in the beginning of -- and maybe in October as well to kind of -- to -- for us to be able to assess, you know, how to look at them going forward.\n\nUlrich Korner -- Chief Executive Officer\n\nSure. Thanks, Magdalena. So, if we look at the wealth management situation, you've seen the outflows of 6.4 billion for the quarter. And you rightly put it, which you then see reflected in the transaction-based income line as well, our wealth management business is very strong, as you know, in APAC and emerging markets.\n\nThat has impacted that clearly, as we said. If you look at the 6.4 billion, it's a combination in the third quarter of, you know, deleveraging and derisking, if you want to. So, about 3 billion comes from deleveraging and other like 2 billion is proactive, call it derisking, and then some additional deposit outflows. I think that's the right way to think about that one.\n\nMagdalena Stoklosa -- Morgan Stanley -- Analyst\n\nThank you very much.\n\nOperator\n\nThe next question comes from the line of Kian Abouhossein with J.P. Morgan. Please go ahead.\n\nKian Abouhossein -- JPMorgan Chase and Company -- Analyst\n\nYeah. Thanks for taking my questions. First question is on advisors and concern around advisor morale, clearly. But if I look at the numbers, they're down quarter on quarter in advisor numbers.\n\nI just wanted to see, is that driven by investment exits? Or what are you doing to retain advisors, i.e., do you have to write fixed contracts at this point? And how should we think about the trend into the fourth quarter in terms of advisors. And in that context, with clients, do you need to increase deposit rates in order to retain, i.e., should we think about NII changes in the wealth management business in terms of impact from deposit renumeration that you might have to give? And then the second question is just on funding. Clearly, funding costs have changed quite materially lately. And I just wonder how we should think about financing for this year and going forward, if there's any delay in financing from your perspective.\n\nUlrich Korner -- Chief Executive Officer\n\nOK. Thank you very much. Let me start, excuse me, with the number of relationship managers you are referring to on Page 12, actually. There's nothing, I would say from my point of view, unusual beyond.\n\nAs you know, we said last year that we would, you know, build on that number and enlarge that number over time. Also, that is in principle unchanged because we want to grow our business and therefore also over time enlarge that number. Having said that, if you look at, you know, this market environment and what it has done not only to us but to all, you know, in terms of market performance, etc., it's clear that, you know, we slow that down in line with the overall development of the results. And this is more driven here than by, call it, natural fluctuations and not being too fast to replace them, if not necessary, or build them further out.\n\nI think that's what's behind, no more.\n\nDixit Joshi -- Chief Financial Officer\n\nCan I take the -- I'll take the, you know, the second two questions. On, you know, funding and deposits, I guess, you know, somewhat interlinked, you know, funding costs this year, you know, we think are up about 160 million year on year. That's on a full year basis versus last year. You know, you've seen the uptick in spreads across the entire industry, including our name.\n\nAnd, you know, the idiosyncratic effects in October have resulted, you know, in wider spread in our name as well. Look, you know, today's announcements that we'll speak about, you know, during the strategy day, you know, the actions we're taking on the investment bank, you know, the low leverage and RWA footprint that we will run with, the reduction of our risk profile and exposure through the securitized products exit, you know, all of those items, I think, will be conducive to, you know, a tightening of spreads over time. And we think that would allow us to reduce our funding costs, you know, as we get through the through the transformation. In terms of, you know, deposit rates, you know, we would be looking to regain our market share, and we'd be competitive as you'd expect us to be.\n\nYou know, it's not lost on us that, look, you did see in the U.S., as a result of really liquidity in the system contracting, especially from central banks, that you did see large reductions in deposits in the United States as well. And I suspect that's something that, you know, we might see globally as well. So, in that environment, we'll remain competitive.\n\nKian Abouhossein -- JPMorgan Chase and Company -- Analyst\n\nMay I just follow up very briefly on the debt schedule? Can you -- clearly, that is changing with your restructuring. Can you give us an indication of how much debt you still want to refinance this year and next year?\n\nDixit Joshi -- Chief Financial Officer\n\nYes. Happy to. And, you know, you will see in the fixed income deck that was published as well, you know, we outlined, you know, our revised plans for this year. You know, we expect to do in the region of around 2 billion for the 81 through the course of the fourth quarter and in the region of 4.5 billion of holdco debt as well.\n\nLook, the strategy announcements that we have -- that we'll talk about later resulted in a freeing up of liquidity. And of course, you know, with the low-leverage exposure, we would find efficiencies in our funding through the next two or three years. And that should result in not just, you know, improve funding cost, but, quite frankly, just lower funding requirements in the capital market as well.\n\nKian Abouhossein -- JPMorgan Chase and Company -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nThe next question comes from the line of Jeremy Sigee with BNP Paribas. Please go ahead.\n\nJeremy Sigee -- Exane BNP Paribas -- Analyst\n\nGood morning. Thank you. I just wanted to follow up again on the outflows point. You sort of quite deliberately told us about outflows in October after the quarter opened.\n\nAnd I just wondered if you could give us a sense of scale of a similar run rate to what we had in 3Q, which was 6 billion, to maybe 2 billion in a month. Or is it sort of more or less than that? Any sense of scale would be really helpful. Thank you.\n\nUlrich Korner -- Chief Executive Officer\n\nWhat we have seen -- and thanks for the question, what we have seen, particularly at the beginning of October, certainly, a heightened level of outflows, which was very much based on what you have seen in the media and the press rumors. And let me say here very clearly, to the largest extent possible, factually incorrect rumors. But, obviously, that, you know, the overall situation that has come in and down very significantly in the last couple of weeks, actually.\n\nOperator\n\nThe next question comes from the line of Amit Goel with Barclays. Please go ahead.\n\nAmit Goel -- Barclays -- Analyst\n\nHi. Thank you. I'm not sure if maybe this is for the strategy presentation, but have you given the P&L contributions for the SPG group for this quarter and for prior periods? And in the release, I couldn't quite find it. I saw, obviously, overall noncore unit kind of P&L contribution.\n\nDixit Joshi -- Chief Financial Officer\n\nAmit, hi. Thank -- was there a second question, Amit? You broke up.\n\nAmit Goel -- Barclays -- Analyst\n\nNo, it was just one question. I was just curious if you've given SPG P&L contribution, you know, for the Q3 and the prior quarters.\n\nDixit Joshi -- Chief Financial Officer\n\nAmit, no. We haven't broken out the SPG contribution, and, you know, it's unlikely that we'll be breaking that out as well, you know, over the next quarter.\n\nAmit Goel -- Barclays -- Analyst\n\nOK. And just a second related question on that. Have you indicated anywhere any kind of gain or loss on the transaction?\n\nDixit Joshi -- Chief Financial Officer\n\nAmit, you'll hear more about that today during our strategy announcements. You know, we make a series of planning announcements, planning assumptions. And, you know, any gain or loss would be embedded into those assumptions. But again, we will be more fulsome in our discussion during the strategy day.\n\nOperator\n\n[Operator instructions] The next question comes from the line of Piers Brown with HSBC. Please go ahead.\n\nPiers Brown -- HSBC -- Analyst\n\nYeah. Good morning. Thanks for taking my question. First, come back to the topic of liquidity, but you did mention in the report that you breached certain legal entity, LCR requirements during the quarter.\n\nI wonder if you could just elaborate on that and whether you can also give us the balance, the HQLA balance at the end of the quarter. And possibly, if you have the number of October as well, that would be even better. I think that number at the end of Q2 is 230 billion roundabout. So, if you could update on that.\n\nThank you.\n\nDixit Joshi -- Chief Financial Officer\n\nSure, happy to. You know, increasingly we don't think about our liquidity in real terms because it's not the best indicator of our liquidity position as it doesn't provide the full picture. You know, as you know, we're derisking our balance sheet. And so, you know, NCOs are reducing.\n\nAnd as such, actually, we focused on the liquidity coverage ratio. You know, the LCR at the end of the third quarter was around 192%. And so, you know, it was pretty strong and probably at the highest end by standards. That, of course, has gone down, as we've indicated in our disclosures through the month of October.\n\nAnd that's partly, you know, related to the previous question that I got around funding from Kian, which is, you know, we will then, you know, commence funding, you know, subsequent to the announcements today. We had self-selected to be out of the capital markets during the month of October, given the strategic announcements that were coming today. And we'd be once again commencing, you know, funding activities. The second is just, you know, what you'll hear about later, and you'll see -- I won't go through all the detail right now, is that the leverage, exposure reductions, and balance sheet reductions that we have, you know, as part of our strategic announcements actually reduce our funding needs greatly over the next few years.\n\nOperator\n\nThe next question comes from the line of Daniele Brupbacher with UBS. Please go ahead.\n\nDaniele Brupbacher -- UBS -- Analyst\n\nYeah. Good morning, and thank you. I wanted to ask about this Slide 18 from the second quarter, where you showed the potential impact on revenues coming from chiefly curve space from before with the curve. If you could give us an update there.\n\nObviously, we had major moves in Switzerland, but the general update by currency would be super helpful. And probably, by -- I think you also broke it down by division, if I recall, correct? Thank you.\n\nDixit Joshi -- Chief Financial Officer\n\nDaniele, hi. Sure, happy to take that question. You know, when we look at -- you know, and we've given previous disclosure around this, but when we look at, you know, updated yield curves, you know, from most recently, you know, on a static balance sheet, you know, we'd expect, you know, in the region of around, you know, 1 billion Swiss francs net, you know, of uplift next year in NII. And I think that's a combination of two effects.\n\nYou know, the one is, you know, elevated rates compared to where we are. And the second is making some adjustments and being prudent around the size of deposit base as well. And that would be a 1 billion uplift next year.\n\nOperator\n\n[Operator instructions] There are no more questions at this time. Kinner, back to you for closing remarks.\n\nKinner Lakhani -- Head of Investor Relations and Group Strategy and Development\n\nVery good. So, thanks very much. We look forward to catching up later in the morning. And of course, in the meantime, if you have any questions, feel free to reach out to us in the IR team.\n\nThank you.\n\nUlrich Korner -- Chief Executive Officer\n\nThank you very much.\n\nDixit Joshi -- Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nKinner Lakhani -- Head of Investor Relations and Group Strategy and Development\n\nUlrich Korner -- Chief Executive Officer\n\nDixit Joshi -- Chief Financial Officer\n\nStefan Stalmann -- Autonomous Research -- Analyst\n\nMagdalena Stoklosa -- Morgan Stanley -- Analyst\n\nKian Abouhossein -- JPMorgan Chase and Company -- Analyst\n\nJeremy Sigee -- Exane BNP Paribas -- Analyst\n\nAmit Goel -- Barclays -- Analyst\n\nPiers Brown -- HSBC -- Analyst\n\nDaniele Brupbacher -- UBS -- Analyst\n\nMore CS analysis\n\nAll earnings call transcripts"
}