{
  "companyName": "SkyWater Technology, Inc.",
  "companyTicker": "SKYT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/skywater-technology-inc-skyt-q3-2022-earnings-call/",
  "content": "SkyWater Technology, Inc. (SKYT -2.07%)\nQ3 2022 Earnings Call\nNov 07, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, good afternoon. My name is Abby, and I will be your conference operator today. I would like to welcome everyone to the SkyWater Technology third quarter 2022 financial results conference call. Today's conference is being recorded.\n\n[Operator instructions] Thank you. And I will turn the conference over to Claire McAdams, investor relations for SkyWater. Ms. McAdams, you may begin your conference.\n\nClaire McAdams -- Investor Relations\n\nThank you, operator. Good afternoon, and welcome to SkyWater's third quarter fiscal 2022 conference call. With me on the call today from SkyWater are Thomas Sonderman, president and chief executive officer; and Steve Manko, chief financial officer. I'd like to remind you that our call is being webcast live on SkyWater's investor relations website at ir.skywatertechnology.com.\n\nThe webcast will be available for replay shortly after the call concludes. On our IR website, we also have posted an investor slide presentation to accompany today's call. During the call, any statements made about our future financial results and business are forward-looking statements. These forward-looking statements are subject to risks and uncertainties that could cause our actual results to differ materially.\n\nFor a discussion of these risks and uncertainties, please refer to our filings with the Securities and Exchange Commission, including our earnings release filed on Form 8-K today and our fiscal 2021 10-K filed on March 10. All forward-looking statements are made as of today, and we assume no obligation to update any such statements. During this call, we will discuss non-GAAP financial measures. You can find a reconciliation of these non-GAAP financial measures to GAAP financial measures on our earnings release, as well as in our Q3 earnings presentation, both of which are available on our investor relations website.\n\nAnd with that, I'll turn the call over to Tom.\n\nThomas Sonderman -- President and Chief Executive Officer\n\nThank you, Claire, and good afternoon to everyone on the call. Today, we are pleased to report record quarterly revenue of over $52 million, which reflects 10% sequential growth from Q2 and approximately 50% growth over Q3 of last year. Our ATS business was a primary driver of our growth in Q3 with sales up 18% sequentially and 57% year over year, reflecting the continued momentum we are gaining with multiple key customers in 2022. Wafer Services sales were similar to Q2 and up 36% year over year.\n\nWith quarterly revenues now exceeding the $50 million level, our gross margin performance in Q3 demonstrates that we are delivering significant flow through to margins and profitability on the incremental revenue we've achieved since Q1. As we've been communicating all year, with ATS being the driver of our incremental revenue growth, our revenue flow-through to gross margin is well above 50%. In fact, we significantly exceeded our gross margin forecast for the quarter, as Steve will detail in his prepared remarks. We also have been communicating each quarter this year that the improved pricing terms with our legacy wafer services customer raised our quarterly revenue baseline from which to grow, and we have been delivering on sequential quarterly improvements in revenue despite the weakening macro environment.\n\nWith our strong performance in Q3 and current outlook for Q4, we expect we will achieve or exceed our long-term revenue growth target of 25% this year. We are very pleased with the progress made in Q3, achieving sequential improvement in our revenue pipeline, increasing fab efficiency and output and significantly improving gross margin. A highlight of Q3 was not only did we turn the corner to generate positive adjusted EBITDA, but it was a very healthy $3.8 million equal to 7% of revenue. With this level of performance against our stated objectives this year, we are delivering on our promises for better predictability in our results, increased visibility and more consistent execution toward our stated financial and business objectives.\n\nSince our last call, we've made several important announcements that build upon the momentum we've been gaining throughout 2022, strengthening the foundation for consistent quarterly revenues above the $50 million level and further establishing SkyWater as a critical player in the future of our country's semiconductor supply. These important announcements included the Rad-Hard Phase 2 award progress on multiple fronts toward CHIPS Act funding for the Purdue fab and other growth projects, the Build Back Better Regional Challenge award funding our expansion in Florida, as well as a number of important partnerships and collaborations announced with Google, the National Institute of Standards and Technology, NanoDx, Trusted Semi and more, which brings me to a discussion on our primary strategic growth areas, starting with extreme environment microelectronics. Throughout 2022, we have been reporting on the progress and achievements in our Rad-Hard program, with the ongoing successes in Phase 1 leading up to the anticipated Phase 2 award. On our August earnings call, we indicated that the Phase 2 award was imminent, and we are pleased to make this important announcement in September.\n\nValued at nearly $100 million, this award demonstrates the competitive strengths of RH90 platform and the commitment of the DoD to continue its significant investment in SkyWater as we successfully execute the program. This award funds the productization and qualification phase, which will continue for the next two years leading up to volume production. Like the additional Phase 1 award announced last quarter, the Phase 2 award has been funded and launched and was a significant driver of our sequential revenue growth in Q3, as well as the additional more modest uptick in sales expected in Q4. Last quarter, I focused on several aspects of the RH90 platform that make our technology the strongest option available for strategic extreme environment applications.\n\nDuring the RH90 base program phase, we work with our partners to firmly establish key components of the growing RH90 ecosystem. This included an initial PDK, a multi-project wafer, or MPW shuttle capability, coupled with our early access partner program and the engagement with IP providers to develop SRAM compilers and the embedded FPGA IP needed to make designing and RH90 more efficient for our partners. The next phase is a rigorous effort that includes radiation and reliability testing and further development of IP design libraries that will enable our design and manufacturing ecosystem partners to produce processors, security engines, memory devices interface ASICs and other mission-critical strategic solutions. Last month, we were pleased to host Congresswoman Betty McCollum and the DoD's Undersecretary of Defense for Research and Engineering, Ms.\n\nHeidi Shyu, at our headquarters in Bloomington. This discussion focused on our company's value proposition for both the DoD and commercial technologies and how we are leveraging public-private partnerships in several states and on multiple programs. We discussed how our success with the RH90 program is a prime example of our differentiated approach for strengthening the domestic semiconductor manufacturing ecosystem. Also last month, we announced that the DoD is funding $12 million from the Phase 1 award announced last quarter for further IP ecosystem development, highlighting the importance of our partnerships with Trusted Semiconductor Solutions and Case.\n\nBoth are critical collaborators for the evolution of RH90 platform with Trusted Semi driving the development of the PDK and associated IP libraries and Case providing their qualification expertise for DoD systems, both of which we expect to accelerate productization for RH90 platform, ensuring it meets the rigorous demands of mission-critical extreme environment applications. As I detailed last quarter, we also have multiple programs to complement RH90, allowing us to provide solutions into less stringent defense and commercial applications. These include the growing pipeline for ROICs, our readout ICs for infrared imaging and our planned expansion into low earth orbit satellite solutions. All these announcements and developments demonstrate the importance that public-private partnerships play toward furthering our unique semiconductor manufacturing model, both commercially and for the U.S.\n\ngovernment, which brings me to an update on our strategies related to the CHIPS Act, including our partnership with Purdue University and the State of Indiana. I'll start with the recent appointment of Brian Lenihan as our vice president of government relations. Brian is based in Washington, D.C. and brings extensive public policy experience, having served in a variety of public and private roles within the government affairs realm.\n\nBrian is charged with further deepening Sky SkyWater's relationships within all levels of government. Last quarter, we reported on our historic partnership with Purdue and the State of Indiana to build a new 300-millimeter semiconductor fab on Purdue's campus. In September, I attended Purdue's Annual Career Day with multiple federal and state government officials to discuss the role of universities like Purdue in creating the workforce of the future, which is a crucial component of CHIPS Act funding. My visit included a live and virtual keynote to over 600 engineering students to discuss SkyWater's unique position in the semiconductor industry and our future plans in West Lafayette.\n\nLast month, we returned to Purdue to host an executive roundtable with customers and suppliers, discussing how we intend to leverage our unique technology as a service business model to create long-term strategic partnerships in Indiana that will enable synergistic innovation, fast track secure manufacturing, strengthen domestic supply chains and foster national security. With the Purdue fab serving as a cornerstone of our country strategy to enable the resurgence of semiconductor manufacturing in the United States, we believe that we are uniquely positioned to leverage all four pillars of CHIPS funding as we continue to build momentum not only in Indiana, but also in Minnesota and Florida. This August, at our Bloomington headquarters, Senator Amy Klobuchar held a press conference highlighting the importance of key technology providers in Minnesota. Senator Klobuchar has long led efforts to boost American economic competitiveness and self-sufficiency and our visit to Bloomington was yet another proof point that we are a critical player in our nation's semiconductor resurgence and well positioned to be a prime recipient of future CHIPS Act funding.\n\nWhich brings me to our strategy for continued growth and our heterogeneous integration operations in Florida and the exciting developments announced since our last earnings call. First, in August, we hosted Senator Marco Rubio at our SkyWater Florida facility to discuss the importance of IP protection and secure semiconductor manufacturing in the United States. Then in September, we announced a $36 million grant from the Department of Commerce to expand our heterogeneous integration facility in Kissimmee in partnership with Osceola County and BRIDG. This was an incredible accomplishment for our Florida team and partners and provides the vast majority of funding required to expand the capabilities and capacity at our Florida fab.\n\nAs the only semiconductor company recipient of the EDA's Build Back Better Regional Challenge, this award was another example of our unique ability to leverage public-private partnerships to expand domestic semiconductor production. While not directly related to the CHIPS Act, being the only semiconductor recipient of the Build Back Better Challenge is yet another illustration that we're uniquely positioned to receive additional government awards. Based on our demonstrated success and prominent profile building between Senator Klobuchar's visit to Bloomington, continued momentum building in Purdue, Senator Rubio's visit in Kissimmee and our strong relationship with the Departments of Commerce and Defense, we believe we are in excellent position to be an essential player in the rebirth of the semiconductor industry in our country. As a reminder, there are three elements of our technology road map underway in Florida, IBAS, Deca and our work with Adeia.\n\nFor IBAS, we completed Phase 1 of the government-funded interposer technology development program, establishing a proven capability to support BRIDG interposer fabrication to strengthen national security for critical emerging technologies. This program has now moved into the Phase 2 and Phase 3 stages of platform development with completion expected in early 2023. We are continuing our preparations to offer Deca's M-Series fan-out wafer level packaging technology, working with external equipment and service suppliers to support the fabrication of our initial demonstration vehicles. Working with Deca, we have also completed installation of our adaptive patterning engine, which is a key enabling capability for the Deca process technology.\n\nAs part of our Build Back Better award, we expect to be placing orders for our first key pieces of equipment within the next few months to support the M-Series capability in Florida. We continue our technology transfer efforts with Adeia for ZiBond and DBI hybrid wafer bonding technologies. In addition, we are working with an alpha customer on our first hybrid bonding ETS engagement. Demand for domestically sourced hybrid bonding technology solutions to enable more compact and powerful heterogeneously integrated micro systems continues to be extremely high, and we expect additional customer engagements in Q4 and beyond.\n\nNow, I'll turn to our strategic growth initiatives and biohealth and high-performance connectivity. In August, we and our partner, NanoDx, announced the first commercially ready nano biosensor to yield a protein response. This is a critical step toward commercializing a revolutionary new product for on-site diagnosis of traumatic brain injuries. Additionally, we have several other biohealth customers, all of which continue to receive development funding and strong customer interest.\n\nWe believe the biohealth market remains an important growth area for SkyWater, and we look forward to discussing it in more detail in upcoming calls. A series of innovative technology engagements are driving new product introduction and expanded platform capabilities in the connectivity space. Our work in collaboration with Google to create an open source derivative of the 90 nanometer FD-SOI technology is underway and is expected to trigger a new wave of design activity as it has with our existing SKY130 open source initiative. The new offering will provide a differentiated domestically sourced high-performance 200-millimeter platform that we expect to generate significant commercial interest for a range of low-power industrial embedded and automotive applications.\n\nIn addition, we believe the recent announcement highlighting the NIS Google collaboration for open source design for researchers targeting these types of solutions will further accelerate the adoption of these platforms. Finally, I'm pleased to announce a recent milestone for one of our emerging memory solutions. Weebit's ReRAM test chips have been fully integrated with SkyWater's S130 platform and are now entering the qualification phase. This is an important step toward establishing a performance differentiating next-generation memory technology onshore for a broad range of IoT, power management and advanced computing architectures.\n\nFor 2022, our considerable progress on revenue growth in the first nine months substantially derisks our 25% growth objective. This is supported by important program design wins and awards, including the recent RH90 Phase 2 award and the additional Phase 1 award, which are driving a sizable portion of our growth in the second half of this year. Therefore, we expect we can meet or potentially exceed our long-term revenue growth target of 25% in 2022, while we build a strong pipeline for continued robust growth in 2023 and beyond. Furthermore, now that we have demonstrated significant gross margin improvement in 2022 and have turned the corner to positive EBITDA, we expect to continue executing upon the improvements necessary for sustained profitability as we achieve incremental revenue growth above Q3 levels in the current quarter.\n\nWhile concerns around overall macro weakness and specific downward revisions and semiconductor industry demand forecasts are apparent, SkyWater remains relatively decoupled from these trends. Last quarter, I detailed how we believe our business is uniquely buffered from industry downturns and that two thirds of our revenue comes from R&D budgets. On today's call, I have communicated multiple examples to demonstrate SkyWater's prominence in the future of our country's semiconductor ecosystem, which we expect to provide the foundation for above-industry growth in years to come. I'll now turn the call over to Steve for more information on SkyWater's financial and operational performance in the third quarter.\n\nSteve?\n\nSteve Manko -- Chief Financial Officer\n\nThank you, Tom. Total revenue for the third quarter of 2022 was $52.3 million, which was up 10% from Q2 and up 49% from the third quarter of last year. Advanced Technology Services, or ATS, revenue drove the majority of the growth and was $35.2 million, up 18% from Q2 and up 57% from Q3 of last year. Wafer Services revenue was $17.2 million, down slightly from Q2 and up 36% from Q3 of last year.\n\nThe increased revenue levels in both ATS and Wafer Services continue to support our revenue growth targets for 2022. The higher level of legacy wafer services business is providing a higher base from which to grow, and we started several new products and designs with our seven Wafer Services customers. We also continue to expand our current ATS programs, leading to increased ATS revenues in the quarter. Importantly, these incremental and more profitable customer programs are resulting in a significant flow through to gross profit.\n\nGAAP gross profit increased significantly in Q3 to $8.3 million or 15.8% of revenues. This reflects a total cost of revenue decline to $44 million in Q3, which benefited from a onetime cost reversal of $800,000. This reversal was for an estimated expense we had been recording through 2022 related to insurance on our employee benefit program, which was refunded in Q3 and which positively impacted gross margin by 140 basis points. On a non-GAAP basis, which adjusts for the impact of episodic tool sales, equity-based compensation and for a start-up costs, gross margin improved to 16.8%, significantly higher than our expectations even after subtracting the nonrecurring reversal benefit of 140 basis points.\n\nOn an ongoing basis, you should look at our Q3 non-GAAP gross margin performance as improving to 15.4%. Last quarter, we indicated that our gross margins would likely be limited to around 10% for the second half of this year, given the inflationary cost headwinds, the last stage of our hiring ramp toward full operator headcount in our Minnesota fab and the expected margin profile during the initial phases of the recent Rad-Hard awards. In Q3, we exceeded our gross margin forecast primarily due to continued improvements in fab efficiency, the commencement of Phase 2 of the Rad-Hard program, which began earlier in the quarter than expected and execution of our cost reduction plan. Like Q2, we achieved a higher level of overall ATS wafer moves in the quarter, which allowed us to achieve better fab utilization and margin performance.\n\nWe were also progressing in our efforts to stabilize fab operations, which includes completing our additions to manufacturing headcount in Q3, adding more automation and increasing tool availability, all of which resulted in increases in fab efficiency and which makes moving wafers through the fab steadier and more predictable. We also started to see the benefit of our cost reduction plan in the quarter as we were able to reduce our spend on outside services given our achievement of target headcount in certain areas of the organization, as well as a decrease in our nitrogen expenses as our upgraded nitrogen plant was fully operational during the third quarter after being shut down in the second quarter of 2022 for upgrades. As expected, gross margin also benefited from a more favorable revenue mix, given that ATS revenue increased to 67% of sales. The resulting flow through to gross margin on the incremental revenues above the mid-$40 million breakeven level was well above 50%.\n\nTo illustrate how our model reflects such high level of operating leverage and flow through, last quarter, I broke out our cost structure into three major components. First, we have a legacy wafer services business, which represents the majority of our fab utilization, absorbing most of our fixed cost, but generating little margin. Our ATS programs, on the other hand, are quite profitable as we move more and more ATS wafers through the fab, that business contributes an increasing amount of gross profit dollars. While ATS R&D wafer volumes are relatively low compared to the overall fab output, they generate far more revenue per wafer, which is resulting in significant gross margin accretion as we ramp our growing pipeline of ATS programs.\n\nThe third component of our cost structure relates to the significant amount of unabsorbed fixed costs that reflect the investments we are making for the long-term growth of the company. As we build out our Rad-Hard capabilities in Minnesota and heterogeneous integration capabilities in Florida, both of which are expected to drive significant future revenue growth. Our total cost of revenue in Q3 included approximately $4.6 million of unabsorbed costs. Depreciation related to the Rad-Hard program was $1.4 million and SkyWater Florida incurred $3.2 million of cost of revenues in Q3.\n\nAdditionally, as a reminder, our acquisition accounting related depreciation of about $4 million per quarter will phase out beginning in early 2024. So as you consider these three components of our cost structure, Wafer Service is keeping the fab full, ATS adding significant accretion to margin as we increase the volume of R&D wafers moving through the fab and $8 million to $9 million per quarter of costs that will either phase out or become absorbed as we grow these programs in the next few years, you can see how we quickly ramp gross margins toward our long-term targets, and we expect Q4 gross margin performance to be at a similarly strong level as Q3. Moving now to operating expenses. On a GAAP basis, operating expenses of $13.4 million were relatively consistent from Q2.\n\nOn a non-GAAP basis, which excludes equity-based compensation and Florida start-up costs, operating expenses were $12.1 million compared to $11.5 million in Q2. The increase over Q2 was fairly evenly split between R&D and SG&A. Given the significant improvement in gross margin and relatively consistent operating expenses, adjusted EBITDA turned positive in Q3, as we indicated last quarter and was favorable to forecast at $3.8 million. We expect continued strong EBITDA ahead for Q4.\n\nInterest expense was $1.3 million in the quarter, and with no tax benefit, the GAAP net loss was $0.17 per share and the non-GAAP net loss was $0.13 per share. Now, I'll turn to the balance sheet. We ended the quarter with $9.3 million in cash and cash equivalents. Total debt outstanding was $77.8 million, including $40.7 million on our revolver and $37.1 million for our variable interest entities, excluding unamortized debt issuance costs.\n\nSince our last call, we have put into place additional funding alternatives at our disposal as we continue our plans for growth. In August, we filed a universal shelf registration statement for up to $250 million. Now, that we are over a year past the IPO, we view this filing as part of our holistic approach to capital planning and is one component of various alternatives to fund strategic growth initiatives. We see this shelf as increasing the funding flexibility available to us with our current capitalization structure and enabling us to be nimble and act quickly when strategic opportunities arise.\n\nIn September, we commenced an at-the-market program for up to $100 million under the shelf, and we sold $2.7 million of equity through that program at an average price of $9.92 per share in Q3. On the debt side, apart from the $37.1 million of debt for our variable interest entities, our primary facility is a revolver that was put in place nearly two years ago in December 2020 when we were a private company. Now, that we are a public company with access to the capital markets, have grown the assets on our balance sheet through additional tool and equipment acquisitions and increased our accounts receivable as a result of our increased revenues and return to positive adjusted EBITDA, we are actively engaged with several lending institutions in an effort to refinance and expand our credit facilities given our larger borrowing base. As you update your SkyWater models, the following is some additional color for various components of our P&L for the remainder of fiscal 2022 and early 2023.\n\nWe expect continued incremental revenue growth in Q4 will be primarily driven by the Rad-Hard program, as well as other ATS programs contributing to our revenue momentum, albeit with the uptick expected to be more modest than what we reported in Q3. This reflects the impact of sweep funding at the end of the government's fiscal year that resulted in strong sequential growth in Q3. As you look at 2023, you should continue to model a similar seasonality profile. With our current visibility, we expect the first quarter of 2023 will show strong year-over-year growth.\n\nHowever, on a sequential basis, we currently expect Q1 2023 will be similar to Q4 2022. Quarterly research and development expenses are anticipated in the $2.3 million to $2.5 million range, excluding stock-based compensation. Quarterly SG&A expenses are expected to be approximately $10 million to $10.4 million, excluding stock-based compensation. We anticipate annual stock-based compensation to be approximately $9 million for fiscal 2022 and continue at that run rate into 2023.\n\nTotal depreciation for the year is expected to be approximately $26 million to $28 million, of which $6 million to $7 million is related to the Rad-Hard program and approximately $15 million is associated with the acquisition purchase accounting. In cost of revenues associated with our Florida operations, we expect approximately $100,000 in Q4 start-up costs after $700,000 recorded year-to-date. We expect total investments in Florida cost of revenue will continue to average approximately $2.5 million per quarter. We expect neutral to no benefit from our tax assets in 2022 or 2023.\n\nWith that, I'll turn the call back to Claire, and welcome your questions on SkyWater.\n\nClaire McAdams -- Investor Relations\n\nThank you, Steve. Our upcoming investor activities include the Craig-Hallum Alpha Select Conference next week, the New York City Summit on December 13 and the Needham Growth Conference in January. Please visit the investor relations section of our website for other upcoming presentations. Operator, please open the line for questions.\n\nOperator\n\n[Operator instructions] And we will take our first question from Raji Gill with Needham & Company. Your line is open.\n\nRaji Gill -- Needham and Company -- Analyst\n\nYes. Thank you and congratulations on great results and positive momentum across all the metrics. That's great to see. So Steve, just a question on the cost structure breakout and that's really helpful to understand.\n\nSo my first question is really on the unabsorbed fixed costs for some of the long-term investments that you outlined, whether it's for Minnesota or for Florida and the Rad-Hard facility. What time frame do you think that those fixed costs will be offset either by the current volume of revenue that you see now and then kind of the new revenue that you're anticipating from the Florida facilities is going to be basically absorbed in sometime in the first half of 2023? I'm just curious how those fixed costs ultimately will get absorbed and you could really see even more leverage in the gross margin model?\n\nSteve Manko -- Chief Financial Officer\n\nYes. Sounds good. And thanks for the question. I'll adjust it in two ways.\n\nI'll talk about the amount related to the RH90 program, and I'll have Tom talk a little bit more about how that will be absorbed as the SkyWater Florida operations go and heterogeneous integration. So the way that we look at it, we look at the depreciation that we're incurring right now related to the RH90 program, we look at that as not being absorbed right now. While there is some development work that's currently taking place, we separate that from the manufacturing cost when we put the depreciation as a manufacturing cost. We see that being absorbed starting in 2025 as we talk about getting RH90 programs into production at that point in time.\n\nThat's when you can expect to see -- and we believe that those costs will start to be absorbed. When it goes to productization and manufacturing in 2025 on RH90. I'll let Tom talk about SkyWater Florida and heterogeneous integration.\n\nThomas Sonderman -- President and Chief Executive Officer\n\nYes Raj, the Florida team continues to execute well on multiple fronts, three of them really creating enabling technology around interposers, fan-out and hybrid bonding. All those are still very much in an ATS mode. The team is also preparing to go into production. As we talked one of our biohealth customers continues to move toward their production ramp, which we believe will happen sometime over the next 12 to 18 months.\n\nThat, of course, will be a driver of some of that absorption. The other is as the fab begins to exercise more of the ATS engine, you'll see some of that cost be absorbed just because there'll be more activity going on, which, of course, generates more revenue. As we always talk, we use the currency of activities to define how our business is running, and we're continuing to see increased activities in the Florida operation, which, again, will help us absorb some of the fixed costs as we prepare to go into more volume production, primarily in the 2024 time frame.\n\nRaji Gill -- Needham and Company -- Analyst\n\nI appreciate that. And for my follow-up. Thanks for the details on the CHIPS Act. Wondering how we should think about capex in relationship to the CHIPS Act? You're getting grants to expand the Florida facility.\n\nI think you mentioned the $36 million grant. You're getting funding, I believe, from the Minnesota fab to help expand there. And then, obviously, you have a longer-term build-out with Indiana. So you have funding coming from the government to help expand these facilities, which ultimately are going to generate volume and revenue for you at which the capex is being helped by the U.S.\n\ngovernment. So just curious, how should we think about the CHIPS Act relative to kind of your internal kind of capex projects?\n\nThomas Sonderman -- President and Chief Executive Officer\n\nYes. So first on the Florida Build Back Better Regional Challenge, that is not at all tied to the CHIPS Act. So that has been awarded. That is in flight.\n\nThat's $36 million of government investment. We also complement that with $9 million of our own investment. So that's a cost share model. We expect that to materialize over the next 24 to 30 months depending upon, again, when tools arrive, when projects get initiated.\n\nAs far as the Minnesota facility, that would be the one that would go after initial CHIPS funding the most aggressively because it is an existing facility, we would look at adding capacity. But all that has to be defined and has to be awarded. We don't expect any of the awards to start until sometime mid next year. The Department of Commerce is saying February is when some metals will be due.\n\nSo you can look at Florida, taking immediate advantage of the Build Back Better grant, but that's independent of CHIPS. And then, Minnesota and then even further out with Purdue is all going to be gated on when the CHIPS proposals are being submitted, being approved and begin to move into execution. As I've also said, there's four elements to CHIPS. There's the building of fabs, which is $39 billion.\n\nThere's $2 billion tied to Commons. The Commons program has been launched by the Department of Defense. We are actively involved with that. This is to create innovation centers around the fab -- lab to fab concept.\n\nAnd then, there's $11 billion for R&D and innovation. This is the National Semiconductor Technology center concept, which $5 billion is tied to advanced packaging and heterogeneous integration. So I believe we're well positioned for both of those. And then, the last is the investment tax credit, which is 25% for all equipment procured starting in the next fiscal year, which began in October, so that could be an immediate benefit for SkyWater as well.\n\nRaji Gill -- Needham and Company -- Analyst\n\nThank you.\n\nOperator\n\nAnd we will take our next question from Krish Sankar with Cowen. Your line is open.\n\nSteven Chin -- Cowen and Company -- Analyst\n\nHi. Thanks for taking my question. This is Steven calling on behalf of Krish. First off, congratulations on the strong results and also the strong execution in the quarter.\n\nThe first question I wanted to ask about either Tom or Steve is related to the RH90 program. So again, I understand that you guys are embarking on this Phase 2 $100 million program with the DoD now which trouble getting a few details here. First just going back to the Phase 1 portion, has the funding for that for Phase 1 have been completed now? Or is there still another quarter or two of funding from that desk still making its way through the P&L? And also related to Phase 2, as it progresses over the next two years, I think you mentioned until production revenues, should we think about that $100 million for Phase 2 being spread decently over the next eight quarters? Or is there a certain ramp profile to that spending?\n\nThomas Sonderman -- President and Chief Executive Officer\n\nYes. So I'll start, and Steve can add additional color. Yes, the original program was $170 million total award for the development phase. All of that has been consumed except for around $33 million.\n\nWe announced a $27 million option, what we call the option grant for that first award. This is tied to two programs we've announced. One is Google for $15 million. That's the open source initiative and then another $12 million for IP development.\n\nThis is with our partners. So Google is one partner, Trusted Semi Solutions and Case are the other partners. And this is all around creating the design ecosystem for the RH90 platform. In the case of Google, it's a derivative of that Rad-Hard platform.\n\nAnd then, as far as the $99 million, this was for the second phase. So first phase was development. Second phase is productization and qualification. There's a base program amount and then there's a series of options, again, much like the first award, the way to model that, I'll let Steve provide more detail, but I wouldn't say it would be something you just linearize over the next two years.\n\nIt's going to have ebbs and flows. We were able to execute it very quickly once the award was received because a lot of that work was already in progress because we've been doing the development for multiple years now. So the movement into productization is really about getting to a frozen process of which then you go through extensive qualification and continued work toward yield entitlements so that when we begin to exit '24 and going to '25, we can begin to actually start producing product on this platform. And that would be going away from ATS derived dollars to Wafer Services dollars.\n\nSteve, anything to add on the lumpiness in terms of the RH90 funding?\n\nSteve Manko -- Chief Financial Officer\n\nYes. Just the real world doesn't work that easy. We can just think I didn't evenly divide it over the next eight quarters. There's going to be a component of tool purchases that come through, and some of that $99 million will go to tool purchases.\n\nWe'll also be using some subcontractors just like we did in Phase 1 of the program. So at certain times and quarters where we're getting two different phases, there could be other parties that are engaged in moving faster, which could increase our revenue and cost for that quarter. But it is going to be over the course of the next, what we'll call, two years in a quarter, all the way up into production in 2025. And a portion of that, like I mentioned, we'll be using subcontractors and tool vendors with that $99 million of funding as well.\n\nSteven Chin -- Cowen and Company -- Analyst\n\nGreat. Thank you so much for that color. My second question is related to opex. So Steve, I think so much for the guidance for the current quarter.\n\nJust kind of wondering, in terms of your current staffing levels, would you say that you're currently, I guess, appropriately sized, given all of the revenue opportunities that you have for ATS and Wafer Services? Or is more head count would be needed given the current growth outlook going into next year?\n\nSteve Manko -- Chief Financial Officer\n\nYes. We still believe that there is opportunity for significant growth going forward in 2023. We've talked about some of the challenges that we've had, but also the positive results in overcoming those challenges. Like we mentioned, from an operator standpoint in our manufacturing facility, last quarter, we were able to achieve close to our targeted headcount for those operators.\n\nBut we also talked about some of the challenges with ongoing maintenance technicians in our facility. So we still do have open requisitions for maintenance techs within organization, and I expect that to continue over the course of 2023. Given our strong ATS pipeline, we will be recruiting and looking to hire additional engineers into our organization. Again, those are typically revenue-generating engineers.\n\nSo they typically have a really nice return on investment. It will just be more so be a competition for talent and how quickly we can hire those engineers over the course of 2023 and to keep growing our business and not only growing our business but to move faster with our current programs that we have.\n\nThomas Sonderman -- President and Chief Executive Officer\n\nYes. And I would just say that the attrition has stabilized, we're below our levels pre-IPO. And that's really important because now as we hire people, we're getting them trained, they're wanting to stay at SkyWater and our ability to get to what we call employee effectiveness is the cycle time is getting much shorter because we've also been investing in how we do training, making more effective and allowing people to move through that process at a faster pace than previously. So overall, we're feeling really good about where we're at with the headcount situation.\n\nSteven Chin -- Cowen and Company -- Analyst\n\nGreat. Thanks, Tom. Thanks, Steve. Congrats again.\n\nThomas Sonderman -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nWe will take our next question from Harsh Kumar with Piper Sandler. Your line is open.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nYeah. Hey, guys. Let me add my congratulations as a lot of this increased momentum here recently. Guys, I had a quick question.\n\nYou guys talked about increased momentum with customers. We're seeing some of that in the numbers. Could you talk about nongovernment activity here? How your sort of commercial customers are responding to what's going on at the fab? And are they also increasing the activity along with the government? And then, I had a follow-up.\n\nThomas Sonderman -- President and Chief Executive Officer\n\nYes, great question and good to hear your voice, Harsh. The way I would put it is the government is just APs. We have multiple development programs. Again, we've talked about over 50 active ATS engagements.\n\nAnd a large percentage of them actually are nongovernment. We have the biohealth space we've talked about, the connectivity space, also the high-performance computing space. There's a lot of energy around and having been in the industry as long as I have, you see these ups and downs. And one of the things that always happens is when you go into these contractions, companies that want to get new products to market hit the accelerator.\n\nAnd that way, they're positioned for the next upswing. And that's exactly what we're seeing. The other is -- and Steve has talked about this before, is each of these ATS programs tend to start out at a relatively small spend rate and then they ramp as you get into the kind of two years and beyond time frame. And that's exactly what we're seeing is multiple programs ramping in parallel.\n\nThat's why we continue to hire more engineers that allows us to accelerate those programs. And then, as I've also talked about, we've I've been working very hard as a company to integrate our ATS and wafer services business so that they run seamlessly inside the fab. And the level of activities that we can generate for ATS doesn't really affect our overall wafer output, but it significantly drives our revenue and profitability. And that's really what we've been focused on is making those programs move faster.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nThat was a great update. As a follow-up, the world is changing. There's CHIPS Act money coming, this increased geopolitical tension as a result. I guess, foundries in the U.S.\n\nare seeing a lot of attention and affection from the government. So this, along with what's going on in the commercial activity, if I was to just ask you how comfortable are you with the 25% growth for 2023 as well? Do you feel that with all that's going on, you're in a relatively stable position from here on as you kind of sound like you're kind of footing here?\n\nThomas Sonderman -- President and Chief Executive Officer\n\nYes. So we're cautiously optimistic with the business as we're running right now, but we're also cognizant of the fact that we're in an inflationary environment. There's a lot of unpredictability. You just outlined geopolitically with the economy.\n\nAnd so, we're going to continue to execute the business at the pace we've been executing. We believe we have a lot of committed customers that want to continue to grow with us. That's both our historical customer Infineon and some of our new volume customers, as well as all of our ATS partners. And obviously, we're not going to provide specific targets at this point, but I will say that we're optimistic about where we sit as a company and most importantly, our ability to really fine-tune this model that we're creating with this blended R&D, volume manufacturing capability.\n\nAnd I think it's going to put us in a very nice position as the decade unfolds and a lot of the chips dollars begin to become realized. But it's important to note that for the next couple of years, we aren't expecting any chips dollars. Our plan of attack is to execute the business we have. But I think when you look at CHIPS that just derisk the long term because there is a commitment within our country now to do more.\n\nAnd I think our model is uniquely positioned to take advantage of that.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nVery nice guys. Thank you and congratulations again.\n\nOperator\n\nAnd we will take our next question from Mark Lipacis with Jefferies. Your line is open.\n\nMark Lipacis -- Jefferies -- Analyst\n\nHi. Great. Thanks for taking my question. Steve, maybe for you.\n\nCould you describe the accounting treatment that you would anticipate applying for -- in the event that you receive grants or funding or investment tax credits? Does this all go against capex and then you have assets put on your balance sheet at a lower level and your depreciation is lower. Is that the right way to think about it? Or is there different treatments for different relief that you get to the CHIPS Act?\n\nSteve Manko -- Chief Financial Officer\n\nMark, good question. I would say it's pretty open-ended right now. Really the only clarity that we would have would be anything that we would do, what I'll call, somewhat separate from ships on the 25% tax credit. That one is a little bit more tangible on how that goes.\n\nFrom there, though, it depends on how the monies flow and what other partnerships we have on really financing whatever growth would come through CHIPS, whether we're talking about doing something to our current location in Minnesota or Florida or something different with a larger scale like we have planned for Indiana. So I would say, at this point in time, it's really hard to say specifically how that accounting would flow and the timing of when that would occur, given that we're still trying to understand how the money flows, what partners we would use and what the construct of those contracts would truly look like at this point.\n\nMark Lipacis -- Jefferies -- Analyst\n\nFair enough. OK. Thank you. That's all I have.\n\nSteve Manko -- Chief Financial Officer\n\nThanks, Mark.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nClaire McAdams -- Investor Relations\n\nThomas Sonderman -- President and Chief Executive Officer\n\nSteve Manko -- Chief Financial Officer\n\nRaji Gill -- Needham and Company -- Analyst\n\nSteven Chin -- Cowen and Company -- Analyst\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nMark Lipacis -- Jefferies -- Analyst\n\nMore SKYT analysis\n\nAll earnings call transcripts"
}