{
  "companyName": "Inovio Pharmaceuticals",
  "companyTicker": "INO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/inovio-pharmaceuticals-ino-q3-2022-earnings-call-t/",
  "content": "Inovio Pharmaceuticals (INO 1.96%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day and welcome to the Inovio third quarter 2022 results conference call. [Operator instructions] Please note that this event is being recorded. I would now like to turn the conference over to Thomas Hong. Please go ahead sir.\n\nThomas Hong -- Manager, Investor Communications\n\nThank you. Good afternoon. And thank you for joining the Inovio's third quarter 2022 financial results conference call. Joining me on today's call are Dr.\n\nJacque Shea, president and CEO, Mr. Peter Kies, chief financial officer, and Dr. Michael Sumner, chief medical officer. We also have other members of Inovio's leadership here with us today who will be part of our Q&A Session.\n\nToday's call, we will review our corporate and financial information for the quarter ended September 30, 2022, as well as provide an update on our efforts to develop our DNA medicines platform. Following prepared remarks, we will conduct a question-and-answer segment. During the call, we will be making forward-looking statements regarding future events and the future performance of the company. These events relate to our business plan to develop Inovio's DNA medicines platform, which include clinical and regulatory developments and timing of clinical data readouts, along with capital resources and strategic matters.\n\nAll of these statements are based on the beliefs and expectations of management as of today. Actual events or results could differ materially. We refer you to the documents we file from time to time with the SEC, which under the heading risk factors identify important factors that could cause actual results to differ materially from those expressed by the company verbally, as well as statements made within this afternoon's press release. This call is being webcast live, and a link can be found on our website, ir.inovio.com, and a replay will be made available shortly after this call has concluded.\n\nI will now turn the call over to Inovio's president and CEO, Dr. Jacque Shea.\n\nJacque Shea -- President and Chief Executive Officer\n\nThank you, Thomas. Good afternoon and thank you to everyone for joining today's call. In the third quarter Inovio continued to implement our strategy of delivering the promise of DNA medicines by prioritizing our resources to those candidates that have the greatest near-term potential for patient benefit and commercialization. These include INO-3107, our promising DNA medicine candidate for the treatment of HPV-6 and/or HPV-11 caused recurrent respiratory papillomatosis, or RRP.\n\nRRP is a debilitating, often lifelong condition characterized by the development of small wart-like growth or papillomas, which while generally benign can cause severe, life-threatening airway obstruction and respiratory complications. The papillomas have a tendency to grow back after they have been removed surgically, which is the current standard of care. There are currently no FDA-approved therapeutic vaccines or drugs for the treatment of RRP. We are encouraged by the positive interim phase one/two results we announced last month, not only because they build upon our ongoing work indicating that DNA medicines have the potential to treat HPV associated diseases, but more importantly because these data could be the first steps toward a new therapy to improve the lives of those patients suffering from this horrible disease.\n\nWhile Mike will talk about the INO-3107 data in greater detail in just a moment, I'd  like to highlight that Inovio has long been committed to developing innovative treatments for HPV-associated diseases. Our DNA medicines have a number of characteristics that make them uniquely suited to this therapeutic area. In previously completed trials, DNA medicines have been observed to induce antigen-specific, long-lived memory, helper, and killer T cells, which we believe may play a role in clearing the HPV virus. DNA medicines also have exhibited the potential to be readministered without the loss of immunogenicity and have favorable safety and tolerability profiles, both of which we believe are important factors in the treatment of chronic HPV associated conditions like RRP.\n\nWe look forward to continuing to build upon the foundation of clinical data we have generated to date in our HPV franchise to bring potentially paradigm shifting treatment options to patients in need. In addition, we expect to announce our REVEAL 2 phase three data with VGX-3100 in cervical high-grade squamous intraepithelial lesions or HSIL later this quarter or in the first quarter of 2023, which will help define the next steps for this HPV-related development program. Moving beyond our HPV franchise, we remain encouraged by other candidates in our pipeline, such as INO-5401, which as we reported earlier this year at ASCO, demonstrated positive results as a potential treatment for glioblastoma and almost always fatal cancer of the brain. We've continued working on the next steps for this product candidate and look forward to sharing our plans with you next year once we finalize some key decisions.\n\nWe also look forward to continuing to advance our other pipeline programs for which we anticipate data announcements in the coming months. Since I took over the reins of Inovio almost six months ago, we have been working on continuing to drive operational excellence throughout everything we do from running clinical trials, to managing our capital and other resources, to optimize our chances of successfully bringing our product candidates to the market and helping patients. Our decision to discontinue our internally funded development of INO-4800 as a heterologous COVID-19 booster vaccine due to changed market conditions is reflective of this strategy. We plan to deploy cost savings from this effort to the advancement of other promising candidates.\n\nWe currently believe these cost savings will now extend our cash runway into the first quarter of 2025, and we will continue to evaluate how we best deploy those resources across our portfolio as we move ahead. With that, I'd like to turn it over to our chief medical officer, Dr. Michael Sumner, to provide our clinical update for the quarter. Mike?\n\nMichael Sumner -- Chief Medical Officer\n\nThank you very much, Jacque, and greetings, everyone. Last month we announced positive interim results from our phase one/two for INO-3107 in patients with recurrent respiratory papillomatosis or RRP. As a reminder, INO-3107 is composed of a plasmid encoding respectively for HPV 6 and 11 early antigen six and seven proteins and delivered with INO-9012 a plasmid encoding for human interleukin-12. This vaccine candidate was evaluated in an open-label multi-center trial to assess its safety, tolerability, immunogenicity, and efficacy in participants with HPV 6 and 11 associated RRP.\n\nThe trial demonstrated statistically – statistical significance based on the clinical endpoint of a reduction in the number of RRP surgical interventions in the year following administration of INO-3107, compared with the year prior to treatment in the initial cohort of 21 participants. In the trial, there was a median decrease of three surgical interventions, overall 16 of the 21 participants or 76% showed a decrease in surgical interventions in the year following administration of INO-3107 relative to the number of surgeries in the year prior to the trial. Importantly, of those 16 participants, six are 29% required no surgical intervention during the entire 52-week trial period. Treatment with INO-3107 induced immune responses including CD4 and CD8 positive T cells against both HPV 6 and 11, all 21 participants demonstrated an increase in peripheral T cells to one or more antigens from baseline.\n\nCellular immune responses against HPV 6 and 11 were also observed at week 52, which was 43 weeks after the last treatment dose, indicating of persistent cellular memory response. We believe this memory response could be a key factor in the treatment of chronic diseases such as RRP. Finally, as we assume with our other DNA medicines INO-3107 was well tolerated with all participants completing the treatment course. Treatment emergent adverse events observed in the trial were generally low grade with 86% of participants experiencing at least one treatment emergent adverse event, most of which were grade one.\n\nThree participants are 14% experienced a grade three treatment emergent adverse event, but none of these were deemed related to INO-3107. The most commonly reported treatment emergent adverse events were injections shot site pain at 38% and fatigue at 19%. While two serious adverse events were reported, these were also deemed unrelated to INO-3107. Based on the amounts data, we are planning to meet with regulatory agencies to discuss the next steps for this program and determine the most expeditious path to bring the potential benefits of INO-3107 to RRP patients in need.\n\nWe expect our initial discussions with these regulatory bodies will include both adult and pediatric populations. Inovio will also consult key opinion leaders and patient advocacy groups for their perspectives and input as we determine the next clinical development steps. As Jacque mentioned, we are also considering the optimal path forward for our other promising candidates including INO-5401 glioblastoma for which we reported positive overall survival at 24 months data earlier this year. Over the coming months, we plan to solidify the next steps for our candidates in our pipeline that offer more near-term opportunities to advance our strategy and bring DNA medicines to market.\n\nIn addition, we'll be working to identify new drug targets that specifically leverage our ability to generate a significant cellular response encompassing broad T cell responses to target antigens. Any product candidate that would emerge for prioritization in our current pipeline will be required to exhibit compelling qualities, not only belief in the candidate's clinical potential based on the existing data, but also the ability to offer competitive clinical and commercial advantages. Inovio will focus on these candidates that can reach the market successfully in a shorter time as possible to contribute to improving patients' lives. I'll now turn the call over to our CFO, Peter Kies for our third quarter financial summary.\n\nPeter?\n\nPeter Kies -- Chief Financial Officer\n\nThanks, Mike, and good afternoon, everyone. We finished the third quarter with $281.9 million in cash, cash equivalents and short-term investments compared to $348.1 million as of June 30, 2022. As of September 30, 2022, Inovio had 249.5 million shares common outstanding and 268.7 million common shares outstanding on a fully diluted basis. Our revenue was $9.2 million for the three months ended September 30, 2022, compared to $292,000 for the same period in 2021.\n\nThe increase in revenue resulted from the fulfillment of obligations under our contract with the U.S. Department of Defense for our CELLECTRA 3P program. Inovio's research and development expenses for the three months ended September 30, 2022, were $33.1 million compared to $47.1 million for the same period in 2021. The decrease in R&D expenses was primarily related to a lower drug manufacturing costs, outside services and clinical study expenses related to INO-4800 and VGX-3100.\n\nWe also had lower engineering services and expensed equipment related to CELLECTRA 3P device array – related to our 3P device array automation project. These decreases were offset by $8.2 million lower contra research and development expenses recorded from grants and other – among other variances. General and administrative expenses were $11.8 million for the three months ended September 30, 2022 versus $13.2 million for the same period in 2021. The decrease in G&A expenses was primarily related to a decrease in employee and consultant non-cash stock-based compensation among other variances.\n\nTotal operating expenses for the third quarter 2022 decreased to $44.9 million compared to $60.2 million for the same period in 2021. Our net loss for the quarter ended September 30, 2022 was $37.8 million or $0.15 per share basic and dilutive compared to a net loss of $60.2 million or $0.29 per share basic and dilutive for the quarter ended September 30, 2021. Looking forward, Inovio expects an operating cash burn of approximately $45 million for the fourth quarter 2022. As Jacque mentioned, we are updating our prior cash runway guidance and are now projecting our cash and cash equivalents should take us into the first quarter of 2025.\n\nThis projection does not include any funds that may or may not be raised from our ATM or other financing sources. As a reminder, you can find our full financial statements in this afternoon's press release, as well as in our Form 10-Q filed with the SEC. And with that, I'll turn it back over to Jacque.\n\nJacque Shea -- President and Chief Executive Officer\n\nThank you, Peter. In summary, our work during the last quarter has enabled us to further advance our corporate strategy and sharpen our focus as we seek to realize the potential of DNA medicines for the benefit of patients globally. As we continue to prioritize operational excellence and financial discipline, we've 've also advanced our commitment to environmental, social and governance or ESG initiatives. In the third quarter, we undertook a baseline assessment of our business and created an internal team focused on incorporating ESG practices into our business where appropriate.\n\nWith a particular focus on transparency, we recognize the impact our work can have in the world, and we are committed to producing high quality products and developing them in a safe and ethical manner. With that, let's now open the call for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] And the first question will come from Hartaj Singh with Oppenheimer & Company. Please go ahead.\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nGreat, thank you. Thanks, Jacque, everyone for the update. I'm glad to see the company is getting focused. Jacque and team and Jeff, I guess, question for me would be just on what do you think a potential trial could look like? So if you can just kind of walk us through a few specific components to that question.\n\nOne is, could the next trial be sort of proof-of-concept or potential registrational kind of pivotal kind of trial? That's number one. Number two, would you require more than one sort of pivotal trial? Like, for example, the HSIL, excuse me. Then what patient numbers could we be looking at? And then lastly, are you thinking of the therapy INO-3107 as sort of adjuvant or neo-adjuvant use, so meaning, after surgery or before surgery is even contemplated. And I just got a quick housekeeping question right off.\n\nThank you.\n\nJacque Shea -- President and Chief Executive Officer\n\nHi, Hartaj. Nice to hear from you. Yes, we are very excited as you can hear about INO-3107 and we are really excited around what the data we reported last month can mean for patients. So I'm going to hand you over to Mike to give more specifics around what we are thinking around the trials.\n\nMike?\n\nMichael Sumner -- Chief Medical Officer\n\nThank you, Jacque. Hi, Hartaj, and thank you for your question. Obviously, all things we are spending a lot of time discussing internally at the moment. I think as you saw from the data that we presented, we think that we were very encouraged by the efficacy data that we certainly believe there's a meaningful efficacy signal there.\n\nAnd also obviously the tolerability is in line with what we've seen with our other DNA plasmas. We will design a study that we hope will be progressive in the registrational strategy. I think because we – it's a rare disease and we have had the efficacy signal we have, we would like to think that the FDA will see that the next stage as a registrational study. However, obviously, we can't speak for the FDA.\n\nFrom a design perspective, we were very fortunate in having interactions with the agency before. And I think we have a lot of clues of how that study will be – should be designed in terms of what the FDA is looking for. We haven't disclosed any of those things, and I actually think they're a competitive advantage to us in terms of how we move forward and propose the study design. But we are hoping we will have a good solid design that meets the FDA comments that they've made to us in the past and be able to move forward as quickly as possible.\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you, Mike. And then, just the housekeeping questions from Peter. Just, you said $45 million for the fourth quarter, do you see sort of burns sort of tailing off next year? I mean, I know you've given us the class lasting of the quarter, but just how to think of opex? Thanks.\n\nPeter Kies -- Chief Financial Officer\n\nWell we're  not providing any guidance past the fourth quarter, but I will tell you that I do see currently those quarterly numbers continuing to decrease.\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nYes. Understood. Thank you for all the questions.\n\nPeter Kies -- Chief Financial Officer\n\nYes.\n\nOperator\n\nThe next question will come from Gregory Renza with RBC Capital Markets. Please go ahead.\n\nYing Wang -- RBC Capital Markets -- Analyst\n\nHi, this is Ying Wang for Greg. Congrats on the progress and thanks for taking our questions. Maybe first on 3100, could you help us that expectations around the REVEAL 2 data that's upcoming. What's the internal benchmark and end points you're focusing on to make decisions around path forward with this program? And then maybe more broadly with the recent development of your pipeline and strategy, what's your latest thinking around prioritization and resource allocation amount of programs and assets within your portfolio? Thank you.\n\nJacque Shea -- President and Chief Executive Officer\n\nThanks very much. They're great questions. So first of all on timing for REVEAL 2 data, so we're on track for that data toward the end of this year or into quarter one. I think I'll hand over to Mike to talk a bit more around what we're expecting from that study.\n\nBut to me a good outcome would be meeting the primary endpoint for the trial. So Mike, do you want to comment on that and then I'll go back to the prioritization part of the question? Mike?\n\nMichael Sumner -- Chief Medical Officer\n\nThank you, Jacque. I mean, you obviously hit on the top points. We're going to read out the data we're targeting to read out the data by the end of this year, early next. That will actually be the primary endpoint, which is looking at histological regression and viral clearance.\n\nAnd that will be both in the biomarker population and the general population that was recruited into the study. Obviously we are expecting or hoping to see a greater potential for clinical benefit in the biomarker population. But at the moment we haven't until we see the data, we can't really comment on what that clinical benefit in the biomarker population over and above the general population we think is going to look like. You Jacque?\n\nJacque Shea -- President and Chief Executive Officer\n\nThank you, Mike, and so with regards to prioritization of the pipeline, I think over the past few months we've seen really encouraging data both in the IO space for glioblastoma, also in the HPV-associated space with 3107 for our RRP. Really what we're going to be doing going forward is prioritizing those resources our resources on those product candidates that have the best chances for success, the best chances of bringing clinical benefit potentially rapidly to patients. So you'll see us really focusing our resources there. And I think one of the sort of things that we've been very excited about is the consistent way in which our DNA medicines platform have been able to generate T cell responses.\n\nSo antigen specific CD4 and CD8 T cell responses, and I think a focus on those T cell TSO responses going forward is going to be part of how we think about prioritization.\n\nYing Wang -- RBC Capital Markets -- Analyst\n\nThat's' great. Thank you very much.\n\nOperator\n\nThe next question will come from Geoff Meacham with Bank of America. Please go ahead.\n\nCharlie Yang -- Bank of America Merrill Lynch -- Analyst\n\nHey, this is Charlie Yang for Jeff. Thanks for taking the question. I guess I have kind of general question regarding the, how you think about the HPV vaccine can impact in terms of how longer term treatable population? That's' number one. And number two, I think just think about the revenue from DoD, like how should we think about that going forward? Thank you.\n\nJacque Shea -- President and Chief Executive Officer\n\nBoth great questions. So I think while HPV vaccines have helped reduce HPV infections and consequence HPV associated diseases since they were introduced back in I think now 2006. There is lower uptake and unfortunately lower regimen and completion rate than with other vaccines. And this leads the sizable number of people still at risk of becoming infected with HPV, which can lead to development of diseases such as RRP and cervical displays here.\n\nSo I think while vaccination rates vary around the globe, I think unfortunately we're still not seeing the levels of vaccination, which mean that HPV associated disease is going to be with us for quite a while to come. So I think in terms of how we think about our relationship with DoD, I mean, we've been extremely grateful for the support that we've had from DoD across multiple of our platforms, including support for the development, manufacturing and scale-up of our ID investigational device that CELLECTRA 3PSP. We're very grateful for that. We are actually in the final stages of completing our obligations under to those agreements, and we look forward to wrapping up that work very soon.\n\nCharlie Yang -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question will come from Yi Chen with H.C. Wainwright. Please go ahead, sir.\n\nChait G -- H.C. Wainwright and Company -- Analyst\n\nHey, this is Chait on behalf of Yi Chen. You've answered most of our questions. So the only quick question we have is on INO-5401 and in glioblastoma. What can we expect from this asset as it relates to clinical updates and or other key decisions moving into 2023? Thank you.\n\nJacque Shea -- President and Chief Executive Officer\n\nYes. That's a great question and I think I mentioned during the call that we're currently thinking about the next steps for 5401 together with our partner Regeneron, and we expect to be providing an update on that next year.\n\nChait G -- H.C. Wainwright and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Dr. Jacque Shea for any closing remarks. Please go ahead, ma'am.\n\nJacque Shea -- President and Chief Executive Officer\n\nI'd just like to thank everybody for their questions and for joining us today. Have a good evening, everyone. Bye-Bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nThomas Hong -- Manager, Investor Communications\n\nJacque Shea -- President and Chief Executive Officer\n\nMichael Sumner -- Chief Medical Officer\n\nPeter Kies -- Chief Financial Officer\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nYing Wang -- RBC Capital Markets -- Analyst\n\nCharlie Yang -- Bank of America Merrill Lynch -- Analyst\n\nChait G -- H.C. Wainwright and Company -- Analyst\n\nMore INO analysis\n\nAll earnings call transcripts"
}