{
  "companyName": "Traeger, Inc.",
  "companyTicker": "COOK",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/traeger-inc-cook-q2-2022-earnings-call-transcript/",
  "content": "Traeger, Inc. (COOK -0.35%)\nQ2 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and thank you for attending today's Traeger second-quarter earnings call. My name is Jason, and I'll be the moderator for today's call. All lines will be muted during the presentation portion of the call with an opportunity for questions and answers at the end.  [Operator instructions] I would now like to pass the conference over to our host, Nick Bacchus with Traeger. Please go ahead.\n\nNick Bacchus -- Vice President, Investor Relations\n\nGood afternoon, everyone. Thank you for joining Traeger's call to discuss its second quarter 2022 results, which were released this afternoon and can be found on our website at investors.traeger.com. I'm Nick Bacchus, vice president of investor relations at Traeger. With me on the call today are Jeremy Andrus, our chief executive officer; and Dom Blosil, our chief financial officer.\n\nBefore we get started, I want to remind everyone that management's remarks on this call may contain forward-looking statements that are based on current expectations but are subject to substantial risks and uncertainties that could cause actual results to differ materially from those expressed or implied herein. We encourage you to review our annual report on Form 10-K for the year ended December 31, 2021, our quarterly report on Form 10-Q for the quarter ended June 30, 2022, once filed, and our other SEC filings for a discussion of these factors and uncertainties which are also available on the Investor Relations portion of our website. You should not take undue reliance on these forward-looking statements, which speak only as of today, and we undertake no obligation to update or revise them for any new information. This call will also contain certain non-GAAP financial measures, which we believe are useful supplemental measures.\n\nThe most comparable GAAP financial measures and reconciliation of the non-GAAP measures contained herein to such GAAP measures are included in our earnings release, which is available on the Investor Relations portion of our website at investors.traeger.com. Now, I'd like to turn the call over to Jeremy Andrus, chief executive officer of Traeger. Jeremy?\n\nJeremy Andrus -- Chief Executive Officer\n\nThank you, Nick. Thank you for joining our second-quarter earnings call. Today, I will discuss our second quarter results and our near-term strategic priorities. I will then turn the call over to Dom to discuss details on our quarterly financial performance and to provide an update on our fiscal 2022 guidance.\n\nDuring the second quarter, our business was negatively impacted by several macro-related headwinds, which drove materially lower-than-anticipated topline results for the quarter. These pressures and other headwinds are negatively impacting our outlook for the balance of the year. Despite a very challenging backdrop, I remain confident in the positioning of the Traeger brand as a disruptor and innovator in the grilling category and in our ability to navigate current challenges. Our long-term business thesis has not changed.\n\nWe continue to believe the Traeger brand is an incredible one, and that we have a large opportunity to meaningfully grow our household penetration. However, we are also fully aware that our near-term trajectory has changed and that it will take us longer to achieve our previous goals. As such, we are taking decisive action with a high level of urgency in order to position the company for future growth, profitability and to drive long-term shareholder value. On the last two earnings conference calls, I reviewed our progress on each of our four strategic growth pillars.\n\nGiven the rapidly evolving backdrop and the change in our outlook for the year, I would like to instead focus on our assessment of the near-term dynamics that are pressuring the business and the actions and strategies we have implemented to navigate the environment. Then I will discuss why I continue to be confident in Traeger's long-term growth opportunity. In the second quarter, our sales were $200 million, down 6% the prior year with particular weakness in our grill business, which was down 25%. While we expected moderated growth in grills in the quarter, given we were lapping a 40% increase from the prior year, results were lower than anticipated.\n\nAs we noted earlier in the year, we began to see a deviation from our previously forecasted sell-through starting in March. In order to arrive at our prior full-year sales guidance of $800 million to $850 million, we assumed the continuation of this softer sell-through trend for the balance of the year. However, as we moved through the second quarter, which includes some of our most important retail sales weeks of the year, sell-through trends deviated even more than what guidance assumed. We believe there are a few factors that are contributing to softer sell-through trends.\n\nFirst, we believe that after a two-year period of accelerated spending in home-related and durable goods, the consumer is shifting discretionary expenditures toward experiences. This shift is driving strong growth in demand in sectors such as hospitality and travel at the expense of goods like grills, appliances, and furniture. This shift in consumer behavior is occurring at a time when we were lapping abnormally strong sell-through trends from the second quarter of 2021 when consumer spending greatly benefited from government stimulus. Furthermore, consumer sentiment declined in the quarter to record lows as elevated inflation and talk of a looming recession weighed on consumer psychology.\n\nWhile we understood these factors were likely to continue to pressure our sell-through earlier this year, their impact deepened as we move through the second quarter. The combination of declining consumer sentiment and the spending shift away from durables in the face of heightened comparisons is driving an unprecedented decline in the grill category. To put this into perspective, during the 2008 to 2009 great financial recession, the grill category was down in the low double-digit range. We believe the grill category is down to below 20% range year to date through May on a revenue basis, and down in the 30% range on a unit basis.\n\nThis is the largest decline in the grill category that we have seen in our data sets. In particular, grills under $1,000 are seeing immense pressure industrywide and are down significantly more than the category average year to date.  We believe that this likely reflects greater sensitivity to macro pressures and inflation among consumers that are shopping at the sub-$1,000 price point. Compounding the issue of lower-than-planned sell-through are heightened levels of inventory at retail. In an effort to ensure adequate stock given the volatility in the supply chain environment over the last two years, our retail partners have been replenishing product more aggressively and holding more inventory than is typical.\n\nAs sell-through of our grills missed forecast in the peak selling season, in-channel inventories increased to levels greater than we target. Higher inventories in combination with a slowing macroeconomic backdrop and the specter of recession have led to a sharp shift in retailers' ordering behavior. Often referred to as a bullwhip effect, our retail partners are now heavy on inventory in our product category which is negatively impacting our replenishment order activity for the second half of the year. These factors are driving a substantial reduction in our revenue outlook for the balance of the year, and in particular will pressure third quarter sales, which tends to be a replenishment-based quarter.\n\nWe are keenly aware that the consumer and the macroeconomic backdrop are in the process of recalibrating after a two-year period of outsized growth, and while we hope for stabilization, we are focused on positioning the business for this environment. This includes resizing our cost structure for the current revenue run rate, rightsizing inventories, and doubling down on our efforts to drive gross margin. Let me walk through our key tactical priorities as we navigate the near-term environment. Our first near-term priority is to reduce our cost structure.\n\nEarlier this year, we discussed strategically reducing and deferring certain nonessential expenses and reprioritizing SG&A to manage the P&L. Given the lower revenue run rate we experienced in the second quarter, and in an effort to protect profitability and drive efficiencies in the business, we implemented a broader cost reduction and streamlining plan in late July. We believe these actions will drive operational efficiencies and will allow the organization to focus on initiatives that are best positioned to drive the highest return on investment and the best experience for our consumers. As Dom will discuss, we expect to realize meaningful cost savings from these actions.\n\nFirst, we have aggressively reduced certain discretionary expenses across the organization. This includes reductions in travel and entertainment, noncritical professional services, and top-of-funnel marketing. Second, we initiated a reduction in workforce in late July, which impacted approximately 14% of the global full-time salary workforce. While this was a very difficult decision, we believe this was the right thing to do for our business.\n\nOur process focused on identifying roles that could be consolidated, reductions in areas of the business that are lower priority, as well as the removal of head count in the provisions business. Over the last several quarters, we have added a significant amount of talent across all departments of the company, and we move forward with an incredibly strong team. We value the dedication of our impacted colleagues, and I would like to thank these team members for their contributions to the business. Finally, we decided to suspend operations of Traeger Provisions.\n\nWhile customers have been delighted with the provisions offering since its launch in November of last year, the business would have required significant continued investment in internal resources in order to scale. Despite its potential, Provisions was unprofitable, and given the current constraints on the P&L, we believe this is not the appropriate moment for us to be incubating new business given the large runway of profitable growth in our core business. Our next strategic priority is to rightsize inventories, including both our balance sheet inventory, as well as in-channel inventories. As we have discussed, over the last several quarters, we have leaned into inventory given supply chain constraints and volatility.\n\nGiven the lower sales forecast, we are working to aggressively reduce our balance sheet inventories. This includes materially lowering production volumes in our Asian manufacturing facilities as we work through existing inventory. While our grill inventory carries very little obsolescence risk, it is critical that we align working capital with the current revenue picture. As part of this effort to align supply and demand, we also decided to postpone our near-shoring efforts and to halt plans for production in Mexico.\n\nWhile we believe manufacturing closer to our core U.S. market remains a long-term strategic objective, current supply, and demand dynamics diminish the benefits of production of what would initially have been only a couple of grill SKUs in Mexico. In terms of channel inventories, we are working in partnership with our retailers to actively manage days on hand including selectively using promotional efforts to drive sell-through. It is important to note that we will use promotions thoughtfully and strategically with the priority of not compromising the health of the brand.\n\nWe will continue to collaborate with our retail partners on the goal of rightsizing inventories in-channel, such that our retailers are positioned to return to a more normalized replenishment cadence versus the current destocking. Finally, we remain focused on driving improvement to gross margin. Our gross margin task force continues to identify and execute on cost savings across the supply chain. Opportunities for cost reductions have been identified in areas including product input costs, packaging, logistics, and warehousing.\n\nThis cross-functional collaboration is an ongoing effort, and we expect that the team will continue to identify new savings and efficiencies as we move forward. Furthermore, we are seeing favorability in spot container rates, as well as in currency. While we expect that these favorable cost dynamics, as well as our gross margin initiatives, will not materially impact 2022 margins, as we first must work through higher cost inventory, we do see building tailwinds for 2023 and beyond. Overall, I believe we are taking the right steps to position Traeger to best navigate the unprecedented macroeconomic challenges that we face.\n\nDespite these challenges, my confidence in the Traeger story remains incredibly strong. Let me walk through some of the factors that are driving my confidence. First, the energy around the Traeger brand remains extremely strong. In May, we held our fifth Annual Traeger Day, a holiday, which is dedicated to bringing the global Traeger community together to cook outdoors and to share wood-fired food with friends and family to kick off the grilling season.\n\nTraeger Day 2022 was the highest single day for user-generated content in the history of the brand. Overall, for the second quarter, user-generated content post and organic video views were both up significantly versus last year, indicating that consumer engagement with the brand and social media is stronger than ever. Moreover, our consumers continue to love using their Traeger and act as evangelists for the brand. Our NPS score leads the industry and remains at an all-time high.\n\nWe continue to delight consumers with the innovation we are bringing to market with our new Timberline grill having some of the highest NPS scores in our entire assortment. Importantly, awareness of the Traeger brand continues to grow in core markets despite the tough backdrop for grill this year. For example, brand awareness in the West is up over 30% versus last year, despite this geography, including some of our most penetrated markets. Increasing awareness is the largest driver of growing our household penetration and remains a meaningful long-term opportunity.\n\nFurthermore, our key merchandising efforts at our most important retail partners continue to drive our brand presence and increase penetration and productivity. For example, after resetting 350 stores at the Home Depot earlier this year, we now have nearly 900 Home Depot locations with a broader and higher-end Traeger grill assortment, including double the number of grill SKUs and an expanded assortment of accessories. In the third quarter, we will be adding over 300 additional Home Depot doors with high-end fixturing. These fixtures elevate our brand at The Home Depot.\n\nThey sit above the floor on wooden decking, have prominent signage and brand messaging, and include up to six grill SKUs, as well as an assortment of Traeger accessories and consumables. Next, I'm as excited as I have ever been about our product pipeline. The recent launch of our game-changing Timberline has been well-received and has brought significant energy to the brand. This model is a halo product which brings innovation to the market at a much higher than average price point.\n\nAs we have mentioned, we will look to cascade innovation from this recent launch across our grill assortment in the coming years. While it is too early to discuss details, I'm extremely bullish on our product roadmap for both 2023 and 2024 and look forward to providing an update on upcoming launches over the next few quarters. Considering the challenging backdrop, I'm encouraged by the trends in the consumable side of the product portfolio. Our pellet sell-through is trending close to 2021 levels and maintaining strong growth over 2020.\n\nThis performance speaks to the resiliency of the pellet business and its recurring revenue nature. Sales of our sauces and rubs benefit in the second quarter from increased distribution and consumer acceptance in the grocery channel subsequent to our rollout at Kroger. We continue to believe our consumables business is a strong complement to our core grill business, which drives recurring revenues and consumer engagement with the Traeger brand. Lastly, I remain confident in the secular growth of the outdoor cooking category.\n\nThe grill category has proven to be resilient over time and data shows that Americans love to cook outdoors and are cooking more at home even as the world has normalized after the height of COVID. In fact, our connected cooking data shows that Traeger owners are growing at a similar pace to last year, implying that our consumers remain highly engaged with our product. In summary, we are not satisfied with our near-term financial results, and we are acting decisively and swiftly to position ourselves for the challenging backdrop and to emerge stronger when the environment normalizes. We are taking proactive steps to put Traeger back on its historic path of growth and profitability and to drive shareholder value.\n\nDespite facing challenges, the Traeger brand will continue to disrupt the outdoor cooking sector. And with that, I'll turn it over to Dom. Dom?\n\nDom Blosil -- Chief Financial Officer\n\nThanks, Jeremy, and good afternoon, everyone. As Jeremy discussed, we faced macroeconomic headwinds in the second quarter that negatively impacted our topline performance and will continue to pressure our results for the balance of the year. While the challenging consumer backdrop was built into our thinking when we provided guidance earlier this year, economic conditions worsened during the second quarter, and the corresponding impact to sales in our peak season was greater than anticipated as consumers shifted spending away from our category. Shifts in consumer behavior and the deteriorating economic conditions have led to higher levels of channel inventories, resulting in a dramatic shift in retail ordering patterns that we anticipate will pressure sales in the second half of 2022.\n\nGiven pressures on the topline during the second quarter, we accelerated our expense reduction efforts. We are taking swift and aggressive actions to mitigate pressures on the P&L and to drive efficiencies in our business, with a focus on positioning Traeger to successfully navigate today's economic cross currents. I will outline these actions after reviewing our second quarter results, and then we'll provide an update on our 2022 outlook. Second-quarter revenues declined 6% to $200 million due to the decline in grill revenue.\n\nGrill revenue declined 25% to $118 million. Grill revenue was impacted by lower unit volumes, partially offset by higher average selling prices driven by price increases taken in the second half of 2021 and the first quarter of 2022, as well as a mix shift to higher ASP grills. Consumables revenue increased 2% to $42 million, with growth driven by increased distribution in our rubs and sauces business. Finally, accessories revenue increased 157% driven by incremental revenue from the acquisition of MEATER.\n\nGeographically, second-quarter North American revenue was pressured by the aforementioned challenges in our U.S. business, along with negative growth in Canada, which is experiencing similar headwinds as in the United States. Our rest of world business was positive year over year in the second quarter driven by incremental revenue from the acquisition of MEATER. We are anticipating pressure in our second-half sales internationally given ongoing macroeconomic challenges impacting the consumer across many of our international markets.\n\nGross profit for the second quarter decreased to $74 million from $83 million last year. Gross profit margin was 36.7%, down 240 basis points to last year. This decline was largely driven by, one, an unfavorable shift in grill mix, which impacted gross margin by 325 basis points; and two, higher inbound freight costs that resulted in 180 basis points of margin pressure. These pressures were offset by 315 basis points of favorability driven by our pricing actions.\n\nSecond-quarter gross margin was modestly better than our expectations driven by favorability in outbound freight, and a higher-than-forecasted mix of orders fulfilled via our direct import program. Sales and marketing expenses were $44 million compared to $47 million in the second quarter last year. The decrease was driven primarily by a reduction in top funnel marketing and lower professional fees, offset by higher employee expense. During the quarter, we proactively reduced certain selling and marketing expenses given the lower revenue run rate.\n\nGeneral and administrative expenses were $29 million compared to $25 million in the second quarter of last year. The increase in general and administrative expense was driven primarily by equity-based compensation expense, as well as personnel-related expenses associated with MEATER, which was not reflected in the comparable period last year. In the second quarter, we recorded a $111 million noncash impairment charge to our goodwill related to the adverse impacts from macroeconomic conditions, as well as the market price of our stock. Please note that this amount is an estimate and will be finalized prior to filing our second quarter 10-Q.\n\nAs a result of these factors, net loss for the second quarter was $132 million as compared to net loss of $5 million in the second quarter of last year. Net loss per diluted share was $1.12 compared to a loss of $0.05 in the second quarter of last year. Adjusted net income for the quarter was $5 million or $0.04 per diluted share as compared to an adjusted net income of $17 million or $0.15 per diluted share in the same period of last year. Adjusted EBITDA was $18 million in the second quarter as compared to $27 million in the same period of last year.\n\nNow, turning to the balance sheet. At the end of the second quarter, cash and cash equivalents totaled $14 million compared to $17 million at the end of the previous fiscal year. We ended the quarter with $392 million of long-term debt. Additionally, as of the second quarter, we had drawn down $84 million under our receivables financing agreement and $3 million under our revolving credit facility, resulting in total net debt of $465 million and a net leverage ratio of seven.\n\nInventory at the end of the second quarter was $164 million compared to $86 million at the end of the second quarter of last year. Two factors contributed to the year-over-year growth in inventory. First, the landed cost of grill inventory increased with higher inbound transportation and other material input costs. Second, inventory includes approximately $14 million related to MEATER, which is not in the comparable inventory base last year.\n\nLast, lower-than-anticipated second-quarter sales led to sustained higher inventory levels at the end of Q2. It is important to note that our grill inventory carries very little obsolescence risk. We are actively pursuing strategies to reduce our grill inventory levels, which I will describe later. In response to deteriorating macroeconomic conditions and the corresponding pressure on demand, we have implemented measures to manage near-term profitability, protect liquidity and simplify our strategic focus.\n\nFirst, we quickly responded to softening demand in Q2 by reducing planned expenses and by prioritizing initiatives with a predictable return on investment. Second, we identified and subsequently actualized material cost-saving measures that included a reduction in workforce, the suspension of operations of Traeger Provisions, and the closure of our Mexico factory. These measures were implemented in July and are expected to result in annualized savings of approximately $20 million. We will continue to evaluate expense levers as we reposition the business for 2023 and beyond.\n\nWe also remain focused on driving gross margin improvements. Our gross margin task force continues to identify cost improvements that span product sourcing to supply chain optimization. This is a core capability that will catalyze continuous improvements to gross margin independent of macro dynamics. We are seeing improving macro conditions in inbound container rates from Asia, as well as favorability in currency.\n\nWe don't anticipate these emerging tailwinds to materially impact 2022 margins given expected inventory turns but we are optimistic that they could benefit our 2023 margins. Finally, we are actively working through excess inventory levels that remain elevated, both in channel and on our balance sheet. To rebalance in-channel inventory with current demand trends and correspondingly work down on-hand inventory to normal levels, we are focused on demand and supply levers. First, we are strategically pulsing promotions to drive incremental sell-through.\n\nSecond, we are addressing softer demand trends, sub $1,000, with a change to opening price points. Last, we are managing our factories to minimum production levels as we work down excess on-hand inventory. We expect these actions to result in substantially normalized inventory levels by the end of 2022. Turning to our guidance for fiscal year 2022.\n\nWe are lowering our full-year revenue guidance to $640 million to $660 million and our adjusted EBITDA guidance to $35 million to $45 million. There are three factors that influence our lower guidance range. First, we are flowing through the lower-than-projected second quarter results. Second, we are forecasting sustained pressure on demand through the second half of 2022.\n\nLast, we are anticipating significant retailer destocking, which will result in lower replenishment orders. These factors will pressure sell-in in the second half of 2022 and will have an outsized impact on our third quarter sales performance, which we are forecasting to be down as much as 50% compared to the third quarter of 2021. In terms of gross margin, we are increasing our outlook to the high end of our prior guidance range of 34% to 35%. Consistent with our previous forecast, we are expecting gross margin in the second half of the year to track below first-half results.\n\nWe expect Q3 to represent the low point in the year, and to be materially lower than full-year guidance. On SG&A, although we initiated certain cost measures in late Q2, the largest operating expense reductions were actualized in late July. As a result, we expect these expense reductions to have the most impact on the fourth quarter. Please note that our guidance for gross margin and EBITDA is exclusive of the $6 million to $7 million of pre-tax charges we expect to incur in conjunction with the cost reduction measures implemented in July.\n\nGuidance also excludes the $111 million impairment charge we recorded in the second quarter. Overall, the macroeconomic backdrop is presenting significant near-term challenges to our business. However, I believe we have put the right actions in place to position the company to navigate this dynamic environment. While we are expecting a highly challenging second half of the year, I remain confident in the long-term opportunity for Traeger to gain share and penetration.\n\nAnd with that, we will open the call to questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from Simeon Siegel with BMO. Your line is now open.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nThanks. Hey, everyone. Good afternoon. Can we -- in light of everything else the raised full-year gross margin expectations, interesting, all things considered, I think you did be this quarter's gross margin.\n\nSo, can we drill into the comfort in raising that gross margin a bit more? Maybe specifically address the comment about selective promotions you might do, maybe what you're thinking about freight will be in the back half, maybe give a little more color on the cadence of 3Q versus 4Q and the rate there. And then if you can, just -- what was that shift in grill product mix that you mentioned that impacted this quarter? Thanks a lot.\n\nDom Blosil -- Chief Financial Officer\n\nYeah. Thanks, Simeon. So, on the gross margin side, yes, we're just building confidence in the forecast and some of the predictability that we're seeing in gross margin. We're definitely fine-tuned in terms of the effort that's placed both into how we forecast gross margin, how we've configured around these initiatives tied to our gross margin task for us.\n\nAnd so, as you think about this dynamic, there continue to be macro pressures that we face in gross margin, but they're stabilizing. And so, fortunately, we're not seeing building headwinds there. I think second, we're starting to actually realize some benefit in cost of goods specific to currency. So, that's becoming a tailwind, and we're starting to see that materialize in gross margin, and we expect that to be a tailwind for the remainder of the year.\n\nThe task force continues to unlock savings that we capture, and the run rate economics of the future P&L. So, that creates a nice foundation as we kind of build our strategy around how to move inventory and pulsing these promotions accordingly. And I think just given some of the tailwinds that are building improved predictability, the benefit from direct import, which is offsetting some of the inbound transportation costs, as well as just some other improvements, whether it be in dilution or other areas of the business, we feel like -- and on top of it, just the fact that the price increases that we've taken over the last three quarters are doing what they were intended to do. We have some cushion within gross margin to post these promotions without impacting gross margin.\n\nAnd in fact, we have confidence that we can raise to the high end of what we guided to. And so those are really the factors that give us confidence that not only can we raise, but we can raise in light of the fact that we will post one or two additional promotions this year. And I would just add to that that we're not only going to post promotions as an attempt to offset some of the expense tied to those promotions via these levers in gross margin. We're also going to offset any potential flow-through impact down to EBITDA with adjustments to opex.\n\nAnd so, one of those adjustments is bringing top-of-funnel marketing down in effect to fund some of these promotions. And so, on balance, we still feel confident in the high end of the range even with these promotions in place and believe that that's at least one positive trend as we forecast gross margin through the remainder of the year. On the mix side, it's really tied to the new offering above $3,000, so the new Timberline grill. And that is kind of early stages, low volume.\n\nWe haven't reached economies to really extract margin out of that product given it's so new in the market, but that is having a dilutive impact on grill mix, overall. And that's really what's reflecting in the mix comment.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks. And then maybe, Jeremy, just picking on the marketing comment. So, recognizing the challenges now, but also noting your comments about the long-term opportunity.\n\nHow do you want us to think about it -- or how are you thinking about, I guess, approaching lower -- or pulling back on marketing now to which makes sense with revs versus the notion of brand awareness, which is obviously, as you think about the Traeger brand going forward?\n\nJeremy Andrus -- Chief Executive Officer\n\nYes. Simeon, a couple of thoughts. The first is that it became clear to us as we came into the spring that consumers were focused elsewhere, notably on sort of travel, leisure, experience-driven spend. And so, that was the first sort of strong indication that we should be pulling back.\n\nBut I think also -- as we think about the next, let's say, six to 12 months until we start investing again more meaningfully in top of funnel for a customer acquisition. There are two things that we're focused on. The first is execution at retail. We have a field sales team of 50 individuals in ensuring that the brand is set well at retail that we're really training retail associates to capture the captive traffic that is walking into their stores is important.\n\nThe second is an investment in, I would say, community engagement, which is more sort of mid-funnel. Ensuring that the brand stays strong, the metrics around engagement, cooking, social engagement. The leverage we get on that is not only long-term brand strength, but it's evangelism in the near term. We feel like that's a better and more predictable investment until we feel like we both have investment capacity and the consumer who's more focused on this category.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks a lot, guys. Best of luck for the rest of the year.\n\nJeremy Andrus -- Chief Executive Officer\n\nThanks, Simeon.\n\nOperator\n\nOur next question comes from John Glass with Morgan Stanley. Your line is now open.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThanks. Good afternoon. First, can you just talk -- do you have a sense what is the size of the inventory at the retail channel you have a good either metric, either days outstanding or absolute dollar amount that's there?\n\nDom Blosil -- Chief Financial Officer\n\nYeah. We don't -- you know, we're not going to speak to that specifically on -- or we won't share that kind of publicly, but I think what I would generally say to answer the question is that they're much higher than we typically like them to be. We've talked in the past about our collaborative planning process with supply -- with the supply planners at our largest retail accounts. And we typically try to hold inventory levels consistent within a band that we're both comfortable with and that typically aligns with our retail partner strategy as they manage on-hand inventory levels to support future growth or performance at retail.\n\nAnd I think what ultimately happened is heading into the year -- in-channel inventory levels were probably slightly above what they normally are, and that's due to the fact that our retail partners had made a decision coming out of the pandemic in a position of sort of starved inventory and sort of out-of-stock product that they ultimately rightsized, and probably overcorrected. Jeremy alluded to this bullwhip effect, which is obviously headline news. And I think we're all familiar with now. And that began to grow over the course of Q1, which typically happens ahead of our peak sell-through season.\n\nAnd I think what ultimately took place late in May when we started to pick up some real demand signals that suggested a deviation from expectations is that there was going to be a heavier in-channel inventory problem than we were hoping for. So, our team started to react in kind and began partnering with retail to try to figure out what's going on, what their REIT is. And they were actually even later than we were to react. And ultimately, in kind of like in June, they started to react accordingly, and that took the form of kind of a fairly aggressive destocking effort, which we believe will persist through the remainder of the year, and they're also actually targeting lower on-hand inventory levels than what they normally target pre-pandemic.\n\nThat's something that we're working through and ultimately may not be a sustained trend because it doesn't entirely make sense. But it's going to be a partnership in terms of how we navigate this challenge, both in channel, as well as on our own balance sheet in order to try to drive these excess or higher in-channel inventory levels down throughout the course of the year. And so, at the end of the day, it's a manageable problem. It's not a problem that we believe needs to persist through, say, the end of '23, and believe we can largely correct in-channel inventory levels with our larger accounts by year-end.\n\nThe only other point that I would add is it's not necessarily a systemic problem across the board. Our specialty retail accounts, for example, don't tend to hold more than, let's say, 30 days of inventory because they just don't have stock rooms to hold that inventory nor do they have RDCs to carry excess. And so, that tends to be more of a replenishment model, little bit more predictable, really seeing these bigger in-channel inventory levels sitting with our larger accounts, and that's something that we're aggressively working on to ensure that we find ourselves in a better spot by year-end.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThanks for that. And can you just -- you talked about the leverage ratio. I think it's around seven turns. Can you just talk about covenant risk or access to incremental liquidity if you needed, I assume this is a period you thought you'd be getting cash from reduced inventories that didn't happen.\n\nCan you just paint that picture where you are on that liquidity front, please?\n\nDom Blosil -- Chief Financial Officer\n\nYeah. For sure. So, liquidity is our No. 1 focus.\n\nAnd at least through the end of June, we feel comfortable with our liquidity position. We still have nice capacity on our cash flow revolver, a little bit of cash on the balance sheet. But most of that liquidity is really tied up in inventory. And again, that's something that is going to take longer to work through, which is why we've shifted our viewpoint on cash flow generation this year.\n\nOn the covenant side, we're proactively managing balance sheet, we always do. And one of the things that we initiated in kind of Q2, and then heading into Q3, is an amendment holiday on our credit agreement, which will allow for: one, an increase to our covenant ratio from 6.2 turns to 8.5 turns. And that provides ample relief on the covenant and ample cushion as we manage TTM EBITDA as defined by that credit agreement through year-end. And so, that really checks the box on providing additional flexibility to kind of navigate this higher leverage period of time and provide cushion against that covenant.\n\nBut at the end of the day, our main focus really now is on liquidity and ensuring that we're making the right actions -- or taking the right actions to preserve and protect liquidity in a fairly challenging moment. And as we sort of work down these excess inventory levels, find ourselves in a much better liquidity position at the start of 2023. So, I'd say that we're feeling pretty good about some of these efforts and that we've sort of put into motion. And we're fortunate in that we have good partners on the credit side that will allow us to bridge from now to when the covenant holiday expires, which -- or the amendment holiday expired, which is at the end of Q2 2023.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThank you. That's helpful.\n\nOperator\n\nOur next question comes from Kaumil Gajrawala with Credit Suisse. Your line is now open.\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nHi, guys. Could you talk a little bit about kind of inventory in the supply chain versus number of units? You've already talked quite a bit about inventory at actual retail partners and such. But not that long ago, we had the capacity constrained in the supply chains and stuff. So, do you still have a lot of units, I guess, coming over? And how do you account for that given the new environment?\n\nDom Blosil -- Chief Financial Officer\n\nYeah. Good question. So, no, we've talked a little bit about on our prepared remarks around our strategy to work down these higher inventory levels. And it really starts with kind of managing down in channel, like I referenced earlier, and we're doing that through a combination of actions, one of which is posting incremental promotions, which we've learned based on sell-through data when we promote that there is a nice lift in sell-through.\n\nSo, that's really one to kind of work down those levels. We've actually also lowered -- or reverted back to our original price points on our entry-level products to stimulate more growth sub $1,000, where we're seeing more sensitivity with consumers that are purchasing below $1,000, and we're seeing a nice lift there. And then obviously, just working with our retailers to ensure that we're moving product and -- or sort of in lockstep as they destock. On the supply side, we're working with our factories to bring -- or we have been working with our factories to bring those production levels down to sort of minimum levels, which in turn will allow us to focus primarily on what we have on hand.\n\nAnd so, from an in-transit inventory standpoint, we're going to manage that down to a very low number. And that in turn should accelerate our ability to work down our on-hand levels in conjunction with improving in-channel, which in turn should ultimately position us at the start of '23 in a much better spot so that we can rebalance sell-in against sell-through and replenishment and sort of find steady state based on that balance. And so, that's really what we're focused on, and feel confident that we'll get there largely by year-end.\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nGot it. And then from a demand perspective, have you guys thought about -- or is there anything maybe you can add on -- perhaps what we're seeing right now is just a little bit of demand pull-forward, and the replacement cycle if it was a typical -- I think we were using kind of four years or something as a typical replacement cycle. Maybe that shrunk coming out of the pandemic. And if you were to think of maybe what a run rate would look like -- can you maybe just give some context on is some of this just demand pull forward as opposed to some of these bigger macro things that we're worried about across a whole series of industries?\n\nJeremy Andrus -- Chief Executive Officer\n\nYes. Boy, it's a great question. It's not easy to really pull apart all of the factors driving demand. There certainly has been a fair bit of noise that we felt since March.\n\nI think it's clear that there was some pull forward. This is a fairly steady business -- sorry, fairly steady category, the outdoor cooking category that was growing low single digits, grew mid-high teens in '21. So, although there may have been some nominal incremental penetration in the U.S. household, there was probably some pull forward of replacement cycles.\n\nHard to know how much of the -- how much of what we're feeling now is a function of that pull forward, but certainly some of it, relative to general consumer weakness and sort of consumer reprioritizing discretionary spend toward travel. It is something that we're monitoring closely at a category level. And I would just say, one of the other trends that we're seeing in the category that's notable is that there is more softness in opening price points. And I think that probably speaks a little bit more to, at least that trend toward consumer weakness.\n\nI think a combination of three things.\n\nDom Blosil -- Chief Financial Officer\n\nI would add, though, that with some of that pull forward, I mean, the benefit of this business model is when you accelerate the installed base of grills that in turn, I think, drives improvement or growth across our consumables business and even accessories. And so, when you look at both sell-in as reported, in Q2, as well as sell-through trends across our consumables and accessories categories, you're just not seeing the same impact, right? So, on a two- and three-year stack, even year over year, when you look at sell-through trends across pellets, accessories, and other consumables, the decline is fairly muted and somewhat comparable to what we reported in our GAAP financials. And I think at the end of the day, that really helps sort of stabilize some of the pain we're feeling with maybe some of that pull forward, and how that impacts future growth or at least growth in year around the grill category. And I think that's a stabilizing factor that we really always want to lean into.\n\nI think the behavior of our consumers and how they interact with the product as measured by our IoT data sort of attach rates on pellets. They're holding at levels that make -- both make sense and haven't really deviated from normal trends. And so, those are all really positive signals, pre -- a rebound in grill growth, which we're really taking advantage of and believe that the strength of the broader portfolio is something that's sustainable and durable long term. We just so happen to be dealing with a more challenging environment right now with our higher-priced products, meaning our grill category.\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nOK. Great. That's helpful. Thank you, guys.\n\nOperator\n\nOur next question comes from Peter Benedict with Baird. Your line is now open.\n\nPeter Benedict -- Baird -- Analyst\n\nHey, guys, a couple of questions. So, Dom, can you maybe give us some help here, what level of inventory or dollar inventory on the balance sheet would align with this normalization of goal that you have? And then how are you thinking about free cash flow this year or capex spend? Just trying to understand, given the dynamics you've got here laid out in the back half of the year, where is the good job those metrics by the end of the year?\n\nDom Blosil -- Chief Financial Officer\n\nYeah. Happy to. So, as we think about kind of our general guidelines as we manage inventory. And I guess to just unpack the Q2 inventory levels a little bit further, I spoke on the call to the fact that about $14 million of that is MEATER, which wasn't in the baseline, so you have to remove that.\n\nAnd then if you normalize Q2 for pre-pandemic days in inventory, and you account for the fact that our inventory is burdened with excess cost between inbound transportation, the inflationary pressures on raw materials, as well as what was historically some negative impact on currency, which is now improving, and then you look at the excess inventory component of sort of the build in total inventory for Q2 as you bridge from Q2 to Q2 of '21. I would say that the split between outside of MEATER or the split between the higher burden and the excess inventory probably weighs more in favor with excess. But that delta is probably a mix of kind of 30% to 50% on excess, and then the remainder being just the higher cost of inventory. And so, just by nature, inventory is going to sort of sit at higher levels because it's more expensive to carry right now, and that should improve over time as these macro factors improve, and we can capture that in future purchases out of Asia.\n\nBut as you sort of push that then forward, what we're really focused on is the excess inventory component. MEATER has the inventory that they need. The burden on inventory carrying cost is what it is until that sort of improves from a macro standpoint. And the remainder is what we're sort of in control of from an excess inventory standpoint.\n\nAnd so, the general guardrails to answer your question are -- we typically try to manage to roughly 90 days of forward forecasted revenue. And that will obviously -- we'll sort of deviate from 90 days when you measure days in inventory on a trailing basis. And so, by year-end, if you think about a business that's targeting sort of 90 days of forward inventory, and we may not fully get there, we're probably thinking 100, 110 days. That would, in turn, translate to days in inventory level that's probably much higher than we would expect in sort of a more steady-state environment.\n\nAnd it's probably sitting above sort of -- at or slightly above the days in inventory that we're reporting for Q2, but in a much better position as we head into peak season. And we believe a more normalized level -- because we're going to have inventory that quickly moves when we start to set product in Q1 of 2023, and in turn, will dramatically accelerate that DII target so that by kind of the end of Q1, we're in a much better spot, and it's more in line with how we want to manage these targets going forward if that makes sense. And so, as you sort of measure it on a TTM basis, it's going to look much higher than what we believe will ultimately be a healthy inventory position ahead of what is going to be a much larger seasonal period for the business relative to what's ultimately informing a higher DII at the end of the year, which is accounting for lower inventory -- or lower sales levels in Q3 and Q4. So, I would anticipate days in inventory to hold fairly consistently through year-end but know that there's -- we're much better positioned heading into peak season to bring that down on a TTM measure.\n\nPeter Benedict -- Baird -- Analyst\n\nOK. That's helpful. Anything on capex or free cash flow as you think about the full year?\n\nDom Blosil -- Chief Financial Officer\n\nFree cash flow?\n\nPeter Benedict -- Baird -- Analyst\n\nYeah.\n\nDom Blosil -- Chief Financial Officer\n\nYes. We expect free cash flow negative by year-end.\n\nPeter Benedict -- Baird -- Analyst\n\nOK. And how about in terms of --\n\nDom Blosil -- Chief Financial Officer\n\nJust given the fact that we'll have more cash tied up in inventory. Say that again?\n\nPeter Benedict -- Baird -- Analyst\n\nYes. Yes. No, understood. Just to add the level of capex spend you're expecting for the year, and if that's been adjusted at all?\n\nDom Blosil -- Chief Financial Officer\n\nYes. We're adjusting that down. We have a few commitments that we're locked into but we're probably targeting between $4 million and sort of $6 million a quarter through year-end, that's tied to capitalized -- go ahead.\n\nPeter Benedict -- Baird -- Analyst\n\nYes. No, no, that's great. And then how are we thinking about just grow revenue, I guess, over the back half of the year, 3Q versus 4Q? And what are you guys seeing in terms of market share? I mean, obviously, there's not a lot of demand in the segment right now, but are there any reads on market share that you guys can share with us?\n\nDom Blosil -- Chief Financial Officer\n\nYeah. I think market share is holding consistently -- at least for Traeger, our market share has held through -- on a year-to-date basis. We are seeing share decline among some of our competitors. So, I think that's a positive signal in that the category is down and Traeger is maintaining share.\n\nAnd in terms of kind of our read-through the remainder of the year, we don't really have a specific number to share. But I think at least through Q2, we're holding our market share, and I think that's a good brand signal.\n\nPeter Benedict -- Baird -- Analyst\n\nOK. And then last question I would just have is around gross margin. You're eyeing around 35% for this year. You talked about some benefits from direct import program, obviously, the container rate dynamics, which could end up playing out next year.\n\nHow do you think about that longer term? A lot of factors that itch you this year. If you just think about things not necessarily getting any better than where they are today, but the container rates start to come in. I mean, how much of a benefit could that be next year? Is that 100 basis points? Is it 200? Is it 50? Just how would you help us frame that potential benefit in 2023 to your gross margin?\n\nDom Blosil -- Chief Financial Officer\n\nYes. It's a little too early to speak to that right now. But what I would say is that as you look at spot container rates to the East and the West Coast, compared to like peak levels in the back half of last year, they're off about 50%. And I would say they're off probably 20% to 25% relative to the H2 2021 average.\n\nAnd that's a meaningful improvement, right? It's not getting anywhere near where we were paying pre-pandemic levels. But if you think about a dynamic where inbound transportation is sort of hovering kind of 20% to 25% below those leverages last year, and that trend seems to be improving from here through the end of the year, and the fact that at least year-to-date, inbound transportation is probably driving 200 to 300, 400 basis points of margin compression, it was much larger in the back half of last year, it could be a substantial tailwind to gross margin. And so, something that we're watching and believe that will be a tailwind for '23, but a little bit too early to speak specifically to what that could mean.\n\nOperator\n\nOur next question comes from Sharon Zackfia with William Blair. Please limit yourself to asking one question and one follow-up, please. Thank you. The line is now open.\n\nUnknown speaker -- William Blair -- Analyst\n\nHey, guys, this is Alex on for Sharon. And yes, so we were just wondering if you could maybe talk through the $20 million of annualized savings. How much of that is in SG&A versus cost of sales? And then do you guys have any plans to reinvest part of those savings into sales-driving initiatives going forward?\n\nDom Blosil -- Chief Financial Officer\n\nYeah, good question. So, to answer your first question, it's mostly SG&A. And just to reiterate, it is a run rate number, right? So that's not what we anticipate capturing in our run rate economics through the remainder of the year. That's sort of the annualized component or the extended annualized savings based on those initiatives.\n\nAnd they're largely, if not a -- really a majority of those savings will be in SG&A. In terms of -- to answer your second question, I think right now, the focus is more on profitability than growth. We are pulling levers to drive and stimulate growth to the extent that we can, where we have controls. One of those is posting of promotions, as I had mentioned earlier, and obviously, adjusting price at entry -- at opening price points for the brand, as well as a host of other initiatives that our sales team is constantly focused on.\n\nBut as of right now, I think we need to really prioritize profitability, which in turn prioritizes liquidity, and we aren't planning to take those savings and reinvest them anywhere else. We want those to flow through down to profitability.\n\nUnknown speaker -- William Blair -- Analyst\n\nOK. Great. Thanks for that. And then just one other quick one, if you could -- if I could squeeze this in.\n\nSo, you guys talked about the impact to the sub-$1,000 grills that some consumers are slowing purchases there. Could you maybe talk to the higher-priced grills? And just qualitatively, what you're seeing on sales momentum on that side? You touched on the Timberline XL having a bit -- just not having economics there, but just what you're seeing on the qualitative side of the higher-priced grills.\n\nDom Blosil -- Chief Financial Officer\n\nYeah. So, I think below $1,000, we are seeing declines in growth. And that's partially offset by what -- by collectively some growth above $1,000, and that is being built up by the new Timberline grills. But we aren't seeing the same pressures above $1,000.\n\nAnd on sort of a collective basis, some growth above $1,000 relative to a fairly substantial decline below $1,000, which is sort of adding up to the decline in our grill category for the quarter. And those trends are both consistent from a sell-in standpoint, as well as a sell-through standpoint.\n\nUnknown speaker -- William Blair -- Analyst\n\nOK. Great. Thanks for that. I'll pass it on.\n\nOperator\n\nOur next question comes from Peter Keith with Piper Sandler. The line is now open.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nHey. Thanks. Good afternoon, everyone. I wanted to circle back on some of the balance sheet questions and the debt leverage.\n\nI'm just doing a real simple math, but if you're carrying the $465 million of debt right now, and you're going to do $40 million of EBITDA for the year as a midpoint of the guide, that gets you to 11.5 times leverage. So, that would be well above that I think the 8.5 times leverage holiday that you're getting. And so, at the same time, you're saying free cash flow is probably going to be negative for the year. So, how do you not land above that covenant limit as we look to the back half of the year?\n\nDom Blosil -- Chief Financial Officer\n\nYeah. No, it's a good question and definitely worth clarifying. So, our credit agreement defines EBITDA differently. So, what we report in our financial information, say, in the 10-Q or our 10-K is a different definition of EBITDA.\n\nIt doesn't take advantage of certain add-backs that are permitted in the credit agreement. It's also measured based on a different quantum of debt. So, we're able to exclude the AR facility as part of the first lien net leverage ratio test. And so, that 8.5 covenant is based on first-lien net leverage -- I'm sorry, first-lien net debt exclusive of the AR facility, and consolidated EBITDA, which is the definition in our credit agreement, that allows for incremental add-backs that are fairly material and sort of define a consolidated EBITDA number on a pro forma basis, but substantially larger than what we report in our financials.\n\nAnd so, based on that measure, as we look at kind of where we landed in Q2, we probably had a little bit of cushion against what was originally the covenant of 6.2 as we kind of factor in the amendment holiday and the 8.5 covenant. We actually have substantially more cushion as measured by that pro forma or consolidated EBITDA definition. And it provides for far more flexibility in terms of how we manage leverage with our creditors. And I think that ample cushion translates into a nice bridge for Traeger to really focus more on execution, navigating these business challenges without having to worry about where our leverage is headed because we can manage to do that based on this amendment, as well as just how we sort of manage EBITDA differently from a credit standpoint.\n\nAnd so, that, in turn, adds more cushion to the covenant and allows us to, again, just focus on executing and running the business versus having to aggressively manage against the covenant and focus more on liquidity. And so, that's really kind of the nuance there is. It's not a function of the EBITDA that we report. It's actually a different definition of EBITDA that translates into far more cushion against that 8.5 leverage ratio or covenants that we have to track against from quarter to quarter.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nOK. That's helpful, Dom. And then maybe pivot a question to Jeremy. So, there's obviously some pullback on expenses and a little bit on advertising, but some of your key growth initiatives around the retail and merchandising efforts and product innovation, product launches.\n\nAre those remaining on plan and on track, so you'll have more of these things rolling out in 2023? Or are those areas of pullback as well?\n\nJeremy Andrus -- Chief Executive Officer\n\nIt's a great question. I would start broadly by saying that in a moment where investment capacity is constrained, it is a great forcing mechanism of prioritization and discipline. And we've spent a lot of time thinking about where do we get the highest return from our investments. There is no question that the two that you have named are at the top of that list for sales and marketing investment that is available.\n\nSo merchandising, we have believed from the very first day before we had a marketing department that showcasing the brand effectively at retail is good investment, being there to speak to and communicate with captive consumers. We will continue in those investments. We will obviously think carefully about which retailers, which retail locations, and what quantum of investment in point-of-sale merchandising. But those that are on the top of the list will absolutely get funded across channels.\n\nAnd we've spoken specifically about our investment in upgrading brand presence in Home Depot. Those will continue. We had a plan in the back half of the year, and we're going to continue to execute on that plan. On the product side, I would say -- I would make a similar comment, which is product is the lifeblood of our future.\n\nWe know that with a strong brand and community and great channel partners that when we put good product into those -- into that engine, we get a great return. And so, we're continuing our product investments. Again, on the product side, there's a lot going on behind the scenes, and it certainly forces us to determine where do we get the highest return and to prioritize that. But I will say the level of discipline and thinking and resourcefulness that I've seen this year is unlike any other year that I've seen in the business.\n\nAnd so, as much as these are challenging moments to go through. I'm very convinced that this will make us better as a team. I like the investments that we're making in product, I feel really good about the future there, and we're investing less, but we're also doing less. And I think we are sufficiently resourcing the future product.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nOK. Thanks for the feedback, and good luck with the back half.\n\nJeremy Andrus -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nOur next question comes from Joe Feldman with Telsey Advisory Group. Your line is now open.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nYeah, thanks, guys, for taking the question. With regard to the gross margin, Dom, I know you mentioned once or twice that you feel you have a good cushion to do some promotions, and even with pulsing promotions you have this cushion. But I guess what the cushion coming from, is it because you're seeing supply chain costs come down? Or is it because of the mix shift to higher-margin consumable and accessory goods? Is that what the cushion is that you're talking about?\n\nDom Blosil -- Chief Financial Officer\n\nYeah, good question. So, like I said, I think year to date, our gross margin is tracking ahead of our internal plan, not considerably, but it is tracking above. And so, we're starting to see some tailwind actually materialize in our financials. On the promotion side, we're still going to be disciplined.\n\nAnd so, if you think historically about how we managed promotions, we don't like this brand to be on sale. And so, we've typically aligned to roughly three promotional periods a year. The plan this year was around four, and we'll probably add one to maybe three additional promotions when it makes sense. So, that's kind of number one.\n\nWe're not talking about being on promotion for most of the year. These are strategic promotions where we believe that -- when -- we believe we're fishing when the fish are eating and believe that the benefit to that is that they maybe come with some margin impact, but the gross profit dollars that flow through more than offset it. I'd say, two, we don't fully fund these promotions. They're in partnership with our retail partners and they help fund these promotions.\n\nAnd so, it's not a full sort of -- it's not -- it doesn't fully flow through Traeger's P&L. And I think the third piece is we raised price three times which does give some flexibility and permission to add a few promotions because we're obviously promoting off of much higher price points, which have offset much of the gross margin impacts that we're facing from a macro standpoint. So, those three factors really allow us to use these promotions in a way such that they won't be highly dilutive to gross margin as it relates to our guidance for full year. And like I said earlier, in addition to those factors that are baked into gross margin, we're also funding these promotions via lower marketing spend and top of funnel because we believe in this environment, promoting has more influence over demand than top-of-funnel demand creation, which tends to be more of a prospecting effort and has a longer tail to generating a return.\n\nAnd so, that's really kind of in combination, how we'll manage through this year with posting a few incremental promotions while avoiding a situation where they become dilutive beyond what we're guiding to at the high end of our range.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nGot it. Understood. OK. Thanks for explaining that.\n\nAnd then it's funny, my follow-up actually was about the top-of-funnel marketing. I guess some -- can you clarify then for me, top of funnel versus promotion? I mean, aren't you -- either way, aren't you trying to bring in new people to buy the grill? And so you are OK with that or -- yes, sorry, go ahead.\n\nDom Blosil -- Chief Financial Officer\n\nYes. You are -- no, no. It's a great question. Like our top-of-funnel marketing strategy is still core.\n\nIt's a core component of how we think about the long term. We're just really focused in-year and kind of on the short term. And in this environment, we have to prioritize resources in areas where the return or the way we measure return is far more predictable, right? And so, in the case of in-channel inventory levels, promotions are far more influential on our ability to move through those than top of funnel. And so, as we think about the mix of marketing this year, in particular, and this may extend into '23, we're going to deprioritize top of funnel, which for Traeger is more about building the marketing funnel in a more robust way because as we've spoken to earlier, that initial consideration set, which is highly correlated to brand awareness is largely influenced by our strategy to attack top of funnel, which is more scalable and sort of more influencing of brand awareness, which in turn, over time, can drive more conversion off of a larger funnel.\n\nBut in this environment, because that's more of a prospecting effort and have a longer tail to a return, we're instead focused on kind of middle-lower funnel from a marketing and demand creation standpoint. These have a more kind of one-to-one relationship between spend and return on that spend. So, it's a more immediate conversion of a consumer. And likewise, promotions are similar, right? And so, in an environment where consumers may be more focused on spending discretionary dollars on experiences or travel or things outside of the home, promotions are an opportunity to stimulate more immediate growth at retail, which in this year is more important than investments in prospecting, which will take effect over a longer time horizon.\n\nOperator\n\nThat was the final question. So, I'll pass the call back over to the management team for additional remarks.\n\nJeremy Andrus -- Chief Executive Officer\n\nThanks. I appreciate the thoughtful questions. There's no doubt this is a challenging moment from a macro perspective as we play in the category of outdoor cooking and wade through an unprecedented period in terms of decline in the category. I would say that this is also a moment or the type of moment that defines teams.\n\nWillingness to make hard decisions, desire to be better, to be smarter, and a careful balance between the near-term realities that we're playing in, that we live in, and a medium to long-term offensive. And this is a brand that is -- it's built to grow. It is built to disrupt. That hasn't changed.\n\nBut I think what you'll see in the near term is a level of grit, actually, what I will commit to you in the near term is the level of grit, level of resourcefulness, a level of discipline so that as we move through this moment, we are positioned to be even better as we reinvest back into the business in a way that we have for many years. So, that's a commitment. I feel nothing but confidence in the future in the team, and we'll slog through the environment that we're in. Thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNick Bacchus -- Vice President, Investor Relations\n\nJeremy Andrus -- Chief Executive Officer\n\nDom Blosil -- Chief Financial Officer\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nPeter Benedict -- Baird -- Analyst\n\nUnknown speaker -- William Blair -- Analyst\n\nPeter Keith -- Piper Sandler -- Analyst\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nMore COOK analysis\n\nAll earnings call transcripts"
}