{
  "companyName": "Pure Storage",
  "companyTicker": "PSTG",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/pure-storage-pstg-q2-2023-earnings-call-transcript/",
  "content": "Pure Storage (PSTG -1.04%)\nQ2 2023 Earnings Call\nAug 31, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen. Thank you for standing by, and welcome to the Pure Storage second quarter fiscal year 2023 earnings release conference call. [Operator instructions] As a reminder, this call is being recorded. I would now like to introduce our host for today's conference call, Mr.\n\nSanjot Khurana. Mr. Sanjot Khurana, please go ahead.\n\nSanjot Khurana -- Investor Relations\n\nThank you, and good afternoon. Welcome to the Pure Storage second quarter fiscal 2023 earnings conference call. My name is Sanjot Khurana, vice president of investor relations and treasurer at Pure Storage. Joining me today are our CEO, Charlie Giancarlo; our CFO, Kevan Krysler; and our CTO, Rob Lee.\n\nBefore we begin, I would like to remind you that during this call, management will make forward-looking statements, which are subject to various risks and uncertainties. These include statements regarding the COVID-19 pandemic and related disruptions, our growth and sales prospects, competitive industry and technology trends, our strategy and its advantages, our current and future product offerings and our business and operations. Any forward-looking statements that we make are based on facts and assumptions as of today and we undertake no obligation to update them. Our actual results may differ materially from the results forecasted and reported results should not be considered as an indication of future performance.\n\nA discussion of the risks and uncertainties relating to our business is contained in our filings with the SEC and we refer you to these public filings. During this call, all financial metrics and associated growth rates are non-GAAP measures other than revenues, remaining performance obligations or RPO, and cash and investments. Reconciliations to the most directly comparable GAAP measures are provided in our earnings press release and slides. Additionally, when we refer to sales in our prepared remarks, we mean total bookings, excluding cancellable orders.\n\nThis call is being broadcast live on the Pure Storage Investor Relations website and is being recorded for playback purposes. An archive of the webcast will be available on the IR website and is the property of Pure Storage. With that, I will turn the call over to our CEO, Charlie Giancarlo.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nHello, everyone, and thank you for joining us today. Once again, we are very pleased with Pure's continued success as demonstrated by this quarter's strong results. Pure's Q2 revenue grew by 30% year over year with our subscription ARR up 31%. Our growth was balanced between the U.S.\n\nand our international markets, highlighting the broad and durable appeal of our portfolio and Pure's continuing ability to deliver simple, sustainable data storage and management solutions that every organization needs. Data is the modern linchpin of business transformation and Pure is the innovation and customer experience leader in one of the largest segments of technology investment. Building on our momentum, we introduced a number of major advancements in our portfolio during our annual Accelerate conference in Q2, generating strong excitement from current and potential customers. We unveiled FlashBlade S, our next generation FlashBlade, a significant step forward in performance, density and capacity, providing a modular architecture for increased efficiency and flexibility.\n\nFlashBlade S significantly expands the use cases for this product line, including a wide price performance range of file and object workloads, such as computational analytics and AI, image search and recognition, electronic design automation, media special effects, high-performance computing and data protection. FlashBlade S was designed with full evergreen capabilities, enabling the system to be continuously upgraded without disruption. With its launch in mid-Q2, FlashBlade S comprised 20% of all Q2 FlashBlade orders and customer feedback on the first installed units is excellent. In Q2, our Evergreen subscription portfolio was extended with the addition of Evergreen Flex, a new fleet level Evergreen offering.\n\nEvergreen Flex provides customers additional flexibility as they optimize their data infrastructure. It provides utilization pricing across a customer's entire storage environment with the ability for customers to purchase inexpensive storage hardware and consume capacity on a pay-as-you-go model. Evergreen Flex joins Evergreen Forever and Evergreen One, formerly known as Pure as-a-Service and is available across our Pure portfolio. We also released our Pure Fusion service for general availability this past quarter.\n\nPure Fusion enables customers, managed service providers and cloud service providers to implement a cloud operating model for data storage management and offerings. The industry sometimes refers to this as infrastructure-as-code. Customers can use Pure Fusion to orchestrate and manage their entire fleet of Pure Storage, reducing cost and complexity and also offer storage services to their customers or developers through APIs, dramatically increasing developer productivity and corporate agility. While Pure Fusion is still in its early days, it has generated great interest from our largest enterprise and MSP customers.\n\nPure Fusion is yet another example of how Pure continues to drive the data storage and management industry forward. Pure's Portworx software was chosen by GigaOm Radar reports for the third consecutive year as the leader for enterprise Kubernetes storage and cloud native Kubernetes data storage. Their in-depth analysis awarded us the highest scores among all market segments, deployment models and evaluation metrics. Portworx's ability to empower developers to deliver superior outcomes on every cloud, both public and private, is the reason that a large global credit card company dramatically expanded their use of Portworx this quarter to support their hybrid cloud data strategy.\n\nPortworx data services released just three months ago has likewise generated great interest, including many POCs and its first sales in Q2. Customers valued its simple one-stop shop for modern database operations, its rapid time to deploy and scale database as a service for developers and ability to avoid cloud lock-in due to its multi-cloud compatibility. As I have said before, Pure believes data storage and management is high tech, a fundamental component of critical infrastructure and we invest in it accordingly. We are reaping the rewards of delivering leading products and services in a massive market that was written off as a commodity by legacy competitors.\n\nIn this uncertain macro environment, customers are especially looking for solutions that speed their digital transformation roadmaps while reducing their overhead and total cost of ownership. I have just returned from two weeks of customer and partner visits in Australia and Japan, including hosting a very successful Tokyo Accelerate event. In our Asia-Pacific theater as elsewhere, customers are simply blown away by the superior performance, reliability and simplicity of our products, and they rave about their entire experience with Pure. One customer who installed Pure to replace a competitor's all-flash product reported a tenfold improvement in performance, while also significantly reducing their labor and energy expenses.\n\nAnd now for the first time, I increasingly hear from international customers that they actively consider Pure specifically for our ability to drive down energy usage and e-waste. The demand for solutions that reduce customers' environmental footprint is now top of mind in a majority of international enterprises that we speak to. We added more than 350 new customers this past quarter. In addition to sustained growth of new customers in Enterprise and Commercial segments, we also saw very strong interest from public sector customers this quarter.\n\nMany of them cited sustainability and energy reduction goals as equal to their performance, price and reliability targets. One example is San Luis Obispo County's IT department, which reduced their data center storage footprint by 75% and power consumption by 59%, while substantially increasing their storage capacity. By replacing a competitor's all-flash systems with Pure, they also reduced their time dedicated to storage administration with Pure1 and enabled safe mode to protect their data infrastructure against cyber threats. Now I will discuss the business environment as we see it today.\n\nI am pleased with our ability to deliver on our strategy of strong growth while increasing operating profit, all while navigating the external inflationary and supply chain environments without raising list prices. Our customers are continuing to expand their data storage with Pure and we continue to expand our customer base. We do however see signs of increased diligence of purchases by enterprise customers, resulting in some lengthening of sales cycle. Overall, I remain confident in our ability to take market share and to grow faster than the market.\n\nAs reported last quarter, our hiring remains strong. Our attrition rates are below the rest of our industry peers and are reduced from the highs experienced this past spring. As companies around the world adjust to a post-COVID normal, we believe that investment in critical data infrastructure will remain central to their growth plans and that the dedication of our talented technology, sales, customer success and other core teams will enable Pure to outperform the market. Next week, we are officially kicking off our new hybrid work policy, which will have full teams come together in the office on specified days to collaborate, enhance creativity and increase employee engagement.\n\nMany of our development teams are already at over 50% in-office occupancy. Like everyone else at Pure, I am excited about our new Silicon Valley campus that we will be moving into this coming spring. I'd now like to hand the mic over to our CFO, Kevan Krysler, for a detailed review of our numbers.\n\nKevan Krysler -- Chief Financial Officer\n\nThank you, Charlie, and good afternoon. We delivered strong financial results once again this quarter. Our ongoing commitment to innovation, including our recent introduction of FlashBlade S and our expanded Evergreen subscription business models have enabled us to deliver highly differentiated solutions that our customers are leveraging to accelerate their strategic objectives. The power of our technology and software enables our customers to grow and increase productivity.\n\nOur customers also deeply appreciate our ability and commitment to deliver our products with short lead times, not increase prices and substantially lower their energy requirements. These factors, among others, are why we believe demand for our solution portfolio continues to be strong despite a turbulent macro environment. Our U.S. business continues to deliver strong revenue growth, growing 31% with particular strength this quarter in both commercial and public sector.\n\nRevenue growth of 29% from our international business was also strong, even with FX headwinds due to the strengthening of the U.S. dollar. We continue to be pleased with meaningful contributions from new business. Our total customer count reflects the acquisition of more than 350 new customers this quarter and 56% of the U.S.\n\nFortune 500 customers. Performance of our Evergreen subscription businesses and Portworx were solid as subscription annual recurring revenue, or ARR, grew 31% to $955 million. Remaining performance obligations or RPO grew 25% to $1.5 billion. Similar to the remarks we made last quarter our RPO growth compared to Q2 of last year reflects a reduction of approximately $32 million relating to product shipments for an outstanding commitment with one of our global system integrators.\n\nExcluding these product shipments, RPO grew 28% year over year. Our headcount has increased to 4,600 employees as our investments in talent continue to be disciplined and focused around our key business objectives. Now turning to specific financial results and discussion. Total revenue for the quarter grew 30% to approximately $647 million.\n\nProduct revenue grew 28% and subscription services revenue grew approximately 35%. Subscription services revenue represented approximately 36% of total revenue. We continue to drive solid gross margin at 70.4% this quarter. High performance, reliability, simplicity and sustainability of our solutions are factors contributing to both our strong product gross margins of 69% this quarter and subscription services gross margins of nearly 73% this quarter.\n\nImportantly, we were also able to deliver these gross margins without passing price increases on to our customers. We achieved favorable operating profits of $106 million and operating margins of 16.4% this quarter. Now let's turn to the balance sheet and cash flows. We ended the quarter with over $1.36 billion in cash.\n\nCash flow from operations was over $159 million, resulting from the combination of strong sales, collections and increasing profitability. Capital expenditures were approximately $25 million during the quarter. We returned over $60 million of capital to repurchase approximately 2.4 million shares during the quarter. We have approximately $123 million remaining from our $250 million share repurchase program.\n\nNow turning to guidance. We are pleased to have established a track record of strong performance in the dynamic and challenging environments. Demand signals for our solutions are solid and our visibility of opportunities is healthy. We estimate revenue in Q3 to be approximately $670 million, growing approximately 19% year over year and we expect operating profit to be approximately $85 million in Q3, representing approximately 12.7% operating margin.\n\nWe are also raising our annual guidance for the full fiscal year. We now expect that revenue for FY '23 will be $2.75 billion, growing approximately 26% year over year. Operating profit is estimated to be approximately $390 million, representing approximately 14% operating margin. Also, as a reminder from our remarks last quarter, approximately $60 million of product revenue in the first quarter of this year was forecasted to close in the second half of our fiscal year.\n\nThis impacts seasonality when comparing growth rates in our first half compared to our back half of this year. Our Q3 and updated annual guidance contemplates, based on our visibility, macro environment conditions, including factors such as demand signals, foreign currency and inflation. With time being such a critical asset for our customers, we continue to expect to deliver our solutions with short lead times despite supply chain challenges that have reduced slightly, but still exist. In closing, our data storage and management technologies and software are critical to accelerating our customers' digital transformation objectives.\n\nCustomers continue to depend on us to innovate, to be flexible, to meet their needs quickly, to not raise prices and to reduce their energy consumption any waste. With that, I will turn it over to the operator so we can get to your questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Aaron Rakers with Wells Fargo. Your line is now open.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYeah, thank you very much, and congratulations on the solid results. You guys raised the guidance for the full year, strong guidance in the fiscal third quarter, but clearly, there is a little bit of kind of commentary around the macro. I think, Charlie, you had mentioned that you did see some signs of lengthening maybe sales cycles, etc. So I am curious if you could kind of expand a little bit upon what you are exactly seeing from a demand profile in your pipeline? Have you seen kind of coming out of this quarter any kind of extension in deal cycles? Just any kind of incremental clarity you can provide on how you factored in the macro environment currently looking into this quarter? Can you hear, Charlie? I can hear you now, Charlie.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nYou could. OK. Sorry, I guess we are having technical trouble. So let me start over again.\n\nI was talking to myself apparently for a while. We are very pleased obviously with the financial results we had this quarter and frankly, demand signals continue to be quite healthy. So we wanted to make sure we were very measured in the way that we were reflecting what we are seeing. While we are seeing a little bit of, let's say, second looks by companies, finance, perhaps stepping in for a second look at a deal and that is lengthening some of the enterprise sales cycles, but it's not changed the closing of the deals later in the process.\n\nAnd as I said, demand and pipeline looks very healthy. The way we look at this is we are market share takers in what is a very large market, slight perturbations in the growth of this market shouldn't affect dramatically our ability to transform pipeline into sales and continue to grow our pipeline. So we feel like we are very well-positioned. We have a very broad portfolio.\n\nOur differentiation is only increasing right now. We are still the only player that can now take on hard disk at the secondary tier level, which is continues to be a strong area of growth for us. And now, honestly, our ability to provide a more sustainable product is in greater demand on a worldwide basis. So we are very bullish from the standpoint of being able to weather some amount of economic uncertainty.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYeah, very good. And then as a quick follow-up, I wanted to touch maybe on some of the points you brought up there, portfolio differentiation and just portfolio expansion. The FlashBlade S product, you started off your prepared remarks just highlighting -- it sounds like out of the gate very strong traction, 20% of your FlashBlade volumes. Where are you seeing exactly the most momentum from that product? And has that seen -- have you seen any cannibalistic effect of your existing product portfolio or is this what I am trying to, I guess, get at is how expansion -- how much expansion of your existing TAM does that bring to the table for Pure?\n\nKevan Krysler -- Chief Financial Officer\n\nYeah. Well, it is the next generation product. So I don't know that cannibalization is the right word. It's our next generation product in several quarters, it should be full replacement for the existing, the Generation 1 FlashBlade product.\n\nBut it's a very significant expansion of the price performance range that the former that the Gen 1 product provided. So it scales both up and down better in both capacity, as well as in performance. And in fact, it's capable of multiple levels of performance in the same implementation. So we really see it as dramatically expanding what our share of the original TAM deal brought out.\n\nAnd it really represents a broadening of the family of FlashBlade.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nVery good. Thank you.\n\nOperator\n\nThank you, Aaron. Our next question comes from Simon Leopold from Raymond James.\n\nSimon Leopold -- Raymond James -- Analyst\n\nI wanted to see if maybe you could help us characterize how your customer base might be evolving? And what I am getting at here is you have talked in the past about moving up market and doing more business with larger enterprises and larger deals that I imagine could offset some weakening from smaller businesses. Is there some metrics you could share with us to help us understand the change in the profile of your customers?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nWell, I think we continue to expand on all fronts. There is no -- this quarter, commercial, what we call commercial and public sector were the stars of the quarter, but we continue to expand into enterprise and large enterprise, which was a process that we started a little over three years ago. My expectations is that we will continue to optimize each of those market segments and our business model to support each of those market segments as we go forward. But my expectations, over the longer term, is that the percentage of enterprise in our sales will continue to increase, simply because we started out as a commercial player and enterprise was something that we had to grow into.\n\nAnd our brand is continuing to build among those enterprise players. So on a longer-term basis, I'd expect the percentage of our sales in enterprise and frankly, cloud to continue to increase, not because of any lack of success in commercial and public sector, just because of the size of those markets in general.\n\nKevan Krysler -- Chief Financial Officer\n\nYeah. And Simon, I think -- this is Kevan. I'd add on just a little bit more in terms of the traction we're getting with new business and new customers. And we saw some meaningful contribution to revenue from new customers across all customer segments this quarter, which was definitely a plus.\n\nSimon Leopold -- Raymond James -- Analyst\n\nAnd just as a quick follow-up. Your architecture, which is basically leveraging raw NAND rather than buying solid-state drives. Could you talk about whether you're seeing some benefit from maybe lower prices in the marketplace for that raw NAND because of weakness in verticals like PCs or smartphones, how much sort of shifting of production capacity and trends are you seeing even though there may be different products, is there any flexibility or fungibility of the manufacturing that is benefiting you.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nWell, Simon, this is something that's been a hallmark for Pure since almost the very beginning since -- ever since we started building our own digital flash modules, which is that we have a wide variety of suppliers for the raw NAND. We're able to leverage different levels of quality of that raw NAND without affecting the quality that we deliver to our customers. And that gives us a large degree of freedom in terms of the costs that we pay for the NAND, as well as choice of supply. And it also tends to allow us to be able to take advantage of price declines on the NAND market faster than the rest of the competition.\n\nSo yeah, it's given -- lastly, what I'll mention is that it's also given this sort of tremendous energy advantage because we make better use of the flash, which allows us to produce products that require far less power than the competition. But I'm going to invite our CTO, Rob, to chime in.\n\nRob Lee -- Chief Technology Officer\n\nYeah, Simon, just to add a couple of things there. Like Charlie said, the direct flash technology definitely opens up a much broader menu of NAND options for us to go and evaluate and incorporate into the products. We do drive a significant amount of efficiency, more efficiency than others would be able to achieve through SSDs out of our direct flash technology. The other thing I would point out is that now with the intro FlashBlade S as we've gone over the years and standardized our technology on the same direct flash modules across the entire platform, we're going to realize some pretty significant benefits from this.\n\nOne is certainly, the kind of scale and leverage that we have in terms of the development of the technology, but then number two, this is also going to allow us to move a bit more nimbly and intentionally, even more so than we do today as we navigate future NAND parts and generation. So net-net, it's a significant advantage for us all around.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThank you very much.\n\nOperator\n\nThanks, Simon. Our next question comes from Shannon Cross from Credit Suisse. Shannon, please go ahead.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you very much. Charlie, can you take a step back and talk about your thoughts regarding margin? And you obviously have a very leverageable model where revenue growth sort of flows through very quickly and drive a higher operating margin. But I'm wondering how you think about investments in the business to continue to drive the strong revenue growth versus trying to increase your cash flow or over time, see the operating margin go up as it is because clearly, you have a good product that's well received that I don't know if you could invest even more, maybe you could either accelerate or at least continue the rapid revenue growth? And then I have a follow-up. Thank you.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nYeah. Thank you, Shannon. We're actually always looking at this in terms of pricing and growth. Frankly, we believe we provide a very high-value product, and we do get a return.\n\nWe think we get a premium of 10% or more, in general -- in the market for the product and the value that we deliver in our product. I would say that we're generally fairly happy with the margins in the product margin in the range where we've been over the last multiple quarters. We think it gives us a lot of flexibility to be able to win deals, especially new customers. We do invest in winning new customers without a doubt.\n\nExisting customers over time really understand the total cost of ownership that we deliver and our -- and I think we received the value accordingly. So I think we have the right balance of investment versus margin at this point. Kevan, do you want to add?\n\nKevan Krysler -- Chief Financial Officer\n\nYeah, Shannon, I think I'll add just a couple of things, right? So when we think about the full year from an investment standpoint, I mean we're talking about 20% in terms of additional operating expense investment. And when we entered the year, we were very much committed to disciplined investment, as well as addressing some of the inflationary impacts we were seeing. And those business objectives really haven't changed. Now our talent team has done a wonderful job this quarter.\n\nWe had some great success in hiring talent. We're not where we'd like to be, frankly, with our quota sellers, our quota-carrying sellers. And so that will be an area of focus for us in terms of hiring for the remainder of the year in investment. So we are expecting to see some higher investment levels really within our sales organization in the second half.\n\nAnd there is always some seasonality with our opex, especially in the fourth quarter as a result of our sales reps starting to earn their accelerators. So hopefully, that's helpful context for you.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nOK. Yeah, thank you. And I'm sorry if I missed it, I don't think I did. Can you give us an update on the meta relationships and opportunities with other hyperscalers? Thanks.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nSure. Meta relationship continues. We did -- it wasn't terribly significant this quarter, although there were some shipments, and we continue to make progress slow and steady with other hyperscalers. Obviously, you'll be the first to hear when -- assuming that we actually are able to solidify something solid.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nThanks, Shannon. Our next question comes from Tim Long from Barclays. Tim, please go ahead.\n\nTim Long -- Barclays -- Analyst\n\nThank you. Two questions, if I could. First, on the subscription services side, another strong quarter and it sounds like some of the new platforms are really working. Maybe just -- just give us a sense as you kind of transition some of the solutions toward more subscription.\n\nWhat are the pushbacks and what are the customers like about that? And then secondly, I did want to follow-up before you had a pretty nice win with a large telco customer. I think, for 5G. So just update us on that larger deal and also similar to the last question, are there any other large opportunities that seems like it could be a nice large new TAM for you guys to go after? Thank you.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nAbsolutely. Well, the numbers, I think on the subscription side, pretty much speak for themselves. I'd say the largest hurdle that we have with customers is just that it's a very new way to buy. And it may very well be that other parts of their data center build, they build with capex.\n\nSo it's a bit different from that standpoint. So I would say it is largely that it's new and different is the largest hurdle. In terms of the terms of the service capability, no -- one additional one actually is the channel. It's also a new way for the channel to sell.\n\nAnd of course, the economics like any company going through a capex to opex transition, it takes time for them to adjust how they pay their sellers and for their sellers to adjust as well. So I would say, in general, it's just the newness of the opex model versus capex, both with customers and the channel that is probably the biggest hurdle. But we are seeing steady as you can see, steady growth and steady interest in it.\n\nKevan Krysler -- Chief Financial Officer\n\nTwo additional things I'd add to that, Tim, and maybe Charlie or Rob, you can jump in. But the expansion of Evergreen with Flex, I think that's going to be a big opportunity for us early days at this point. But then even more so with FlashBlade S and the additional features now with Evergreen that we've enabled, I think, it's going to be pretty powerful as well. And I don't know if you want to add some commentary on that.\n\nRob Lee -- Chief Technology Officer\n\nYeah, absolutely, this is Rob. Let me answer that. So I think one of the biggest impacts that we have with S, Charlie talked about in his prepared remarks, significant step forward in performance capacity density, lowering of power consumption. That's all true.\n\nOne of the biggest other impacts that we haven't covered yet is the additional flexibility that we've introduced to the platform. By separating the compute and the storage elements, not only have we allowed customers to configure that really family of products at this point for different performance and capacity levels on day one, but we've also now opened up the customer as they evolve to grow independently performance or capacity as they need and that flexibility now allows us to introduce the full benefits of Evergreen forever to FlashBlade. And so we look at that as definitely going to be a tailwind as we look forward. On the 5G question, that -- as you may know, we've already made shipments against that account they are being deployed.\n\nThe commentary that we're receiving back from the customer is excellent. So I expect more of the same in the future. But it does tend to be ordered in -- ordered episodically as they build out.\n\nTim Long -- Barclays -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nThank you, Tim. Our next question comes from Krish Sankar from Cowen and Company. Krish, please go ahead.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nHi. Thanks for taking my question. And Charlie and Kevan, congrats on executing really well in a very tough environment. So kudos you and your team.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nThanks, Krish.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nMy first -- thanks for that. Charlie, my first question is to the then you can talk about it. How should we think about enterprise demand beyond the January quarter? I know it's still early, but the main concern with investors seems to be that storage could be the next shoe to drop. So I'm kind of wondering what you're hearing from your customer base about their IT spend budget for next year and another falloff for Kevan on operating margins.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nWell, that's a tough question. I'll pull out my crystal ball. What we're generally hearing is from the enterprise customers is general optimism around the IT budget, meaning that they also see the questions around the economy, questions around recession. And I don't think we can answer this question uniformly around the world.\n\nI think Europe and in particular, the UK is different from Asia-Pac and different from the U.S. But in the U.S., I think general optimism that with digital transformation and the need for companies to really be able to compete in the new world that they have to continue investing in their IT environment. Data is the core of that being able to leverage their data. And so data infrastructure is important.\n\nSo we're seeing general optimism there. I think Europe is going through somewhat different challenges with energy pricing and inflation. And that could be affected a bit more. And then Asia-Pac is a tale of many different countries.\n\nBut I'm expecting Asia-Pac absent some kind of geopolitical issue to continue to be a strong growth engine for us.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Very helpful. And then a follow-up for Kevan, on the operating margin, and our congrats on raising the off margin guidance from 12% to 14%. I'm just kind of curious to figure out what are the key drivers for it? I'm just trying to understand the sustainability of an operating margin.\n\nAnd Kevan, if you can extend this question a little further. If hypothetically speaking, revenues are up 10% next year. How will op margins look? And conversely, if revenues were down 10% next year, how will op margin look.\n\nKevan Krysler -- Chief Financial Officer\n\nYeah. Thanks, Krish. I mean -- let's first talk about the performance around op margins, which yes, we're very pleased with. And again, when we think about our strategy and business objectives, it's really about growing our top line and balancing that with increasing profitability in a sustainable way.\n\nAnd we're doing that, and we feel very comfortable with that. This year is a fine example of being able to grow both our top line while seeing some expansion in terms of our operating margin. And we believe that's sustainable as we look out beyond this year. And we've got a track record of that, and it's not without investing heavily.\n\nI view a 20% increase in investment this year, very healthy, and we're really driving that across our innovation with our engineers. I've talked a little bit about our sellers. We've got more work to do to invest in our selling organization, and we look forward to doing that in the second half. And then on scale and infrastructure, we're doing a nice job continuing to invest in that area.\n\nAnd so without getting into details beyond this year, I would just say that I have a lot of confidence that it's sustainable.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nThanks a lot, Kevan.\n\nKevan Krysler -- Chief Financial Officer\n\nThanks, Krish.\n\nOperator\n\nThank you, Krish. Our next question comes from Nehal Chokshi from Northland Capital Markets. Nehal, please go ahead.\n\nNehal Chokshi -- Northland Capital Markets -- Analyst\n\nYeah. Thank you. Great quarter and really very impressive guidance given the trends that everybody is citing. I'm not going to beat that dead horse, clearly a very strong pipeline that you have.\n\nA couple of quick things. So dollar-based net revenue retention rate on your ARR, you did give some color a couple of quarters ago that was a 120% plus. Has there been any material change on that?\n\nKevan Krysler -- Chief Financial Officer\n\nHigh level, no material change, and we update that, Nehal, once a year.\n\nNehal Chokshi -- Northland Capital Markets -- Analyst\n\nOK. Great. And then I do want to double click on the sales hiring environment. It does seem like things are improving, but your sales hiring has not improved in material way yet.\n\nWhy is that? And why do you expect that to be able to improve going forward?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nWell, I think our sales hiring has improved, but we're continuing to scale. And we are a bit behind. No doubt, we're a bit behind where we'd like to be or behind plan. But we caught up quite a bit in Q1 to where plan had been.\n\nSo we're narrowing that delta, if you will, between where we are in plan. I do agree with you. I think the environment is getting a bit better on the sales hiring side.\n\nNehal Chokshi -- Northland Capital Markets -- Analyst\n\nOK. And then finally, just a follow-up to that is that clearly, you've been putting up very strong results that imply that your sales productivity has been improving massively. Is there room for further sales productivity improvements here?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nShort answer is absolutely. I think we still have a ways to go to become best-in-class there, and we have plans in place to that we think are the elements that will allow us to continue to improve sales productivity.\n\nNehal Chokshi -- Northland Capital Markets -- Analyst\n\nGreat. Thank you. Congratulations.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nThanks, Nehal.\n\nOperator\n\nOur next question comes from David Vogt from UBS. David, please go ahead.\n\nDavid Vogt -- UBS -- Analyst\n\nGreat. Thanks, guys, for taking my question. If we just could go back to the [Technical difficulty]. Can you guys hear me?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nYeah, yeah, we can hear you. Go ahead, David. He can't hear us though. Hello.\n\nWhile we move on to the next question, and if he comes back on we will.\n\nDavid Vogt -- UBS -- Analyst\n\nWait. Hey, guys, I'm here.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nOK. Good. Yeah, we can hear you, David. Go ahead.\n\nDavid Vogt -- UBS -- Analyst\n\nYeah. So just want to go back to the macro and the conversation around elongated sales cycles. When you talk to customers, are you seeing any -- again, it just out. [Technical difficulty]\n\nCharlie Giancarlo -- Chief Executive Officer\n\nPlease go ahead, David. Yeah, let's move on to Amit, if we can.\n\nOperator\n\nOur next question comes from Amit Daryanani from Evercore. Amit, please go ahead.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nThanks for taking my questions. I guess the first question I have is, you beat July quarter were about $12 million versus what you folks initially said, but you're raising the full year by like $90 million or so. So you're clearly thinking of the back half expectations up a fair bit beyond just the beat? And despite only all the macro commentary you had, I'd love to sort of understand what are the levers of the upside you are seeing? Is it better share gains? Is it more of the hyperscale or meta ramps that are happening or it's something else? I'd love to sort of understand what's enabled you to raise your numbers well above and beyond what you've been [Inaudible]?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nYeah. I'll start, and I'm going to invite Kevan to join in. We do a very bottoms up fundamental analysis of everything from everything from pipeline to deal to the field forecasts and so forth, and it's really based on that. So if I were to up-level it toward more of the macro, I would say, yes, it's continued share gains.\n\nAnd as I might have mentioned earlier in this call, we are still roughly a $2.5 billion $2.75 billion knock on wood, a vendor in a $50 billion market. Our opportunity is based on gaining share and less on the overall size of the market at any particular time. So Kevan, do you want to.\n\nKevan Krysler -- Chief Financial Officer\n\nYeah. I mean, I think I'd add a little bit here. So we continue to have relatively good visibility beyond just one quarter out. I think our sales leadership team has done a really nice job focusing on demand gen and pipeline beyond one quarter.\n\nThe sales team has really got a good pulse on the business right now around our pipeline, our opportunities ability to convert what that looks like. That, in combination with our track record, both with our existing customers and be able to expand within our existing customers, as well as the continued traction we're seeing with the new business, this is just really how the second half shapes out based on what we saw exiting Q2 and looking out to Q3 and the rest of the year. So hopefully, that's helpful for you.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nThat is super helpful. And I know there is a bunch of moving parts over here. Kevan, I guess, from your perspective, I think the question that folks will probably have it. In the back half of the year, you're sort of implying low double-digit kind of top line growth versus the 40% in the first half.\n\nI know there are a few moving parts to compare to that decile. But maybe just help contextualize what's driving the deceleration in the back half versus the first half?\n\nKevan Krysler -- Chief Financial Officer\n\nYeah. It's a great question. And obviously, we've had a fantastic first half and leading to raising our annual guidance to 26% year over year. But you're right, as we think about growth in the second half, there is a few things to be thinking about and a few factors to keep in mind here.\n\nOne is that the second half is impacted by seasonality of that deal we mentioned previously around $60 million. There is actually a couple of deals that we delivered in Q1, really contemplated for second half. And so that's going to impact second half growth by approximately six points. So that's important to consider.\n\nI think the next factor to consider is our comps are getting much tougher in the second half due to the substantial growth and the additional week we had last year. Now just a reminder, in terms of our growth last year in Q3 and Q4, were 37% and 41%, respectively, which was just outstanding. And then lastly, as we mentioned, we're navigating some incremental headwinds as we think about the elongation of the sales cycle, but we've contemplated that in our guide. So that with FX, I feel pretty good in terms of how we're looking in terms of second half growth.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nPerfect. Thank you. Congrats on a great quarter.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nAppreciate it.\n\nOperator\n\nThank you, Amit. Our next question comes from Meta Marshall from Morgan Stanley. Meta, please go ahead.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Charlie, you mentioned it again on the call, but I just wanted to get a sense of on the power consumption advantages that you guys have are just kind of green energy angle where or what type of customer type is that having the most success with? You mentioned Europe last quarter? Is it having any increase prevalence or acceptance with cloud customers? And then maybe second, you guys have clearly talked about a little bit of elongation of deal cycle. Just wondering if there is any different in deal types, whether you're seeing customers want to move more toward Evergreen or kind of pay as you grow versus kind of whatever purchasing model they were looking at before? Have we seen any changes in what type of purchasing they are looking to make.\n\nThanks.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nYeah. Great. Thanks, Meta. On the energy side, there are several different customer types that are focused on energy.\n\nOne I would say our large reporting companies that are now needing to report on their own ESG environment, and that's been pushed down into their data center operations, which tends to be a very large part of their energy utilization. The second, I would say, is countries now with energy in security. So that covers a lot of Europe right now. It's not just the price of energy that's causing them to take a look at their energy bills and so forth.\n\nIt's now also the availability of energy, making them quite nervous about how much energy their entire environment takes up. But certainly, a big part of that, again, is in their data center. And then third, I'd say is it's government. Government worldwide, governments worldwide now are very focused on energy reduction, and so we're seeing a lot of it there.\n\nIn Japan, it was palpable, and it also fits if you will, the Japanese ethic for smaller, more compact, more efficient, more reliable capabilities, which we fit really quite perfectly. So I'd say the energy sensitivity is large and growing, probably not surprising to this audience, larger internationally currently than it is in the U.S. but growing in the U.S. as well.\n\nOn the deal cycle standpoint, we started to see it earlier, I would say starting around mid-quarter, we started to see it and then it increased through the quarter. The deal cycles were just taking another week or two weeks. Generally, all of those deals closed. So it wasn't a demand issue.\n\nAnd so far, the approvals are still going through, but there definitely was on average, a lengthening of the deal process.\n\nKevan Krysler -- Chief Financial Officer\n\nYeah. And I would say -- this is Kevan. I would add a couple of things. I think the elongation I would really point that more to the enterprise, larger enterprise segment.\n\nWe didn't see a lot of that, frankly, on the commercial and public sector side. So I think that's an important clarification. I think the other thing you had asked, which we absolutely are seeing and we are well-positioned for is our customers looking for more flexibility in how they structure their deals. And I would say absolutely.\n\nAnd I think our timing of Evergreen Flex bringing another option for customers and how they might want to consume our technology and solutions is really resonating. But we are having a fair amount of conversations with our customers around flexibility.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThanks, Meta. Our next question comes from Wamsi Mohan from Bank of America. Wamsi, please go ahead.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Thank you, and congrats on the solid results. If we look at your guidance here, it sort of implies product revenue grow about 20% or a little bit higher. And when we look at your long-term model, that really implies software or subscription growing at 30% plus and becoming more than 50% of revenues.\n\nSo as we look into next year and further out, should we be thinking that product meaningfully decelerates, or is a 20% product revenue growth sustainable from share gains? And I have a follow-up.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nYeah. My opinion, Wamsi, is that product growth will continue. Again, we are still a relatively small player in a very large market. And so share gains continue to be a major growth item for us or growth sector plus there is the option or the opportunity to start selling more into the hyperscale environment, whether the top 10 hyperscalers.\n\nAnd if each one of those that gets cracked really would be a meaningful revenue accelerant. So on the product side. So no, we are looking at both as meaningful growth factors for us.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thanks, Charlie. And then if we think about your operating margin performance in the quarter, relative to your expectation, you got a $12 million top line beat, but you had a multiple add on your operating income dollar delta on your beat. And I'm just wondering if there was anything that you would call out specifically around the operating margin performance.\n\nAnd as we look at the back half of the year, I know the revenue growth is decelerating, but generally speaking, like when you think about the margin profile there, anything you can help us to bridge the sequential margins, that would be helpful. Thank you.\n\nKevan Krysler -- Chief Financial Officer\n\nYeah. Thanks, Wamsi. I think the primary factor -- I probably want to highlight around our investments for the second half. And then overall, when we think about our operating expenses for the year and the growth is really around continuing to invest in our sellers.\n\nAnd we have mentioned that before. But that is an area where, for Q2, arguably, I would have liked to have been further along in terms of where we are with our investment profile on the sales side with our sellers. But we will make that up. I feel confident on that and we will see that through our investments as you look at the second half.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thanks.\n\nOperator\n\nThank you, Wamsi. Our next question comes from Matt Sheerin from Stifel. Matt, please go ahead.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nYeah. Thank you. I have a follow-up, Charlie, on your comments regarding customer expansion in addition to the new logo adds. Can you comment on the progress you are seeing an increasing spend within existing customers, particularly large enterprises due to the expanding products and services within your portfolio and the opportunity for that going forward?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nAbsolutely. That is another major growth vector for us is simply the number of large enterprise logos that we have. I think it kind of hides a big opportunity for us in that. Our wallet share on average in those large enterprises is still relatively small.\n\nI mean obviously, there are a handful of them where we are the majority of their spend in the storage area. But for the vast majority of those enterprise logos, we still have a lot of opportunity ahead of us. And frankly, with our customers to know us they still love us. Their experience with Pure is very, very good.\n\nAnd because of that, we get, I think exceptional opportunities every time another one of their storage properties comes up for renewal. So it is a major area of growth for us and I expect that to continue to pay dividends for quite some time.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you. And just for my follow-up, could you just comment on the supply environment. I mean you really haven't called that out as an issue relative to your competitors.\n\nI know you have got a smaller footprint in terms of components, and you have managed that very well. But any sort of hiccups or incremental pluses or minuses or negatives there?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nI would say that in general and on average, the situation has ameliorated somewhat. That is -- it's not quite, it hasn't gotten worse. And in fact, if anything, it's gotten a little better, but it's very uneven. In other words, there are some components that have become much more widely available, shorter lead times, but many others that are still on allocation and we still get de-commits every now and then.\n\nSo the number of de-commits are down. Things are a little bit easier, but it's still -- I wouldn't say that we are out of the woods yet. That being said, we expect it to continue to improve.\n\nKevan Krysler -- Chief Financial Officer\n\nYeah. And I think it's all about our confidence in our track record of delivering timely to our customers, which is so critical for them as they are kind of working through accelerating what they need to do from a digital transformation standpoint and we don't see that changing. And again, the challenges we are having would be outside, obviously, of NAND and DRAM to be clear as well.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nGot it. OK. Thank you.\n\nOperator\n\nOur next question comes from Jason Ader from William Blair. Jason, please go ahead.\n\nSebastien Naji -- William Blair -- Analyst\n\nHey. Good morning -- or good afternoon. This is Sebastien on for Jason. I just wanted to ask a little bit more about the Evergreen Flex offering.\n\nWhat is sort of the target customer for that offering? And what has been the initial reaction from the channel or from customers that are looking to adopt it?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nYeah. Thanks. So Evergreen Flex is really targeted at those customers that we are open and interested in a subscription model that is a pay-as-you-go model, but whose internal financial philosophy was really based on capex. So you can think of, in some cases, managed service providers.\n\nYou can think of a large enterprise where I had mentioned on an earlier question that there -- the model for the rest of their data center is capex. And they just couldn't make the full jump over to an opex model or at least not yet. And this gives them the ability -- gives them several things. One is it gives them the ability to buy on capex, but to really reserve a lot of their spending for when they actually start using the product.\n\nThe second and this one is more subtle and more important to many customers. Flex is really calculated on a full fleet environment across their entire environment rather than on an array by an array in capability. And what that means is it gives them greater economics, more efficiency, and it gives them much greater flexibility, ergo the Flex, as they build out their data infrastructure. Rob, do you want to add?\n\nRob Lee -- Chief Technology Officer\n\nYeah. I just wanted to jump in and add here for a second. We introduced Flex at the same time that we rebranded and we renamed some of our other subscription offerings to bring them all under the Evergreen umbrella. And that would be Evergreen forever, Flex and then Evergreen One, formerly known as Pure-as-a-Service.\n\nAnd one of the reasons that we did this is it really is a spectrum of ways that customers can get the benefits of the Evergreen architecture and the services we are able to deliver there. And just to put this in perspective, right. We look at this as a spectrum all the way from one end where you have got, as Charlie mentioned, a more capex-oriented customer, more traditional hardware sale that's seeing the benefits of Evergreen through the Forever program, where those assets are being constantly modernized, hardware and software non-disruptively, they get access to future evolution and growth without worry there. On the other end of the spectrum, you have got customers that are fully bought into the cloud operating model, want to effectively turn the keys over to Pure to go and run and manage and say, Hey, we just want to interact based on a performance SLA, capacity basis with full consumption level flexibility.\n\nAnd then in the middle, you have customers that are more in the camp that Charlie was discussing where either as a stepping stone to get to the full cloud operating model, they see the benefits of Flex owning title to the hardware upfront, but seeing the benefits that Flex can offer in terms of flexibility to grow, evolve, as well as redeploy assets across their fleet. And so what we really see with this enhanced and more, I would say, consolidated Evergreen family is introducing a variety of ways for customers to realize the benefits of the core architecture wherever they are on that journey to the cloud operating model.\n\nSebastien Naji -- William Blair -- Analyst\n\nGot it. That's really helpful. Maybe just a quick follow-up on that point, I guess now that you have the sort of middle offering, is this going to be a big driver you think of new customer additions, or was this something that existing customers were asking for and it's going to be a big driver of expansions within those accounts? Can you help me think about how you are thinking about those aspects?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nYeah. I really think it's both that certainly for existing customers that -- and we have reported this in the past that we are looking at Evergreen One, but at the end, fell back to capex because of their unfamiliarity with that buying model. We think Evergreen Flexes now gives them that opportunity to get into a capacity-oriented subscription model. And secondly, no doubt, for customers that -- or for prospects that want to try Pure, but want to do so on an as-you-go basis, I think it can open up new opportunities for us.\n\nSebastien Naji -- William Blair -- Analyst\n\nGreat. Very helpful. Thank you.\n\nOperator\n\nThank you, Sebastien. Our next question comes from Tom Blakey from KeyBanc Capital Markets. Tom, please go ahead.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nCouple of questions here. I think just listening to Rob talk about the change in products. I mean going forward, is it fair to say that the strength that we are seeing in product and obviously early in share gains, Charlie, will be coming from more of a subscription-based sale. Maybe this kind of software model last question here, just the precursor, holding back product growth, so strengthen long-term deferred here in the quarter.\n\nSo going forward, we can expect some mechanisms there, just going out maybe in the fiscal '24. Is that something we can expect in terms of the product revenue growth? And I have a follow-up on the service side.\n\nKevan Krysler -- Chief Financial Officer\n\nWell, we definitely believe that subscription should outpace product growth. That's been our -- that's our long-range plan and certainly what we believe. But I would also remind everybody on the call that, in fact, our Evergreen subscription, the entire range of it, even the Evergreen Forever, which is attached to a capex sale does in fact, over time reduce the capex sale. And that's because we never have to replace an existing, so customer never has to replace an existing system.\n\nSo many -- the storage industry, a significant portion of their sales is just selling a new system to replace an old system. We always see that in our subscription line. We don't see that in a -- you don't see that in a product sale line. You see that in growth in subscription.\n\nSo it's a different way to sell product. We only sell it once. The customer never has to buy it a second time.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nOK. Great. I thought the upfront portion of the subscription sales was recognized in product, not all-in. And then so --\n\nKevan Krysler -- Chief Financial Officer\n\nYou are right. It's subscription. So when we do an Evergreen One transaction, the entire value would be reflected as a subscription. Evergreen Flex, the hardware portion obviously would be in product, but the consumption piece would be in subscription.\n\nAnd then for Evergreen, Evergreen Forever, all of the Evergreen Forever attached for that subscription is reflected as subscription revenue. Hopefully, that's helpful for you.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nVery clear, Kevan. Thank you. And then second question, I guess related more to the services side. We know this is where the data services and workloads and basically your overall software portfolio is there.\n\nAny commentary you can give in terms of maybe you are getting a little more steep here? Any like type of up-sell callouts you can call maybe an attach rate of software to new enterprise deals now? Any type of like help you can give that can give us comfort in terms of continued strong growth here on the services line as it relates to software would be helpful. Thank you.\n\nKevan Krysler -- Chief Financial Officer\n\nAbsolutely. Well, we are seeing a large fraction, probably more than 50% of the software sales are going to existing customers, but a significant amount are going to new customers as well. And I would say that also, even within existing customers, it may be a new buyer within that customer account. I would say that a large fraction are into enterprise customers more so than on the commercial side and a small, but increasing amount coming from channel source.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nAll right. Thanks, Kevan. Thank you.\n\nOperator\n\nThanks, Tom. Our last question comes from Rod Hall from Goldman Sachs. Rob, please go ahead.\n\nBala Reddy -- Goldman Sachs -- Analyst\n\nHey, guys. Thanks for squeezing me in. This is Bala on for Rod. Congrats on a good quarter.\n\nI double click on the guidance, really strong guidance for the second half. Implied Q4 guidance, it looks like it's up meaningfully from what you are thinking before. I am just wondering if there is any large deal. I know you mentioned that telco deal got back and then Meta ramp, I know you said Meta could be lumpy and then it didn't do much business this quarter.\n\nSo could one of those large deals be helping in Q4, that's why there is in guidance? And I have a follow-up.\n\nKevan Krysler -- Chief Financial Officer\n\nYeah. Thank you. A couple of things. Meta hasn't changed in terms of our remarks earlier.\n\nI think when we were coming into the year and our view on Meta. So that hasn't changed meaningfully. And then in terms of how we are thinking about the second half, we will walk through that a fair amount in terms of how we are thinking about it. Our approach hasn't changed.\n\nWe continue to evaluate and analyze our pipeline and opportunities. We are staying very close with the sales leadership team who have a very good pulse on the business. I wouldn't call out anything specific as we think about implied Q4 on any particular deals. It's just where we are falling out based on the visibility we have over the next two quarters or the remainder of the year.\n\nBala Reddy -- Goldman Sachs -- Analyst\n\nOK. Thanks, Kevan. Follow-up, product gross margins at 69%, still very strong, but down slightly, only slightly from last quarter. I understand FlashBlade new product, FlashBlade S, that could carry lower margins.\n\nSo maybe it's that. But I am just wondering, given your commentary about not planning to increase the list prices for your products. I am just wondering what are you seeing in terms of competition, are you seeing any increase in intensity at all?\n\nCharlie Giancarlo -- Chief Executive Officer\n\nLook, we are having some great success in terms of the opportunities we are in and winning those opportunities. I have said and been very consistent with my remarks on product gross margin that the high-60s is our sweet spot, and we continue to be in our sweet spot of product gross margins. Frankly, when I start getting into the 70s, it's a bit hot in terms of sustainability and what we can do with our customers. So I actually like where we are in terms of our product gross margin profile, if that's helpful.\n\nBala Reddy -- Goldman Sachs -- Analyst\n\nAll right. Thank you.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nOK. Thank you.\n\nOperator\n\nAll right. Thank you, Bala. This concludes the question-and-answer session. At this time, I will turn the call back over to Charlie for closing remarks.\n\nCharlie Giancarlo -- Chief Executive Officer\n\nWell, as I hope we have been able to convey, we believe Pure Storage is well-positioned to grow both in the near and in the long-term. We have this unique combination of product portfolio and operational rigor to continue to lead our industry, and we continue to improve our game every quarter. We enable organizations everywhere to build a cloud operating model for their private and hybrid cloud infrastructure. We lead in solutions for the all-flash data center.\n\nWe have the most advanced services and tools to automate data management for both traditional and modern cloud native applications. And we are definitely the clear sustainability and energy reduction leader now. I am deeply appreciative to all of our employees for their innovation and their diligence to our partners and suppliers for their ongoing partnership to our customers for entrusting Pure Storage with their mission-critical data storage and management needs and to all of you that follow us so closely each and every quarter. Thank you all very much and have a wonderful rest of your day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSanjot Khurana -- Investor Relations\n\nCharlie Giancarlo -- Chief Executive Officer\n\nKevan Krysler -- Chief Financial Officer\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nRob Lee -- Chief Technology Officer\n\nShannon Cross -- Credit Suisse -- Analyst\n\nTim Long -- Barclays -- Analyst\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nNehal Chokshi -- Northland Capital Markets -- Analyst\n\nDavid Vogt -- UBS -- Analyst\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nSebastien Naji -- William Blair -- Analyst\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nBala Reddy -- Goldman Sachs -- Analyst\n\nMore PSTG analysis\n\nAll earnings call transcripts"
}