{
  "companyName": "SYNNEX",
  "companyTicker": "SNX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/27/synnex-snx-q3-2022-earnings-call-transcript/",
  "content": "SYNNEX (SNX -1.35%)\nQ3 2022 Earnings Call\nSep 27, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning. My name is Brent, and I will be your conference operator today. At this time, I would like to welcome everyone to the TD SYNNEX third quarter fiscal 2022 earnings call. Today's call is being recorded [Operator instructions] At this time, for opening remarks, I would like to pass the call over to Liz Morali, head of investor relations.\n\nLiz, you may begin.\n\nLiz Morali -- Head of Investor Relations\n\nThank you. Good morning, everyone, and thank you for joining us for today's call. With me today are Rich Hume, CEO; and Marshall Witt, CFO. Before we continue, let me remind you that today's discussion contains forward-looking statements within the meaning of the federal securities laws, including predictions, estimates, projections or other statements about future events, including statements about strategy, plans and positioning as well as our expectations for fiscal year 2022.\n\nActual results may differ materially from those mentioned in these forward-looking statements as a result of risks and uncertainties discussed in today's earnings release, in the Form 8-K we filed today and in the Risk Factors section of our Form 10-K and our other reports and filings with the SEC. We do not intend to update any forward-looking statements. Also during this call, we will reference certain non-GAAP financial information. Reconciliations of GAAP to non-GAAP results are included in our earnings press release and the related Form 8-K available on our Investor Relations website, ir.tdsynnex.com.\n\nThis conference call is the property of TD Synnex and may not be recorded or rebroadcast without our permission. I will now turn the call over to Rich. Rich?\n\nRich Hume -- Chief Executive Officer\n\nThank you, Liz. Good morning, everyone, and thank you for joining our call. One year ago, we held our first earnings call as TD SYNNEX having closed our merger on September 1, 2021. In our first 12 months together, we've accomplished a lot and have validated the value proposition that led to our merger.\n\nOver the past 12 months, we generated $2 billion in revenue, over $1.7 billion in adjusted EBITDA and $11.35 in non-GAAP earnings per share, representing 35% in accretion and well above our initial 12-month target. In addition, we have already realized merger-related cost synergy benefits of $140 million, which is ahead of our initial expectation of $100 million in the first year. Making those results possible, our teams have been hard at work harmonizing every area of TD SYNNEX from partner-facing elements, benefits and policies, to organizational design, finance and IT systems, corporate branding and culture. As a result, we have become one combined company through an incredibly busy and dynamic year.\n\nAnd I would like to personally thank our more than 22,000 coworkers for their exceptional work, dedication and perseverance in helping to make it possible. With the first year behind us, we believe that the thesis for our merger is stronger today than we anticipated last September. Our partners now more than ever realize the importance of broad global capabilities and deep customer relationships to help them efficiently expand. For our 150,000-plus customers, the majority of which are small and medium-sized IT resellers, it is increasingly important to have a trusted partner to help them navigate the IT landscape, especially in high-growth technology areas such as hybrid cloud, security, analytics, IoT as well as others.\n\nWe are pleased with the fact that these areas had robust growth in the quarter and continued to outpace our overall growth rates on an annualized basis. In addition, our Hyve business, which serves the hyperscale infrastructure space, also exceeded our revenue growth expectations for the quarter. Turning to the third quarter. We performed above our expectations with worldwide revenue growing 7% year over year and 15% in constant currency when normalized for the merger-related revenue recognition policy alignment.\n\nThis is better than the adjusted growth of 10% year over year that we expected when we provided our Q3 outlook in June. Growth in the quarter came from across our business with robust demand in endpoint, data center and hyperscale infrastructure. In PC specifically, where we primarily serve the commercial segment, we continue to see solid commercial client device demand and ASP increases during the quarter. We also saw robust revenue growth on a constant currency basis across all three regions.\n\nFiscal '22 has played out in line with our expectations at the beginning of the year with strong customer demand in the areas like data center, networking, hybrid cloud, hyperscale infrastructure and security projects. Supply chain disruptions continue to exist and remain elevated in the areas of data center, infrastructure and networking although improved in areas like endpoint, including PCs, which have seen moderating year over year growth rates. Given the variety of factors that have led to these supply chain issues over the past two or three years, it will take time to get back to a normalized supply chain environment. Our backlog remains elevated compared to our historical levels, and we anticipate that we will continue to see industry supply imbalances well into 2023 in some product categories.\n\nAs we look ahead to the fourth quarter, we project a solid demand picture as evidenced by our revenue guide of mid- to high single-digit growth when adjusted for constant currency and the merger-related revenue recognition policy alignment. Despite the less than certain environment ahead, we believe we have built a strong, resilient business that has a long history of successfully operating in many different macro cycles. Our broad solutions portfolio, liquidity profile and variable cost structure have allowed us to deliver results through dynamic changes in the economy. We continue to believe that the overall IT market will grow.\n\nWe also believe that solutions like hybrid cloud, security, hyperscale infrastructure, IoT and analytics will have growth rates above the overall IT market and as we have discussed in the past, we are investing in these high-growth areas. Progress is evident on our high-growth technology strategy as year-to-date revenue in this area grew more than 20% and represented more than 20% of our third quarter total gross billings. We were also recently recognized with two very important partner awards. TD SYNNEX was named Hewlett Packard Enterprise Global Distributor of the Year for 2022 and the Microsoft Worldwide Partner of the Year for 2022, our second consecutive year in achieving this honor.\n\nThese acknowledgments are important testaments to our commitment to invest and partner with top technology vendors, providing our customers with outstanding solutions based on leading-edge cloud and as-a-Service technologies. For our customers, this is key as we help simplify complexity, accelerate their time to market, reduce the skills gap and help them expand their portfolio to new markets. Marshall will provide further details on our merger-related cost synergy attainment in a few minutes. So let me give you an update on our ERP system consolidation in the Americas.\n\nAs mentioned earlier this year, our Canadian conversion efforts were successful, and approximately 90% of our Canadian business is now transacting in CIS, the ERP system used by legacy SYNNEX. Our U.S. transition is now underway, and we expect to have a meaningful portion of that activity migrated by early Q1 with the remainder transitioning throughout fiscal 2023. In closing, I am proud and energized by how the efforts of our entire global team have come together and believe that we have the necessary market-leading capabilities and resources to serve the IT partner ecosystem now and into the future.\n\nBefore I turn it over to Marshall to provide additional details on our financial performance, please note that our thoughts are with all of those impacted by Hurricane Ian. The safety and well-being of our coworkers is top of mind for us. And with one of our main offices in the Tampa Bay area, we are carefully monitoring the storm's progress and projected path. Marshall, I'll turn it over to you.\n\nMarshall Witt -- Chief Financial Officer\n\nThanks, Rich, and thanks to everyone for joining us today. We performed well in fiscal Q3 with revenue growth above our expectations and margin growth year over year. This is a testament to the focus and commitment of our teams amid the hard-to-predict macroeconomic backdrop. Please note that comparisons versus prior year are on an as combined basis, which assumes the merger occurred at the beginning of the period.\n\nTotal worldwide revenue for fiscal Q3 was $15.4 billion, up 7% year over year and up 15% in constant currency when normalized for the revenue recognition policy alignment relating to the merger. This is better than the 10% adjusted year over year growth rate we expected when we last spoke in June. Euro devaluation accounted for an approximate $700 million headwind year over year. From a revenue perspective, all three regions grew in the quarter.\n\nAnd we saw broad-based product growth across distribution with robust double-digit growth in high-growth technologies. Hyve had a record quarter as this high-growth technology business responded to unusually strong hyperscale demand. Gross profit was $916 million and gross margin was 6%, down approximately 30 basis points from Q2 primarily due to customer and product mix. Total adjusted SG&A expense was $544 million, representing 3.5% of revenue, in line with our expectations and down approximately 30 basis points compared to Q2.\n\nNon-GAAP operating income was $398 million, up $44 million or 12% year over year. And non-GAAP operating margin was 2.6%, up approximately 10 basis points year over year, driven by cost discipline and merger synergy execution. On a constant currency basis, non-GAAP operating income increased 15% year over year. Due to the higher-than-expected interest rates during the quarter, non-GAAP interest expense and finance charges were $50 million, $5 million above our outlook.\n\nAnd the non-GAAP effective tax rate was approximately 24%, in line with our expectations. As a reminder, our outstanding senior notes bear a fixed interest rate, while interest rates on borrowings under our term loan are variable and borrowings under our revolving credit facility bear a floating interest rate. We have partially hedged the variable interest rate on our term loan. Total non-GAAP net income was $263 million and non-GAAP diluted EPS was $2.74, consistent with our previous guidance.\n\nNow turning to the balance sheet. We ended the quarter with cash and cash equivalents of $351 million and debt of $4.1 billion. Our gross leverage ratio was 2.4 times and net leverage was 2.2 times. Accounts receivable totaled $8.1 billion, up from $7.9 billion in the prior quarter.\n\nInventories totaled $9.8 billion, up approximately $1.3 billion from the prior quarter but offset by approximately $1.2 billion of increased AP as our partners continue to adjust their terms. More than half of the inventory increase was in our distribution network. This increase was due to strong revenue growth and the elevated backlog. As a reminder, the majority of this inventory is covered by price protection agreement and recovery of inventory carrying costs.\n\nThe remainder of the increase represents purchases for our hyperscale infrastructure business to support the demand forecast of our customers. These inventory increases carry minimal risk and generally result in margin increases for Hyve. We expect this inventory to translate to revenue and profit generation in Q4 and beyond. All in, we expect inventory turns to improve in Q4 and into fiscal '23.\n\nOur net working capital at the end of the third quarter was $3.9 billion, an increase of approximately $300 million from Q2. Our cash conversion cycle for the third quarter was about 23 days, up 2 days from Q2. And our cash used in operations in the quarter was approximately $67 million. From a shareholder return perspective for the current quarter, our board of directors has approved a cash dividend of $0.30 per common share.\n\nThe dividend is payable on October 28, 2022, to stockholders of record as of the close of business on October 14, 2022. We continued executing on our share repurchase program in the quarter, repurchasing $30 million of our stock and $83 million through the first three quarters of fiscal '22. We remain ahead of pace to achieve our targeted repurchases of $100 million for fiscal '22 and are on track for our medium-term target of 50% of free cash flow returned to shareholders in the form of dividends and buybacks. We have $317 million remaining on our three-year stock repurchase authorization, which expires in July of 2023.\n\nFinally, from a merger-related cost synergy perspective, we remain ahead of plan for year one, expecting to recognize $140 million, compared to our initial plan of $100 million. We continue to expect to achieve a total of $200 million in cost synergies by August 2023. Now moving to our outlook for fiscal Q4. We expect total revenue to be in the range of $15.2 billion to $16.2 billion, which when adjusted for currency impacts of approximately $700 million and revenue recognition policy alignments of approximately $450 million equates to growth of around 8% at the midpoint on a year-on-year basis.\n\nGrowth rates are expected to be lower than Q3, primarily due to the unusually strong hyperscale demand in Hyve in Q3 and a more cautionary approach to guidance given the macro backdrop. Our guidance is based on a euro-to-dollar exchange rate of $1.01. Non-GAAP net income is expected to be in the range of $259 million to $290 million. And non-GAAP diluted EPS is expected to be in the range of $2.70 to $3.10 per diluted share based on weighted average shares outstanding of approximately 95.2 million.\n\nThis equates to full year '22 non-GAAP EPS of $11.19 to $11.59, compared to the outlook of $11.15 to $11.55 that we provided in June. Interest expense for Q4 is expected to be approximately $60 million, and we expect the tax rate to be approximately 24%. In closing, despite the current economic headlines, we are confident in our business and bullish on the growth prospects for our company given our participation in large and growing markets, our solid history of execution and shareholder value creation and our decades of experience in managing through economic cycles. We will now take your questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Keith Housum with Northcoast Research.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nIf you don't just revisiting real quick the high-growth technology area that was up year-to-date 20%. Rich, can you remind us how big that is of the total business?\n\nRich Hume -- Chief Executive Officer\n\nYes. So usually, Keith, we talk about the high-growth technology segment in terms of gross billings because a lot of those offerings, especially the cloud-based ones, get netted. So as we said in the prepared script, it now is slightly over 20% of our entire business from a gross billings perspective.\n\nMarshall Witt -- Chief Financial Officer\n\nAnd, Keith, gross billings for the quarter came in just under $20 billion.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nGreat. In terms of the guidance, as a follow-up, obviously, we're in a volatile time here. And obviously, you're bullish on the trajectory of the business. But maybe talk a little bit about your puts and takes as you think about your guidance for the next quarter and what it will take to perhaps meet the high end or low end of the range.\n\nMarshall Witt -- Chief Financial Officer\n\nYes. There's a few things that are influencing our overall thoughts for Q4. One is interest expense. Just to step back, when we guided Q3, we guided at $45 million.\n\nAnd of course, we came above that at $50 million. We guided for Q4 at $60 million. So that's probably the biggest EPS difference in terms of where we thought we would be. Certainly, the comment I made about the broader macro environment is putting us in a position we're just being cautious.\n\nAnd as usual, Keith, when we look at the hyperscale infrastructure range, we tend to guide at the lower end of that range.\n\nOperator\n\nYour next question is from the line of Joseph Cardoso with J.P. Morgan.\n\nJoseph Cardoso -- J.P. Morgan -- Analyst\n\nSo first question for me, can you just provide us an update on how backlog has tracked exiting this quarter and how the mix of that is shaking out? Also, where do we stand relative to what you would consider to be normalized levels? And any thoughts to when we might reach those more normal levels?\n\nRich Hume -- Chief Executive Officer\n\nYes. Great question. Thank you very much. So a couple of things.\n\nNumber one is the backlog has come down, but it's sort of the tale of two cities. So first, in the endpoint segment, backlog has come down. And we're finding that the sort of PC ecosystem, things are more serviceable. Interestingly enough, where we -- there is one vendor in particular that there is a really big backlog reduction because they really made quite great progress relative to servicing that backlog.\n\nBut the good news in that is that, that particular vendor has a lot of strength going forward. So this isn't a situation, we don't believe, whereby the backlog runoff and suddenly, we find ourselves sort of trending to having a challenging growth. I mean the demand is strong moving forward. So summarizing again, endpoint is down, but the predominance of that is led by one vendor who has a lot of strength going forward.\n\nAs it relates to what we call the advanced solutions segment, within there, there's many that are still growing backlog and few that either are stable or declining. So within the advanced solutions segment, we have not yet seen the peak, if you will. And we would anticipate that it will take until -- sometime well into '23 until we have stability from advanced solutions perspective. That's barring obviously any new flare-ups from COVID or anything else that might happen in the world.\n\nBut it does remain elevated, and I would say that we'll be in that elevated state for the foreseeable future. Again, crystal ball, sometime mid-'23, maybe there's better stabilization.\n\nMarshall Witt -- Chief Financial Officer\n\nAnd I'd just add to that, you asked the question, Joseph, on what is normalized levels. It's a good question. We didn't track it very extensively pre-pandemic. But if I were just to guess and I'll also look at Rich, it's usually about a month's worth of turn is how I think about it.\n\nRich, do you have any thoughts on that?\n\nRich Hume -- Chief Executive Officer\n\nNo, and we are materially over that still.\n\nJoseph Cardoso -- J.P. Morgan -- Analyst\n\nI appreciate all the color. And then maybe just a quick follow-up on the Hyve business. It sounds like this quarter, the business was very strong, you guys highlighting record levels. But there seems to be broader concerns from the investment community around hyperscale spending moderating going forward.\n\nAnd I think it's led by commentary from some of the component suppliers in memory and storage alike. Just given what you're seeing from your customers today, can you provide any color on what you're seeing relative to demand trend there going forward? And are you concerned of a potential digestion period heading into 2023?\n\nRich Hume -- Chief Executive Officer\n\nYes. Maybe I'll start and then turn it over to Marshall. So first, just a reminder to everyone, we state this every opportunity we get: Hyve is a lumpy business. But we feel as if it always offers great growth attributes on an annualized basis.\n\nAnd so as Marshall said in his prepared comments, this time, the lumpiness was more positive than we thought. So we see good demand. And candidly, I think we see demand consistent with our guide here as we look into Q4, which still is pretty good demand overall for that segment. So I think that from a strategic perspective, we always talk about over the longer period, hyperscale sort of segment being double-digit sort of growth attributes.\n\nAnd I know nothing that would cause me to think differently relative to that segment.\n\nMarshall Witt -- Chief Financial Officer\n\nYes. And, Joseph, I would just add in regards to hyperscale infrastructure on the supply chain constraints, there's also a supply chain inefficiency on the data center availability and opening, so the hyperscalers are struggling to keep up with their capacity themselves. So we do have quite a bit of product that is in queue, ready to be positioned and put into data centers. So it's not just the supply chain itself, but it's all the way through to getting the rac hold into data centers.\n\nRich Hume -- Chief Executive Officer\n\nYes. If I could, just to kind of finish Marshall thoughts, this supply that he talked about in queue, we have hard orders for all of it. It's just the ebbs and flows of the construction of the data centers.\n\nMarshall Witt -- Chief Financial Officer\n\nThat's right. And that stays, obviously, inventory on our books, which is one of the reasons why we see elevated inventory in the high space.\n\nOperator\n\nYour next question is from the line of Ruplu Bhattacharya with Bank of America.\n\nRuplu Bhattacharya -- Bank of America Merrill Lynch -- Analyst\n\nRich, from the commentary that you gave, it looks like demand remains very strong. I mean you talked about continuing demand even in the PC business, the endpoint business; and strong growth, more than 20%, in the Advanced Solutions business. But I'm trying to reconcile that against what we've heard so far from OEMs, right? So we've heard certain OEMs talk about weakness in the PC end market consumers -- consumer PC market, but also in the commercial PC market, some weakness developing. And then some OEMs have talked about some incremental weakness in the enterprise businesses as well.\n\nSo help us reconcile like the strength that you're seeing versus what we're hearing from OEMs. Is there -- could it be because of share gains that you're having? Could it be because of synergies that you're seeing revenue synergies? So how should we reconcile the commentary that we're hearing from some OEMs versus what you're seeing?\n\nRich Hume -- Chief Executive Officer\n\nYes. Ruplu, thanks for the question. First, I think it's important to highlight once again that we don't have a big reliance upon the consumer segment. And from our numbers perspective, the consumers segment is where things are being more deeply felt.\n\nSecond, I think once again here, we benefit from our portfolio. We have the privilege of serving the top-tier PC vendors in the market. And sometimes those demands for product ebb and flow between them, depending on their cycles, etc. So I think that, that serves us well.\n\nI know that Marshall has some more detailed comments he wants to make. But I just want to be clear that when we take a look at our Q3, the -- both the endpoint and advanced segment had pretty significant growth. And actually relative to the midpoint of our guide, the upside for us really came from that endpoint segment, which is PC ecosystem content as well as Hyve, as Marshall had talked about earlier. We look into Q4, we see an overall reasonably healthy environment as well.\n\nSo we really feel pretty comfortable relative to the execution in each of our segments as we move into Q4. But Marshall, I know that you have some particular ASP and unit volume information you wanted to share.\n\nMarshall Witt -- Chief Financial Officer\n\nYes. Ruplu, on the PC ecosystem for our distribution network, it's not an exact science. But if we look at our Q3 results, volume was probably in the low to single-digit growth rate, and ASP was probably in the high single to low double-digit growth rates. So all in net-net, we grew in the PC ecosystem business.\n\nRich Hume -- Chief Executive Officer\n\nAnd I think, Ruplu, what's going to happen through time is that those ASPs will probably start to abate or come down in the U.S., probably not in the not-too-distant future. So there will be some moderation there. Europe is a little bit more tricky to figure out from an ASP perspective. We all know that things might start to abate from an inflationary perspective, but the currency hockey stick weakening of the euro is sort of a second dimension that manifests itself in increased ASPs as we know that, that industry is pretty much a dollar-based industry.\n\nSo it takes a lot more euro to buy sort of the PC category. So I think that ASP dynamic in Europe might have a bit longer of a life relative to what we might see in other jurisdictions.\n\nRuplu Bhattacharya -- Bank of America Merrill Lynch -- Analyst\n\nOK. OK. I appreciate all the detail. Can I ask you -- you had also talked about solutions aggregation and integration as a new opportunity for the combined company.\n\nWhen do you think that materializes? And is this like in the next 12 months? Or is this an opportunity that is longer term? And what type of investments do you need to see the revenues -- material revenues from that opportunity?\n\nRich Hume -- Chief Executive Officer\n\nYes. Very good question. So if you go back to our Investor Day, we talked about solutions aggregation being a build in '22, '23, '24. We're well underway relative to aggregating multi-vendor solutions in our cloud marketplaces.\n\nThis happens quite frequently. And we also have been building a whole inventory of what we call click-to-run solutions. So these are preconfigured solutions that we make available on our cloud platform. So that's a ramp.\n\nCertainly, that helps to accelerate our overall cloud platform growth. Typically, the margin profile of aggregated solutions are better than point product sales overall. So it's a build, to answer your question, '22, '23 and then into the future, but it is a critical element of strategically driving our cloud growth going forward. And then, of course, as you know, I think we said in the late '24 or '25 time frame, we really then move into sort of this orchestration model.\n\nSo we're building out all of those platform capabilities. So to answer your last question, the investments that have to be made are in resources: engineering resources to qualify these aggregated solutions; certainly more technical sales resources; and then the last piece is the investment in the platform, which isn't all lined up, but we've been continually incrementing those investments as we move over time.\n\nOperator\n\nYour next question is from the line of Ashley Ellis with Credit Suisse.\n\nAshley Ellis -- Credit Suisse -- Analyst\n\nI was wondering, if we could go back to guidance and look at it on a sequential basis, using kind of our estimated historicals, it seems like growth is slower than usual for the fourth quarter. Marshall, could you maybe give us kind of like what are the headwinds? What are your expectations for currency? Are you expecting kind of a step-down in Hyve at the low end of the range? And then if I kind of interpret the comments on backlog, is it fair to assume that maybe 3Q benefited from PC backlog coming down? But in fourth quarter, you think overall backlog will stay flat? Just anything to kind of bridge us to the 2% growth in the fourth quarter?\n\nMarshall Witt -- Chief Financial Officer\n\nSure. I'll start and then let Rich also touch on whatever you want plus backlog. So you do think about the sequential relationships, Ashley, we did have a strong Q3. And so that does make the compare to Q4 a little bit more unusual.\n\nTypically, we'll see a 5% to 10% revenue growth rate. At 8% constant currency, it's kind of right in the middle. So I think that explains some of the relationships. If you think about the headwinds, we did call out FX continuing to be impacted by the euro.\n\nWe're guiding at $1.01. It wasn't that long ago when we were at $1.18 and $1.19. So that continues to have some headwinds for us. And then I did mention in the conversations around Hyve, when we do guide, we typically go toward the lower end of the high outcome in the ranges.\n\nBut with that said, we still expect year-on-year growth within the hyperscale infrastructure, high-growth technology business as well as solid growth in the distribution networks, whether it's Asia Pac, Europe, or America. Rich, I don't know if you have anything you want to add to that?\n\nRich Hume -- Chief Executive Officer\n\nNo. Thank you, Marshall. It's quite comprehensive.\n\nAshley Ellis -- Credit Suisse -- Analyst\n\nOK. And then looking at your merger synergies, I mean, typically, the -- both companies have always kind of overperformed -- outperformed and generated more synergies. So do you see room to raise that $200 million target? And then kind of as the macro environment is weakening, how are you thinking about your spending? And would you maybe consider -- I know you're keeping Asia and Europe on their own ERP systems. Is there maybe opportunity to move those to the same system? Just kind of maybe like a plan B in the event that we go into a recession, how are you thinking about spending and synergies?\n\nMarshall Witt -- Chief Financial Officer\n\nYes. I'll touch on synergies. So you're right, Ashley, we have typically overperformed our synergy targets, not only earlier but higher. Right now, as you saw in our prepared remarks, we're at $140 million.\n\nSo that stepped up $10 million from the last time we spoke. We still are confident in the $200 million of synergies as we exit the second year. But I do also believe that as we get closer to this year end and kind of do a bottoms-up thought for all of fiscal '23, we'll probably have more informed conversations on what that outlook may be. But for now, the $200 million is a good number to use.\n\nRich Hume -- Chief Executive Officer\n\nYes. And on the back end, on the ERP systems, we've got a lot of work to do. In the U.S. in particular now, we're in the middle of that migration from the legacy Tech Data ERP onto the CIS system.\n\nWe are steadfastly focused on that. The plan was that we would maintain our ERP systems outside of the U.S. and then keep everybody all hands on deck because we're going to have a combined $40 billion entity. I want to make sure we aren't distracted and get that done properly.\n\nAnd then sometime down the road, we will carry out an evaluation to determine whether there are future changes to the ERP or whether it makes sense the way we're aligned right now.\n\nOperator\n\nYour next question is from Adam Tindle with Raymond James.\n\nAdam Tindle -- Raymond James -- Analyst\n\nI guess I wanted to start on EMEA since you said its strength in Europe is a reason for the mid-teens non-GAAP operating income growth in constant currency during the quarter. I think that's probably surprising to some people. So maybe you could comment on the cadence of demand there and what you're seeing here at the end of September in the EMEA region. There's just so many macro headlines on recessionary fears and everything related to that.\n\nJust wondering what you're learning real-time there, the cadence of demand through Q3 real time in September and what's embedded in your guidance for Q4 for Europe.\n\nMarshall Witt -- Chief Financial Officer\n\nYes. Adam, I'll start and then, Rich, you can chime in. So from a cadence standpoint in Europe, Adam, what we saw year-on-year by month, it strengthened. And we saw continued strength in August, and our guide continues to reflect that confidence as we think about Q4.\n\nSo it is -- I don't know if the word is surprising, but it is definitely something we didn't expect to see that kind of strength continue and grow. And speaking with our European team, they do the same thing that the rest of the world does. They do bottoms-up analysis and forecast and are quite convicted looking at the overall macro backdrop plus the supply chain issues and their demand to come up with our thoughts around Q4. Rich?\n\nRich Hume -- Chief Executive Officer\n\nYes, Adam. So first, a little bit of a pleasant surprise. Actually, when we take a look at the entirety of the channel, it had a mid -- sort of mid, slightly higher single-digit growth rate overall. From memory, Marshall, correct me if I'm wrong, but I think that we -- relative to the visibility that we have, we grew substantially higher than that.\n\nAnd so our business has strength in Europe. And as Marshall has stated, for the coming quarter, we sort of build bottoms-up and have a good visibility from a country-country-country perspective. And the aggregate of that is a pretty robust outlook, if you will, for Q4 as well. So we, like you, read the headlines relative to the challenges in Europe, yet technology seems to be a solution to help in driving some efficiencies for a lot of business entities.\n\nAnd I think that we always talk about the fact that when things are tough, IT outpaces GDP. And I just think -- my own personal opinion is that it's such a useful tool and is a necessary tool in order for businesses to remain competitive going forward that there seems to be, I'll call it, more consumption than historical levels. And how long will that hold up is yet to be seen. But right now, we see a pretty solid environment in the third quarter and as part of the projection in the fourth as well.\n\nAdam Tindle -- Raymond James -- Analyst\n\nOK. And maybe as a follow-up, Marshall, on cash flow. It's just been volatile since the merger. And I look at it here, you're talking about an inventory build.\n\nI understand the Hyve component, but you did say the majority of that build is related to the distribution business. So kind of trying to figure out what got you comfortable letting inventory days continue to extend in the core distribution business given you have a softer guide for forward growth. Those kind of odd dynamics for those to -- you usually have a more robust forecast for forward growth as you let inventory days grow. And the timing for that to flush out? And then maybe just lastly, not to build too far on this question, but I think cash flow is just so important given the targets that you have out there for this medium term.\n\nAny kind of structural dynamics you can talk about outside of the cyclical inventory days on payables and receivables here? There's a lot of offsetting factors, and I'm wondering if there's temporary benefits, how we think about kind of the normalized structure and normalized cash conversion cycle beyond the inventory days. So starting with the inventory cyclicality aspect and then the structural aspect of how the business will generate $1 billion-plus in cash flow next year.\n\nMarshall Witt -- Chief Financial Officer\n\nYes. Sure. I'll start and then, Rich, certainly chime in as you've got other comment or -- but we still expect to generate $1 billion in free cash flow in '23, assuming a stable supply chain environment. So that -- just want to make sure that you understand that.\n\nAnd then just going one level down or clicking into that, in Q3, our inventory did go up by over $1 billion, as we said, both for distribution and Hyve caused reasons. AP offset that for the most part. As I said in my prepared comments too, Adam, inventory should -- and we expect this to translate to revenue profit generation in Q4 and beyond. Obviously, there's volatility in supply chain, and there's some temporary effects and delays in our cash flow.\n\nThinking back and just looking at our seasonality, we just finished our first year around the sun together. And it does give us a sense of what cash days do. If -- when you look at last year, we finished at 15 in cash days and now we're at 23, so up 8. What caused that? Basically, the split, 50-50 between, we'll call it, high infrastructure and distribution.\n\nWe do think that, that starts to abate and unwind in Q4 and into '23. But at the end of the day, it really does come down to the overall certainty or volatility around supply chain and how that manifests itself into '23. And Rich, anything else you want to add?\n\nRich Hume -- Chief Executive Officer\n\nYes. So, Adam, I want to make sure everybody understands that it's not lost on us, the importance of free cash flow and generating free cash flow. As I think about it, a big part of this has been due to the volatility, the ups and downs of of the prior pandemic, etc. And I actually went and carried out some analysis to take a look across our vendor base and look at what's happening with their inventories.\n\nAnd largely speaking, they're elevated pretty materially as an aggregate group. So -- and again, I think that's just the manifestation of trying to manage the shorts and longs through what we've been through. That being said, I fundamentally believe that moving forward, we will find our way to -- our profile in cash says. We do start to, as I said earlier, see stability within the PC ecosystem.\n\nSo there is less, I'll call it, erraticness. And it might be a little bit bumpy in the AS space for the first couple of quarters of next year, but I think that we find a pretty great swing as we move through the year. So yes, I'd say correct that they're elevated, but we have all the confidence that we can manage to profile once we get some of these challenges around the supply chain, some of them.\n\nOperator\n\nYour next question is from Vincent Colicchio with Barrington Research.\n\nVincent Colicchio -- Barrington Research -- Analyst\n\nA lot of questions on cost synergies. I'm curious, are you seeing any meaningful revenue synergies? Just what are your thoughts there?\n\nRich Hume -- Chief Executive Officer\n\nYes. Again, on the revenue synergies, we clearly have a lot of opportunity around revenue synergies. As we move into a common ERP system, they become a lot more executable because you have all of the, I'll say, the vendors that one site had that the other site didn't that you can take advantage of. And so I believe that as we get to sort of the start of next year, there will be a ramp.\n\nAnd as we move through the year, we'll be able to take more advantage of that because we'll move more toward being on that one ERP system, have all the training done, not only on the ERP system, we're in the middle of that now, but also the cross-training that happens with the vendors that one site had that the others haven't. All of that will sort of be, I'll say, FY '23 activity in ramp. So we definitely see that opportunity ahead of us.\n\nVincent Colicchio -- Barrington Research -- Analyst\n\nAnd obviously, in the middle of a large integration, if we move into a meaningful recession here, should we expect you to be opportunistic perhaps on smaller deals?\n\nMarshall Witt -- Chief Financial Officer\n\nI'll go first on this. I think given our history and experience and if you're talking about actual inventory buys, are you talking about M&A opportunities, Vince, I want to make sure I answer...\n\nVincent Colicchio -- Barrington Research -- Analyst\n\nThe latter.\n\nMarshall Witt -- Chief Financial Officer\n\nM&A?\n\nVincent Colicchio -- Barrington Research -- Analyst\n\nYes.\n\nMarshall Witt -- Chief Financial Officer\n\nI would say regardless of the economic environment, I think we've been pretty steady in our ability and appetite to look at deals that are that are appropriate and value-added, whether it's a footprint expansion or capability expansion. But Rich?\n\nRich Hume -- Chief Executive Officer\n\nNo. I think that's right. I mean we're frequently around the table with our strategic teams looking at pipeline, if you will. And we believe we have the balance sheet if we see the right set of assets to pursue them.\n\nI think that although the market would articulate that there's a buying opportunity, just based on the way multiples are rolling, I think people are still at the realization of a I was here. And I'm still worth where I was. So some of that test of time will have to pass. And again, I think that our company will continue to be acquisitive as the two companies previously have always been, and it's a matter of just finding the right assets and being patient to make sure that you find things which are complementary to your business.\n\nOperator\n\nYour next question is from Alek Valero with Loop Capital Markets.\n\nAlek Valero -- Loop Capital Markets -- Analyst\n\nI'm actually on for Ananda. So my question is, are you guys seeing any impact from pricing broadly? And if price were to come down, would you see any impact to margins?\n\nRich Hume -- Chief Executive Officer\n\nSo maybe I'll start there. We still are living in an environment of either price stability or ASP increases. Certainly, we have a long history of seeing those things ebb and flow through time. And I can't predict when, but I think in time, prices will either be stable or start to decrease.\n\nIn the instance when those prices start to come down, typically, we have the opportunity to retain our margin profile because we take on that inventory at a particular with the vendors are selling into for. Typically, we're able to hold our overall margin profile. Marshall has commented that in a escalating ASP environment that we've seen in the past that we've benefited somewhere around 10 basis points. That's starting to slow down a little bit because there's not as much activity.\n\nThere is a bit of a smoothing happening there. But as we move forward, we would expect that the margin profile of the business would stay reasonably stable regardless of the price, either increases or decreases.\n\nAlek Valero -- Loop Capital Markets -- Analyst\n\nMaybe as a quick follow-up. So for your key product areas, are you guys -- do you guys have any sense of which areas are getting softer and maybe stronger? And maybe if you could expand by geography as well?\n\nMarshall Witt -- Chief Financial Officer\n\nAlek, was the question about where we're seeing strength and weaknesses in our product capabilities globally?\n\nAlek Valero -- Loop Capital Markets -- Analyst\n\nYes. That's right. And your product areas.\n\nRich Hume -- Chief Executive Officer\n\nSo I'll start with this. I mean we in Q3 had seen uniform strength across all of our major product categories basically in every region. So there wasn't anything that surprised, if you will, to the downside, which, frankly, it might be a bit unusual. And as we had, I think, commented earlier, if you think about our adjusted revenue of 15% in Q3 and the midpoint of the guide in Q4 being sort of 8.5-ish overall, there isn't anything that's really falling out, but rather, I think it's a fairly uniform view of, I think, revenue growing in each of the categories going forward, maybe a little bit less growth in the Hyve business unit, but the other ones are, I think, pretty good.\n\nI mean high single digit is pretty good in my book. So there isn't a particular area that I would say that we would report in Q3 as being weak.\n\nOperator\n\nYour final question comes from the line of Jim Suva with Citigroup.\n\nJim Suva -- Citi -- Analyst\n\nWe know that from the past, the Hyve business has had some big builds and then some inventory digestion or some unpredictable linearity in it. As you sit here now running your company and look at the demand from it, is that business at a equilibrium point? Or I know it was just a big quarter. Is there some inventory digestion that has to occur from where you sit and see this?\n\nMarshall Witt -- Chief Financial Officer\n\nJim, yes, it still remains fairly lumpy. As we've said, to give a little bit broader perspective on a, call it, a trailing 12-month basis or year-on-year, both revenue and operating income continues to grow in that space. One thing we did mention earlier, Jim, is that there is some capacity constraints with our hyperscale data center customers, where their demand is greater than their ability to absorb. And so what we do is we have our racks or the racks that we've customized for our hyperscaler customers sitting in kind of a ready-to-go position.\n\nIt's inventory on our books until they accept it, and then it translates to revenue. And then we're -- it's through the cycle. That has built up over the first three quarters of this fiscal. I think that's one thing that, as that normality comes into play or equalizes in '23, we may see inventory related to that start to come down.\n\nJim Suva -- Citi -- Analyst\n\nOK. That makes sense. And then switching gears to -- oh, go ahead.\n\nMarshall Witt -- Chief Financial Officer\n\nJim, I was just going to say and it's more a reminder that for what we do in that space around our hyperscale customers, we do get paid for holding that for them until they're ready to digest. So it's not inventory that isn't being recovered from a margin perspective.\n\nJim Suva -- Citi -- Analyst\n\nOK. That makes sense. And then can you remind us again of your PC percent of total company exposure maybe in totality and then the breakdown of consumer versus enterprise and then maybe Europe versus U.S.? Because it just seems like there's a lot of changes that are on the come for Europe versus U.S.\n\nRich Hume -- Chief Executive Officer\n\nYes. So let me answer the global question. Marshall can keep me honest. We talked about this a little bit in the last earnings call.\n\nSo the PC exposure overall is sort of low 20% of total revenue or portfolio. The consumer piece is sort of the mid-single digit of the total portfolio percent. And I don't know, Marshall, do you have the facts relative to Europe versus the Americas. I think they're reasonably balanced, right?\n\nMarshall Witt -- Chief Financial Officer\n\nYes. I think they are. It's fairly equal.\n\nRich Hume -- Chief Executive Officer\n\nYes. So there isn't a strong concentration in one versus the other. One caveat to that. In Europe, we have a mobility business with one of the top-tier mobility vendors.\n\nSo that -- if you were to consider the mobility within PC, then there might be a bit of a larger concentration in Europe. That mobility business is quite healthy right now.\n\nMarshall Witt -- Chief Financial Officer\n\nAnd that's primarily commercial.\n\nRich Hume -- Chief Executive Officer\n\nIt's primarily commercial. No, actually, in Europe, that mobility business serves sort of the broad market, commercial and consumer.\n\nMarshall Witt -- Chief Financial Officer\n\nOK.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLiz Morali -- Head of Investor Relations\n\nRich Hume -- Chief Executive Officer\n\nMarshall Witt -- Chief Financial Officer\n\nKeith Housum -- Northcoast Research -- Analyst\n\nJoseph Cardoso -- J.P. Morgan -- Analyst\n\nRuplu Bhattacharya -- Bank of America Merrill Lynch -- Analyst\n\nAshley Ellis -- Credit Suisse -- Analyst\n\nAdam Tindle -- Raymond James -- Analyst\n\nVincent Colicchio -- Barrington Research -- Analyst\n\nAlek Valero -- Loop Capital Markets -- Analyst\n\nJim Suva -- Citi -- Analyst\n\nMore SNX analysis\n\nAll earnings call transcripts"
}