{
  "companyName": "Charlotte's Web",
  "companyTicker": "CWBHF",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/charlottes-web-cwbhf-q2-2022-earnings-call-transcr/",
  "content": "Charlotte's Web (CWBHF -2.15%)\nQ2 2022 Earnings Call\nAug 09, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to Charlotte's Web Holdings Inc. second quarter conference call. [Operator instructions] This call is being recorded on Tuesday, August 9, 2022. I would now like to turn the conference over to Cory Pala, director of investor relations.\n\nPlease go ahead.\n\nCory Pala -- Director, Investor Relations\n\nThank you, Marina. Good morning, everyone. Thank you for joining us for our 2022 second-quarter earnings conference call for the Charlotte Web Holdings, Inc. Our Q2 earnings press release and financial statements have been posted on the Investor Relations section of our website and filed on sedar.com in Canada, as well as in the U.S.\n\nwith the SEC. On today's call, we will share some high-level comments on the quarter and an update on the business initiatives for '22 and beyond. We will take questions from our analysts at the end of our prepared remarks. A replay of this call will be available through the next week via the details provided in our earnings release and a webcast replay of the call will be available for an extended period of time accessible through the IR section of our website at Charlotte'sweb.com.\n\nAs a reminder to our listeners, certain statements made on today's call, including some answers we may provide to certain questions, may include content that is forward-looking in nature, and therefore, subject to risks and uncertainties and factors which could cause actual future results or company performance to differ materially from implied expectations. Such risks are all outlined in and forward-looking statements are all outlined in detail in the company's regulatory filings on sedar.com in Canada and sec.gov in the United States. In addition, during the call, we will refer to supplemental non-GAAP accounting measures, including adjusted EBITDA, which does not have any standardized meaning prescribed by GAAP. Please refer to the earnings release contained in the Form 8-K that we filed this morning for a description of adjusted EBITDA as well as a reconciliation on such measures to the respective and most directly comparable GAAP financial measures.\n\nAnd with that, I now hand over the call to Charlotte's Web chief executive officer, Jacques Tortoroli. Jacques?\n\nJacques Tortoroli -- Chief Executive Officer\n\nThanks, Cory. Good morning, everyone, from Colorado. Thanks for joining our call. I've been joined -- I will be joined this morning by Greg Gould, our recently appointed chief financial officer; and Jared Stanley, our COO and co-founder.\n\nGreg started consulting with the company in April and officially joined us as the CFO in June this year. With more than two decades of CFO experience leading multiple small- and medium-sized businesses within the natural wellness and biopharmaceutical sectors, Greg brings significant financial and operational experience. On today's call, Greg will go into more detail on our financial results, and Grad will share updates on regulatory progress in the U.S. as well as two key international markets, Canada and the U.K.\n\nand provide some color on our innovation pipeline and strategy. I'll then share our latest progress against key initiatives we outlined in our last earnings call before opening up the floor for your questions. I underestimated the time it would take us to turn our revenues back to growth, and that's squarely on me. For a trailblazing company like Charlotte's Web, which has pushed the envelope and service to its community's needs and scaffolded an exploding industry, we found massive success.\n\nOnce again, we find ourselves in a time of evolution that our industry and consumers demand, so we pivot to push forward. That doesn't come without difficult challenges. It requires strategy, foresight and an entrepreneurial mindset. I do want to make a few things clear right upfront.\n\nWe modestly grew revenue sequentially in Q2 to $19.8 million before taking a provision for probable product returns from one specific customer. This does bring up a point I'll come back to later -- but we still fell short of last year's revenue. We reported gross profit margin of 49% in the quarter. However, that reflects the just mentioned returns provision as well as a $1 million inventory reserve.\n\nWithout those two items, gross margin would be at 61%, consistent with our expectations on a normalized basis. We lowered operating expenses and essentially held cash comparable to March end. No one wants our business to turn around faster than this leadership team and I do. I won't point to the state of the industry or the lack of regulation.\n\nIt's more about capabilities and execution. On execution and retail, we have to be better and we will. While we're number one in unaided awareness, we must be far better at translating that into consumer journey that is steeped in relevance and encourages trial and loyalty. We use price promotions more than we should and have had a subpar user experience on our site.\n\nAll causal factors, which we began addressing in February and March, and we are moving swiftly forward. We'll have a new e-commerce platform for 2023. We've elevated expanded sales talent. We have an earned and paid media plan supported by our refreshed brand world steeped in the world, consumers are living now.\n\nWe previously discussed our priority growth pillars, and we'll share progress later in this call. Our expectation remains to generate operating cash flow in Q4. At the end of June, we had $14.8 million in cash, slightly up from March. In July, we further reduced headcount, eliminating approximately 60 positions to lower our compensation costs for second half and 2023, and we're closely managing operating expenses to ensure we spend only behind our growth priorities.\n\nThese actions follow reducing annualized costs by over $20 million in January compared to 2021. Greg will share more on this and more color on our second-quarter results. So, let me turn the call over to Greg.\n\nGreg Gould -- Chief Financial Officer\n\nThank you, Jacques. As Jacques stated, we were able to deliver operating improvements for the quarter and position the company for neutral to positive cash flows in the future despite lower-than-expected revenues. In the second quarter, our net revenue was $18.9 million, down 21.8% versus $24.2 million in the same quarter of last year. The lower revenue for the second quarter reflected year-over-year declines in both our direct-to-consumer and business-to-business divisions, with the larger difference in the B2B, which was down 34%.\n\nFor better transparency, Q2 net revenue of $18.9 million included an allowance for specific return reserves of $900,000, with the majority of this related to a single customer and their related warehouse distribution planning. Excluding the increase in the specific return allowance of $900,000, Q2 revenue would have been $19.8 million, an increase of 2% over Q1 2022. Turning to our B2B business; the second quarter B2B revenue was $5.9 million, down $2.9 million from $8.5 million just last year. Revenues in our B2B channel contributed 29.7% of the total revenue in the quarter.\n\nIf we did not take the $900,000 specific revenue reserve discussed in my prior comments, our B2B revenue for Q2 would have been $6.5 million, which would have been an increase of 4.1% compared to our Q1 B2B revenue. As of the second week of July, Charlotte's Web market share in food and drug mass retail was 22.4%, up 0.04 share points year-over-year versus Q2 2021. We have made share gains in the natural specialty channel, gaining over point percentage point to 15% versus a year ago according to Spensdata. Turning to the second quarter E2C revenue.\n\nOur e-commerce business revenue was $13.3 million, down $2.4 million or 15.3% from $15.7 million in the same quarter last year. The decline is primarily attributable to lower web traffic which was partially offset by a 41.8% year-over-year increase in active subscribers, going from 17,000 subscribers to this year, 25,000, and e-commerce conversion rates were strong at 15.6%, up 1.9 percentage points versus a year ago. For reference, most CPG branded outside of CBD have conversion rates of just 2% to 3%. On a sequential basis, our D2C business grew $100,000 from Q1 of 2022.\n\nCharles Webb continues to maintain the largest e-commerce business in the CBD industry and increasing our online traffic and conversion are key priorities for us. This is our largest revenue channel, contributing 70.3% of the company's total net revenue in the quarter. Even though we are far from satisfied with our revenue during the second quarter. We are cautiously optimistic that we have stopped these declines in revenue and have even seen a slight increase in Q2 revenue as compared to Q1 of this year once the increase in the specific return allowance is removed.\n\nTurning to the gross margin. Gross margin in the quarter was 49.4% versus 65.5% in Q2 of 2021. The reason for the low gross margin in this year's quarter was that we took the $900,000 specific return allowance against revenues and $1.9 million of inventory provisions during the quarter. Excluding these two items, gross margin was 61%.\n\nWe continue to model gross margin percentage in the high 50% to low 60% range depending on product mix in future quarters. Turning to SG&A expenses. As a result of our cost reductions taken in late 2021 in the first half of this year, SG&A expenses were $17.3 million, down $7.9 million or 31.5% compared to the same quarter in the prior year. with further cost reductions taken in July, including reductions in certain administrative expenses and headcount, we are well positioned for annualized SG&A run rate of below $70 million by Q4 of this year.\n\nThe net loss for the quarter was $7.9 million or $0.05 per share versus a loss of $5.9 million or $0.04 per share a year ago. Adjusted EBITDA was negative $5.4 million versus negative $5.1 million for Q2 of last year. However, this decrease is only $100,000 from the Q1 of 2022, which was negative $5.3 million. we would have seen a significant improvement over Q1 adjusted EBITDA if we had not incurred the $900,000 specific return allowance against revenues and the $1.9 million of inventory provisions during the quarter.\n\nTotal cash used from operations for the first 6 months of 2022 was $4.3 million as compared to $16.2 million in the first half of 2021. In the second quarter of 2022, we generated $400,000 of operating cash flow as compared to using $4.7 million in Q1 of 2022. We expect to continue this trend of positive operating cash flow in the second half of 2022 and due to expense reductions and operating efficiencies combined with anticipated quarter-over-quarter revenue growth in the back half of the year. Cash and working capital at June 30 was $14.8 million and $64.6 million, respectively, compared to $19.5 million and $75.6 million at December 31, 2021, and relatively unchanged from the first quarter of this year.\n\nAs of the date of this call, our cash has increased to approximately $17 million due to additional collections from the IRS refunds that happened after June 30, 2022. As you are aware, we terminated the JPM credit facility in July and are now in discussion with lenders on a new, more flexible credit facility that we expect to close in the near future. I will now turn the call over to Co-Founder and COO Jared Stanley.\n\nJared Stanley -- Chief Operating Officer\n\nThank you, Greg. I would like to start by echoing Jack's sentiments to the opportunity in front of us. As we stabilize our business to positive cash flow, we will ensure we can properly capitalize on our strategy. I'd like to give a brief update on the core initiatives we are executing on.\n\nI'll start with our new product verticals. On our last call, we discussed the opportunity we see in beverages and cosmeceuticals. While these remain priorities for us, and we have intellectual assets created in both verticals -- we do see a significant opportunity prioritized in our innovation pipeline, the Charlotte's Web sports line. The CBD sports category is gaining great momentum with MLB's recent second-quarter public announcement to approve CBD sponsorships, which is we believe, was a landmark change for a professional sport and is expected to be followed by the other leagues.\n\nThis forward-thinking move by the oldest professional sports league in the U.S. signals the value of CBD to audiences across the nation. In the absence of federal regulation, the sports leagues themselves are carving out guidelines and a set of standards for their players that all consumers can benefit from. That being said, CBD usage is not uncommon among professional athletes as tested recently by one of the NBA's greatest forwards of all time, Kevin Garnett, when he publicly attested that many players are using CBD and to great benefit during the recent Sports Business Journal panel.\n\nIn fact, he went further by saying he uses Charlotte's Web. All of us here know the more people we help, the more we grow our top line and professional athletes and their fans make up an immense market. Major League Baseball alone celebrating its 150th year boast more than 170 million fans in the U.S. and $10 million in Canada with growing fan bases in Mexico and Asia.\n\nThe needs of athletes are the needs of the Charlotte's Web user but for a higher degree of performance, exercise recovery, regular sleep cycles and focus make the difference between winning a championship and going home empty handed. And beyond the athletes themselves, the millions of sports fans attuned to the products that professional athletes use are also looking for high-level quality and trusted products. Charlotte's Web has been catering to every day in the lead athletes alike since its founding given the benefits of our tinctures and gummies. Recently, the company was named the official CBD partner at Angel City Football Club and the leading Los Angeles market and the first partnership with a sports team for Charlotte's Web.\n\nCurrently, Charlotte's Web-owned CBD Medic has established partnerships with professional soccer star, Carley Lloyd. The new Charlotte's Web sports line will launch later this year, pending receipt of Certified for Sport by NASA with nondetectable amounts of THC at less than 9 micrograms per serving or what CW calls in our portfolio, THC-free. Charlotte's Web already provides THC-free options and uses an NSF registered manufacturing facility. The NSF product certification has already commenced, and we expect approval in the not-too-distant future.\n\nI would like to give a brief international update on Canada and U.K. Canada, wow, what amazing progress in Canada recently were nine members of a Scientific Advisory Board with Health Canada have unanimously agreed CBD as safe for human consumption and doses of 20 milligrams to 200 milligrams a day. Currently, this is specific to a 30-day period until longer studies are completed. While there is still some information gaps, this is a major milestone in the CBD category and shows the progress and leadership position Canada has taken to ensure safe consumer access to CBD products and support for CW's products into this important market.\n\nWe commend Health Canada's proactive efforts on confirming the general safety of CBD consumption, but the unanimous agreement is not surprising to us as Charlotte's Web has over four years of safety and preclinical toxicology data that supports safe human consumption within the dosing range suggested by Health Canada. We can speculate the gates are opening in Canada to a larger consumer base and we are currently establishing our supply chain to enter the market to take full advantage of the Canadian CBD market changes. Last fall, we completed our first harvest in Canada to support domestic production of our products. This year, we will be harvesting our early maturing varieties in the Okanagan Valley and completing a variety trial in the Northern growing region to expand our leading cultivation efficiency and CBD potency for the future.\n\nOur hemp biomass aligns well with our Canadian forecast and is suitable to launch products in Canada with success. We are expecting to be in the market, both in medical and retail channels by early 2023. This has taken a bit longer than expected due to the regulatory process, but we are moving forward with confidence to execute brilliantly. Let me now move to U.K.\n\nAs you may know, CW was one of the first companies to be validated by FSA for our full-spectrum original formula tincture. As of August 2, we are additionally validated for our CO2 extract tinctures and capsules while awaiting evidence validation on our gummy portfolio. The FSA validation means our applications are complete and awaiting formal scientific review on its safety profile. More importantly, this validation means CW products can be sold in the U.K.\n\nmarket in the interim, CW, one of the few brands to have this distinction. Our focus for growth with our U.K. partner, Savage Cabo has been to drive PR and brand awareness using these milestones as a launch point. We have seen an 81% increase in traffic to our distribution partner site and a 14% growth from Q2 over Q1, with Q3 tracking even stronger.\n\nThese signs are incredibly positive in the brief time we have had in the market. We also see tremendous upside upon landing brick-and-mortar retailers upon full scientific review from FSA. We also understand the intellectual assets held within our vertically integrated supply chain by owning each step of our process, supported by our more than four years of safety and toxicology studies on our extract ingredients, we believe these assets allow CW to eventually seek potential biotech partnership to pursue an investigative new drug or IND to follow an FDA-approved path. We are exploring this as part of our strategy to become a broader botanical wellness solutions company, leveraging and continuing commitment to our leadership in dietary supplements.\n\nLastly, I would like to give an update on Washington, D.C. and our federal advocacy. On our last earnings call, I stated we were in Washington in early February, where we got a lay of the land to enhance our lobbying strategy. I am pleased to announce this strategy now lies in our strategic initiatives for the company and will be prioritized for CW to lead in DC.\n\nWe have brought back to the company, Page Biggie, mother of Charlotte and true founder of Charlotte's Web. Page joins us with intelligence and passion and there's no one more credible than page to lobby for a regulated CBD landscape to provide safe consumer access. As a first step, Page has resurrected a 501c4 she founded in 2014 called Coalition for Access Now. Page's success and leading coalition for Access now can be seen in her previous work reforming CBD laws state to state and pass federal bills such as the Charlotte's Web Medical Access Act of 2015, which gained 78 co-sponsors.\n\nCoalition for Access now is working with a top lobbying firm in D.C. in support of the coalition. They initially targeted and contacted 22 house offices and met with 12 of these offices before August recess. The meetings were extremely positive.\n\nWe are expecting support from the members coming off August recess, and we look forward to supporting the coalition to progress HR 841. With that, I'll hand it over to Jacques.\n\nJacques Tortoroli -- Chief Executive Officer\n\nThanks, Jared. I want to share progress against the same revenue priorities I discussed on my first call with you. First, we are penetrating new industry verticals and expanding our retail presence. A new water ship partner with SBM places Charlotte 12 products and employer wellness programs, offering CW as an option for employees in their employer plans is a massive accomplishment.\n\nSBM estimates that up to 50,000 employees will participate in this program in the first year. We also entered the Instant needs rapid delivery channel and a new partnership with GoPuff that launched in July and is rolling out nationally to 2.4 million consumers -- in other verticals, in retail, we're entering the spirits vertical with a partnership in Chicago market where CW will be on shelf providing wellness alternative to ABV choices. We are in discussions with distributors to further our presence in this untapped vertical. In partnership with Cardinal Health, we have now reached thousands more independent pharmacies.\n\nAs you know, pharmacy is the second largest distribution channel, the 20% share in CBD behind only e-commerce, which holds a 40% share of distribution. We entered the fitness and body care vertical through partnerships with Lifetime and Massage Envy. A new partnership announced earlier this morning with Hanson Fasco Sales and Marketing, Inc. We're expanding access to thousands of retail doors across channels via the distribution relationships just in the Midwest alone.\n\nThis relationship aims to significantly increase the number of sales reps for Charlotte's Web at retail. For perspective, Hansen Faso works with K with 15,000 customers, Unify with 43,000 customers and many more distributors and direct retailers. And today, we're announcing the launch of coming months of CW sports line of peak-free products. we identified sports as an untapped opportunity for us entering into a partnership with ACFC and Los Angeles and couldn't be more enthusiastic with the move from MLB.\n\nWe look forward to the opportunities ahead to lead this category; this is impressive progress since our last earnings call. Our new business pipeline is robust with more to come in the months ahead. It confirms we have the right new leadership with a passion for growth and executional excellence. New distributor partnerships, as well as direct discussions, will strengthen our access to other new verticals like hospitality, travel, duty-free retail and leisure.\n\nThese new customers, distributors and brokers are significant pieces in moving the business forward, and very little of these are reflected in our Q2 revenues. Full distribution in all available doors will take some time. Improving our execution in store will take some time. but we're on track to grow.\n\nIt's still a long game, but our right to win is clear. Second, growing existing customers' business and expanding velocities. This has been the most challenging priority for us, and it comes full circle to my opening comments on execution. We and our customers just aren't sufficiently activating in store and in media to bring foot traffic to retail.\n\nWe haven't had enough feet on the street to ensure our products are on shelf in the right locations with the right amount of facings contractually granted. We haven't done enough to educate in-store salespeople, trainers and managers about Charlotte's Web and CBD. And we haven't done enough sampling programs. During my days that Bacardi used to say nothing better than liquid tollips, and so it is true here.\n\nThat's why we're moving toward a distributor model and away from a largely direct sale model. We simply can't resource a direct mile to execute brilliantly. While we're gaining new distribution relationships and availability, we're also assessing our existing distributor relationships that simply aren't moving the needle -- improvement through substitution with bigger and better partners that are motivated to grow our and their business is what we're looking for. That's how we gain resources to merchandise our facings, ensure shelves are restock timely and activations executed.\n\nWe know CW products have a three times to six times higher velocity than other CBD brands, yet a, still garner shelves. We, like the rest of the CBD players have to often used price promotion rather than working in lockstep with our customers to build demand and incremental velocity at retail. Thirdly, D2C traffic has continued to decline year over year. I want to remind you that our e-commerce is number one in the industry by far and 70% of our revenues, and it should be even bigger.\n\nTo do that, we've got to spend and reverse the trend in traffic. Here too, I underestimated the work needed and the time it will take to bring new consumers into our ecosystem, but we have it. We are testing new content and paid media platforms to increase awareness and relevance and culture so that we can convert them to consumers on our e-commerce site. We are being more strategic with the depth and frequency of promotional pricing campaigns.\n\nThe simple truth is the average lifetime value of an e-commerce consumer is enormous. That means growing our traffic by leveraging our QR codes, for example, for education, ease of entry into our e-commerce platform, investing in a relaunch of a new cw.com in 2023 to improve user experience and ease of shopping, supporting our unparalleled customer care team to help consumers in their shopping journey. And finally, integrating B2B and DTC on marketing, messaging and activation to facilitate consumer shopping from into retail and e-commerce and in glove with retail partners. With that said, we are seeing some positives.\n\nOur active subscriber base increased 42% year over year. Our conversion rates were up 190 basis points to 15.6% versus Q2 last year, which is significantly better than typical CPG conversion rates. Simply said, when we bring people in, they become loyal consumers with high lifetime values. We're expanding our penetration in international markets.\n\nWe continue to make progress in this priority laying foundations for the right route to market through regional and local partners, consistent with our asset-light model. Jared discussed the U.K. and Canada in his remarks. In addition, we also announced the ground-breaking partnership for Greater China, including plans for first ever CW Retail Store Experience Center in Hong Kong coming in 2023.\n\nWe plan to shortly announce new expanded partnerships in several other regional markets. International developed in an asset-light model is the right strategy for us and our ability to leverage our unaided awareness in so many markets we aren't even present in yet. But international truly is a long game play; any choiceful innovation. Our final priority is innovation.\n\nOur view hasn't changed -- cosmeceuticals and beverages remain an untapped format for us that combined more than $0.5 billion annually, according to data from the Brightfield Group. However, we're delaying our launches until late 2023. We prioritized sports for obvious reasons. And we simply don't have the human or financial resources to also launch into these other categories at the same time to ensure success in the market.\n\nSo in conclusion, I'm delighted that we are working on a renewal of the name and likeness agreement with our founders, Stanley Brothers, which we expect to be signed later this month. The agreement furthers the collaboration with and benefit from the brothers as our true brand ambassadors. No one in the industry has what they bring. After all, they founded it and there are significant shareholders who are aligned with our commitment to winning the long game.\n\nI look forward to our ongoing relationship as all shareholders should. Charlotte Tet remains the market leader in total share. Cw.com remains the largest e-commerce business with over 30% higher than our nearest competitor. And e-commerce represents 40% of the total CBD industry sales.\n\nThink of the opportunity as we build traffic and conversions. Charlotte's Web is the leader in the B2B market, and it's only a 2% share. Armas is the second largest CBD channel and note our new distribution partners with Cardinal Health into more pharmacies and SBM expanding us into insurance benefits channel. In a broadly $5 billion marketplace, 67% or some $3 billion of existing share is with thousands of lesser quality brands.\n\nThat presents our right to win without regulation and without industry growth. As we progress our growth opportunities, we continually assess our operating costs. Most recently, again, last month to better position us to be operating cash flow positive later this year based on our revenue outlook. Ending Q2 slightly cash positive to Q1 is encouraging evidence of this commitment.\n\nWhile others certainly see the current state of regulation as a threat, we simply see new opportunities every day. Our progress on regulatory front, as Jared mentioned, is exciting. I've never been more challenged, yet more enthusiastic about our tremendous potential. We must sustainably grow the business by executing on our strategic priorities.\n\nCharlesworth is a unique company that's built an industry into a global wellness movement. Charlotte's Web is CBD. We know what it takes to push forward through evolutionary times to execute successfully and we'll do just that. Never losing sight that we are playing the long game.\n\nWith that, thanks for your participation. And now I'll turn the call over to your questions.\n\nOperator\n\n[Operator instructions] Your first question today is coming from Scott Fortune with ROTH Capital Partners.\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nThanks for the question. I want to start kind of what you're seeing. Seasonality, second quarter is usually a very strong quarter in the space in this category. And I wanted to get a sense of the challenges for more macro consumer side with inflation or the category or kind of higher-priced ticket items that you're kind of seeing the flatter growth, especially with the initiatives you put in place here for leading into the second quarter.\n\nJust to get a sense of the overall CBD market in general and the health of the growth from that standpoint going forward here?\n\nJacques Tortoroli -- Chief Executive Officer\n\nYes, Scott. Thanks for the question. I'll take the question. If you look at the Brightfield data, right, they're estimating that the market is going to grow about 6% this year.\n\nAnd if you then overlay their optimism around what regulatory would mean. I project the market will double. So there is growth projected by bright in the category. As I said earlier, for me, the immediate opportunity is gaining share in the $3 billion marketplace that exists today that is an opportunity for us against other competitive set.\n\nI think as I said earlier, we're looking at sequentially improving our top line as we go through the rest of the year. And I don't sense that we're seeing an impact of inflation on demand. I think, again, it's more about our execution in retail, and we're addressing that as mentioned in the remarks as well as continuing to focus on turning around the traffic declines that we've seen over the last year or so in our e-commerce side. So I'm optimistic.\n\nAnd I think the opportunity for us is really there to take advantage of, and I think you'll see that going through the rest of the year and beyond.\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nOK. I appreciate that. And just kind of follow on that. You've announced some new initiatives kind of a shift a little bit in the strategy going more distribution from that standpoint.\n\nBut can you provide a little more color on kind of some initiatives you put in place to drive sales and marketing earlier this year, what channels you're focused on? And just kind of you haven't really seen the increase there, gaining market share. You said that not enough resources really focused on that. What are you seeing, as you mentioned, playing focus in California. What's kind of been the tough challenges there with gaining more market share kind of the low-hanging fruit in some states of California and some that are as they have the biggest print per se?\n\nJacques Tortoroli -- Chief Executive Officer\n\nYes. So clearly, we're continuing to look at expanding our doors and the partnerships we announced in the remarks, going to certainly help us do that. My point on moving from direct to a more distributed route to market is that as I, and I'm sure you walk into different stores at retail, we don't always show up where we should. We don't always show up with as many facings as we have a right to.\n\nAnd we're not driving enough sort of trial and consumer engagement to the category into Charlotte's Web. So by having a distributor model, it gives us access to their feet on the street, their reps that are in the trade every day. and able to ensure that if we're out of stock, we're restocked on shelf. And it allows us the ability to do better executions and activate in stores, whether it's through promotion, whether it's through education, whether it's through sampling programs.\n\nWe just don't have -- we haven't had the resources to do that excellently. And this model shift to more of a distributor arrangement allows us to get that incremental feet on the street, if you will, to ensure that we show up relently in-store and at retail.\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nAppreciate it.\n\nOperator\n\n[Operator instructions] Your next question today is coming from Pablo Zunk with Fitzgerald.\n\nPablo Zuanic\n\nJust a question regarding Canada. I know it's early days. It's so far just a proposal. So I guess we shouldn't get too excited about it.\n\nBut as the market begins there, we expect also some of the problems we've seen in the U.S. that you have too much fragmentation, low barriers to entry. I mean, yes, it will be nice that you can buy CBD over the counter and not just the dispensaries without a prescription, but could we see the same problems we've seen in the U.S.? Or will there be more clear guidelines that will give us some protection in that market? Or we don't know at this stage because it's so early.\n\nJacques Tortoroli -- Chief Executive Officer\n\nYes. I'll turn it over to Jared.\n\nJared Stanley -- Chief Operating Officer\n\nI can handle that question. Sure. I don't think we will see the same issues that we see in the U.S. And firstly, it is a really good question.\n\nBut you have to keep in mind, CBD is a Schedule II controlled substance in Canada today. And these guidelines are saying, \"Hey, this is safe and what does Health Canada's next approach in response to regulating the category, which is the major difference than what the position the FDA has taken, which is no position to regulate the category. Today, there's actually tremendous upside in getting our brand into Canada, even without the transition from the medical and retail channel from dispensaries. And the reason I say that is because Canada in the cannabis market is around a $5 billion market.\n\nCBD-only products of that market make up around $150 million, but put this into perspective and the market today in Canada, gummies, which is what Charlotte's Web does on about approximately a third of its portfolio in revenue, and gummies in Canada does just over $30 million, but that $30 million is made up by less than 10 brands and arguably five or six brands. So even today, with a brand coming into Canada and not because it's such a highly regulated category, we're not competing against the thousands of current brands in an unregulated FDA market, and we see very much a transition from the medical and retail to a Health Canada regulated market. So we're speculating that this is going to be the model that's set forth and that the FDA would hopefully follow suit from Health Canada's guidelines.\n\nPablo Zuanic\n\nThat's very helpful. And just one last one. So we are hearing -- and you tell us if you're hearing the same thing that maybe the farm bill, there may be some adjustments to it that they cap on CBD on hemp on CHC maybe increased from 0.3% to 1%. We are hearing some CBD companies talking maybe about entering the LTAs and offering other products.\n\nWhat are your views on that? Is that likely to happen? And what would be your response from a product portfolio point of view?\n\nJared Stanley -- Chief Operating Officer\n\nSure. Well, the increase of THC that's potentially being proposed is on the cultivation only. And we don't believe that we believe that's a bit of a long shot. We have a saying and when you're lobbying for something when you ask for too much of it, you get none of it.\n\nAnd we believe that changing the federal statute from 0.3% to 1% is a bit of a Helmer. But -- as far as Delta and people that are actively marketing and selling THC products derived from hemp. We have a position that we are against within our company, and we believe that it will support federal regulation and give more pressure to the FDA to drive a process for the CBD category. In that process, we are in support of HR-841, which establishes the NDI process, which is Charlotte's Web's new dietary ingredient notification, which was submitted to the FDA in March of 2021, and we believe our portfolio sits best within a naturally occurring full-spectrum hamper act with products at less than 0.3% THC.\n\nPablo Zuanic\n\nAnd maybe one last one. Just when we think about Europe, I know you've talked about, I think, the U.K. and other markets there. But from outside, it seems that it's quite difficult to build distribution.\n\nAnd if you find a partner there, you're working on a very basic B2B format. So the pricing is not that great. Maybe a bit more color in terms of how you can penetrate that market? What is it too late to some extent?\n\nJared Stanley -- Chief Operating Officer\n\nSure. I don't think -- you want to handle some of this, John. I'll add the small part of it, which is the reason it's slow to access this market is because similar to what Canada has done, but Europe and U.K. are asking for validation and applications, and they're using science-driven data and safety to ensure a product registration, which then will open up doors into the market.\n\nIt is a bit of a wild west, and there's a ton of clutter out there because currently, if you're in Europe, some people are actively marketing and selling CBD products, whether it's in the form of vape pens or flower, smokable flower, but we, as a publicly listed company or going through the proper steps to ensure our product is validated, legal and then registered within those jurisdictions to open up broader distribution for the future?\n\nJacques Tortoroli -- Chief Executive Officer\n\nI was just going to add, below that. I do believe that our asset-light strategy on route to market and international markets is the right one. having distribution partners who know the market, know the culture are successful and have route to markets with substantive clients is the way to go. And we remain stewards of the brand and how the brand shows up.\n\nBut we do have a number one in many markets and unaided awareness for Charlotte's Web, where we don't have product yet. So we really see an opportunity there as the regulatory environment sorts itself out over time.\n\nPablo Zuanic\n\nThank you.\n\nOperator\n\n[Operator instructions] There are no further questions at this time. Cory, you may proceed.\n\nCory Pala -- Director, Investor Relations\n\nOK. Well, thank you, Miranda. I would like to thank all of our shareholders for participating today on the call. We appreciate your support and patience, and we look forward to updating you in mid-November, following our Q3 results.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCory Pala -- Director, Investor Relations\n\nJacques Tortoroli -- Chief Executive Officer\n\nGreg Gould -- Chief Financial Officer\n\nJared Stanley -- Chief Operating Officer\n\nScott Fortune -- ROTH Capital Partners -- Analyst\n\nPablo Zuanic\n\nMore CWBHF analysis\n\nAll earnings call transcripts"
}