{
  "companyName": "Waterdrop Inc.",
  "companyTicker": "WDH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/09/waterdrop-inc-wdh-q2-2022-earnings-call-transcript/",
  "content": "Waterdrop Inc. (WDH -0.89%)\nQ2 2022 Earnings Call\nSep 09, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and thank you for standing by for Waterdrop Inc.'s second quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the meeting over to your host for today's call, Ms. Xiaojiao Cui. Please proceed, Ms.\n\nCui.\n\nXiaojiao Cui -- Investor Relations\n\nThank you, operator. Hello, everyone. Thank you for joining Waterdrop's second quarter 2022 earnings conference call. Please note that the discussion today will contain forward-looking statements made under the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.\n\nForward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from our current expectations. Potential risks and uncertainties include, but are not limited to those outlined in our public filings with the SEC. The company does not undertake any obligation to update any forward-looking statement, except as required under applicable law. Also, this call includes discussion of certain non-GAAP measures.\n\nPlease refer to our earnings release for a reconciliation between non-GAAP and GAAP. Joining us today on the call are Mr. Shen Peng, our founder, chairman, and CEO; Mr. Yang Guang, co-founder, director, and VP; Mr.\n\nHu Yao, co-founder, director, and, VP; Mr. [Inaudible], our partner; Mr. [Inaudible], our partner and general manager of medical crowdfunding and patient services. We will be available for a Q&A session after the remarks.\n\nNow I would like to turn the call over to our CEO, Mr. Shen Peng. Please go ahead.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nHello, everyone. Thank you for joining our second quarter 2022 earnings conference call. There have been a range of external challenges and uncertainties in this quarter. Demand for insurance products has been delayed as a result of weakening consumer confidence caused by the COVID resurgence and other external factors.\n\nDespite these headwinds, Waterdrop is still firmly committed to being user-centric, further developing its business and creating shareholder value. We also proactively explore new business opportunities in this evolving market environment. In the second quarter, we made further progress on reforming our business strategy to maintain momentum and achieved a record-high profitability. Our revenue increased by 8.1% quarter over quarter.\n\nWe achieved non-GAAP net profit for three consecutive quarters and net profit for two consecutive quarters. On top of this, our net profit almost doubled sequentially, reaching RMB 207 million and, once again, exceeding market expectation. Despite some ground quarter fluctuations and the fact that our insurance business is currently the only profit contributor, our brilliant results confirm that we have entered into a phase of steady profitability. In the second half of 2022, we will appropriately increase our investments in new businesses.\n\nAlthough the current economic cycle is near bottoming, we remain optimistic about the Chinese economy and the healthcare industry and will maintain our strategy of achieving high-quality and sustainable developments. Our confidence comes from our strong combination. We will strive to achieve the goal we set for our shareholders at the beginning of the year, which is to achieve a healthy and sustainable operating profit for our existing business for 2022.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nIn the last few quarters, we have adjusted our business strategy from pursuing scale expansion and rapid growth, to cultivating a healthier and more sustainable world. Our operating and financial performance is heading in a positive direction. Having said that, we have been constantly reviewing our business strategies. And in the second quarter, we made some realignment to our organizational structure and the business divisions.\n\nWe believe structure adjustments will allow us to achieve even higher goals in future.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nOur current strategy remains to enhance the value of our products and cater to users' needs. We adhere to two principals while implementing these strategy, some operations with full compliance and a high quality and sustainable development, specifically, in daily operations, we have proposed four pillars to prioritize: management, efficiency, service, quality, and reputation, so as to achieve the refinement and implementation of our strategy.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nLooking to the second half of the year and beyond, we will down to implement our development together, strengthen our capabilities, and cope with margin changes in a practiced, flexible, and adaptable way. We will identify the new business opportunities and spare no effort to explore a healthier growth model.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nOverall, the implementation of our strategy will build on the solid frameworks formed by our product innovation capability, technological innovation, and the synergies created among various unique business segments. Particularly in the near future, with China's population aging more rapidly, the upcoming demand for insurance coverage will continue to increase and evolve. We will continue in working hard and achieving in a low profile. We also strive to leverage our solid fundamentals and the high technological capabilities to efficiently and accurately explore new opportunities that emerge any kind and do our best to reap additional returns from the new model.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nAs a technology platform for insurance and the healthcare services, since our inception in 2015, we have persistently adhered to our mission of revenue internet technologies to make the insurance protection more inclusive and accessible to the public and to bring insurance and the healthcare services to billion. In July, we released our 20 2021 ESG report, which was the first ESG report published since our IPO. The report details our responsibility in technology and products, industry value chain, workplace development, green environment, and other relevant topics. It also illustrates how we leverage our innovative business model and the technological innovation to achieve effective business performance and sustainable products.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nWe attach great importance to our great ESG efforts. Along with our strict compliance with relevant laws and regulations, we have developed to rigorous management systems in core governance, compliance operations, supplier management, employee management and a low-carbon green development. At the same time, we also leverage our business strength and the technological innovation to integrate resources from various partners, thereby promoting sustainable creation of social value.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nIn addition, we are actively engaged in establishing a multilayer medical protection system that serves our supplementary layer through our Waterdrop Medical Crowdfunding, Waterdrop Insurance Marketplace, Waterdrop Charity, and other businesses so as to prevent critically ill patients from becoming impoverished. As of the end of Q2, a total of 412 million donors provided nearly RMB 53.3 billion to millions of patients with critical illnesses through our Waterdrop Medical Crowdfunding platform, leveraging our sophisticated technology. The Waterdrop Charity platform has helped improve the efficiency of fundraising and fund utilization by providing charity organizations with all around support. Our other campaigns cover a wide range of areas, including anti-pandemic actions, disaster release, poverty alleviation, and rural revitalization.\n\nThese initiatives prove that we will adhere to being a responsible company with social responsibility and doing business for growth as we pursue business growth.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nAs a leader in our industry, we are committed to driving the healthy development of the ecosystem. In response to the authorized funding activities in the Medical Crowdfunding industry, we collaborated with other major Medical Crowdfunding platforms to crackdown on such activities in June. Some intermediaries have acted in the name of helping patients with critical illnesses with raise funds on medical crowdfunding platform and charge them on unauthorized referrals for high commissions. This malicious activity not only damages the healthy ecosystem of the industry but also harms the interest of donors and fund raisers.\n\nOur World Waterdrop Medical Crowdfunding platform has taken pre-emptive steps to identify such unauthorized fundraising activities with high accuracy through a stringent review process and risk control system. On the one hand, our risk management team contacts the fund raiser to verify their crowdfunding claims based on reports and the complaints we received from users. On the other hand, we have developed a model powered by algorithm and AI technology to analyze from recent activities based on information and cases referral chain of fund raisers and donors, and proactively screen and identify suspicious unauthorized cases. Our crowdfunding consultants further verifications by conducting on-site visits and interviews.\n\nOnce confirmed, we blacklist the fund raisers who have involved in the identified cases so that they will no longer be able to initiate another campaign. At the same time, those malicious intermediaries are restricted from any access forwarding or permission on the platform. Thanks to the relentless efforts the number of authorized fund raising activities on our platform has been significantly reduced.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nHowever, recently, we have seen some reports posted in the media, which have now clearly distinguished between our crowdfunding platform and those malicious intermediaries. Taking that, Waterdrop has charged high service fees for this Medical Crowdfunding business, leading some users and the public to misunderstand that Waterdrop takes a large percentage of the fundraising amount. This has also led to some misunderstandings about what are the actions in tracking down on the authorized referrals. We would like to clarify that we have always taken a responsible approach toward cracking down on misconduct similarly users right and promoting the industry healthy development.\n\nEven though this is not an easy task, we remain committed to doing the right things despite the top challenges. We have subsidized the operating cost of our Medical Crowdfunding platform since its establishment for five years. Starting from this April, we began to charge a service fee of 3% of the fund raisers amount to support our platform operations and risk controls. We have never charged high service fees and has pledged to restrain unauthorized activities.\n\nWe have disclosed all of our fundraising campaigns and detailed fund flows to the public, and welcome supervision from our users and the public and will take legal measures to bring illegal intermediaries to justice.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nAs of today, our Waterdrop Medical Crowdfunding platform has identified undertaken level actions in over 800 authorized profiting making referral cases, targeting more than 600 intermediaries engaged in malicious unauthorized activities. We will make every effort to provide the best services for patients with critical units, cater to patients urgent medical needs and develop the most reliable Medical Crowdfunding passion for all users, thereby earnings and achieving the trust of each of our customers.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nRegarding share buyback, we continue to implement our repurchase program. In the second quarter, we repurchased approximately 1.61 million ADS, and we are continuing to execute the program prudently. At the end of 2022, the company held cash and cash equivalents and short-term investments totaling RMB 3,288 million. After offsetting the cash outflow for share repurchase, we still achieved a positive cash inflow of over RMB 360 million for the single quarter.\n\nAt this earnings release, we are announcing that we launched a new share repurchase program so as to continue to buy back shares for another 12 months, in which we upset the upper limit and may repurchase up to $80 million worth of our ADS. This is a decision that was made based on the judgment of the company's current value and our confidence in our long-term sustainable development. Meanwhile, we plan to reserve repurchase shares for shares incentive plans, which will align the interest of our employees with the growth of the company.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nTo conclude, with people's growing demand for healthcare in China, and as we continue to strengthen our competitive advantages in product, innovation, and business sector synergies, we still believe that the online insurance and healthcare sectors offer us a tremendous and untapped opportunities. In this changing environment, we will remain committed to our mission, keeping the focus on user value, solidifying business fundamentals, and pursuing continuous improvement. At the same time, we will also adhere to strict budgeting and objective management that continue to optimize the structure and the quality of our business growth, thereby achieving healthy and sustainable profitability of our established business for the full year. I will pass to Yang Guang to discuss the development of the Waterdrop Insurance business for Q2.\n\nYang Guang -- Co-founder, Director, and General Manager of Insurance Marketplace\n\nOK. Thank you, Shen Peng. Hello, everyone. Let me give you an update on our insurance business development, life, and health insurance premium growth in China was negated for the first half of 2022, and has underperformed in the P&C insurance industry.\n\nMeanwhile, the life and health insurance reform has not yet had a pronounced effect on the market. And the demand for critical insurance products remained weak. Share performance of the listed insurance company has been languished at a low level for a long time, and their valuation touched a new lows in the end of April. Against this backdrop, we have been proactively reforming our business model, optimizing our business operations and doubling the transformation of growth mode.\n\nThis has helped improve our operational efficiency and strengthen the resiliency of business with new growth drivers. In Q2, our net profit reached RMB 207 million, up by 97% on a sequential basis with the entire profit derived from our insurance business. Now, I will go through the business performance of our insurance business across four effects. First, results of our business model reform.\n\nLooking at the key parameters that demonstrates the continued profitability of our business. In Q2, we further optimized and upgraded our operating system with multiple platforms, multiple product size, and multiple service models, while relentlessly pursuing improvements in both operating efficiency and quality by streamlining our transaction processes to be more user friendly and enriching our product offerings. We continue to see increased revenues from new customers, and our take rate remains at a relatively high level. One year LTV increased by 22% quarter on quarter and 101% year over year.\n\nIn terms of the long-term insurance business, we refined our user group tax. Based on which, we upgraded the sales needs match model to identify customers need more precisely. This has helped improve the customer service efficiency of our sales team. And sales productivity per our in-house LTV increased by 28% quarter over quarter.\n\nAt the same time, we have set up a dedicated team to analyze the sales collision chain of existing user groups. Through interviews with user groups, we have improved user experience in the conversion and retention processes, thereby help increase the three-month policy renewal rate of long-term insurance users up by three percentage points compared with that in previous quarters. In terms of existing customer management, we continue to develop our medical platform of operational model for various marketing platforms, including our WeChat official accounts, WeChat mini programs, Enterprise WeChat accounts, and Waterdrop app. We clarified the long-term positioning of each of these channels to align them with the leads and the preference of different user groups.\n\nWe have strengthened our profit domain operations capability and improved the collaboration between our customer service team and our LP team, handling remarkable results in retaining core user groups, for instance, short-term interest premiums originated from these marketing channels is about RMB 43 million, up by 50%. The number of active app users reached 3.4 million, up by 47%. At the same time, we set up a dedicated team in our long-term insurance business to explore additional protection needs of our existing users and price them with lifetime insurance solutions. The insurance premiums originated from the repeat purchases by existing long-term insurance customers increased by 72% quarter on quarter, increasing the lifetime value of users significantly and also consistently empower new customer acquisition models.\n\nWeChat video accounts. We have continuously reached and polished our content metric of our WeChat video account, heading into effective growing source of the WeChat users. Thanks to our deep outstanding of the communication patterns and user needs of this new marketing platform. The number of users following our video accounts increased by 44% quarter over quarter.\n\nAnd the total insurance premiums originated from this account increased by 133% sequentially. Online brokerage. We have set up and dedicated units in our insurance department to promote the online brokerage business with insurance deem exclusive, leveraging our multiple --multichannel exploration in Q1. The insurance plan model has a clear operating mode of customer attraction through livestreaming and insurance content.\n\nWith the insurance clearly responsible for producing sales convergence with establishment of our living streaming team and our insurance planning team, the number of livestreaming events increased as the number of livestream in the years grew by 140% quarter on quarter. With strict control details, we have achieved an initial manifestation, scaling up these operations. Second, product innovation. In Q2, we have continued to launch more high-quality insurance model product.\n\nThe total number of product offering has increased by 44% this quarter. In terms of short-term insurance product offerings, we now have 11 different cost-effective versions of [Inaudible] coverage medical insurance products. We also improved our critical illness products by offering more flexible options for health declarations and premium payments. Thanks to our ability to accurately match to the leads, the policy renewal rate remains at a high level of 90%.\n\nIn addition, the continued enrichment of our product offering has significantly improved our ability to reactivate dormant users. For example, to meet the lead of customers with preexisting illness conditions, we launched a Waterdrop Blue Ocean, a series of customized and cost-effective illness products. The product has simplified the policy enrollment and claim settlement process, and with the health declaration requirements while keeping underwriting risk of control. This will, to some extent, is the concerns of senior citizens and patients with chronic diseases who are seeking to purchase IC insurance.\n\nIn addition, we have launched Waterdrop [Inaudible], new accident insurance product, which leads the health declaration requirements and relaxes a limit for insurance applicants to 80 years old. As returns from investment products offered by banks have been trending downward, there is increasing customer investment products that offer stable returns. In response to this development, we added incremental life insurance policies to our long-term insurance product offerings in Q2. We also provided our sales steam with special training of distribution of these products, especially to high net worth individuals.\n\nThe insurance premium for incremental life industry products totaled more than RMB 20 million in second quarter. Meanwhile, empowered by annuity products launched in Q1, and the private domain operating capability of traffic coming from our enterprise WeChat accounts, our long-term insurance team has achieved a quarter-over-quarter increase in annuity insurance premiums of 324% in Q2. Third, upgrades, updates on the auto brokerage business. We continue to explore different brokerage service model in different regions and cities.\n\nAt the end of Q2, we had 11 regional brokerage licenses. During the quarter, we set up a branch in Shanxi and two new outlets in Hubei province. The brokerage team expanded to nearly 600 staff, generating the total premium income of about RMB 8 million in quarter 2. Four, actively empower industry with technology.\n\nIn terms of technology export, we launched our project for [Inaudible] Property Issuance in Q2. This is the first time that we have exported our CIN system and deployed with AI capability to a third party. We currently have the ability to provide four chain marketing solutions for the insurance industry. This includes either acquisitions, private domain management, and empowering offline agents with sales conversion capability.\n\nThrough these solutions, we can help insurance companies and insurance intermediaries digitalize their marketing process, thereby driving user base expansion and training growth. In the second half of this year, we will continue to work with more partners on different tech projects. Above all, is a breakdown insurance business, and let me hand over to [Inaudible] for update of our medical refunding and patient recruitment business.\n\nUnknown speaker\n\nThanks, Yang Guang. I would like to share some updates on our Medical Crowdfunding business. As of the end Q2, the cumulative number of donors, which is 412 million, helping 2.58 million patients with approximately RMB 53.3 billion cumulatively. Since April of this year, our platform has ceased to resubsidize these service fees and started to charge a service fee of 3% up to a time amount of RMB 5,000 for a single campaign.\n\nThis is to cover part of the operational cost and help more patients with critical illnesses raise fund. The user number and fundraising amount on our platform has remained stable even after the charge of the service fee. As part of our commitment to promote best practices and all the development of the industry, we have recently established an Operational Transparency Committee to continuously promote the authenticity of the campaigns initiated at our medical fund raising platform. The fund goal for transparency, as well as the [Inaudible] and transparency of the platform rules.\n\nThe committee consists of Waterdrop's core management team, experts in the field of law, charity, and public media with our CEO Mr. Shen Peng, as head of the committee. To better safeguard rights and interest of both the fundraisers and donors, the committee will collaborate with public security authorities, hospitals and other industry partners to crackdown on fundraising fraud, while actively seeking advice from the public to ensure that each donation is open, transparent, and checkable. Meanwhile, the committee will constantly interact with the experts and optimize the rules of the platform.\n\nIn the future, Waterdrop will make the effort to avoid fraudulent fundraising and missed corporation of funds, ensuring the overall security of fund raised from our platform. Next, let me talk about the progress of our patient recruitment business. In Q2, the COVID outbreaks in various cities of China has adversely affected the launch of new critical trials. Nonetheless, our E-find Patient Platform sustains overall high growth momentum and safety enrolled of 28,700 patients for clinical trials.\n\nThe E-find Patient Platform also participated in over 60 new clinical trial programs by tiering with innovative pharmaceutical manufacturers, including leading multinational enterprise industry, bringing the total number of clinical trial programs for new drug registration to more than 300. The E-find Patient Platform has now collaborated with more than 100 innovative pharmaceutical manufacturers and CROs in China and worldwide, helping us win the wider condition of our partners and establish a good reputation across the industry. In the past few quarters, the platform has gone to become a leading patient recruitment platform in China, in particular for oncology related clinical trials. Our deliberate efforts and capabilities in quickly accurately recruiting patients suitable for the trial projects and high operational efficiency or job is accomplishing.\n\nWe further expanded the scope of our clinical trials service in the second quarter. Apart from continuing to achieve rapid growth progress in the oncology and chronic disease clinical trials, we automate new tax rules in the rare disease segment. For years, we have seen patients with rare disease struggling to find the right medication, but dilemma has started to reverse as patients have gained more public attention recently. This has led to a significant increase in the number of clinical trials for rare disease.\n\nHowever, as patients with rare diseases are widely dispersed across the country, it is challenging to enroll the appropriate patients to participate in trials of a new specific job. This has longed down the progress of pharmaceutical companies in bringing new drugs to the market. Nevertheless, we found many of these patients are also registered user of our Waterdrop Crowdfunding platform who are seeking financial after being plagued by the disease for years. In Q2, we worked with the several partners on clinical trials for rare disease.\n\nUsing our structure data process technologies, we are capable of matching patients with the most appropriate clinical channel, thereby accelerating the R&D and go-to-market progress of our partners. This concludes my part, and let me turn over the call to Hu Yao to discuss our technology innovation updates.\n\nHu Yao -- Co-founder, Director, and General Manager of Medical Crowdfunding and Healthcare\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nThank you [Inaudible] I'm going to talk about our second quarter technology innovation updates from [Inaudible]\n\nHu Yao -- Co-founder, Director, and General Manager of Medical Crowdfunding and Healthcare\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nFirst from the intelligence for medical crowdfunding business. In response to Malaysia's intermediaries who refer the needed to our Medical Crowdfunding services just to collect commissions. Our AI team has applied knowledge making technology to analyze the statistical characteristics of sample cases and developed two models to identify the high-risk authorized for bidding activities and the Malaysia intermediary engaging such activities, respectively. To date, the models have realized an accuracy rate of over 90%.\n\nThis has effectively reduced the number of malicious and unauthorized fundraising activities and enhanced our risk control capabilities for our medical crowdfunding business.\n\nHu Yao -- Co-founder, Director, and General Manager of Medical Crowdfunding and Healthcare\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nThe second one is encourages dialogue platform. In Q2, we completed a major upgrade of our chatbot platform. We have upgraded it into an intelligent dialogue platform by integrating various functions such as outbound chatbots, customer service chatbot, virtual employees, and technology export projects. For instance, we added the chat features in our outbound chatbots.\n\nBy including types of test data features and several modes, the chatbot is capable of engaging with more human-like dialogues with users, further including its intention recognition accuracy rates by 15%. In addition, our customer service chatbot can solve more than 80% of inquiries raised by users and the intention recognition technology achieved an accuracy rate of over 95% for the overall intelligent dialogue platform. For transferring customers requested from chatbot mode to manual mode on a real-time basis, we have upgraded our loss-control model for phone calls to an intelligent dispatching algorithm, which enables us to further improve sales force productivity. According to users' needs and choice, we have also integrated this algorithm with our recommendations algorithm to offer a better user experience during the conversation.\n\nHu Yao -- Co-founder, Director, and General Manager of Medical Crowdfunding and Healthcare\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nOur AI-powered content production platform provides a lineup of useful tools for content creators. Powered by AI capabilities, the platform will generate corresponding marketing content following the content material separated by the original creator. While enriching our marketing content, the platform also helps improve efficiency and lower the cost of content production. Currently, we have developed three function modules for our platform, namely test generation, speech synthesis, and video synthesis.\n\nTo be more specific, first, as for the speed synthesis, our platform can simulate human-like speeches with flexible configurations. Various types of reverberations and voice properties such as speed and volume are available in this speech synthesis. Currently, the module supports six sound control functions. Our team is also exploring the underlying intelligence speech technology of voice cloning, which we expect to integrate into our speech synthesis module in the future.\n\nAnd second, in respect of video synthesis, the module has incorporated technologies related to lip syncs, AI-powered face swap, animation dial transfer, motion transfer, and virtual human live broadcast. The lip sync technology has been successfully applied in multiple business scenarios including Waterdrop WeChat video accounts, the WeChat video accounts of our brokers, as well as the video advertising promotions at [Inaudible].\n\nHu Yao -- Co-founder, Director, and General Manager of Medical Crowdfunding and Healthcare\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nI will now hand over to Yang Guang to discuss our second quarter financial performance.\n\nYang Guang -- Co-founder, Director, and General Manager of Insurance Marketplace\n\nThank you, Hu Yao. Hello, everyone. I will now walk you through our financial highlights for the second quarter. Before I go into details on this financial performance, please be reminded that all numbers quoted here will be in RMB.\n\nAnd please refer to our earnings release for the detailed information on our comparative financial performance both the year-over-year and quarter-over-quarter basis, respectively. Despite the challenging external environment, we have entered a relatively stable profit making stage after we returned profitable for three consecutive quarters. Our net operating revenue firmed up, and our net profit almost doubled on a quarter-over-quarter basis. Our net operating revenue decreased by 25.3% year over year to RMB 701 million from RMB 939 million, mainly due to the decrease in interest-related income by RMB 273 million, but partially offset by the increase in the crowdfunding service fee of RMB 56 million.\n\nThe decrease of interest-related income was mainly due to the decrease in the first-year premium, but offset by the improvement of our take rate. Our operating revenue growth sustained with a quarter-over-quarter increase of 8.1% in Q2, which demonstrated a more healthy and a solid growth trend. The take rate further increased from 34% in Q1 to 38% in Q2, primarily driven by the consistent quarterly enhancement in our insurance business. Operating costs and expenses for Q2 decreased by 68.9% year over year to RMB546 million.\n\nOn a quarter-over-quarter basis, operating costs and expenses increased marginally by 2.5%. To break it down, operating costs were RMB 245 million, down by 6.1% year over year, mainly due to the decrease in professional and outsourced customer service fee of RM B33 million and a decrease in personnel costs of RMB 58 million. On quarter-over-quarter basis, operating costs increased by 57.9%, mainly due to the accounting reclassification of certain crowdfunding-related service fees from sales and marketing expenses to operating costs, as we started to charge crowdfunding service fees since April 2022. Sales and marketing expenses decreased by 88.4% year over year to RMB 144 million for the second quarter of 2022.\n\nThe decrease was primarily due to 952 million decrease in marketing expenses to third-party traffic channels and RMB 136 million decrease in outsourced sales and marketing service fees to third parties. So on a quarter-over-quarter basis, sales and marketing expenses also decreased by 29.3%. G&A expenses decreased by 42.3% in Q2 to RMB 86 million year over year due to the combined impact of a decrease of RMB54 million in share-based compensation expenses and a decrease of RMB6.7 million in personnel costs. On a quarterly basis, the G&A expenses decreased by 15.6%.\n\nR&D expenses decreased by 29.8% to RMB 70 million year over year and remains stable quarter-by-quarter, reflecting the optimization of our organizational structure during last year. In this quarter, we continue to report a non-GAAP profit of RMB 233 million and a U.S. GAAP net profit of RMB 207 million, compared with a net loss in the same quarter of last year. This was again proved the effectiveness of our business strategy to enhance the overall revenue quality.\n\nAs of June 30, 2022, our cash and cash equivalents and short-term investment balance increased to RMB 3,288 million, an increase of RMB 364 million or 12.4% from the end of the last quarter despite actively implementing a share repurchase program under the compliance framework. So, during the past few quarters, we have provided the following financial guidance, enhancing revenue quality and profitability, and achieving profit for full year of 2022. In Q2, we have made good progress in delivering this guidance and encouraging results. So, going forward, we will strive to deliver high-quality growth and enhance our long-term competitive strength.\n\nThank you. That's all for my part. Now, let's turn to Q&A.\n\nOperator\n\n[Operator instructions] And today's first question comes from Michael Li at Bank of America. Please go ahead.\n\nMichael Li -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] Congratulations, management, on the performance in second quarter. And I saw the improvement of your insurance business in terms of like take rate and also product mix. So, my question is that what is your growth strategy for insurance business? And any plans to upgrade your product mix and channels?\n\nUnknown speaker\n\nOK. Thank you, Michael. That's a very good question. From a user growth perspective, there were three business models for growth directly to C, 2A2C and 2B2B.\n\nOur core growth driver is directly to 2B2C in the past. We also have up our capability in 2A2B and to 2B2C for a while. Going forward, there were opportunities in all of the three business models. So, one directly to 2B2C front, we needed to explore the opportunities in traffic ecosystems and deploy our results accordingly.\n\nFirst, let's look at the WeChat ecosystem, about full growth opportunities WeChat ecosystem. First of all is the growth opportunity from Waterdrop Medical Crowdfunding. Medical Crowdfunding operates a 10 million level business platform, where we effectively educate users about insurance protection and insurance awareness. And it can help us convert users into being the new short-term insurance customers and new insurance policyholder each year.\n\nThe convergent efficiency in our crowdfunding channel decreased by more than 30% from the first half of 2022. The second is growth opportunity from the rights of WeChat video accounts. WeChat had shifted its focus and traffic to WeChat video accounts, which already have 430 million views so far. So, users have seen better collection between their WeChat video accounts and WeChat official accounts and will progress, making it a very new growth venue for customer education and conversion.\n\nSo, our WeChat video account has now surpassed 100 million in monthly video viewership, directed monthly flux of 300,000 new followers to our WeChat official account and posted twofold growth in monthly premiums for the past few months in a row. The third one is growth opportunity from private domain operations and our enterprise WeChat account. The private domain operations of ad price, which is another focus on WeChat, this platform offers strong user management function and infrastructure support and provides a better means for WeChat users adding their operations. Our enterprise WeChat account has reached millions of users and continued to attract hundreds of thousand new users each month, contributing of RMB 10 million trailing each month.\n\nThe fourth one is the opportunity in refining our existing user management. We consistently strengthen our user lifetime management by integrating different scenarios of many marketing platforms that's suitable insurance products and services for our business in different scenarios and further apply our AI capabilities to bolster online sales conversion. So, we have effectively improved our short-term insurance conversion, repeat purchase, and policy renewal. In addition, online operations can also continuously deepen our understanding of user group profiles and improved our sales conversion capability, which allows us to match our users' issuance products and sell them more precisely, and thereby facilitating the conversion from an insurance -- short-term issuance, placing insurance policyholder to a long-term insurance customer.\n\nIn addition to WeChat ecosystem, we have also explored the growth opportunity in shorter video or content platform [Inaudible] spend more than half of their consumption time on shorter video or content platforms, leveraging various market tools, including graphic aid, videos, and livestreaming. It's easier to acquire high-quality new insurance customers with a better insurance awareness, education background and high income level from social media platforms. So we engage with users and acquire those leads on the platform by our insurance planners who more use the lead of our entities we will promote our insurance product to the users among of the new telemarketing, thereby generating more incremental insurance premium. Our sales productivity is very high at around RMB 100,000 per capita.\n\nThis presents efficiency long-term insurance conversion model for the next generation insurance consumers. And also a very important direction for our future investments and capability building. In terms of 2B2C, we are confident about offline brokerage model in the long run. We think the offline brokers serve as a very important component to our customer acquisition capability.\n\nIn particular, they can help us acquire more middle class and thus loads of customers. So, we hope to build up a professional, productive and high-quality offline broker team dedicated to serving the Chinese new middle-class and urban residents. Our short term to medium term goal is to build the fundamental team and the management systems and empowerment platform within the next one, two, three years, while achieving growth and scale. We believe that it will become a powerful growth driver in the medium to long run.\n\nThen on the 2B2C front, we hope to achieve [Inaudible] operation with planners who will reach to easier results by leveraging our strengthened [Inaudible] insurance product offerings and customer conversion. On one hand, we have established an insurance product distribution platform to collect insurance companies, agencies and individual brokers so as to improve the efficiency of distribution and then deliver mutual benefit for partners as well as consumers. On second hand, we have been leveraging our strong capability to user operations and conversion to launch sales leads, collaboration with third-party partners, and help them monetize their user base. So, these 2B2C model has brought in more than RMB10 million monthly premiums and maintain affect for growth trend.\n\nIn addition to the three growth models that I have `mentioned, we believe insurance services for people with preexisting medical conditions in hospital and pharmacy scenarios also have policy growth potential. In China, there were more than 300 million people with preexisting conditions and their leads are [Inaudible] for even traditional insurance models. So, we're able to accurately reach them. And we have customized various products to reach the needs of these people through product innovation.\n\nAt present, we can reach tens of thousands of people with preconditions each month that have potential to convert to issuance consumers, which may bring incremental premiums at millions of RMB level. So, in a sum, our cost growth drivers in the near term are the incremental user growth in WeChat ecosystem and the existing user operation in the midterm in one or three years in relation to the growth from the WeChat ecosystem. We are also positive about the growth for our social media platform [Inaudible] as well as the 2B distribution model. For long term, we believe our off-line brokerage business and insurance services for people with preexisting conditions, both are powerful growth drivers.\n\nThat's all. Thank you.\n\nMichael Li -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from Qingqing Mao with CICC. Please go ahead.\n\nQingqing Mao -- CICC -- Analyst\n\nHi, management. This is Qingqing from CICC. Thanks for taking our question. We have seen some reports proceeding in media regarding the unauthorized fundraising activities and malicious intermediaries in the medical crowdfunding industry.\n\nWe also mentioned about it in the previous presentation. My question is. Could you further explain the surveys and the revenue model of your crowdfunding platform? And with the current revenue contribution in Q2, can you please tell us more about the details? That's all for me. By the way, I wish you a happy Mid-Autumn Festival.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nThank you for your question. And let me translate for Shen Peng. As the leading online platform for patients with critical illness to seek financial health in China, Waterdrop Medical Crowdfunding provide users with comprehensive detailed fund raisers services, including detailed dedicated customer services, instant withdraw the funds, on retail serration, and more.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nIn order to maintain high-quality services to our users, we seek to fully subsidize the service fees and started to charge the service fees from April 17 this year. The decision was made after taking into account the industry research expert advice and platform's operational needs. The service fee was equal to 3% of the withdrawal amount for a single campaign up to a maximum on the part of RMB 5,000. This is in addition to the 0.6% payment penalty charged by the third party.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nIt should be clearly noted that the purpose of charging the service fee is to support the operational maintenance cost and expenses of the platform in order to realize the sustainable and healthy operations of the platform. As mentioned just now, we are committed to -- as reported just now, the platform has facilitated fund raisers of RMB 2.3 billion this quarter, and we generated service fee income of RMB 56 million for the funds raised, meaning that the overall take rate is still lower than 3% because we still subsidize certain special cases where the patients are in critically serious situation. We haven't covered all the costs for fund raising business yet. All of our profit of the Waterdrop Group still came from the insurance-related business only.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nAs mentioned just now by Shen Peng, we are committed to driving the healthy development of the whole industry. In response to the authorized fund rating activities and the malicious intermediaries in the medical crowdfunding industry, we will continue to crackdown on such activities. On the issue of unauthorized fund raising activity is not only the phenomenon in the field of medical crowdfunding industry, but also an issue relating to the internet governance. In the future, we will continue to improve the quality of our services and provide users with more professional detail and sustainable services.\n\nWe will always actively take social responsibility and work hard and enhance with national healthcare, security and administration and the regulatory authorities, as well as other relevant social organizations to make joint efforts to maintain the healthy ecosystem of the whole industry.\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\n[Foreign language]\n\nXiaojiao Cui -- Investor Relations\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nXiaojiao Cui -- Investor Relations\n\nShen Peng -- Founder, Chairman, and Chief Executive Officer\n\nYang Guang -- Co-founder, Director, and General Manager of Insurance Marketplace\n\nUnknown speaker\n\nHu Yao -- Co-founder, Director, and General Manager of Medical Crowdfunding and Healthcare\n\nMichael Li -- Bank of America Merrill Lynch -- Analyst\n\nQingqing Mao -- CICC -- Analyst\n\nMore WDH analysis\n\nAll earnings call transcripts"
}