{
  "companyName": "J&J; Snack Foods",
  "companyTicker": "JJSF",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/15/jj-snack-foods-jjsf-q4-2022-earnings-call-transcri/",
  "content": "J&J Snack Foods (JJSF -1.47%)\nQ4 2022 Earnings Call\nNov 15, 2022, 10:00 a.m. ET\n\nOperator\n\nHello. Thank you for standing by, and welcome to the J&J Snack Foods fiscal 2022 fourth-quarter conference call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference may be recorded. I would now like to hand the conference over to your speaker today, Norberto Aja. Please go ahead.\n\nNorberto Aja -- Investor Relations\n\nThank you, operator, and good morning, everyone. Thank you for joining the J&J Snack Foods fiscal 2022 fourth-quarter conference call. We'll get started in just a minute with management's comments and your questions. But before doing so, let me take a minute to read the safe harbor language.\n\nThis call will contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. All statements made on this call that do not relate to matters of historical fact, should be considered forward-looking statements, including statements regarding management's plans, strategies, goals, and objectives and our anticipated financial performance, industrywide supply constraints, and the expected impact of COVID-19 on our business. These statements are neither promises nor guarantees that involve known and unknown risks, uncertainties, and other important factors that may cause results, performance, or achievements to be materially different from any future results, performance, or achievements expressed or implied by the forward-looking statements. Factors discussed in our annual report on Form 10-K for the year ended September 24th, 2022 and other filings with the Securities and Exchange Commission, could cause actual results to differ materially from those indicated by the forward-looking statements made on this call today.\n\nAny such forward-looking statements represent management's estimates as of the date of this call November 15th, 2022. While we may elect to update such forward-looking statements at some point in the future, we disclaim any obligation to do so even if subsequent events cause our views to change. In addition, we may also reference certain non-GAAP metrics, including adjusted EBITDA, operating income, or earnings per share, all of which are reconciled to the nearest GAAP metric in the company's earnings press release, which can be found in the Investor Relations section of our website at jjsnack.com. Joining me today on the call are Dan Fachner, our chief executive officer; and Ken Plunk, our chief financial officer.\n\nFollowing management's prepared remarks, we will go ahead and open the call for a question-and-answer session. With that, I would now like to turn the call over to Dan Fachner, J&J Snack Foods' chief executive officer. Please go ahead, Dan.\n\nDan Fachner -- Chief Executive Officer\n\nThank you, Norberto, and good morning, everyone. We appreciate you joining us this morning to discuss our fiscal 2022 fourth-quarter and full-year results. We had a great fourth quarter and an overall great year, reflecting the strength of our brands and continued execution against our growth strategy. This quarter marks the fourth consecutive quarter of record revenue, leading to our best revenue ever by over 194 million.\n\nOur top-line growth has been consistent throughout fiscal 2022, driven by strong gains across all three of our businesses, food service, retail, and frozen beverages. We are laser focused on driving organic growth of our core brands supported by our investment and production capacity and refreshed marketing strategies. Our market position is strong led by expanded placements, new customers, better cross-selling across our business, compelling product extensions, and innovation. We also welcome Dippin' Dots to our brand portfolio, which aligns perfectly with our business model and financial goals.\n\nOur team did a superb job driving the top-line growth while managing costs and positioning J&J for ongoing future success. I could not be more pleased with our ability to drive sales and gain market share in the current business environment. Like almost every other company this year, our bottom-line results were impacted by the inflationary impact on raw materials and escalating supply chain costs. Throughout the fiscal year, we saw sequential and year-over-year increases in costs associated with ingredients, truck driver wages, outside carriers, storage, and fuel. As discussed in prior quarters, we have taken specific actions to offset these pressures and reduce cost across R&D, procurement, plant operations, and distribution.\n\nWe have also instituted three price increases over the last 14 months. Gross-margin trends have already improved in the second half of fiscal 2022 because of these actions, and we expect to see continued benefits in fiscal 2023. Going forward, we will continue to focus on improved manufacturing efficiencies, cost-reduction initiatives, and product mix. As the inflationary environment stabilizes and we execute these initiatives, we are confident that our business will deliver higher margins along with continuing strong sales.\n\nTaking a look at the fourth quarter, revenue of 400.4 million was an all-time quarterly high, representing 23.9% growth versus the prior-year period and over a 5% increase versus our third-quarter revenue. On a full-year basis, fiscal 2022 revenue was an all-time high of $1.4 billion, representing a 20.6% increase versus fiscal 2021. It is important to note that these fourth-quarter results include $31.5 million from our Dippin' Dots business. Top-line growth for the quarter excluding Dippin' Dots was still an impressive 14%, driven by strength of our core brands and 18% increase for the full year if you exclude Dippin' Dots.\n\nStarting with food service, we saw continued growth in this segment across every product line as sales increased by over 29% versus the fourth quarter of fiscal 2021 and by over 20% on a full-year basis. Frozen novelties grew 228%, benefiting from the Dippin' Dots acquisition. Also, churros grew 38% for the quarter as we continue to focus on market opportunities and repositioning the brand for continued growth. Handhelds grew 44%, and bakery and soft pretzels delivered strong growth in the quarter.\n\nThe food service segment is really beginning to fire on all cylinders. We are excited about the opportunities in our core categories, including soft pretzels, churros, funnel cakes, and fries. We see tremendous growth opportunities in terms of product extension, expanding our relationships with current customers, and bringing new customers onboard and expanding new markets. Churros is one of the fastest-growing snack categories in food service, and we couldn't be more excited about our new churros brand, Hola Churros, launching this quarter, supported by a full suite of selling tools and videos.\n\nWe look forward to reporting on the progress with this new brand in the coming quarters. Let's talk about Dippin' Dots. We have hit the ground running, and I'm so excited about our opportunities to grow this iconic brand. We've already made significant progress introducing the Dippin' Dots sales team to new customers and channels, including under-penetrated markets and theaters and food service.\n\nAnd with Dippin' Dots, we're proud to announce the first cross-brand collaboration, the new ICEE cherry 'n Blue Razz flavor launching in fiscal Q1. We are also starting to explore new product concepts designed to extend Dippin' Dots into the retail channels. This is a great example of how we can leverage our portfolio across business categories to drive growth. As we said in previous comments, we believe the combination of the two companies will be a game changer given the almost seamless alignment of Dippin' Dots with our frozen novelty and frozen beverage businesses.\n\nMoving to our retail segment, this segment also enjoyed strong growth, posting 53.5 million in sales and growing at 11% compared to the fourth quarter of last year and by over 7% on a full-year basis. Sales were strong across most categories, including handhelds, frozen novelties, and soft pretzels. Our frozen novelty business continues to grow as we gain additional placement in leading retailers led by Luigi, Dogsters, and ICEE. ICEE frozen novelties were up over 22%.\n\nI want to highlight our Dogsters brand again, which grew by 50 -- grew over 57% in fiscal Q4, driven by gains in retail availability and increased popularity in the dog treats category. We are also seeing strong momentum in our frozen beverage segment, growing by over 18% in the fourth quarter of fiscal 2022 versus the fourth quarter of fiscal '21 and by over 32% on a full-year basis. Various initiatives currently underway should continue to drive this momentum. As an example, we have multiple ICEE tests in progress with quick-serve restaurants, including a multistore test with a hamburger chain with over 350 locations. We have also onboarded a number of new customers, including a major convenience store customer, a new cinema chain, and Peter Piper Pizza, reflecting our efforts around product extensions.\n\nOn the brand marketing front, we have a lot going on. Overall, we're making progress in improving our brand health scores on our core brands, including aided awareness and purchase intent metrics. As previously mentioned, we are also launching our new churro brand, Hola Churros, supported by a full suite of selling tools and additional marketing support to follow in 2023, including trade media, customer test, and PR support. Our SUPERPRETZEL and Luigi's media campaigns that started in fiscal Q4 will continue in fiscal Q1, featuring a combination of digital media, shopper-targeted promotions, and our SUPERPRETZEL outdoor campaign continues in Philadelphia, capitalizing on high visibility spots during the city's recent frenzy over the Phillies and the Eagles, even though the Eagles lost last night.\n\nFor Dogsters, our new marketing campaign will kick off in 2023, leading with dog park activation and organic social media content, followed later in the year with brand messaging in digital and shopper formats. And for ICEE, we will bring to light the kid in the cup positioning and our curve in marketing strategy. With Dippin' Dots, we recently executed a number of nationwide promotions, including National Ice Cream Day. Regarding product launches and innovation, we are as busy as ever.\n\nWe launched a new SUPERPRETZEL buffalo-flavored filled bites in Q4 and will introduce new SUPERPRETZEL Bavarian sticks along with pretzel knots in 2023. In our frozen novelty business, we are launching new ICEE and SLUSH PUPPIE frozen pots to complement the rest of our strong frozen novelty portfolio. In our ICEE frozen beverage business, we will feature core seasonal offerings including mango, strawberry lemonade, and white cherry. As it relates to M&A, we are focused on fully integrating Dippin' Dots into the J&J system in ways of working and executing plans to grow the business.\n\nWe will remain optimistic in evaluating potential M&A opportunities that complement our brand portfolio and business model. In summary, while we expect to face ongoing macro headwinds, we will continue to focus on growing the top line, improving margins, innovating, and building our core brands and products. Our long-term vision has never been clearer. We have the right team, the right brand portfolio, and the right strategy to win.\n\nWhile fiscal 2022 was a record revenue year, the best is yet to come. I would now like to turn the call over to Ken Plunk, CFO, to view our financial performance. Ken.\n\nKen Plunk -- Chief Financial Officer\n\nThank you, Dan, and good morning, everyone. Our results for the fourth quarter of fiscal 2022 underscore the strength and resiliency of our business and operating strategy. Net sales were 400.4 million in the quarter, growing by 23.9% versus the prior-year period. When compared to the fourth quarter of 2019, revenue was up over 28.4%.\n\nFull-year net sales was a record $1.4 billion, representing a 20.6% increase over fiscal 2021. Starting with food services, which continues to be our largest segment representing 60% of total sales, revenue of 256.8 million exceeded Q4 2021 by 58 million or an increase of 29.2%, including approximately 31.5 million in Dippin' Dots sales. Strong performance in food services is driven by a 43.8% increase in handheld sales, 38.4% increase in churros sales, and a 228.2% increase in frozen novelty sales, again benefiting from our Dippin' Dots business. We also saw healthy growth in our bakery and soft pretzel businesses of 10.8% and 2.8%, respectively.\n\nThe retail segment also posted a strong quarter with 53.5 million in sales, increasing 11.3% compared to the same period in fiscal 2021. Growth was driven by soft pretzels, which increased 29.5%, while handheld sales rose 25.5%, and frozen novelty sales increased 6.6%. Growth across these product lines was partially offset by softness in biscuit sales, which decreased 14.8% versus the prior year. Frozen business -- frozen beverages sales were 90.2 million and grew 18.2% versus Q4 2021, led by beverage sales growth of 19.5%, as well as equipment sales growth of 30.4%, and machine servicing revenue growth of 11.8%.\n\nGross profit for the quarter was 115.8 million or an increase of over 26.3%, compared to the previous-year period and a gross margin of 28.9%, a slight improvement compared to 28.4% in Q4 of fiscal 2021. As Dan mentioned, we've been working hard to manage through this historic inflation year, and we are now seeing significant progress, improving margins, as our pricing and other initiatives take hold. Moving down the income statement, total operating expenses increased to 94.2 million representing 23.5% of sales for the quarter, compared to 20.6% in Q4 2021. These results largely reflect the inflationary pressures across all of our expense lines, in particular in distribution expenses.\n\nDistribution expenses were 12.4% of sales, compared to 10.1% in fiscal 2021, but did improved compared to Q3 2022, which was 12.7%. Marketing and selling expenses represented 6.4% of sales versus 6.5% in the prior-year period. Administrative expenses were 4.3% of sales in Q4 2022, compared to 3.6% in Q4 2021. This led to an operating income of 21.6 million, compared to 25.3 million in Q4 2021 or a year-over-year decline of 14.5%.\n\nExcluding the one-time charges related to impairments and acquisition related expenses, mostly attributed to our Dippin' Dots purchase, adjusted operating income was 25.8 million, and adjusted earnings per diluted share was $1.05. After considering income taxes of 3.9 million compared to 6.8 million in Q4 of fiscal 2021, net earnings decreased to 17.3 million, resulting in reported diluted earnings per share of $0.90 a share compared to $0.98 in the prior period. Our effective tax rate was 90% for the fourth quarter and 24% for the full year. Adjusted EBITDA increased 3.7% to 40.1 million despite the continued cost inflation.\n\nOn a full-year basis, we generated adjusted EBITDA of 124 million, compared to 128 million in the prior period. Taking a look at our liquidity position, even with the recent Dippin' Dots acquisition, we continue to have a healthy balance sheet and overall strong liquidity position with 44.9 million in cash and marketable securities and approximately 55 million in debt. In addition, we have ample availability under our revolver with 161 million of additional borrowing capacity. Our financial position is strong enabling us to continue investing in our business, while also returning value to our shareholders via quarterly dividends.\n\nIn summary, we are excited about the opportunities ahead for our company and confident that our portfolio of brands, investments in our business, and targeted strategic initiatives will continue to fuel growth in fiscal 2023. We are focused on strengthening our operating infrastructure and improving our efficiencies in order to offset the extraordinary inflation we're operating under and to become a more resilient organization and deliver added value to our customers and shareholders. I would now like to open the call to questions. Operator.\n\nOperator\n\nThank you. [Operator instructions] Please stand by as we compile the Q&A roster. Our first question comes from Connor Rattigan with Consumer Edge. You may proceed.\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nHey, there, good morning, and congrats on a great quarter.\n\nDan Fachner -- Chief Executive Officer\n\nThank you, Connor. Good morning.\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nGood morning. Yeah. So, food service came in much stronger than we expected. Could you maybe share some color on some drivers for that nearly 30% growth? Is there anything else we should be aware of other than just pricing in maybe Dippin' Dots? And also on Dippin' Dots, just looking at the retail data, we don't really see much of a tick up in distribution over the last few months.\n\nCan you guys remind us sort of how large the food service component of that business is versus retail and just sort of how that distribution rollout is going?\n\nDan Fachner -- Chief Executive Officer\n\nSure. I'll kind of kick that off and let Ken add some things to it. In regards to sales, yes, we took some pricing. We had three price increases over the 14 months, so that's certainly helped out with some of the sales portion.\n\nBut we see volume growth in all categories through the end of the year. We're watching that very closely. You hear a lot about recession looming, we're being careful with that. But to date, we are seeing volume growth across all categories.\n\nIn regards to the Dippin' Dots side of our business, really excited about that piece of business and it's doing really well. It is predominantly food service. It really isn't in the retail sector today. We do some things with licensing that allow it to be in the retail, but that's something that we think that we can bring to that company over time and one of the things that we're working on for innovation of the future.\n\nKen Plunk -- Chief Financial Officer\n\nYeah. Connor, just to add, we called out the 31.5 million benefit in the quarter from adding Dippin' Dots. So, you can kind of back into the math, our sales grew 14.2% excluding adding Dippin' Dots. And even as another kind of benchmark, ex the Dippin' Dots business, sales grew 18% versus 2019.\n\nAll three of our segments grew above 2019, and we've used that kind of as the pre-COVID proxy, but it gives you just kind of a general idea that all three business segments are really performing well independent of adding Dippin' Dots. And to add to what Dan said, all of Dippin' Dots, as you look at the detailed financials, is included in food service and included within frozen novelties for food service.\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nOK, great. That was helpful, guys. And then just one more for me. So, we [Inaudible] other reporters this season that some consumers are really dialing back spending on, you know, things considered maybe more discretionary versus essential.\n\nAnd while the food service business for you guys, really, it seems to remain quite strong, I mean, I guess have you seen any evidence of maybe a slowdown in foot traffic in certain venues, maybe like movie theaters or amusement parks?\n\nDan Fachner -- Chief Executive Officer\n\nYou know, we're watching that really close, Connor. To date, we have not seen that. We've been fortunate enough along with pricing to also see volume growth as well, but we're keeping our eye on that, and we'll continue to watch that over the 2023 year. And if we start to see some evidence of it, we'll react to it.\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nAll right. Sounds great. Thanks, guys.\n\nDan Fachner -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Robert Dickerson with Jefferies. You may proceed.\n\nRob Dickerson -- Jefferies -- Analyst\n\nGreat. Thanks so much. Just a couple of quick questions. You know, I guess for fiscal 2023, maybe this is more for you, Ken.\n\nI think previously you had stated that, hopefully, you're trying to get back to more pre-pandemic profitability margin maybe around Q2, obviously, what we're seeing in Q4 is nice consistency relative to Q3. And, frankly, if we think about Q2, it's probably pretty similar to what you did in Q4. So, I realize there is fair amount of cost coming into the system, pricing seems healthy so far. But just any update in terms of kind of progression potential of that profitability?\n\nDan Fachner -- Chief Executive Officer\n\nHey, Rob, I just want to say hello. Thanks for calling in. Appreciate it. I'm going to let Ken answer this, but I'll just give a little flavor to start with anyhow.\n\nWe do feel good about our margins. We're continuing to fight that. We've talked about, you know, getting back to what J&J's normal run rate was in that 30% plus, that's something that we preach day in and day out around the company, worked really hard. Our sales teams did a fantastic job getting out in a difficult environment and taken some pricing where needed because of some of the cost initiatives.\n\nBut we're looking forward to getting back to that spot. Ken, I will let you handle it from there.\n\nKen Plunk -- Chief Financial Officer\n\nYeah. We remain really confident, Rob. I think all of us says that kind of with a little hesitation given everything that feed in terms of potential recession and that sort of thing. But if I just go on with the best information I have and kind of where we expect consumers to be in the next 12 months, we continue to remain really positive on '23 and really getting back to kind of what our historical performance has been in gross margin rate.\n\nYou know, we mentioned this quarter, we're much closer. But still, as you said, probably more settled into Q2 and Q3 is where we start to hit our sweet spot and get back to kind of those gross margins. And then as we add Dippin' Dots onto that, that's accretive gross margins as well. So, we sit here feeling really, really good as we look forward.\n\nI think Dan mentioned it, our strategies, I think, are clear. It's aligned across the business. We're going after both the top line very aggressively, and then we've got initiatives we focused on the bottom line. We're making progress in supply chain cost, so we still feel really good about the outlook on 2023.\n\nRob Dickerson -- Jefferies -- Analyst\n\nAll right, fair enough. And then I guess kind of a, you know, question I guess around Dippin' Dots' distribution costs, and then kind of segment profitability in total. You know, obviously, there are revenues that come through on Dippin' Dots upfront Q4. I'm assuming there is some profit contribution from that as well, while at the same time if I kind of do a quick math, it looks like maybe that segment is a little bit, you know, still pressured at least for the time being on the profit side.\n\nAnd then also, we obviously see the distribution expense is still fairly high year over year. So, I'm just trying to get some sense as to maybe what's going on more specifically in food service. Dippin' Dots, obviously, very attractive business. It seems like costs are still little high, so there's still contribution coming from Dippin' Dots in the quarter.\n\nAnd maybe, I guess, that distribution were to kind of ease a bit as we got through 2023, then profitability goes up. So, just wondering if, I guess -- if there is anything kind of in that segment, you know, vis-a-vis Dippin' Dots that would cause some upfront costs that might be able to kind of ease and come out later if that makes sense. That's it. Thanks.\n\nKen Plunk -- Chief Financial Officer\n\nYeah, let me just talk about distribution expenses. They were marginally down as a rate of sales versus what they were in Q3. We are seeing a little bit of stabilization. You know, it wasn't significant, but there was -- it was down little bit.\n\nI just remind everybody, it's still up significantly over what it was in the same quarter a year ago. If you just look at straight rate impact, so ignoring that we shipped more, it's up about $7 million [Inaudible] rate. Fuel prices are still up 56%. So, when you look at it year to year, just keep that in mind.\n\nWe do feel good about kind of how things are reacting in terms of, you know, fuel prices kind of bouncing around. They have gone up actually a little bit in the last 30 to 60 days, but the outlook, we feel little bit better about than we did say three, six months ago. We also like the initiatives we've got in place. We've talked a lot about that.\n\nWe're starting to gain ground on that. We've moved all of our logistics management to NFI, so we expect to get some traction there. So, we expect to get better in that, but for the quarter, still, year over year, has a pretty big impact. If you look at it full year, you probably pay 28 million to 30 million more in distribution expenses on the same volume just because carrier rates were up, fuel prices were up, wages were up that sort of thing.\n\nSo, that gives you a little bit of magnitude. In terms of Dippin' Dots -- yeah. Dippin' Dots carries a larger SG&A as a rate of sales than our core business. So, you see some of that play out in 2023.\n\nIt's particularly pronounced in Q1. So, as we look to Q1, that will be the slowest quarter for Dippin' Dots, and so you'll see the weighting of their expenses a littler heavier on our total P&L in that quarter. And then, Q3 and Q4 for Dippin' Dots are really the big quarters, and that's why we feel really, really good about as we get into the back half of the year, where we're going to be. But I wouldn't say Dippin' Dots had much of any impact on performance this quarter, did help profitability a bit, but the bigger impact going forward is going to be Q1 where sales are seasonal.\n\nAnd so, you won't see as much profit in that quarter.\n\nDan Fachner -- Chief Executive Officer\n\nYeah. Rob, you might think of their sales seasonal much like what ICEE is. And then, also, we had some strategies in place as we've talked about with three DC centers across the country, and each one of those we have a box in a box, where we'll be able to store Dippin' Dots and get it closer to the customer and increase that availability to the customer and lower our distribution cost long term.\n\nRob Dickerson -- Jefferies -- Analyst\n\nThank you. Just a quick follow-up just on Dippin' Dots. Can you just remind us kind of what those base revenues were and then maybe just kind of give a broad percentage of those sales in that Q3 -- in that Q2, Q3 period, so we can understand the seasonality piece? That's it. Sorry.\n\nThanks.\n\nKen Plunk -- Chief Financial Officer\n\nYeah, well it's 31.5 million in Q4. If you look at the seasonality of sales, 35% of Dippin' Dots sales is Q3, 34% is Q4, and then Q2 is around 18%, Q1 is around 13%. So, that's kind of the seasonality flow of Dippin' Dots.\n\nRob Dickerson -- Jefferies -- Analyst\n\nAll right. Thank you so much, guys. Appreciate it.\n\nDan Fachner -- Chief Executive Officer\n\nThank you, Rob.\n\nKen Plunk -- Chief Financial Officer\n\nThanks, Rob.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Todd Brooks with The Benchmark Company. You may proceed.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nHey, good morning, guys. Congrats on a nice quarter.\n\nDan Fachner -- Chief Executive Officer\n\nThank you, Todd. Good morning.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nA couple of quick questions if I may. Can we review -- I know you talked about three discrete pricing actions over the past 14 months. I'm assuming if we're talking 14, that we've already rolled over the first increase. Can we review the magnitude of the second and third increased by segment and what the timing was?\n\nKen Plunk -- Chief Financial Officer\n\nI don't have it by segment, Todd. I mean, I can tell you that the increase in March, April was in that 7% to 9% range, and then the increase in the -- you know, most of it taken in September was in that 6% to 8% range. The third increase was the prior year late, and it was around 3% to 4%.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK, great. And I believe I see the timing is -- go ahead. Sorry.\n\nDan Fachner -- Chief Executive Officer\n\nJust to clarify, those were food service numbers, yeah. Or our J&J numbers.\n\nKen Plunk -- Chief Financial Officer\n\n[Inaudible]\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. And then I see I think is annually, typically in January. So, what did we run this year, and do we have any early indications for this upcoming year?\n\nDan Fachner -- Chief Executive Officer\n\nYeah, I see, beginning of the year, it is normally done in January. It was around a 6% increase, and we are looking at another increase this coming January. We have not determined that amount yet. It would not surprise me for it to be in that same range.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. And what's the environment like for taking for the price? And I just want to understand, Ken, if you look at your pricing now, how much of your kind of cost pressure do you feel like you've recaptured with the current pricing structure in the market?\n\nKen Plunk -- Chief Financial Officer\n\nYeah, that's a good question. I mean, we've done a lot of work with our procurement guys really trying to look forward. They do a really good job in locking us in the good rates when we should lock in, so we have a pretty good idea, you know, as we look at the next quarter that we feel like. And again, I'm talking about the snack food side of the business here.\n\nWe feel like we're pretty well calibrated between price and cost now. We're going to do some things on our own to try to get costs down to other initiatives as well. And then, yeah, I think we've said this in many quarters. We also continue to really look at every SKU earning as weight.\n\nSo, you know, we have SKUs that are dragging us down, and we look at that very closely as well. But as I sit here now, I feel good about our price position, but it changes weekly, monthly as we kind of get new analysis and folks are looking forward. There's a lot of news that major retailers are starting to get much more resilient on accepting price increases, so all of that environment, we have to take into consideration. But there is no planned increase on the snack food side as we speak.\n\nObviously, we'll watch how the market plays out. And if that changes, then we'll have to regroup and decide whether there's any action to take there.\n\nDan Fachner -- Chief Executive Officer\n\nTodd, I think the environment gets tougher and tougher to take pricing at this point. I think it's acceptable on the beverage side because it's normally done annually. I think the other piece of our business gets tougher and tougher. We're watching it closely, kind of understanding what others are doing and then watching what commodities are doing at the same time.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK, great. Thanks, Dan. And my follow-up question, switching gears, I want to talk about kind of that opportunity around distribution costs in fiscal '23. You talked about fully having logistics management outsourced NFI.\n\nDan, you talked -- when you were talking about Dippin' Dots, about getting to three centralized facilities. And when -- Ken, when you talked about incremental kind of 28 million to 30 million in distribution costs this year from inflation, I'm wondering kind of controllable improvement that you guys see from rationalizing the distribution system in '23. How much of that do you think we can claw back?\n\nKen Plunk -- Chief Financial Officer\n\nYeah, we spoke about that, here's how to answer that question, Todd is -- NFI managing 100% of our transportation is now, you know -- we've now implemented that. You know, as we went through with you guys, over the last few quarters, particularly with the JD Edwards implementation, you know, we went along that line pretty gradually. And really, the biggest bang for the buck is when we move everything over to them and they started managing that. And as they're doing that this year, I mean, we do expect probably in the range of 2 million to 4 million of opportunity there as they help us better manage for truckload, mileage and that sort of thing.\n\nThe RDC strategy is playing out a little bit more longer-term. One of the facilities we expect in the -- you know, around the May-June time frame, the other roughly a month later. And then, we're still in discussions about what we do on the West Coast side. So, I would say, one of those three things need to operate in tandem to really drive the savings opportunity we see.\n\nSo, that's probably more like working its way into '24 and '25 on that part of it.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK, great. And once the system is fully working in tandem, have you sized that opportunity? What do you think that is once all three are up and running?\n\nKen Plunk -- Chief Financial Officer\n\nYeah, I think we've said we think it's a $10 plus million opportunity, Todd.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK, perfect. Thanks, Ken.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Andrew Wolf with C.L. King.\n\nYou may proceed.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nHello, good morning.\n\nDan Fachner -- Chief Executive Officer\n\nGood morning, Andrew.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nOn distribution, I think you guys identified -- I heard right $28 million to $30 million, and for the year, kind of out of your control, wages and -- or was that -- that was fuel and carrier rate? Was wages in there because you called out $7 million.\n\nKen Plunk -- Chief Financial Officer\n\nYeah. It doesn't matter -- normal wages --\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nCould you tie that up? Sorry if I can't listen well. But second, more importantly, what is the outlook for next year. I know it's -- can you forward contract any of that stuff, or is that all done at the market?\n\nKen Plunk -- Chief Financial Officer\n\nIt's pretty much market driven. You know, as we look at it now, we see -- you know, and even our partner NFI is starting to see, cost per pound ships go down. So, you know, and the big ingredient of that is fuel prices relative to three or four months ago were down. Relative to a year ago, they're still up to 56%.\n\nI think the outlook is we don't expect that to get worse. I think the opportunity is the degree that that gets better. You know, we don't expect huge increases in cost around carriers and storage like we had this year. A lot of that was a byproduct of what they had to pay their labor.\n\nThere was a little bit of supply and demand that enabled them to charge better prices. The supply and demand side has equaled out a little bit. So again, I think we all feel good looking forward that, you know, it's a pretty stable environment. I don't expect it to all of a sudden go down a huge number unless we get the benefit of fuel prices coming down.\n\nBut I don't expect to have a repeat of what happened last year.\n\nDan Fachner -- Chief Executive Officer\n\nAndrew, also just a little color on that. We're really focused on the whole distribution side of our business. We've brought in some additional people to help us look at it. NFI coming on, it's been a big help.\n\nWe think that we'll get some of the benefits from that over this next year, and so we think we can continue to drive that down, see that as an opportunity.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nOK. So, you're saying, Dan, that there is savings in addition of, you know, the outsourcing just through all the process and whatever. [Inaudible] restructuring happens.\n\nDan Fachner -- Chief Executive Officer\n\nYou know, we stated that, I think, we're getting better every day. Yeah, all of our indications and data information that we're getting show that we're just getting better at it every day, and I think that will translate into some savings. We don't know the amount yet, but believe that we're doing all the right things to try to drive that down.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nOK. Thanks, that's great. Moving to Dippin' Dots, I mean, what is the temperature on -- internally on launching it into retail, or I think you brought that up, versus further expansion in some of the food service accounts, where either you have broader distribution or better relationships?\n\nDan Fachner -- Chief Executive Officer\n\nYeah. I think you'll see the food service expansion happen first, and we're having really good meetings with some of our potential customers out there. We thought that that would be an opportunity from the start. And as we've been out introducing the Dippin' Dots team to customers that we have really good relationships with and some of the categories where they didn't operate in the past, we're really encouraged and believe that we will be able to get some solid placements over the next three to six months.\n\nAt that same time, I have our R&D group working on a package or a form that we might be able to release in retail, but I would expect the food service to be months ahead of the retail side.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nGot it. And last question. On the price increases, at least I've seen with other companies and it sort of stands to reason that there is more elasticity on the retail side than on food service for a bunch of reasons, I'm just wondering if that's the experience you're seeing or are you seeing that -- yeah. A little commentary around the elasticity by the two segments.\n\nThat's it from me. Thank you.\n\nDan Fachner -- Chief Executive Officer\n\nYeah. You know, I think our team has done an excellent job this past year in, really, a difficult circumstance to get out there and pass on pricing to our customers. You know, in the best environments, that's not easy. And in tough environments, that even gets harder.\n\nWe believe that both retail and food service have done a good job at that. We don't think that we've done anything to hurt our volume. We're watching volume really closely, so that elasticity side of it, we're being really careful for. But to date, we haven't seen any indications impacting of it impacting it.\n\nAnd I don't know that I actually see a difference between retail and food service. I think all customers are watching it closely.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nGot it. Thanks for the color, appreciate it.\n\nDan Fachner -- Chief Executive Officer\n\nThank you, Andrew.\n\nOperator\n\nThank you. I would now like to turn the call back over to Dan Fachner for any closing remarks.\n\nDan Fachner -- Chief Executive Officer\n\nGreat. I guess that concludes the questions. So, in closing, while rising costs are surely impacting consumer choices, consumers are also putting greater value than ever before on quality of life and experiences, including traveling, sporting events, concerts, amusement parks, and movie theaters. This dynamic is not only supporting how consumers view our products, but is also allowing us to create new occasions and new products to delight them with.\n\nI want to take this opportunity to thank all of our employees. Our accomplishments are due to their extraordinary dedication and efforts. Thank you, team, out there. Thank you, everyone, for joining us on the call today.\n\nWe appreciate your interest and continued support. Should you have any questions or wish to speak to us, please contact our investor relations firm, JCIR, at 212-835-8500. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNorberto Aja -- Investor Relations\n\nDan Fachner -- Chief Executive Officer\n\nKen Plunk -- Chief Financial Officer\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nRob Dickerson -- Jefferies -- Analyst\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nMore JJSF analysis\n\nAll earnings call transcripts"
}