{
  "companyName": "Cinemark Holdings",
  "companyTicker": "CNK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/cinemark-holdings-cnk-q3-2022-earnings-call-transc/",
  "content": "Cinemark Holdings (CNK 0.12%)\nQ3 2022 Earnings Call\nNov 04, 2022, 8:30 a.m. ET\n\nOperator\n\nGreetings and welcome to the Cinemark Holdings, Inc. third quarter 2022 earnings conference call. At this time, all participants are on a listen-only mode. A question-and-answer session will follow the formal presentation.\n\n[Operator instructions]. As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Ms. Chanda Brashears, senior vice president of investor relations.\n\nThank you. Please go ahead. \n\nChanda Brashears -- Senior Vice President, Investor Relations\n\nGood morning, everyone. I would like to welcome you to Cinemark Holdings, Inc. third quarter 2022 earnings release conference call hosted by Sean Gamble, president and chief executive officer; and Melissa Thomas, chief financial officer. Before we begin, I would like to remind everyone that statements or comments made on this call may be forward-looking statements.\n\nForward-looking statements may include, but are not necessarily limited to financial projections or other statements of the company's plans, objectives, expectations, or intentions. These matters involve certain risks and uncertainties. The company's actual results may materially different from forward-looking projections due to a variety of factors. Information concerning the factors could cause results to differ materially is contained in the company's most recently filed 10-K.\n\nAlso, today's call may include non-GAAP financial measures. A reconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures can be found in the company's most recently filed earnings release 10-Q and on the company's website at ir.cinemark.com. In today's prepared commentary regarding comparisons, we will be referring back to the third quarter of 2019, unless otherwise indicated, as the third quarter of 2021 continued to have meaningful COVID-related impacts. As we typically do.\n\nWe filed our 10-Q this morning in conjunction with our earnings release. Please note that this quarter, the 10-Q represents a combined Cinemark Holdings and Cinemark USA filing. While the differences between the two sets of financials are minimal, I wanted to proactively flag this change from prior periods. With that, I would like to turn the call over to Sean Gamble.\n\nSean Gamble -- President and Chief Executive Officer\n\nThank you, Chanda. Good morning, everyone. We appreciate you joining us today to discuss our third quarter 2022 results. I thought I would kick things off by addressing four topics that appear to be front and center on investors minds: First, industry box office recovery; second, the impact of inflation as well as a potential recession on moviegoing; third, our ongoing Cinemark operating strategy this year; and finally, our near-term priorities to drive operating success and shareholder value going forward.\n\nWith regard to the first topic of industry box office recovery, there are several factors that we've been watching closely as we evaluate future prospects for returning to pre-pandemic levels. Of primary significance, our sustained consumer interest in moviegoing, availability of content, and the value that a theatrical release provides distributors of films entertainment. Based on consumer behavior over the past year, it is clear that moviegoing enthusiasm remains strong and vibrant across all categories of films and audiences. We've now seen this validated quarter after quarter, genre by genre, as long-standing records have been broken and films have performed at levels comparable to or better than pre-pandemic expectations, even during periods of heightened COVID concerns.\n\nThink back to Shang-Chi and The Legend of the Ten Rings that was released during Labor Day weekend last year and blew away historic results for that weekend, subsequently going on to gross $225 million in domestic box office in the midst of a more challenged COVID setting. That success was followed in the fourth quarter by Venom: Let There Be Carnage, which matched the performance of its predecessor from 2018, as well as Spider-Man: No Way Home, which delivered the third-highest box office result of all time. In March of this year, The Batman opened to over $130 million domestically and became Warner Brothers sixth biggest film in its 100-year history. In April, Sonic the Hedgehog 2 produced Paramount's largest opening in nearly a decade, only to be bested the following month by its release of the phenomenon, Top Gun: Maverick, now the fifth highest-grossing domestic film ever.\n\nWe've seen numerous successes in the specialty and alternative content space, such as the live captured BTS concert, the Indian film RRR, and Everything Everywhere All at Once, A24's biggest movie of all time. Adult skewing films have delivered remarkable results as well, including Elvis, Where the Crawdads Sing, and recently, The Woman King. Similarly, suspense and thriller fans came out in masses for films like The Black Phone and Nope. And on the other end of the spectrum, families drove the largest 4th of July weekend opening box office results ever with Minions: The Rise of Gru.\n\nIn action and adventure audiences boosted films like Doctor Strange into the Multiverse of Madness, Thor: Love and Thunder, and Jurassic World: Dominion to levels that were in line with or far beyond their prior pre-pandemic installments. The list of examples over the past year that demonstrate consumer enthusiasm for moviegoing is as strong as ever goes on and on. And that list is set to continue growing during the fourth quarter based on recent results for Black Adam and Ticket to Paradise, as well as excitement for the highly anticipated sequels to Black Panther and Avatar later this month and next. When compelling content is released, consumers are flocking to theaters to see it.\n\nThat said, the biggest near-term challenge our industry continues to face is content availability. As of the third quarter year to date, 2022's overall volume of major releases has recovered to approximately 60% of pre-pandemic levels. The primary driver of this headwind in volume is the impact COVID had on the production cycle of films, which generally can take two to three years or more to produce. That impact was further exacerbated by certain decisions that were made within the context of the pandemic to pull films from theatrical, to fill production gaps in streaming content, which was also affected by COVID, as well as to help boost subscriber growth as those streaming platforms were just getting off the ground.\n\nAs we look forward, while we expect 2023 will continue to be another year of recovery with regard to overall content volume, our early projections indicate it will be a further step forward from 2022, much like 2022 was from 2021. Furthermore, we have high confidence in the ongoing recovery of volume over the coming years as the impact of COVID-related production delays fully subside and studios continue to derive enhanced value from theatrical exhibition for their films and other distribution platforms. That confidence is rooted in the increased promotional impact and asset value that a theatrical release provides movies and other forms of filmed entertainment. Theatrical exhibition continues to build greater awareness of and desire to see content.\n\nIt even ties its content and elevates its perception of quality. It helps to form a stronger emotional connection with characters and stories that builds bigger brands and franchises. All of these factors lead to stronger results in subsequent distribution channels. That's been the case time and again over the course of history for VHS, DVD, pay-TV, and Free TV.\n\nAnd importantly, we are now hearing more and more from our studio partners that it's also true for their streaming platforms. A theatrical release helps entertainment rise above the clutter. It increases its recognition, and it drives a higher level of interest. It also satisfies the desires of a wide range of consumers and content creators who want and value the opportunity to experience these stories and moments on the big screen.\n\nLook no further than the recent examples of Smile and Barbarian. These are films that were contemplated for a direct-to-streaming release. However, instead were given an exclusive theatrical release first. Smile is on track to gross over $100 million of domestic box office, and Barbarian just exceeded $40 million.\n\nThink about the enhanced value this distribution strategy has generated, not only with regard to the incremental theatrical revenue these films will generate that otherwise would have been foregone, but also with regard to the increased recognition and interest consumers will have to view these titles when they become available for streaming. As streaming platforms mature and new and traditional entertainment companies have a growing need to compete, deliver more perceived value to consumers, and increase the overall financial and promotional impact of their content, theatrical exhibition provides a significant and complementary strategic means for doing so. The next topic I'd like to touch on is the impact of inflation and a potential recession on our industry. While there are growing concerns about the macroeconomic effect these factors may have on overall discretionary spending, historically, they have not materially impacted theatrical moviegoing.\n\nIn fact, during six of the past eight recessions, North American box office actually grew. We've also seen a similar phenomenon during the many economic ups and downs over the years throughout Latin America, which traditionally has taken place during periods of economic downturn, is people will cut back on more expensive forms of entertainment, such as travel and high-priced events, as well as non-essential purchases of packaged goods. However, people ultimately want and need to get out of their homes and do something. Compared to other out-of-home options consumers have to choose from, going to the movies remains a very affordable form of local entertainment.\n\nFurthermore, it provides an often needed two-hour plus escape from reality during challenged times. Even today, we are not seeing signs that the current uptick in inflation is dissuading audiences from coming to our Cinemark theaters or purchasing concessions while they're. Rather, when compelling content is released, audiences are not only buying tickets, but over-indexing in their selection of premium options. For instance, most recently in the third quarter, while our total domestic box office was down approximately 27% from 3Q '19, admissions revenue from our enhanced premium large format XD and IMAX auditoriums was nearly flat.\n\nThis over-indexing was even stronger for enhanced D-BOX motion seats that generated over 25% more admissions revenue in the third quarter of 2022 compared to 2019. And we're also experiencing continued strong performance in food and beverage sales within the current economic environment versus 3Q '19, concession per cash are up over 30%. When guests are visiting our theaters, they are choosing to make the occasion special and indulge. So in light of all these factors, we continue to expect that moviegoing and our top-line revenues will continue to remain most closely aligned to the strength and volume of content rather than macro economic effects of inflation or recession.\n\nThe third topic I'd like to cover is our ongoing operating strategy. In light of this year's fluid environment with regard to COVID, supply chain, labor and film content, our primary operating objectives have been focused on reigniting theatrical moviegoing across all audience segments and disciplined and resilient operational execution. Within this framework, we have stepped up our marketing efforts over the course of 2022 to attract back reluctant moviegoers, sustain momentum during periods of limited content, and help retain our market share advances. We have done so through both organic and paid media, actively reaching out to the over 20 million unique addressable guests with whom we have a direct connection and effectively leveraging the sophisticated omnichannel marketing platforms we developed over the past four years.\n\nTo that end, we believe consumer enthusiasm for a shared cinematic experience has been fully reignited and is again as strong as ever as evidenced by the series of examples I shared a moment ago. Specific to Cinemark, we have continued to successfully maintain a significant portion of our global market share gains compared to 2019. In the third quarter, our share gains domestically and internationally continued to exceed 100 basis points. Furthermore, during the quarter, we outperformed North American industry box office recovery by more than 400 basis points domestically versus 3Q '19 and by a comparable margin internationally in relation to local benchmarks.\n\nWe've also seen a strong resurgence in engagement with our global loyalty programs. In the U.S., Movie Club, our paid subscription program is again following a growth pattern comparable to pre-pandemic levels, and our membership base is up over 10% versus 2019. We've experienced similar rebounds in our programs across Latin America as well. Collectively, our market share growth and loyalty engagement continue to generate strong returns on the investments we're making and deliver a material bottom-line impact.\n\nWe've also been hyper focused on the efficiency of our operational execution, including actively flexing our business to address the volatility of content flow, food and beverage cost and availability, and labor this year. Doing so has required significant planning and resilience. Fortunately, we made tremendous advances over the course of the pandemic with regard to tools, processes, and resource alignment in the areas of workforce and inventory management from which we are now benefiting. As an example, these advances are now enabling us to hone our operating and staffing decisions down to the theater, day, and hour.\n\nWe are scaling operations up and down based on an ability to generate positive incremental profit dollars hour by hour. While we recognize that this approach may put some pressure on our margin rate during periods of lower volume, particularly in certain morning and evening dayparts that we refer to as our wings, we believe maximizing profit in cash and dollars in our current environment is paramount. We think our results throughout 2022 validate that our collective strategies to navigate this year's dynamic operating environment are working. Despite the largely fixed cost nature of our business model year to date through the third quarter, with only 62% of 2019 attendance, we generated $263 million of worldwide adjusted EBITDA with an adjusted EBITDA margin of 14.2%, and we continue to expect to have positive free cash flow generation for the full year.\n\nAnd that brings me to the final topic I'd like to address in my prepared remarks, which is our near-term priorities to drive operating success and shareholder value going forward. At a high level, there are three broad areas of focus which encapsulate our near-term strategic priorities in this regard. They are: one, continuing to effectively navigate this fluid period of ongoing recovery; two, expanding our pipeline of content and audiences; and three, evolving our company for long-term stability and growth. We remain highly optimistic about the future of theatrical exhibition and Cinemark as we continue to see a myriad of new revenue and productivity opportunities before us.\n\nFrom new experiential opportunities that will delight audiences and differentiate, such as the six ScreenX auditoriums we're introducing this quarter and the additional XD and D-BOX installations we've been rolling out all year, to further expanding upon our recently launched snacks in a tab online food and beverage sales platform, as well as our new Uber Eats relationship that went live in October, to further scaling our highly impactful marketing and loyalty platforms to inform and excite consumers about what's coming to our screens and be in their minds when they're making their plans for the weekend, to continuing to extract productivity gains from our many ongoing continuous improvement programs while further optimizing our theater footprint as the exhibition landscape evolves to activating new sources of content and audiences, like the highly successful live captured Coldplay concert this past weekend, the first of its kind series launch event we executed in partnership with Amazon for the Rings of Power and additional films from streaming companies on a broader, more significant scale. A plentiful stream of opportunities lies ahead for the exhibition industry and Cinemark, and we will continue to actively lean into these sources of new revenue growth and productivity as we nimbly manage through ongoing box office recovery and a fluid operating environment. The consistent discipline and emphasis we've placed on capital management, revenue and margin generation, operational excellence, and prudent investments in our future have served us well for years. Cinemark's overall financial position remains healthy because of it, and we believe our ongoing top-line and bottom-line market outperformance are validation that our strategies are continuing to be effective.\n\nWith that, I will turn the call over to Melissa, who will provide further information about our third quarter results.\n\nMelissa Thomas -- Chief Financial Officer\n\nThank you, Sean. Good morning, everyone, and thank you for joining the call today. As Sean mentioned, we are highly encouraged by the sustained consumer interest in theatrical moviegoing. We benefited from strong attendance in July and adapted to a significant reduction of film releases in August and September, which is reflected in our third quarter results.\n\nWe grew our worldwide revenue 50% year over year in the quarter and generated 125% more adjusted EBITDA, underscoring our ongoing recovery. Globally, we welcomed 48.4 million patrons in the third quarter. We generated $650.4 million of revenue and $99.5 million of adjusted EBITDA, yielding an adjusted EBITDA margin of 15.3%. The Cinemark team continued to effectively flex and adapt our operations in a dynamic environment with the varying ebbs and flows of content.\n\nTurning to our domestic segment, we served 29.5 million guests in the quarter. We generated 257.6 million of admissions revenue with an average ticket price of $8.73. Our average ticket price was up 10% versus pre-pandemic levels. As we continue to benefit from strategic pricing actions, a favorable ticket type mix and a higher mix of premium large format box office.\n\nRelative to recent trends, our average ticket price somewhat moderated during the quarter, driven by two primary factors: first, a higher mix of family content in the quarter, given the strength of Minions: The Rise of Gru; and second, the impact of National Cinema Day, a one-day event designed to celebrate the magic of moviegoing that featured promotional ticket pricing of $3 along with concession deals. While National Cinema Day drew a significant attendance during a non-peak time frame with limited new releases, the promotional pricing created a headwind to our average ticket price for the quarter. Our domestic concession revenue was $200.8 million in the quarter. We delivered another robust concession per cap of $6.81, an increase of more than 30% compared with the third quarter of 2019.\n\nWe were pleased with the growth in our concession per cap continue to be driven primarily by higher incidence rates, with consumers simply purchasing more than they did pre-pandemic, particularly popcorn, soda, and candy. Our per cap also benefited from strategic pricing actions we took to help mitigate some of the cost pressures we're experiencing, which was somewhat offset by discounting concession offers on National Cinema Day. Other revenue was $53.3 million in the quarter. Altogether, our domestic segment's total revenue was $511.7 million, with adjusted EBITDA of $70.7 million and an adjusted EBITDA margin of 13.8%.\n\nStill a healthy margin considering the reduction in quarterly attendance, and, therefore, reduced operating leverage over our fixed cost. Turning to our international segment, our third quarter attendance was 18.9 million. Despite content volume challenges, our international attendance surpassed second quarter 2022 levels, reflecting the ongoing recovery of theatrical moviegoing in Latin America and the significant success of cinema week in multiple countries in the region. We generated $67 million of admissions revenue, $52.8 million of concession revenue, and $18.9 million of other revenue in the third quarter.\n\nAltogether, we delivered $138.7 million of total international revenue and $28.8 million of adjusted EBITDA, resulting in a 20.8% adjusted EBITDA margin. Our international results continue to benefit from the team's diligent cost management and a more variable cost structure predominantly related to facility costs. Shifting to global expenses, film rental and advertising expense was 55.7% of admission revenue, 40 basis points favorable compared with the third quarter of 2019. This rate reflects lower box office generated from blockbuster films during the quarter and modifications in film rental terms.\n\nWe continue to strategically invest more in marketing relative to 2019 to grow our customer base, increase visit frequency, and strengthen loyalty. That said, relative to recent spend levels, we reduced our marketing expenditures in the third quarter based on box office expectations. Concession costs were 18.3% of concession revenue, an increased 50 basis points compared with the third quarter 2019. While we continue to see supply chain constraints and inflationary pressure in some key categories, we've been able to offset much of the pressure through seeking product alternatives, category management, and strategic pricing actions.\n\nOur global salaries and wages were $97 million in the third quarter, a decreased 6.1% compared with the third quarter of 2019, primarily driven by lower attendance, labor management efficiencies, and a reduction in operating hours. These factors were partially offset by higher average hourly wage rates due to government-mandated increases and a tight labor market. We continue to leverage tools and processes we implemented during the pandemic to guide and direct our operating decisions, including optimal operating hours, staffing levels, and food and beverage offerings, with the goal of maximizing our overall profitability on a per-theater per-hour basis. Facility lease expense was $77.2 million in the third quarter and declined 11.7%, driven by lower attendance, which led to a reduction in percentage rent and common area maintenance costs.\n\nUtilities and other expense with $110.4 million, a decreased 10.9% from the third quarter of 2019, driven primarily by variable costs with declined with attendance. That said, we continue to see some pressure from rising utility rates and excessively hot summer, and a higher mix of credit card transactions. G&A was $45.1 million, 1% higher relative to three Q2 2019. Excluding the impact of share-based compensation, G&A was down 2% in the quarter.\n\nWhile our staffing levels are lower than third quarter of 2019 and we continue to maintain discipline around discretionary spending, our G&A reflects a shift toward cloud-based software, as well as higher professional fees, and wage and benefit inflation. Globally, we generated a net loss attributable to Cinemark Holdings, Inc. of $24.5 million, resulting in loss per share of $0.20. Capital expenditures for the third quarter were $25 million, including $9 million for newbuilds and $16 million to maintain or enhance our existing circuit.\n\nYear to date, we've spent $65 million, well below our target of $125 million for the year, due primarily to supply chain constraints. While we continue to push to complete our planned projects, a range of $100 million to $115 million seems more reasonable at this juncture. Turning to the balance sheet, we ended the quarter with $632 million of cash. As expected and discussed in our last earnings call, our free cash flow was negative $43 million for the quarter, given the dearth of content in August and September, the timing of our semiannual interest payments, and other working capital headwinds, including film rental payments made in Q3 related to June's strong box office performance.\n\nThat said, we expect to generate positive free cash flow for the full year based on a stronger lineup of films in the fourth quarter. Our capital allocation priorities continue to be centered around strengthening our balance sheet, which includes delevering over time and making the right investments to position the company for success over the long term. As we look forward, we remain highly optimistic regarding the health of our industry and our company. Given the sustained interest in moviegoing and the ongoing revitalization of new film content with broad consumer appeal, we remain focused on diligently managing our operations while making prudent investments to position the company for long-term success.\n\nOperator, that concludes our prepared remarks, and we would now like to open up the line for questions.\n\nOperator\n\nThank you. [Operator instructions]. Today's first question is coming from Ben Swinburne of Morgan Stanley. Please go ahead.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThanks. Good morning. I followed the rules for two questions. Sean, we've heard through earnings season this quarter from the media companies, a clear pivot back to the studio, back to theatrical distribution.\n\nBut as you point out, it's a long production cycle for films. You would probably have better info than we do. But when you look at the next year or two, do you have a sense in totality of kind of how big the slate is going to look from a just quantity point of view? And when do you think you have line of sight on like what 2023 looks like? Because I feel like these two studios have had a bit of a strategic kind of whiplash here in the last six months. And it's a little hard to pin down exactly what we'll see over the next year and change.\n\nI'd love to hear your thoughts on sort of the studio supply situation. And then I just want to ask Melissa -- I don't know if you can give this to us, but how much did National Cinema Day impact maybe ATP and attendance, or at least ATP, which I think you call that was pressured by that? I wasn't sure how material that was, but that would be helpful. Thanks.\n\nSean Gamble -- President and Chief Executive Officer\n\nSure. Well, thanks for the questions, Ben. Let's start with the content question. We do see the different studios leaning back more heavily into theatrical.\n\nAnd as I mentioned, that is probably the limitation to how fast the volume overall recuperates is just the nature of how long it takes to make movies. So as we look at that, we see probably another couple of years to get fully back to where it is. The other thing that we're optimistic about is not only the traditional studios, but we do believe that in time and hopefully in fairly short order that the streaming companies are also going to lean more heavily into theatrical. I mean, we're getting that indication from them at the same value that a theatrical release provides to traditional studios.\n\nIt's no different for the streaming companies. It just provides greater awareness, greater promotional ability, greater interest when it hits those platforms. So we're very optimistic that that'll happen too. And it's just another source of filling those volume gaps.\n\nSpecific to next year, you know, it's interesting, I think I mentioned in the past year when we do our budget planning, we typically don't even get to deep into the film slate until around now because even for next year we don't have full-line of sight to the totality of the slate. Just to give you an example. On average, between 2017 and 2019, there were about 130 wide releases each year. And at this point in time, we generally have line of sight to around 110 to 115 of them from the major studios.\n\nBut we'd still lack full visibility to what's coming out from the smaller and even mid-tier studios that tend to fill the gap. Then there are also films like the Everything Everywhere All at Once, or the Smiles that start off as platform releases or even undated, but then grow to be wide releases by the end of the year in success. So as we sit here today, looking at next year, we see about 85 wide releases, and mind you, that figures already up about five titles from where it was a couple of weeks ago. So the slate still filling in and various small and mid-tier studios still haven't announced their full slate.\n\nSo if history is any indication, we'd be looking at next year potentially growing to around 100 to 105, which represent about 75%to 80% or so of pre-pandemic volume. Again, that could fluctuate, and that's a big step forward from 2022, which was about 60%. And I think indicative of just continued progress back as the production cycle fully fills in. Now, mind you, volumes not always indicative of box office either.\n\nWith fewer titles, films can run longer, or ultimately quality is the key driver. I think a great example is June and July of this year, where with 40% fewer releases, box office was within about 90% of 2019. So all told, again, I think things continue to progress in a positive direction, and all the indicators that we hear studios making publicly as well as in our own behind-closed-door conversations are consistent about the intent to lean more heavily back into theatrical.\n\nMelissa Thomas -- Chief Financial Officer\n\nBen, in terms of your question around National Cinema Day, on the domestic side, from an average ticket price perspective represented about a $0.17 headwind in the quarter on the international average ticket price, it was about a $0.12 headwind. And then I would mention as well that perhaps while the impact was smaller, there was still an impact on our concession per card from National Cinema Day. Probably most notably, the point I would call out there is that for our domestic per cap, but for the impact of National Cinema Day, it essentially would have been in line with our second quarter per cap. And then in terms of attendance that we welcomed as a result of National Cinema Day, that was around $2 million.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThank you both.\n\nSean Gamble -- President and Chief Executive Officer\n\nThanks, Ben.\n\nOperator\n\nThank you. The next question is coming from Eric Handler of MKM Partners. Please go ahead.\n\nEric Handler -- MKM Partners -- Analyst\n\nGood morning and thank you for the question. Sean, so this year you expect to be free cash flow positive next year. We assume that the box office will increase. We hope with that your free cash flow rises from 2022 levels.\n\nAs you think about your excess cash, do you put that right into paying down debt? Do you put a little bit more into capex if possible? Where are your priorities with any excess cash?\n\nSean Gamble -- President and Chief Executive Officer\n\nI'll -- Eric, I'll let Melissa start on that and then I may round out.\n\nMelissa Thomas -- Chief Financial Officer\n\nSo, Eric, from a capital allocation standpoint, our current priorities remain centered around strengthening our balance sheet, which includes delevering as well as making the right investments to position the company for the long term. So as you think about that on the first part in terms of strengthening our balance sheet, as we look at our current cash levels as well as box office and cash flow recovery expectations for 2023, delevering is certainly very much top of mind for us. As you think about capital expenditures, we do expect while we're still in our planning process for 2023. In light of the box office recovery, we would expect to step up our capital expenditure levels in 2023, albeit we would expect to remain well below pre-pandemic levels.\n\nWe do believe our peak capex years are behind us. But net and stepping back, I would say it's going to continue to be a balanced approach both in with strengthening our balance sheet in mind as well as positioning ourselves for the long term.\n\nEric Handler -- MKM Partners -- Analyst\n\nVery helpful. And then as a follow-up, I'm just looking at your other revenue which helped your numbers exceed expectations. You're $53 million of U.S. other revenue was down just 6% versus what we saw in 2Q, which when you think about the box office falling off quarter-to-quarter 17%, that's a really good number.\n\nWas there anything in other revenue that was unusual or one time that allowed you to put a number like that?\n\nMelissa Thomas -- Chief Financial Officer\n\nAnd so from an other revenue perspective, that is going to fluctuate quarter to quarter. Stepping back as we think about what other revenue has been benefiting from, there's a few factors that I would call out to your point. Despite a 33% drop in attendance relative to 2019, our other revenue was actually up in the quarter. What we're benefiting from is higher screen advertising revenue, also higher online sales penetration, and promotional income recovering at a faster rate than attendance.\n\nAs you think about going forward and how to think about other the other revenue line item based on the dynamics that we're seeing in that area, we do expect that the recovery of other revenue will continue to outpace our attendance recovery in the near term. But as I said, you're going to see that kind of bounce around from quarter to quarter with ebbs and flows and content and otherwise.\n\nEric Handler -- MKM Partners -- Analyst\n\nThank you very much.\n\nSean Gamble -- President and Chief Executive Officer\n\nThanks, Eric.\n\nOperator\n\nThank you. The next question is coming from Mike Ng of Goldman Sachs. Please go ahead.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nHey, good morning. Thank you for the question, and also the very thoughtful discussion around the current industry dynamics. Moreover, in this period of transient-reduced home output, I'm just wondering if you expect to see a return of shoulder periods where, you know, studios are scheduling temple films or has the output recovered enough that we're still see programing throughout the entire year like we have in the last couple of years? And then secondly, I was just wondering if you could talk a little bit about the Lat Am attendance strength in the quarter. Was that primarily due to a film mix with things like, you know, Minions and Thor? Or was there also a comp -- easy comp thing that may have helped as well? Thank you.\n\nSean Gamble -- President and Chief Executive Officer\n\nThanks for the questions, Mike. You know, I do think that the -- my sense is the studios will continue to take advantage of the full year. We've just seen too many examples now of movies doing really strong business outside of just summer and holiday period. I mean, even when we look today and things can still move around, but when you look at the slate for next year, you got a film like Ant-Man in February, John Wick in March.\n\nYou know, those films arguably may have historically been in the summer, but clearly, they're taking advantage of the competitive landscape at Shazam in March as well. I mean, they're taking advantage of spreading out a bit more. And we've certainly seen in this period of reduced volume how that is allowing some of these films to run. I mean, you just have people going there, they're delivering, having, having smaller drops week to week to week and generating overall larger results.\n\nSo I do think because of that, the studios will continue to take advantage of it. And as I said, when we look at the slate next year, we see that to a large degree already with how things are positioned. In terms of Latin America, there definitely was a component of an easier comp. When we look at the state of the business last year, there were many more restrictions in place in terms of capacity, and we weren't even fully up and going at that point.\n\nSo you do have more of that benefit LatAm relative to the US in terms of attendance. So that was a piece. Some of that also is just the profile of the slate and certain markets are even rebounding a stronger. You look at Argentina.\n\nArgentina is really high and then I'd say probably the final thing that they had benefiting from over the course of the quarter, while there was a National Cinema Day in the U.S., in Latin America, this is something that has been going on there for a bit of time. They actually had more of a National Cinema Week in country to country, which was really successful. So that drove a tremendous amount. And there was over a million attendees from that week in and of itself.\n\nSo when we look at all those things collectively together, that's what was really a big factor in LatAm strong results.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nExcellent. Thank you very much for all the thoughts, Sean.\n\nSean Gamble -- President and Chief Executive Officer\n\nAppreciate it. Thanks for the questions.\n\nOperator\n\nThank you. The next question is coming from Jim Goss of Barrington Research. Please go ahead.\n\nJim Goss -- Barrington Research -- Analyst\n\nOK. Thank you. To [Inaudible] or too much rain and some of the same subjects. But I was wondering if you feel that you need to achieve the same mix and number of titles to climb the mountain back to past box office levels? Or do you just need enough of a mix so the people have a choice because they have a tendency to want to go and see something, not just be driven by attraction to a certain title.\n\nAnd maybe Movie Club gives you enough of a dialog with your consumers to get some sense of that. I know it's answerable in a lot of ways, but I'm curious of your thoughts.\n\nSean Gamble -- President and Chief Executive Officer\n\nSure. Well, I appreciate it, Jim. And look, I think -- I certainly think there is a scenario for our company and for our industry to continue to be healthy and successful in an environment that perhaps had less total volume and to a certain extent less mix. That said, clearly, we feel having more variety that appeals to a wider range of audiences and overall more volume is just a better place to be, especially when we just look at there's a demand for it, right? You know, there are consumers.\n\nWe've just seen that in how people are going out to the movies and they're looking for this in all periods. So we think probably there's bigger opportunity in this scenario of more variety and more volume. But that doesn't mean that there isn't an ability to be healthy and successful in a environment where there isn't. My personal belief is, as we come through the next few years, that we could actually find ourselves in a state where there's more volume than we've ever had.\n\nAs we look to the number of companies that are making movies and getting into this space of production, and ultimately we want to use that as a way to -- not only supplement their revenue, but as I mentioned in the prepared remarks and earlier, just as a way to better promote that content and use that content to better promote these other distribution channels, which is very effective at doing.\n\nJim Goss -- Barrington Research -- Analyst\n\nOK. Thanks. And my other one was related to the downward skew in the [Inaudible] margins. And I'm wondering where you think it should level off, because I was thinking the theatrical windows could provide at least somewhat of an offset to the blockbuster concentration.\n\nAnd I would think you'd be in no less bad than you did before, but it seems like you're scaled down a little bit. And should you be able to get back a little higher this coming year as you do get more content?\n\nMelissa Thomas -- Chief Financial Officer\n\nSo, Jim, I'll take that one. In terms of film rental, as you think about the rates going forward, as you stated, we have been successful in seeking economic consent and consideration commensurate with the shortened theatrical window, but this will likely be offset by a higher concentration of larger tentpole films, at least over the near term. As more of those small and mid-tier films start to return, that will naturally benefit our overall film rate. But as Sean mentioned, this may take some time.\n\nSo as you think about go forward as the industry further recovers and films generate higher box office results, be reasonable to assume that our film rental rates may be more in line with those pre-pandemic levels. I think the other thing just to keep in mind, Jim, is that we have stepped up our marketing investment relative to 2019 due to the strong returns that we've been seeing there. So as we look forward, we'll continue to flex-up our marketing spend up and down depending upon box office expectations and returns. But that would certainly be a consideration point relative to 2019.\n\nJim Goss -- Barrington Research -- Analyst\n\nAll right. Thank you both.\n\nSean Gamble -- President and Chief Executive Officer\n\nThanks, Jim.\n\nOperator\n\n[Operator instructions]. The next question is coming from David Karnovsky of J.P. Morgan. Please go ahead.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nAll right. Thank you. Sean, as you noted, some adult-skewing films, as you termed it, like Elvis or Crawdads, have performed pretty well at the box office. And at the same time, I think this is the type of content that historically has proved maybe more risky or uneven in its performance.\n\nI guess my question is we've seen studios increasingly move back toward theatrical for tentpoles and away from streaming, how do you kind of either willingness to bring more of the mid-range or small-budget films to market, which are the types of films where I think you are in a little bit better split? Thanks.\n\nSean Gamble -- President and Chief Executive Officer\n\nIt's a great question and an interesting observation. I actually think this is one of the positive things that has come out of a bit of a more dynamic window. We still clearly see that an exclusive theatrical window is necessary for achieving all those different benefits I talked about for maximizing the impact that theatrical can have, for creating value for an asset. That said, as you flagged, one of the challenges of some of this mid-tier and smaller content pre-pandemic was the cost to make them has just gone up and the cost to market them has gone up over the years.\n\nAnd having that long window actually created a more challenged model for those types of titles. Now, if you're a studio and you know that you have the scenario where -- a film like Elvis, you put a movie like that out and it works. Hey, I let it run like they did, right? That ran -- they didn't put that on to HBO Max for some time, and it generated a ton of theatrical proceeds. But if for whatever reason a movie doesn't work, the knowledge that you can get into the home earlier and mitigate some of the downside you have on that, it actually risks those types of movies.\n\nSo I think it's part of the volume conversation we have. I see that actually leading to studios being able to take more chances on those types of movies, and you're already seeing it. You're starting to see some more romantic comedies which have just disappeared. Now they're creeping back in.\n\nI suspect we'll start to see some other types of comedies, other films, other dramas, and things like that that have gone away because of this new model. So I think it's just it's a healthier place to be overall, knowing that you've got the window there to be able to maximize the impact when films are working, but that there's a way to have a little bit of more flexibility in certain areas where it's down, it was down. So I see that ultimately leading to more of this volume coming back.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nSean Gamble -- President and Chief Executive Officer\n\nThanks. Appreciate the questions.\n\nOperator\n\nThank you. We're showing no additional questions in queue at this time. I would like to turn the floor back over to management for any additional or closing comments.\n\nSean Gamble -- President and Chief Executive Officer\n\nWe'd like to thank all of you again for joining us this morning. And we very much look forward to speaking with you once more following our fourth quarter results. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChanda Brashears -- Senior Vice President, Investor Relations\n\nSean Gamble -- President and Chief Executive Officer\n\nMelissa Thomas -- Chief Financial Officer\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nEric Handler -- MKM Partners -- Analyst\n\nMike Ng -- Goldman Sachs -- Analyst\n\nJim Goss -- Barrington Research -- Analyst\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nMore CNK analysis\n\nAll earnings call transcripts"
}