{
  "companyName": "Organogenesis Holdings Inc.",
  "companyTicker": "ORGO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/organogenesis-holdings-inc-orgo-q3-2022-earnings-c/",
  "content": "Organogenesis Holdings Inc. (ORGO 2.67%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the third quarter 2022 earnings conference call for Organogenesis Holdings Inc. [Operator instructions] Please note that this conference call is being recorded and that the recording will be available on the company's website for replay shortly. Before we begin, I would like to remind everyone that our remarks today may contain forward-looking statements that are based on the current expectations of management and involve inherent risks and uncertainties that could cause actual results to differ materially from those indicated Including the risks and uncertainties described in the company's filings with the Securities and Exchange Commission, including Item 1A risk factors of the company's most recent annual report and its subsequently files quarterly report. You are cautioned not to place any undue reliance upon any forward-looking statements, which speak only as of the date made.\n\nAlthough it may voluntarily do so from time to time, the company undertakes no commitment to update or revise the forward-looking statements whether as a result of new information, future events, or otherwise except as required by applicable securities laws. This call will also include references to certain financial measures that are not calculated in accordance with generally accepted accounting principles or GAAP. We generally refer to these as non-GAAP financial measures. Reconciliations of those non-GAAP financial measures to the most comparable measures calculated and presented in accordance with GAAP are available in the earnings press release on the Investor Relations portion of our website.\n\nI would now like to turn the call over to Mr. Gary S. Gillheeney, Sr., Organogenesis Holdings' president and chief executive officer. Please go ahead, sir.\n\nGary Gillheeney -- President and Chief Executive Officer\n\nThank you, operator, and welcome everyone to Organogenesis Holdings third quarter 2022 earnings conference call. I'm joined on the call today by Dave Francisco, our chief financial officer. Let me start with a brief agenda of what we will cover during our prepared remarks. I'll start with a high-level review of our third quarter revenue results and some recent operating highlights.\n\nAfter my opening remarks, David will provide you with a more in-depth review of our third quarter financial results, our balance sheet and financial condition at the end of the third quarter, and the guidance for 2022 that we updated in today's press release. And then I'll open it up for questions. Beginning with a review of the third quarter, we reported net revenue of $116.9 million, an increase of 3% year over year, driven by a 2% increase in sales of our advanced wound care products and a 15% increase in the sale of our surgical and sports medicine products. Third quarter sales results came in below the guidance range we provided on our second quarter call driven primarily by softer than expected growth in our advanced wound care products.\n\nWhile sales of our surgical and sports medicine products were roughly in line with our prior expectations. We believe that hurricane Ian impacted demand in Florida in the last week of the quarter. We estimate that excluding this hurricane related business disruption, we would have delivered advanced wound care sale results within the lower end of our third quarter guidance range. As expected, we experienced continued improvement in COVID-related headwinds as patient visits improved in quarter three, but customers are continuing to struggle with staffing challenges, particularly customers in the physician office setting.\n\nWhile we were pleased to see these headwinds show measured improvement, we experienced the more challenging operating environment in the physician office setting versus what we had assumed in our previous guidance. Importantly, despite unexpected challenges in the quarter, the team performed well as we continue to execute against our growth strategy and leverage our competitive positioning including the strength of our expanded sales force. The benefits of our comprehensive portfolio in leveraging multiple sales channels and new product introduction, including our brand loyalty. Let me update you on the progress of each of these in Q3.\n\nFirst, our commercial team has grown to 365 direct representatives up 11% year over year, and we believe our commercial team continues to represent a key competitive advantage for Organogenesis. The strength of our sales force enables continued expansion across the country and deeper penetration as our team increases awareness of the benefits of our advanced technologies. Second, we continue to make progress in diversifying our revenue across physician specialties in sites of care by targeting our product development and commercial strategies to drive growth in these key channels. Excluding ReNu and NuCel and Dermagraft, the team delivered low double-digit growth in number of accounts served in both the hospital outpatient setting and the physician office setting compared to the prior year.\n\nThird, a broad and highly differentiated portfolio of products continues to be a key advantage for the company. Sales of our PuraPly products increased 12% year over year, a long-term strategy to introduce new products and line extensions have enabled access to multiple sites of care including new physician specialties and continued to drive strong demand for this well-established highly differentiated PuraPly brand. Our portfolio of PuraPly Technologies expanded in Q3 as we received 510k clearance for PuraPly MZ, representing a continuation of brand extension strategy of the PuraPly product portfolio. PuraPly MZ leverages the innovative properties of our PuraPly technology engineered into a micronized or powdered form to provide surgeons with an option for complex surgical wounds.\n\nAnd we expect PuraPly MZ to be a material driver of growth in our surgical and sports medicine product grouping when it enters the full market in Q1 of 2023. While we're pleased to see continued strong adoption and utilization of PuraPly products, sale of our non-PuraPly portfolio of products declined 6% year over year in Q3. The decline in non PuraPly products was driven by a 21% decline in net revenue from our PMA and other products offset by -- partially by a 2% increase in the sale of amniotic products compared to the prior year. The year-over-year decline in PMA and other sales was directly related to the prior year comparison which included Dermagraft sales, which was suspended in the second quarter of 2022.\n\nPMA and other sales increased mid-single digits, excluding the impact of Dermagraft in the period. Sales of amniotic products increased low-single digits versus our expectation for low double-digit growth year over year in Q3. While sales of our amniotic products increased, on both a year-over-year basis, and a quarter-over-quarter basis in Q3, our amniotic sales results were impacted by continued competitive pressure in the office channel, which challenged our share of voice and slowed adoption of our amniotic technologies with new customers. We also continue to see impacts on existing customer demand as a result of aggressive pricing strategies from small amniotic players, leveraging the lack of CMS published ASPs for the skin substitute products.\n\nDespite this more challenging environment for our amniotic products in the office channel, we successfully leveraged our diverse portfolio and drove strong growth of our PuraPly brand again in Q3. Simply stated we are navigating an unexpected challenges in one of our key markets considering the circumstances we have developed and delivered year-over-year growth in sales of our advanced wound care products during the same -- the first nine months of 2022 fueled by our team's success and leveraging our diversified portfolio of products, including impressive growth from our PuraPly brand, with sales have increased 37% year over year for the first nine months of 2022. And while our revenue growth has been paced by unexpected headwinds this year, we have expanded a number of accounts using our products over the first nine months of 2022 in both the HOBD and physician office setting, which speaks to the success and executing against one of our key long-term growth strategies. We've updated our full year 2022 guidance which now calls for net revenue in the range of 448 million to 465 million, which at the midpoint represents a decline of approximately 2% year over year on a reported basis, and essentially flat year over year on an adjusted basis.\n\nOur full year 2022 revenue guidance now reflects a more challenging operating environment in the physician office setting in the fourth quarter compared to what our prior guidance had assumed. Specifically, we expect the sales in the physician office setting to be impacted by continuing competitive pressure from smaller antibiotic players and overall market disruption driven by reimbursement uncertainty related to CMS's publishing of ASPs for skin substitute products this year. Importantly, we believe this competitive pressure from amniotic plays will continue until CMS moves forward with publishing ASPs. That said, we continue to believe that we are well-positioned with our unique customer value proposition offering a broad portfolio of products across the continuum of wound care, diversified revenue sources across multiple sites of care and physician specialties, and our broad commercial reach.\n\nWhile the office channel is facing challenges this year, we continue to grow our customer base and build on our leadership position in the office setting, as well as in wound care centers across the United States. Long-term, we will continue to be a leader in the advanced wound care space by launching highly innovative, highly efficacious products, as we deliver on our mission to provide integrated healing solutions that substantially improved outcomes while lowering the overall cost of care. Before I turn the call over to David, I wanted to provide you two operational items of note. First, as disclosed in our 10-Q filing with the SEC this evening, the company decided to pause the construction of one of our Canton, Massachusetts manufacturing facilities.\n\nThe decision was made in response to the material increase in the expected investment for this facility due to the inflation in materials and construction costs in recent years. Specifically, the latest estimated project total investment represented a 40% increase from the original budget that we established two years ago. We simply cannot justify allocating capital to this endeavor given the material change and required investment. We're currently evaluating potential alternatives and we'll provide updates as key decisions regarding alternatives are made going forward.\n\nAnd it's important to note that the decision to pause the construction of this manufacturing facility will not impact our ability to meet our markets demand for our existing commercialized products or our ability to achieve our target of greater than 80% gross margins in the future. Second, we continued to make progress during the third quarter in our ongoing Phase 3 clinical trial for ReNu for the treatment of knee osteoarthritis. Our clinical team has enrolled more than 82% of the patients needed for the trial has activated seven additional investigative sites, as well as implementing additional recruitment strategies to further accelerate the pace of enrollment over the balance of 2022. We continue to target the completion of enrollment by the end of the year.\n\nWe also remain on track to complete the first interim analysis of data for 50% of the subjects in late Q4. We are also planning to submit an IND amendment to the FDA and expect to be ready to launch a second Phase 3 trial by the end of the second quarter of 2023. We have determined that at this stage, the best approach from a timing and regulatory perspective is to submit the IND amendment and moving forward immediately, as it allows the company to initiate a second Phase 3 study as soon as possible and leverage the major operational advantages we have of continuing with the current active investigator sites. This plan essentially gives us more options in our regulatory approach.\n\nThis is based on our strategy of presenting to the FDA, the completed 200 patient randomized controlled trial and the current Phase 3 trial as valid scientific evidence of ReNu safety and efficacy for knee osteoarthritis, and thus why the second FDA trial, a Phase 3 study should not be required. Finally, I want to share a few thoughts on the announcement from CMS on November 2nd regarding the proposed changes for Medicare payments under the physician fee schedule for advanced wound care treatment. By the way of reminder, CMS issued proposed rule in July which represent a first step to standardize reimbursement for all types of wound care delivered in the physician office including cellular and tissue-based products. Based on the feedback received during the open comment period, CMS decided it would be beneficial to provide interested parties more opportunity to comment on the specific details of changes in coding and payment mechanisms prior to finalizing a specific date when the transition to a more appropriate and consistent payment and coding for these products will be completed.\n\nCMS is conducting a Townhall in early 2023 and we look forward to participating in this event as well as continuing our engagement with them on this important initiative. Now, with that, let me turn the call over to David for a review of our financial results in the third quarter, our balance sheet and financial conditions as of the end of the quarter, and review of our 2022 financial guidance that we updated in today's press release. David?\n\nDave Francisco -- Chief Financial Officer\n\nThank you, Gary. I will begin with a review of our third quarter financial results. Unless otherwise specified all growth rates referenced during my prepared remarks are on a year-over-year basis. Net Revenue for the third quarter of 2022 was 116.9 million up 3%.\n\nOur advanced wound care net revenue for the third quarter of 2022 was 109.5 million, up 2% year over year, and net revenue from surgical and sports medicine products for the third quarter of 2022 was 7.3 million up 15%. Net revenue from our PuraPly products for the third quarter of 2022 was 63.7 million up 12%. Gross profit for the third quarter of 2022 was 90.7 million or approximately 77.6% of net revenue, compared to 77% last year. The change in gross margin compared to the prior year was driven primarily by changes in product mix.\n\nOperating expenses for the third quarter of 2022 were 88.9 million, compared to 71.3 million last year, an increase of 17.6 million or 25%. The increase in operating expenses in the third quarter of 2022 was driven by a 17 million or 27% increase in selling, general and administrative expenses, and 0.6 million or 7% increase in research and development costs compared to the prior year. The year-over-year increase in selling, general and administrative expense was primarily due to additional headcount, primarily in our direct sales force, and higher spending and travel and marketing programs amid relaxed COVID-19 travel restrictions. The year-over-year increase in R&D was driven by a step up in clinical study spend and related costs necessary to seek regulatory approvals for certain of our products.\n\nThird quarter 2022 GAAP operating expenses included certain non-operating items. There was a $4.2 million charge related to the disposal of certain equipment related to the construction in progress in one of the company's Canton, Massachusetts facilities. 0.6 million of cancellation fees incurred in connection with the company's decision to pause its manufacturing facility construction project, and 0.6 million of employee retention and benefits as well as other exit costs associated with company's restructuring activities. This compares to certain non-operating items totaling 1.2 million in the prior year period.\n\nExcluding these non-operating items and non-cash intangible amortization of 1.2 million and fair value of contingent consideration of 0.9 million in the prior year period, non-GAAP operating expenses for the third quarter of 2022, increased 19% year over year. Now we have a detailed reconciliation of these non-operating and non-cash items in our press release this afternoon. Operating income for the third quarter of 2022 was 1.8 million, compared to operating income of 16.3 million last year a decrease of 14.5 million. Total other expenses of third quarter was 0.6 million, compared to 3.4 million last year, a decrease of 2.8 million or 83%, driven primarily by the prior year period, including 1.9 million of loss on extinguishment of debt, which did not impact the financial results in the third quarter of 2022.\n\nRemaining year-over-year decline in total other expenses in the third quarter 2022 is attributable to reduced interest rate for borrowings under the new credit agreement signed in August of 2021. Net income for the third quarter of 2022 was 0.2 million, compared to income of 12.6 million last year, a decrease of 12.4 million. Adjusted EBITDA of 11.6 million for the third quarter of 2022 or 10% of net revenue, compared to adjusted EBITDA of 21.7 or 19% of net revenue last year. We have provided a full reconciliation of our adjusted EBITDA results in our earnings press release issued this afternoon.\n\nTurning to the balance sheet as of September 30th, 2022, the company had 108 million in cash and cash equivalents and restricted cash and 72.6 million in total debt obligations, compared to 114.5 million in cash and cash equivalents and restricted cash and 73.6 million in total debt obligations, of which 0.2 million were capital lease obligations as of December 31st, 2021. As a reminder, we also have up to 125 million of available borrowings on a revolving credit facility as of September 30 2022. Turning to a review of our 2022 net revenue guidance, which we updated in our press release this afternoon, for 12 months ending December 31st, 2022, the company now expects net revenue between 448 million and 465 million, representing a decrease of approximately 1% to 4% year over year, and roughly flat on an adjusted basis excluding sales of ReNu and NuCel for the first five months of 2021. The 2022 net revenue guidance range now assumes net revenue from advanced wound care products is flat to down 2% year over year.\n\nNet revenue from surgical and sports medicine products decreased approximately 11% to 25% year over year, and net revenue from sale of our PuraPly products increases approximately 27% to 31% year over year. By way of reminder, our 2021 results include approximately 11 million in revenue attributable to ReNu and NuCel products during the five months ended May 31st, 2021, the end of the FDA enforcement grace period. Excluding sales of these, ReNu and NuCel for the first five months of 2021, our 2022 revenue guidance applies roughly flat growth year over year on an adjusted basis. In terms of profitability guidance for 2022, the company now expects to generate GAAP net income between 12 million and 20 million, adjusted net income between 22 million and 31 million.\n\nWe also expect EBITDA of between 31 million and 42 million and adjusted EBITDA between 46 million and 58 million. In addition to our formal financial guidance for 2022, we are providing some consideration for modeling purposes. Our full year 2022 guidance range now assumes sales of our amniotic products will decrease at the midpoint of our full year net revenue range of approximately 28% year over year in 2022 compared to prior guidance, which assumed a decline of approximately 15% year over year. Sales of our non-PuraPly and non-amniotic products which collectively formed a group called PMA and other will decrease at the midpoint of the range approximately 19% year over year in 2022 compared to our prior guidance, which assumed a decrease of 17% year over year.\n\nGross margins of approximately 76.5% to 77%. Total GAAP operating expenses will increase approximately 15% to 16% year over year compared to our prior expectation of growth and range of 13% to 16% year over year, which includes the non-operating charges of 4.8 million related to the 275 Dan Road project. Total interest and other expenses approximately 2.8 million, compared to 3.5 million previously. And a GAAP tax rate of approximately 30%, compared to 27% previously.\n\nNon-cash D&A and non-cash stock comp expense of approximately 11 million and 6 million respectively with a weighted average diluted share count approximately $132 million. We now expect full year 2022 capex to be approximately 30 million to 35 million, compared to 50 million to 60 million previously. With that operator, I'll turn the call back over to you.\n\nOperator\n\nThank you, sir. [Operator instructions] Our first question is from Steve Lichtman with Oppenheimer. Steve?\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nThank you. Hi, guys. I was wondering. Gary, if you could talk to you what, within the amnion business perhaps got worse from the second quarter call or didn't get better, as you would have expected at that time? Maybe you could drill down a little bit more specifically on that.\n\nGary Gillheeney -- President and Chief Executive Officer\n\nSure. So I think the competitive pressure that we talked about, in Q2 has continued without the publishing of ASPs for all of the products that are out there. There is a lot of aggressive pricing and rebating and discounting that continues. So and we see that consistent, maybe slightly, a little bit higher, but we also see more confusion in the market with reimbursement.\n\nSo, with the physician fee schedule coming out, there's a lot of confusion, particularly in the office setting where they don't necessarily have sophisticated reimbursement support in that setting, and understanding what it means as well as the non-published ASP issue. So a lot of noise, a lot of confusion and disturbance that we don't see clearing up, and certainly didn't predict that would be the case until CMS publishes these ASPs and brings clarity, obviously to physician fee schedule, or at least that clarity is being able to be delivered to the office base, so they understand exactly what's happening.\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nOK. And then I guess, this is a follow-up on new products, you mentioned on the PuraPly side, but I don't think you mentioned anything on nova Novachor, so any update there? And then does the change in your thoughts on the facility expansion impact TransCyte at all, or is that separate?\n\nGary Gillheeney -- President and Chief Executive Officer\n\nSo Novachor, we had a soft launch and that product is being launched right now. As we've guided we didn't expect that it would have a significant impact in this last quarter. But we expect that it'll have more of an impact certainly next year, the clinical results that we're getting from the field are very strong. The handling is a little different, a little better.\n\nAnd clinicians really appreciate the product. Regarding TransCyte, you're correct. Our TransCyte and Dermagraft were both scheduled to be manufactured in our new facility. So we do have alternatives that we're looking at.\n\nAnd we'll update you when those alternatives are actually coming forward. But we do have some additional alternative strategies in particular to get those products out on the market.\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nOK. I'll leave it at the two and jump back in queue. Thanks.\n\nOperator\n\nThank you very much. Our next question will be from Ryan Zimmerman with BTIG. Ryan?\n\nRyan Zimmerman -- BTIG -- Analyst\n\nGood afternoon. Thanks for taking the question. Gary, I want to follow up on a couple of things. You cited a lot of factors, this quarter, the hurricane impact to the office, staffing, etc.\n\nI don't know how to kind of parse out or not how the magnitude of each? And how to think about each of those factors. As we move into fourth quarter, I mean, I can appreciate that competition is not abating, as you had expected previously. But in this kind of a multi-part question, Gary, but what's your expectation for when that does abate. And then I have a couple of follow-ups.\n\nGary Gillheeney -- President and Chief Executive Officer\n\nSo I mean, the hurricane is, situational, it just happened. It just affected our last week of sales as folks started to shut down a little bit before it hit. And then the last day, we had some challenges getting product out, down into the Florida area. So that certainly affected our ability to jump into the range, the guidance range, but we were still, we're going to be at the lower end of the range.\n\nAnd that speaks more to reimbursement, confusion, as well as the competitive pressure, as you mentioned. So when does the competitive pressure end, I think, how does others feel, clearly publishing everyone's ASP is the first step and a major step of just leveling the playing field and allowing that competitive pressure on pricing and rebaiting to end. That's important. And once there's clarity, I think in CMS is Physician Fee Schedule ruling and how that that those changes are going to take place and how it will be calculated all the questions we've all asked, I think that overhang will kind of lift our feeling, as I've said before is, we see that the delay in the CMS filing, is a good thing that they're looking for more input than they're looking for industries input, as well as clinical input to what's the right strategy here to make sure patients still have access to that site of care and all of the products that those patients need.\n\nSo we think, that will help significantly as well in the competitive area with reasonable results in the office and do extremely well at site and will continue to add share, with a reasonable change in that site of care.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nOK. Follow up for me if I could, though, just to be clear, I think CMS published the rate for Affinity in the fourth quarter down 12%. I just want to make sure that that's correct. And is that also more of a near-term impact and kind of how do you expect that to follow as we move into '23?\n\nDave Francisco -- Chief Financial Officer\n\nYes. I mean, we don't talk about the pricing strategy going forward. But I mean, it definitely was down, we did take the price down. And part of that is related to this intense pricing competition that we're experiencing right now.\n\nSo the commercial team is very focused on ensuring that they understand what's happening in each of these accounts and doing everything they can to combat the situation that we're in right now. But I mean, the fundamentals are strong still in the business. And I think the fact is that the commercial team as you know, quite broad. And we'll continue to push that forward.\n\nWe continue to build out our customer base and so they're doing a great job from that standpoint. It's just not growing as fast as we would like, but clearly under the new guide excluding ReNu and NuCel and Dermagraft really getting down to our core, we're still growing modestly and so, we feel good about the foundation and fundamentals of the business.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nAnd I don't know if you want to comment right now on '23, guys, I mean, I know it's early, but what is your expectation for just the overall growth rate of the business, be it advanced wound care or surgical and sports medicine, as we think about '23, and some of the puts and takes that may, that we should be considering in the context of all these dynamics.\n\nGary Gillheeney -- President and Chief Executive Officer\n\nWell, we don't really talk about '23. But some of the dynamics, Ryan, I mean, the way we look at it, so we certainly will have a much bigger sales force. We have a lot of new reps that we've added at the end of the year, that will help drive that customer growth that we've already seen, even this year. With the headwinds, we do have new products, as you mentioned, that will have more of an impact in '23.\n\nOur PuraPly brand is doing extremely well in the surgical setting. So that's an area that we focus on. And we're adding a lot of accounts, we've added double-digit growth in accounts that will be available to us next year with that larger sales force. So, as Dave said, the fundamentals of the base business, the core business is good.\n\nWhat happens going forward, we'll have to assess when we get more information on the competitive environment. CMS's decisions.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nJust a last one for me, I'll hop back in queue. As we think about cost next year, Dave, I know there was some one-time dynamics this quarter that lifted up the opex. But assuming that comes back out, how do you kind of expect to manage cost and into the next year? And do you feel like you need a belt tighten? Just you're scaling back, obviously, the facility in Massachusetts? Is there any other belt tightening that consider to allow you to kind of keep up some of those margins?\n\nDave Francisco -- Chief Financial Officer\n\nYes, Ryan. It's great question. I mean, obviously, as Gary said, we're not ready to talk about '23 yet, but we have made a lot of investment in '22, as you said, there's some kind of transitory costs in there that are not going to repeat. But we will obviously be prudent in our investment profile based on what the outlook is for revenue.\n\nWe're really, as we both said, the fundamentals of the business are still here. They're strong. Again, we're continuing to build the customer base. We want to make sure that we have the resources and infrastructure to capture that demand when it returns at a stronger basis than it is today.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nThanks, guys.\n\nOperator\n\n[Operator instructions] We are currently showing no remaining questions in the queue at this time. That does conclude our conference for today. Thank you very much for your participation.\n\nGary Gillheeney -- President and Chief Executive Officer\n\nThank you.\n\nDuration: 0 minutes\n\nGary Gillheeney -- President and Chief Executive Officer\n\nDave Francisco -- Chief Financial Officer\n\nSteve Lichtman -- Oppenheimer and Company -- Analyst\n\nRyan Zimmerman -- BTIG -- Analyst\n\nMore ORGO analysis\n\nAll earnings call transcripts"
}