{
  "companyName": "Delek Logistics Partners",
  "companyTicker": "DKL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/delek-logistics-partners-dkl-q3-2022-earnings-call/",
  "content": "Delek Logistics Partners (DKL -3.66%)\nQ3 2022 Earnings Call\nNov 07, 2022, 9:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Delek Logistics Partners 2022 third quarter conference call. [Operator instructions] I would now like to turn the conference over to Blake Fernandez. Please go ahead.\n\nBlake Fernandez -- Senior Vice President, Investor Relations and Market Intelligence\n\nGood morning. I would like to thank everyone for joining us on this webcast to discuss Delek Logistics Partners' third quarter '22 financial results. Joining me on today's call will be Avigal Soreq, president; Reuven Spiegel, CFO; Todd O'Malley, EVP and COO; and other members of our management team. As a reminder, this conference call will contain forward-looking statements as that term is defined under federal securities laws, including, without limitation, statements regarding to guidance and future business outlook.\n\nThese statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast. For more information, please refer to the risk factors discussed in the company's most recently filed, annual report, Form 10-K, and quarterly report on Form 10-Q filed with the SEC, along with the press release associated with this call. The company assumes no obligation to update any forward-looking statements or information, which speak of their respective dates. On today's call, we will begin with comments from Avigal.\n\nReuven will then provide financial overview. Todd will review results. And then, we will have a Q&A session. With that, I'll turn the call to Avigal.\n\nAvigal Soreq -- President\n\nThanks, Blake. DKL had a record EBITDA this quarter. We continue to build momentum on several fronts. Our legacy Permian gathering business met our previously stated targets, which was to double volume between Q4 of 2021 to September of 2022.\n\nThis remains a growth engine for our company. I want to give you an update on our 3 Bear acquisition. We are pleased with the progress of the integration. The assets are performing in line with our initial expectations, and we're excited about additional growth opportunities.\n\nThe geographic and product line diversity provided from the acquisition should serve us well into the future tactically and strategically. Additionally, our business is benefiting from a strong refinery utilization rates at the Delek U.S. level. From a macro perspective, the energy industry has recovered from the pandemic, and we are optimistic on the outlook for the midstream business.\n\nI look forward to updating you next quarter. With that, I will turn the call over to Reuven.\n\nReuven Spiegel -- Chief Financial Officer\n\nThank you, Avigal. Our distributable cash flow, as adjusted for 3 Bear transaction cost, was approximately 70 million in the third quarter, compared to 56 million in the third quarter of '21. Our DCF coverage ratio, as adjusted for transaction cost, improved to 1.62 times for the third quarter. EBITDA was 89 million, which includes 4.2 million of transaction costs associated with the 3 Bear acquisition.\n\nOur board approved an increase in the quarterly distribution to $0.99 per limited partner unit for the quarter ended September 30th. This distribution will be paid on November 10th to unitholders of record on November 4th. And this represents 39 consecutive quarters of distribution increases, and we remain on track to deliver on our 5% increase year over year. At September 30th, DKL had 193 million of available capacity under 1 billion credit facility.\n\nOur total debt was 1.45 billion. In October, DKL extended its credit facility to 1.2 billion, including senior secured revolving commitment of 900 million with a maturity date in October 27, and a new secured term loan of 300 million with a maturity date in October 24. Now, I will turn the call over to Todd to discuss the results.\n\nTodd O'Malley -- Executive Vice President and Chief Operating Officer\n\nThanks, Reuven. The 3 Bear operating segment had a contribution margin of $18.1 million in the third quarter. Moving forward, we plan to combine results from our legacy Delek Permian gathering system with the 3 Bear assets to better reflect overall gathering and processing performance for the company. In our pipelines and transportation segment, the third quarter of '22 contribution margin was $54 million, compared to $47.4 million in the third quarter of '21.\n\nThe increase was attributable to strong refinery utilization rates at the Delek U.S. refineries and annual tariff escalations on our pipelines. In our wholesale marketing and terminalling segment, the contribution margin was $18.3 million in the third quarter, compared to $19.6 million in the third quarter of '21. The decrease was primarily driven by higher operating costs resulting in lower margins.\n\nDuring the third quarter of 2022, equity income from our crude oil pipeline JVs was approximately $8.6 million compared to $7.3 million in the prior-year period. This increase was mainly driven by strong volumes at both Caddo and Red River joint ventures. Moving to capital expenditures, we spent approximately $32.2 million in the third quarter of '22, which consisted of $31.3 million of growth spending and $900,000 for sustaining maintenance. The outlook for 2022 includes total gross capital expenditures of $116.9 million, including $110.5 million of growth and $6.4 million of maintenance capital.\n\nThis includes spending associated with the 3 Bear assets. I would point out that the company's growth capital is predominantly focused on expanding the gathering and processing businesses. With that, operator, can you please open the call for questions?\n\nOperator\n\n[Operator instructions] And our first question here will come from Michael Cusimano with Pickering Energy Partners. Please go ahead.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nHey. Good morning, everyone, and congrats on achieving the Permian growth target.\n\nBlake Fernandez -- Senior Vice President, Investor Relations and Market Intelligence\n\nThanks, Mike.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nOn that front, can you update us on the trajectory from here going forward?\n\nTodd O'Malley -- Executive Vice President and Chief Operating Officer\n\nYeah, Michael. This is Todd. At this point, we are not ready to disclose any incremental hard numbers. But suffice it to say that we continue to see active and robust growth in both the pre-existing Delek Permian gathering footprint, as well as in the 3 Bear footprint.\n\nAnd in particular, inside the 3 Bear footprint, we see a strong growth profile across all three business lines, the natural gas, the water, and the oil. So, I think that's kind of where we leave it today.\n\nAvigal Soreq -- President\n\nYes. Just to build on Todd's comment, it's Avigal. I think that in our area, on the DPG, we've seen a very nice increase of rigs, kind of alluded to what we're going to see during 2023. So, we are very optimistic about our acreage and producers.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nGot it. OK. That's very helpful. And then, if I can follow up on the 3 Bear side, we saw, you know, pretty strong quarter-to-quarter sequential volume growth.\n\nI'm wondering if -- are we ahead of schedule on the ramp-up there? Or is that like a decent growth trajectory until you get to your -- I guess like what you underwrote the acquisition on?\n\nBlake Fernandez -- Senior Vice President, Investor Relations and Market Intelligence\n\nHey, Michael. It's Blake. Yeah. We are very encouraged so far.\n\nThe integration has gone really well. As you know, when we kind of put the original acquisition targets out there, they were fairly robust. And at this point, you know, we feel very comfortable that we're on target and in line with our expectations, so we're not changing anything. But the communication is that we're very pleased with the progress so far.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nGreat. That's all for me. Appreciate the help, guys.\n\nBlake Fernandez -- Senior Vice President, Investor Relations and Market Intelligence\n\nThanks, Mike.\n\nTodd O'Malley -- Executive Vice President and Chief Operating Officer\n\nThanks, Michael.\n\nOperator\n\n[Operator instructions] With no further questions, we will conclude our question-and-answer session. I would now like to turn the conference back over to Avigal Soreq for any closing remarks.\n\nAvigal Soreq -- President\n\nI want to thank the management team around the table. I'm very proud of the detailed performance. This is a record quarter. We want to thank the investor that are with us for the long term and most -- and foremost to our employees that are doing days and nights to make this company as good as it is.\n\nThank you so much, and we'll talk again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBlake Fernandez -- Senior Vice President, Investor Relations and Market Intelligence\n\nAvigal Soreq -- President\n\nReuven Spiegel -- Chief Financial Officer\n\nTodd O'Malley -- Executive Vice President and Chief Operating Officer\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nMore DKL analysis\n\nAll earnings call transcripts"
}