{
  "companyName": "Royal Bank of Canada",
  "companyTicker": "RY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/royal-bank-of-canada-ry-q3-2022-earnings-call-tran/",
  "content": "Royal Bank of Canada (RY -1.06%)\nQ3 2022 Earnings Call\nAug 24, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen. Welcome to RBC's conference call for the third quarter 2022 financial results. [Operator instructions] I would now like to turn the meeting over to Asim Imran, head of investor relations. Please go ahead.\n\nAsim Imran -- Head of Investor Relations\n\nThank you, and good morning, everyone. Speaking today will be Dave McKay, president and chief executive officer; Nadine Ahn, chief financial officer; and Graeme Hepworth, chief risk officer. Also joining us today for your questions, Neil McLaughlin, group head, personal and commercial banking; Doug Guzman, group head, wealth management, insurance, and I&TS and Derek Neldner, group head, capital markets. As noted on Slide 1, our comments may contain forward-looking statements, which involve assumptions and have inherent risks and uncertainties.\n\nActual results could differ materially. I would also remind listeners that the bank assesses its performance on a reported and adjusted basis and considers, both to be useful in assessing underlying business performance. To give everyone a chance to ask questions, we ask that you limit your questions and then requeue. With that, I'll turn it over to Dave.\n\nDave McKay -- President and Chief Executive Officer\n\nThank you, Asim, and good morning, everyone. Thank you for joining us today. Today, we reported earnings of $3.6 billion, a solid quarter driven by continued strength in our personal and commercial banking businesses, both Canada and the US, where we benefited from double-digit volume growth and strong tailwinds from rising interest rates. Our market-sensitive businesses reported a challenging set of results against the backdrop of one of the toughest environments for financial markets.\n\nThis was underpinned by increased uncertainty, heightened volatility, lower asset valuations, and widening credit spreads, impacting client sentiment and activity. Expense growth was relatively flat from last year as a built-in hedge of lower variable compensation offset higher spend as we continued to invest in the client experience. Our results also included a prudent reserve build given the range of potential macroeconomic outcomes, including the likelihood of a recession across North America. While we closely monitor early warning indicators, both gross impaired loans and PCL on impaired loans remain low as our clients continue to demonstrate resilience despite rising costs.\n\nI will now offer my thoughts on the operating environment to provide context for our results this quarter. The macro environment remains uncertain, characterized by a number of challenges, headlined by persistently high inflation. Supply chain constraints are being exacerbated by rising geopolitical tension, COVID-related tail risk in Asia, tight labor markets, and, more recently, droughts related to climate change. While inflationary pressures appear to be peaking, we expect aggressive monetary policy to continue as central banks try to rein in demand-driven inflation by raising borrowing costs.\n\nThis pushes us even closer toward the end of an economic cycle. These factors alone are not likely to drive a severe downturn. That would also require higher unemployment. And we believe the current strong job market is a differentiating factor relative to the beginning of prior downturns.\n\nAlthough there is high leverage in the system, our clients are entering this cycle with stronger liquidity than in prior ones, including healthy corporate balance sheets and increased personal savings across FICO bands in Canada. Consumer spending also remains robust. Despite the complicated macroeconomic backdrop, we are operating from a position of strength across our capital, liquidity, and allowance coverage ratios. I am confident our competitive advantages will drive premium growth going forward.\n\nOur premium return on equity was a source of strong internal capital generation and double-digit growth in book value per share. Our priorities in deploying our capital have not changed. We remain focused on building on our momentum and driving accretive organic growth, which I will speak to a little later. As part of our commitment to delivering long-term value for our shareholders, we bought back over 10 million shares while paying 1.8 billion of dividends this quarter.\n\nWe remain well-positioned to execute on key strategic priorities via acquisitions should they meet our strategic and financial requirements. And we are looking forward to working with our new colleagues following the anticipated close of Brewin Dolphin acquisition later this year. Finally, we are comfortable with operating at a higher capital ratio at this point in the cycle. We believe this is the prudent thing to do given the uncertain environment.\n\nOur liquidity coverage ratio provides a $66 billion buffer over the regulatory minimum, and we expect to continue to fund the majority of our organic loan growth in our personal and commercial banking businesses through our large client deposit base. I will now speak to trends we are seeing across our largest segments, including the benefit from higher rates. In Canadian banking, we saw double-digit year-over-year growth across mortgages, commercial lending and credit cards, with deposits up 9%. Higher interest rates provided a $225 million benefit to year-over-year revenue growth partly due to the strength of our core deposit franchise.\n\nOur strong market share in this key product provides us with a strategic advantage to deepen our client relationships and builds a strong base to profitably grow our loan book. We feel good about the stickiness of these deposits given our client value proposition led by our market-leading RBC Vantage offering. Average retail deposit balances are approximately 30% higher than pre-pandemic levels and remain stable across all risk tiers with the exception of our Super Prime Group, which have moved cash into higher yielding offerings. The dynamics of our mortgage business were also strong this quarter with acquisition volume still higher than pre-pandemic levels.\n\nAnd we expect mortgage growth to slow over the coming quarters given the decline in housing activity and prices and a return to a more balanced sales-to-listing ratio. Notwithstanding macro factors, mortgage profitability should be supported by deepening client relationships around this anchor product and a variable mortgage specialist cost base. Commercial loan growth was broad-based this quarter, including in manufacturing, logistics and business services, along with a recovery in auto for financing. While commercial clients remain concerned about labor shortages and the cost of capital, we are seeing confidence start to tick higher, with revolver utilization rates also starting to recover.\n\nGrowth in credit card balances continue to be underpinned by transactors as our clients continued their discretionary spend at a healthy pace, with total spending 30% above pre-pandemic levels. We have also started to see solid growth in revolver balances in recent quarters. And over time, we expect upside growth from card revolver rates and commercial utilization rates recovering toward pre-pandemic levels. As the largest bank in Canada, we often ask ourselves, how does a market leader grow? And we believe the most profitable avenue of growth is to organically add new clients by providing differentiated value propositions through our leading distribution channels, including our growing sales force.\n\nThis quarter, we are adding to our growth engine by further expanding the client acquisition funnel. With immigration levels expected to rise to record levels, we have announced a collaboration agreement with ICICI Bank Canada, which attracts a substantial proportion of newcomer population from South Asia into Canada. As part of our agreement, ICICI Bank Canada will refer all newcomer clients to RBC over time, making it easier for them to open a bank account upon arrival. With this partnership, we will offer longer-term value to these clients by deepening our relationships through our leading mortgage investments and credit card businesses.\n\nAdditionally, we will soon launch Avion Rewards. This is the next generation of value proposition for our proprietary loyalty program, reimagining it as an end-to-end commerce experience to drive further client engagement. Avion Rewards will deliver everything Canadians have grown to appreciate about our market-leading program with a new shopping companion called Avion Shop Plus, seamlessly integrating offers, product searches, price alerts, and the ability to pay with points. We have an exciting pipeline of innovations that will continue to attract new clients and consolidate relationships.\n\nTurning to wealth management, the diversity of our portfolio and the quality of our advice continue to be strength in these volatile markets. This quarter highlighted the balance across our various businesses within our wealth management segment. Tailwinds from higher interest rates in our U.S. and Canadian businesses more than offset the impact of lower markets on fee-based revenue streams.\n\nDespite market volatility, Canadian wealth management also benefited from net new assets in the quarter, as well as over the last 12 months. This speaks to the holistic nature of our wealth management solutions and the strength of our client advisory relationships. Earlier this quarter, RBC Dominion Securities ranked highest among Canadian bank-owned investment brokerage firms for the 16th year in a row according to the Investment Executive Brokerage Report Card. Moving to RBC global asset management, where assets under management have a more balanced mix of equities and fixed income relative to a more traditional 60-40 allocation, the decline in AUM was largely driven by the somewhat unusual occurrence of North American equities and bond valuation selling off at the same time, largely driven by rising interest rates.\n\nHowever, Canadian long-term retail net sales remained positive over the last 12 months as our clients continue to look to us for actively managed investment strategies. In the U.S., we reported strong revenue growth and earnings growth driven by margin expansion and diversified loan growth at City National. We are effectively leveraging our multiyear investments in this business, including technology, infrastructure, treasury management, and sales capacity, including commercial and private bankers. Our strategy is further supported by the availability of lower cost sweep deposit balances from U.S.\n\nwealth management. The results of our capital markets platform this quarter do not reflect the strength of this premium franchise nor the potential of its performance going forward. Results were impacted by an industrywide decline in fee pools, along with a disruption in high-yield and broader credit markets. While leverage finance remains a strategically important business, supporting our strategy of deepening client relationships, our market share has remained steady at 3% to 4%.\n\nIt continues to be a higher ROE product, where we have generated positive revenue net of marks in every fiscal year since we entered this business over 10 years ago. More broadly, we continue to strategically invest in our capital markets business. This includes adding senior coverage teams in key verticals with a particular focus on advisory and equity origination businesses, where we have gained market share year to date. Although the environment saw muted activity, client dialogue remains robust, underpinned by upcoming financing needs and secular trends around energy transition, technology disruption, and reshoring.\n\nOur backlog remains healthy, though conversion of this pipeline maybe extended as clients remain cautious as valuations reset. Despite difficult financial conditions, we remain committed to supporting our clients and managing their risk and meeting their financing needs. In closing, we have entered this period of uncertainty with momentum and from a position of strength, underpinned by our strong capital, liquidity, and allowance coverage ratios. Our leading client franchises are operating prudently and efficiently at scale.\n\nAnd we are well-positioned to take market share through the next point in the cycle. We remain committed to delivering more value to our clients and to creating long-term value for our shareholders. Let me now turn the call over to Nadine for more details about our quarter. Nadine, over to you.\n\nNadine Ahn -- Chief Financial Officer\n\nThanks, Dave, and good morning, everyone. I will start on Slide 9. We reported earnings per share of $2.51 this quarter, down 15% from last year. Our diversified business model and balance sheet remained resilient amid an unfavorable macroeconomic backdrop in which we increased the provisions for credit losses on performing loans.\n\nIn addition, challenging conditions across financial markets had a significant impact on our results this quarter, with revenue down 5%, including the recognition of loan underwriting markdowns in capital markets. Adjusting for these markdowns, revenue net of PBCAE was up 2% from last year, underpinned by strong volume growth and broad-based benefits from higher interest rates. Expenses were relatively flat year over year as lower variable compensation was offset by higher salaries and noncompensation cost as we continue to invest in our people and technology to create more value for our clients. Before focusing on the drivers of our earnings, I will talk about our robust capital levels on Slide 10.\n\nOur CET1 ratio remains strong at 13.1%, down 10 basis points from last quarter. Earnings this quarter generated 30 basis points of capital, net of $1.8 billion of dividends, to our common shareholders. Our capital return strategy has driven a total payout ratio of over 80% year to date, including dividend increases and the continued execution of our previously announced normal course issuer bid. RWA was up from last quarter largely due to strong loan growth across Canadian banking, capital markets, and City National as we continue to support our clients' financing needs.\n\nThis was offset by a reduction in loan underwriting commitments and a decline in market risk RWA and capital markets as the impact of the significant volatility in Q2 2020 is no longer being reflected in our historical VAR period. We would expect our CET1 ratio to be around 12.5% next quarter following the anticipated close of the Brewin Dolphin acquisition and the continuation of share buybacks. Our strong ratios provide us with flexibility in our capital deployments, leading with supporting client-driven growth. Moving to Slide 11, net interest income was up a very strong 17% year over year or an even higher 19% excluding trading results.\n\nThe year-over-year benefit from higher interest rates and volume growth was broad-based across segments. Canadian banking net interest income was up 14%, underpinned by double-digit volume growth and margin expansion. Canadian banking NIM was up 15 basis points from last quarter, primarily due to higher spreads across our low-beta core checking platform and GIC portfolio, which is seeing inflows as clients shift into higher-yielding deposit products. Going forward, announced rate hikes are expected to provide incrementally higher revenue in the second year and the benefit from future rate hikes will accumulate further.\n\nThis, in turn, is expected to drive continued NIM expansion. As interest rates increase, deposit mix and growth will matter even more. And we believe we are well-positioned given our large base of low beta core retail checking accounts. We also expect to continue to gain market share in this key product through the widening of our client acquisition funnel and our deep client value proposition.\n\nWealth Management net interest income increased 41% from last year due to strong volume growth and higher net interest margins at City National combined with higher deposit margins in Canadian wealth management. Furthermore, higher interest rates drove increased revenue from U.S. wealth management suite deposits. City National's asset-sensitive NIM was up 31 basis points from last quarter due to higher yields on its largely floating rate commercial loan portfolio, combined with the shift in asset mix.\n\nThe increase in City National's NIM this quarter does not fully reflect the benefit from July's 75 basis point increase in the Fed funds' rate. Rising interest rates also drove higher client deposit revenue in investor and treasury services. Turning to expenses on Slide 12, noninterest expenses were relatively flat from last year, with variable compensation down 19%, commensurate with the decline in market-related revenue. In contrast, expenses, excluding variable and share-based compensation, were up 8%.\n\nThe largest increase of these controllable costs was higher salaries, which were up 8% relative to last year. As Dave noted, we continue to strategically invest in sales capacity across our largest businesses. Marketing costs continue to normalize from low levels as we expand our client acquisition efforts by highlighting our growing value proposition to our existing and prospective clients. We have also seen an upward trend in revenue-related business development costs such as travel, as we look to meet the complex needs of our clients across our businesses.\n\nU.S. wealth management expenses were up 10% year-over-year in U.S. dollars, including investments to improve the operational infrastructure supporting City National's expansion over the past six years. Next quarter, we expect year-over-year expense growth across the enterprise, excluding variable and share-based compensation, to be lower, partly due to the legal provision taken in the fourth quarter of last year.\n\nHowever, given salary inflation and strategic investments to grow the business, our full year 2022 growth in controllable expenses will likely come in slightly higher than our prior guidance. Moving to our segment performance beginning on Slide 13. Personal and commercial banking reported earnings of $2 billion this quarter. Canadian banking pre-provision pre-tax earnings were up 15% year-over-year, well above strong revenue growth of 11%.\n\nNoninterest income was up 6% from last year largely due to increased client activity driving higher banking-related fees, including higher service charges. A significant rebound in travel bookings from pandemic lows resulted in higher foreign exchange revenue along with credit card purchase volumes. Higher card service revenue was partially offset by an uptick in travel-related reward costs. Operating leverage was a strong 4.5% this quarter.\n\nWe expect it to be even higher next quarter as the benefits from wider spreads will more than offset growth-related investments. We anticipate the full year operating leverage to be well above our historical 1% to 2% range, driving our full year efficiency ratio toward 40% for this fiscal year. Turning to Slide 14. Wealth management reported earnings of $777 million.\n\nRevenues were up 8% year over year, supported by the strong growth in net interest income discussed earlier. In contrast, noninterest revenue was relatively flat. Global asset management revenue decreased primarily due to mark-to-market seed capital losses and lower fee-based client assets largely due to unfavorable market conditions. Canadian long-term retail net redemptions were $4 billion this quarter at RBC GAM, mainly in balance and fixed income mandates.\n\nRBC captured a good part of the shift as clients move to GICs during a period of elevated market uncertainty. The risk-off sentiment also subdued client activity driving lower transactional revenue this quarter. Turning to insurance on Slide 15. Net income of 186 million decreased 21% from last year, primarily due to the impact of new longevity reinsurance contracts in the prior year.\n\nThe magnitude of these contracts can be volatile quarter to quarter. Turning to I&TS on Slide 16. Net income of 164 million increased 76 million from a year ago primarily due to higher client deposit revenue and higher funding and liquidity revenue largely from increased market opportunities. Turning to Slide 17.\n\nCapital markets reported earnings of $479 million. Pre-provision pre-tax earnings were down 52% from last year's strong results. During the quarter, widening credit spreads as well as weakening primary markets in July resulted in the recognition of $385 million of loan underwriting markdowns in an uncertain environment. Approximately 75% of the marks are unrealized and do not yet include the benefit of fees, which are recognized upon close of the transaction.\n\nExcluding these marks, Investment Banking revenue was down 49% from last year, relatively in line with the decline in global fee pools. The uncertain backdrop impacted client activity in M&A advisory, while higher interest rates and market volatility kept issuers on the sidelines, impacting our origination businesses. Lower trading revenue was primarily driven by the impact of widening credit spreads on credit trading, which is a larger part of our global markets business. In contrast, our macro businesses performed relatively well given volatility in rates and FX markets.\n\nEquities revenue was solid, albeit impacted by softer origination activities. To conclude, we will continue to deploy our strong balance sheet to drive client-driven growth and deliver sustainable value to our shareholders. We remain well-positioned to benefit from further increases in interest rates, which, along with our focus on expense control, should drive positive operating leverage going forward. With that, I will turn it over to Graeme.\n\nGraeme Hepworth -- Chief Risk Officer\n\nThank you, Nadine, and good morning, everyone. Starting on Slide 19, our gross impaired loans ratio of 25 basis points was down 2 basis points this quarter, reflecting a modest reduction in gross impaired loan balances and continued portfolio growth. New formations of 458 million increased 15% quarter over quarter, but remain low at less than two-thirds of pre-pandemic levels. The increase in new formations this quarter was primarily in the wholesale loan portfolio and largely attributable to a new impaired loan in the real estate and related sector.\n\nTurning to Slide 20, PCL on impaired loans of 170 million was down 4 million or 1 basis point this quarter. The reduction in PCL was driven by capital markets, where we had a $13 million net reversal of provisions this quarter, primarily on loans in the oil and gas and utility sectors. In Canadian banking, PCL was up 34 million from last quarter, with modest increases in both the retail and commercial portfolios, consistent with expectations that we are trending back to more normal levels of impairments and PCL. For context, though, the 180 million of PCL in Canadian banking this quarter still remains well below the 2019 quarterly average of 330 million.\n\nMoving to Slide 21, we provide some further context on our allowances. During the quarter, the economy continued to operate near full capacity, driving unemployment rates down to record low levels. This environment has helped sustain the low levels of gross impaired loans and PCL on impaired loans I just highlighted. With the exceptionally strong economic conditions have exacerbated inflationary pressures prompting Central Banks to take action with substantial interest rate increases during recessionary concerns and increasing uncertainty around the macroeconomic outlook.\n\nTo account for this growing uncertainty, we have prudently increased our provisions on performing loans by $177 million this quarter, which drove a $124 million increase in our allowance for credit losses on loans from 3.9 billion to 4 billion. Last quarter, we increased both the severity and likelihood of the downside scenarios used to determine our provisions. This quarter, the increase in reserves primarily reflects a weaker base case credit outlook and macroeconomic forecast. For example, we now assume the Canadian and U.S.\n\neconomies will face a moderate recession in 2023, and Canadian house prices will on average decline over 12% from their peak. Additionally, business growth, particularly in our cards and commercial portfolios, as well as a shift in our portfolio composition, contributed in part to the increased allowances this quarter. In the context of a rising interest rate environment, I did want to spend some time discussing a couple of portfolios being impacted starting with the Canadian banking and residential mortgage portfolio on Slide 22. As I highlighted last quarter, while variable rate mortgages accounted for a growing volume of our acquisitions through 2021 and 2022, fixed rate mortgages still account for more than 65% of our portfolio.\n\nIn addition, most variable rate mortgages at RBC will not see an increase in payment until they renew. We'll experience a relatively modest increase if rates continue to rise. Thus, the impact of higher interest rates is primarily realized at renewal. Overall, our mortgage portfolio and our mortgage client base are exceptionally strong.\n\nOur Canadian banking uninsured mortgage portfolio has a current loan-to-value of 46% with only $17.9 billion of mortgages with a loan-to-value greater than 75%. Our mortgage clients have an average FICO score of 801. And our internal payments analysis indicates that a majority of our clients will be able to absorb these anticipated payment increases. In addition to those core strengths, our borrowers will also benefit from the flexibility that comes with the time they have before their mortgage comes up for renewal and their payment increases.\n\nAs highlighted on slides -- on the slide, only 17% of mortgage balances come up for renewal by the end of 2023. Additionally, the vast majority of our mortgages that are the highest loan-to-value and have the lowest interest rates, those that were generally in originated in 2021 and early 2022 don't renew until 2025 or beyond. This puts our clients in a strong position to deal with rising rates and declining home prices we have experienced to date and expect going forward. We will have time to adjust behavior and benefit from wage and income inflation to moderate the impact of higher payments.\n\nWhile the risks associated with our mortgage portfolio are increasing, our rating standards have been designed to ensure resilience through an economic cycle. Turning to Slide 23. I'll now discuss our capital markets leverage finance business, which tells that leveraged loans and high-yield bonds has also been impacted by the rising rate environment. We continue to purely manage both credit and market risk for this business.\n\nIn our leverage lending portfolio, our exposure represents only 1.2% of our total outstanding loan portfolio, down from 1.5% in 2019. At origination, our leverage loans benefit from the security and a first-lien position on our borrowers' capital structure. Additionally, the portfolio is very well-diversified by sector and by borrower with no sector accounting for more than 17% and an average outstanding exposure per borrower of approximately $20 million. In our underwriting portfolio, exposure is managed within a consistent risk appetite, supported by well-established limits.\n\nMarket risk is managed through a deal-specific structure and pricing protections, timing syndication, and portfolio hedging. And while we incurred realized and unrealized losses in the underwriting portfolio this quarter, which Nadine noted earlier, was are consistent with the risk framework and within the risk appetite we've established for this business. Overall, this business has a track record of generating strong financial performance through market cycles. To conclude, we continue to be pleased with the ongoing performance of our portfolios, the strong economic recovery from COVID-19 allowed us to sustain our exceptional credit performance for longer than we originally anticipated.\n\nThat said, leading indicators like credit card delinquency rates have started to increase toward pre-pandemic levels and point toward the normalization of PCL on impaired loans through 2023. The timing and magnitude of increased credit costs will ultimately depend on Central Bank's success in improving inflation, while creating a soft landing for the economy. We continue to proactively manage risk to the growing economic uncertainty. As I noted last quarter, we stress test our portfolios for inflation and interest rate risk and believe we are well-capitalized [Inaudible] yet even more severe macroeconomic outcomes.\n\nAnd with that, operator, let's open the lines for Q&A.\n\nOperator\n\n[Operator instructions] Our first question is from Ebrahim Poonawala with Bank of America. Please go ahead.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning. I guess just a big picture question, Dave, going back to some of the comments you made on the call earlier. Macro environment remains uncertain, I think you mentioned be closer to the end of the economic cycle. But at the same time, it sounds like underlying business momentum, consumer commercial remains solid.\n\nJust give us a perspective in terms of your downside scenario and how quickly things could get materially worse than where things are today, and what that means in terms of just implications of a deceleration in growth trends and the stress that we should expect in terms of credit quality for oil. Thank you.\n\nDave McKay -- President and Chief Executive Officer\n\nMaybe I'll turn it to Graeme, the second part of that, as we stress our portfolios against a number of different scenarios. Thank you, Ebrahim, for the question. And I think the, you know, operating word is uncertainty. And from the investment community to the CEO community to the government, all stakeholders in our economy are struggling to read all of these forces at play at once right now.\n\nAnd I think the uncertainty is the operating word. And agility and stability are important constructs. And I think as we deal with that uncertainty, we're dealing with a very, very strong CET1 ratio, with strong provisioning, with strong funding capability and therefore, you know, that strength gives us enormous flexibility to deal with the uncertainty. I can't honestly sit here and predict how things are going to play out.\n\nNo one can. Markets can't. That's why markets are volatile right now. This is new territory that we're trading in.\n\nThe aggressive monetary tightening and quick tightening, they have to drive demand down. That's the only way we're going to get control of inflation. And therefore, to my comments, you expect to continue to see aggressive monetary tightening until we bring inflation back closer to the targeted inflation ranges, maybe slightly above. And that's why we're calling for -- in a number of areas, including RBC economics calling for rates to rise above potentially the net neutral rate in the short-term.\n\nSo, aggressive demand, you have seen that affect mortgages and the asset class already in North America and other markets. We see a slowing down of demand and resell activity. In markets, you're seeing a little bit of a slowing that's masked by inflation, but you're seeing a little bit of a slowing quarter over quarter in some of the year-over-year card purchase activity levels. Now, inflation keeps driving that into double-digit levels.\n\nIt remains above pre-pandemic levels, and some of that recovery will be muted. So, you're starting to see the impacts of demand suppression from monetary tightening, and we're going to watch that closely. But we still have significant, I think, cushions to that. The strong balance sheets of our corporates, which have produced very low delinquency in impairment rates as we go through this.\n\nSo, the significant cash flow. And what's different between Canada and the U.S. is that the surplus cash in the U.S. is concentrated in the top quintile or top two quintiles.\n\nIn Canada, you know, all the measurement and analysis we do, it's much more evenly spread because how Canadian governments distributed, serve and other payments across 2020 to 2021 and how long it went. We see much broader-based savings across the FICO bands as we talk about across the quintiles in Canada, which again provide a shock-absorber to inflation and provide a shock-absorber to any potential job loss that comes at us from higher demand. You are starting to see, you know, technology sector creeping into other sectors lay off employees, you read it every second day in the paper. So, you're starting to see more and more signals of an end-of-cycle approach that begs prudence which is why we took an incremental provision this quarter on performing loans.\n\nDespite our impaired loans decreasing despite having very strong Stage 3, we thought it prudent along with our very strong capital levels, to take incremental. So, it's all part of trying to balance the uncertainty, Ebrahim. We continue to look for opportunities for quality growth but to play cautious with our balance sheet and be able to absorb any uncertainty of a more rapid economic end of cycle to your point. So, hopefully, that helps.\n\nIt is playing off uncertainty. And I think what you get in the ROI balance sheet and provisioning and franchise is the ability to absorb all those outcomes.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nSo, that's helpful. And just one quick follow-up if I may. Do you -- like the market is really concerned about is the elevated level of rates and what that means for mortgage repricing, even at renewal. So, if rates remain where they are for an extended period of time, how worried are you about just the health of the consumer today versus at any point in the last decade? Thank you.\n\nDave McKay -- President and Chief Executive Officer\n\nThat's an important question, and maybe I'll go to Neil because we have done a lot of analysis and have a lot of data on that.\n\nNeil McLaughlin -- Group Head, Personal and Commercial Banking\n\nYes. Thanks, Dave. I'll start and then if Graeme wants to add anything. So, Ebrahim, thanks for the question.\n\nWe've spent a lot of time kind of breaking down, particularly the mortgage book, just to look at the topic of renewal risk. And looking at particularly mortgage customers, what's the rate -- the contract rate they have now? When does it come up for renewal? And what would the expected delta to be given our view on where rates will be when that renewal comes up? A couple of things that, you know, obviously are sort of our first look at the risk is taking down the insured versus uninsured portion of the book. And then we've -- Graeme had made a mention of a proprietary internal view on capacity. As we've done a lot of modeling around looking at our customers' cash flows that, you know, touch on where Dave started with the strong deposit franchise, there's also a value in that data where we can see their capacity, their ability to absorb that -- those incremental interest costs.\n\nWhen we break that down, and we overlay those factors. Really, the next couple of years to Graeme's point -- Graeme made in the speech is we don't see much risk at all, very, very small pockets of concern for the remainder of this year, throughout next year. And really, the segment we get into is the -- what Graeme had mentioned is the customers who had the lowest -- the lowest rates and the highest home prices and that leaves the last part, which is looking at our currently calculated LTV as the last piece we overlay. And when we bring that all together, we really sort of landed on this spot, which is we'll continue to monitor it, but we don't see much risk in the mortgage book at all until we get out to that '25 and '26 cohorts and when they renew.\n\nAnd then at that point, they'll have, you know, wage inflation and should have more capacity, and we'll continue to work with those clients. So, that would be the view on the mortgage book. When we look at other consumer credit, we're still in a position where we see high liquidity and in consumer accounts growth is slowing. As you look at things like the checking account, we've seen a lot of liquidity pushed into our GIC book.\n\nWe've had about over $10 billion have been pushed into the GIC book. So, that's cash on the sidelines that provides additional cushion for those customers. And we're starting from a very low point of delinquencies and credit losses to Graeme's point. So, we're starting from a good point.\n\nWe do a lot of work to look at the stresses, but we have playbooks that we will enact that if we get into a downturn to manage the credit profile. But maybe I'll end it there and pass to Graeme.\n\nGraeme Hepworth -- Chief Risk Officer\n\nI don't have to elaborate. I think Dave and Neil captured a lot of the really critical points here, which is, you know, there's a lot of uncertainty going forward. That's really what we're reserving against right now. We -- you know, because the flip side of that is the starter spot, the portfolio, the current macro backdrop is a very, very healthy and strong one.\n\nAnd that's why you see the strong performance in current Stage 3 loan losses. So, you know, we are going into a more recession here and more uncertain environment from a really strong and healthy starting point. But we're taking kind of a prudent approach here to flag that we do look at a lot of different scenarios and there is a lot of uncertainty everyone, as you know, how this could play out over the next three, four, five years. And so, we try and consider that range of uncertainty through all of our scenarios.\n\nIt's not one single downside we look at and we bring that into play, and that's why we established the reserves we do and how we assess the capital adequacy that we have. So, again, a really strong portfolio and a really strong starting point, but a lot of uncertainty ahead of us. And that's really what we're trying to balance here.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nThank you. Our next question is from Meny Grauman with Scotiabank. Please go ahead.\n\nMeny Grauman -- Scotiabank -- Analyst\n\nHi, good morning. Dave, you referenced uncertainty a lot in your opening remarks. I am just wondering how that plays out in terms of your outlook on capital deployment? Specifically, any changes to your thinking on capital deployment, given sort of the outlook that you outlined or the uncertain outlook that you outlined? And then maybe even more interesting, just in terms of risk appetite, any changes there and sort of any levers that you're pulling given your outlook and the impact on the business?\n\nDave McKay -- President and Chief Executive Officer\n\nYeah, I think, first, from a risk appetite and strategy perspective, as we've talked about, consistency is important. We're consistent through a cycle. And you can never time cycle, as you know, including this one. Therefore, we are very disciplined in our risk appetite, and we'll let market share grow when we think it's being underpriced significantly or it starts to fall out.\n\nYou can expect that with inflation, with challenges to consumers, with potential job loss coming at us, that more and more customers will fall out of that risk appetite. So, I think the key message that we continue to say, we went through a cycle. We've managed customers through a cycle. We don't, you know, run and hard at it and then retreat from it.\n\nThat's not how you want to treat long-term customer franchise. Therefore, we try to be consistent through that cycle. To your point on capital, we -- between our global operations with its capital markets, the retail bank, as you saw a very strong growth, our U.S. wealth operations, strong organic growth opportunity will be funded by capital as you saw the RWA growth from doing that.\n\nWe're seeing strong client demand, particularly in our corporate loan book, given some of the lack of liquidity that we're seeing in markets. Therefore, we will continue to serve those clients. We have a very strong client book within our risk appetite. You have seen us continue to execute and returning capital to shareholders with 80-plus percent payout ratio.\n\nWe have the capital flexibility to continue to have a steady stream of buybacks, generating very strong total shareholder returns for our shareholders. Therefore, I think given the uncertainty, continuing to apply that prudent playbook and that growth playbook should give you confidence that you'll see a lot more of the same. We always remain on the lookout for strategic opportunities. We don't shy away from them.\n\nWe pursued and came to an agreement with Brewin Dolphin. We're very excited about the opportunities in front of us and executing that playbook. So, we are always having dialogues. It just does it ever -- will it lead to something that's within our risk appetite and within our price and return to shareholders' appetite? You have to look through cycles as we did with Brewin Dolphin.\n\nWhen we made the offer for Brewin Dolphin, we knew -- we saw the war in Ukraine coming or the conflict in the Ukraine. We knew it with suppressed demand. We knew there was going to be challenges, but we're taking a long-term view on these acquisitions. And therefore, we think through our business model, over time, not just in the immediacy of what's going on in the macro world.\n\nSo, hopefully, that context helps organic growth, return of capital to shareholders, prudent allocation, particularly at this point in the cycle, and generally a flexible, cautious approach, but using our balance sheet strength to take opportunity when you see kind of price revisions and opportunity revisions in front of us.\n\nMeny Grauman -- Scotiabank -- Analyst\n\nThat's very clear. And just to clarify, so no change in your outlook, on buyback in particular, is that correct?\n\nDave McKay -- President and Chief Executive Officer\n\nNo. None.\n\nMeny Grauman -- Scotiabank -- Analyst\n\nThanks.\n\nOperator\n\nThank you. Our next question is from Gabriel Dechaine with National Bank Financial. Please go ahead.\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nHi, good morning. Just a quick one on the formations and wholesale, was that tied to the leverage loan book at all, the real estate loan?\n\nGraeme Hepworth -- Chief Risk Officer\n\nNo, no, it wasn't. Leverage loans -- real estate is not a big part of the leverage as [Inaudible] speaking. That was just sort of the real estate division.\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nOK. My bigger picture question, great margin expansion this quarter. Could we see a similar increase in Q4? And then you also talk about the importance of your deposit franchise, which is totally understandable. You've got a very large one.\n\nI'm just wondering about the deposit substitution effect. You talked about customers switching or putting 10 billion into GICs. Are you starting to -- you know, is that something a trend that could accelerate where, you know, you have customers moving out of zero cost deposits into the term product and that might eat into your margin upside over the next year or so? Maybe you can help clarify that. Thanks.\n\nNadine Ahn -- Chief Financial Officer\n\nSure, Gabe. Thanks. I'll start and maybe turn it over to Neil, just in terms of some of the deposit dynamics. So, in terms of the margin expansion, if I break it down between what we're seeing in Canada, we're looking to see similar types of NIM expansion going through the next couple of quarters, not directly, but that 10 to 15 basis points over the next couple of quarters.\n\nAnd that is driven off of the rate environment picking up. As we mentioned, the deposit value that we bring on our low-cost, low-beta deposits. And that comes from two perspectives. So, one, there's a bit of an immediate rate sensitivity on a portion of the deposits that you consider invested short.\n\nBut then there's also the larger portion of the deposits that are invested in longer-term rates. So, those have a continued sustained benefit as rates have been rising. And so, we do expect that accretion to come through into Q4. As I mentioned, the July rate hike was not fully baked in.\n\nSo, we'll continue to see that pull through in the margin expansion. And if you look at it from the U.S., on the City National side, in particular, which is primarily sensitive into the short end of the curve, given the large proportion of 50% of our floating rate assets on that side of the balance sheet, we expect, again, similarly to the Fed fund increase coming through the end of July to continue to sustain that margin expansion into the fourth quarter as well. From the deposit franchise standpoint, we do have a benefit of that low-beta, low-cost deposit and primarily off of the checking account. So, there is opportunity, I would say, as clients have migrated in from their savings products.\n\nBut most importantly, we've seen some of that capture back on the wealth management side as clients have divested out of from the market standpoint, given concerns around what's happening in the markets and moved into the GIC product. And actually, from our standpoint, as it relates to that product, we have -- that is still forming a low-cost lending for us. and we've generated some of our NIM expansion off of that this quarter. Maybe I'll turn it over to Neil, what they're seeing from their deposit side.\n\nNeil McLaughlin -- Group Head, Personal and Commercial Banking\n\nYes. Thanks, Nadine. Yes, we've seen -- we still have year-over-year growth with slowing growth within the core checking account in the Canadian retail business. But definitely, in terms of the sort of risk off as they stand to the mass retail investor between rates and then the market uncertainty, they are looking for a, you know, guaranteed preservation of capital and are looking for now have an incentive in terms of the GIC product to move and get some return.\n\nSo, we have seen some of that excess liquidity move into the GIC product. We would characterize the still healthy increases in terms of that core checking account as a source of liquidity. But the other source has been a swap out from our retail mutual fund business into GIC. And so, we're still out there capturing those funds from clients.\n\nA lot of them just parking it now to wait out the uncertainty, and then we'll have our financial planners and investment retirement planners work with those clients to get them back into the mutual fund product. It's a very sticky product. I think one of the benefits right now, as Nadine mentioned, that we are actually seeing some strong spreads in the GIC product that have made that swap feel OK.\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nBut just to reiterate, we could see similar margin expansion in the next couple of quarters. And then as far as the substitution effect, that's more in the wealth business, either new money or out of the markets into GICs, but that's still reducing your funding cost overall.\n\nNadine Ahn -- Chief Financial Officer\n\nYeah. I would say for Canada, in particular, the margin expansion higher in Q4, and then it will start to taper off a bit --\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nRight.\n\nNadine Ahn -- Chief Financial Officer\n\nAs the rate expectation growth has tempered off. But similar in Q4 for what we saw for City National this quarter.\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nAll right. Thanks, Nadine and Neil.\n\nOperator\n\nThank you. Our next question is from Mario Mendonca with TD Securities. Please go ahead.\n\nMario Mendonca -- TD Securities -- Analyst\n\nGood morning. If we could go back to the leverage loans for a little bit, the -- I appreciate that the portfolio of $9.6 billion, you know, the risk is credit risk and not market risk. But could you give us an outlook on -- or some history. Like, how long has this portfolio been around for Royal? And what sort of credit losses have you seen both positive and like maybe average and highs and lows? Like can you help us size what the credit risk really is on that book?\n\nGraeme Hepworth -- Chief Risk Officer\n\nYeah, I will start, and Derek can chip in afterwards. I mean I think we tried to provide some context on that portfolio overall at that size that what the portfolio does grow over time, it hasn't been growing as fast as kind of the rest of the loan portfolio. And so, we have taken a prudent approach to that appreciating it is a higher-risk portfolio. I think the other thing we really want to draw people's attention to that, you know, aside from the inherent benefits we get from seniority and security, the portfolio is very diversified with, you know, relatively granular portfolio with, you know, $20 million holds.\n\nAnd so there is -- it does contribute to our overall PCL profile over time. But I wouldn't say by no means the dominant portion of our PCL profile at all, right? So, it's -- I mean you can look at the capital markets performance over the last five quarters, we were in a net recovery position, you know, in this environment inherently, it's -- and that's part of that, right. So, it's not inherently, you know, adding or creating a very differentiated PCL outcome despite it being a high-risk portfolio. So, you know, again, I think we are quite comfortable with the credit risk there, and we have been very consistent in our approach on it.\n\nAnd it's really been the market risk side that creates the bigger volatility for us, in particularly in environments like this. But maybe I will turn it over to Derek and he can give a bit more context on the dynamics of that business.\n\nDerek Neldner -- Group Head, Capital Markets\n\nSure. Thanks, Graeme. And, Mario, I appreciate the question. I think on the lending portfolio, where we are holding that and that's credit risk, I think Graeme has covered off that well that we watch that very closely.\n\nWe really are disciplined in managing two small holes. And that leads to a very broad and diversified group of borrowers. Importantly as well, often the leveraged lending portfolio is really thought of as sponsor driven. But as you can see on the slide in the IR materials, about 45% of that is actually corporate borrowers that are just lower rated.\n\nAnd I would say, over time, to Dave's comment, we have been in this business for over a decade. We have got, I think a long history. We have been very disciplined at how we managed it. And I think that has proven out very well over the cycle.\n\nAnd importantly, on some of the sponsor-related names that we are lending to, we do establish very good track records of how sponsors are dealing with their portfolio companies in times of stress test. And that obviously gives us an ability to work with some of our sponsor clients and their portfolio of companies when you do run into any periods of challenge. And we obviously saw that a few years ago as we went through COVID. And what we did see some PCL rise in that book, it was quite manageable and consistent with history and our risk appetite.\n\nAs Graeme has mentioned, obviously, the area of risk that we are watching more closely in this kind of period of market dislocation is the market risk on the underwriting book. Again, we have taken some marks on that position that we think is prudent, given the market environment we are in. But as Nadine mentioned, 75% of that is unrealized at this point in time. Again, I think we have been very consistent at how we manage that risk over a cycle.\n\nOver the last decade, it's been a very successful and strategically important business for us that has been a positive contributor to revenue each and every year. And it is important in terms of driving out their ancillary business, whether that would be M&A, refinancings, and debt markets or IPO and ECM activity. So, we believe it's been well managed. Unfortunately, you will run into periods of dislocation like this where we will have some marks, but we will manage through that prudently.\n\nAnd I believe it continues to be a very important business for us over the long term.\n\nMario Mendonca -- TD Securities -- Analyst\n\nCan you size that business? Or -- like, I could see in the presentation, you are not giving us the size. Is that something you can disclose?\n\nDerek Neldner -- Group Head, Capital Markets\n\nWe haven't disclosed what our underwriting position is there for competitive reasons. But as you can see in the slide, our market share has been very consistent. We came into the downturn slightly above our longer-term average, but not materially. And we have since reduced that to about 23% below the average over the period.\n\nMario Mendonca -- TD Securities -- Analyst\n\nOK. Quick follow-up question then for Neil. Those mortgages that were put on the books in 2020 and 2021, I am referring to the variable rate mortgages. The rate on those mortgages could be up as much as 200 basis points, 300 basis points now.\n\nYou made the point that the only issue is that renewal. But isn't there this entire concept where the payment is no longer covering any of the principal, in which case, Royal has to act a little sooner than the renewal? Does that trigger concept exist in Royal's book?\n\nNeil McLaughlin -- Group Head, Personal and Commercial Banking\n\nIt does. So, in variable rate mortgages, there is trigger rate. And we have gone through that analysis over the last couple of months, Mario. We have about 80,000 mortgages that we will -- we expect with the next couple of rate hikes, we will reach that point.\n\nWe have gone through, again, sort of the similar deep analysis I had mentioned in terms of a longer term renewal risk similar to this trigger effect. The average increase is about $200. And we only -- we have less -- materially less than 0.5% of customers that we think will even require a phone call. So, we can see the capacity in the vast, vast majority of that 80,000 mortgage customers and communication will start to go out.\n\nMario Mendonca -- TD Securities -- Analyst\n\nGot it. Thank you.\n\nDave McKay -- President and Chief Executive Officer\n\nGraeme --\n\nGraeme Hepworth -- Chief Risk Officer\n\nMario, let me just add in just to make sure you understand the product construct there though. As clients at that trigger point and the interest rates continue to increase, it's just the incremental interest cost that's passed through in the immediate, right? They don't reset back to the amortization schedule until renewal. And that's why deal is saying, you know, on average, it's only a couple of hundred dollars of payment increases that you would expect given the interest rate trajectory we are on. I mean, for context, that's about 6% to 10% on average.\n\nMaterial payment increases really do come at renewal.\n\nMario Mendonca -- TD Securities -- Analyst\n\nI understand that. Thank you.\n\nOperator\n\nThank you. Our next question is from Paul Holden with CIBC. Please go ahead.\n\nPaul Holden -- CIBC World Markets -- Analyst\n\nThank you. Good morning. Appreciate all the candid comments on the macro outlook. I guess an exercise all of us have tried to go through is if we are going to go into a recessionary type environment trying to estimate the PCLs and ACL.\n\nAnd there is a temptation to look back at Q2 '20 and look at the ACL ratios on a loan type basis back then and say, how much would PCLs have to increase to get back there? But clearly, there are some differences between today and what happened in early 2020. And maybe in your mind, you can highlight, as you run through your sensitivity analysis, what do you think those key differences are on why the ACL may or may not be similar to the peak in 2020?\n\nGraeme Hepworth -- Chief Risk Officer\n\nYeah. Thanks. It's Graeme. I will take that question.\n\nI think Q2 2020 is a very difficult period to compare to. I mean, the pandemic was, I would say, a pretty extraordinary period to maybe what we are looking at in terms of more conventional recessionary period, if you will. I mean we were in a position back in Q2 2020, where the economy globally was in a complete shutdown mode, right, where people were sent home, unemployment spiked instantaneously. I think that's very different than the kind of recessionary situations we are facing now.\n\nAnd so, when you look at our macroeconomic forecasts and the uncertainty we put around that, and I think we have highlighted some of that in our disclosures. Yes, we are looking at unemployment and our baseline going from, again, extraordinary starting point of 4.9% to, say, 6.6%. So, you know, that is an increase in unemployment. And in our more severe situations, we look at unemployment, get up to more, you know, in the 7% range.\n\nAgain, on top of that, we do stress testing even more severe scenarios, but if you are looking at more plausible events and the kind of recession that we are thinking about, I don't think we are looking at the same level of severity that we were facing back in Q2 2020. Same thing with housing, again, we have seen incredible rapid housing. So, we do consider a lot more of our stress around that. And we certainly could see housing come back harder and more commensurate with what we maybe were expecting back in 2020, but really didn't play out that way.\n\nSo, yeah, again, we are looking at recession as a kind of a baseline. We are looking at uncertainty around that, But I just don't think it's the same level of severity that we were facing in Q2 2020 when we saw a complete shutdown of the economy.\n\nPaul Holden -- CIBC World Markets -- Analyst\n\nOK. And then how do you factor in things like, you know, the deposit rates that were mentioned earlier, the starting point for unemployment, the general health of the consumer, and maybe the general health of businesses as well. What role does that play into your scenarios and sensitivity analysis?\n\nGraeme Hepworth -- Chief Risk Officer\n\nYeah. So, there is -- again, it's Graeme. The thesis, you are right. We are always kind of taking our portfolio and it's in its current position.\n\nAnd so, the items that you are talking about, the health of the consumer, the health of the business situation, those are typically represented in our ratings for those clients. We have risk ratings for both our retail clients and our wholesale borrowers. And so, their ratings kind of start to provide that starting point for us that we then overlay our macroeconomic projections that come up with these forecasts. You asked about Q2 2020.\n\nWe were actually looking back at kind of where we were in Q4 '19, Q1 2020 kind of before we went into that period, because back then, we were somewhat bearish as well. We thought we were at end of credit cycle, and so we are just making some comparisons on where our loan loss allowances were then versus now. And at a headline, we are actually quite similar even though the dynamics are a little bit different. You know, weren't projecting a baseline recession back then, but we had our downside scenarios quite severely weighted back then.\n\nNow, we have a more severe base case than we did then, but the starting point is a healthier one, right. And so, those kind of mix pieces that get us back to a similar position where we were back in Q4 '19 when we were somewhat bearish about the economic situation back then as well.\n\nPaul Holden -- CIBC World Markets -- Analyst\n\nOK. That's helpful. I will leave it there. Thank you.\n\nOperator\n\nThank you. Our next question is from Sohrab Movahedi with BMO Capital Markets. Please go ahead.\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nYeah. Thank you. I have just a couple of quick clarification type questions. I unfortunately got dropped, so I may have missed this.\n\nDerek, just confirming, you are not changing your strategy in capital markets because of these credit marks or kind of whatever the dislocation in the market over the last three months?\n\nDerek Neldner -- Group Head, Capital Markets\n\nNo, not at all, Sohrab. I think, as I mentioned, apologies if you got cut off. When we look back at the underwriting business, I think, financially, it's been a very good business. It's been a positive revenue contributor every year, and it is a high ROE business over the cycle.\n\nStrategically, it's an important area that we serve our clients. And it can help drive other ancillary business through M&A and other financing products. So, it is a business we like, and no change to that direction or our risk appetite around it. That being said, and as we have talked about in prior calls, a real focus of our strategy has been to continue to grow our market share in some of the nonbalance sheet products, in particular, advisory and ECM.\n\nAnd we feel very pleased with how we have executed on that. We have been adding a lot of people over the last few years that bring a focus and emphasis on the advisory and the ECM products. We are seeing that translate into higher market share year-to-date in both of those products. And so, you know, very consistent with the strategic direction we are going, and that's the path that we will continue to invest and focus along.\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nOK. Perfect. And just a quick one for Nadine. Nadine, I think I have this excellent picture or charts on the bottom of Slide 12, where you show where the noninterest expense, excluding, you know, the variable comp and the like, has been trending.\n\nWhen you look at this, I don't know, maybe you kind of have averaged around 6% so far quarterly growth year to date. Like is that the right sort of total bank on a non-interest expense growth trajectory? Or do you expect that to moderate over the next, call it, four quarters to six quarters?\n\nNadine Ahn -- Chief Financial Officer\n\nThanks, Sohrab. So, in terms of the outlook for that, we have been investing heavily in the business. So, continue that -- we continue down that path, given that we are seeing the tailwinds associated with interest rates, and we are feeling adequately provisioned in terms of the downside risk. We expect that to continue into next year just given our investments in the business, and we are seeing some of the inflationary pressures on salaries.\n\nBut we do have opportunity to toggle that if we continue to see any further slowdown in the economy.\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nSo, taking the lead from the NII line more or less is, I think, what you are telling?\n\nNadine Ahn -- Chief Financial Officer\n\nYes, continues -- we continue to invest. Correct.\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nOK. Thank you.\n\nOperator\n\n[Operator instructions] Our next question is from Scott Chan with Canaccord Genuity. Please go ahead.\n\nScott Chan -- Canaccord Genuity -- Analyst\n\nGood morning. Thank you. Just want to ask the management. Neil, you talked about the recent dynamics with GICs and mutual funds.\n\nAnd I am just curious about your ETF product lineup and how that product suite and your partnership with BlackRock has been impacted positively or negatively recently.\n\nDoug Guzman -- Group Head, Wealth Management, Insurance\n\nIt's Doug. I will take that. So, we are very pleased with it, frankly. The market share gains that we have seen in that product have been affirming of the strategy.\n\nThe concept of initiation, as you will recall, was not a prediction that assets would flow dramatically over to ETFs, but a desire to have that product available for our advisors and our clients if they thought it was suitable for their portfolio. So, what's actually happened happily is we have been able to open dialogues with advisors who previously might not have spoken with us because we had mostly product branded as RBC and some of our competitors didn't want to have RBC on their client statements. With the alliance, we have been able to add not just different asset classes, but also branded as iShares and has found a welcome reception with some of those advisors. We have also been able to open dialogues with clients who maybe at the outset don't feel like they want to buy mutual funds and put them in their clients' portfolios or bias toward ETFs because we have that on the shelf that affords us an opportunity to have a conversation with them.\n\nAnd then, frankly, some of our mutual home product, well, maybe not the first choice for some advisors in asset classes that are difficult to get to elsewhere, maybe emerging markets, maybe distressed debt categories, we have found a welcome home with some of those advisors. So, it's -- we have been very happy with it. The partnership has worked very well. What you see in the asset management performance in the short term is a slight bias to fixed income.\n\nSo, you have seen that asset management -- assets under management declined on the back of both -- parallel declines in both equity and fixed income markets. But every single channel in that asset manager has had positive net sales over the last year, whether it's individual or institutional North America or Europe. So, we are happy with the performance across the board.\n\nScott Chan -- Canaccord Genuity -- Analyst\n\nAll right. OK. Thank you, Doug.\n\nOperator\n\nThank you. Our next question is from Lemar Persaud with Cormark Securities. Please go ahead.\n\nLemar Persaud -- Cormark Securities -- Analyst\n\nMaybe just a point of clarification for Nadine. Nadine, I think I heard you have mention 10 basis points to 15 basis points in Canadian banking margins over the next couple of quarters. Are you talking about -- first, are you talking about Canadian banking? And is that 10 to 15 sequential? And then if it is then, can you talk about your assumption for deposit betas?\n\nNadine Ahn -- Chief Financial Officer\n\nSure. Thank you. So, the 10 to 15 would be the range over through next quarter slowing down into Q1 as we start to see the rate increases taper off. In terms of deposit betas, they are holding quite well.\n\nAs I mentioned, we have got 45% of our deposit base is low-cost deposit beta. And so that -- from the checking account side of things, that's been quite muted and staying quite low. It's tapered up a little bit, which is why you saw our interest rate sensitivity come off slightly. However, it's not really been migrating up very high.\n\nWe would expect that to taper up a bit more. We see the next 100 basis point increase from the Bank of Canada that will start to probably move up to our longer term run rate average, but it has been operating below at this time.\n\nLemar Persaud -- Cormark Securities -- Analyst\n\nOK. Great. That's it for me, just a quick one there.\n\nOperator\n\nThank you. Our next question is from Joo Ho Kim with Credit Suisse. Please go ahead.\n\nJoo Ho Kim -- Credit Suisse -- Analyst\n\nHi. Good morning, and thanks for taking my question. Just wanted to go back to credit card growth. It was very strong, up about 8% quarter over quarter.\n\nI am wondering if you could comment on what happened in terms of utilization and pay-downs and if you are seeing any meaningful pickup on the revolver side. And I thought I heard slowing card purchase volumes there. So, just wondering if you could provide some outlook for growth on the credit cards going forward. Thank you.\n\nNeil McLaughlin -- Group Head, Personal and Commercial Banking\n\nSure. Thanks for the question. It's Neil. I will start with the revolver question.\n\nSo, Dave mentioned, we have started to see a tick up in revolve balances. So, we're up about $1 billion year-over-year in terms of revolvers, but our revolvers -- the revolving portion of the portfolio is growing slower than the transactor portion of the portfolio. So, I would say we are about a third of the way back in terms of peak to trough on revolver balances. So, we still feel we have got about $2 billion of revolver balances that will come back over time and exactly what that timing is, I think there is a little bit of uncertainty there.\n\nSo, trending back toward normal, but I think still room to go. And that obviously just goes back to all the liquidity that the consumers have that we have talked about. In terms of purchase volume, very strong purchase volume, very active consumer activity. We are seeing about a 20% increase in spend year over year.\n\nDave, I think mentioned about 30% if we go back to 2019 and benchmark that against pre-pandemic being driven disproportionately by our travel products or our strong Avion portfolio of credit cards. WestJet is doing quite well. And I think one of the things to note, we have made comments on previous calls that we have seen really strong consumer purchase activity outside of travel a couple of quarters ago. We have now seen travel actually bounce back, and it's actually above 2019.\n\nSo, we would say the consumer is active really across the board.\n\nJoo Ho Kim -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question is from Nigel D'Souza with Veritas Investment Research. Please go ahead.\n\nNigel D'Souza -- Veritas Investment Research -- Analyst\n\nThank you. Good morning. Thanks for the question. I just had a quick point of clarification on your comments regarding internal payment analysis of your mortgage portfolio.\n\nAnd I understand the projection and the scenario analysis so long to change. And you mentioned the majority of forwards do you have the capacity to absorb those projected payment increases. But I was wondering if you could size what the minority of that borrower base would be? Is that less than 1% of the portfolio, less than 5% in specificity? That would be appreciated.\n\nGraeme Hepworth -- Chief Risk Officer\n\nNigel, this is Graeme. Yeah, it's a good question. I think that again, it's internal analysis, and it's not something we are going to put a number to. Again, I think that was just one of the pieces that we wanted to call out and highlight that we -- in our disclosure, they are highlighted kind of the insured balances and the higher risk balances through the higher LTVs kind of just narrow down the set of what could be kind of the more at-risk balances for at renewal.\n\nSo, we just wanted to highlight that, a, with the size of that, but, b, that's still a high-quality portfolio. And that's why we kind of provided some insights around the FICO on that, the time to renewal on that. And the payment also is undertaken. But that's kind of some of the internal analysis that we weren't just going to put a number to.\n\nNigel D'Souza -- Veritas Investment Research -- Analyst\n\nOK. That's it for me. Thanks.\n\nOperator\n\nThank --\n\nDave McKay -- President and Chief Executive Officer\n\nMaybe, operator, I will take it over here and thank everybody. We're going to wrap it up now. I think we got through just about all the questions. And just quickly, to summarize, you know, kind of messages that we wanted you to take away from the quarter.\n\nNow, you know, first and foremost, the long-term investment in our deposit franchise, our low-beta core deposits or savings deposits, it's core to our franchise and it's core to the investments. And we have made strategic investments in creating value for customers. We've grown that. And now as investors, you are seeing the significant benefits from margin expansion, revenue growth, pre-tax, pre-provision.\n\nAs Nadine mentioned, we expect to see continued margin expansion in Canadian banking at a similar rate to Q3. We expect to see continued expansion in CNB's NIMs at a similar rate to Q3. And that's because of the heavy lifting that we did over honestly, almost two decades now. It also provides us with great information value on risk and on our customers and on their needs, as Neil has pointed out, in addition to funding and revenue growth.\n\nAnd therefore, you can see why we have always called our core deposit franchises on consumers and businesses, such an important point of why we continue to invest. You saw a very strong consumer and commercial lending growth prudent. You see a very strong balance sheet to absorb any uncertainty and ability to continue to return capital to shareholders and drive a premium TSR and to manage the uncertain environment forward. And a reaffirmation of some of the marks that we took that Derek and Graeme talked about, is a result of the success of our strategy and attractive for clients.\n\nAnd our underwriting exposures being a little bit above the long-term trend is because clients are coming to us, and we are becoming more senior in some of the opportunities that we have seen. So, it's a result of expanding our vertical coverage, bringing in more bankers, more MDs. That's playing out. So, it's not going out of our footprint.\n\nIt's just responding to our strategy and driving our business. And it's been a 10-year successful cycle. And therefore, we feel very positive about our ability to continue to drive consistent profitability going forward. Thank you.\n\nAnd great set of questions. I look forward to our next call in Q4. Thank you, operator.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAsim Imran -- Head of Investor Relations\n\nDave McKay -- President and Chief Executive Officer\n\nNadine Ahn -- Chief Financial Officer\n\nGraeme Hepworth -- Chief Risk Officer\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nNeil McLaughlin -- Group Head, Personal and Commercial Banking\n\nMeny Grauman -- Scotiabank -- Analyst\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nMario Mendonca -- TD Securities -- Analyst\n\nDerek Neldner -- Group Head, Capital Markets\n\nPaul Holden -- CIBC World Markets -- Analyst\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nScott Chan -- Canaccord Genuity -- Analyst\n\nDoug Guzman -- Group Head, Wealth Management, Insurance\n\nLemar Persaud -- Cormark Securities -- Analyst\n\nJoo Ho Kim -- Credit Suisse -- Analyst\n\nNigel D'Souza -- Veritas Investment Research -- Analyst\n\nMore RY analysis\n\nAll earnings call transcripts"
}