{
  "companyName": "ResMed",
  "companyTicker": "RMD",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/resmed-rmd-q4-2022-earnings-call-transcript/",
  "content": "ResMed (RMD -0.59%)\nQ4 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nHello, and welcome to the Q4 Fiscal Year 2022 ResMed earnings conference call. My name is Kevin, and I'll be your operator for today's call. [Operator instructions] Please note that this conference is being recorded. I will now turn the call over to Amy Wakeham, vice president of investor relations and corporate communications.\n\nAmy, you may begin.\n\nAmy Wakeham -- Vice President of Investor Relations and Corporate Communications\n\nGreat. Thank you, Kevin, and hi, everyone. Welcome to ResMed's fourth quarter fiscal year 2022 earnings conference call. We thank you for joining us.\n\nThis call is being webcast live, and the replay will be available on the investor relations section of our corporate website later today, along with a copy of our earnings release and the presentation, both of which are available now. Joining me on the call today are our chief executive officer, Mick Farrell, and chief financial officer, Brett Sandercock. Following our prepared remarks, we will host a Q&A session, and Mick and Brett will be joined by Rob Douglas, president and chief operating officer, and David Pendarvis, chief administrative officer and global general counsel. During today's call, we will discuss several non-GAAP measures.\n\nFor a reconciliation of the non-GAAP measures, please review the supporting schedules in today's earnings press release. And as a reminder, our discussion today will include forward-looking statements, including, but not limited to, expectations about our future operating and financial performance. We believe these statements are based on reasonable assumptions. However, our actual results may differ.\n\nPlease refer to our SEC filings for a complete discussion of the risk factors that could cause our actual results to differ materially from any forward-looking statements made today. I'll now go ahead and turn the call over to Mick.\n\nMick Farrell -- Chief Executive Officer\n\nThanks, Amy, and thank you all for joining us today as we review the results for the fourth quarter of our fiscal year 2022 ended June 30. On today's call, I will provide a brief high-level overview of our financial results. I'll then review progress toward our ResMed 2025 strategic goals, and then discuss our actions to navigate through ongoing industry and supply chain challenges. Brett will then join the call to review our financial results in more detail.\n\nOK. Let's jump right in. Our fourth quarter results reflect strong performance across our business with high single-digit revenue growth in both our sleep and respiratory care business segment, as well as in our Software-as-a-Service business segment. Our ongoing growth reflects our global team's relentless focus to solve very complex supply chain problems and find alternate design and engineering solutions to address the incredible industry challenges that we have faced over the past year and beyond.\n\nThe global supply chain environment remains very much in flux across multiple industries. We are starting to see indications that the macro environment is improving, particularly semiconductor availability. However, we're mindful that even as macro trends start to improve, we still need our supplier partners to prioritize med tech component needs over other nonlife-sustaining industries. Demand in the market remains very strong.\n\nWe've been able to mitigate some of the electronic component bottlenecks with the launch of our redesigned card to cloud AirSense 10 devices introduced to the market midway through our fourth quarter. As you can imagine, clearing one bottleneck simply brings the next rate-limiting step to the forefront. Our team is actively working to clear as many bottlenecks as they can as quickly as possible. On the positive news side, the redesign, reengineering and launch of the card to cloud device greatly improved our ability to meet the incredible demand that we see in the marketplace.\n\nDuring the last month of the quarter, during June, we were able to allocate more products to our customers than in recent months and in recent quarters. We're not out of the woods yet, but the compass is pointing to true north and we are on top of it. Throughout this crisis of demand and supply, our established ResMed guiding principles remain the same: that is that we will give priority to the production and delivery of devices to meet the needs of the highest-acuity patients first. As we discussed last quarter, we are still facing a challenging freight environment.\n\nThe key challenges of sea freight and airfreight are due to reduced availability and elevated prices. These forces are impacting our ability to efficiently get components into our factories and then to get the finished goods out of those factories and ship to warehouses and ultimately to customers. We continue to do everything that we can to secure additional supply to ultimately further increase production of our devices. As highlighted on previous calls, this includes a combination of five concurrent work streams in supply chain.\n\nOne, we are locking in the flow of our existing parts from existing suppliers. Two, we are establishing flow of existing parts from new suppliers. Three, we're validating and verifying new parts from existing suppliers. And four, we're validating and verifying new parts from new suppliers.\n\nAnd then, finally, five, we're reengineering designs to mitigate the major supply bottlenecks. In summary, we're making good progress with these five lines of work, and we've been able to offset some of the impacts of the component shortages to best support patients, providers, physicians and beyond. In addition to the successful launch of our redesigned card to cloud device last quarter, we also continue to support our customers with our market-leading mask portfolio. The supply -- despite the challenges we faced with reduced new patient setups due to a competitor recall, we continue to see strong uptake of our mask solutions as our customers want the smallest, the quietest, the most comfortable, the easiest to fit and the most highly patient-rated masks in the market, and those come from ResMed.\n\nPeer-reviewed and published studies have clearly shown that patients that are on a ReSupply program are much more likely to remain on sleep apnea treatment adherent for the long term than those that aren't on a ReSupply program. Our home care provider customers not only want to put new patients on therapy, they want to keep those new patients and all of their existing patients on therapy over the long term. And the ultimate goal there is to improve patient outcomes to lower total healthcare system costs, as well as to drive their own recurring revenue streams. We recognize that this demand outstripping supply situation remains a very difficult temporary state for all customers, including physicians, home medical equipment providers, payers, healthcare systems, as well as the most important customer of all, the patient.\n\nWe continue to work across the industry to be the best partner and the best solutions provider for all customers. We expect demand to be greater than supply for at least 12 more months, driven by the recall of one of our competitors primarily. The net result is that every device that we here at ResMed make during these next 12 months, we will sell as it leaves the production line to a warehouse and is shipped to a customer. We are looking at every angle to maximize supply and address this incredible demand these next 12 months.\n\nAs a company, we are learning every day. And as an industry, we will get through this challenge stronger than ever. Our goal is to ensure that every person gets the care that they need, where they need it, when they need it, and we won't stop until we achieve that goal. Let's now briefly review the COVID-related market impacts on our industry.\n\nMost of the 140 countries that we operate in are now above 100% of pre-COVID levels of patient flow. It is noted that in some regions and some countries, we see ongoing surges of new COVID variants with some select governments continuing to impose COVID restrictions. In these areas, patient flow remains below pre-COVID levels. But across the board, we are seeing ongoing adoption of digital health solutions for screening, for diagnosis and for remote patient setup and monitoring, as well as well-established COVID cleaning protocols at sleep labs and physician offices.\n\nThese trends continue to minimize the impact of new variants and diminish the absolute impact of COVID on our industry over time. Let's now step back a little and review ResMed's top three strategic priorities. No. 1, to grow and differentiate our core sleep apnea and respiratory care businesses.\n\nNo. 2, to design, develop and deliver world-leading medical devices, as well as digital health solutions that can be scaled globally. And No. 3, to innovate and grow the world's best software solutions for care that is delivered outside the hospital and especially in the home.\n\nThe launch of our next-generation device platform called the AirSense 11 continues to go very well. It remains somewhat difficult to differentiate the success of the launch from previous generations with the incredibly high demand we're seeing around the world. Every Air 11 we make is sold immediately as it leaves the manufacturing floor. However, when we drill into patient feedback data, we see that patients are very excited about the platform, including the Air 11 device itself and the myAir software solutions surrounding it.\n\nDuring the fourth quarter, we introduced the AirSense 11 into several new countries outside the United States where we first launched the platform, including France, Switzerland and across the Nordic countries of Northern Europe. We look forward to further expansion into additional countries as we progress through our fiscal year 2023. One area that we are closely watching is patient adoption of digital health solutions. And to that point, adoption rates of the myAir app by new patients set up on therapy with the AirSense 11 continue to be more than double that of the AirSense 10.\n\nThis is because the AirSense 11 platform is designed to enable and encourage patients to engage directly with their own healthcare. The bottom line is that people want personal care. They want their own data on their own app on their own phone. And they love the coaching and personal engagement of our ecosystem.\n\nThey are voting with their digital presence and repeat usage of the myAir app is stronger than ever. More patients on myAir means more patients are fully engaging with ResMed's software technology. This has led us to now passing over 12 billion nights of sleep apnea and respiratory care medical data in the cloud. Our software solutions, including myAir and AirView, are delivering a better patient experience, better efficiencies for home care providers and physicians, and most importantly, greater long-term adherence to therapy for the patient.\n\nAnother key aspect of our long-term growth strategy is driving awareness and increasing the flow of patients through the top of the sleep apnea diagnosis funnel. COVID-19 has advanced awareness, adoption and acceptance of digital health. For our industry, this is specifically seen in the increased usage of home-based sleep apnea tests. Although new patient demand gen is clearly not a top priority in the immediate term given the current supply demand imbalance, we are maintaining our focus in this area and our long-term investments so that we are ready when conditions improve and we can pivot and fire up our portfolio of demand-gen models and thereby ensure sustainable long-term pipelines of new patients for our industry.\n\nWith over 1 billion people suffocating every night with sleep apnea worldwide, we see this work as an opportunity, but also an obligation as the market leader in the field. We are innovating with healthcare system partners and all of our customers to create an even more efficient and effective approach to sleep apnea patient identification, screening, diagnosis, treatment and management. We will continue to invest in technology that enables an end-to-end, seamless, digital experience for patients and their caregivers. As we consider opportunities to address the wider sleep market, we are investing in opportunities to address another major sleep disorder epidemic, that of insomnia.\n\nInsomnia has been shown in clinical research to occur in combination with sleep apnea, and that's a deadly combination. To this medical need and this medical opportunity, just last week, we announced the acquisition of a company called mementor. This is a German and Swiss digital health start-up that develops and sells digital medical products in the field of sleep medicine and beyond. mementor offers the first and so far the only permanently listed digital health application in the field of sleep medicine that is reimbursed by the statutory insurances in Germany.\n\nThe acronym for these German digital health apps is DIGA, D-I-G-A. This acquisition furthers our efforts to diversify and accelerate growth of our ResMed business in Germany and the potential opportunity with DIGA to expand this offering into other markets around Europe and around the world. There's an unmet need in diagnosing and treating people with sleep problems, such as sleep apnea and insomnia, the two biggest sleep problems on the planet and especially when there's an overlap of these chronic conditions. This acquisition of mementor broadens our focus in this vertical from a sleep apnea therapy company to a true sleep therapy company.\n\nMore to come as we pursue growth in this exciting space in Germany and beyond. Growth trends in the global sleep apnea market are in a state of flux in the short term given the market supply demand dynamics that we talked about and the recall from one of our competitors. Long term, we estimate the underlying growth trends in the global sleep apnea market to be very strong; in the mid-single-digit range for devices and the high single-digit range for masks. As always, our goal is to drive market demand and to meet or beat market growth through generation of new patients and sales of our market-leading therapy solutions and the introduction of new innovations and alternative treatment pathways that enable us to address even more patients with undiagnosed sleep apnea.\n\nCurrent industry dynamics indicate that we have a multiyear opportunity to drive even greater ongoing acceptance and adoption of our solutions to further solidify our market leadership position. I've challenged our global ResMed team to strive for even stronger growth in the coming months and quarters and the fiscal year and beyond. I'm telling them to go get the share, to go lock in that share with digital health with value that speaks for itself with lower costs, better outcomes for patients and increased efficiencies for the healthcare system. Turning to a discussion of our respiratory care business.\n\nI want to focus on our strategy to better serve the 380 million people worldwide with chronic obstructive pulmonary disease, or COPD, with many others with neuromuscular diseases and respiratory insufficiency and the 330 million patients that suffer from asthma worldwide. Our goal is to reach hundreds of millions of patients with our respiratory care solutions, including noninvasive ventilation, as well as life support ventilation, as well as newer therapeutic areas, such as our cloud-connected pharmaceutical delivery solutions from our propeller team, and high-flow therapy offerings that we are conducting clinical trials on right now, including our product platform called Lumis HFT. Demand for our core noninvasive ventilation and life support ventilation solutions for COPD and neuromuscular disease and beyond remains solid throughout the quarter. Ventilation solution demand was supported by the continued success, adoption and scaling of our AirView for ventilation software platform by customers as they experience the benefits of remote monitoring to better manage their ventilated patient populations through remote access to clinical data, as well as customizable physician notifications.\n\nLet me now review our Software-as-a-Service business for outside hospital care. Our SaaS business achieved another quarter of high single-digit growth year-on-year across our portfolio of verticals, including home medical equipment, as well as facilities-based and home-based care settings. Our SaaS customers recognize the need for technology solutions to solve their challenges with efficiency and scale, and our software, services and solutions help them achieve both. The continued growth of home-based care is providing tailwinds for HME solutions, as well as home health solutions.\n\nWe continue to grow with our customers as they increase their utilization of our software and our data solutions to improve and optimize their business efficiencies and their patient care, including Brightree and Snap ReSupply offerings. As businesses continue to open up, we've been able to visit customers more and more in person, as well as attend trade shows, host conferences, where the interest in our Brightree, MatrixCare, HEALTHCAREfirst, and Citus offerings remain very strong. Earlier this week, I personally attended the Inspire 2022 Conference in Austin, Texas. This is MatrixCare's annual customer summit, and it was in person for the first time since 2019.\n\nI had the pleasure and the opportunity of presenting and engaging in person with over 600 customers and partners from home health, skilled nursing, senior living, private-duty home care, life plan community verticals and beyond. The passion for caring for each patient that was involved in every conversation I had this week, the openness, the sharing and the ability for us as a community to move patients to lower-cost, lower-acuity and higher-quality outcome cares, those settings was palpable at Inspire 2022. I came away from that conference even more energized and excited about the opportunities that we have to support customers across the care settings with our digital health and our software solutions. The ultimate goal is that customers of our Brightree- and MatrixCare-branded solutions can provide better care for the people that they serve.\n\nGiven the passion of our customers and the service levels that we're providing and the product pipeline that was discussed at this conference, I expect we'll continue to not only take share from our competitors across the portfolio, but even drive growth with more tech solutions being adopted by customers across care settings. The COVID-19 pandemic has been and remains challenging for facility-based verticals in our SaaS business, particularly skilled nursing and to a lesser extent hospice, where patient census rates below -- remain below pre-pandemic levels. As COVID restrictions continue to ease and our customers improve their line of sight to better conditions and better cleaning, we are seeing pent-up demand for technology investments in these facility-based areas. This provides opportunities for us to sell more services and more tech solutions to existing customers, as well as to increase our new customer pipeline.\n\nOne MatrixCare customer at Inspire 2022 grabbed me at the conference, and he described what he called a rocket ship acceleration of demand at skilled nursing tech solutions for those skilled nursing customers. This is a really welcome sign for sustainable growth across our SaaS portfolio. So as we look at our portfolio of solutions across care settings, we expect our SaaS group revenue to maintain high single-digit growth throughout fiscal year 2023. As always, our goal is to meet or beat market growth rates, and we will continue to invest and innovate to grow the market and to take share.\n\nOur growth in SaaS will come through organic and inorganic growth. We've long talked about our desire to expand our SaaS offerings internationally if and when we found the right opportunity for ResMed. In early June, we announced the acquisition of MEDIFOX DAN, the leading provider of end-to-end software solutions for home health and for nursing home providers in Germany. We've been closely watching the evolution of the German digital health system and the associated outside hospital healthcare system for many years.\n\nAnd we've actually been closely watching MEDIFOX DAN for a number of years. This is our first investment in a pure-play SaaS business in Europe, and it's a great opportunity to expand our reach in this business globally. We're starting in Germany as it is not only a market where we're vertically integrated in our core business of sleep and respiratory care, it's also one of our largest markets globally and a country where the government is investing in digital health reimbursement. We're excited about the opportunity to accelerate innovation and recurring revenue business models through this acquisition in Germany.\n\nAs we discussed on the acquisition call that we had in June, MEDIFOX DAN will be immediately accretive to ResMed at close. Progress toward closing this acquisition is moving ahead as expected. We remain on track to close by the end of December 2022 in our fiscal 2023 second quarter. We are the leading strategic provider of SaaS solutions for outside hospital care globally, and we provide mission-critical software across a broad set of very attractive markets.\n\nWe are well positioned, and we have created a differentiated value for our customers and for ResMed with our SaaS business investments. I'm excited about the future of our SaaS business. And Bobby Ghoshal and the excitement that he had on Inspire 2022 with the crowd for both MatrixCare and Brightree was an inspiration for me as the CEO of the parent company but also for the whole team there. It's an important part of ResMed's future growth, and I see a lot of opportunities to invest in lower-cost, lower-acuity settings of care.\n\nWe believe that this is the future of healthcare delivery, and that's where ResMed competes and it's where ResMed wins. To bring it all together, our strategic focus remains on personal care that is patient-centric, physician-centric and provider-centric. This triple-pronged approach, combined with our unique ResMed culture, means that we are very well positioned to continue winning in the vastly underserved medical markets of sleep apnea, COPD, neuromuscular disease, asthma, insomnia and beyond. We are transforming outside hospital care at scale.\n\nWe're leading the market in digital health technology with over 12 billion nights of medical data in the cloud and nearly 18 million cloud-connectable medical devices on people's bedside tables in 140 countries worldwide. We are unlocking value by using de-identified data to help patients, providers, physicians, payers and entire healthcare systems. We have invested in the cybersecurity, the privacy, the cloud ops, the data analytics, the AI/ML capabilities to do this at scale, unmatched by any competitor. And we are increasing our investments and our lead each and every day.\n\nOur two key global customer-facing software products, AirView and myAir, are 100% in the cloud. Our devices are both cloud-connected and cloud-enabled, making ResMed itself a market-leading cloud-connected and cloud-enabled digital health company. Our mission and goal to improve 250 million lives through better healthcare in 2025 drives and motivates ResMedians every day. We made excellent progress toward that inspiring goal this last fiscal year 2022.\n\nWe changed nearly 141 million lives these last 12 months with our devices, our mask systems, our software solutions, helping people sleep better, breathe better and live higher-quality lives with outside hospital care. Before I hand the call over to Brett for his remarks, I want to once again express my sincere gratitude and thanks to more than 8,000 ResMedians helping their customers in 140 countries. Your perseverance, hard work and dedication has been impeccable. Thank you.\n\nWith that, I'll hand the call over to Brett in Sydney, and then we'll open up for Q&A. Brett, over to you.\n\nBrett Sandercock -- Chief Financial Officer\n\nGreat. Thanks, Mick. In my remarks today, I will provide an overview of our results for the fourth quarter of fiscal year 2022. Unless noted, all comparisons are to the prior year quarter.\n\nWe had solid financial performance in Q4 despite the headwinds we faced due to significant ongoing supply chain constraints in a challenging freight environment. Group revenue for the June quarter was $915 million, an increase of 4%. In constant currency terms, revenue increased by 8%. Revenue growth reflects increased demand for our sleep products across our portfolio and increased device demand generated by our competitor's ongoing product recall.\n\nWe did not derive incremental revenue from COVID-19-related demand during the June quarter compared to $20 million in the prior year quarter. Looking forward, we expect negligible revenue from COVID-19-related demand. Excluding the impact of COVID-19-related demand in the prior year, revenue increased by 10% on a constant currency basis. In relation to the impact of our competitor's recall, we estimate that we generated incremental device revenue in the range of $60 million to $70 million in the June quarter.\n\nNote, this is consistent with the estimated $60 million to $70 million incremental device revenue in the prior year quarter. For fiscal year '22, this brings the total estimated incremental revenue in the range of $230 million to $250 million associated with our competitor's recall. While we continue to experience ongoing challenges in securing sufficient production components to meet market demand, we are now seeing a stable to improving supply chain environment. This has given us more confidence around our expectation of increasing device production in fiscal year '23 relative to fiscal year '22.\n\nLooking at our geographic revenue distribution and excluding revenue from our Software-as-a-Service business, sales in U.S., Canada and Latin America countries increased by 12%. Sales in Europe, Asia and other markets increased by 1% in constant currency terms. By product segment globally in constant currency terms, device sales increased by 6%, while masks and other sales increased by 11%. Breaking it down by regional areas, device sales in the U.S., Canada and Latin America increased by 11% as we benefited from incremental revenue due to our competitor's recall.\n\nMasks and other sales increased by 13%, reflecting solid resupply revenue and achieved despite the challenging device supply environment, which continues to limit new patient setups. In Europe, Asia and other markets, device sales decreased by 2% in constant currency terms or excluding the impact of COVID-19-related sales in the prior year increased by 7% in constant currency terms. Masks and other sales in Europe, Asia and other markets increased by 7% in constant currency terms or excluding COVID-19-related sales in the prior year increased by 9% in constant currency terms. Software-as-a-Service revenue increased by 8% in the June quarter.\n\nWe saw a strong performance from our HME segment as customers continue to utilize our SaaS solutions to streamline and more efficiently run their businesses. And we are seeing stability in the skilled nursing care segment despite the continuing challenges of COVID-19. During the rest of my commentary today, I will be referring to non-GAAP numbers. We have provided a full reconciliation of the non-GAAP to GAAP numbers in our fourth quarter earnings press release.\n\nGross margin increased by 50 basis points to 57.8% in the June quarter. The increase is predominantly attributable to improvement in average selling prices and a positive product mix, partially offset by higher freight component and manufacturing costs, negative geographic mix and unfavorable foreign currency movements. Moving on to operating expenses. We are seeing a more normalized expenditure profile as COVID-19 impacts subside compared to the low comparable growth rate we experienced in Q4 last year.\n\nSG&A expenses for the fourth quarter increased by 6%, or in constant currency terms, increased by 11%. The increase was predominantly attributable to increases in employee-related costs and T&E expenses. SG&A expense as a percentage of revenue at 21.1% remained broadly consistent with the 20.7% we recorded in the prior year period. Looking forward and subject to currency movements, we expect SG&A expense as a percentage of revenue to be in the range of 20% to 22% during fiscal year '23.\n\nR&D expenses for the quarter increased by 7%, or in constant currency terms increased by 11%. The R&D expenses as a percentage of revenue was 7% compared to 6.8% in the prior year quarter. Looking forward and subject to currency movements, we expect R&D expenses as a percentage of revenue to be in the range of 7% to 8% in fiscal year '23. Operating profit for the quarter increased by 4%, underpinned by strong revenue growth, partially offset by higher operating expenses.\n\nOur effective tax rate for the June quarter was 17.6% compared to the prior year quarter rate of 21.5%. Looking forward, we estimate our effective tax rate for fiscal year '23 will be in the range of 19% to 21%. Our net income for the quarter increased by 10%, and our diluted earnings per share for the quarter also increased by 10%. Cash flow from operations for the quarter was $79 million, reflecting solid underlying earnings, offset by higher levels of working capital.\n\nCapital expenditure for the quarter was $29 million, depreciation and amortization for the quarter totaled $37 million. During the quarter, we paid dividends to shareholders totaling $61 million. We recorded equity losses of $2.5 million in our income statement in the June quarter associated with the Primasun joint venture with Verily. We expect to record equity losses of approximately $3 million per quarter in fiscal year '23 associated with the joint venture operation.\n\nWe ended the fourth quarter with a cash balance of $274 million. At June 30, we had $780 million in gross debt and $500 million in net debt. Our debt levels remained modest. At June 30, we had approximately $1.4 billion available for drawdown under our revolver facility.\n\nIn summary, our liquidity position remains strong. Our board of directors today declared a quarterly dividend of $0.44 per share, representing an increase of 5% over the previous quarterly dividend and reflecting the Board's confidence in our operating performance. Our solid cash flow and low leverage provides flexibility in how we allocate capital. We recently announced the MEDIFOX DAN acquisition and expect to close this transaction before the end of the calendar year pending regulatory clearances.\n\nGoing forward, we plan to continue to reinvest in growth through R&D and also expect to continue to deploy capital for tuck-in acquisitions, such as the recently announced acquisition of mementor, a German pioneer and health tech start-up that develops and distributes digital medical products in the field of sleep medicine and related areas. And with that, I will hand the call back to Amy.\n\nAmy Wakeham -- Vice President of Investor Relations and Corporate Communications\n\nGreat. Thanks, Brett, and thanks, Mick. Kevin, I'll now turn the call over to you to provide instructions and manage the Q&A portion of the call.\n\nOperator\n\n[Operator instructions] Our first question today is coming from Craig Wong-Pan from Royal Bank of Canada. Your line is now live.\n\nCraig Wong-Pan -- RBC Capital Markets -- Analyst\n\nHi, everyone. Mick, you mentioned at the start that you were seeing some improvement in the global supply chain. I just wanted to understand the details around what you meant by that improvement, and when that could start to see improvements to your manufacturing volumes.\n\nMick Farrell -- Chief Executive Officer\n\nYes. Thanks for the question, Craig. And what we've seen over the last two, three, four quarters was a really deteriorating supply situation, where we were getting decommits, a word I'd never heard of in supply chain, including my time at BHP and other companies that just -- you never heard of that sort of supply even in commodity industries, and to get it in specialty industries was so unusual. What we're seeing is that sort of noise is starting to go away.\n\nAnd what I'd say is it's a stable to improving component supply environment and that's what we're seeing. But I don't know, Rob, if you want to provide any further color on the supply chain and how we're -- for the details on how we're seeing a supply that's stable to improving on components.\n\nRob Douglas -- President and Chief Operating Officer\n\nSure. Yes, Mick. Craig, one of the sort of fundamental things of supply chain management is ongoing risk management and having sort of the ability to foresee problems and to react through all of that. And then, you also manage your risk through inventories and that type of thing.\n\nWe've over recent months put in place a lot of forward orders, working a lot on relationships with key suppliers. We suspect that sort of global demand on these suppliers is moderating a little bit. And then, as Mick says, that means that they're sticking with their commitments at a higher level than what we have seen recently. There are always problems to overcome.\n\nAnd as Mick said earlier, there are other bottlenecks. Once we close one bottleneck, we have to go and work on the next. But overall, I'd say we're feeling better about the forward outlook that we have, and we've got a little more clarity. It's not perfect.\n\nThere still will be challenges and undoubtedly unexpected things that we'll have to manage through, but the net of it all is that we should see our volumes continue to increase from here.\n\nOperator\n\nThank you. Our next question is coming from Chris Cooper from Goldman Sachs. Your line is now live.\n\nChris Cooper -- Goldman Sachs -- Analyst\n\nThanks for taking my question. So I noticed, Mick and Brett, no specific guidance on the recall tailwind in fiscal '23. Obviously, I understand the prudence. But I guess just given the importance of the debate, perhaps you can just share your latest thoughts on how you see that dynamic playing out this year.\n\nMick Farrell -- Chief Executive Officer\n\nYes. Thanks for the question, Chris, and it's a really good one. But as you know, we've annualized the impact of that competitor recall. And for us now, as I said in my prepared remarks, for the next 12 months, I do not believe there'll be really in the new patient market given the consent decree work they've got to do, the remediation work they've got to do in responding to that 483 and the observations.\n\nAnd so, what that means for us is basically demand that is incredible for these next 12 months, and that every device we make will be solved as it comes through the manufacturing line. And so, the rate-limiting step on that, as Rob said, will be a bunch of bottlenecks that we'll work our way through. And it's like a game of Whac-A-Mole. We just keep -- find a problem, solve it, find the next problem, solve it.\n\nAnd ResMed is exceptional at that continuous improvement process. Our supply chain teams, our manufacturing teams, our distribution teams have been heroic in the ventilator crisis in 2020 and then the supply chain crisis of '21-'22. And so, that gives us confidence to say sequentially every quarter through fiscal '23, we're going to see those volumes improve. And we've got line of sight to that, and we've got interactions with suppliers on that, and we think it's going to go up every quarter.\n\nI don't look at this as incremental or temporal taking of share now. This is permanent share taking. We're going to go in, we're going to get the share, we're going to lock it in with digital health solutions. And when somebody uses something that lowers their labor costs by 50%, that improves the adherence rate of the end customer, the patient, to 87%, nine out of 10 patients getting adherent at day nine and beyond, that's where we can lock it in.\n\nSo that's sort of some extra color for you, Chris, but great question.\n\nOperator\n\nThank you. Next question is coming from Sean Laaman from Morgan Stanley. Your line is now love.\n\nSean Laaman -- Morgan Stanley -- Analyst\n\nThank you. Good morning. Mick, my question is around the card to cloud devices. And is there anything that you note with respect to either compliance rates or resupply potential with card to cloud versus direct cloud connectivity? And is there a view that maybe you get patients that are on card to cloud devices back to the fully charged AirSense 11 at some point?\n\nMick Farrell -- Chief Executive Officer\n\nThanks, Sean. Two questions. Card to cloud AirSense 10 is really new. I mean, we just really launched it midway through and really in the month of June in the quarter.\n\nSo it's early days on that. But we've got a lot of experience with card to cloud. I mean, think about the S8 and then the S9 with its little SD chip in the back of S9. The product -- when I was running the sleep business, we launched that back in '09 and '10.\n\nAnd we -- so we have a lot of experience with card to cloud. And it's primarily -- the card to cloud, primarily volume has been in the U.S. And that's where we had a very strong digital health system and engagement with our HME partners in a card to cloud environment. So we don't have sort of adherence exact numbers delta between AS 10 C2C versus AS 11.\n\nI think it will be higher, the adherence on the AirSense 11 just because we're getting double the rate of myAir uptake, and that digital health engagement drives higher adherence. And I can tell you as soon as we get clearance on line of sight to those comms chips picking up supply, we'll move everybody to AirSense 11 as soon as we have it. Probably, we won't go back and retrofit the groups that are there, just because people when they get therapy, they're happy. And the data will go to the cloud, they just won't go to the cloud every day.\n\nIt will go when the SD card is uploaded on day 30, 60 or 90, and when they see the home care provider and the physician. And so, they're not lost patients, they're not lost data. They're still part of the ecosystem, it's just not quite as efficient as it could be. So we're going to get back to AS 11 and really ramping that as fast as possible.\n\nBut given the supply demand crisis, I was amazed and thrilled that our team was able to pivot in June, get there. And we're going to be able to do that through September and December quarters here as well and beyond. But thanks for your question, Sean.\n\nOperator\n\nThank you. Next question is coming from Margaret Kaczor from William Blair. Your line is now live.\n\nMaggie Boeye -- William Blair and Company -- Analyst\n\nThank you. This is Maggie Boeye on for Margaret today. I wanted to ask one on ReSupply, just the trends you're seeing this quarter and if you're continuing to see incremental and permanent share gains within that market as well. Thank you.\n\nMick Farrell -- Chief Executive Officer\n\nYes. Thanks, Maggie. Great question. Allows us to talk about masks.\n\nDespite that competitor not being there for new patient setups where we had a lot of adoption of ResMed masks on their platform, as well as ours and then it's not in the market. We saw mask growth rates at 11% constant currency globally. We saw 13% constant currency growth in the quarter on masks in the U.S. And we saw a pretty strong 7% constant currency growth on masks in Europe, Middle East and other markets.\n\nAnd so, I actually think that the team and all the work we've done with Brightree and Snap ReSupply in the U.S. and all the work our European and Middle East teams and our Asia teams have done around engaging patients digitally through either myAir or other marketing and adherence programs have performed really well. And despite the headwind of lower new patient setups, we're achieving at or above market growth rates. And to the second part of your question, yes, I do think we're taking share across categories.\n\nAnd I think we're creating new categories by some of our innovations in the different types of comfort and design of the masks, the minimalist masks, the fun comfort masks, the over-the-head masks and -- so creating new segments, taking share in those and being able to lock in that share. Because when a patient gets happy on their mask, like I am with my AirFit P10, they tend to stick with it for life. And it's a great thing for us to be able to do on that. So really excited about it, and I look forward to more mask innovation coming out and more share taking and locking it in over time.\n\nOperator\n\nThank you. Your next question is coming from Matthew Mishan from KeyBanc. Your line is now live.\n\nMatthew Mishan -- KeyBanc Capital Markets -- Analyst\n\nHey. Thank you for taking the questions. I guess, I wanted to ask a question on the gross margins. Do you have a sense of kind of what the supply issues, FX, retrofitting, all of this is having on your productivity and kind of gross margins in FY '22?\n\nMick Farrell -- Chief Executive Officer\n\nThat's a great question, Matthew. I'm going to hand that to Brett. Any color on GM there for Matthew?\n\nBrett Sandercock -- Chief Financial Officer\n\nYes. Matthew, I mean it is because we're just trying to maximize the devices out the door with the components that we have. So as you think through that, in terms of manufacturing optimization, we've really struggled with that. So I do think as we get further through this and some of the supply issues abate, then I think we do have some opportunities there on for manufacturing, think around manufacturing recoveries to significantly improve from where we are.\n\nSo I do think that's an opportunity for us. It's not immediate, but if you look through the medium term, there is definitely opportunity for us to optimize there.\n\nOperator\n\nThank you. Your next question is coming from Steve Wheen from Jarden. Your line is now live.\n\nSteve Wheen -- Jarden -- Analyst\n\nYeah. Thanks, Mick. You can hear me here, yes?\n\nMick Farrell -- Chief Executive Officer\n\nYes. Got you loud and clear, Steve.\n\nSteve Wheen -- Jarden -- Analyst\n\nYes. Great. Also, just on the gross margin for Brett. We're seeing in freight costs spot prices for shipping and for airfreight coming down by about 30% at the moment from its peak in March.\n\nI just wonder when we might start to see that appearing in the gross margin and if there's any changes with regards to semiconductor chip pricing that is worth calling out in more recently.\n\nBrett Sandercock -- Chief Financial Officer\n\nYes. Steve, it's Brett. Yes, I mean you're sort of seeing some of that or you're seeing some of these freight costs definitely moderate -- some cost reductions, but certainly not manifesting our numbers at the moment. I think we'll get some of that benefit, I would say, in our second half, where we'll probably see some of that coming through.\n\nBut at this stage, I'd say, look, it's not even in our margin at the moment. But we do have some potential on freight in the second half, both on rates, and I think also we'll skew a little more -- start putting a little more on sea freight as we get through the back of the year as well, and that will certainly help us on our overall freight costs. So again, just kind of that environment where you're seeing some moderation or stabilization. And then, I'm seeing as we get through fiscal year '23, some opportunities could be at manufacturing, be on the freight side as well.\n\nBut we're not seeing that just yet in our numbers.\n\nOperator\n\nThank you. Your next question is coming from David Low from J.P. Morgan. Your line is now live.\n\nDavid Low -- JPMorgan Chase and Company -- Analyst\n\nThank you very much. Maybe just continuing on the cost around gross margins. Can I get, perhaps you, Brett, to talk about the impact of inflation, what you're seeing on costs, and what you expect or what we should be looking out for in terms of margins and the impact there for?\n\nBrett Sandercock -- Chief Financial Officer\n\nYes. Thanks, Dave. I mean, we've seen component inflation, component cost increases. We've certainly seen that in electronic components.\n\nWe've talked -- we've clearly talked about the freight and the increases that we have seen there. So that's all been built in, if you like, to our cost base at the moment. Going forward, I think we'll still see some of those increases, but I think that's manageable. And then, what we've done, as you know, is we've done a little bit on our pricing to customers as well to help offset some of that.\n\nSo we put through the device surcharge, for example. And we're also planning some modest price increases from July 1 as well. So some of this is going to offset some of that. But I would say, yes, we saw that -- is it accelerating? No, but we're still seeing some cost and component increases coming through.\n\nProbably -- I would expect to see that probably for the next little while. But it's not -- we're not seeing any acceleration in that, which I think is good. So I think that there's some offsets there on the gross margin, headwinds on components. I guess, some tailwind on ASPs will be benefit for margin going forward.\n\nOperator\n\nThank you. Your next question is coming from Gretel Janu from Credit Suisse. Your line is now live.\n\nGretel Janu -- Credit Suisse -- Analyst\n\nThank you very much. So just moving back to revenue. How much revenue did the card to cloud contribute in the fourth quarter? And then I guess going forward, do you expect it to be meaningful in FY '23?\n\nMick Farrell -- Chief Executive Officer\n\nYes. Thanks for the question, Gretel, and it's a really good one. For competitive reasons, I don't want to go into too much detail around it, other than to say that that pivot of the team during the quarter was incredible. To redesign, reengineer and requalify, validate and verify a device with a new model of card to cloud and get it to market and get it in customers' hands in June was fantastic.\n\nSo all credit to the team. It was material to our growth in the quarter, and it will be material to our growth up to and when we get those comms chip supply back to the levels that we need it to meet the incredible demand of the marketplace. So it was material. It was strong, not going to quantify it down to the nth level of detail here.\n\nBut it provided great additional growth for us in that last quarter and will for the coming quarters. I look forward to the point where I can say we are no longer selling AirSense 10 card to cloud because that means that we've got AirSense 11 connectivity and AirSense 10 connectivity back up to where we need it with that component no longer being a bottleneck for us. But that may be three, six, nine, 12 months out there with this incredible demand we're seeing in the market.\n\nOperator\n\nThank you. Our next question today is coming from Saul Hadassin from Barrenjoey Capital. Your line is now live.\n\nSaul Hadassin -- Barrenjoey Capital -- Analyst\n\nThanks and good morning. Good afternoon. Mick, just following up on that card to cloud commentary. Can you just confirm or give us some color as to what happens to those machines once the chip alleviation is completed and you start to get better access to comms chips? Is the intention to bring those devices back and put those chips in? Or if you buy -- if you get issued a card to cloud device, do you effectively keep that device for the next sort of five years and then upgrade at some point in the future?\n\nMick Farrell -- Chief Executive Officer\n\nYes. So it's a really good question. I think it will probably be the latter part of your question -- or the answer to your question that you gave, which is it will probably be -- when somebody receives a device, it becomes a very personal, very intimate part. It sits on their bedside table.\n\nIt gives them the gift of breath, the gift of sleep, and it changes their life. And the fact that they may have to take an SD card to the doctor, to their HME provider or have it mailed back and forth won't stop them from having that personal and intimate relationship. So there will be some very savvy patients who will see that and want to upgrade in less than that three-year -- depending on insurance, three to five year's time horizon. But I think the vast majority of those will remain there permanently.\n\nAnd our job will be to provide the great services around AirView and the engagement that we provide through some of our VoIP. And we do email, text and interactions with patients that go well above just the cloud connectivity from the device itself that we've had in place on our Air Solutions ecosystem for a long time. So I'm very confident we're going to get very high adherence from the AirSense 10 card to cloud people with the ecosystem we have. It will be better with Air 11.\n\nSo as soon as those components are back there, we'll do that. But I think there'll be a small group of people that will look to upgrade their device before insurance provides it in certain socioeconomic groups in certain countries. Just to be clear, we're really focusing card to cloud right now in the U.S., and that's where we've got a really good ecosystem of home care providers who know how to use card readers and get the data to the cloud and get it into AirView and get it to doctor and engage their patients to drive ReSupply through other means, Brightree, Snap and whole Air Solutions ecosystem. Great questions, Saul.\n\nBut I think it will be mostly the latter, answer to your own question there.\n\nOperator\n\nThank you. Next question is coming from Dan Hurren from MST Marquee. Your line is now live.\n\nDan Hurren -- Marquee Research -- Analyst\n\nOh, good morning. Thanks, Mick. You've been quite specific in the past about these streams of engineering efforts to overcome supply chain shortages, and I guess, including the AirSense 11 range with parts alternate suppliers. So the card to cloud device clearly had a big impact.\n\nBut do you have any update on the timing of these other initiatives? And will that be a calendar year '22 feature?\n\nMick Farrell -- Chief Executive Officer\n\nYes. Dan, it's a really good question. And we have our chief operating officer on the line here who's closer to the other four work streams. The fifth one is that reengineering for C2C and beyond.\n\nRob, any color for Dan on all that work we're doing in the supply chain and the reengineering we're doing to -- the streams of engineering work we're doing to increase supply over the fiscal year?\n\nRob Douglas -- President and Chief Operating Officer\n\nYes, Dan. I mean, one of the key areas, obviously, is in the columns is around getting access to some of the 5G protocols that are being rolled out. And we're seeing them get rolled out pretty nicely in some markets. And some of our validation, some of those streams are getting access to those types of chips, including we're getting access to earlier-gen protocols as well.\n\nAnd we'll be deploying both of those. I don't think we can give you granularity over it. And it's not without risk in some of the timing. But what we will be doing is as soon as we can deploy and validate and have access to those chip volumes, we'll switch to that as quickly as possible.\n\nSo it won't actually be a single overnight switch of now, all of a sudden, everything has gone to some new protocol or something; they'll be targeted to markets in specific volumes, and we'll keep doing work on that. As I said earlier, the outlook in terms of the overall demand for these chips from other parts of industries, obviously, cars and phones, may be looking a little better for us. And certainly, people are less likely to allocate away from us. So we're expecting to be able to plan a little more certainty, but we won't be able to sort of publicly give out the exact dates and things like that on those deployments.\n\nOperator\n\nThank you. Our next question is coming from David Bailey from Macquarie. Your line is now live.\n\nDavid Bailey -- Macquarie Group -- Analyst\n\nYeah. Thanks. Hello, everyone. My question is just around consumables and masks and accessories.\n\nAre we expecting increased device output over fiscal '23? Just interested in your thoughts on the impact of that on masks and accessories volumes and what that might mean to masks and accessories revenues. And then, also, do you think the attachment rates on market share, that those incremental revenues would be higher than you may have seen in the past?\n\nMick Farrell -- Chief Executive Officer\n\nYes. Thanks, David. It's a really good question. And I mean, as you saw in the quarter, 11% CC global and 13% CC in the U.S.\n\nin Q4, right, where we're only just starting to ramp up AirSense 10 card to cloud to meet that -- some of that incremental demand gap. Yes, as we talked about every quarter during fiscal '23, we plan to see incremental growth in our volume delivery across the portfolio of AirSense 10 comms, AirSense 11 card to cloud and AirSense 11 comms. And as Rob just described, all those streams that are going to mean we're going to have increased volume every quarter sequentially throughout fiscal '23. And to your question specifically, that does mean that masks and consumables attached to those new patients will add on.\n\nAs you know, a very large double-digit percentage of any quarter's revenue on masks and accessories is ReSupply and recurring revenue of the installed base of patients. And so, that installed base has been incredibly strong. The engagement of people post COVID in respiratory health, respiratory hygiene and making sure that a clean mask, clean humidifier, clean tubing, it's just been full front with everyone wearing masks for COVID and understanding communicable respiratory diseases like COVID makes them think about respiratory health and hygiene. So that's a permanent change we've seen over the last 12, 24 months in sort of secular demand on the installed base.\n\nAnd then, you add to that that sort of lower double-digit number of the new patients coming in, which is picking up as supply goes. So I know you guys have all got models on this, David. You've got a good model. You'll start to see that mask and consumable rate pick up.\n\nIt won't be like a step change jumping up, but there will be a sort of second derivative change, if you like, a little bit of increase in the rate of increase for a while on masks and accessories throughout fiscal year as we get the supply of devices closer and closer to the demand that is out there for these next 12 months, way ahead of where we can get to. But it means every device we make, we sell.\n\nOperator\n\nThank you. Our next question is coming from Mike Matson from Needham Company. Your line is now live.\n\nMike Matson -- Needham and Company -- Analyst\n\nYeah, thanks. I was curious if the card to cloud units are helping your gross margin at all by taking out those -- the other chipsets. I mean, is that resulting in some savings that's having material impact on your margins. Or is it not really the case?\n\nMick Farrell -- Chief Executive Officer\n\nBrett, you want to answer Mike's question?\n\nBrett Sandercock -- Chief Financial Officer\n\nSure, Mick. Yes, Mike. Yes, so the card to cloud, I mean, obviously, doesn't have the comms module in it, so there is some savings there. So it is positive for our margin, but it would really might just be around the edges.\n\nIt wouldn't -- like it wouldn't be material.\n\nOperator\n\nThank you. Our next question is coming from Suraj Kalia from Oppenheimer.Your line is now live.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nGood afternoon, everyone. Mick, I'll throw in a 2-part question, if I could, Mick. For the card to cloud, how much of this shift is tactical and how much of it is strategic? Because the market growth -- you've always referenced 5% to 8% growth for the market. Maybe if you can just parse out how the shift long term would help ResMed's overall device growth.\n\nAnd if I could quickly, Brett, if I take SG&A in FY '22, right, 8% to 9% year over year, and that approximate to about 20% to 22% of revs, my math is around $3.6 billion to $4 billion for FY '23. Is that the right way to think about it? Sorry, gentlemen, for squeezing in the second question.\n\nMick Farrell -- Chief Executive Officer\n\nYes. Very cheeky, Suraj, but we'll go at it. I'll go briefly at the first one, then hand to Brett for the second part of your two-part one question. So the card to cloud, look, it is tactical.\n\nIt's based on the fact that -- for a very important thing. We have people suffocating out there. They get all the way through the healthcare system, screen, diagnosed and then get a prescription, and they're waiting for a device. And we said we're not going to have our strategy, which is 100% connectivity in every device through comms chips, get in the way of the patient needs.\n\nSo it's a tactical pivot based upon the comms chips being in a rate-limiting bottleneck of our supply that we're going to do the AirSense 10 C2C. As soon as that supply moves, we go straight back to 100% connectivity AirSense 10 and AirSense 11 devices. So it's tactical, temporal, and we're going to go back to it. We're going to do the best we can for those patients, and they're going to get incredible adherence, just won't have all the tech of the daily feedback that you get on those devices with Air 11 and the double myAir uptake that you get with AirSense 11.\n\nAnd that's why I want everyone to get an AirSense 11 as soon as we get the components. And our supply chain team knows that, our customers know that, and we're ready to ramp up over the fiscal year. So a tactical shift. Brett, I'll just quickly say on that -- the second part of the question, I think our competitor put out some numbers that they think the market is today and in 2025.\n\nAnd I think they underestimated the actual market today and the market in 2025 by 25%, 30%, even 35%. I think they were talking about $2.1 billion device market in 2025. For me, it's north of $2.5 billion, $2.6 billion, $2.7 billion, even more than that in 2025, if we get our demand gen and drive it. And we're going to get the lion's share of that.\n\nBut Brett, any thoughts?\n\nBrett Sandercock -- Chief Financial Officer\n\nSure. Yes. Suraj. I mean, given some broad guidance, I guess, on the SG&A as a percentage of revenue, I wouldn't get drawn into kind of strict revenue guidance.\n\nI'd just reiterate what we said before. We're expecting an increase in production volumes, and that should definitely support sequential revenue growth through FY '23.\n\nOperator\n\nThank you. Our final question today is coming from Lyanne Harrison from Bank of America. Your line is now live.\n\nLyanne Harrison -- Bank of America Merrill Lynch -- Analyst\n\nI was hoping if you could help us understand the softer device sales in rest of the world a little bit better. Obviously, understanding that you're having that cloud -- card to cloud push in the United States. But can you give us a sense of what the market's like in rest of the world, and what you're seeing from competitors other than Philips in that market?\n\nMick Farrell -- Chief Executive Officer\n\nYes. Thanks, Lyanne. It's a good question, and it's pretty simple, the answer, in that in Q4 of our fiscal '21, we had $20 million of COVID-related ventilator sales in India. And if we can all remember 12 months ago, there was a huge surge of the COVID variant in India, and we sold $20 million of ventilators to Delhi, Bangalore and across the country to save lives.\n\nAnd it was incredible, the way we pivoted and got those $20 million worth of sales out. Justin Leon and his team did a great job of getting to India. So if you subtract that $20 million of COVID sales out there, you actually see a positive growth -- a good positive growth in devices in Europe, Asia and rest of world. And what you're seeing, to the broader part of your question, is actually in countries where they don't have these, I would say, now illogical COVID lockdowns that are happening in a couple of geographies, China and a couple of other countries are sticking with these lockdowns, we're seeing well over 100% rates of patient flow.\n\nAnd so, incredible demand for our products, both on the ventilation side and on the device side, back to where we were, which is mid-single-digit device growth in the device side and high single-digit growth on the masks and accessories. And we're getting even higher than that, as you saw in the numbers, because we're driving share, we're driving demand and we're getting patients out there. So that's what it all is. But no, that Europe, Asia, Rest of the world was really just associated with those ventilator sales.\n\nOperator\n\nThank you. We reached the end of our question-and-answer session. I'd like to turn the floor back over to Mick for any further closing comments.\n\nMick Farrell -- Chief Executive Officer\n\nThanks, Kevin, and thanks again to all our shareholders for joining us on the call today. I'd like to once again take the opportunity to thank all 8,000 ResMedians, many of whom are also shareholders. And thank you for your hard work, your dedication, helping over 141 million people sleep better, breathe better and live better lives outside the country in over 140 countries worldwide. Thanks for what you do today and every day.\n\nI look forward to talking with all of our stakeholders here on our earnings call in about 90 days, plus or minus. And with that, I'll hand over to Amy.\n\nAmy Wakeham -- Vice President of Investor Relations and Corporate Communications\n\nGreat. Thanks, Mick, and thanks, everybody. We do appreciate your time and your interest. And if you have any additional questions, please don't hesitate to reach out directly to investor relations.\n\nThis does conclude our fourth quarter fiscal year 2022 conference call. Kevin, I'll turn it back to you to close things out.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAmy Wakeham -- Vice President of Investor Relations and Corporate Communications\n\nMick Farrell -- Chief Executive Officer\n\nBrett Sandercock -- Chief Financial Officer\n\nCraig Wong-Pan -- RBC Capital Markets -- Analyst\n\nRob Douglas -- President and Chief Operating Officer\n\nChris Cooper -- Goldman Sachs -- Analyst\n\nSean Laaman -- Morgan Stanley -- Analyst\n\nMaggie Boeye -- William Blair and Company -- Analyst\n\nMatthew Mishan -- KeyBanc Capital Markets -- Analyst\n\nSteve Wheen -- Jarden -- Analyst\n\nDavid Low -- JPMorgan Chase and Company -- Analyst\n\nGretel Janu -- Credit Suisse -- Analyst\n\nSaul Hadassin -- Barrenjoey Capital -- Analyst\n\nDan Hurren -- Marquee Research -- Analyst\n\nDavid Bailey -- Macquarie Group -- Analyst\n\nMike Matson -- Needham and Company -- Analyst\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nLyanne Harrison -- Bank of America Merrill Lynch -- Analyst\n\nMore RMD analysis\n\nAll earnings call transcripts"
}