{
  "companyName": "Teva Pharmaceutical Industries",
  "companyTicker": "TEVA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/teva-pharmaceutical-industries-teva-q3-2022-earnin/",
  "content": "Teva Pharmaceutical Industries (TEVA -2.35%)\nQ3 2022 Earnings Call\nNov 03, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Teva's third quarter 2022 financial results conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to our first speaker today, Ran Meir, senior vice president, head of investor relations.\n\nRan Meir -- Senior Vice President, Investor Relations\n\nThank you, Nadia. Thank you, everyone, for joining us today to discuss Teva's third quarter 2022 financial results. We hope you have had an opportunity to review our earnings press release, which was issued earlier this morning. A copy of this press release as well as a copy of the slides being presented on this call can be found on our website at tevapharm.com.\n\nPlease review our forward-looking statements on Slide 2. Additional information regarding these statements and our non-GAAP financial measures is available on our earnings release and in our SEC Forms 10-K and 10-Q. To begin today's call, Kare Schultz, Teva's CEO, will provide an overview of the first quarter performance, recent events, and priorities going forward. Our CFO, Eli Kalif, will follow up by reviewing the financial results in more detail.\n\nincluding our 2022 financial outlook. Joining Kare and Eli on the call today is Sven Dethlefs, Teva's head of North America business, who will be available during the question-and-answer session that will follow the presentation. [Operator instructions] And with that, I will now turn the call over to Kare. Kare, if you would, please?\n\nKare Schultz -- Chief Executive Officer\n\nThank you, Ran, and welcome to all of you. Let's take a look at the highlights for the third quarter. We came in with revenue of $3.6 billion, and our adjusted EBITDA came in at $1.1 billion. The GAAP diluted earnings per share were $0.05 and the non-GAAP diluted earnings per share were $0.59.\n\nWe did see significant headwinds on the revenues in Q3 on itself, we had a net impact of $215 million. And year to date, we've seen an impact of $510 million. That's, of course, compared to 2021. And just to give you an idea about how you can think about it, we have an estimated guidance on the revenue of, let's make it simple, $15 billion.\n\nHalf of that is U.S. dollar sales in the U.S. more or less and half of it is non-U.S. dollar sales.\n\nAnd the dollar has been strengthening against nearly every currency. So if you imagine, we have half the revenues, $7.5 billion, and that's strengthening, let's say, 1%, then that means that our revenues go down by $75 million. So each percent increase of the U.S. dollar is a $75 million reduction on our revenue.\n\nAnd of course, then when you get to operating profit, it's less of an effect. There's some offsetting elements. So it's roughly $20 million reduction in U.S. dollar operating profit for each percent that the dollar strength, just so you get an idea about it.\n\nFree cash flow came in nicely at $685 million, and we continue to reduce our debt in accordance with our strategic aim, and we are now down to $19 billion, first time in many years that we are below $20 billion, which is really nice to see. Now the revenues are still affected by the strengthening of the dollar, and the dollar remains strong here in the beginning of the fourth quarter, so we've adjusted our guidance on revenues, but we have been able, through a lot of measures, to keep our guidance on the adjusted EBITDA, adjusted EPS, and free cash flow. So we are reaffirming that guidance and Eli will talk more about that later. Both Austedo and Ajovy are doing very fine.\n\nWe'll take a look at that in a couple of minutes. And in Europe, we've seen a good development of the business. So net of the exchange effect I just talked about, we've seen 5% growth in our generics and OTC revenue in Europe. And that's, of course, reflecting our strong position there and also some good new product launches.\n\nWe have also seen substantial progress on the nationwide opioid settlement. And in just a few minutes, I'll give you some more details on that. And then on the U.S. generic drug antitrust litigation, we have made some more settlements.\n\nThese are of a lower size. So roughly around $1 million per 1% in the U.S. population. And lately, we have settled in Georgia and Arkansas and we expect to see more of that in the coming months.\n\nSo let's move on to the opioid litigation updates. So as you remember, we have reached an agreement in principle some months ago, and we've accrued for that in our half-year earnings, so that's really unchanged. We still have that accrual, and we've been having a lot of progress on that. So in the coming period, we expect to initiate the actual process of having the opt-ins and opt-outs and so on, on both the State level and on the subdivision level.\n\nWe have also completed the details of our agreement with Allergan, and that was already part of the overall accrual that we did at the half year, but that's now sort of been done in details crossing the Ts and dotting the Is. We have also, as you might have seen, concluded a settlement with New York, which ends the litigation in New York. And it's done in the way that New York basically signs on to the national agreement, which has a certain value. And then they also get what you call a trial bump because they have a verdict against us.\n\nThey get some extra money. And what's important for us is, of course, that the national agreement is what we already had accrued for. We had also accrued for the premium for New York, most of it, and we now have an arrangement where the extra money they get, they get it over 18 years, which is good for us because it means that it's very manageable in relation to our cash flow and our debt situation. So we are quite satisfied with that outcome.\n\nAnd then as I said, we are looking into that in the coming period, at some point in time, we'll have to go through in the normal process of states opting in and then the subdivisions opting into the nationwide agreement. And we are quite optimistic that we will get a very, very high number of states and subdivisions joining. And in that way, we will put the majority of opioid litigation behind us to the benefit, hopefully, of the U.S. people and also good for us as a company so that we can focus on the future.\n\nNow talking about the future, let's look at the current situation on revenue and how it's been developing. And I'd like to just point to the latest chart here -- the latest bar here. You can see that it's roughly $3.6 billion, as we just talked about, and if you had the $215 million that we lost on exchange rates, you see it sort of gets to the $3.8 billion range, which is very similar to where it's been sort of up and down over the last many quarters. So the main change here is really that we have seen this appreciation of the U.S.\n\ndollar. Other than that, we have a very stable business in all the different areas of our business. But let me just comment on our two key products, Austedo first. So you will see here that Austedo grew 30% versus last year to $260 million, and we see a very strong development continue on Austedo with nice increase in both revenues and in prescriptions and also in patients and number of doctors writing the product.\n\nSo all in all, it's looking very positive, and we are on track to reach around $1 billion in sales in 2022. So that's very positive. And of course, very nice to see more and more people being treated also for tardive dyskinesia with this nice drug. If we move to Ajovy, then we also here have a very nice positive development.\n\nYou can see the scripts in the U.S., the TRX keep on growing. You can see here how the market share in Europe is nearly 33%. In U.S., it's around 25%. And as you know, we recently launched with a partner in Japan, and they are already up to 28%.\n\nSo as I've said before, we have a target here that we want to get at least to a vertical market, 33%. And I think it's fair to tell you that I've already told Europe that, that's getting too easy now. So they have a new target of 50%, which is exciting, of course, for them and me. Now if we go on to cost management, then of course, there's a lot of discussions about inflationary pressure and so on these days, and of course, we also have some inflationary pressures on things like energy and other elements of our manufacturing cost base.\n\nWe are trying to compensate by being more efficient. And as you know, we've had a strong efficiency drive for the last five years. We're continuing that. And that is, to some extent, you could say, taking the worst out of the inflationary pressure.\n\nAnd here, you can see that we are year to date 27.3% in operating margin, and we are very committed to and feel very secure about reaching the 28% next year, which is our 2023 end-of-year target. The net debt continues to decline. And just a little fun fact here. Over the last five years, we have paid $20 billion of cash to the bondholders.\n\nThe $15 billion, that's the reduction in the debt and the $5 billion is, of course, roughly $1 billion in interest rate every year. So $20 billion out of the accounts from us to them, and we will continue to do that until we get the debt down and we get the interest rate payments down in parallel, of course. So on the pipeline, if we take a look at that, then I think I'll only comment on one key event, and that is that we've just refiled risperidone LAI for schizophrenia. And we are very optimistic about it.\n\nWe did a complete quality check of all our clinical data. It looked good, and we refiled it with FDA and hope to be able to launch this product sometime during the first half of next year. If we look at another element of our business, our ESG ratings, then, of course, you all know that a lot of elements go into this environmental, social and governance ratings and all the ratings are a little different. And we've been able to improve all of these, which we're very happy about.\n\nIt goes well hand-in-hand with the sustainability-linked bonds, where we did the $5 billion refinancing a year ago. So we're happy to see this continued improvement. Some of the scales are where you want to have a higher number, others you want to have a low number. But I can tell you that all of these five important ESG ratings have been improved during the last 12 months.\n\nTo reiterate our long-term financial targets that we communicated a quarter ago, we have four targets. One is the operating income margin. We want to keep on driving it up and get to 30% in 2027. We need, of course, to keep on driving debt down.\n\nYou just saw that it's also on a steady track there. We need to get to around two times net debt-to-EBITDA in 2027, and we will do that. The cash earnings, of course, have to stay around 80% in order to be able to get the debt down. And then we are committed to revenue growth and that basically means that we will do it in a combination of organic revenue growth and selected project or product in-licensing to secure that we see revenues going forward.\n\nWe are committed to utilizing the cash flow to pay down debt and we do not plan to raise equity. So with that, I'll hand over to Eli Kalif.\n\nEli Kalif -- Chief Financial Officer\n\nThank you, Kare, and good morning and good afternoon to everyone. I will begin my review of the third quarter of 2022 financial results on Slide 15, starting with our GAAP performance. Revenues in the third quarter of 2022 were $3.6 billion, representing a decrease of 8% or 2% in local currency terms compared to the third quarter of 2021. The decrease in revenues was mainly driven by foreign exchange headwinds in both of our European and international markets businesses.\n\nIn North America, a strong uplift of Austedo partially compensated a decrease in revenues in our generics business, Copaxone and Bendeka, and Treanda. In Q3 2022, we recorded a GAAP operating income of $419 million, compared to $623 million in Q3 2021. GAAP net income of $56 million, compared to $292 million in Q3 2021, and a GAAP earnings per share of $0.05, compared to $0.26 in the same period a year ago. The year-over-year decline of a GAAP operating income, net income, and earnings per share was mainly driven by higher legal settlements and loss contingencies as well as lower gross profit and was partially offset by lower operating expenses.\n\nIn recent months, the global economy has been impacted by fluctuating foreign exchange rates. Approximately 47% of our revenues are denominated in currencies other than U.S. dollars. The strengthening of the U.S.\n\ndollar versus other currencies in which we operated negatively impacted our revenues, results of operations, profit, and cash flows. As Kare discussed earlier, the continued strengthening of the U.S. dollar versus other currencies during the third quarter of 2022, net hedging effect negatively impacted revenues and GAAP operating income by $215 million and $53 million, respectively, compared to the third quarter of 2021. On a year-to-date basis, we saw the same trend regarding U.S.\n\ndollar appreciation, which net of hedging effect negatively impacted revenues by $510 million compared to the first nine months of 2021. And that was a result of the impact of a stronger U.S. dollar, especially versus the euro. I will further discuss the macroeconomic environment as part of a non-GAAP financial outlook review.\n\nTurning to Slide 16. You can see that net non-GAAP adjustment in the third quarter of 2022 were $602 million versus $360 million in Q3 2021. We recorded a legal settlement and loss contingencies of $195 million. This was mainly related to an update of the estimated settlement provision recorded in connection with the remaining opioid cases as well as an estimated provision recorded for the claims brought by Attorney Generals representing states and territories throughout the U.S.\n\nin the generic drug antitrust litigation. Additional notable non-GAAP adjustments include amortization of purchased intangible assets totaling $165 million, the majority of which is included in the cost of goods sold. Moving to Slide 17 for review of our non-GAAP performance. I've already discussed our third quarter revenues, which totaled approximately $3.6 billion.\n\nNow let's move down the P&L and look at the margins. Our non-GAAP gross profit margin was 53%, compared to 53.6% in Q3 2021. The decrease in non-GAAP gross profit margin was mainly driven by macroeconomic headwinds affecting our operation costs as well as lower revenue from Copaxone, partially offset by higher revenue from Austedo and a favorable mix of generic products in our Europe segment. Our non-GAAP operating margin improved to 27.2% versus 26.8% in Q3 2021.\n\nThis increase was driven mainly by lower spend base, which I will discuss in the next slide. We ended the quarter with a non-GAAP earnings per share of $0.59, flat compared to Q3 2021. Now let's take a look at our spend base on Slide 18. As you can see, our quarterly spend base declined by $227 million or by $70 million net of FX impact.\n\nLooking at our total spend base, on a year-to-date basis, it declined by $594 million or $212 million net of FX. We continue with our ongoing efforts to transform our global operational network and ongoing activities management of operating expenses. We continue to face a strengthening of the U.S. dollar versus other currencies as well as spend increase due to inflationary pressures as we keep focusing our efforts on reducing and optimizing our cost of goods sold.\n\nWe expect the overall annual spend base to decrease to $11 billion in 2022. As I have mentioned in previous quarters, these ongoing efforts are expected to continue to help us partially mitigate the global macroeconomic headwinds, including inflation and higher cost of labor, and eventually lead to stabilizing our operating margin at the level of 28% in 2023 with an ultimate goal of 30% operating margin by end of 2027. Turning to free cash flow on Slide 19. Our free cash flow in the third quarter of 2022 was $685 million.\n\nAs I've mentioned in the past, Teva's free cash flow tends to face headwinds at the start of the year. In addition, we faced challenges due to a timing of certain items related to our working capital as a result of operational ramp-up in relation to our annual production plan. The decrease in our free cash flow in the third quarter of 2022 compared to the third quarter of 2021 resulted mainly from changes in working capital items, primarily a lower reduction in our inventories level compared to the third quarter of 2021. Today, we are reaffirming our 2022 free cash flow guidance, which we initially provided in February.\n\nOur 2022 free cash flow is expected to be in the range of $1.9 billion to $2.2 billion. We expect the free cash flow generation will pick up during the fourth quarter as we continue to drive working capital improvement. We remain on track to achieve our objective of 80% or greater free cash flow conversion by the end of 2023 as part of our ongoing long-term financial targets. Turning to Slide 20.\n\nOur net debt at the end of Q3 2022 was $19 billion, compared to $20.9 billion at the end of 2021. The decrease in our gross debt is related to the bond maturities paid in Q3 2022 as well as the positive effect of exchange rate fluctuation. Our net debt-to-EBITDA ratio decreased coming at four times for Q3 2022. We expect it to further decline as we continue to make progress toward our long-term targets.\n\nDebt reduction continues to be our primary focus and main use of cash. Upcoming maturities, including approximately $0.7 billion in the remainder of 2022. So now turning to our non-GAAP financial outlook for 2022 on Slide 21. I described earlier how the strengthening of the U.S.\n\ndollar versus other currencies in which we operated negatively impacts our revenue, earnings, and cash flow. Additionally, high levels of inflation have recently resulted in significant economic volatility and monitoring tightening by central banks. We have implemented certain measures in response to such macroeconomic pressures and are continually considering various initiatives to allow us to mitigate and offset the impact of these macroeconomic factors. The higher costs we have experienced during the recent period have already impacted our operations and will likely continue to have an effect on our financial results.\n\nAt current rates, we still expect the fluctuation related to the strengthening of the U.S. dollar versus other currencies to have an unfavorable impact on revenues. And therefore, consistent with what we had communicated in July, at this time, it's prudent to adjust our guidance range for our full revenue from the previous range of $15 billion to $15.6 billion to the new range of $14.8 billion to $15.4 billion. This lowers the midpoint of our range by $200 million.\n\nWe are reaffirming our full year 2022 guidance range for operating income, EBITDA, earnings per share, and free cash flow. Although we were able to absorb some of the inflationary pressures this year and partly mitigated certain spend categories, we may still face volatile environment and, as such, we are keeping the broader outlook range for these items. This concludes my review of several results for the third quarter of 2022. And now we will open the line for Q&A.\n\nOperator, if you will, please.\n\nOperator\n\nThank you. [Operator instructions] We will now take the first question. It comes from the line of Elliot Wilbur from Raymond James. Please go ahead.\n\nYour line is open.\n\nElliot Wilbur -- Raymond James -- Analyst\n\nThanks. Good morning. Just first question on free cash flow and maybe just thinking a little bit about longer-term dynamics there. And just trying to incorporate the pending opioid litigation settlements and sort of think about what could potentially be a new floor on that number.\n\nWe've kind of, I guess, sort of put -- I've been thinking about a floor in terms of free cash flow around $2 billion and obviously expecting somewhere north of $350 million to be paid out annually in connection with the settlement. But in thinking about sort of what could be the new floor over the next couple of years, I mean, is it reasonable to subtract that from sort of the lower end of the baseline number that we've been talking about for the last couple of years of $1.9 billion to $2.2 billion? Or do you still think that it's reasonable to assume that, that $2 billion floor is defensible going forward even with the litigation settlements? And then if I could just ask you to provide some more granularity or color into performance trends within the North American segment, specifically thinking about biosimilar trends and then obviously, what's happening with respect to U.S. generics because certainly, the number was quite a bit below expectations. So just trying to get a little bit more insight into the dynamics there.\n\nKare Schultz -- Chief Executive Officer\n\nThanks, Elliot. So I'll give you a quick answer on the free cash flow, and then Sven will give you some more details on North America and the biosims and generics. So the free cash flow that we are expecting in the coming years is that you're talking about. So at the level of $2 billion.\n\nAnd that is taking into account what you also mentioned quite correctly, someplace close to $350 million cash outlay through the year. And we don't see any dramatic changes to that. The whole nationwide agreement is based, as you know, on a 13-year payment schedule with equal installments. And actually, the New York settlement that we just did is partly the nationwide and partly an even longer payment schedule of the trial bump, you can call, which is over 18 years.\n\nSo that's not putting additional pressure on our cash flow. But I can also just ask Eli for if you have a quick comment, and then we'll move on to Sven.\n\nEli Kalif -- Chief Financial Officer\n\nThanks, Kare. Yes, Elliot. Thanks for the questions. I think that part of our plans to reach the 80% cash conversion is also a management of working capital.\n\nSo you can say that, that level that Kare mentioned around $2 billion it's a kind of a combination of our efforts to generate more cash on working capital improvements as well as from the business. So I will say that we are safely there.\n\nKare Schultz -- Chief Executive Officer\n\nThanks. And then, Sven, if you comment on North America sales.\n\nSven Dethlefs -- Head of North America Commercial\n\nYes. Hi, Elliot. So for North America sales, the sales came in below our run rate or a target run rate of $1 billion. I think we said in the last quarter that we had a strong first half with the launch of generic Revlimid, resulting in sales above this run rate.\n\nIn the second half of 2022, we do not have any significant additional launches. For that reason, the generic sales run rate is below this $1 billion. This will only improve in 2023 when we anticipate more launches into the U.S. generics business.\n\nOther than this, our biosimilar sales were quite stable in Q3. We have a stable volume market share in the U.S. business that has stabilized over the last month. And on the generic price erosion level, I think also here, we see some improved rates as compared to what we've seen a year ago.\n\nIt is an incremental stabilization across various product categories. We always analyze it by different product categories. And we expect this to continue in 2023. So we have on the price erosion side, I think, a stable outlook.\n\nAnd on the sales side, as I said, it will improve with more product launches coming into our generics business.\n\nKare Schultz -- Chief Executive Officer\n\nThank you, Sven. Let's have the next question.\n\nOperator\n\nThank you. We will now take the next question. It comes from the line of Glen Santangelo from Jefferies. Please go ahead.\n\nYour line is open.\n\nGlen Santangelo -- Jefferies -- Analyst\n\nYeah. Thanks and good morning. Thanks for taking the question. Kare, I just wanted to talk and go back to some of your long-term targets.\n\nI think what investors are really focused on here is trying to understand the transition of the growth algorithm on the revenue side back into positive territory. And you gave a lot of detail last quarter about the 13 biosimilars in development. We didn't really talk much on this call about the biosimilar for Humira potentially coming in the middle of next year. To the previous question, you were just talking about the wave of sort of generics that are coming over next year and actually the next four years, I think you sort of laid out on the last call.\n\nAnd so I was wondering if you could maybe give us a little bit more detailed thoughts around that growth algorithm and what it will take to sort of inflect the revenues back into positive territory. And if you have any early thoughts on 2023, not that you want to give guidance or anything, but how we should think about that sort of revenue transition taking into consideration the continued headwinds from Copaxone and the generics in North America. Thanks.\n\nKare Schultz -- Chief Executive Officer\n\nYes. Thanks, Glen. Good question. So let me give you a bit more details and some of it is, of course, a repeat of what I explained already a quarter ago.\n\nSo if you look at the generic piece of the revenues, then first of all, we have a stable business outside the U.S., which will have single-digit positive growth. So that's Europe, that's international markets. As you know, the pricing there is quite stable. We are in the top 3 in all the European markets and also doing well in international markets.\n\nSo that piece is sort of growing, you could say, low single digit, and that's very stable. Then we have the U.S. marketplace where we will, in the coming years, have a substantial number of biosimilar launches. Next year, we can just mention, as you said, biosimilar Humira, potentially biosimilar Stelara.\n\nAnd of course, you never know exactly how it plays out. You never know how -- exactly how big a share you get. But we think we're the -- if not the best, then one of the best to manage the whole commercial part of a biosimilar launch. We think we've proved that with Truxima, has done substantially more than $1 billion in sales already.\n\nSo we think we know how to do it, and we've got the products coming in. We also have quite a number of complex generics, some we've been waiting for a while to get the FDA approvals, others are just coming on now. And we are quite optimistic about getting some of those approvals as well. So that, of course, on the generic side adds to a positive also single-digit growth on generics.\n\nAnd then the last piece is of course on the innovative products where you're absolutely right that Copaxone will continue to decline. But as you've also just seen today, Austedo and Ajovy will continue to increase. And just a little fun fact. Last year, the Copaxone that's declining was roughly equal to Austedo and Ajovy that's increasing combined.\n\nSo I think Copaxone did $1 billion. The other two together did $1.1 billion, something like that. This year, as you've just seen in the guidance, Copaxone will be around $700 million. The two others combined will be about $1.4 billion.\n\nSo that shows you that now we're getting to the point where it's like instead of Copaxone being the biggest one and then getting to be the same, about half of what Austedo and Ajovy is doing, which basically means that in the coming years, that dynamic year by year will get better. This year, it's close to breakeven. You could say the loss on Copaxone is the same as the gain. But in the coming years, the gains on Austedo and Ajovy will be bigger than the losses on Copaxone.\n\nAgain, that will contribute to growth in the innovative medicines. And then, of course, risperidone LAI, assuming that we get that launched, which I'm very optimistic about in the first half of next year, that will also contribute to growth. So all in all, all these different elements are pointing in the right direction, toward what we mentioned, which is single-digit growth in 2027 on the revenue line. Thank you for the question.\n\nGlen Santangelo -- Jefferies -- Analyst\n\nThanks for the detail.\n\nOperator\n\nThank you. [Operator instructions] We will now take the next question. It comes from the line of Umer Raffat from Evercore. Please go ahead.\n\nYour line is open.\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nGood morning, guys. Thanks for taking my question. I wanted to [Technical difficulty] on biosimilar Humira. Do you think you need an inspection to get the approval on the upcoming BsUFA? Or do you think you can get an approval without a new FDA inspection? And can you confirm for us that the interchangeable version is the one that has the BsUFA coming up, not the one that had the zero.\n\nAnd secondly, this 749 schizophrenia molecule that's now in Phase 3, can you tell us a little more about what the molecule is and what you've seen in Phase 1 because it was not on clinic trials. Thanks very much.\n\nKare Schultz -- Chief Executive Officer\n\nThank you very much. I will have Sven answer you on Humira and interchangeability and inspections and so on. And then I'll tell you about the antipsychotic that's going into Phase 3.\n\nSven Dethlefs -- Head of North America Commercial\n\nThe second question was on the interchangeability action dates. The action date that is coming up in December is on the interchangeability BLA. And the other question was whether there is a side reinspection necessary. So just as a reminder, the file, and the FDA interactions are managed by Alvotech, not by us.\n\nAnd I believe Alvotech already published that they are in discussions with the FDA about the site reinspection and how it will be conducted.\n\nKare Schultz -- Chief Executive Officer\n\nThank you, Sven. And on the 44749, that is a long-acting version of olanzapine, and it's very promising. As you know, it's the same prolongation methodology that's been used for risperidone LAI. And I'm sure you've seen the Phase 3 data there, which are excellent, both for once monthly and once every second-month therapy.\n\nAnd as we all know, there's a big need for better long-acting therapies for schizophrenia, simply due to the fact that that's a way to secure adherence. And any relapse in schizophrenia has a potential damaging effect on the cognitive capabilities of the patients. And with olanzapine, there's been a warning for a, you could say, drowsiness syndrome, you basically fall asleep. And that's because if you take a long-acting olanzapine, then it's an intramuscular injection, that's a risk that the drug gets in your bloodstream and that you simply faint or fall asleep.\n\nSo for that reason, right now, you have to sit three hours in the doctor's office and wait after you get the injection, which means that very few people actually use it. On the other hand, we are developing a subcutaneous version here, where we think there'll be no risk of this, which means it will be a lot more convenient, easy to use for the nurse or the doctor for the patient. So we're very excited about that. Thank you for the questions.\n\nNext questions, please.\n\nOperator\n\nThank you. We will now take the next question. One moment, please. And the next question comes from the line of Jason Gerberry from Bank of America Securities.\n\nPlease go ahead. Your line is open.\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking my questions. Just a follow-up on the biosimilar Humira situation. As we think specifically about 2023, if approval does get pushed into maybe the second quarter or middle of next year, is there a risk that, from a contracting perspective, you're unable to participate in the market, specifically in 2023? Or do you see that as a dynamic process that will kind of reopen for bidding every quarter? And then just a follow-up on the rising European energy cost dynamic, how that impacts your business, could you give us a sense? I assume that most of that's going to be in your COGS line.\n\nAnd what proportion of your business is more exposed to these inflationary pressures? Just trying to get a sense of how to put in context your commentary about increasing efficiency to sort of mitigate those headwinds. Thanks.\n\nKare Schultz -- Chief Executive Officer\n\nThanks. Again, Sven will give you the outlook on biosimilar Humira and then I'll talk to you about the energy cost.\n\nSven Dethlefs -- Head of North America Commercial\n\nSo on the biosimilar Humira, we are in talks with our customers, the three large PBMs, and all other customers for the commercial side of the business to contract for 2023. All these preparations run according to plan. We are also preparing according to plan our marketing and sales and supply chain strategies. So that's all on track.\n\nAnd we are working closely with Alvotech to make everything work to be launch ready by July 1st. So in the contracting itself, of course, you only contract once you launch in July. This is how the settlement agreements with Epi have been structured. And then I don't expect that we will see in biosimilars a quarterly renewal of bids or businesses like you see on the generic side because the customer is different, it's PBMs and not the big co-selling groups that you contract with.\n\nAnd secondly, the supply chain and how the supplies work are too, I would say, complicated to allow fast switchovers between different biosimilars. So once you are in the business, you should be, let's say, enjoying the business for a longer period like -- or as compared to generic spending that we see in the U.S. generics market.\n\nKare Schultz -- Chief Executive Officer\n\nThank you, Steven. On the energy cost, and that's, as you said, specifically in Europe, that's an issue. Then let me, first of all, make it very clear that all our factories have taken precautions and done modifications to energy systems and so on, so that we can continue operating uninterrupted despite the changes in the European energy markets. We have also secured supplies of various types of energy, including the gas that we need, the oil that we need, and so on.\n\nThere's an inflationary effect this year, which is included in our numbers. And as you said, it's in the COGS line -- cost of goods sold line. And to some extent, that is modified by some of the hedging we do on our energy contracts next year. We have also made sure to contract most of our energy, of course, at somewhat higher prices.\n\nYou have noticed that the prices have been coming down again over the last month or so after a peak. So we are seeing things relatively normalizing. Of course, some of the efficiency gains we are doing will be eaten up by this that has happened already this year to the extent we've been covering these increased costs and it's going to happen again next year. It's not dramatic.\n\nIt's something we can manage. And as I said, from an operational point of view, we are completely safe. And from a cost point of view, we're doing our best to reduce the total impact of these increases in energy prices. Thanks for the question.\n\nNext questions, please.\n\nOperator\n\nThank you. We will now take the next question. It comes from the line of Gary Nachman from BMO Capital. Please go ahead.\n\nYour line is open.\n\nDenis Reznik -- BMO Capital Markets -- Analyst\n\nHi. Good morning. This is Denis Reznik on for Gary Nachman. Thank you for taking our questions.\n\nJust in regards to business development, can you talk about the characteristics of potential assets you're looking at and kind of where and how they fit into the overall pipeline? And then if you can just kind of quantify and classify the current BD landscape in general. Are there many interesting assets out there worth in-licensing?\n\nKare Schultz -- Chief Executive Officer\n\nSo thanks for that question. So in the BD area, what we're really looking for is we're looking for individual products or individual projects that will fit nicely with the portfolio. We have both our R&D portfolio, which is focused on neuroscience and immunology, and our commercial portfolio, which is quite broad. So we are not looking to buy companies.\n\nWe don't have the money for it. We don't have the appetite for it. But we are looking to find products that will fit nicely with our commercial footprint already. And we've done quite a number of deals.\n\nIf you might have noticed, we have done deals in the biosimilar area. We just talked about the Alvotech deal. We've also done deals in Europe on biosimilar Lucentis recently. We've done deals with different research group on earlier projects such as Modak, where we're looking into neuroscience and other exciting deals.\n\nSo that's really what you should think about that we are looking for project or product-specific deals that can strengthen our portfolio, either in the marketplace to drive revenues shorter term or in our R&D portfolio. Thank you for the question. Next question, please.\n\nOperator\n\nThank you. We will now take the next question. And it comes from the line of Ashwani Verma from UBS. Please go ahead.\n\nYour line is open.\n\nAshwani Verma -- UBS -- Analyst\n\nHi. Good morning. Thanks for taking our questions. So I have two.\n\nOne is just this Alvotech partnered biosimilar products like Stelara and Ilea. Are they coming from the same facility? Is that something that needs to be resolved as well? That's first. And then the second one on Austedo, so I wanted to check on the DTC since it's a very promotion-sensitive market, I know you launched a campaign in mid-2021. Has that been renewed? Or do you intend to continue DTC because this is an important drug in your portfolio, and I think your competitor is making a lot of investment on the DTC front.\n\nKare Schultz -- Chief Executive Officer\n\nThank you for those two questions. Sven will handle both of them.\n\nSven Dethlefs -- Head of North America Commercial\n\nYes. So the Alvotech facility or the products that you mentioned Stelara, Ilea and Humira, and the others that we contracted, the drug substance is manufactured in the same facility that is also now subject to this FDA discussion on Humira. The drug product itself, the manufacturing is in several locations and with several subcontractors set up in Europe. We reviewed the setup.\n\nI think it's adequate to supply us. And we are also confident that the FDA discussion will turn out positive in the end. So that's on track. On the question on Austedo.\n\nSo we did not continue our TV campaign. We had a very effective TV campaign. But in Q3, we did not continue it. We analyze that our targets of patient activation and an expansion of our prescriber base have been achieved, and our analysis suggests that we can generate the best return of our marketing investments in our downstream, moving from patient activation to the area of sales force effectiveness, sales force deployment, the patient titration, and adherence management.\n\nAnd that does not exclude, of course, that we would return to TV. But at the moment, we believe we get the highest return on marketing spend in downstream activities. Thank you for the question. Next question, please.\n\nOperator\n\nThank you. We will now take the next question. It comes from the line of David Amsellem from Piper Sandler. Please go ahead.\n\nYour line is open.\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nThanks. So I just wanted to drill down on product concentration in the North American generic business. What portion of the business comes from the EpiPen generic and also Truxima? And I guess where I'm going with this is, I'm trying to get a better read on to the relative importance of those two products to the business. How are you thinking about the competitive landscape for Truxima going forward? And then same question on EpiPen, bearing in mind that there are some companies developing some noninjectable alternative dosage forms of epinephrine, how you're thinking about that as well? Thank you.\n\nKare Schultz -- Chief Executive Officer\n\nThank you for that question. I'll pass it on to Sven.\n\nSven Dethlefs -- Head of North America Commercial\n\nYes. Thank you for the question. So Truxima and EpiPen are, of course, core anchors in our generics portfolio. I would say we have another -- if you do an ABC analysis about the sales and the gross margin that we generate in generics out of the around about 300 products that we have in North America.\n\nAnd then, of course, we have the Canadian business as well. we have, I believe, a healthy and very classic concentration of anchor products like Truxima and EpiPen. We have a couple of inhaler products. So asthma products, they are anchor products as well, and patches and complex injectables.\n\nSo that's quite good, I would say, a healthy portfolio distribution, and they are very stable and resilient. And that is also one of the reasons why Teva in its pipeline for North America is committed to the development of complex generics, among them, many of them that we already discussed here; Forteo, Restasis and so forth. Because we believe that over time, you can drive a very stable and resilient generics business with these type of complex products.\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nAnd the second question was just on the competition. Is anything expected on EPI and --\n\nSven Dethlefs -- Head of North America Commercial\n\nOn EpiPen, I don't think that we will get a generic substitutable EpiPen, the second one, our third one into the market. I think here, the competition is more happening with the products that are [Inaudible] developments that come with new modes of action or different convenience for the patients. So that, of course, will also find its market. But EpiPen as a brand in our generic are, of course, very well established in this category as the market leaders, and everybody knows how to use them.\n\nAnd for that reason, we don't see a dramatic shift in market share distribution in this category.\n\nKare Schultz -- Chief Executive Officer\n\nYeah. And then on Truxima, we can just say -- Sven has already alluded to, we have a stable market share. We're very happy about the performance there, and we don't expect any major upheavals in that market. So thank you for the questions.\n\nNext question, please.\n\nOperator\n\nThere are no further questions on the phone at this time. Please continue.\n\nKare Schultz -- Chief Executive Officer\n\nThank you very much. Thank you, everyone, for listening in, and have a nice day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRan Meir -- Senior Vice President, Investor Relations\n\nKare Schultz -- Chief Executive Officer\n\nEli Kalif -- Chief Financial Officer\n\nElliot Wilbur -- Raymond James -- Analyst\n\nSven Dethlefs -- Head of North America Commercial\n\nGlen Santangelo -- Jefferies -- Analyst\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nDenis Reznik -- BMO Capital Markets -- Analyst\n\nAshwani Verma -- UBS -- Analyst\n\nDavid Amsellem -- Piper Sandler -- Analyst\n\nMore TEVA analysis\n\nAll earnings call transcripts"
}