{
  "companyName": "Paycor HCM, Inc.",
  "companyTicker": "PYCR",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/paycor-hcm-inc-pycr-q4-2022-earnings-call-transcri/",
  "content": "Paycor HCM, Inc. (PYCR -0.20%)\nQ4 2022 Earnings Call\nAug 23, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Paycor fourth quarter and full year earnings call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to your host, Rachel White, vice president of investor relations.\n\nRachel White -- Vice President, Investor Relations\n\nGood afternoon, and welcome to Paycor's earnings call for the fourth quarter of fiscal year 2022, which ended on June 30. On the call with me today are Raul Villar, Jr., Paycor's chief executive officer; and Adam Ante, Paycor's chief financial officer. Our financial results can be found in our press release issued today, which is available on the Investor Relations section of our website. Today's call is being recorded, and a replay will be available on our website following the conclusion of the call.\n\nStatements made on this call include forward-looking statements related to our financial results, products, customer demand, operations, the impact of COVID-19 on our business and other matters. These statements are subject to risks, uncertainties and assumptions and are based on management's current expectations as of today and may not be updated in the future. Therefore, these statements should not be relied upon as representing our views as of any subsequent date. We will also refer to certain non-GAAP financial measures and key business metrics to provide additional information to investors.\n\nDefinitions of non-GAAP measures and key business metrics and a reconciliation of non-GAAP to GAAP measures is provided in our press release on our website. With that, I'll turn the call over to Raul.\n\nRaul Villar -- Chief Executive Officer\n\nThank you, Rachel, and thank you all for joining us to discuss Paycor's fiscal fourth quarter and full year results. Revenue growth continued accelerating, culminating with 26% growth for the quarter, our highest and recent record, and 22% growth for the year. We exceeded the top end of our revenue and profitability guidance by 7% and over 100%, respectively. In our first year as a public company, we have consistently demonstrated revenue growth acceleration, and following two years of significant investments in our client experience, started expanding margins year over year in Q4.\n\nI would like to thank our employees for their dedication and contribution to our performance. Our fantastic results are not possible without them. Our differentiated value proposition built for leaders and configured by industry continues to resonate in the market. This quarter, we introduced a new tag line, Empowering Leaders, that reinforces our commitment to empower frontline leaders to be more effective so they can deliver enhanced business results for their organizations.\n\nTo further enhance our unique industry configuration, we launched nearly 20 industry-specific product features and over 20 industry integrations this year. Our go-to-market execution has been excellent as we continue to make significant progress expanding our sales coverage, winning with broker referrals and growing PEPM. The competitive dynamics have remained consistent and demand remains strong, resulting in robust bookings growth of 24% year over year. Over 80% of our new business stems from legacy providers, including in-house, regional service bureaus and legacy providers, ADP and Paychex.\n\nOur win rates are at record levels which is a result of the strong demand for our open modern cloud platform focused on leaders and configured by industry. In a competitive labor market, we increased sales headcount 23%. We have established sellers in all Tier 1 markets today, and we'll continue expanding coverage in these markets for the foreseeable future. To further leverage our strong sales and marketing flywheel and promote Paycor's brand on an unprecedented national scale, we secured exclusive naming rights for Cincinnati Bengals stadium for the next 16 years.\n\nGiven the powerful viewership of the NFL, Paycor Stadium will reach the largest audiences in America. The sponsorship includes signage, hospitality and events, a community-giving initiative and other multimedia assets. We have been headquartered in Cincinnati for over 30 years and a long-standing partner of the Bengals. As longtime fans, this is a proud moment for our employees and our community.\n\nFinally, we continue to expand our modern HCM suite and have increased PEPM $3 or 8% this year to $42. In the last year, we released over 1,200 features powered by the inclusion of more than 500 customer ideas into our solution, demonstrating our commitment to delivering a world-class client experience. Leveraging powerful APIs, Paycor's modern extensible platform enables rapid development and partner integrations. The developer portal has been highly utilized since its launch in February with partner integrations growing by 26% in FY '22.\n\nMoreover, we grew the total number of API endpoints available in our system by 57% year over year. This investment is paying off in greater connectivity and integration for our customers with total API usage growing 148% since February. Looking ahead to FY '23, we will maintain our focus on winning share in the SMB space, delivering sustainable 20-plus percent revenue growth and expanding margins. We intend to do so through a relentless focus on execution, further penetration in Tier 1 markets and continued PEPM expansion.\n\nWe are pleased with our HCM suites competitive positioning and are now focused on leapfrogging innovation. With that, I'll turn the call over to Adam to discuss our financial results and guidance.\n\nAdam Ante -- Chief Financial Officer\n\nThanks, Raul. I'll review our fourth quarter and full year results and then share our outlook for the first quarter and next fiscal year. As a reminder, my comments related to financial measures are on a non-GAAP basis. Total revenue for the quarter was $111 million, increasing 26% year over year, our highest and recent record.\n\nRevenue growth was driven by continued acceleration in new business, strong adoption of our bundled pricing strategy and growth of our partner program. We exceeded the top end of our revenue guidance by 7% and significantly outperformed our adjusted operating income guidance through diligent investment management. For the fiscal year, total revenue was $429 million, increasing 22% year over year. Our bookings were 24% versus the prior year, reaching $142 million and setting us up nicely for continued revenue growth into FY '23.\n\nThe majority of revenue growth stems from new business wins and cross-sales, driving PEPM expansion in the high single-digit percentages and organic labor market growth in the low single digits. With the success of our client experience and product investments, net revenue retention reached a historical high of 98%. Additionally, our focused partner expansion in the last year, such as income and employment verification services and automated background screening, is increasingly contributing to our business, and we expect will continue to grow. The number of employees on our platform increased 15% annually to a record $2.3 million.\n\nOur average customer size increased to 77 employees in Q4, an increase of 9% year over year as we continue to shift away from the micro segment and accelerate growth among clients with more than 100 employees. For the quarter, adjusted gross profit margin improved to 66.1% versus 65.4% a year ago. Adjusted gross margin, excluding depreciation and amortization, was 76.6% for the quarter, an increase of nearly two points year over year. Sales and marketing expense was $37 million or 33% of revenue compared to 34% a year ago.\n\nThe sustainability of our revenue growth hinges on driving new business through expansion of our sales teams and marketing programs, primarily in Tier 1 markets. Sales headcount increased 23% to approximately 460 sellers this year, and we expect to add sales resources at a similar pace next year. On a gross basis, we invested $18 million in R&D or 16% of revenue, slightly lower than 18% a year ago and in line with our long-term targets. Our team continues to efficiently add new functionality through organic development, partnerships and best-in-class product tuck-ins that enhance client value and expand our PEPM opportunity.\n\nG&A expense was $18 million or 16% of revenue, down from 20% in the fourth quarter of '21. We intend to continue to progressively drive G&A down as a percentage of revenue following this year's improvement of 37 basis points. While our primary objective remains sustainable 20% plus revenue growth, we intend to steadily expand margins as we scale the business. We increased quarterly operating income to $9.2 million or an 8.3% profit margin compared to just 0.2% last year.\n\nThe greater than 800 basis point expansion was driven by thoughtful investment management as we've grown the business. Shifting to the balance sheet and cash flow. This quarter, we generated $5 million of free cash flow, compared to a consumption of $21 million last year as we scale the business. We ended the year with $133 million in cash and no debt.\n\nThis quarter, we generated interest income of approximately $1.3 million on average client funds of just under $1 billion. As overnight rates have increased with the Fed rate increases, our overall effective rate was 52 basis points for this quarter compared to just 16 basis points last quarter. Turning to the outlook for FY '23. We continue to be positive about the momentum in the business, strong demand environment and Paycor's leadership position in the HCM market.\n\nThe labor market has remained tight. And while we continue to closely monitor the macro environment, our guidance assumes continued strong demand. We generated about 50 basis points of interest income in the fourth quarter and expect that rate to more than double in the first quarter as overnight rates start to benefit from the Fed funds rate increases. At current rates, we estimate interest income will be in the low $10 million range for the full year.\n\nFor the first quarter, we expect total revenue of between $112 million and $114 million or about 23% growth at the high end of our range, and adjusted operating income of between $4.5 million and $6 million. For the full year, we expect revenue of between $510 million to $516 million or 20% growth at the top end of our range, and we anticipate adjusted operating income of $58 million to $61 million. In summary, we made significant progress this year, scaling and reaccelerating the front end of the business. We continue to press into our leader and industry focus that is resonating with clients.\n\nWe remain enthusiastic about the trajectory of the business and opportunities to capture market share while expanding profitably. With less than 2% share of our $29 billion total addressable market, we have significant runway for continued growth. And with that, we'll open the call for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Mark Murphy with J.P. Morgan. Please proceed.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you very much, and congratulations on a fantastic finish to the year. Raul, I wanted to start by asking you, which elements of Paycor's differentiation do you think are making the biggest difference? When you look at your win rates in the current environment which you said have been increasing, I'm wondering if it's more the industry-specific focus, to focus on leaders? I'm also wondering how often is the real-time payroll processing engine coming up in those conversations and maybe making a difference versus some of the competitors that might still be running in more of a batch mode?\n\nRaul Villar -- Chief Executive Officer\n\nThanks, Mark. I think it's a combination of all three. Industry clearly stands out. We're generating over 50% of our bookings in the four key industries that we're focused on.\n\nOur win rates are at the highest levels in those four key industries. So I would say of one industry definitely stands out. However, the talent elements of our leader messaging are also appealing to our end markets. People are really interested in how to attract and retain people in this labor market.\n\nSo that tends to be a significant advantage as well. And then lastly, we've had a real-time processing engine for a long time. Our employees have been able to see their pay stub 72 hours before payroll for years. So like some of the -- some of the employee service tools and some of our competition are really leveraging and driving in the market we've had for years, and we don't -- we consider that table stake.\n\nSo I think it's really helped us from that perspective. The ability to have a really flexible payroll engine has eliminated the need for those kind of tools in the market for our customers.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nOK. Wonderful. Thank you for that. And then the other question I had was, are you able to help us with the size of the largest organizations that you might have been landed during Q4? And then just at the other end of the spectrum, maybe, Adam, if the macro backdrop slows in the next 12 months, is it safe to say that your bookings targets aren't materially reliant on that sub-10 employee segment at this point where customers can be more economically sensitive just given the way you've mixed up the market?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. Hey, Mark. So to both questions, we signed a lot of clients that are over 1,000 employees and at the top end of our range. But none of them represent even 0.5% of our overall revenue.\n\nSo there's quite a bit of diversification there across all of our clients and none individually worth necessarily talking through. I would say, from a bookings perspective in that micro segment, we're definitely not reliant on that as we think about the overall bookings targets and our go-to-market strategy. I mean we definitely closed business in that sub space, in that sub-10 space in that micro segment. But it's not a material -- an overly material part of where we go-to-market and of our overall composition of our bookings.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you very much.\n\nRaul Villar -- Chief Executive Officer\n\nThanks, Mark.\n\nOperator\n\nOur next question comes from the line of Gabriela Borges with Goldman Sachs. Please proceed.\n\nUnknown speaker\n\nHi. This is Kelly on for Gabriela. First question, just on adoption trends across newer products such as expense management and developer portal, what are you seeing there? And how much are new products helping drive NRR up?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. What we're seeing like with expense management, our go-to-market strategy, is really to build it into our core HCM bundle. And so it helps to lift overall PEPM and overall attach for that product as it's included in the bundle. So we continue to see really strong adoption of our core HCM bundle.\n\nWe sell that more than 90% of the time to new business. In terms of broader adoption, we continue to lift the number of modules that our clients are buying. And so we're selling somewhere between that two and three on average across our entire portfolio. It's a new business.\n\nThey're buying two to three closer to the midpoint of that range in terms of number of new modules that they're attaching. So we continue to see good lift from the addition of these new products that we're bringing in to the overall attach of our bundled pricing strategy.\n\nUnknown speaker\n\nOK. Thank you so much. That's super helpful. And then just a follow-up on that.\n\nSuper impressive NRR number, but where do you see that going forward? Do you -- I mean, what do you think you can do to kind of drive that even higher? And what do you see as the main levers of that for the next two years, maybe?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. I mean there's a couple of key levers. One is the underlying gross retention. And so as we continue to lift gross retention over time, you'll see the number has room to continue to improve.\n\nAnd then one of the bigger drivers is as we continue to release new products and create more compelling bundles and pricing strategies, we continue to see lift from that additional cross-sell, which hasn't been our primary focus thus far. And so as we continue to drive additional cross-sell, there's room for it to continue to improve from where we are today.\n\nUnknown speaker\n\nGreat. Congrats on the quarter.\n\nRaul Villar -- Chief Executive Officer\n\nThank you.\n\nAdam Ante -- Chief Financial Officer\n\nThanks, Kelly.\n\nOperator\n\nOur next question comes from the line of Samad Samana with Jefferies. Please proceed.\n\nSamad Samana -- Jefferies -- Analyst\n\nCongrats on a strong end to the fiscal year. Maybe first one for you, Adam. Just I think I heard you say low teens of millions for the float revenue. I think that implies somewhere around, let's call it, 18-ish percent for the rest of the business as far as growth goes.\n\nOne, I just wanted to check if that was right from a housing perspective? And two, it seems like you guys are a stone's throw of getting to the 20% plus type of level the company is looking at. I'm just curious maybe what would need to happen above and beyond the sales growth or the bookings growth that would get you there on a full year basis in fiscal '23? Just trying to understand kind of what went into that high teens assumption.\n\nAdam Ante -- Chief Financial Officer\n\nYeah. I mean as we think about the full year guide, right, we're sort of the longest point of the year right now. We did guide to almost 23% at the top end of the range for Q1. So we feel good about that.\n\nAnd it's going to be continued -- the continued demand environment and the opportunity to drive additional bookings and the flow-through of those bookings to revenue. And then, of course, like we talked about that additional cross-sell and the pricing strategies that go along with that. So a lot of the things that contributed to the upside that we saw here in Q4, it's really just about continued execution of those strategies through the balance of the year and looking out at this point, four quarters in advance and saying, where do we feel comfortable with the guide. Again, we feel really good about the guide to the 23% revenue growth here in Q1.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. And then maybe just a follow-up for you, Raul. Just if I think about the growth in the total sellers, it's significant. It's -- your seller base is now actually larger than even some of your -- maybe your larger peers.\n\nI'm just curious when you think about either the type of sales force you're able to hire or the productivity that you're assuming for this year, do you need to grow at the same level? Or what's driving that? And should we think bookings might accelerate as a result of that?\n\nRaul Villar -- Chief Executive Officer\n\nYeah. I think overall, we've continued to add sellers. And this year, as we say, we added 23%. And the majority of them will contribute significantly more next year than this year.\n\nAnd so obviously, we believe we'll have bookings lift and bookings growth from the ramping of the new sales associates that we hired this year. We are focused on a really big large end market with approximately 10% of the market has shifted to the cloud, to a modern cloud solution. So we believe that we still have plenty of runway to add sales headcount. And we're focused on adding 20-plus percent sales headcount for the foreseeable future.\n\nTo kind of put it in perspective, we believe that we have about a third of the country covered the way we would cover it if we had unlimited head count. And so we have two-thirds of the market to continue to cover with incremental sales adds for over the next five-plus years. So we think there's tons of opportunity in the market, and we're going to continue to invest and take advantage of it. Obviously, we will look for ASP growth.\n\nThis year, we were able to add 23% headcount and grow ASP 1%, which is hard to do. So kudos to the sales team for being able to do that. And we're going to continue to focus on execution to drive those great results in the future.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. Has Joe Burrow visited your office yet? I'm kidding. Don't answer that. Just congrats on signing that partnership.\n\nRaul Villar -- Chief Executive Officer\n\nYeah. Thank you.\n\nSamad Samana -- Jefferies -- Analyst\n\nThank you again, guys.\n\nAdam Ante -- Chief Financial Officer\n\nThanks, Samad.\n\nOperator\n\nOur next question comes from the line of Bhavin Shah with Deutsche Bank. Please proceed.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nGreat. Thanks for taking my question, and congrats on the impressive results yet again. Just following up on Samad's question. Just on the sales coverage going forward.\n\nIt looks like you're at 28% like Tier 1 sales coverage ending this year. I know you talked a little bit about this, but how should we think about that going forward next year and the years beyond? Should we expect you to continue to see a similar type of rates that you saw from this year versus last as we think about FY '23 and maybe FY '24?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. I mean, so we're going to continue to press into that a similar growth rate in terms of the number of sellers that we add. And so we are in that 23% growth, want to be again in that 20% to 25% growth range in terms of the new headcount. And what you're going to see out of that is most of those sellers are going to go into Tier 1 market still, which is going to continue to press that Tier 1 coverage up.\n\nSo 28% today, and there's opportunity to continue to expand that, like Raul had mentioned, really for a handful of years at the rates that we're talking about continuing to grow. We do add sellers into Tier 2, Tier 3 markets and other markets, as well as in our small marketing client team. So it's not that we only add sellers in Tier 1. It's just that a big portion of them are going to continue to go into those markets to expand coverage.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nThat makes sense. And just on a separate topic, I mean, you talked about in your prepared remarks over 20 kind of industry-specific product features, like which products and which industries are seeing the most resonate well with customers? And how do you think about just the vertical adoption you've seen thus far?\n\nRaul Villar -- Chief Executive Officer\n\nYeah. We had strong growth in all four of the industries: Health care manufacturing, food and beverage and professional services. And I would say the product innovation that we delivered into the platform this year really focused on three different areas: The hiring process, the recruiting process, and a lot of specific time and labor functionality for those specific industries.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nGreat. Thanks for taking my questions.\n\nRaul Villar -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Terry Tillman with Truist Securities. Please proceed.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah, thanks. Hey, Raul, Adam and Rachel, congrats as well from me on the strong fourth quarter and the full year. Maybe the first question just relates to Tier 1 markets. You still have a lot of opportunity to add more capacity and get coverage.\n\nBut in those Tier 1 markets that you're starting to actually have kind of make a name for yourself, are you seeing kind of balanced momentum across all those newer kind of Tier 1s? Or are there some areas that seem like they're kind of more rising to the top and really leading the charge? And then I had a follow-up question.\n\nRaul Villar -- Chief Executive Officer\n\nYeah. We've had strong growth, Terry, across all the Tier 1 markets. I would say that a significant portion of our growth came in the large Texas cities and large California cities. And so those two markets, well, multiple markets have been particularly strong for this fiscal year.\n\nBut we've seen really strong momentum in Florida, strong momentum in the end of the year in the Northeast. So we feel really good about where we are in each of the big segments and starting to power up the teams in those areas. And we've been able to really bifurcate our marketing campaigns to really drive significant awareness into these Tier 1 markets through a variety of different solutions, whether it be Pandora, YouTube, connected TV advertisements. And so it's really helped us drive awareness in those large markets.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nGot it. Thanks for all of that. I guess, Adam, just my follow-up question relates to anything you can share on how we should think about free cash flow for either the quarter or for the full year? And I don't know if maybe there's a way we can look at it in relationship to non-GAAP operating income or just any help on how to think about free cash flow. Thank you.\n\nAdam Ante -- Chief Financial Officer\n\nYeah. Hey, thanks, Terry. Yeah, I mean we haven't given specific guidance, but I mean on free cash flow. We want to continue to expand operating capital, and you'll see it move with adjusted operating income over time.\n\nAnd so it's been running about 10 points, 10 to 15 points in terms of free cash flow margin behind adjusted operating income. And so that disconnect or that additional spend is really into the product and into the cost of acquisition. And so you'll continue to see those investments play through like the product investments and the cost of acquisition for both sales or implementation resources, and that will put that sort of 10% to 15% pressure from adjusted operating income down to adjusted free cash flow.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nOK. Thanks.\n\nRaul Villar -- Chief Executive Officer\n\nThanks, Terry.\n\nOperator\n\nOur next question comes from the line of Bryan Bergin with Cowen. Please proceed.\n\nJared Levine -- Cowen and Company -- Analyst\n\nHi. This is actually Jared on for Bryan tonight. Have you seen impacts in employment levels within your existing client base to date? And then what are your employment growth assumptions for fiscal '23?\n\nAdam Ante -- Chief Financial Officer\n\nYeah, hey, Jared. Yeah, so within the base, I mean, we've seen that continued labor market growth in that really in the low single digits. And we haven't seen a ton of change, I'd say, at the macro level within our portfolio. Of course, specific verticals or specific industries maybe reacting a little differently.\n\nWe saw a lot of comeback or a lot of bounce back from the restaurant and the food and food services segments. Manufacturing played through pretty well. This year, healthcare played through pretty well. A lot of the areas where we focused our industry plan, but that's all in sort of resulted in that low single-digit organic growth.\n\nAnd we haven't considered any of the overall demand environment. We haven't considered anything necessarily different as we think about our guidance into the future. But again, in this case, it's really only generating something in the sort of low single digits overall. And I'd say, like from an overall shift perspective, so we also track hourly shifts.\n\nAgain, sort of tracked right along with the overall market and what we've seen in the labor market more broadly, with the exception really in that micro segment, where I think the micro segment squeezes just a little bit faster and squeezes a little bit faster than the enterprise segment. But in our target market in that 10 to 1,000 segment, it's remained really strong.\n\nJared Levine -- Cowen and Company -- Analyst\n\nGot it. And then in terms of -- we heard the strong NRR of 98%, where did gross revenue retention and client retention land for FY '22?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. We haven't shared gross retention specifically or client retention specifically. The net retention is really how we manage the business more broadly. But I'd say that gross retention was really in line with where it's been historically and is not one of the bigger contributors to the increase that we've seen in net retention, just meaning honestly that gross retention will continue to be a tailwind as we continue to improve the business and the client experience that we've invested in over the last couple of years.\n\nSo you're going to continue to see that benefit. And it's been -- gross retention broadly has been really right in line with where you would expect just given some of the competitor discussion in terms of where they put gross retention and knowing that our portfolio is just a little bit smaller in terms of the average size of our employees per client. Our gross potential would sort of trend with what you would expect.\n\nJared Levine -- Cowen and Company -- Analyst\n\nGotcha. Thank you.\n\nRaul Villar -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Scott Berg with Needham. Please proceed.\n\nMichael Rackers -- Needham and Company -- Analyst\n\nHi, everyone. Congrats on the quarter. This is Michael Rackers. I'm on for Scott Berg today.\n\nYou've talked a bit about the larger average new customer size with the majority of new bookings coming from customers with more than 100 employees. Is that trend kind of continuing to the same extent today? And how should we think about that dynamic moving forward?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. So I mean, overall, what you're seeing in the portfolio is that our average employees per company continues to grow. And we ended the year at about 77, coming off of about 70 from last year. So we're seeing good improvement.\n\nAnd that's really the combination of two things. One, is that we are seeing the micro segment continue to flatten and not grow it in the outsized rate so you're seeing the benefit as we sort of shift more toward the 10-plus and 100-plus segment. And then as we add additional business, we're really adding that new business from the mid-market. It's coming in at -- in the sort of 150 range with clients that we sell higher than that and then some lower than that.\n\nBut on average, you're seeing sort of 150 to 160 in terms of the average client size. So both of those dynamics are really helping to lift the overall size of the portfolio.\n\nMichael Rackers -- Needham and Company -- Analyst\n\nGreat. And then a little bit on module adoption, which I know you've mentioned earlier, but maybe how does that look in Tier 1 cities versus some of your more established smaller markets? I mean, maybe looking at talent management specifically, I mean, are the trends in adoption in the Tier 1 market is pretty similar to the established smaller markets? Or is there any kind of disconnect there? Thank you.\n\nRaul Villar -- Chief Executive Officer\n\nYeah, Michael, this is Raul. In the Tier 1 markets, we're seeing slightly bigger pay sizes and slightly more attached than we do in Tier 2, 3 or 4 markets. So it's really positive for us, and it's reinforcing our desire to continue expanding in those markets.\n\nMichael Rackers -- Needham and Company -- Analyst\n\nGreat. Thank you.\n\nRaul Villar -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Brian Peterson with Raymond James. Please proceed.\n\nChase Donovan -- Raymond James -- Analyst\n\nHey, guys. This is Chase on for Brian. Thanks for taking the question. Adam, I'm just curious how is linearity in the quarter as we're already two months through the September quarter? Have you seen any changes thus far?\n\nAdam Ante -- Chief Financial Officer\n\nIn terms of the overall demand environment or the portfolio?\n\nChase Donovan -- Raymond James -- Analyst\n\nYeah.\n\nAdam Ante -- Chief Financial Officer\n\nYeah. No, I would say, no, nothing significantly different than we wouldn't otherwise capture in the guidance that we just shared. I'd say that the demand environment has remained strong. And what we see in the broader labor market and the tightness of that labor market is playing through to our portfolio.\n\nSo there's nothing that we're seeing right now. And although we're -- we continue to stay on top of it. We continue to be on the watch out for macro changes. And of course, there's a lot of discussion around it.\n\nWe just haven't seen anything inside of the portfolio or any sort of change in the demand environment that would make us sort of expect anything different, especially over the next three, six months. So no changes playing through our portfolio today.\n\nChase Donovan -- Raymond James -- Analyst\n\nGot it. And then on the incremental interest income as you kind of think of coming through to fiscal '23, how do you think about reinvestment of that high margin kind of revenue into growth initiatives, firstly, that kind of flow through to the bottom line? Thanks.\n\nAdam Ante -- Chief Financial Officer\n\nYeah. Absolutely. I mean it's definitely an opportunity for us as we think about continuing to invest in growth initiatives, expanding our sales and marketing engine and making those investments back into our product. So we're looking for opportunities to make those investments in marketing and demand gen and back into the product to continue to accelerate the front end of the business.\n\nSo we're sort of tentatively targeting maybe 50% of what we're seeing in the interest income to fall through and looking for opportunities to invest the other half of it. I'd say that's not specifically guidance that we're giving as much as that's how we're sort of to manage the business. If there's additional opportunities that we find that we think are strategic and add to the long-term value of the business, and we're going to continue to make those investments.\n\nChase Donovan -- Raymond James -- Analyst\n\nPerfect. Thanks, and congrats on a good quarter.\n\nRaul Villar -- Chief Executive Officer\n\nYeah. Thanks a lot, Chase.\n\nOperator\n\nOur next question comes from the line of Brad Reback with Stifel. Please go ahead.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. Raul, as you think about the marketing efforts, do you need additional high-profile deals like the Pac-12 and the stadium deal? Or have you sufficiently raised your profile at this point where it's incremental going forward?\n\nRaul Villar -- Chief Executive Officer\n\nYeah. I think we significantly raised our profile. We evaluate a lot of opportunities. Most of our peers are investing in sports marketing, whether it be golf or patches on NBA teams or those or NBA stadiums, those type of things.\n\nSo we felt like it was something that we wanted to do to raise our overall profile. The Pac-12 was unique to the West Coast expansion. The Bengals naming rights is really unique to the scarcity of an NFL asset. There's essentially 30 stadiums, 28 that actually have naming rights, and it's the most popular sport in the U.S.\n\nSo we felt it was a unique opportunity for us to invest in both our community and expand our brand nationally. And so I think we have definitely raised the brand. We don't need to invest more into the brand for next 12 to 18 months from that perspective. I think it gives us a little runway to take advantage of the incremental impressions and demand that it will create for the channel.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nThat's great. And then just a quick follow-up, Adam, given your commentary over the course of this call with respect to the environment, it would appear that your forward guidance has the same level of historical conservatism going forward? Thanks.\n\nAdam Ante -- Chief Financial Officer\n\nHey, Brad. Yeah. We want to continue to be consistent with how we've guided and how we think about -- we're not changing any sort of philosophy about our overall guidance methodology. We want to be prudent, and we're going to continue to look for opportunities to continue to execute well.\n\nSo that's how I would say we continue to guide. We want to be consistent with historical performance the best we can.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nPerfect. Thanks very much.\n\nRaul Villar -- Chief Executive Officer\n\nThank you, Brad.\n\nOperator\n\nOur next question comes from the line of Mark Marcon with Baird. Please proceed.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nLet me add my congratulations. I was wondering what percentage of the new sales are coming from the Tier 1 markets at this point?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. We're seeing close to -- or just over about half of our mid-market sales are coming from Tier 1 markets. So we've seen a lot of good success. And like Raul had mentioned, in the Southwest and the West Coast, we've seen a lot of growth and improvement from those markets which have contributed to that overall performance.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nThat's great. And I would assume that that could accelerate, particularly as you continue to increase your headcount there. And I would imagine that the people that you've put in place have an opportunity to ramp other productivity levels even more because they're relatively new. Is that correct?\n\nRaul Villar -- Chief Executive Officer\n\nCorrect. Yup.\n\nAdam Ante -- Chief Financial Officer\n\nYeah, that's right. Like Raul had mentioned, we saw, I would say, marginal ASP improvement on the whole. And as you're adding so many sellers, you would expect at some level that your ASP is declining. And so to hold that flat into '22 with an opportunity now to leverage a lot of these newer sellers into their productivity ramp or the second year, they're significantly more productive.\n\nSo you're going to see that hopefully in the West and the Southwest continue, but then really across the entire country. So lots of opportunity to drive productivity into '23 for sure.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nThat's great. And can you talk a little bit about the broker channel? You've got about 40% plus of your bookings coming through referrals in the broker channel. How much expansion would you expect from here? How are the broker referred deals relative to the other deals at this point?\n\nRaul Villar -- Chief Executive Officer\n\nYeah. I mean brokers remain significantly high close rate. So that's the reason why we're so focused on the channel. We're slightly over 40% in our overall bookings.\n\nAnd in the mid-market specifically, it's over the mid-50s. So a significant component of our sales go-to-market motion. And we continue to see increases in the number of referring brokers, nearly 15% increase year over year, and we're just scratching the surface. I mean we're literally dealing with about somewhere between 10% and 15% of the addressable opportunity in that segment.\n\nAdam Ante -- Chief Financial Officer\n\nThanks, Mark.\n\nOperator\n\nOur next question comes from the line of Pat Walravens with JMP Securities. Please proceed.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you. Hey, Raul, can you walk us through the strategy for increasing the price per employee per month? I mean if we look on the website, we can see for below 50 employees, the core is $8 and complete is $14. So maybe explain how pricing tiers fit into that and how it works for the greater than 50 employees.\n\nAdam Ante -- Chief Financial Officer\n\nYeah. Hey, Pat. We have a couple of different strategies. And in that small market which we've sort of identified as under 50, we have a more subscription-based model that has a base fee and then a per employee, per month fee.\n\nAnd that base fee starts at $100, and then there's a PEPM fee that gets you all the services based on how much you're looking to consume. And there's a couple of different versions there that can take you up to over $200 for a base fee plus $12 to $15 PEPM. That's really the under 50 segment. And then as you go above 50, those clients tend to look for a broader suite of services.\n\nThey start picking up time and labor management. They'll pick up benefits and the talent management more deeply. And so that's where we expand to the four bundles that we offer with an HCM core bundle that's now $20 and then benefits, talent and time and labor management.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. And then if I could add sort of related to that. But last quarter, you guys talked about introducing the expense management solution. How is that going? And what would you like to add to that feature-wise over time?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. So we put that into our HCM core bundle, which lifted it from $18 to $20, and we're selling it at over 90-plus percent of the time to new business. So we're seeing really good adoption there. We don't sell it in a stand-alone fashion as of right now, and we'll continue to invest in that product over time to drive functionality.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. All right. Thank you.\n\nOperator\n\nOur next question comes from the line of Daniel Jester with BMO Capital Markets. Please proceed.\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nGreat. Thanks for taking my question. I was wondering if you could talk to us a little bit about what are the trigger events that are getting customers to really engage? As I look at your results and your peers, it seems like the last six to nine months have been just an extraordinarily good environment to sell into. And so I'm wondering if there's commonalities among your customers, especially the new ones, in terms of what's getting them to engage now relative to other parts in time? And how confident are you that you're going to be able to sustain that going forward? Thanks.\n\nRaul Villar -- Chief Executive Officer\n\nYeah. Thanks, Dan. It's Raul. I think one of the biggest drivers coming out of the pandemic has been cloud adoption overall.\n\nAnd I think our end markets are served by CHROs, CFOs and CEOs that may have thought the cloud was a step too far for HCM processing. And during the pandemic, they all use the cloud for a lot of new methods of communication and talking to their children or grandchildren, etc., and they started to work remotely as well. And so I do think that's really opened up a window for the modern cloud HCM providers to take share from the legacy providers. And I think you're seeing that over the last three quarters.\n\nAs the markets opened up, our bookings have accelerated and our revenues accelerated with it in the modern cloud. And I think the combination of that and our ability to deliver real-time solutions around talent that are helping companies cope with the new modern workforce, whether it be recognition tools, poll surveys, the ability to communicate and do one-on-ones virtually, all those tools are built into Paycor's modern cloud solution and are helping drive adoption.\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nGreat. Thank you very much.\n\nRaul Villar -- Chief Executive Officer\n\nYeah. Thank you, Dan.\n\nOperator\n\nAnd our next question comes from the line of Robert Simmons with D.A. Davidson. Please proceed.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nHey, guys. Great quarter, and thanks for taking the question. I'm wondering, I mean, what were the biggest drivers in the quarter relative to guidance -- of the upside? What surprised you the most?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. I think that we ended up seeing just quite a few of those initiatives that we're executing on come through really well. So new business is, of course, the biggest contributor to our overall growth. But we're seeing overperformance from some of the strategic pricing initiatives that we've been running, some of the partner programs and then of course, interest income all came through.\n\nThe new business continues to convert well. It really ended that -- all of those initiatives were really hitting on all cylinders as we went into -- or as we exited the quarter. So we saw a lot of the performance come through forward for quite a few of the initiatives.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nGot it. And then can you talk about the impact of inflation on your business on both the revenue pricing side and on the cost side of the equation?\n\nAdam Ante -- Chief Financial Officer\n\nYeah. So on the cost side, I mean, we see the labor market like wage inflation, of course, across the business, but not in an overly material way. We see it in some of the new hires. But I think a lot of that has actually calmed down a bit.\n\nAs it was sort of running into the December time period, it was quite a bit harder. And we've seen that wage inflation sort of soften just a little bit. In terms of its impact on the business, from a revenue perspective, of course, it impacts payroll companies and HCM companies quite a bit more directly. So we continue to see overnight rates increase as they get closer and closer to the Fed funds rate.\n\nAnd we're seeing those -- we generated about 50 basis points of interest income in the quarter, and we'll see that rate probably close to or more than double into Q1. And that's really the positive sign from the increase in the inflation and interest rate increases.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nGot it. Thanks, guys.\n\nOperator\n\nThank you. This concludes our question-and-answer session. I'd like to turn the call back to Raul Villar for any closing remarks.\n\nRaul Villar -- Chief Executive Officer\n\nThank you again for joining us tonight. We appreciate your continued support. We are enthusiastic about the accelerated momentum in the business as we head into the next fiscal year. We look forward to staying in touch and seeing a number of you at Stifel, Deutsche Bank and HR Tech Events this quarter.\n\nHave a great evening, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRachel White -- Vice President, Investor Relations\n\nRaul Villar -- Chief Executive Officer\n\nAdam Ante -- Chief Financial Officer\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nUnknown speaker\n\nSamad Samana -- Jefferies -- Analyst\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nTerry Tillman -- Truist Securities -- Analyst\n\nJared Levine -- Cowen and Company -- Analyst\n\nMichael Rackers -- Needham and Company -- Analyst\n\nChase Donovan -- Raymond James -- Analyst\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nMore PYCR analysis\n\nAll earnings call transcripts"
}