{
  "companyName": "Five Below",
  "companyTicker": "FIVE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/30/five-below-five-q3-2022-earnings-call-transcript/",
  "content": "Five Below (FIVE -0.31%)\nQ3 2022 Earnings Call\nNov 30, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Five Below third quarter 2022 earnings conference call. [Operator instructions] After today's presentation, there will be an opportunity to ask questions. [Operator instructions] Please note that this event is being recorded. I would now like to turn the conference over to Christiane Pelz, VP of investor relations and treasury.\n\nPlease go ahead.\n\nChristiane Pelz -- Vice President, Investor Relations\n\nThank you, Cole. Good afternoon, everyone, and thanks for joining us today for Five Below's third quarter 2022 financial results conference call. On today's call are Joel Anderson, president and chief executive officer; and Ken Bull, chief financial officer and treasurer. After management has made their formal remarks, we will open the call to questions.\n\nI need to remind you that certain comments made during this call may constitute forward-looking statements and are made pursuant to and within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 as amended. Such forward-looking statements are subject to both known and unknown risks and uncertainties that could cause actual results to differ materially from such statements. Those risks and uncertainties are described in the press release and our SEC filings. The forward-looking statements made today are as of the date of this call, and we do not undertake any obligation to update our forward-looking statements.\n\nIf you do not have a copy of today's press release, you may obtain one by visiting the investor relations page of our website at fivebelow.com. I will now turn the call over to Joel.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThank you, Christiane, and thanks everyone for joining us for our third quarter 2022 earnings call. We delivered a third quarter that substantially beat our guidance against a difficult macroenvironment, especially given the comparison to last year's extremely strong sales. We are playing offense, staying nimble, and controlling what we can, all the while keeping our customer promise of delivering value at the center of our decision-making. We are also executing on our long-term growth initiatives that underpin our Triple Double plan, of which store growth is key.\n\nAnd we are pleased that the conversions to our new Five Beyond store format are being met with a very positive customer response. All of this helped drive total sales growth of 6% to 645 million, a comparable sales decrease of 2.7%, and earnings per share of $0.29, which were all ahead of our guidance for the third quarter. The sales beat was driven by both ticket and transactions results improving throughout the quarter. We opened 40 new stores across the country in the third quarter, finishing the quarter with 102 stores opened year to date.\n\nThree of these new stores ranked in the top 25 fall grand openings of all time, and two of them were in our new states of North Dakota and South Dakota. We were also very excited to open our third Manhattan location in Times Square. In addition, we have already converted approximately 250 stores this year to the new Five Beyond prototype. We are very pleased with the pace and execution of this rollout, as well as the customer response, which is driving higher sales and traffic to these stores.\n\nThis past year, we continued to focus on our strategic initiatives of product, experience, and supply chain, which were key to our performance and were important enablers of our past long-term targets. Next year, we will outline our strategic pillars that will enable our Triple Double goals. On product, the trends we mentioned last quarter continued, with our version of consumables or needs-based products resonating with customers. The candy world once again outperformed, featuring novelty candy like Slime Lickers, snacks from great brands like Hershey and Rocher, as well as our salty business, featuring the One Chip Challenge and Takis.\n\nIn games and toys, our Squishmallows products remained popular. We connected with our customers with Squish Sunday events and recently launched our exclusive Five Below-only collections of Squishmallows. Newer trends like anime, Funko, and Hello Kitty grew, and we sourced more licensed products, including items such as Disney's Lilo and Stitch and Marvel action figures, all at extreme value. In addition, Halloween was more normalized as trick or treating and other Halloween rituals recovered from the pandemic-impacted 2020 and 2021 years.\n\nWe were pleased with our performance, and our seasonal offerings were well-received. Five Beyond, as I mentioned earlier, continues to be a great driver for us, with more stores offering the full assortment in the back of the store. We've added about 200 items to the converted Five Beyond stores. Finally, I'd like to add that we took advantage of closeout opportunities and one-time special buys in the marketplace and now have additional extreme values across products of many categories.\n\nOur goal, especially this holiday inflation-induced season, is to drive even more value for our customers, and we will continue to selectively pursue opportunistic buys that will drive traffic and attract new customers to Five Below. As it relates to our strategic initiative of experience, we are focused on connecting with our customers and delivering an even better shopping experience for them. We already spoke about the successful rollout of the latest prototype featuring the Five Beyond store within the store in the back of the store, which includes the reimagined Tech and Room worlds. We continued to see customers who purchase Five Beyond products spend about twice as much as those who did not, which bodes well for continued increases in store productivity.\n\nWith approximately 20% of our chain in the new Five Beyond format that we unveiled earlier this year, we are on track and marching toward our goal for over 80% of the chain to be in this format by 2025. With respect to marketing, for the third quarter, we invested heavily in digital, specifically, in paid search and social media. We increased our marketing spend year over year, focusing more on the second half of the quarter leading into the key holiday selling season. We tested various strategies and believe our efforts were effective in driving sales.\n\nOur marketing and visual design teams did a great job communicating our value message to customers, whether digitally or in store. In addition, with increasing knowledge about our customers gained through tokenization, we are leveraging data to target both new and existing customers more effectively. For e-commerce, we enhanced our offering by rolling out buy online, pick up in store chainwide in September. The initial results are promising, and we look forward to our customers discovering the convenience that BOPIS orders during this busy holiday season.\n\nWith respect to supply chain, we are proactively managing our operations and navigating dynamic conditions. We continue to look for ways to control our destiny. As an example, we strategically accelerated inventory receipts to ensure a great in-stock position for the holiday season. We remain nimble in this ever-changing environment, and I am extremely pleased with the positive results the team has delivered.\n\nRegarding our distribution infrastructure, we completed our five-node network with the summer opening of the Indianapolis ship center. We now have the capability to reach approximately 90% of our stores within two days, and the network is expected to provide efficiencies and keep our stores well-stocked. Pedricktown, New Jersey, our first large ship center, has been fully built out, with the ability now to service approximately 500 stores. The other four ship centers will be expanded over the coming years to support our continued growth.\n\nNow, on to the all-important holiday season. We are pleased with the start of Q4, including Black Friday weekend. Our stores are stocked and ready with an amazing assortment of value products that promises to delight our customers. From branded games and toys to pet beds and from holiday decor and licensed tees to Bluetooth speakers, we have something for everyone to complete their shopping lists.\n\nIn addition to our Five Below stocking stuffers and gifts, we're also excited for Five Beyond to provide new and extreme value products in different categories, which further reinforces our position as a must-stop holiday gifting destination. For example, this holiday season, we are featuring a folding light-up scooter with LED wheels for only $20. We are also really excited to have sourced Kylie and Kendall crossover bags for only $5, exclusive to Five Below. And to highlight these amazing values, earlier this month, we kicked off our Save the Holidays marketing campaign, utilizing social media, paid search, TV, and key partners like Kelly Clarkson to attract new and existing audiences.\n\nIn our stores, we've hired thousands of associates to keep our shelves filled and help customers with their holiday shopping needs. We also plan to further elevate our customers' journey, with approximately 70% of our stores offering assisted checkout, which improves throughput and the customer experience during the busy holiday shopping season. We can't wait to see everyone in our stores and online at fivebelow.com. So, in summary, we made great progress on several initiatives in the third quarter and are in a great position for the fourth quarter.\n\nWe believe with the steps taken, including accelerating inventory receipts, expanding our value assortment, increasing marketing, adding BOPIS, and growing the number of self-checkouts in stores, we are well-positioned for our customers as they adjust to an inflation holiday season and look even more for value. Last quarter, we said that Five Below becomes a needs-based retailer during the holiday season, and we are beginning to see that play out with improved transactions. We offer the extreme value our customers need to help alleviate macro pressures while providing a fun shopping experience to let go and have fun. Our customers know they can count on Five Below for amazing affordable gifts and stocking stuffers to celebrate the season, and we won't disappoint.\n\nWith that, I'll turn it over to Ken to review the financials in more detail. Ken.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nThanks, Joel, and good afternoon, everyone. I will begin my remarks with a review of our third quarter results and then provide guidance for the fourth quarter and the full year. As Joel said, we were pleased to exceed the third quarter guidance we provided. Our sales for the third quarter of 2022 increased 6.2% to $645 million from $607.6 million reported in the third quarter of 2021.\n\nOn a three-year compound annual growth rate basis, sales growth for the third quarter was approximately 20%. Comparable sales decreased by 2.7%, with a comp ticket decrease of 1.8% and a comp transaction decrease of 0.9%. Our average ticket remained strong, increasing over 20% in the third quarter as compared to the corresponding pre-pandemic period in 2019, which is in line with the results we have seen since we reopened stores in mid-2020. We were pleased that our comps on a one-year basis and a three-year geometric stack basis increase post-August, with improvements in both transaction and ticket.\n\nWe opened 40 new stores across 20 states in the third quarter, compared to 52 new stores opened in the third quarter last year. We ended the quarter with 1,292 stores, an increase of 119 stores, or approximately 10%, versus 1,173 stores at the end of the third quarter last year. Gross profit for the third quarter of 2022 increased 2.7% to $207.8 million, versus $202.4 million in the third quarter of 2021. Gross margin decreased by approximately 110 basis points to 32.2%, driven primarily by occupancy deleverage on the negative comp.\n\nAs a percentage of sales, SG&A for the third quarter of 2022 increased approximately 270 basis points to 29%. SG&A expenses as a percent of sales were higher than last year, driven primarily by fixed costs deleverage, higher store expenses, and increased marketing expense, all offset, in part, by cost management strategies initiated this year and lower incentive compensation. As a result, operating income decreased 50.7% to $20.9 million, versus $42.4 million in the third quarter last year, with operating margin deleveraging year over year by approximately 375 basis points. These results were better than our expectations due primarily to the sales beat.\n\nOur effective tax rate for the third quarter of 2022 was 24.6%, compared to 24% in the third quarter of 2021. Net income for the third quarter of 2022 was $16.1 million, versus net income of $24.2 million last year. Earnings per diluted share for the third quarter was $0.29, compared to last year's earnings per diluted share of $0.43. We ended the third quarter with $117 million in cash, cash equivalents, and investments and no debt, including nothing outstanding on our $225 million line of credit.\n\nInventory at the end of the third quarter was $702 million, as compared to $521 million at the end of the third quarter last year. In line with our expectations, average inventory on a per-store basis increased approximately 22% versus the third quarter last year. Approximately half of this increase came from unit growth as we accelerated inventory receipts to ensure better in-stock positions for the holiday period. We continue to expect the growth in average year-over-year inventory per store to moderate significantly by the end of the fourth quarter.\n\nNow, on to guidance for the fourth quarter and fiscal year. We are pleased with the start to the fourth quarter, including Black Friday weekend results. We expect fourth quarter sales to be in the range of $1.085 billion to $1.110 billion based on opening approximately 48 new stores in the quarter, with comparable sales in the range of negative 1% to positive 1%, versus last year's fourth quarter comparable sales increase of 3.4%. As Joel said, we feel great about our holiday assortment and expect to benefit from a better in-stock position in Q4, more targeted and effective marketing, and an expanded Five Beyond assortment in more stores.\n\nAt the midpoint of our guidance, we expect year-over-year operating margin improvement in the fourth quarter of approximately 150 basis points, driven by leverage in both gross margin and SG&A expenses. Lower incentive compensation and additional cost management strategies are expected to more than offset deleverage on fixed costs and higher than originally planned marketing spend. Our effective tax rate for the fourth quarter is planned at approximately 25%, which excludes the impact of share-based accounting for any share repurchases. Net income is expected to be in the range of $164 million to $173 million, with diluted EPS expected to be in the range of $2.93 to $3.09.\n\nFor the full year, we expect sales in the range of $3.038 billion to $3.063 billion, or an increase of 6.7% to 7.6% versus fiscal year 2021. We expect comparable sales in the range of negative 3% to negative 2% and EPS in the range of $4.55 to $4.71, which is an 8.1% to 4.8% reduction versus last year. These full year projections assume opening 150 new stores and completing approximately 250 conversions to the new Five Beyond store format. For fiscal 2022, we are planning to spend approximately $235 million in gross capital expenditures, excluding the impact of tenant allowances.\n\nThis reflects the opening of our new ship center in Indianapolis, opening new stores and executing conversions, and investing in systems and infrastructure. In conclusion, we had a better-than-expected third quarter and are off to a good start for the fourth quarter. It remains a dynamic economic environment. However, Five Below is a resilient retailer.\n\nOur teams continue to move quickly to adjust to changing customer preferences, and I want to thank them for their ongoing commitment and dedication. The combination of our long runway for growth, industry-leading new store economic model, and strong balance sheet, combined with disciplined cost management, sets us apart and positions us to weather economic uncertainty, all while continuing to deliver on our strategic priorities to capitalize on the significant growth opportunity that lies ahead. With that, I'll turn it back over to the operator to begin Q&A. Operator.\n\nOperator\n\nThank you. And at this time, we will now begin the question-and-answer session. [Operator instructions] And today, it will come from Matthew Boss with J.P. Morgan.\n\nPlease go ahead.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. So, thanks, and congrats on a great quarter. Joel, so a couple of things. What do you attribute the inflection in business that you've seen since August? Could you elaborate on November? And is it fair to say that you're embedding a level of potential conservatism in the 4Q guide? And then just anything you see today that prevents you from returning to the components of the Triple Double plan as we look to next year.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Thanks, Matt. You know, obviously, you know, based on our guidance where the quarter end -- the quarter improved, you know, throughout September and October, and I think it's largely a combination of the factors I outlined in my prepared remarks, which, you know, specifically were a combination of, you know, what we've done around the Triple Double has really helped the, you know, improvement in transactions. And, you know, we've always said, as we get closer to holiday, we become a needs-based retailer, and we've clearly seen some of that begin to happen.\n\nAnd then finally, we increased marketing. And so, those are all things on our side of it. And then, you know, it's not lost on us that, you know, the consumer CPI has gone down throughout the quarter and that probably certainly helped customers as well. And that's kind of how we see Q3 playing out.\n\nAs far as, you know, elaborating on fourth quarter, you know, conservatism is a tough word to, you know, confirm or deny in the sense that, you know, as you always know, Matt, Q4 is a different quarter than the rest of the quarters. And, you know, we clearly have, you know, two-thirds of the quarter still in front of us. So, I think, you know, we said in our remarks, we're really off to a very solid start to the quarter. It's in line with our forecast, and we see no reason for that to stop.\n\nBut, you know, we've -- we also have to recognize that it's a pretty dynamic environment and the customer hasn't, you know, dealt with an inflation like this before. But look, all the stuff we put in place, it seems to be resonating, and we expect that to work throughout December. Thanks, Matt.\n\nOperator\n\nAnd our next question will come from Simeon Gutman with Morgan Stanley. Please go ahead.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey, everyone. Happy holidays. Hey, Joel, can you talk about the product pipeline heading into '23? I know you won't give '23 guidance, and that's not the point. But anything that's different.\n\nAnd then is there any products that are not already set for the holiday that come into your assortment in the -- you know, I'm assuming not, but, you know, anything around that and then to '23?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Look, as far as the assortment, you know, for Q4, I would expect -- you'll see a few new stuff still floating in for Five Beyond. I think that's a very dynamic line that we expect stuff to go in and out. So, you'll continue to see some newness and wow in there.\n\nBut in terms of the product line, I mean, some of the stuff I called out on my prepared remarks like the Kylie and Kendall crossover bags, I mean, that's just a great example of the merchants being out there, being trend-right, getting exclusives to us, and that item is off to a great start, and, you know, that'll carry into next year. And then I think the big -- you know, if you wanted a forecast into '23, I think the big change we've seen, you know, licenses haven't been relevant for the last three years, you know, largely because movies haven't happened. And, you know, licenses tend to come out of movies. So, you know, the emergence of licenses here in the fourth quarter is a good sign that -- that'll probably continue into '23 as well.\n\nBut that's kind of a quick overview on product and as we think about going into '23. Thanks, Simeon.\n\nOperator\n\nAnd our next question will come from John Heinbockel with Guggenheim. Please go ahead.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nHey, Joel. A few of your thoughts, right, where we are in Five Beyond now, right, in terms of price points. But I think you've got more $25 items than you've ever had. But price points, worlds.\n\nAnd I know you've always -- Michael has always challenged the merchants, right? We need dollar items as much as we need $5. Is that discipline on Five Beyond, right? Is it we need, you know, $10 items as much as we need 20? What's your thought on that today?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, good question, John. And what I would say to you on that and, honestly, for everyone on the call, we're still Five Below. And more than ever, this year, we really focused on that $1, $2 price points and really tried to scream value in the stores. And at the same time, you know, strategically, we are very excited about Five Beyond and what that allows us to do to not only be your stocking stuffer headquarters during holiday but also, you know, be the main gift.\n\nAnd, you know, we've landed on it on a great platform, you know, obviously called Five Beyond. But what you're going to see us continue to emphasize and build upon is the bifurcation of the two. And it is not our intent in non-Five Beyond stores to grow that assortment. You will not see that assortment grow in the non-Five Beyond stores.\n\nWe may still carry an eight-foot section in the front, but whether you're talking about Five Below or Five Beyond, the consistent message that the merchants will deliver is value. I think that's more important than the actual price. And you're right, John, we have more $25 items than we did last year. For now, I think that's the high end of where we'll go.\n\nAnd we've got too many opportunities to have to go any higher than that right now. But you'll see that continue to expand in the Five Beyond stores. And Michael and the team will do what they do. We'll start -- as we said at the Investor Day, we're moving away from items on a shelf to a store within a store, and you'll start to see worlds emerge.\n\nYou'll start to see categories emerge. And I'm talking about Five Beyond for the second here, John. But hopefully, that gives you some sense of the difference between Five Below and Five Beyond. And yet, at the same time, they're both about delivering value.\n\nThank you. Thanks, John.\n\nOperator\n\nAnd our next question will come from Scot Ciccarelli with Truist. Please go ahead.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nGood afternoon, guys. I have a question on store growth. I think it's, again, going to be a bit lower than kind of previously anticipated. So, I guess the questions are, you know, are there still headwinds to the opening cadence we should be thoughtful about, especially as we look toward the '23 unit growth opportunity?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, it's a good question, John. I mean, clearly, you know, coming into '22 here, you know, the headwinds, you know, persisted over, you know, coming out of the pandemic. You know, even the ratio of stores, first half to second half, is skewed much later to the second half here in '22. And of course, that rolls over a little bit into '23.\n\nBut, you know, we're -- look, we're still on track for the long-term Triple Double goals. You know, I think we said a thousand stores over four years. You know, if you take the slow start in '22 here, hey, does that end up missing that by, you know, 5% or something? It's still directionally, you know, a thousand stores. And that's only because of the start here to '22.\n\nWe are gaining momentum going into '23 and, you know, expect that to continue to grow. I think the majority of the headwinds are behind us. And, you know, I hate to say it, Scot, I think for the first time in three years, we're going to see some retail displacement coming out of the holidays. That will be a good thing for us as we, you know, pick up more sites as we expand our growth.\n\nBut that hopefully gives you some outlook on it. Thanks, Scot.\n\nOperator\n\nAnd our next question will come from Brian Nagel with Oppenheimer. Please go ahead.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi, good evening. Congrats on the nice quarter.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, thanks, Brian.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nSo, my question is, Joel, you mentioned in your prepared comments the opportunistic purchases. So, the question I have is maybe just elaborate further on that. Is this something -- you know, you've always -- or you've done this in the past. Is this a bigger effort now, just given some of the dislocations? In the product that you're buying opportunistically, is it more of what's the same in Five Below, or do you have products that are just, you know, could be unique this year?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, I think that why it was important to get that included, Brian, in my prepared remarks is that, you know, honestly, for the last couple of years, there hasn't been a lot of closeout opportunities, one-time opportunistic buys. And, you know, I think it's important to note, though, you know, it's still relatively low single digits of our overall purchases. But, you know, you walk in our stores, you'll see a big selection of Funko, our 12-inch Marvel action figures, Uno, things like that are a combination of really great brands and licenses and then incredible value that we brought to the stores. So, I think it's -- look, it's something that's been in our DNA for quite some time.\n\nBut I needed to remind everybody that's kind of back in our playbook, and it hasn't been there for the last couple of years.\n\nOperator\n\nAnd our next question will come from Paul Lejuez with Citi. Please go ahead.\n\nPaul Lejuez -- Citi -- Analyst\n\nHey, thanks, guys. Curious if you can share what you're seeing in terms of the Five Beyond prototype comp performance versus the rest of the chain and any detail that you might be able to give in terms of the traffic versus ticket that you see in those stores versus the non-Five Beyond stores. Thanks.\n\nJoel Anderson -- President and Chief Executive Officer\n\nHey, Paul, it's a great question. You know, it kind of lose a little bit to what Matt asked about, you know, improvement through the Q3 corridor. And at the same time, I'm not trying to dodge your answer. And while we are seeing improvements in both, it's really early for us to kind of give you a definitive statement on that because the overwhelming majority of those happened in Q3, which is, again, it was an input into why, you know, sales improved throughout the quarter.\n\nAnd, you know, I think we really, you know, kind of need to watch how Q4 goes. But what I'll tell you and remind everybody at our Investor Day, you know, we expected the first full year post remodel to run in, you know, plus-mid-single digits. And, you know, there -- we haven't seen any signs that it's -- they're not going to perform at kind of that level. But at the same time, we want to kind of see more real data.\n\nWe've got a large subset of stores now, 250, and we'll really watch those through the quarter. But I would stick with the mid-single digits, which is what we laid out at Investor Day. Thanks, Paul.\n\nOperator\n\nAnd our next question will come from Edward Kelly with Wells Fargo. Please go ahead.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nYeah. Hi, guys. Good afternoon. So, there's been a lot of talk about heavy promotions this holiday period, especially in categories like toys.\n\nCan you just maybe talk about what your Q4 mixes in that category and how you think you're set up to compete? And then just to follow up on one thing you talked about earlier on, you know, the closeout business. Just maybe a little color on what you're seeing there in terms of the opportunity. Could you maybe size it, you know, and any impact that that could have in Q4 as well? Thank you.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, Ed. The, you know, the toy category for us in holiday is in kind of the high-teens range. And I think it's -- look, I know the industry is talking a lot about heavy promotions, overbuys. We -- that really hasn't impacted us.\n\nWe also don't tend to play in the traditional toy lineup that everybody is talking about. You know, Squishmallows is in the toy -- you know, in our toy world. And, you know, that's very different than, you know, the plastic toys that I think a lot of people are referencing. And so, I don't expect us to deviate too much from the high teens in terms of the Q4 performance in toys.\n\nKen, anything to add on that?\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nNo, I think you hit it. It's always an important part of the holiday season. And, you know, as Joel mentioned, those are our expectations. That's what we've seen historically from a penetration standpoint, and that's what we're expecting to see for this holiday also.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Ed.\n\nOperator\n\nAnd our next question will come from Jason Haas with Bank of America. Please go ahead.\n\nJason Haas -- Bank of America Merrill Lynch -- Analyst\n\nHey, good afternoon, and thanks for taking my question. So, Joel, you mentioned a few times, and I know you said on past calls, that the business becomes more needs-based as we get into the holiday season. So, I'm just curious, as you're starting to plan the business for next year if you think we could see a similar cadence, just if this sort of environment continues. I'm curious to get your thoughts there.\n\nJoel Anderson -- President and Chief Executive Officer\n\nLet me clarify, see a similar cadence of the needs-based going into the holiday.\n\nJason Haas -- Bank of America Merrill Lynch -- Analyst\n\nYeah, I just wonder, as we get out of the holiday season and we enter the spring and summer, assuming that the consumer just probably still under pressure, if you're kind of planning the business to -- you know, if this run rate will continue, if we'll see some softening before then it picks up again as we get into the holidays.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Look, I think -- I wouldn't expect us to see softening. I think it's a very different time period than where the start of the year was. The consumer has clearly said value is important, and they've figured out that, you know, we're a piece of the value equation.\n\nI think what we saw in Q2, where we saw, you know, a big slowdown, as did most retailers, and that was during the transitory time of massive inflation. Certainly, the war started, and we saw the consumer freeze. They've adjusted their pocketbooks. They've adjusted to the new lifestyle, and we're part of that equation going forward.\n\nYou know, will the first couple of quarters be more focused on our needs-based categories like consumables and candy? Absolutely. But as long as we continue to deliver value, I don't see it going backwards. Plus, look, you're going to get the continued benefit of more conversions as we go into 2023, which is going to more than offset, you know, any potential, you know, slowdown you're foreshadowing there. Hopefully, that gets at what you're asking, Jason.\n\nThank you.\n\nOperator\n\nAnd our next question will come from Jeremy Hamblin with Craig-Hallum Capital Group. Please go ahead.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nThanks. Congrats on the strong results. I wanted to ask, one, to see if -- first, just clarifying on the cadence trends. If I'm not mistaken, I think the cadence -- the compares get easier as we get into the back half of December and into January.\n\nSo, first, just confirm that. And a second question would be just, you know, you've invested a lot in, you know, technology within the stores, self-checkout. We've had a lot of retailers that have talked about, you know, an increase in shrink rates in 2022. Want to get a sense for what you're seeing, you know, in particular, as, you know, the last couple of quarters here and as we get into the holiday season.\n\nThanks.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, thanks, Jeremy. Yeah, I think you're thinking about the cadence piece of it right. You know, if you recall Q4 last year, January was up against the stimulus payment from 2020, you know, January of '21, which was, you know, the end of our fiscal '20. And so, that was our hardest compare last year.\n\nI do think January is now, you know, a more normalized, you know, baseline from, you know, prior years. And it's also our smallest month of the year. But, you know, clearly, you know, I think -- and this is all in our guide, too. We expect -- you know, November was the toughest.\n\nThere was a big pull forward last year of buying with the whole concern over the supply chain. But we factored kind of all that in as we thought about our cadence for the quarter. And then as far as shrink rates, look, there's been a lot of talk in the industry about that. I think all that started to emerge in '20 and '21.\n\nAnd so, I don't expect '22 to be significantly different than '21. Some of that is driven by our price points. You know, these -- you know, some of the higher-end merch retailers. But it's also kind of already in our -- largely in our base from last year.\n\nOperator\n\nAnd our next question will come from Chuck Grom with Gordon Haskett. Please go ahead.\n\nEric Cohen -- Gordon Haskett Research Advisors -- Analyst\n\nHi, this is Eric Cohen on for Chuck. Thanks a lot and congrats on the quarter. Inventory growth definitely improved a lot this quarter. I was wondering if you can sort of unpack the drivers of improving growth and then also sort of how you're thinking about inventory as we get to year-end.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah. Thanks, Eric. Yeah, as I mentioned in the prepared remarks, we did see a significant improvement in that year-over-year average store inventory, actually, dropped in half for if you recall back in Q2 with I think the growth rate was in the high 40%, I think 47%, down to 22%. The overwhelming majority of that was our strategy of accelerating inventory receipts to get prepared for this holiday season.\n\nWe didn't want to get caught up in any type of supply chain disruption. And if you move forward to the end of the year, based on our expectations, we think that moderation is going to continue significantly as we get back to the end of the year. And we'll be -- we should be in a very good position at the end of the year. And probably, we're seeing some of the freshest inventory levels that we've seen in years.\n\nSo, we feel really good about where inventory is for us right now.\n\nEric Cohen -- Gordon Haskett Research Advisors -- Analyst\n\nAll right. Thank you.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nThanks, Eric.\n\nOperator\n\nAnd our next question will come from Anthony Chukumba with Loop Capital Markets. Please go ahead.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGood afternoon and thanks for taking my question. You mentioned that your assisted self-checkout penetration is -- I guess it's in 70% of your stores. And I was just wondering, you know, what's sort of the long-term target and is -- are there any kind of limiting factors to getting to 100%? Thank you.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, thanks, Anthony. Look, the long-term targets, it'll probably never be exactly 100%. Some of it's a factor of, you know, converting old stores. So, I would say our, you know, really low-volume stores are still our smaller format stores.\n\nWe probably aren't going to -- we don't have the room to put it in. And then our, you know, extremely high shrink stores, we tend not to put it in there. So -- but for all intent and purposes, you know, that number will continue to float up. You know, never be 100, but it's probably not going to be less than 85%.\n\nSo, somewhere in that range, 85 to 90. Thanks, Anthony.\n\nOperator\n\nAnd our next question will come from Brad Thomas with KeyBanc Capital Markets. Please go ahead.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nHi. Good afternoon. Thanks, and best wishes for the holidays here. My question was, Ken, I know it's early to talk about 2023 but was wondering if in broad strokes you'd give us a little bit more thinking around margins given some of the noise that we're seeing and given the inflection that you're guiding for here in gross margin.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, Brad, it's a great question you're asking. It's probably in a lot of people's mind. I'll turn this over to Ken here in a second. But just look, this is normally where we wouldn't want to give any guidance on '23.\n\nAnd we tend to save all that for, you know, March, maybe a little bit at ICR. You know, listen, I know you're all trying to kind of figure out your models and, you know, and you have to also realize we have to get through Q4. But, you know, maybe I can help you a little bit on the top line to think about that. And, Ken, maybe you can think about a scenario that would help them to think about the bottom line.\n\nBut, you know, I think, you know, our largest input to top-line growth is new stores. And we wouldn't expect to be below 200 next year. And so, I think that's, you know, in the ranges we're thinking about. We'll certainly have, you know, full line of sight to the new store program as we get to March in our year-end call but, Ken, help them think about a scenario of how to think about the bottom line.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah, sure. And thanks, Brad, for the question. And as Joel mentioned, obviously, you know, we're going to get through the holiday season, and we'll provide guidance, as we normally do, on our March call. And again, this is not guidance, but in a scenario format.\n\nSo, in a scenario, say, of a 3% comp for next year, based on what we know today, Brad, we believe that operating margins should be up slightly and that's versus our fiscal '22 guidance that we're providing. Now, that does include some puts and takes that we've spoken about before. There are some headwinds that we would expect next year around areas like higher incentive compensation, the cost management strategies that we initiated this year, primarily in the back half of the year that we've spoken about that have done -- helped us significantly from a profitability standpoint. We're going to be anniversary those.\n\nAnd some of those we're carrying forward and some of those we can't. So, there'll be a slight headwind there. And then inflation, you know, we're seeing increases in certain operating areas of the business, especially coming on here late in the year. But as you know, we always look and we do a pretty good job of mitigating a lot of those increases based on our scale, negotiations, and other cost management strategies that we can put into place.\n\nSo, that's, again, just a scenario of what we would see next year if it was, say, a 3% comp.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Thanks, Brad.\n\nOperator\n\nAnd our next question will come from David Bellinger with MKM Partners. Please go ahead.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\n[Audio gap] the question. Appreciate the commentary around Five Beyond and the lift you're getting in that respect, but average ticket this quarter was still down. It was up 20% looking back to 2019, but down on a year-over-year basis. Did that acceleration you saw through the Q3 period in terms of comp, did that have to do more with sort of the quick shift to value? And are you seeing the lower price points, are they moving at a faster velocity than, call it, $5 and up?\n\nJoel Anderson -- President and Chief Executive Officer\n\nDavid, you were asking that through the quarter to -- ask me that question again. I'm trying to follow [Inaudible]\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nYeah, just the -- so the improvement you saw throughout Q3 and that acceleration, did that have to do more with some of your lower-priced items just turning quicker and selling better or are you still getting that lift from items that are $5 and higher?\n\nJoel Anderson -- President and Chief Executive Officer\n\nWell, I think, you know, it's -- if I had to categorize it, it's probably roughly a third, a third, a third, meaning a third of it is coming from Five Beyond; a third of it is coming from, you know, strategic price increases we made, you know, to combat inflation; and then a third of it is coming from sales mix shift, right? So, I think that kind of --\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah. David, if you're referring to kind of the typical average unit retail increases there, that's where that's coming from.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah, that mix.\n\nJoel Anderson -- President and Chief Executive Officer\n\nIt's probably about a third -- each one of those three components make up our average unit retail changes.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nBut from an overall improvement in the business, it's really coming from across the board in terms of a product perspective.\n\nOperator\n\nAnd our next question will come from Michael Lasser with UBS. Please go ahead.\n\nMichael Lasser -- UBS -- Analyst\n\nGood evening. Thanks a lot for taking my question. Ken, so you need a 3% comp to generate some margin expansion next year. Presumably, that's not the new norm for the leverage point given that you'll have some unique expenses roll back into the base.\n\nSo, what -- A, what is the new -- or what is the long-term sustainable comp point -- comp amount that you'll need to lever expenses? And what happens if your sales are flat in 2023, how much margin compression would you see just given there's a lot of uncertainty in the macroenvironment into next year?\n\nJoel Anderson -- President and Chief Executive Officer\n\nLet me just take that beginning, and, Ken, I'll hand it over to you. I just -- I want to -- I jumped in there, and then I'll let Ken answer it specifically, Michael, because I don't think the scenario -- I mean, Ken give you a 3% scenario, but I don't think the scenario everyone on this call should be thinking about is a flat comp. I think, you know, clearly, as we get to March and if the world changes again, you know, I don't unwind that comment. But, you know, I think with all the initiatives we've got focused on, what we told you all at the Investor Day, we're pushing ahead with all those.\n\nAnd, you know, we outlined, you know, 3% to 5% the next three years. We're working our way into that for next year. And I think the 3% is still the right way to think about it. You know, if you take our historical low single digit, you add in the benefits of conversions, you know, that's what starts to push us at three or higher.\n\nWe're not ready to go any higher than that yet. But I would caution everyone from getting off of a flat comp. Ken, I don't know if you want to --\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYes. So, Michael, if you take it a little further because you're asking -- you know, you're going a little further out in terms of the timing here. Just to remind everybody, 2022 was a pretty unique year. And because of a lot of things that happened this year, they're having an impact on next year, right? I spoke about some of those headwinds which are really carryovers from this year, you know, reduced incentive compensation, some of those cost management strategies, and some other things.\n\nSo, there's a lot going on there to unpack. But how I would answer you would go back to our Investor Day where, you know, Joel just spoke about our expectations from a top-line perspective. And I think one of the things that we emphasized was our ability to lever on a, you know, kind of a higher basis, right, in terms of higher leverage given the investments that were behind us, specifically in areas like the distribution network and some other things, technology, that we would have an increased ability to leverage as we move forward. At this point, obviously, I can't provide any specifics.\n\nAnd, you know, we need a little bit more time for that. But I would think that that's probably the key takeaway from, you know, a profit profile for us longer term and then operating leverage embedded in that.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, I don't see anything longer term, Ken. That said, our leverage tipping point needs to stay up at the, you know, 3%, 4% where we used to be.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah.\n\nJoel Anderson -- President and Chief Executive Officer\n\nWe just got to get through '23 first.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah.\n\nJoel Anderson -- President and Chief Executive Officer\n\nHopefully, that gives you some color there, Michael. Thank you.\n\nOperator\n\nAnd our next question will come from Michael Montani with Evercore ISI. Please go ahead.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nHey, thanks for taking the question. Just wanted to follow up. You know, Joel, you mentioned about the new store side earlier. Can you give any sense for the remodel conversion front, you know, in Five Beyond next year? Can we think 300-plus? And just remind us what the capex is for those.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah, I think a 300-plus number is certainly a number. You know, at this point, we're still putting all that together, Michael, but I wouldn't certainly expect it to be less than 300 at all -- at any stretch. It'll probably be a little bit north of that number. And, you know, what we will lay out for all of you is, you know, we get, certainly in the March call, is not only how many but some of the timing behind that.\n\nAnd then, you know, Ken.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nFor the investment?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nOr the build-out per store. Yeah, Michael, that varies, depending on the type of conversion that's taking place, depending on the age of the store. It's a more -- if it's a more recent store, it can be pretty low actually, you know, down below $100,000. If it's a full, you know, versus an older vintage type store, it will cost pretty much the same as it would for building a new store.\n\nJoel Anderson -- President and Chief Executive Officer\n\nBut the overwhelming majority of those are going to be less than 100K.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah.\n\nJoel Anderson -- President and Chief Executive Officer\n\nRight? It's not -- that's about where we're thinking about it.\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nYeah.\n\nJoel Anderson -- President and Chief Executive Officer\n\nThanks, Michael.\n\nOperator\n\nAnd our next question will come from Krisztina Katai with Deutsche Bank. Please go ahead.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nHey, guys. Good afternoon and congrats on a really good quarter. I was just wondering, you know, thinking about share of wallet, you did mention in your prepared remarks that you are working to leverage data for more effective messaging. You also invested in marketing more heavily in the back half of the quarter.\n\nSo, can you maybe talk about the customer response that you saw because it does seem like it could be a pretty meaningful opportunity looking ahead, especially to drive brand awareness?\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Thanks, Krisztina. And that's really why we invested in tokenization. And, you know, starting with November here is our first month where we have, you know, year-over-year statistics on -- at the customer level.\n\nYou know, we used to really only have it at the DMA level. But, you know, I would tell you -- you know, so we'll have that data going forward, which will answer your question specifically. I think as I look backwards, I really have to use, you know, transactions as a proxy for trend -- for traffic. And we saw transactions improve, you know, throughout the second half of the third quarter.\n\nAnd, you know, that is a really good sign that says our marketing is working. You know, customers are looking for value. And then what we'll be able to, you know, start to give you -- all of you, as we look at fourth quarter here and beyond, is, you know, start to see what the mix of our customer is, you know, specifically who's coming in after we advertise. So, I just need a little bit more time so we can get off of kind of the old way we've done it.\n\nBut, you know, short of having a loyalty or a credit card, our tokenization work, which, you know, started in November last year, that which then, therefore, means this is the first year I've got year-over-year trends. We'll have that, you know, starting '23 for you. Thanks, Krisztina.\n\nOperator\n\nThis concludes our --\n\nJoel Anderson -- President and Chief Executive Officer\n\n[Inaudible]\n\nOperator\n\nGo ahead.\n\nJoel Anderson -- President and Chief Executive Officer\n\nNo, go ahead, operator. No, go ahead.\n\nOperator\n\nI was going to say this concludes the question-and-answer session. I'd like to turn the conference back over to Joel Anderson for closing remarks.\n\nJoel Anderson -- President and Chief Executive Officer\n\nYeah. Thanks, operator. Sorry for jumping on top of you there. Hey, thanks, everyone, for joining us today.\n\nAnd, you know, just a reminder for everyone, as always, you know, I think -- we tried to communicate it today. Our purpose here at Five Below is to deliver exceptional value and wow for our customers. And value is even more important this holiday than ever. We are extremely confident that we have sourced a terrific selection for this fourth quarter of value products that will wow our customer.\n\nWe are the go-to destination for stocking stuffers and gifts. And we also believe in the value and giving back to our communities. And right now, we are currently with Toys for Tots. This is something we've done for over 10 years now, and I encourage all of you to visit our stores and help make a donation and a difference for Toys for Tots.\n\nLook, in conclusion, I want to thank all of our teams here at Five Below for their continued hard work in making this a great company and brand. I look forward to speaking with all of you after the holidays. Have a great day and happy past Thanksgiving. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChristiane Pelz -- Vice President, Investor Relations\n\nJoel Anderson -- President and Chief Executive Officer\n\nKen Bull -- Chief Financial Officer and Treasurer\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nPaul Lejuez -- Citi -- Analyst\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nJason Haas -- Bank of America Merrill Lynch -- Analyst\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nEric Cohen -- Gordon Haskett Research Advisors -- Analyst\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nMichael Montani -- Evercore ISI -- Analyst\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nMore FIVE analysis\n\nAll earnings call transcripts"
}