{
  "companyName": "Blackstone Inc.",
  "companyTicker": "BX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/blackstone-inc-bx-q3-2022-earnings-call-transcript/",
  "content": "Blackstone Inc. (BX -0.75%)\nQ3 2022 Earnings Call\nOct 20, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Blackstone third quarter 2022 investor call hosted by Weston Tucker, head of shareholder relations. My name is Ben, and I'm your event manager. [Operator instructions] And now I would like to hand it over to your host. Weston, the floor is yours.\n\nWeston Tucker -- Head of Shareholder Relations\n\nGreat. Thanks, Ben, and good morning, everyone, and welcome to Blackstone's third quarter conference call. Joining today are Steve Schwarzman, chairman and CEO; Jon Gray, president and chief operating officer; and Michael Chae, chief financial officer. Earlier this morning, we issued a press release and slide presentation, which are available on our website.\n\nWe expect to file our 10-Q report in a few weeks. I'd like to remind you that today's call may include forward-looking statements, which are uncertain and outside of the firm's control and may differ from actual results materially. We do not undertake any duty to update these statements. For a discussion of some of the risks that could affect results, please see the Risk Factors section of our 10-K.\n\nWe'll also refer to non-GAAP measures, and you'll find reconciliations in the press release on the shareholders page of our website. Also, please note that nothing on this call constitutes an offer to sell or solicitation of an offer to purchase an interest in any Blackstone fund. This audiocast is copyrighted material of Blackstone and may not be duplicated without consent. On results, we reported GAAP net income for the quarter of $4 million.\n\nDistributable earnings were $1.4 billion or $1.06 per common share, and we declared a dividend of $0.90 per common share, which will be paid to holders of record as of October 31st. With that, I'll turn the call over to Steve.\n\nSteve Schwarzman -- Chairman and Chief Executive Officer\n\nThank you, Weston. Good morning, and thank you for joining our call. The third quarter of 2022 was a continuation of one of the most difficult periods for markets in decades. Global markets extended the dramatic sell-off to characterize the first half of the year.\n\nThe S&P 500 falling another 5%, bringing the year-to-date decline to 24%. The public REIT index was down 10% in just a quarter and 28% year to date. The NASDAQ fell 32% year to date. And in debt markets, high-grade and high-yield bonds declined 14% to 15% in the first nine months of the year.\n\nOur inflation, rising interest rates and a slower economy, combined with ongoing geopolitical turmoil, have created an extremely difficult environment for investors to navigate. The traditional 60-40 portfolio is down over 20% year to date, its worst performance in nearly 50 years and sentiment in almost all areas is likely to remain negative, given the Fed's commitment to continue increasing interest rates to combat inflation. Against this highly challenging backdrop, Blackstone delivered excellent results for our shareholders. Fee-related earnings for the third quarter rose 51% year over year to $1.2 billion, representing our second best quarter on record.\n\nWe generated strong distributable earnings of $1.4 billion or $1.06 a share, as Wes noted. While most money managers focusing on liquid markets have seen declining AUM, we've continued to grow. Our assets under management increased 30% year over year to a record $951 billion, with strong demand for our products across the institutional private wealth and insurance channels. Just last week, we announced our fourth major partnership in the insurance space with Resolution Life, a leading life and annuity block consolidator, which we expect to comprise approximately $25 billion of AUM in the first year and over $60 billion over time as their platform grows.\n\nKey to Blackstone success with our customers is that we have protected their capital through these remarkable market declines. One of our core principles since we founded the firm in 1985, is to avoid losing our clients' money, and we've done an excellent job of that. As the largest and most diverse alternatives firm in the world, we have unique access to data and insights on what is happening in the global economy, allowing us to anticipate trends and we believe, minimize risk. We then carefully choose sectors and which type of assets to buy and actively work to build great companies and platforms.\n\nWe use this advantage as well to help determine areas of focus in the liquid securities area. This synergistic approach has led to distinctly strong positioning across our business today. For example, in real estate, approximately 80% of our portfolio is in sectors where rents are growing above the rate of inflation, including logistics, rental housing, life science office and hotels. In corporate private equity, our emphasis on faster-growing companies has resulted in a 17% year-over-year revenue growth in our operating companies in the third quarter, led by our travel leisure-related holdings.\n\nAt 17% growth in revenue, as the economy is slowing all over the world. This is a stunning result, given the size of our portfolio which, in total, across our private equity business employs approximately 500,000 people. In corporate and real estate credit, we benefit from close to 100% floating rate exposure, and we're experiencing negligible defaults. And our hedge fund solutions business is performing remarkably well with the BPS composite achieving positive returns in the third quarter and every quarter so far in 2022.\n\nThis is a highly differentiated outcome in liquid securities compared to the year-to-date decline of 24% in the S&P. Blackstone's long history of outperformance and capital protection is, of course, critically important to our LPs and their constituents. They have found it difficult to achieve their objectives by investing in traditional asset classes alone. That's why LPs around the world are choosing to increase allocations to alternatives, in particular, to Blackstone.\n\nRecent research from Morgan Stanley estimates that private markets AUM will grow 12% annually over the next five years. We shared growth in areas such as infrastructure, real estate and private credit as investors seek yield and inflation protection. All areas of distinctive competence here at Blackstone. From a channel perspective, Morgan Stanley predicts the greatest growth among individual investors, with allocations to alternatives from high net worth investors more than doubling in five years to 8% to 10% of their portfolios.\n\nThis represents a major paradigm change when we identified over a decade ago and trillions of dollars of opportunity which Jon will discuss in more detail. Blackstone is the clear leader in this channel with the largest market share among alternative managers. Blackstone occupies a special status with customers and potential customers around the world. They are facing significant uncertainties today and are looking to us to help them navigate these challenges.\n\nAnd we believe we are uniquely positioned to do so. We are proud of the trust that they place in us and we remain steadfast in our mission to serve them. In closing, our firm has prospered across the many cycles of the past 37 years since we started. We had no assets then.\n\nAnd today, we're closing in on $1 trillion of AUM. Historically, we've taken advantage of the pullbacks to deploy significant capital at attractive prices, extend our leadership position across business lines and invest in new initiatives as well as in our people. For our shareholders, this has translated into extraordinary growth, and we have no intention of slowing down. We are in the early innings of penetrating new channels and markets with enormous potential.\n\nThe firm's earnings power continues to expand, concentrated in the highest quality earnings. Even though the investment climate is challenging, we have the confidence, the resources and the loyalty of our customers and our people. We continue to develop our franchise for the benefit of all of our constituencies. And with that, I'll turn it over to Jon.\n\nJon Gray -- President and Chief Operating Officer\n\nThank you, Steve. Good morning, everyone. Our business is all about delivering for our customers in rain or shine and the third quarter was no exception. Our investment performance again demonstrated the durability of our model along with the benefits of our thematic investing, as Steve highlighted.\n\nMeanwhile, the firm's strong results have allowed us to continue expanding who we serve and where we can invest even in the most difficult of times. I'll update you on the multiple avenues of growth we have in front of us. Starting with our drawdown fund business. With the support of our LPs, we are progressing toward our $150 billion target with more than half achieved at this point.\n\nWe've largely completed the fundraise for two of our three largest flagships, global real estate and private equity secondaries and have launched their respective investment periods. Our corporate private equity flagship has raised $14 billion to date, and we expect it to be at least as large as the prior fund. In credit, we've closed on $4 billion for a new strategy focused on renewables and the energy transition and expect to reach our target of $6 billion to $7 billion in the coming quarters. We believe, the largest private credit vehicle of its kind.\n\nThis is an area where we see tremendous secular tailwinds and where we reported additional inflows in the quarter in growth equity, tactical opportunities and private equity energy. While the market environment will remain a headwind for the industry overall, we are in a differentiated position given the diversity of our platform, global reach and the power of our brand. Turning to private wealth, one of the long-term megatrends transforming the market landscape is that individual investors are finally getting access to alternatives in a form and structure that works for them. This development has been led by Blackstone and our distribution partners, and the response has been powerful.\n\nWe now manage $236 billion of private wealth AUM, up 43% in the past 12 months alone. In the third quarter, sales in this channel totaled $8 billion, including $6.6 billion for our perpetual vehicles. We do also offer limited repurchases in the perpetuals, which totaled $3.7 billion. As we discussed last quarter, stock market volatility meaningfully impacts net flows in these vehicles.\n\nThat said, this is a vast and underpenetrated market, and our products have outstanding performance and positioning. BREIT's net returns since inception six years ago is 13% per year or 4x the public REIT index. Nearly 80% of BREIT's portfolio is comprised of logistics and rental housing, some of the best-performing sectors with short duration leases and rents outpacing inflation. BCRED has generated an 8% annual net return since inception and with a floating rate portfolio, returns benefit as interest rates move higher.\n\nLooking forward, we plan to launch more products in this channel, deepen penetration with existing partners and add new relationships around the world. Moving to our institutional perpetual business, which is over $100 million across 42 vehicles, up 37% year over year, including our institutional real estate core+ platform and infrastructure. Our infrastructure business nearly doubled year over year to $31 billion on the back of excellent performance. Both platforms continue to benefit from their focus on hard assets in great sectors with strong fundamentals, helping drive positive appreciation in the quarter and year to date.\n\nTurning to insurance. Our AUM has doubled in the past 12 months to over $150 billion. We've now added a fourth large-scale mandate with Resolution Life, as Steve noted, which is one of the leading closed block consolidators servicing the multitrillion dollar life and annuity market on a global basis. This is another example of our strategy to serve as an investment manager for multiple insurance clients without becoming an insurance company ourselves or taking on liabilities.\n\nOver time, we expect more than $250 billion of AUM from existing clients alone, several of which have an added tailwind from greatly accelerated annuity sales. Our deep investment expertise and capabilities in private credit in particular, uniquely position us to serve insurance clients. Stepping back, private credit represents another long-term mega trend in the alternative sector. We can leverage our expansive platform to directly originate yield-oriented investment products for our clients, including insurance companies as well as institutional and individual investors.\n\nAnd we see a particularly favorable environment for deployment today as base rates have increased significantly and spreads have widened, all while traditional sources of financing have pulled back. With over $320 billion of AUM across our credit and real estate credit businesses, we've built one of the largest platforms in our industry but still comprise a tiny fraction of these markets overall. We are quite excited about the long-term potential. Taken together, our diverse range of growth engines drove total inflows of $45 billion in the third quarter and a record $183 billion year to date, a period in which markets experienced some of the worst declines on record, as Steve discussed.\n\nThese results more than anything, speak to the strength of our brand and the trust our clients place in us. And with a record $182 billion of dry powder capital, we have the ability to take advantage of dislocations. In closing, despite the many challenges of today's investment environment, we are well positioned to navigate the road ahead. I could not have more confidence in our firm and our people.\n\nFor our shareholders, we continue to achieve significant growth while remaining true to our capital-light model, allowing us to return 100% of earnings over the past five years through dividends and share buybacks. We are totally focused on delivering for all of our stakeholders. And with that, I will turn things over to Michael.\n\nMichael Chae -- Chief Financial Officer\n\nThanks, Jon, and good morning, everyone. The firm's third quarter results highlight a business model designed to provide resiliency in difficult markets. At the same time, we are advancing through the largest fundraising cycle in our history which, coupled with our expanding platform of perpetual capital strategies is setting the foundation for a material step-up in FRE. I'll discuss each of these areas in more detail.\n\nStarting with results. One of the best illustrations of the durability of our financial model is the continued powerful trajectory of fee-related earnings. In the third quarter, FRE increased 51% year over year to $1.2 billion or $0.98 per share, powered by 42% growth in fee revenues, along with significant margin expansion. With respect to revenues, the firm's expansive breadth of growth engines lifted management fees to a record $1.6 billion, up 22% year over year and 4% sequentially from quarter 2.\n\nAt the same time, the continued scaling of our perpetual strategies, combined with strong investment performance across those strategies, led to $372 million of fee-related performance revenues. With respect to margins, FRE margin for the nine months year-to-date period expanded nearly 100 basis points from the prior year comparable period to 56.5% and is tracking above our previous expectation. We now expect full year 2022 margin to be in the same 56% area, in line with 2021. Distributable earnings were $1.4 billion in the third quarter, underpinned by the robust momentum in FRE.\n\nNet realizations declined year over year as the market environment unit activity levels as expected. While the backdrop for exits is likely to remain less favorable in the near term, one of the key attributes of our model is that we can focus on executing our operating plans and creating value for the long term, patiently waiting to identify the optimal opportunities for monetization. In the meantime, the firm's performance revenue potential continues to build. Performance revenue eligible AUM in the ground grew 26% year over year to a record $494 billion.\n\nNet accrued performance revenues on the balance sheet stand at $7.1 billion or nearly $6 per share, down over the past few quarters primarily due to record realization activity, but still double its level of two years ago. Moving to investment performance. As Steve noted, against the backdrop of continued pressure in global equity and credit markets, our funds protected investor capital, Core+ real estate, credit and BAM appreciated 1% to 3% in the quarter. In corporate private equity and opportunistic real estate, values were largely stable, and Tac Opps saw modest depreciation of approximately 2%.\n\nThese returns included the negative impact of currency translation for our non-U.S. holdings related to the stronger U.S. dollar. New additional observations on our returns.\n\nFirst, in private equity, our portfolio companies historically have been held at a meaningful discount to public comps in terms of valuation multiples, which continues to be true today. In alignment with that, in terms of outcomes, exits have occurred at a significant premium compared to unaffected carrying moms. Second, in real estate, in the context of rising interest rates, we've materially increased cap rate assumptions across the portfolio. Notwithstanding this impact, our real estate strategies have still seen strong appreciation year to date as cash flow growth and dividends have more than offset the impact of wider cap rates.\n\nTurning to the outlook, just characterized by the firm's continuing progression toward higher and more recurring earnings. As we highlighted last quarter, we expect the combination of our drawdown fundraising cycle, along with the growing contribution from perpetual strategies to lead to a structural step-up in FRE over the next several years. In terms of the drawdown funds, we launched the investment period for the global real estate flagship in August with an effective four-month fee holiday for first closers. We will launch other funds over time depending on deployment.\n\nWith respect to perpetual strategies, we previously discussed the layering effect of fee-related performance revenues and noted that BPP in particular has four times more AUM subject to crystallization in 2023 than in 2022. At the same time, the private wealth perpetual vehicles have continued to compound in value with fee-earning AUM increasing $27 billion at the start of this year and $94 billion in total, setting a higher baseline for fee revenues going forward. As Jon described, these vehicles remain exceptionally well positioned. And for BCRED specifically, it's worth highlighting that the driver of fee-related performance revenues is investment income, borrowers paying interest, which has a high degree of visibility.\n\nOverall, the dual catalyst of our drawdown fund-raising cycle and the ongoing perpetualization of our business give us confidence in the multiyear outlook for FRE. One final item of note, last month, our insurance client, Corpbridge, successfully completed its IPO despite the extremely difficult capital markets backdrop. This represented an important milestone in their evolution as a stand-alone public company. Blackstone was not a seller in the offering nor was Corpbridge, and we are committed to being shareholders for years to come.\n\nWe have a very positive view on the value of the company, including the expected benefits from increasing base rates and widening spreads. We have been pleased with the success of our partnership to date and look forward to continuing to deliver for them as their exclusive investment manager for key asset classes. In closing, the firm is in an excellent position today, our all-weather model protects us in times of stress and provides a powerful foundation for future growth. We have great confidence in what the firm will achieve in the years ahead.\n\nWith that, we thank you for joining the call and would like to open it up now for questions.\n\nOperator\n\nThank you. [Operator instructions] And with that, I would like to proceed to our first question, which is coming from Craig Siegenthaler from Bank of America. Craig, please go ahead.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, Steve, Jon. Hope everyone is doing well. \n\nSteve Schwarzman -- Chairman and Chief Executive Officer\n\nGood morning, Craig.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nMy question is on fundraising. There's been multiple headwinds this year with the crowded private equity backdrop denominator effect and it seems some weakness with U.S. pension plans, although probably more strength from sovereign wealth funds. But we haven't seen this really impact Blackstone's results yet with strong fundraising again last quarter.\n\nCan you provide us an update on the fundraising front and Blackstone's overall ability to grow organically if the bear market extends into next year?\n\nJon Gray -- President and Chief Operating Officer\n\nSo Craig, I think it's worth starting with our quarter in the first nine months. The fact that we raised $45 billion in the quarter, $183 billion in the first nine months, which is 60% higher than our previous best in an environment when equities were down 25% and bonds down 15% is pretty remarkable. And I think what it reflects, of course, is our long-term track record delivering for customers, the power of our brand, the breadth of what we're doing today. Obviously, the expansion into these new areas in insurance in Core+ real estate, in direct lending, alternative fixed income and then continuing to grow our traditional drawdown business as well where we move into new spaces like life sciences and growth equity, continue to grow our original businesses.\n\nAnd so what you see is sort of a growing platform built on the backbone of successful performance and then exploiting all these new channels. And then geographically, I think unlike some other managers, we've got the benefit of raising money in the U.S. but also around the world and other regions that are not as capital constrained. And all of that has led to our strong performance.\n\nTo your specific question, I would acknowledge, it's harder out there. Investors are more capital-constrained. I think it will be tougher from any groups to raise capital, and that will be until markets get better, a bit tougher. But I would say, overall, when you talk to our customers, you don't hear a lot saying they want to reduce their allocation to alternatives.\n\nThey've got a favorable view. It's been their best performing area. They may be a bit constrained by the denominator effect today, but they want to continue with this. And then for us, we've got this differentiated spot.\n\nSo tougher, but we feel very good about where we sit.\n\nSteve Schwarzman -- Chairman and Chief Executive Officer\n\nYeah, I'd just add that starting from our -- this is Steve, from our first fund in 1987, we have a very significant component of non-U.S. investors. And I think at a time when the U.S. is less favorable because of the factors you mentioned in the pension funds, the fact that we are so global for so long, those type of relationships tend to be enduring and personal because people are coming from foreign countries and foreign cultures.\n\nAnd when they decide that they want to trust, you make significant commitments and then you deliver time after time after time. There's a certain bond that you have and the flows, as Jon mentioned, have been more directed outside the United States, and that gives us just a terrific balance of where we can go to raise money.\n\nWeston Tucker -- Head of Shareholder Relations\n\nThank you. And Ben, before we move on to the next question, if I could just clarify the operator's instructions. We have a long queue, and I just want to make sure we get to everyone. So if we could limit the first to one question.\n\nIf you have a follow up question, please come back into the queue. I just want to make sure we get to everyone this morning.\n\nOperator\n\nThank you. Our next question is coming from Ben Budish from Barclays. Please proceed.\n\nBen Budish -- Barclays -- Analyst\n\nHi, guys. Thanks so much for taking the question. I wanted to ask about kind of your outlook for the underlying portfolio of companies. Jon, I know you gave some commentary this morning that there's a little bit more caution than you guys kind of mentioned in the prepared remarks that there's a bit of a skew toward travel and leisure, which are a bit more discretionary.\n\nSo can you maybe comment on how you see performance there over the next six to 12 months?\n\nJon Gray -- President and Chief Operating Officer\n\nSo as I said, what's remarkable is the U.S. economy, in particular, has been very strong. Europe has held up better than people expected, places like in year strong. As a data point here, the fact that we saw 17% revenue growth in our private equity portfolio said something, I think, pretty profound that there's still a lot of strength, and it also reflects that sector selection.\n\nSo the fact that we've done so much in private equity, in travel and leisure bodes well for us. Our energy infrastructure, energy transition assets are all doing quite well. I think where we've positioned ourselves has helped us. And it's similar for us in the real estate market, as Michael commented on the positioning in such a big way in logistics and then rental housing hotels, all areas with strong growth.\n\nOverall, back to your comment, we do think we'll see a slowdown there. It's just inevitable. When you take the cost of capital from 0% to 4% and debt capital widens even more with spreads widening, people start to think about deleveraging, paying down their debt. They're less focused on expansion.\n\nThere's more caution and that's going to lead to a slowing that will happen over time. And that's what we're anticipating, and that's what we're telling our companies. So I think that's something that all companies need to think about in terms of how severe it is, I think it's hard to say. What I would comment on is we're in a much better spot as a global economy than we were back in '08, '09.\n\nWe don't have the same kind of overleverage we had back then in housing, in commercial real estate, in banking institutions. So that makes you feel better, but there's no question, there is a slowing coming here. We should anticipate that. And obviously, the stock market has been thinking about that.\n\nBen Budish -- Barclays -- Analyst\n\nOK, great. Thanks for taking my question.\n\nOperator\n\nThe following question comes from Michael Cyprys from Morgan Stanley. Michael, please proceed.\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nHey. Good morning. Thanks for taking the question. I wanted to ask about the U.K.\n\nand Europe. We've seen some very sharp moves in currency and interest rates there. So just curious how you see the opportunity set there evolving for putting capital to work. Is now the time for buying trophy properties or companies in the U.K.\n\nor Europe? And also, we've seen some funds that implement LDI strategies become for sellers of assets. Just curious what you're seeing on that front and what sort of opportunity set that might offer for you. Thank you.\n\nJon Gray -- President and Chief Operating Officer\n\nThanks, Mike. Obviously, the U.K. and Europe faced some real challenges in the near term. There is the inflation challenge driven by their energy challenges, which are much more pronounced than what we have in the United States.\n\nTheir central banks need to raise rates in order to maintain their currencies and not have further inflation. In addition, as they raise rates, their housing markets, many of them tend to have floating ready mortgages versus our 30-year fixed rate model, which puts additional pressure on the European economies. I would say, to date, things have held up better and our companies have performed better than you would expect. Companies are adapting to the higher energy prices and their usage and efficiency.\n\nBut it is going to be a challenging period. I think as investors, what you have to overlay against that is just how much the currencies have moved and how much the valuations have moved down. You've seen currency movements here of nearly 20% in Europe and the U.K. And you look at the U.K., in particular, the stock market there is trading at below nine times earnings.\n\nSo we look at that and say, wow, these are interesting places, a bunch of the thematic trends we like could be around travel, could be around technology, infrastructure, logistics. There are still attractive assets in Continental Europe and the U.K. you have prices and investor enthusiasm has gone down. And so to us, that makes for an attractive entry point, sometimes it takes time for these things to manifest themselves.\n\nBut we think we'll be busy in Europe over the next few years. I would say on the LDI question, in particular, there was some selling, as you know, of CLO paper. We, like others, participated in that. It seems to have abated at this point.\n\nBut I wouldn't be surprised, as rates move up, that there are other for sellers as pressure grows in the system. And then back to our model, $182 billion of dry powder, the ability to make decisions really quickly, to move quickly there are periods of dislocation. It happened back in Brexit. It happened back in '08, '09.\n\nWe try to take the opportunity to deploy capital on behalf of our investors. So I think you have to be cognizant of the economic challenges in Europe, but open-minded to the opportunities given the repricing that's underway there.\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe following question comes from Brian Bedell from Deutsche Bank. Brian, please go ahead.\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nGreat. Thanks. Good morning, folks. Maybe just wanted to touch on the energy transition, Jon, that you mentioned, the successful rating of the private credit green energy strategy.\n\nI guess maybe talk a little bit about that strategy in general in terms of that investment opportunity set? And then are you seeing demand come more from retail in this product? Or is this really more traditional? And I know you baked in ESG considerations across the investment processes across all investments, but what is the desire to expand a more dedicated impact energy transition platform across all the verticals?\n\nJon Gray -- President and Chief Operating Officer\n\nThank you, Brian. What I would say this area is about for us is providing credit to this enormous energy transition that is underway. So if you think about the trillions of dollars that need to be spent to move us from a 85% dependency in the U.S., a little bit lower in Europe on hydrocarbons to a lower number, it's going to require a lot of equity. It's going to require a lot of debt.\n\nTo us, the most [Audio gap] form of financing is not necessarily financing finished projects, which liquid investors will pay, will accept very low for in order to hit their net zero targets. We think if you back developers, as we've been doing successfully of projects, if you lend to some of the service providers in the space, if you lend to consumers, we've been very active in providing financing in the solar market to consumers. We think this is a good way to go because there's an enormous need for capital. And so we're excited about [Audio gap].\n\nWe're also excited about our energy equity area as well for similar reasons because of the need for capital. And in our infrastructure, we've been doing a lot. We made a large investment we talked about six months ago in Invenergy, which is the largest builder of solar and wind projects in the United States. I would say, as it relates to ESG overall, the driver for us is being a fiduciary and deliver to our customers.\n\nThey're focused on this area. We also see a big opportunity set because of the need for both debt and equity capital. We think we're building new platform and ecosystem. We said publicly, we want to invest $100 billion in this area across our various platforms over the next decade.\n\nI think we can do that and generate favorable returns. So I'd say it's an exciting area that is still in the early days of its expansion.\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nI'll get back in the queue for another question. Thanks.\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nMoving to our next question from Alexander Blostein from Goldman. Alexander, please proceed.\n\nAlex Blostein -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks, everybody. Thanks for taking the question.\n\nI was hoping we could spend a couple of minutes on real estate as a concern in the public market seeing where those shares are trading for public REITs. Jon, you've been very clear in terms of how Blackstone portfolio is different and differentiate yourself staying short duration and leading into areas of secular growth. I'm curious from a fundraising perspective, how are institutional real estate today in the context of kind of private markets allocation broadly, with rates, I guess, where they are today, why is real estate still an interesting place to particularly around core products. And as you think about the forward growth for Blackstone and real estate outside of the opportunistic funds, how do you envision those [Audio gap] call it, 18 to 24 months?\n\nJon Gray -- President and Chief Operating Officer\n\nThanks, Alex. I guess I'd step back and say the reason hard assets are interesting in an environment like this is because the replacement cost goes up pretty significantly. In inflationary environment, the cost to build the labor cost, which is a big component has gone up and probably the largest input cost of money goes up significantly. And the yield on cost that you need to build a new project goes up.\n\nSo I was talking to a major apartment developer who build 15,000 units he has under construction today. He said next to cut his budget to 4,000 units, a 75% decline in terms of his new construction. So what you see happen in an environment like this is you start to see a reduction in new supply, which is obviously helpful in the long term and these hard assets are beneficial because they don't have much exposure to input costs, and there's going to be a few of them, as I said, built. So that argument for investing into hard assets.\n\nThe challenge, of course, is in a rising rate environment, if you own a hard asset feels like a bond, or worse an older office building, then I think you're going to see a challenge to value because the income is not growing much and rates have gone up. On the other hand, if you're in rental housing and you have pricing power or logistics, where we're still seeing in the U.S., 30% increases in rents. In Europe, nearly 20% increases in rents. The duration of [Audio gap] is short.\n\nEven as the cap rates go up, you can still see value appreciation, albeit at a lower rate. So as it relates to institutions, yes, they become more cautious in this environment, so they don't allocate quite as much. They pause, we've seen this before. But as you get to the other side of this, healthy real estate fundamentals.\n\nAnd by the way, unlike almost every other down cycle, what we have going into this, particularly in rental housing is low rates of vacancy and limited new supply and a lot less leverage. So we go into this in a better. And then as a result, we start to see this sharp decline in new supply, it should be even better coming out. So I think long-term assets real estate, which is obviously a big area of focus for us.\n\nIt is a really good area to be in. And then I would just say, obviously, we have we're -- our scale is larger than anyone else in the world. We see more on the ground than anybody. We have access to capital, both debt.\n\nSo it's an area we continue to have a lot of confidence in even if there are some near-term headwinds.\n\nAlex Blostein -- Goldman Sachs -- Analyst\n\nGreat. Thanks very much.\n\nOperator\n\nThe following question comes from Gerry O'Hara from Jefferies. Gerry, please go ahead.\n\nGerry O'Hara -- Jefferies -- Analyst\n\nGreat. Thanks for questions this morning. Just maybe sticking with the rate environment a little bit and picking up on some questions -- on a comment Steve made earlier. But can you kind of talk broadly a little bit about how the rising rate environment could potentially put pressure on the LP dynamics from -- I mean from an LP and I'm thinking about kind of getting more attractive rate exposure from fixed income and relative to less liquid private markets.\n\nJust kind of -- would be curious to get some color on how that dynamic might play out going forward.\n\nJon Gray -- President and Chief Operating Officer\n\nWell, it does, I think, impact some investors. Fixed income starts to look more attractive. But if you think about our clients and their long-term obligations, the rates they want to produce are generally above investment-grade fixed income. And so I don't think they can move their portfolios out of alternatives in a meaningful way.\n\nIt has been their best performing sector. And if anything, what they may say is, you know what, I'm really interested in private credit because I get the benefit of short duration income as the Fed raises rates. So I'm interested in doing that. That's attractive.\n\nI'm interested potentially in infrastructure because it's got inflation hedges and income streams that are often tied to CPI or RPI in Europe. And so I'm interested in that. We haven't really seen a movement out of the complex. We still see people interested in the sector.\n\nThe composition of where they allocate could change. But the other thing I'd say about our investors is they've been at this a long time, the institutional ones in particular, and they don't want to just be procyclical. So they know that to leave growth equity after the tech market sold off in a big way, doesn't make a ton of sense. The same thing in private equity.\n\nAnd if you went back to the early 2000s, you went back to '08, '09, leaving these sectors and time prices go down is not the best decision. So I'd say they take a longer-term view. They're sticking with what they've done. They may reallocate a little bit.\n\nI think private credit will be a beneficiary, and that's something obviously we do in scale. But I don't see any sort of large-scale movement away from this very attractive asset class.\n\nGerry O'Hara -- Jefferies -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe next question comes from Bill Katz from Credit Suisse. Bill, please proceed.\n\nBill Katz -- Credit Suisse -- Analyst\n\nOK, thank you very much, and good morning, everyone. And thank you for taking the question. Maybe one for Michael to mix up a little bit. Just want to unpack your discussion on the FRE margin at 56 and a half percent, which sounds like a bit of a pickup in guidance.\n\nCan we unpack that a little bit just between how you sort of see the FRE dynamics if you were to strip out the performance fee-related contribution? And maybe if you could comment on just sort of the base payout rate, the comp payout rate. This quarter looked like it was particularly low ex performance fees and how you sort of see the two payout ratios into the new year? Thank you.\n\nMichael Chae -- Chief Financial Officer\n\nSure, Bill. Look, I think, as you know, we always encourage folks to look at margins over longer time frames, not just a single quarter, given interior movements and puts and takes in any period. And so as I said and framed on the -- in my remarks, on a nine-month year-to-date basis, margin is up 100 basis points. And in terms of the key drivers, which is getting at your question on the expense side, just to unpack it, with respect to compensation expense, similarly, looking at that on a year-to-date basis, our comp ratio is stable.\n\nIt's right in line with the year ago, maybe within 30 basis points. And then in terms of opex, noncomp operating expense, it actually declined quarter over quarter about 6% driven by a range of factors. T&E, which we talked about in the past couple of quarters, is still higher than a year ago, but it's actually down quarter over quarter and other factors. So overall, I think what this reflects is a few things, very strong year over year and good quarter-over-quarter top-line growth, obviously.\n\nCombined with a disciplined approach to cost management, we feel very comfortable in our ability to control and carefully manage costs in our business, all within the context of continuing to invest in our people and infrastructure to support growth. So the result of all of this, we think, continues to be a very stable and healthy margin picture.\n\nBill Katz -- Credit Suisse -- Analyst\n\nOK, thank you.\n\nOperator\n\nThe following question comes from Kenneth Worthington from J.P. Morgan. Kenneth, please go ahead.\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning. I was hoping you could speak to BREIT and BPP. So first on BREIT, it looks like gross sales have been slowing.\n\nGross redemptions have been picking up. I think, Jonathan, you said higher volatility impacts flows. Could BREIT go into redemption in coming months? It looks like it may be poised there. And then on BPP, I think assets fell during the quarter.\n\nI thought that was largely permanent capital, and I think you highlighted that Core+ returns were higher. What drove the decline there in AUM?\n\nJon Gray -- President and Chief Operating Officer\n\nSo on BPP, I think the specific answer on that is currency, I think was the specific answer because...\n\nMichael Chae -- Chief Financial Officer\n\nThe translation of our European BPP plan.\n\nJon Gray -- President and Chief Operating Officer\n\nAnd Asia.\n\nMichael Chae -- Chief Financial Officer\n\nYes.\n\nJon Gray -- President and Chief Operating Officer\n\nAnd Asia. So I think that's what you saw there, not outflows out of the complex. As it relates to BREIT, as I said in my remarks, it's not a surprise that you would see a deceleration in flows from individual investors when you've had this kind of market decline. I think the number in active equity and fixed income, something like $500 billion of outflows.\n\nAnd remarkably, as you know, we've had positive inflows throughout the year, which has been pretty exceptional. I would say as it relates to near-term flows, yes, it's possible that we could see negatives over some period of time. But the key, which we keep pointing out is the performance that we've delivered and the portfolio we've built. So if you look at BREIT, the fact that we've delivered 13% per year for six years versus four times greater than the public REIT index or that BCRED has delivered 8% versus significant losses in fixed income over two years.\n\nThat, of course, makes an enormous difference. There's also the positioning of these portfolios, which is if you look at what BREIT owns, we keep talking about it, rental housing, which is the biggest contributor now to inflation, and then you look at what BCRED owns, it's floating rate debt, which is benefiting, of course, every time the Fed raises rates. And just to put a point on performance again, if you look at BREIT up 9% this year, which versus the rest of the world is, of course, quite striking. So we look at this not necessarily in the context of months or this quarter, we look at this over time.\n\nAnd we see individual investors at 1% to 2% allocated to alternatives versus institutions that are 25% to 30% allocated. And our view is with these products, what we're offering is attractive to individual investors and they will continue to find so. Does it mean we have times when things are a little difficult? Yes, in terms of flows, we saw that in March 2020. But in the fullness of time, what we think we're going to see as investors respond to our investment management performance.\n\nThat's the key driver over time.\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThe next question is from Adam Beatty from UBS. Adam, please go ahead.\n\nAdam Beatty -- UBS -- Analyst\n\nThank you, and good morning. I wanted to ask about capital deployment, which seems to have pretty much moderated across the various asset classes and categories. One of the themes in the industry echoed at Blackstone is the idea that market dislocation provides a good time to kind of deploy dry powder with higher expected returns. So I guess directionally, it was a little bit unexpected.\n\nNow, a couple of minutes ago, Jon said that sometimes referring to Europe that sometimes opportunities just take a while to manifest. So it is just a question of timing? Is there a reason that you've been holding back a little bit? And should we expect deployment to increase next quarter? Thank you.\n\nJon Gray -- President and Chief Operating Officer\n\nSo Adam, it's exactly what you referenced there, which is in a moment of dislocation, it takes time. Sellers' expectations change, they pause. Obviously, lenders, in some cases, move to the sidelines and transaction activity slows. And if you went back again to the '08, '09 dislocation, it took a bit of time.\n\nBut then ultimately, of course, we were able to plant a lot of good seeds into the right kind of environment. I would expect deployment will be muted for a bit of time. That doesn't mean we're not going to find some opportunities and that sellers won't start to get creative, providing financing, maybe taking back some equity in a transaction. I think it will build over time.\n\nBut until you get I think a little more certainty out there, until people become more confident about inflation starting to head down that rates have hit their peak levels. I think you'll see a slower level of transaction activity. I think the key for us is that we don't have to be forced investors at any time, neither buyers nor sellers. So if there is a slowdown in market activity, we can afford to be a little patient.\n\nAnd then when opportunity emerges, we can move. And I would just say that as our platform grows, I think you'll see us be able to do more and more even in a tougher environment. Areas like insurance, we can deploy capital on an unleveraged basis at very low cost relative to others. I think that will be a busy area.\n\nBut I would say an expectation of slower deployment in the near term is reasonable, but at some point, picking up meaningfully.\n\nMichael Chae -- Chief Financial Officer\n\nAnd Adam, it's Michael, I'd just add a couple of points. One is history, and we have 37 years of it, show that the vintages to straddle these periods of dislocation, which do take time to play out, prove to be really good vintages over time in terms of investment returns. And that second, our platform, which Jon referenced, our franchise is so strong and distinctive. And so our ability to access capital and debt capital in tougher markets and also our ability, I think, to engage in sort of dialogues with corporations, public companies, privately held companies, founders around capital solutions at a tough time, again, is, I think, quite advantaged.\n\nSo we'll have to be patient. It will take time to play out in terms of activity levels, but these periods of dislocation will ultimately prove to be opportunities for value creation.\n\nAdam Beatty -- UBS -- Analyst\n\nExcellent. Thank you, guys. Much appreciated.\n\nOperator\n\nThe following question is from Patrick Davitt from Autonomous. Patrick, please proceed.\n\nPatrick Davitt -- Autonomous Research -- Analyst\n\nHey. Good morning, everyone. My question on that same topic, more specific to private credit. Obviously, I appreciate your comments on better spreads and lack of competition helping you, and it looks like the deployment held up pretty well in 3Q.\n\nBut how should we think about...\n\nWeston Tucker -- Head of Shareholder Relations\n\nPatrick. We're losing you. Patrick, we're losing you.\n\nPatrick Davitt -- Autonomous Research -- Analyst\n\nCan you hear me now?\n\nWeston Tucker -- Head of Shareholder Relations\n\nYeah.\n\nPatrick Davitt -- Autonomous Research -- Analyst\n\nOK. So yeah, so I appreciate the comments on better spreads and competition helping credit deployment. And that held up pretty good in 3Q. But how should we think about the pace of credit deployment through a period of continued deterioration in deal markets? Do you think it can hold up if M&A and sponsored deal volumes, in particular, are getting increasingly anemic? And if so, what do you think kind of offsets the deal volumes being a lot lower?\n\nJon Gray -- President and Chief Operating Officer\n\nI think what offsets the fact that deal volumes are lower is the certainty that direct lenders provide to borrowers. So in an environment like this, if you're a financial institution in the distribution business, you're going to be cautious because you don't know where the end market is. And so I think direct lenders, providers of capital who aren't distributing the paper, but just holding it will have an advantage in this kind of volatile market. And so I think we're seeing that today.\n\nThere's definitely a movement toward direct lending. And it's a similar dynamic in insurance where rather than somebody distributing paper -- investment-grade paper, we're doing the direct origination for our insurance clients. So I think there will be opportunities. And I will say, when you look at the private equity market, still a lot of equity capital out there.\n\nThere's a lot of discussions. There are transactions getting done at a lower level. At some point here, inflation, as we've talked about, we'll get to a top point, rates will get there. People will begin to feel a little better and things will continue to go.\n\nAnd what's been amazing throughout this is we've continued to deliver good performance. We found some opportunities along the way and investors continue to allocate capital to us. So it gives us confidence and we've been through other cycles before. We sort of built as a firm for this.\n\nAnd we think there'll be plenty of opportunities as we get through this and get to the other side.\n\nOperator\n\nOur next question is from Finian O'Shea from Wells Fargo. Finian, please go ahead.\n\nFinian O'Shea -- Wells Fargo Securities -- Analyst\n\nHi, everyone. Good morning. Sort of staying on the same theme. Can you talk about the financing markets for funds? And if you see any impact there on growth across the platform or in any particular strategies?\n\nJon Gray -- President and Chief Operating Officer\n\nWhen you say financing for funds, you mean transaction financing?\n\nFinian O'Shea -- Wells Fargo Securities -- Analyst\n\nWell, say borrowing from banks, securitization capital markets sometimes. But yes, transaction that -- yes.\n\nJon Gray -- President and Chief Operating Officer\n\nYes, we've definitely -- as I said, we've seen a slowdown. Banks' risk appetite is lower than it was before. And spreads have gapped out. So the cost of capital if you're buying a company or buying real estate has gone up materially.\n\nWe're still because of our unique spot, if anyone can get a financing done somewhere, it's us. And I think you'll see some examples of that in the not-too-distant future. But it is harder to borrow money. And as I said, what we're going to see, I think, sellers do a little bit who want to sell is potentially provide some seller financing to get things done.\n\nThere's a lot of creativity in the deal market. And I think that some of that will emerge in this uncertain environment. But overall message is financing is generally tougher and it makes transactions harder. But I would point out, if you look at investors, if you said, are you better off in periods like 2000, 2007, 2021, where debt markets sort of our abundant -- debt is low cost, but you have to pay a lot for assets versus an environment like today, we're definitely better off as investors in an environment like today where capital is more scarce, where we may have to over-equitize the deal and then ultimately finance it when markets calm down a bit in the future.\n\nFinian O'Shea -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nThe following question comes from Brian McKenna from JMP Securities. Please go ahead.\n\nBrian McKenna -- JMP Securities -- Analyst\n\nThanks. Good morning, everyone. So I had a question on hedge fund solutions. Year-to-date performance has actually been pretty healthy despite the tough backdrop for public markets.\n\nSo are you starting to see any increased demand for the product on the heels of this performance? And then related, how is the business tracking for year-end incentive fees in the fourth quarter?\n\nJon Gray -- President and Chief Operating Officer\n\nWell, I'll just comment on the fact that we brought in Joe Dowling, who previously ran the Brown endowment a couple of years ago. We actually had our LP meeting this week. And we were highlighting the team, the additional investment professional Joe's brought on board and really this outstanding performance. The fact that here we are into the worst 60-40 environment since the early '70s and the BAM business has been positive all three quarters.\n\nThat is exceptional, particularly given the scale of capital they operate. I think it's still a bit early in terms of investors who have been, I think, a little more cautious on the hedge fund sector, now recognizing in an environment like this that some of these non-directional strategies in macro quant credit-related strategies can generate attractive returns. And I think that will give us momentum over time. It takes a bit of time for investors to see what's happening here, but we feel really good about it.\n\nWe could not be more proud of the investment performance the BAM team has delivered.\n\nBrian McKenna -- JMP Securities -- Analyst\n\nThank you.\n\nOperator\n\nThe following question comes from Chris Kotowski from Oppenheimer. Chris, the floor is yours.\n\nChris Kotowsk -- Oppenheimer and Company -- Analyst\n\nYeah. Good morning. Thanks. I mean, I guess the striking thing to me is that if you look at the public apartment logistics and lodging rates, the earnings are up estimates are up, the estimates for next year are higher than for this year, but the stocks are down 30%.\n\nAnd -- so it -- I guess it leads me to think, one -- a, do you need to run BREIT with more liquidity just in case the perception there gets a negative? And then b, when you use your methodology for looking at the asset values in BREIT, and if you apply that to the public companies, do those all of a sudden look a whole bunch more attractive relative to your valuations?\n\nJon Gray -- President and Chief Operating Officer\n\nYeah, I'll start on valuations. What's interesting about the public real estate market, it's pretty small. It's probably 7% or 8% of the U.S. commercial real estate market.\n\nIt trades with a lot of volatility, as you pointed out. In fact, since 2010, it's gone up or down in a 60-day period by more than 10% 50 times, which hasn't happened in the private real estate market during that period, I don't think once. And it can, of course, trade above NAV and below. And part of the decline you've seen was the public markets heading into this, we're actually above in many cases, the private market.\n\nSo some of that was giving back. And if you look at the analysts today who cover real estate, they would say they're trading below the private market. And the short answer is, does it create opportunity for us as the largest real estate investor? It does. We've done many, many public to privates in the real estate space.\n\nAnd generally, it's because the public markets tend to go back and forth between euphoria and depression. And what we've seen here is now the idea is rates have gone up and therefore, real estate values go down very, very sharply below the private market value, which can create an opportunity for us certainly. And we do believe, if you look at the logistics space, the phenomenal performance that's happening in markets, the market -- the public markets don't seem to appreciate that, but those can create opportunities over time, similarly in rental housing. As it relates to BREIT, we've built this product keeping in mind that there can be volatility in markets.\n\nSo we run the vehicle with ample liquidity, large amounts of cash and revolvers, large amounts of liquid debt securities. We met 100% of the repurchase request since we started six years ago, including throughout COVID and the structure means we're never a fore seller of assets. So we feel really good about BREIT and its ability to weather pretty much any storm. And again, back to what I talked about earlier, focusing on rental housing and logistics, where the vast majority of the assets are in the Southern United States, you could not have built a better portfolio for the environment we're in.\n\nAnd we feel really good about where BREIT's going over time.\n\nChris Kotowsk -- Oppenheimer and Company -- Analyst\n\nVery interesting. Thank you.\n\nOperator\n\nOur next question comes from Rufus Hone from BMO. Rufus, please go ahead.\n\nRufus Hone -- BMO Capital Markets -- Analyst\n\nGreat. Good morning. Thanks very much. I was hoping to get an update on how your private equity portfolio companies are performing and also on their ability to manage higher debt service costs as the economy slows down.\n\nAnd related to that, I was curious to know how you've structured the debt at your portfolio companies. If you could share roughly what the mix is between fixed and floating rate debt? And to what extent you may have hedged the floating portion, that would be really helpful. Thank you.\n\nMichael Chae -- Chief Financial Officer\n\nRufus, this is Michael. I'll start with the last question. We've been at this for a while, obviously, financing our private equity portfolio and feel really good about the position our companies are in. Our average debt maturity -- remaining maturity in our private equity portfolio is around five years.\n\nIn terms of hedging, while the baseline is -- there's obviously a floating rate component and especially the senior debt. There's a fixed component as it relates to a high yield or sub-debt portion in most cases. And then we also hedge a significant from our portfolio to fixed over a period of time. And then I'd say from an interest coverage level, in very, very good position from a cushion standpoint, even anticipating higher base rates.\n\nJon Gray -- President and Chief Operating Officer\n\nAnd I would say, performance-wise, the third quarter, again, remarkable 17% revenue growth. Real strength, as we talked about in travel leisure, businesses like Crown Resorts, Merlin Entertainment. We have a Visa processing business. All of these companies seeing very strong revenue growth.\n\nWe have large exposure to energy and energy transition. Of course, that's been one of the best areas in the global economy. And that sector positioning for us, I think, has made a very big difference relative to sort of the overall mix of companies out there. We also -- when we did technology investing, we focus on profitable tech businesses, enterprise tech businesses, which are continuing to grow nicely.\n\nSo we are, as we said in the opening, we're seeing a slowdown economically, but still really good momentum, and particularly in our companies. There is still some margin pressure out there. Labor costs mean that the bottom line is not growing as fast as the revenue line is. But I would say on the ground today, at least for our portfolio, is still pretty good.\n\nRufus Hone -- BMO Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nUp next is Arnaud Giblat from BNP Exane. \n\nArnaud Giblat -- Exane BNP Paribas -- Analyst\n\nHi. Good morning. My questions on the opportunities out there in secondary markets. There's been a lot of news flow suggesting that pension funds have been selling some of the LP stakes in the U.S.\n\nand Europe. I was wondering if you could comment on that. Have volumes picked up markedly? And is pricing attractive for your secondary funds? Thank you.\n\nJon Gray -- President and Chief Operating Officer\n\nWe think it's a really great time for what will be a $20 billion industry leader secondary fund. What happens in moments like this, a little bit like my earlier comments is you see a pause from sellers. They want to wait and see where valuations come out. Sometimes they may not be enthused about potential discounts as the funds may get marked down and they accept that the valuations are different than they were 12 months earlier, then you see transaction activity pick up.\n\nI would say overall, as alternatives have grown in a big way. The secondaries business is very well positioned because people need liquidity for a wide variety of reasons, and there just hasn't been enough growth in the secondary space. And again, it speaks to the power of Blackstone. The fact that we've got a leading industry platform in this area as well is really advantageous.\n\nWe believe that we'll see a pickup in volumes. It may take six months for that to happen. That's been the history of when it happens because of the scale of our platform and our ability to invest in all sorts of funds. We're invested in more than 4,000 funds, which gives us a real competitive advantage when somebody is looking for a holistic solution.\n\nSo we like the space. We think it's going to be a busy space. It may just be a little bit slower here for a couple of quarters.\n\nArnaud Giblat -- Exane BNP Paribas -- Analyst\n\nThank you very much.\n\nOperator\n\nOur final question comes from Brian Bedell from Deutsche Bank. Brian, please go ahead.\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nGreat. Thanks for taking my follow-up. Just wanted to go back to Resolution Life for a second and to your confidence on that being a block aggregator. And I think you mentioned $250 billion of potential fundraising insurance.\n\nWould you be able to unpack that a little bit in terms of the different components of those drivers in a rough time frame?\n\nJon Gray -- President and Chief Operating Officer\n\nYeah. On the $250 billion, that's really the $150 billion today plus where we think both Corebridge is going to grow to plus Resolution plus a little bit of organic as well.\n\nMichael Chae -- Chief Financial Officer\n\nAnd the $150 billion is our total insurance AUM managed. There's about $110 billion or so subset of that from these four big partnerships that Jon's referencing, it's that number that will contractually we expect to grow to $250 billion or so over time.\n\nJon Gray -- President and Chief Operating Officer\n\nYeah. On resolution, what's attractive to us is that they're focused on these legacy closed blocks. And so there are a lot of insurance companies out there today. This is an area where there is a lot of deal flow who want to move out of their old, call it, life insurance book.\n\nResolution is uniquely positioned. The CEO of Cadre has been doing this for a very long time. He's built a terrific team to not only underwrite the liabilities, but then to service the customers. What he hadn't done historically was focused as much on the asset side, generally buying liquid rate in fixed income.\n\nAnd what we're bringing to resolution is new capital to help them grow in what we think is a very good time and the ability to directly originate credit. And this is this mega trend I talked about but the ability to make real estate loans, corporate loans, infrastructure loans, asset-backed loans and do that at scale, we think that is a very compelling opportunity. Resolution was excited about it, and it gives us another engine. So we've obviously got resolution focused on these closed blocks.\n\nIn the case of Core Bridge and also F&G, we have firms that are growing in the fixed annuity space in a big way. So we've got multiple engines of growth for assets in this space and the base rates have moved up and the spreads have widened. So if you think about a market where it's a very attractive time to be deploying capital and repositioning out of traditional fixed income into private credit, this is that moment. We're excited about this, and we really like this model as we talked about, which is asset-light.\n\nWe don't have to take on insurance liabilities and multiclient. We're not just limited by one balance sheet. We can work with a variety of clients who all benefit from the scale and diversification we can give them.\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nThat's very interesting. Thank you.\n\nOperator\n\nAllow me to now hand it back to Weston Tucker for closing remarks.\n\nWeston Tucker -- Head of Shareholder Relations\n\nThank you, everyone, for joining us today and look forward to following up back to the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nWeston Tucker -- Head of Shareholder Relations\n\nSteve Schwarzman -- Chairman and Chief Executive Officer\n\nJon Gray -- President and Chief Operating Officer\n\nMichael Chae -- Chief Financial Officer\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nBen Budish -- Barclays -- Analyst\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nAlex Blostein -- Goldman Sachs -- Analyst\n\nGerry O'Hara -- Jefferies -- Analyst\n\nBill Katz -- Credit Suisse -- Analyst\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nAdam Beatty -- UBS -- Analyst\n\nPatrick Davitt -- Autonomous Research -- Analyst\n\nFinian O'Shea -- Wells Fargo Securities -- Analyst\n\nBrian McKenna -- JMP Securities -- Analyst\n\nChris Kotowsk -- Oppenheimer and Company -- Analyst\n\nRufus Hone -- BMO Capital Markets -- Analyst\n\nArnaud Giblat -- Exane BNP Paribas -- Analyst\n\nMore BX analysis\n\nAll earnings call transcripts"
}