{
  "companyName": "MongoDB",
  "companyTicker": "MDB",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/31/mongodb-mdb-q2-2023-earnings-call-transcript/",
  "content": "MongoDB (MDB -1.01%)\nQ2 2023 Earnings Call\nAug 31, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to MongoDB's second quarter fiscal year 2023 earnings conference call. [Operator instructions] I would now like to hand the call over to Brian Denyeau of ICR. Please go ahead.\n\nBrian Denyeau -- Investor Relations\n\nThank you, Latif. Good afternoon, and thank you for joining us today to view MongoDB's second quarter fiscal 2023 financial results, which we announced in our press release issued after the close of the market today. Joining the call today are Dev Ittycheria, president and CEO of MongoDB; and Michael Gordon, MongoDB's COO and CFO. During this call, we will make forward-looking statements, including statements related to our market and future growth opportunities, the benefits of our product platform, our competitive landscape, customer behaviors, our financial guidance, and our planned investments.\n\nThese statements are subject to a variety of risks and uncertainties, including those related to the ongoing COVID-19 pandemic and its impact on our business, results of operations, clients, and the macroeconomic environment that cause actual results to differ materially from our expectations. For a discussion on until risks and uncertainties that could affect our actual results, please refer to the risks described in quarterly report on Form 10-Q for the quarter ended April 30th, 2022, filed with the SEC on June 30th, 2022. Any forward-looking statements made on this call reflect our views only as of today, and we undertake no obligation to update them, except as required by law. Additionally, we will discuss non-GAAP financial measures on this conference call.\n\nPlease refer to the tables in our earnings release on the Investor Relations portion of our website for a reconciliation of these measures to the most directly comparable GAAP financial measures. With that, I'd like to turn the call over to Dev.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nThanks, Brian, and thank you to everyone for joining us today. I will start by reviewing our second quarter results before giving you a broader company update. Let's start with our second quarter financial results. We generated revenue of $304 million, a 53% year-over-year increase and above the high end of our guidance.\n\nAtlas revenue grew 73% year over year, representing 64% of revenue, and we had another strong quarter of customer growth, ending the quarter with over 37,000 customers. Overall, we are pleased with our performance in execution in Q2 despite the challenging macro environment. Let me give you a bit more context on what we saw in Q2. The new business environment remains robust as evidenced by our record increase in direct sales customer account.\n\nWe have seen no change in deal activity in sales cycles. We believe our strong new sales performance is a demonstration of the critical business value our developer data platform delivers and our superior go-to-market execution. As we have said in the past, nearly every organization uses software to drive their value proposition. Consequently, these organizations seek modern solutions that make their developers more productive.\n\nFurthermore, in rates remain strong, further evidence that MongoDB is a nondiscretionary spend for our customers. As expected, we did see the macro environment weigh on the growth of Atlas consumption. As we discussed last quarter, it's important to understand that the slower than historical consumption growth is a result of slower usage growth of our customers' underlying applications due to macro conditions. Our customers spend on our platform is well aligned with the performance of their business.\n\nIn the current environment, some businesses and consequently, their applications are growing more slowly. Michael will address the second quarter consumption trends in more detail. Let me tell you how we are navigating the current environment. First, we are doubling down on velocity.\n\nAs we discussed with you in the past, we are in the business of bringing new workloads onto our platform and then focus on making those workloads successful. In the current environment, we are even more focused on removing friction in acquiring workloads from new and existing customers. The strength of our new business performance in the first half of the year demonstrates our success in this area. Second, we will continue to invest for the long term, and we'll make investments in our growth initiatives and platform capabilities where we are generating strong returns.\n\nWe have never taken a growth at all cost approach and we will remain vigilant and prioritize our highest return areas. We are confident that the recent consumption trends will improve as the macro environment normalizes over time. The value proposition of the MongoDB developer data platform has never been stronger. Our conviction comes not only from our results, but also from the success our customers are having with our platform.\n\nCustomers are very focused on removing complexity from the technology stack. They understand that complexity is a task that increases expenses, creates risks and slows down innovation. They are increasingly turning to our developer data platform to address this challenge. A multinational trillion-dollar financial services company chose MongoDB to power the next-generation trading platform to cover all of their various trading businesses with one solution.\n\nSince launching the new service, the customer has been able to decommission eight legacy trading systems and realized cost savings of almost $50 million in annualized expenses. A leading Canadian security provider migrated its IoT and AI security platform away from an open-source relational database to Atlas. With the ability to use MongoDB's native charting to distribute their database over lower cost instances, the company has been able to significantly reduce their database spend by 60%, which is particularly compelling given the open-source nature of their prior solutions. Another one of our customer priorities is to invest in their core competencies and outsource or eliminate everything else.\n\nThey understand that clinging to the old ways of delivering innovation is not only time-consuming, but also incredibly expensive. A global travel technology leader is in the process of getting out of the business of managing their own data centers. They turn to MongoDB in order to modernize a key legacy application and move it to the cloud. The monolithic application was originally built on Oracle and Elasticsearch but the customer decided to migrate the application to Atlas because they couldn't meet their time line and performance requirements with their existing solution.\n\nA web 3.0 pioneer start off by building and managing their own computing infrastructure. However, the development team quickly reached appoint where they were overwhelmed by day-to-day task of managing infrastructure. By migrating to MongoDB outlets, the company saved three years in development time and reduce the need to hire 40 developers. Finally, in this environment, as any other, customers understand that high performance and scalability are critical to their success.\n\nA Fortune 500 consumer technology leader turned to MongoDB to replace its existing compliance platform as it needed to double the performance while lowering cost and enabling real-time visibility of operations. MongoDB was able to address the performance requirements while lowering costs by 70%. One of the world's largest healthcare companies, historically an Oracle shop, was unable to meet their desired performance expectations and had to spend tens of thousands of hours just to maintain their existing environment. Over the last few years, they have implemented MongoDB for the most demanding new projects, such as the COVID vaccine application as well as their digital health app.\n\nPerhaps the best way to illustrate how the perception MongoDB has change is to review our relationship with one of the world's premier commercial investment banks. Four years ago, a senior executive of the bank told me that he didn't think MongoDB was ready to be declared a standard for their mission-critical applications. At the time, they had a myriad of relational and nonrelational technologies deployed across the organization. Since then, not only does the bank become more focused on and confident in moving workloads to cloud, but the bank's leadership team also observed how overwhelmingly popular MongoDB had become with their development teams across the organization.\n\nAs a result, they decide to make MongoDB one of their enterprise standard offerings as part of the journey to the cloud. In the second quarter, they signed a multimillion-dollar agreement as a sign of their desire to use MongoDB as a preferred platform for mission-critical workloads. Our customers are not only excited about our current product offering, but also by a road map. We received enthusiastic feedback at this year's MongoDB World about our developer data platform vision as well as our product announcements.\n\nTo highlight a few, we announced Queryable Encryption, an industry-first feature that allows customers to query data while it remains encrypted. Given the heightened focus on security and privacy, this announcement received a lot of attention from both customers and the academic community. And currently, over 60 companies, the majority of whom are Fortune 500 customers, are in development with this feature. We also announced Relational Migrator, a product that simplifies the process of migrating workloads off relational databases and onto MongoDB.\n\nOur early access program is oversubscribed, and we're getting great customer feedback. Given most companies increased focus on cost management, we believe this technology will accelerate customer confidence in replatforming applications of relational databases. We also received positive feedback related to our analytics announcements. Most notably, Atlas Data Federation and Atlas Data Lake storage are seeing healthy early adoption in use cases related to the ingestion, data transformation, and curing of large volumes of data to provide greater insights from data generated by applications on Atlas.\n\nNow I'd like to spend a few minutes reviewing some additional customer wins and interesting use cases from the second quarter. A leading German retailer, Conrad Electric, built an online B2B marketplace on MongoDB. Turning to MongoDB for simplicity as the marketplace grew it moved from MongoDB Community Edition to Atlas for further scalability and to reduce management complexity. Conrad Electronics database now hosts over 8 million active SKUs, which is estimated to reach 100 million SKUs by 2024.\n\nLocus Robotics, a leading warehouse robotics company leverages Atlas to store data uploaded from their physical warehouses, including metadata, logs, configurations, and reports. Their Locus Cloud warehouse orchestration platform utilizes Atlas to store and access data for operational reports, ensuring seamless and reliable functionality for their customers. Locus Robotics were selected MongoDB Atlas because they needed a fully managed data platform to allow them to build faster and handle vast amounts of data. In their efforts to improve their automation processes, e-commerce platform Rent The Runway selected and implemented MongoDB Atlas as a database platform to streamline how garments were sorted and cleaned in their fulfillment centers.\n\nWith Atlas, Rent The Runway is able to seamlessly extract data and real-time analytics from the robotic sorting arm and X-ray machines, resulting in a 67% decrease in processing time. In summary, I am pleased with our execution in the second quarter. Despite macroeconomic uncertainty, we are focusing on what we can directly control, namely bring new customers and new workloads onto our platform. The breadth of adoption across many use cases gives us continued confidence to judiciously invest across our business to best position ourselves to fully capitalize on our long-term market opportunity.\n\nWith that, here's Michael.\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nThanks, Dev. As mentioned, we delivered another strong performance in the second quarter, both financially and operationally. I'll begin with a detailed review of our second quarter results and then finish with our outlook for the third quarter and full fiscal year 2023. First, I'll start with our second quarter results.\n\nTotal revenue in the quarter was $303.7 million, up 53% year over year. As Dev mentioned, we saw a continued strong new business environment and experienced no noticeable change in sales cycles. To us, this is an indication that we remain a top priority for our customers. Shifting to our product mix.\n\nEnterprise Advanced exceeded our expectations driven by upsells to existing customers. Moving on to Atlas. Atlas grew 73% in the quarter compared to the previous year and now represents 64% of total revenue. compared to 56% in the second quarter of fiscal 2022 and 60% last quarter.\n\nAs a reminder, we recognize Atlas revenue based on customer consumption of our platform and that consumption is closely related to end-user activity of the application, which can be impacted by the macroeconomic environment. Overall, our performance this quarter was strong, and we're pleased with our results. We do think it's helpful to provide investors some incremental context around the puts and takes that we are seeing in consumption trends. As you probably recall, on our Q1 call, we shared with you that we were starting to see the impact of macroeconomic uncertainty on Atlas consumption in certain pockets of our business and discuss with you the framework on how we expected the macro impact to play out for the rest of the year.\n\nLet me update you on our performance compared to this framework in Q2. Starting with our self-service channel. You'll recall that we experienced slower than historical consumption growth in Europe in Q1 and in the U.S. in May.\n\nThe May consumption patterns generally continued for the remainder of Q2 and self-serve did modestly better than our expectations. Moving on to the mid-market channel. For context, the customers in this channel tend to be traditional medium-sized businesses. This channel included -- tend not to be traditional medium-sized businesses.\n\nThis channel includes a disproportionate share of digital native, fast-growth companies that have built their businesses on MongoDB. Our expectation that the mid-market slowdown we saw in Europe in Q1 would become global in Q2. This is what we experienced, but the slowdown was more significant than we had expected, specifically the digit layer subset of the mid-market experienced slower growth in their applications as a result of macroeconomic conditions, and therefore, their underlying consumption growth of MongoDB slowed as well. Finally, turning to enterprise, our largest channel.\n\nAs in Q1, we had not seen an impact on consumption but we expected a modest impact to manifest itself in Q2. Here, consumption growth was above our expectations in North America, while in Europe, we experienced greater-than-expected macroeconomic headwinds. The slowdown in Europe was evidenced across all subregions and industries. Turning to customer growth.\n\nDuring the second quarter, we grew our customer base by over 1,800 customers sequentially, bringing our total customer count to over 37,000, which is up from over 29,000 in the year-ago period. Of our total customer count, over 5,400 are direct sales customers, which compared to over 3,600 in the year-ago period. Q1 was a record quarter of direct customer net additions, which speaks to the popularity of our platform, and the relevance of our value proposition. As a reminder, our direct customer count growth is driven by customers who are net new to our platform as well as self-service customers with whom we've now established a direct sales relationship.\n\nThe growth in our total customer count is being driven in large part by Atlas, which had over 35,500 customers at the end of the quarter, compared to over 27,500 in the year-ago period. It's important to keep in mind that the growth in our Atlas customer count reflects new customers to MongoDB in addition to existing EA customers, adding incremental Atlas workloads. We had another quarter of our net AR expansion rate above 120%. We ended the quarter with 1,462 customers with at least $100,000 in ARR and annualized MRR, which is up from 1,126 in the year-ago period.\n\nMoving down to the income statement. I'll be discussing our results on a non-GAAP basis, unless otherwise noted. Gross profit in the second quarter was $223.2 million, representing a gross margin of 73%, which is up from 72% in the year-ago period. Our year-over-year margin improvement is primarily driven by improved efficiencies that we are realizing in Atlas.\n\nOur loss from operations was $12.4 million or a negative 4%. Operating margin for the second quarter compared to a negative 2% operating margin in the year-ago period. As a reminder, in Q2, we saw the return of large in-person events most notably our flagship event MongoDB World, which attracted approximately 3,000 attendees to the Javits Center in New York. Net loss in the second quarter was $15.6 million or $0.23 per share based on 68.3 million weighted average shares outstanding.\n\nThis compares to a loss of $7.7 million or $0.12 per share on 63.4 million weighted average shares outstanding in the year-ago period. Turning to the balance sheet and cash flow. We ended the second quarter with $1.8 billion in cash, cash equivalents, short-term investments, and restricted cash. Operating cash flow in the second quarter was negative $44.7 million after taking into consideration approximately $3.9 million in capital expenditures and principal repayments of finance lease liabilities.\n\nFree cash flow was negative $48.6 million in the quarter. This compares to free cash flow of negative $22.7 million in the second quarter of fiscal '22. I'd now like to turn to our outlook for the third quarter and full fiscal year 2023. For the third quarter, we expect revenue to be in the range of $300 million to $303 million.\n\nWe expect non-GAAP loss operations to be in the range of $10 million to $8 million. And non-GAAP net loss per share to be in the range of $0.19 to $0.16 based on 68.9 million estimated weighted average share count. For the full fiscal year 2023, we expect revenue to be in the range of $1.196 billion to $1.206 billion. For the full fiscal year 2023, we expect non-GAAP loss from operations to be in the range of $13 million to $8 million and non-GAAP net loss per share to be in the range of $0.35 to $0.28 based on 68.6 million estimated weighted average shares outstanding.\n\nI'll now provide some more context around our guidance. First, we expect the Atlas consumption trends we experienced in Q2 to continue for the remainder of the year. Second, in the second half of last year, as we called out at the time, we had exceptionally strong Atlas consumption growth leading to difficult Atlas year over year compares to the back half of the year. And third, we expect a sequential decline in Enterprise Advance in Q3 as the renewal base is sequentially lower.\n\nLooking into Q4, we expect a seasonal uptick in revenue from EA. But recall, we faced a very difficult year-over-year comparison given strong EA new business activity we saw last year. To summarize, MongoDB delivered strong second quarter results. Our new business performance and record direct customer net additions indicate the strong underlying demand for our developer data platform.\n\nWe will continue investing responsibly in pursuit of our long-term opportunity. And with that, we'd like to open it up to questions. Operator?\n\nOperator\n\nYes, sir. [Operator instructions] Our first question comes from Sanjit Singh of Morgan Stanley. Sanjit Singh, your line is open.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThank you for taking the questions. Can you hear me?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYep.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nOK. Great. Thank you for taking the question and congrats on the strong deal activity and momentum in Q2. I had a couple of clarifying questions, Michael, on kind of the profile in terms of the different trends that we see across the business.\n\nHow much of the mid-market -- how much does the mid-market represents as a percentage of ARR? I think self-serve is pretty straightforward to figure that out. But between the split between mid-market and enterprise what's the relative size of those? And did you see going into August being sort of sustaining coming out of July? Or did things get worse? Or did things modestly improve?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYes. So in general, the mid-market is a small portion of the overall direct business and therefore, their business overall. And in terms of August, August was consistent with what we experienced in Q2.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nUnderstood. And then just a question on the operating income guidance. That did come down versus your prior guidance. I was wondering if you could provide more context there on what seems to be a higher level of opex spend in the back half.\n\nWhat's driving that? Where are those investments going? Thank you.\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYeah. A couple of different things. From a macro standpoint, if you take a step back, we're investing relative to our long-term opportunity. We have very fractional penetration and continue to see robust new business.\n\nAs you think about the business more holistically, new customers and new workloads are what really determine the long-term outcome and the long-term success. And so we continue to invest in sales and marketing and in the R&D of the platform to position ourselves to capitalize on that long-term opportunity. As it relates to expansion of existing workloads, which is sort of the other piece of the equation, that's more relevant in the short term not as relevant in the long term. And so that's where we've seen the slower growth that we've described.\n\nAnd so we're continuing to take a long-term orientation. We're obviously not doing that in a vacuum or with blinders on. We've always maintained a high level of financial discipline and scrutiny, and we continue to prioritize the highest level investments and constantly monitor things to make sure that we're being appropriate in terms of positioning ourselves for the long run.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nUnderstood. Appreciate the context, Michael. Thank you.\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Raimo Lenschow of Barclays. Raimo Lenschow, your line is open.\n\nRaimo Lenschow -- Barclays Capital -- Analyst\n\nYes. Two quick questions for me as well. Dev, can you talk a little bit about the -- in your prepared remarks, you had quite a few interesting customer stories in terms of people standardizing on us some very big deployments on Atlas enterprise. What are you seeing in terms of where you are on that journey there in terms of people kind of putting much bigger workloads onto the platform than a few years ago when people were trying and testing it out versus now putting like proper stuff on there, like what are you seeing there be on that journey? And then one for Michael.\n\nOn EA, like you kind of talked about sequential decline in Q3 as well. Can you talk a little bit about the drivers there because is that kind of cloud as more and more guys going to the cloud now that's impacting that negatively? Is that consumption? Can you just give us an idea so that we get a better idea about the run rate there? Thank you.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nHi, Raimo. To your first question, we've been essentially being used for mission-critical applications for some time now. And that's evidenced by almost every bank on Wall Street is using us for some important use case. We have large Fortune 500 companies in industries like telecom, media, tech, healthcare, etc., who are using us for very mission-critical use cases.\n\nI would say that we're still early in the journey in terms of having greater share in those large accounts. And you've heard us talk about our focus on focus accounts. We are bringing more resources to bear to really drive the expansion of those existing accounts and get more workloads on our platform. And that's, as Michael mentioned, going well.\n\nBut in terms of MongoDB's readiness for mission-critical platforms, we feel like we're really well-positioned. We've added some new capabilities, which we announced at MongoDB World, and our road map is very rich with features. So our customers truly view us as a strategic platform, and that's why you're seeing more and more customers standardize on MongoDB.\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYeah. And Raimo, on your question on EA. As you know, we manage the business on a channel basis, not a product basis, but certainly want to try and call out some of the trends so that people can kind of put the guide in context and some of the things that we're thinking about. The new business environment continues to be robust.\n\nBut EA continues to be a smaller and smaller percentage of that overall new business environment. And so as you look at the back half of the year, that continuing sort of evolution and share is sort of important to take into account. In addition, EA is subject to 606 accounting and the term license component there, which adds into the increased variability and reduced comparability that we see period-to-period. And then lastly, as I mentioned in the prepared remarks, we did have very strong performance of EA in the second half of last year.\n\nAnd so not only does that set up a tough compare in the classic sense but depending on the nature of the structure of a deal, that's a multiyear deal, the term license revenue can be recognized upfront. And so not only does it boost the current period that now becomes the year-ago period, but the current period, which is now the present period in the back half of this year doesn't have that license revenue. And so you sort of got a two-factor impact there. I'm just trying to call that out for folks so they understand.\n\nOperator\n\nThank you. Our next question comes from Kash Rangan of Goldman Sachs. Kash Rangan, your line is open.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nHi. Thank you very much. One for Dev and one for Michael. Dev, you talked about these big customer wins.\n\nAt what point are we set up for an inflection point in the database market where less expensive but technologically very compelling solutions like MongoDB? You hit the tipping point and during a downturn as the one we're going through, initially, you see the pullback in spending. But as customers realize the value, are we set up for a time P times Q or in the customer's mind that there is an inflection point in that you could actually reap the benefits typically doing these transitions, the compelling price performance technologies gained share relative to the more expensive incumbent. So wondering what your thoughts are in that regard. And Michael, one for you, as you walk through the tougher comparisons in the second half of the year, is that because of Atlas momentum? And if so, how does the -- how does calendar '23 shape up if you project out these Atlas trends? And what are the things that we should be expecting as first normalization of growth rates are concerned? Thank you so much.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nHi, Kash. Thanks for your question. On your first question, I just want to remind everyone, we're not seeing any change in deal sizes or sales cycle times. I think your point about as customers face this macro headwind, is there an opportunity for them to essentially drive more efficiency in their business? And we're definitely seeing customers starting to do that.\n\nWe're definitely seeing customers look at their legacy platforms and recognize how expensive and brittle those platforms are and are more motivated to move on to more modern platforms like MongoDB. Frankly, that -- to help customers in that journey. That was a motivation for us to release the Relational Migrator product because this is not a new trend to help customers just reduce the cost of moving off relational to MongoDB. And I think you're going to see more and more customers take a hard look at their legacy infrastructure and think about modernizing potentially sooner than later.\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYeah. I would just -- to your second question about sort of second half and compares. I walked through the EA compare. On the Atlas compare, yes, last year, we had very strong cohort expansion in Q3 and in Q4 that leads to difficult compares.\n\nBut also -- and I think this is part of your point, Kash. As you think about where we're entering the second half of the year, right, as we start off the third quarter, given some of the slower growth that we've seen and the expansion of existing cohorts, that starting ARR is at a lower point as we look at the second half of the year, and so that will also affect fiscal '23 results. Obviously, we're not providing fiscal '24 guidance on this call, and we'll look to do that on the March call. But certainly, how the next 6 months play out will impact kind of the starting position for fiscal '24.\n\nOperator\n\nThank you. Our next question comes from DJ Hynes of Canaccord Genuity. DJ Hynes, your line is open.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, guys. Thanks for taking the question. So Dev, Snowflake has increasingly talked about its evolution to a cloud app development platform. In some ways, it sounds similar to the vision you've laid out for Mongo's developer data cloud.\n\nI know you and I have talked about this, but I still get the question from investors. Can you just talk about where you see the intersection of those efforts and where the key differences lie today?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. Thanks, DJ. So first of all, I want to make it clear to everyone that we don't see Snowflake in any deals, right? So in terms of customer buying behavior, there's no confusion. Obviously, there is acknowledgment that there is potentially some -- a trend of some overlap between analytics and operational data stores.\n\nAnd what we believe is that the future analytics will really be powering more intelligent applications, which is essentially automating human decision-making that is done today using existing BI tools and data warehouses. So when you think about how apps become more sophisticated, it's really all about software and automation, which is really a developer challenge. And one thing I think we've proven is to know how to build tools for developers to be more productive and more effective. And so that's what we plan to do.\n\nAnd I should also point out that this trend of developers doing more, we've already seen, say, in the DevOps space where developers have taken on more of the operational responsibility that operators and data centers use to do or in the security space where developers are taking on more responsibility for security and as a whole advent of new security-focused developer tools. And we think the same thing will happen in analytics, where developers will basically embed more analytics into building smarter applications.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYes. Yes, that's great color and a helpful explanation. Michael, a follow-up for you. Just what does the strategy become with the mid-market digital natives that seem to be getting hit the hardest in terms of their consumption trends? I mean is it just about waiting it out? Or how do your conversations with those customers change given that dynamic?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYeah. I think it's a couple of different things. There are two flavors here. And again, I would just sort of go back to this way to look at the market and how it flows through in terms of the numbers.\n\nThere are new customer wins, right? So that new companies are obviously being created regularly in that digital native part of the mid-market, that subset. And we continue to have a very strong value proposition there. We continue to resonate. We continue to be a platform of choice as it relates to that in terms of the consumption side, and that's ultimately what's most important for the long term.\n\nAnd so our ability to land those customers to continue to have success with those customers is a long-term asset and accretes to sort of long-term value proposition. In the short term, depending on how long the current macroeconomic environment goes on as we see slower growth from those customers that will impact numbers in the short term, but that's a relatively small part of the equation. If I think about the long-term opportunity and what relative market share we have and everything else, it's fairly early on. And so obviously, we've got to sort of navigate through that period, and we talked about sort of our desire to keep an ability to keep sort of a close pulse on things, but that's really how we think about it.\n\nOperator\n\nThank you. Our next question comes from Karl Keirstead of UBS. Your question, please, Karl Keirstead.\n\nKarl Keirstead -- UBS -- Analyst\n\nSo maybe I could just ask you about what assumptions you're embedding in your guidance. I think one thing that investors took comfort from, at least I did on the last call, is your assumption that things get worse. So I just wanted to make sure I understand what you're assuming. Are you indeed assuming that things get worse in the second half from what you saw in July? One would assume so, given that you didn't carry the full 2Q beat into your full year raise, but I just would love to clarify.\n\nThank you.\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYeah. Sure. So I think when you think about our second half assumptions, we generally think that they're broadly in line with what we experienced in Q2.\n\nKarl Keirstead -- UBS -- Analyst\n\nOK. Got it. And then if I could ask a follow-up. Just building on the last question around these digital native customers.\n\nyou probably don't want to specifically size it, but I think it might be helpful, like what does MongoDB's exposure to that customer segment? And was there any -- anything specific to your vertical exposure that is worth calling out in 2Q?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nAs I look at the vertical exposure and the regional exposure across the mid-market, it was pretty broad-based. And so I don't think there's anything specific worth calling out there. In terms of -- the mid-market overall is a small portion of the direct business and those digital natives are just a subset of the overall mid-market. And so we're sort of talking about fractions of fractions here as we kind of winnow down.\n\nBut what we saw in terms of the slower growth was across regions and across industries.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYeah. I also want to add that we view this segment to be an important part of our business. We expect to add more customers in this segment over time. And this segment is frankly a great signal for our future prospects.\n\nWhen the next generation of companies are building on top of MongoDB that makes, frankly, us sleep a lot better at night. And so this is a segment that we'll continue to put a lot of focus on. But clearly, as Michael discussed, there's some short-term headwinds.\n\nOperator\n\nThank you. Our next question comes from Phil Winslow of Credit Suisse. Your question, please, Phil Winslow.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nMy question is, obviously, you highlighted some of the announcements from earlier the summer at MongoDB World. Dev, you touched on the relational migrate, but wondering if you could give us some of the early feedback that you're hearing from customers, whether it be the geographic indexing, secondary improvements around time series, search, etc. Anything that you're getting positive feedback on that you think is resonating with customers?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. So we're getting a lot of positive feedback on time series, much like in search, where essentially customers like the one unified and seamless platform, a very elegant developer experience, and the ability to essentially drive cost out of the business. We're seeing the same phenomenon in time series. There's a lot of demand.\n\nAgain, we're taking things slowly. It's a new product. Obviously, we're already seeing customers starting to use it. But it's in the early days, and we get -- expect to get a lot of feedback.\n\nAnd as you know, in this space, this is a multiyear journey, but we're really excited about the opportunity to drive more time series workloads on MongoDB. And I should also say we used to do -- we always had many customers use us for time series workloads, especially in the IoT area, but we just expect that to happen even more now that we have more capability to address these sophisticated workloads.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nAnd then just a follow-up on that. Obviously, you highlighted vendor consolidation from a relational -- no sequels perspective. But when you think about these multiple new tools that you just mentioned, the potential of MongoDB to consolidate those. How do you think about that opportunity once again, not just relational on to SQL, but consolidation of call it, multiple no SQL functions and, call it, other functions as well?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. So to your point, we do view the developer data platform in some ways, not just a benefit for customers in terms of having one unified and elegant developer experience. One data silo versus multiple silos. But it also enables customers to consolidate vendors and drive more efficiency in their business.\n\nI do believe some of these niche companies are going to struggle in this environment because -- we've always talked about this, and I think it only becomes even more imperative is customers don't want to use a net new technology for every net use case. It just doesn't scale as much more complexity to the environment, makes the developer's life much more difficult. And I think that's going to be resonate even more now in this environment.\n\nOperator\n\nThank you. Our next question comes from Jason Ader of William Blair. Jason Ader, your line is open.\n\nJason Ader -- William Blair -- Analyst\n\nGuys, in thinking about the lower op income guide, are you basically saying that the mix of new customers versus existing customers is different than what you expected a quarter or two ago and basically new customers are more expensive to transact with? Is that the right way to think about the lower op income for the year guidance?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nNo. That's not how I think about it. I think about it as being -- we are continuing to see good customer wins and strong receptivity in the market that underscores or translates into strong customer unit economics. And so we are continuing to invest in building out sales.\n\nAnd as you think about what the implication is in terms of rolling through some of the slower cohort expansion of existing Atlas customers that we're seeing. And when you run the math through, that winds up having a slight impact to our full year op income guide. So I wouldn't take it as any kind of judgment or try to do any math unless some sort of incremental value of workloads or slicing and dicing it that way, just simply us, saying, us looking at the market, having a long-term orientation, continuing to see strong new wins, no increases in customer churn, continuing to have the value proposition resonate and being sort of at the top of the customer priority list. And so wanting to continue to invest in that as well as also continuing to invest in our product capabilities and executing against our platform vision, all of which, of course, monitoring how the whole package comes together.\n\nAnd to Dev's point, we've never taken a growth at all cost approach. It's always been a very financially disciplined oriented one, but that's just sort of how the numbers run through to wind up with sort of a slight decrease in the op income guide.\n\nJason Ader -- William Blair -- Analyst\n\nWas that a tough decision to make right now, Michael, just given the optics of the revenue guide and then the op income as well?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nNo. I think when you're looking at the long term when you see the underlying returns that we're seeing and the success we're having in the market, no.\n\nJason Ader -- William Blair -- Analyst\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from the line of Mike Cikos of Needham and Company. Please go ahead, Mike Cikos.\n\nMike Cikos -- Needham and Company -- Analyst\n\nHey, guys. Thanks for getting me on here. I do apologize if this was recapped already. I've just been juggling a couple of different earnings calls tonight.\n\nBut I did want to ask, I know that on these investments in the second half of the year when you're looking at the sales and marketing and the R&D. So specifically on sales and marketing in that go-to-market. Is there a way to help us think through the anticipated, whether it's head count growth or those assumptions around productivity? And maybe as a much more basic question, what is the anticipated time for those new hires to ramp? And then the follow-up I had is on the strategic collaborations you guys have. I know last quarter, we were talking about the AWS announcement in this current press release we're talking about Google.\n\nHow do those strategic relationships continue to evolve for MongoDB?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYeah. Sure. So I think on the first question, while we always, regardless of environment continue to sort of tweak and optimize which channels and which roles we want to prioritize and allocate, we won't tackle that any differently than we have previously. While we always, regardless of environment continue to sort of tweak and optimize which channels and which roles we want to prioritize and allocate, we won't tackle that any differently than we have previously.\n\nAnd the overall unit economics continue to be strong, sort of as I mentioned. So I wouldn't think of there being any kind of radical rephasing of the sales and marketing. And when we think about the new customer wins that we're having, you saw it was a record quarter for new customer net new additions in customer count. And when we've sort of crossed 1% market share and are closing in 2% market share, and our biggest challenge is we've talked about sort of each call probably, is that our footprint coverage is very thin.\n\nWhen we are in conversations and in dialogues. Our win rates are exceptionally high. And when you marry that with some of the anecdotes and vignettes that Dev shared about customers really responding to our developer data platform, we want to continue pursuing that for the benefit of the long-term outcome.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. And Mike, to your second question about our strategic relationships with the hyperscale vendors. They're very strong. One is the function of how popular MongoDB is on their respective platforms.\n\nWe've been constantly told that we are one of the most popular technologies that developers are running on their platforms. Two, what they've also seen is that they're the net beneficiary of our growth and the Atlas growth on their platforms because customers not only -- obviously, Atlas drives more underlying consumption of storage and compute but customers themselves end up using other ancillary services. So for the hyperscale vendor, it truly becomes a win-win relationship. And so you talked about the AWS relationship.\n\nThat relationship is going really, really well. There's so much engagement happening in literally almost every theater of the world. The GCP relationship has historically been strong and remains so. And the Azure relationship is actually picking up, and we're seeing a lot more activity with the Microsoft Azure team.\n\nAnd so in general, I would frame the relationships with the hyperscale vendors to be very, very good.\n\nOperator\n\nThank you. Our next question comes from Rishi Jaluria of RBC Capital Markets. Your line is open, Rishi Jaluria.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks, guys. I wanted to ask first, maybe just thinking through the consumption patterns and the visibility there. Can you remind us within Atlas, how much spending is maybe in control of the company or the developers versus those where the usage or consumption is dependent on the usage of the end application itself and by the consumers? Anything directional would be helpful.\n\nAnd then I have a follow-up.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. The underlying usage is extremely tied to the database activity and the underlying usage and application of the application. And so the value that we're driving is highly aligned to the value that the customers are seeing out of it.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nOK. Great. And then on the call, you did mention an example of a customer migrating a legacy monolithic app to the cloud, and you called out displacing both Oracle and Elastic in that. Can you maybe talk -- since you announced Atlas Search at the conference, how does the replacement opportunity look? How do you think about that in the long run? And what sort of early momentum have you seen with that product? Thank you.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. So the opportunity is quite big. The momentum -- I just want to remind you, were Elasticsearch offers other capabilities outside of application sources, which is our particular focus there in logs and some security use cases, which we're not pursuing. We're really focused on again, the persona of the developer.\n\nBut in that area, we see a big opportunity. And that example kind of makes the point rather than using an old TP platform and a bolt-on search database with MongoDB now you can have one seamless and unified platform, a very elegant developer experience and you don't have to invest in tooling to move data between your OLTP platform and your search database and vice versa. So that enables the customer to have a much more effective and performance system than using multiple solutions and customers are really resonating with that. And to your question about how things are going.\n\nWe don't see any market constraints. Frankly, we're trying to enable our sales force as quickly as possible around the world to really get comfortable and conversant and kind of addressing this use case with our customers, and we're quite excited about the opportunity.\n\nOperator\n\nThank you. Our next question comes from Steve Koenig of SMBC Nikko Securities. Your line is open, Steve Koenig.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nHi, gentleman. Thanks for taking my question. Steve Koenig here. Let's see.\n\nWell, I wanted to thank you first for the high degree of transparency around the trends in your business, very helpful. One question for Dev and one for Michael. Dev, as you're talking with existing customers that know you well, and they're looking at deploying Atlas for new workloads, new applications. What's the tone of those conversations? And how is that aspect of your business kind of trended in Q2? That -- and kind of what bigger picture, kind of what are your customers saying about their willingness to invest kind of given macro uncertainties here?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nI would say the tone is very positive, and we feel really, really good about winning new workloads. The morale of our sales force is very high. They're very excited about the opportunity in front of them. And so we feel really, really good about the opportunity to add both new customers as well as new workloads onto our platform, and that's a huge priority for us in the back half of the year as well.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nTerrific. Terrific. Thanks for that. And Michael, for you.\n\nSo you helped us understand what was behind the lower operating income guide with some granularity. But maybe if I could just back up and just make it super kind of simple for me. So you're raising your revenue guidance, but you're lowering the operating income guidance. And so the delta is spending.\n\nAnd so I guess, would I be correct in conclusion -- in concluding that you're accelerating the pace of spending in the second half versus what you previously anticipated? And if so kind of in what areas? So that's all I have. Thanks, again.\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYes. Thanks, Steve. It's not quite how I think about it. I think when you look at the investments that we're planning on making, there primarily in both sales and marketing and R&D for all the reasons that we've previously discussed, both in terms of increasing our footprint coverage as well as executing against our product road map.\n\nI think really what you see is you see the -- as we look at the revenue for the second half of the year by the fact that we took our guide up by less than the beat in Q2, right? You can see that there's implied less revenue in the second half, but we are executing against the long-term opportunity, in particular against those two areas. And so I think it's just a sort of mathematical consequence of that more than anything else. We're quite aware of the current environment, and we keep a close pulse on everything, but we're not radically pivoting given that we're seeing incredibly strong customer reception. We're seeing record new customer wins.\n\nThe value proposition is resonating not just despite the current environment, but in some cases because of the current environment, as we've talked about. And so as we position ourselves for the long term, that's really kind of how that plays out over the next couple of quarters.\n\nOperator\n\nThank you. Our next question comes from Brent Bracelin of Piper Sandler. Your line is open, Brent Bracelin.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThank you for taking the questions. Can you hear me?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYes. Hey, Brent.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nOK. Great. I thought I heard a little click there. Good afternoon.\n\nI wanted to -- Michael, start with you here. If I look at the implied second half guidance and actually drilled down into the implied Q4 revenue guide. It is well below the normal Q4 seasonal uptick that we typically see in this business. How much of that guide is tied to EA, the ratable components of EA and the fact that there's less visibility you have into some of those larger EA ratable deals? Just trying to -- it does look like that the guide implies Q4 will be well, well below normal seasonal patterns.\n\nSo just trying to double-click into what you factored in there on EA. Thanks.\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYep. So a few different things. Thanks, Brent. A few different things.\n\nOne, yes, we have continued to assume the EA continues to be a lower portion of the business. And we talked about our expectations for Q3 in terms of EA being down sequentially. And so that's certainly a factor. Secondly, I probably should started with this.\n\nBut as you know, we do run the business on a channel basis and the sort of products have to come out, but we do have to have some point of view on product in order to come up with our revenue forecast. And so that's what's happening as it relates to EA. In terms of Atlas, you're seeing two things. One, just like EA, they also have very tough Atlas compares year over year.\n\nAgain, remember that in Q3 and Q4, that's when we saw the significant acceleration in cohort expansion from existing applications in the year-ago period. And then the third thing that I'd say is we're entering the back half of the year, meaning we start Q3 with less in the way of ARR than we would have had we seen historical trends. And then when you start to flow that through, even if you instantly reverted to normalized levels, you would wind up with less revenue in the back half of the year. We are also assuming that the trends that we saw in Q2 continue in the second half of the year.\n\nAnd so the guidance that we provided for the second half of the year really is the output of all of that.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGot it. That's helpful color. And then just, Dev, as a quick follow-up for you here as we think about financial services vertical, in particular, that's an area where we've seen some job postings really start to pop up at some higher profile financial's customers. I think Snowflake specifically called out financial services as an area of strength for them as they kind of lean into some of these emerging technologies.\n\nWhat are you seeing in financial services? And maybe just DoubleClick a little bit more on that specific vertical and what you're seeing? Thanks.\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. So financial services has historically been a strong vertical for us, and it remains as such. In fact, we feel really bullish about the opportunities in financial services, there were a lot of regulatory constraints about how quickly customers could move certain workloads to the cloud. A lot of those customers are much more inclined to move workloads to the cloud now than they say they were two, three, four years ago.\n\nSo that's a trend as a tailwind for us. In general, financial services customers are also very apt to try and drive more innovation as they see, obviously, competitive pressures from the next generation of companies. So they're also very quick to recognize when they need to drive their innovation agenda more aggressively. Obviously, MongoDB becomes to play.\n\nAnd then in terms three, financial services historically is a company to try a lot of technologies to see ultimately who's going to be the winner in any particular sector. As we clearly become the leading player in this next-generation data platform space, it's clear that financial services companies are now more comfortable on standardizing on MongoDB, so we're starting to see that phenomenon as well. And so I think in general, we expect financial services to be a big part of our plans for the long term.\n\nOperator\n\nThank you. Our next question comes from Tyler Radke of Citi. Tyler Radke, your line is open.\n\nTyler Radke -- Citi -- Analyst\n\nThanks for taking the question. Michael, I just wanted to go back to make sure I understood kind of what your underlying assumptions and commentary are on the macro environment. So I guess just, first, how should we think about the relative sizing of these digital-native customers that you're calling out? Is this kind of mid-single-digit percent of revenue? And then last quarter, I think you talked about a $30 million to $35 million macro headwind for the full year. I just want to clarify, are you saying it's a little bit worse than that? Or that's kind of the same expectations as last quarter? Thank you.\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nSure. Yeah. Thanks, Tyler. So remember, the mid-market is the smallest piece of the overall direct customer sales channel and the digital natives are a small subset of the mid-market.\n\nSo again, as I mentioned earlier, we're sort of talking about fractions of fractions. And then in terms of your question around how did Q2 and how did Q -- basically, how does the back half of the year compare. As we -- as I called out in the prepared remarks, we had some areas that were better than expected. So self-serve enterprise in North America.\n\nOverall new business activity in general were all to the positive. In terms of the existing consumption or the sort of growth of existing applications, it was weaker in Europe across the board, meaning both enterprise and mid-market and then mid-market sort of without regard to industry or geography. And so a little bit of pluses and minuses as you think, relative to sort of the stake that we put in the ground back in June. And then in terms of the second half of the year, obviously, as I mentioned earlier, we have -- our effective outlook is worse than it was in June, but we're assuming that the trends that we saw in Q2 continue for the balance of the year.\n\nTyler Radke -- Citi -- Analyst\n\nOK. Thanks for that. And as I think about your largest customers, your enterprise customers, not necessarily enterprise advanced revenue. How are you thinking about that consumption maintaining in the back half of this year? And I guess, billings was really strong again, north of 50%.\n\nSo do you have better visibility? Is more of that revenue kind of coming from pre-committed contracts or from the balance sheet?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nYes. So if you think about the enterprise channel on a product mix basis, obviously, it will be disproportionate or more representative of EA relative to Atlas, although we are increasingly seeing Atlas and the Atlas value proposition resonate at the high end of the market as well. And so I don't think it's just as simple as trying to slice that channel by product. We continue to see strong new business in enterprise globally.\n\nAnd then on the consumption patterns, North American Enterprise has been very strong and is better than our expectations. And as I mentioned, Europe being a little weaker.\n\nOperator\n\nThank you. Our next question comes from Fred Havemeyer of Macquarie. Your line is open, Fred Havemeyer.\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nHey. Thank you. When you look at your Atlas consumption model, do you think that Atlas' alignment with your end customers' demand trend means that you're more or less seeing the macro downturn in essentially real time, something that maybe is a little more unique here versus other software vendors? Do you think that this alignment also means that you can see the benefits of economic recovery sooner than other annual subscription software models?\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nSo I think the run on to Fred is yes. We do think it's a more real-time reflection given that we're really sort of a second order effect of the underlying activity in their applications. And obviously, we're not macroeconomists, and so I'm not forecasting recovery, we guess theoretically that if there were increases in activity and increases in underlying usage, that would drive incremental consumption of our platform.\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nAnd I'll fire one more out there quickly. We got quite excited about Queryable Encryption. And I wanted to ask, less about Queryable Encryption, but more about just generally your innovation because using structured encryption, very interesting, you're always at kind of the bleeding edge in already technical market in terms of products and functionality. So I wanted to ask, how do you think about investing into R&D spend generally for technical innovation versus kind of incremental platform updates? And do you think that in this labor market with tech layoffs rising, do you see tactical hiring opportunities?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nYes. So I will answer the second part of your question first. Clearly, we feel really good about the team we had, and we tend to hire some of the best and brightest engineers in the marketplace. Clearly, in this macro environment, we will be opportunistic as an opportunity to do some acqui-hiring.\n\nWe'll certainly pursue that path if it makes sense. In terms of your question around our R&D philosophy, I would say that it's really driven, first and foremost, by one customer feedback with 37,000 customers. We have a lot of customers that give us feedback. It's also driven by essentially our instincts about where the market is going and what developers may need going forward.\n\nAnd as I talked about earlier, answering one of the other questions, we think the scope of the role of developer is only expanding over time. And we think that the developer can do more, especially in the area of analytics. With regards to Queryable Encryption, this is one of the classic challenges that we've had in software is encrypting data is nice because it secures the data, but then it becomes very hard to use that data. And so if you can kind of almost have your cake and eat it too by making that data queryable while keeping it secure especially in an environment where people care a lot about security and privacy, that becomes a win-win.\n\nSo obviously, we have a team, a very strong team in the security space. And we were able to leverage some very cutting-edge work going on in academia to leverage a couple of people to join us and help us build this feature. So we're really excited about the opportunity that we have in front of us.\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nThank you.\n\nOperator\n\nThank you. At this time, I'd like to turn the call back over to Dev Ittycheria for closing remarks. Sir?\n\nDev Ittycheria -- President and Chief Executive Officer\n\nWell, I want to thank everyone for joining us today. We obviously had a really strong Q2. The new business environment really remains quite robust and customers continue to gravitate to the developer data platform to reduce complexity, outsource undifferentiated work and drive more efficiencies. We did see some consumption headwinds in the quarter, and that's really tied to the growth of the underlying applications.\n\nAnd those applications are growing more slowly than historical trends, but we remain incredibly optimistic about the opportunities in front of us, and we will be investing for the long slice of opportunity. So thank you very much for -- thank you very much for your time and we'll talk to you soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Denyeau -- Investor Relations\n\nDev Ittycheria -- President and Chief Executive Officer\n\nMichael Gordon -- Chief Operating Officer and Chief Financial Officer\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nRaimo Lenschow -- Barclays Capital -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nKarl Keirstead -- UBS -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nJason Ader -- William Blair -- Analyst\n\nMike Cikos -- Needham and Company -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nMore MDB analysis\n\nAll earnings call transcripts"
}