{
  "companyName": "Ford",
  "companyTicker": "F",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/ford-f-q3-2022-earnings-call-transcript/",
  "content": "Ford (F 0.78%)\nQ3 2022 Earnings Call\nOct 27, 2022, 1:00 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen. My name is Gary, and I will be your conference operator today. At this time, I would like to welcome you to the Ford Motor Company third quarter 2022 earnings conference call. [Operator instructions] At this time, I would like to turn the call over to Lynn Antipas Tyson, executive director of investor relations.\n\nLynn Tyson -- Executive Director, Investor Relations\n\nThanks, Gary. Welcome to Ford Motor Company's third quarter 2022 earnings call. With me today are Jim Farley, our president and CEO; and John Lawler, our chief financial officer. Also joining us for Q&A are Marion Harris, CEO of Ford Credit; and Doug Field, chief advanced product development and technology officer for Ford Model e.\n\nToday's discussions include some non-GAAP references. These are reconciled to the most comparable U.S. GAAP measures in the appendix of our earnings deck. You can find the deck along with the rest of our earnings materials and other important content at shareholder.ford.com.\n\nToday's discussion also includes forward-looking statements about our expectations. Actual results may differ from those stated. The most significant factors that could cause actual results to differ are included on Page 23. Unless otherwise noted, all comparisons are year over year.\n\nCompany EBIT, EPS, and free cash flow are on an adjusted basis, and product mix is volume weighted. Looking at our IR calendar, we have two upcoming engagements. Tomorrow, Bank of America will host a fireside chat with John Lawler and Lisa Drake, our VP of EV industrialization and manufacturing engineering for Ford Model e. On November 7th, tech analyst, Toni Sacconaghi, will host a fireside chat with Doug Field at the AllianceBernstein's Electric Revolution Conference in London.\n\nNow, I'll turn the call over to Jim Farley.\n\nJim Farley -- President and Chief Executive Officer\n\nThank you, Lynn. Hi, everyone. We really appreciate you being with us today. We introduced the Ford+ Plan for growth and value creation two years ago, and the investment thesis had three drivers: leveraging our iconic vehicles, our strengths, both geographically and nameplates; number two, add to that, integrated hardware, software, and connectivity into those vehicles; and then expand the total addressable market and unlocking value with Conquest EVs, new commercial vehicles, connected services and physical services, as well as mobility.\n\nSo, today, I'd like to share a progress report on Ford's transformation; of course, update you on our autonomy strategy and our announcement; and, of course, recap the quarter. Our ambition to be the leader in EV is already taking shape. In our home market, Ford Model e is now -- has now had incredible successful launch of three products. They're now in scaling, F-150 Lightning, Mach-E, and E-Transit.\n\nAnd each are attracting, interesting for us, almost all new customers. So, this is growth. We're now the No. 2 electric brand in the U.S., and we're just beginning with our scaling.\n\nOur decision to create Blue for both ICE and hybrid vehicles has focused and energized our team to leverage what we do best at Ford. We have launched a string of hits that our products -- our customers not only love but have lined up to buy. And we have so many more exciting products to come. We have made tough capital allocation and restructuring decisions like the one today, particularly in South America and our international market groups, like India.\n\nAnd our results and cash flow, you could see in our results, have improved dramatically. Our balance sheet remained strong. We ended the quarter with nearly $50 billion in liquidity, even as we accelerate investments in connectivity and electrification. And what is, perhaps, the biggest untold story at Ford, we've successfully recruited a roster of an incredible talent from some of the world's best technology companies who are here to ship product and are supercharging our ability to design that software-defined vehicle and, of course, the software and services that go into those vehicles for the future.\n\nAt the same token and at the same time, we have still so much work ahead. Clearly, we need to continue to improve our competitiveness, not just on quality, but on cost and supply chain management. And our performance in China and Europe is not nearly as healthy as we'd like it to be. I can't overstate the sense of urgency we have to address these critical operating areas.\n\nI look forward to updating you on future calls. Now, I'd like to share an important strategic shift in our autonomous vehicle strategy. Five years ago, we committed to invest $1 billion in Argo AI to develop autonomous Level 4 technology. In 2020, we completed the transaction that resulted in Ford and VW both owning the majority of Argo at equal levels.\n\nWe still believe in Level 4 autonomy that it will have a big impact on our business of moving people. We've learned, though, in our partnership with Argo, and after our own internal investments, that we will have a very long road. It's estimated that more than 100 billion has been invested in the promise of Level 4 autonomy. And yet, no one has defined a profitable business model at scale.\n\nBased on the change in this outlook and our increasing promise and focus on Level 2+ and Level 3 autonomy, we've decided to wind down the Argo business and impair the investment. We're working closely with Argo and VW on all the details. But here's what I want to focus on. Advancing Level 2 hardware and software beyond what BlueCruise can do today and ultimately enabling our customers to travel in very large ODDs, or operating domains, with their eyes off the road will give them back the single most valuable commodity in our modern lives: time.\n\nThis has become mission-critical for us at Ford. Ford has deployed BlueCruise on many vehicles across hundreds of thousands of Blue zone miles. We have strong technology partners working alongside us. And now, we're going to bring in several hundred people from Argo, a brilliant collection of minds, who've done a great job, who have done wonderful work in the L4 space.\n\nBut their job and mission now is to help us create a differentiated Level 4 BlueCruise system. Yes, there are huge -- this is a huge addressable market and the potential for highly accretive new revenue streams tied to Level 3. But at the end of the day, this is about giving millions of people that time and eliminating the monotony of highway miles and stop-and-go traffic. And as for the future of true L4 autonomy, we don't expect there to be a sudden aha moment like we used to.\n\nDeploying L4 broadly, perhaps, the toughest technical problem of our time, will require significant breakthroughs going forward in many areas: reliable and low-cost sensing, it's not the case today; algorithms that can operate on limited compute resources without constraining the operating time and domain of an electric vehicle; breakthroughs in neural networks that can learn to operate a car more safely than a human, even in very complex urban environments. The muscles we have built with our new talent in broadly deploying a transformative Blue Cruise L3 system will ultimately be essential to the future of accessible driverless vehicles in everyday life. What's so exciting for me is that we are on the cusp of a transformational moment for Ford. We will introduce a lineup of not first but second-cycle EVs that are not only fully software updatable and constantly improving, but they will generate an 8% plus margin; an amazing array of software-enabled services, not just BlueCruise L3, but many others, video services for software -- for safety and security; and we're already shipping a broad range of Ford Pro productivity tools and 100% uptime services for our commercial customers.\n\nThat is a transformation for us. Let me now switch to the quarter. With Ford Model e, we're on track to reach our annual production rate of 600,000 EVs by the end of next year and 2 million by 2026. I'll say that carefully.\n\nThere is no change to our target. We're adding shifts to the Mustang Mach-E and F-150 Lightings as we speak, and we're scaling production of E-Transit. In Europe, our all-new EV manufacturing center in Cologne will finish complete -- will be complete in turning out vehicles midway through next year. Our Ford Otosan JV in Turkey is not only scaling the two-tonne E-Transit, but they're also going to be launching a brand-new product, a one-tonne E-Transit custom electric, while breaking ground on a new battery plant that will supply those for those transits.\n\nAnd in September, we're starting production -- we've already started construction of Blue Oval City in Tennessee, where we will build a new-generation EV truck and batteries. And at the same time, we've already broken ground as well on the new BlueOval SK battery plants, plural, in Kentucky. We're also further strengthening Model e's EV supply chain. Our team is making great progress in securing raw materials, importantly the processing of those raw materials and the battery capacity that we need.\n\nWe expect the U.S. Inflation Reduction Act to have a wide range of positive impacts for both our customers and for Ford. What's not yet clear is the degree to which the IRA will drive customer demand versus offsetting our EV investments in growth. So, let me touch on some of the potential benefits of the IRA.\n\nThe first opportunity is our largest, the battery production tax credit of about $45 per kilowatt hour. From '23 to '26, we estimate a combined available tax credit for Ford and our battery partners could total more than $7 billion with large step-up in annual credits in '27 as our JV battery plants ramp up to full production. The second benefit is often overlooked. I haven't actually read any one of the media covering this, but it's super important for Ford.\n\nAnd that's the commercial EV credit. You know that Ford is the No. 1 commercial vehicle brand in the U.S., and our commercial customers can now claim next year $7,500 per EV vehicle they buy with no restrictions on battery sourcing or manufacturing. Our preliminary estimate is that between 55% and 65% of all of our commercial vehicle customers will qualify.\n\nThe third opportunity is retail. Ford EVs and our PHEVs remain eligible for the $7,500 tax credit until guidance is issued at the end of this year. Next year, we believe we'll meet the $3,750 critical materials credit requirement on certain Mustang Mach-E and F-150 Lightning models. In '24, the rules will further restrict this critical materials credit.\n\nSo, we believe it's playing -- a fairly level playing field right now for all the OEMs as our supply chains of critical material extraction and course processing in the U.S. and FTA develops. The fourth benefit centers on the funding growth in our investments, such as geothermal energy credit critical for Blue Oval City, the Department of Energy loans, grants to convert our domestic facilities to produce electric vehicles, battery plants and other EV components. We're exploring all these capabilities and possibilities as you can imagine.\n\nNow, as you know, we shared the new electric customer standards with all of our North America dealers last month in Vegas. That means a single, simple e-commerce platform, ultra-low vehicle-finished inventory, nonnegotiated pricing and fast charges at all of our dealerships. Now, early response from the dealers have been very favorable. Many are poised to invest to meet these new standards for electric vehicle customers, while other dealers will opt to specialize Ford Blue Oval or Ford Pro.\n\nAnd there's real rewards for going first. Turning to Ford Blue. We view this business, Ford Blue, as growth. Last month, we unveiled the seventh-generation Mustang.\n\nWe showed the all-new amazing Super Duty in Churchill Downs in Kentucky. And there -- these are all very well-executed products with incredible technology and upgraded electrical architectures with advanced powertrains. And they really set them apart from the competition. What you can't see is what we see.\n\nOur design studio is filled with new products and derivatives that will expand our hit franchises like F-150 and Bronco and Mustang and the new Maverick and the Explorer and the Ranger, all segments that we're a leader among the leaders. And I can't wait to show you these new derivatives based on ICE and hybrid powertrains. Finally, let's talk about Pro. In the U.S., customers trust us more than -- with more than 40% of the market for full-sized commercial trucks and vans.\n\nIn Europe, we're also the No. 1 commercial vehicle brand. That's for seven years now, soon to be eight. Businesses of all sizes and types are using Ford Pro's vehicles, as well as the suite of our services to lower their cost and improve their productivity.\n\nNow, that includes multi-mix fleets, and fleets that are a mix of ICE and EVs. Ford Pro has a real opportunity to grow service and parts sales by offering better experiences like mobile service. We expect to have more than 1,200 mobile service units in operation globally by the end of this year. And they're driving significant dealer parts and service revenue.\n\nActually, more than $10,000 per global -- per unit, service unit, per month. But the real game changer for us in the Pro business in parts and service growth is software, software centered on productivity, telematics, security, and predictive failure of all components. In the third quarter, we saw our paid telematics for Pro grow by over 40% sequentially for the third straight quarter. Our suite of Ford Pro software solutions keeps getting stronger and stronger, as we launch new offerings like Ford Pro fleet and the VIIZR field service management software.\n\nBut before I hand it over to John, let me end with this. We have many challenges as a company, and we're tackling them head-on. That's clear from our third quarter results. At the same time, I'm so excited about the future we're creating with Ford+.\n\nWe're building completely new businesses with the best of Ford talent and incredible new talent across not just Model e, but Ford Blue and Ford Pro. We're strengthening our product portfolio across the board, building on what we think is the strongest portfolio we've ever had. And we're tracking the scale to a global run rate of 2 million EVs a year by 2026, and we're investing in growth. Taken together, this work statement is nothing short of refounding one of the world's most iconic companies to compete and win in a brand-new era.\n\nThere's no holding back. There's no looking back. There's no slowing down. In fact, we're accelerating our transformation.\n\nJohn?\n\nJohn Lawler -- Chief Financial Officer\n\nThanks, Jim. So, when I look at the quarter and our performance year to date, I actually see some real positive. First, our strategic actions to segment and stand out three distinct businesses: Ford Model e, Ford Blue, and Ford Pro, while not complete yet, is truly transformational and is already changing how we manage the business. So, it's about more than just accelerating profitable growth, it's also about how we are going to do that by orienting everything around our different types of customers.\n\nThe separation of these businesses is revealing to the entire organization how deeply rooted complexity is in our legacy business and how this disadvantages us in quality, innovation, customer satisfaction, and, ultimately, cost and efficiency. And we see it everywhere, from design, to engineering, to manufacturing, and how we interact with each other and our suppliers. And so, to me, this is really exciting. We understand the magnitude of opportunity and leverage that this will provide across the entire business.\n\nNow, we just need to deliver. Second, our product portfolio has never been stronger. Starting with our top-selling first-generation EVs like Mustang Mach-E, F-150 Lightning, and E-Transit to our new models of category-leading vehicles like Mustang and Super Duty, as well as popular derivatives like Raptor and Tremor. These are all inspiring products that our customers love.\n\nAnd finally, our capital allocation choices are really paying off. Our sustainable free cash flow generation from our automotive business is improving significantly, even as we accelerate investments in electrification and connectivity. And this improvement reflects the tough choices that we have made to focus on our strengths, hone our footprint and our product portfolio, especially outside of North America. So, with that as a backdrop, let me turn to our financial results for the quarter.\n\nWe delivered $1.8 billion in adjusted EBIT, above the $1.4 billion to $1.7 billion guidance range we provided last month. In automotive, wholesales were up 7% year over year. However, EBIT was weighed down by the rich mix of 40,000 vehicles on wheels we had in inventory at the end of the quarter and about $1 billion in lump sum supplier settlements. The settlements offset costs incurred by our suppliers, partially due to inflationary impacts on labor, freight and commodities, as well as higher costs because of our inconsistent production schedule, which has been disruptive for our partners.\n\nSo, providing greater certainty and schedule stability to our supply base is just one example of the many opportunities we have in front of us as we transform our global supply chain. So, we're very grateful for our suppliers' ongoing support and the collaborative approach they are taking to address production shortfalls, while also focusing on improving the quality of the parts they ship to us. In the quarter, we delivered 3.6 billion in free cash flow, with strong cash generation by our automotive business, despite the adverse effects of the 40,000 vehicles on wheels. We expect the negative working capital impact of those units to reverse in the fourth quarter when the vehicles are completed and shipped to dealers.\n\nOur balance sheet continues to be very healthy. And we ended the quarter with strong cash and liquidity of 32 billion and 49 billion, respectively. And these numbers include our remaining stake in Rivian, which was valued at less than $1 billion at the end of the quarter. Now, I'll touch on the performance of our business units.\n\nNorth America delivered 1.3 billion of EBIT and a margin of 5%. Both of those measures were driven down year over year by higher commodity costs, inflationary pressures, and a diverse mix, reflecting the buildup of vehicles on wheels and inventory. Our brand strength and order banks remain very strong, and we expect the North American margin to return to double digits in the fourth quarter. South America continues to benefit from our global redesign efforts, delivering strong margins in its fifth consecutive profitable quarter.\n\nIn Europe, we posted a profit of $200 million. And supply chain constraints began to ease, resulting in sequential wholesale growth of 23%. Our commercial vehicle business continues to fortify its leadership position ending the quarter with a 15.2% share year to date. And in China, we posted a loss of 200 million, driven by the investments we are making in electric vehicles.\n\nLincoln continues to be a bright spot for the region with share improving again sequentially. Our International Markets Group continues to be solidly profitable. EBIT margins were over 8%, driven by the launch of our exciting all-new Ranger. And then, finally, Ford Credit delivered another strong quarter with EBT of 600 million that reflected a more normalized run rate for this business.\n\nThe anticipated sequential profit decline was driven by the nonoperating release of credit loss reserves and higher borrowing costs. Let me now walk through our impairment of Argo. As Jim highlighted, it's become clear that the technology required to achieve profitable commercialization of L4 autonomy at scale is going to take much longer than we previously expected. L2+ and L3 driver-assistance technologies have a larger addressable customer base, which will allow it to scale more quickly and profitably.\n\nAnd that's going to provide accretive annuity-like revenue streams. During the third quarter, we made the strategic decision to shift our capital spending from the L4 technology being developed by Argo to internally develop L2+, L3 technology. And as a result, in the third quarter, we recorded a 2.7 billion noncash pre-tax impairment as a special item. Now, let me share with you our current outlook.\n\nFor the year, we expect to earn about 11.5 billion in adjusted EBIT, up about 15% from 2021 with about a 10% increase in wholesales. We're now projecting to generate adjusted free cash flow of $9.5 billion to $10 billion. Our year-over-year basis for our '22 adjusted EBIT target assumes significantly higher earnings in North America; aggregate profitability in the rest of the world; Ford Credit EBT at about $2.7 billion, with strong, though lower, auction values in the fourth quarter as the supply of new vehicles improves and higher borrowing costs; continued strong pent-up demand in orders for Ford's newest products; continued strength in pricing; higher commodity and broad-based inflationary costs of about 9 billion; no further deterioration in supply chain; and continuation of a strong dollar. So, finally, before getting to your questions, let me provide a quick update on our new financial reporting.\n\nLast quarter, we mentioned our plan to host a teach-in event early next year to help you prepare for this change to a radically new strategic organization ahead of our first quarter 2023 reporting. So, we've now fixed the date for March. At the teach-in, we will share both 2021 and 2022 revised results to reflect our new segmentation, which we will start using for reporting purposes in Q1 of 2023. But because this is far more than an accounting exercise, we'll also reiterate and illustrate the business rationale for the change along with the reporting mechanics and implications for our earnings disclosures and SEC filings.\n\nAnd we'll furnish you with a full toolkit to help you transition your models. So, that wraps up our prepared remarks. We'll use the balance of the time to address what's on your minds. And thank you.\n\nOperator, please open the line for questions.\n\nOperator\n\n[Operator instructions] Our first question today is from John Murphy with Bank of America. Please go ahead.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nGood evening, guys. Thanks for all the detail. A lot of questions, I'll try to keep it to one here. You know, on the pivot from AV to ADAS or semiautonomous, Jim, there's a lot of moving pieces here.\n\nBut there are some out there that believe they have a solution to this that's close to working. And I think some of us thought that Argo might be not that far behind. So, I'm curious what changed. And if you think those folks may be misguided in their assumption that they actually have a solution.\n\nAnd sort of the corollary to that is, are you going to take this capital? And it sounds like you are going to, and accelerate your EV and your connectivity efforts that will generate profits much more quickly in the near term. And how much profit opportunity are there -- or is there around these connected vehicles that you're seeing with Pro that might spill over into the consumer side?\n\nJim Farley -- President and Chief Executive Officer\n\nThank you, John. The decision we made to reallocate our capital is a strategic one. It's some combination of the margins we're starting to see on our software, like Ford Pro, that's really the first large shippable software. The usage patterns we're seeing in BlueCruise, how much people use it, and how passionate they are, and that's before ICE off; the confidence we now have in delivering L2 -- Level 3; the access to public markets for Level 4 funding; the opaqueness, as John said, of the view to return capital, the invested capital in Level 4 and Level 5.\n\nAnd it's some combination of that and a few other factors. But the biggest factor is our growing confidence in our talent, both the Argo talent and the team at Ford that Doug is building. And I'm sure in the investment conference, that will be a big focus of his comments. It's that combination, more than are we behind or we ahead that informed us of this decision.\n\nAnd I think it's one of the bigger moments for us as a leadership team. And we are so excited about the software we can ship to our vehicles. We see it in BlueCruise now. We see in Ford Pro.\n\nAnd we see other software that we're in the midst of. And the other key enabler is our growing confidence in landing a fully software-updatable vehicle as we launch our second cycle of EVs. John, maybe it's best for you to talk about the reallocation of capital.\n\nJohn Lawler -- Chief Financial Officer\n\nYeah. So, first off, we're not capital constrained. We're investing our $50 billion. We're investing on top of that in connectivity and software.\n\nSo, we ended the quarter with $32 billion of cash and $49 billion of liquidity. So, it's taking that investment and putting it toward a business where we think we will have a sizable return in the near term relative to one that's going to have a long arc. And that's the business decision behind it. So, I think we need to be very clear about that.\n\nWe're going to invest in L2 and L3, and some of the savings that we have will go into that.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nIf I could just maybe just follow up on that. I mean there's got to be a high level of confidence that you're not going to be left behind as autonomy may develop over time. So, I mean, a skeptic would say, you know, you're throwing in the towel, and you can't keep up. An optimist would say, you know, you actually have confidence, and you'll be able to keep up and maybe surpass the competition over time.\n\nI mean, how would you couch it, you know, in that range?\n\nJim Farley -- President and Chief Executive Officer\n\nWell, I think it's best, John, for us to hear from Doug.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nOK.\n\nJim Farley -- President and Chief Executive Officer\n\nBut before we do that, I want to emphasize that a winning L4 business is as much about the go-to-market investment of a consumer-facing service. And all the depots, all the HD mapping of all the ODs across this enormous geography, all the enormous fleet, and because it's still weather-constrained, you have to have a driven fleet to complement it. So, aside from the -- handicapping the technology, the enormous investment that will have to be made in the nontechnology pieces is a big factor in our thinking. And, Doug, maybe you could talk about how we're -- because we're still very excited about Level 4, how you see it as a technologist on the technology portion?\n\nDoug Field -- Chief Advanced Product Development and Technology Officer\n\nSure, Jim. As you mentioned, this is going to be a really tough problem to solve. It's the toughest problem of our generation. And I don't think about it as capital constraints nearly as much as talent constraints.\n\nIn the kind of projects that we are diving into at Ford and the kind of work that we're doing, the constraint really becomes how many of the world's best people can you get working on a problem. And that's really the decision, in many ways, that is driving what we're doing here at Argo is we are deeply passionate about the L3 mission. We have ideas of how it can work and how customers can interact with it that are really exciting, particularly when you add them to our next-generation EVs. So, this is the way we want to use that talent.\n\nAnd we think it's the most meaningful way for them to impact the world.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much, guys.\n\nJim Farley -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext question is from Colin Langan with Wells Fargo. Please go ahead.\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nGreat. Thanks for taking my question. Just a follow-up on the Argo, just to be clear, I mean, did you look for acquirers for the business? I mean, obviously, rather than taking a big impairment. And, you know, maybe a follow-up a little bit.\n\nWhat is your kind of timeline for Level 4 that you're looking at? I mean, do you think this is 20 years out at this point? I mean, I guess you had a comment with some sort of assessment before you made the decision.\n\nJim Farley -- President and Chief Executive Officer\n\nAbsolutely. As I mentioned, Colin, we looked at many variables, and one of them is access to public markets. We were very clear that the Argo journey would include access to public markets over the last year. And, you know, we feel like that's a lot more challenged.\n\nSo, yes, we looked at possible partnerships and funding. But it was one of maybe 10 factors that we looked at in making this decision. John, maybe -- why don't you share your -- our discussion as a leadership team on the time frame?\n\nJohn Lawler -- Chief Financial Officer\n\nYeah. So, Colin, when we looked at this, as Jim said, not only does it require the technology breakthroughs and the capital invested in the technology, but then in all the services and fleets, scaling across the country that would be required to get to a profitable business. We saw that, you know, five years-plus the horizon being that far out before you could actually get to something that started to generate a meaningful business. And we see a much greater opportunity to impact more customers immediately with the L2, L3 technology, and impact our business in a positive way in the more near-term time frame.\n\nSo, that was part of the business discussion that we had with the team.\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nGot it. And I actually have a quick follow-up. In terms of the guidance change, you lowered guidance at the midpoint by 500 million. But you did indicate raw materials look like about a 2 billion worse headwind.\n\nYou lowered forward credit, volume guidance came down. So, any color on the offset to the headwinds that you outlined in the release?\n\nJohn Lawler -- Chief Financial Officer\n\nYes. I think it's really two things. It's, you know, the mix that we can see, vehicle line mix coming out of the supply base and then sterling. The exposure we have, as you know, we're the largest commercial vehicle player in Europe from a brand standpoint.\n\nAnd we have a very strong presence in the UK. And so, that currency change did hit us quite hard after the quarter closed. And so, when we look at that, one of the things that we've done, Colin, that I've done, is I spent a lot of time -- the team has -- the last couple of weeks, doing deep dive on-site reviews of the supply base. In fact, we're approaching a deep review of almost 300 of those suppliers.\n\nAnd what we're finding is that there's a number of nonchip suppliers that are struggling to ramp production as the chip crisis eases. And it's not easing tremendously, it's easing slightly. We're starting to see that. But then we're seeing issues in nonchip suppliers.\n\nIt has to do with the tight labor market, but it also has to do refining with many of the suppliers during the COVID time frame had not invested in maintenance or in their facilities and tooling. And so, they're not able to ramp as we expected. And that's hit us in the fourth quarter on mix versus what we had expected. And so, it's really the mix in the currency that's getting to us and brought us down to the low end of our range.\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nOK. And the offset to that 2 billion in results, is that pricing and possible vehicle mix? Sorry.\n\nJim Farley -- President and Chief Executive Officer\n\nYes, pricing. Net pricing continues to remain strong. Exactly, pricing continues to remain strong.\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nOK. All right. Thank you very much for taking my question.\n\nOperator\n\nThe next question is from Ryan Brinkman with JPMorgan. Please go ahead.\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking my question. Are you able to dimension for us how much of the $1 billion of higher-than-expected supplier-related inflation costs incurred in 3Q actually relate to in-period expenses incurred by suppliers versus how much might represent a catch-up of prior period cost? To know that I think would help with understanding what portion of this headwind in 3Q that we should model as continuing into 2023 versus how much might be more onetime in nature.\n\nJim Farley -- President and Chief Executive Officer\n\nYeah. So, one of the things that we're doing is, as we're taking settlements with the supply base, we're looking to do that more in a lump-sum fashion, so that it's not baked into the piece price. And we'll share more about what that means on a go-forward basis as we talk about '23 in Q4. So, what we've provided for the year is $9 billion, up from $7 billion last quarter when we reported it.\n\nThe amount of $1 billion in the third quarter was part of the third quarter, but it was also a settlement for the first half as well. And it largely reflects a lot of ways, a confluence of factors that led to that. One of the things we are having better clarity around is schedule and stability. And combining that with labor shortages and our high complexity, that had a larger impact on the supply base's ability to deliver cost efficiencies this year and much higher than we expected, and quite frankly, higher than we were initially willing to accept.\n\nAnd so, we spent a lot of time with our supplier partners. And we came to the conclusion. And that included conversations all the way up with June with supplier CEOs. And our conclusion coming out of that was that it became evident that we needed to increase the settlement amount, support our supplier partners, and we made the call in the third quarter.\n\nAnd then, we told all of you as soon as we made that call, so that we got out in front of it and knew what we knew.\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nOK. Very helpful. And lastly, I think at the time of the 2Q call, you considered it a bit too early to say whether commodity costs are likely to be a tailwind or a headwind next year. But with the subsequent decline now in spot prices, are you more confident that commodities are likely to be a tailwind? And are you able to dimension at all that tailwind or maybe compare it directionally in magnitude to the headwinds that you're likely to face when it comes to noncommodity supply chain costs, which do not seem to be, you know, deflating similar to commodities?\n\nJim Farley -- President and Chief Executive Officer\n\nYeah. So, we are seeing the commodity spot prices come off a bit. But quite honestly, it's not meaningful enough at this point to make a significant impact. I think, you know, we're all trying to work through the macroeconomic environment how far are things going to slow down, how quickly will that drive easing of commodity prices, will that also drive, you know, ease in the whole logistics chain.\n\nWe know that logistic prices are up significantly. Ocean freight is up significantly. And so, you know, right now, we're trying to make that call on 2023, with a quarter left to go, is a really difficult thing to do. So, we're going to hold off on doing any of that today.\n\nAnd we'll be able to talk about more of that with our Q4 earnings at the beginning of next year.\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question is from Rod Lache with Wolfe Research. Please go ahead.\n\nRod Lache -- Wolfe Research -- Analyst\n\nHi, everybody. I wanted to just ask about vehicle pricing. Jim, you've always had a pretty good read on seeing the market through the consumers' lens. And obviously, average transaction prices are up a lot.\n\nAnd now, rates are going up, and trade-in values are starting to come off the peak. Can you maybe just give us your thoughts about affordability and this interplay between price and volume and inventory starts to normalize? It'd be helpful if you had any thoughts on kind of the magnitude of price normalization that we might see over the next year or two?\n\nJim Farley -- President and Chief Executive Officer\n\nThank you, Rod. The early signs are coming in. It's interesting. It's lumpy.\n\nThe commercial vehicle and EV demand is through the roof. We've seen literally no -- no change, if not an increase. And that includes commercial vehicles in Europe, which is interesting. Our order bank continues to grow.\n\nIt's multi, multi month. We continue to have to close out order windows for our commercial vehicles because of the demand. Same for EVs, as we've taken prices up. On the retail side, in the U.S., what I see that's different from last quarter is slight uptick on 84-month customer financing.\n\nAnd, Marion, if you want to go into that, that's fine. We're seeing, obviously, an easing of used cars, which makes trade-ins, and those transactions that include trade-ins a little more challenging for customers for higher payments. We're seeing -- the one that I watch the most is our turn rates for F-150. It's our highest-volume vehicle.\n\nAnd we're starting to see some differences in turn rates between XLT and Lariat. It's small right now, but it's different. In the past, Lariat's turned faster than XLT, and that's reversed compared to the quarter. It's really subtle right now.\n\nSo, what I'd expect on pricing -- and you see some of our competitors come in with higher spending now on incentives. So, we've already accounted for some of that, as John has said, in the past. What I would be looking for and what I think is important to watch for is the mix changes. The mixes of series and specifications within a profitable nameplate, like Super Duty or F-150, or mix shifts, obviously, between models.\n\nRod, our lineup is so fresh right now. It's very opaque for us. So, the only mix shift we're seeing is within spec. Marion, do you want to mention anything about payments?\n\nMarion Harris -- Chief Executive Officer, Ford Credit\n\nYes. We're seeing some customers extending terms for vehicle affordability trying to stay at the same payment level. But with higher transaction prices and higher interest rates, customers are going longer term. And we've seen vehicle payment, even with that, move out quite a bit this year.\n\nAnd it's -- that's starting to have a bit of an effect. And it's in pockets around the country as well. So, many areas are still very, very strong. In other areas, you hear about deals not going through because of, you know, changes in payment quality.\n\nRod Lache -- Wolfe Research -- Analyst\n\nThanks for that. And maybe just switching gears, Marion, I'm trying to understand your implicit guidance for Ford Credit. You brought the full year down a little bit, at least it optically looks that way from around 3 billion to 2.7 billion. But now Q4 looks like it's quite low.\n\nI was wondering if you might be able to give us some color on where you expect to end the year in terms of loss reserves. At one point, you had, I think, post-COVID, taken the reserves up to 1.2% of managed receivables. Is that sort of something that you're -- that's implicit in these numbers? Or is there anything else in there that's driving that level of profitability?\n\nMarion Harris -- Chief Executive Officer, Ford Credit\n\nYeah. Let me just give you the key takeaways here. First of all, our balance sheet is significantly smaller than it was a few years ago, right off the top. Second, we're no longer releasing COVID-related credit loss reserves.\n\nWe're back at what we would consider normal reserve levels. Third, our lease depreciation tailwinds are mostly behind us, and we have lower used car values as we look forward. And fourth, our borrowing costs are higher, which we haven't been able to fully pass on to customers as rates have risen rapidly. That's something, though, that, over time, we do expect the balance sheet to grow.\n\nAnd we would expect some continued borrowing cost headwinds, but those will moderate and ease over time as the portfolio returns.\n\nRod Lache -- Wolfe Research -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour next question is from Mark Delaney with Goldman Sachs. Please go ahead.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nYes. Good afternoon. Thank you very much for taking the questions. So, maybe you could share more on the timing to bring L3 products to market? And is that something you think Ford will be developing in-house, perhaps, with some benefit from Argo capabilities? I was just thinking something you, perhaps, leverage from some of the suppliers in some of their potential input or maybe some combination?\n\nJim Farley -- President and Chief Executive Officer\n\nThank you, Mark. I think, Doug, is best suited to answer this. All I would say is that we're timing the arrival in line with our second cycle of EVs and a fully updatable -- software-updatable vehicle. So, kind of think of that '23 to '25 time frame is Ford completely refreshing its EV lineup globally, introducing fully updatable electrical architectures and in-house software development for controlling the vehicle, leveraging all of our experience of now we've done 5 million OTAs, and on enhanced Level 2+ and Level 3 system.\n\nOver to you, Doug.\n\nDoug Field -- Chief Advanced Product Development and Technology Officer\n\nThanks, Jim. We are not going to ignore the capabilities of suppliers that can provide value in our L3 solution. They are great manufacturers of components of systems, such as imaging sensors and radar. And we'll take advantage of that.\n\nBut we will have a core team that can integrate a system, understand its performance at the system level, and we will own the software. It is really important that we also own the connection to these vehicles. L3 is a connected technology. So, the ability to have a pipeline that collects data and makes the system better and better, we must own that.\n\nFinally, the customer experience, how the customer moves in and out of autonomous operation, that's a problem that actually doesn't exist in L4 and is a huge opportunity for us to create a Ford experience that's really unique. So, those are the areas that we will absolutely develop great capability in-house and focus on in the L3 development.\n\nJim Farley -- President and Chief Executive Officer\n\nAnd we're really excited about the Argo team helping us with that internal effort.\n\nDoug Field -- Chief Advanced Product Development and Technology Officer\n\nYeah, we have just incredible talent.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nThat's quite helpful. Thank you. And one more on EVs, if I could, please. You mentioned the myriad of ways that the IRA could potentially benefit Ford.\n\nAnd you reiterated the capacity ramp targets through 2026, I believe. But do you think over the longer term and, perhaps, out over the next 10 years or so, does the IRA change the gross amount of investment you want to make into EVs and how quickly Ford may shift toward EVs, especially in the latter part of this decade? Thanks.\n\nJim Farley -- President and Chief Executive Officer\n\nIt only accelerates what we're going to do for sure. And what's exciting for us is being a 40% player in the U.S. and the top brand in Europe of commercial vehicles. In the U.S., I mean, we never had this before.\n\nAnd to give you a sense of the EV tax credit for commercial, how evocative that is for Ford, the people who buy a police vehicle, so people who buy ambulances for communities, the emergency responders, they never had tax credits. They are going to have -- this is not just a $7,500 tax credit for consumers. This is for businesses, including local municipalities. So, I think this will have a dramatic impact on the adoption of EV, which we're already 90% market share in the e-van business.\n\nWe think we'll really accelerate the demand for these commercial EVs. And that's only going to accelerate our speed to market and our scaling of those vehicles. We can't wait to show you the vehicles themselves because they're second-generation commercial EVs. So, you know, this is going to accelerate.\n\nWhat's not clear yet, I said, is will the consumer demand side of this legislation be the largest benefit to our customers in the company? Or will it be more like the industrialization of vehicles? That's something to play out in the marketplace. And it's hard to handicap that, honestly.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Joseph Spak with RBC Capital Markets. Please go ahead.\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nThanks so much, everyone. Maybe, Jim, just picking up there on the IRA side, you mentioned the $7 billion between Ford and the partners. I believe that is sort of that full $45. Can we just drill down a little bit? Because it would seem to me like you should at least be able to get the 10 for the pack starting next year.\n\nAnd then, where are you in sort of negotiating, you know, maybe how much of that 35 you can get from some of your partners? And then, just on the commercial side, like, should we really think -- how should we think about, I guess, the mix of EVs next year between commercial and retail? Because it seems like it's, to your point, pretty skewed in one direction.\n\nJim Farley -- President and Chief Executive Officer\n\nYeah. Well, I wish we could go into the commercial negotiation with our battery partners, but I'm not going to go into it now. But you can imagine there's lots of interesting discussions going on right now between because we're obviously in the middle -- I mean, some -- we've already inked a deal on our DAs. Others are still in the mix.\n\nSo, I wish I could cover that with you right now, but I don't think that would be fair to our battery partners to go public with -- with how that's going to benefit both of us. But you can imagine. I mean, I just think of it, generally speaking, as proportional to our investments. On the commercial EV, I have to say, the demand for the move to electric on our commercial customers is, in many ways, more robust than the retail side, even though we're completely sold out in both, for the three products.\n\nThe turn rates are just enormous, the order rates. But the profitability is different between a commercial EV and a retail EV. And we're going to be breaking out our EV business and profitability soon. So, this is going to be quite interesting for all of you and for us as we do that.\n\nSo -- but I will tell you, this is a big help. This will really help the profitability of our commercial vehicle that are EV. And I think it will really stimulate the demand. The tricky part for us is, operationally, what do we do between now and the end of the year.\n\nThat's the tricky part for us operationally, is we have a lot of customers who are going to wait until next year to order, you know, a Lightning Pro or an E-Transit. But I think, for sure, this is just going to upset that equilibrium. We have to -- by the way, we have to -- we have this discussion inside the Company every day. How many Lighting Pros do we want to make? And how many Lightning retail F-150 EVs do we want to make? So, it's already quite spirited discussion.\n\nBut I think this will help our profitability quite a bit even next year, which you will see. And we're really excited about this change. I mean, having almost 65% of our customers qualify, including local municipalities, is a game changer for our demand. Yeah.\n\nJohn, anything you want to divulge about the negotiations?\n\nJohn Lawler -- Chief Financial Officer\n\nNot about the negotiations. Thanks, Jim. [Inaudible] on that.\n\nJim Farley -- President and Chief Executive Officer\n\nOK.\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nMaybe just, you know, Jim, you've clearly shown since you've -- since you've been CEO that you've been willing to adapt and change to new information and circumstances, like the Argo announcements today, I think. And the other example would be, I guess, the LFP strategy you talked about earlier this summer. But I guess that has even maybe potentially changed a little bit again since, I guess, geopolitically, the U.S. relationship with China might have turned south.\n\nSo, any update on that? And is there a backup plan? Is there any risk to any of those timelines?\n\nJim Farley -- President and Chief Executive Officer\n\nThat is a very good question. So, you know, obviously, we have this unique profile as a commercial company in EV. And we now have, I mean, literally all the commercial pickup truck business that's EV. And we're 90%-plus on the van side.\n\nSo, it's a very important question for us. And we also think for affordability, back to Rod's point, LFP is a very important technology, and all the IP is in China. So, this is a really dynamic situation. I think what you'll see is that the tariff rules of the importing LFP batteries into the U.S.\n\nis still very favorable, so. And we have a really great contract with a particular LFP supplier to incorporate those batteries next year. So, I think, we're in really good shape. The real billion-dollar question is, when do you localize production of LFP in North America? And is that in the U.S.\n\nand Mexico? And, you know, where do you build the cells versus pack? And, you know, whose name is on the front of the building and all that? And, you know, we're not going to go into that. But I will tell you that just given the reality of the tariff structure, you know, we can import LFP from China economically now.\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nThanks for all of that.\n\nJim Farley -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLynn Tyson -- Executive Director, Investor Relations\n\nJim Farley -- President and Chief Executive Officer\n\nJohn Lawler -- Chief Financial Officer\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nDoug Field -- Chief Advanced Product Development and Technology Officer\n\nColin Langan -- Wells Fargo Securities -- Analyst\n\nRyan Brinkman -- JPMorgan Chase and Company -- Analyst\n\nRod Lache -- Wolfe Research -- Analyst\n\nMarion Harris -- Chief Executive Officer, Ford Credit\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nJoe Spak -- RBC Capital Markets -- Analyst\n\nMore F analysis\n\nAll earnings call transcripts"
}