{
  "companyName": "Worthington Industries",
  "companyTicker": "WOR",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/29/worthington-industries-wor-q1-2023-earnings-call-t/",
  "content": "Worthington Industries (WOR 0.18%)\nQ1 2023 Earnings Call\nSep 29, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning and welcome to the Worthington Industries first quarter fiscal 2023 earnings conference call. All participants will be able to listen only until the question-and-answer session of the call. This conference is being recorded at the request of Worthington Industries. If anyone objects, you may disconnect at this time.\n\nI'd now like to introduce Marcus Rogier, treasurer and investor relations officer. Mr. Rogier, you may begin.\n\nMarcus Rogier -- Treasurer and Investor Relations Officer\n\nThank you, Rob. Good morning, everyone, and welcome to Worthington Industries first quarter fiscal 2023 earnings call. On our call today, we have Andy Rose, Worthington's president and chief executive officer; Joe Hayek, Worthington chief financial officer; and Geoff Gilmore, Worthington's chief operating officer. Please note, given the business separation announcement we made earlier this morning.\n\nOur prepared remarks will be longer than normal. [Operator instructions] In addition, we have posted the slide presentation to our Investor Relations website, which provides more information on the planned separation. Before we get started, I'd like to remind everyone that certain statements made today are forward-looking within the meaning of the 1995 Private Securities Litigation Reform Act. These statements are subject to risks and uncertainties that could cause actual results to differ from those suggested.\n\nWe issued our earnings release earlier this morning. Please refer to it for more detail on those factors that could cause actual results to differ materially. This call is being recorded and a replay will be made available later on our worthingtonindustries.com website. At this point, I will turn the call over to Andy to kick things off.\n\nAndy Rose -- President and Chief Executive Officer\n\nThank you, Marcus. Good morning, everyone. In addition to releasing our first quarter results, this morning we announced exciting news that we are pursuing a separation of our steel processing business into a new public company, creating two distinct market-leading companies. It's an exciting day for Worthington.\n\nJoe is going to start with our first quarter results, and then I'll discuss the separation in more detail. Joe?\n\nJoe Hayek -- Chief Financial Officer\n\nThank you, Andy, and good morning, everybody. We do have a lot to discuss this morning, and so we'll get right to it. We started our fiscal year with solid results reporting Q1 earnings of $1.30 per share versus $2.55 in the prior year quarter. There were several unique items impacting the quarterly results that included the following.\n\nWe divested our 50% interest in ArtiFlex, which was a non-core joint venture for approximately $42 million. That divestiture resulted in an after tax loss of $0.25 a share. We took advantage of rising interest rates and annuitized the portion of our inactive gross and slugger pension plan, which resulted in a non-cash charge that negatively impacted earnings by $0.07 a share. Recognized incremental expenses of $0.01 per share related to our recent acquisition of Level5 tools in the earnout associated with that acquisition.\n\nAnd finally, we benefited by $0.02 per share due to a restructuring gain recognized in the current quarter, compared to gains of $0.09 per share in the prior year quarter. Restructuring activity in both periods was primarily related to the monetization of non-core real estate. Excluding those unique items, we generated earnings of $1.61 a share in the current quarter, compared to $2.46 a share in the prior year. In addition, in Q1, we had inventory holding losses estimated to be $2 million or $0.03 per share, compared to inventory holding gains of $47 million or $0.68 per share in the prior year, an unfavorable swing of $49 million, which is $0.71 per share.\n\nConsolidated net sales in the quarter at $1.4 billion were up 27%, compared to $1.1 billion in Q1 of last year. Increase in sales was primarily due to the inclusion of Temple Steel, combined with higher average selling prices across all of our segments. Gross profit for the quarter decreased to $169 million from $219 million in the prior year quarter. And gross margin was 12% versus 19.7%, primarily due to the swing from inventory holding gains to losses in steel processing.\n\nAdjusted EBITDA in Q1 was $140 million, down from $196 million in Q1 of last year. And our trailing 12-month adjusted EBITDA is now $560 million. I'll now spend a few minutes on each of the businesses. In steel processing, net sales of $1 billion were up 26% from $823 million in Q1 of last year, primarily due to the inclusion of Temple Steel, combined with higher average selling prices.\n\nDue to lower total volumes at our consolidated JVs, total ship tons were down 8% with direct tons making up 58% of mix versus 49% in the prior year quarter. Direct tons were actually up 8% year over year. Excluding the impact of Temple and the facility we closed in Decatur, Alabama, direct volumes were up 4% year over year due to increases in our automotive and construction end markets. Our team in steel continues to do a great job navigating inflation and supply chain challenges as they effectively manage complex programs for our customers.\n\nIn Q1, steel generated adjusted EBIT of $35 million, compared to $108 million in the prior year. Large year-over-year decrease was driven by lower direct spreads, which were negatively impacted by the inventory hoarding losses I mentioned earlier, estimated to be $2 million in the quarter, compared to gains of $47 million last year, an unfavorable swing of $49 million. The inventory holding losses in this quarter included a $4 million charge to write inventory down to net realizable value through the expected future decline of steel prices at quarter end. Steel prices continue to be volatile and hard to predict, having fallen over $300 a ton since our Q4 earnings call in late June.\n\nGiven the recent steep decline in steel prices, we will have meaningful inventory holding losses in Q2, which we believe could be as high or higher than the $42 million estimated loss we had in Q4 of 2022. In consumer products, net sales in Q1 were $189 million, up 28% from $148 million in the prior year quarter. Increase was driven by higher average selling prices and higher overall volumes, which benefited from the acquisition of Level5 tools at the start of the quarter. Adjusted EBIT for the consumer business was $21 million and EBIT margin was 11.1% in Q1, compared to $21 million and 9 -- and 13.9% last year.\n\nAdjusted EBIT in the current quarter was negatively impacted by $3 million of expenses related to the Level5 acquisition that included the write up of inventory to fair market value. In addition, production delays and ongoing inflationary pressures, including higher wages and input costs, were a drag on margins for the quarter. While this quarter could have been better for our consumer business, that team has executed very well in a challenging environment and continues to be focused on growing our business with new and innovative products that provide value for our partners and end consumers. Building products generated net sales of $150 million in Q1, up 31% from $115 million in the prior year.\n\nThe increase was driven by higher average selling prices. Loading products generated adjusted EBIT of $53 million for the quarter and adjusted EBIT margin was 35.1%, compared to $49 million and 42.5% in Q1 of last year. The overall improvement was driven primarily by our wholly owned businesses. The reduction in adjusted EBIT margin was driven by inflationary cost pressures in the wholly owned business as well, which partially offset the benefit of those higher average selling prices.\n\nOur building products JV has contributed EBIT of $44 million in Q1, an increase of $1 million over the prior year quarter as higher contributions from ClarkDietrich were partially offset by a decline at WAVE. While ClarkDietrich continues to perform very well, due to declining steel prices, we do expect their results to moderate moving forward. In sustainable energy solutions, net sales in Q1 of $31 million were up 21%, compared to $26 million in the prior year quarter due to increased volumes and higher average selling prices. Business reported an adjusted EBIT loss of $1 million in the current quarter, compared to a loss of $3 million in the prior year.\n\nThe operating environment in Europe continues to be exceptionally difficult as inflation, fuel shortages, and war-related dislocations continue to place the burden on that entire population. As a consequence, the financial results for sustainable energy solutions are likely to remain challenged in the near term. However, we continue to be very excited about SES' end markets, which are poised for above average growth over the long term. Our integrated solutions position us very well to enable the hydrogen ecosystem and adjacent sustainable energies.\n\nWith respect to cash flows and our balance sheet, cash flows from operations was $81 million in the quarter and free cash flow was $60 million. We've now generated over $200 million in free cash flows in the last two quarters. During the quarter, we invested $56 million to acquire Level5 tools, spent $21 million on capital projects, paid $14 million in dividends, received $48 million in proceeds from asset sales, and received $75 million in dividends from unconsolidated JVs. Dividends we received from our unconsolidated JVs exceeded their equity earnings during the quarter as their working capital levels have started to normalize and they were able to pay out earnings that were not distributed in the prior fiscal year.\n\nLooking at our balance sheet and liquidity position, funded debt at quarter end of $706 million decreased $39 million sequentially. Interest expense of $9 million was up slightly due to higher average debt levels associated with short-term borrowings during the quarter. We ended Q1 with $36 million in cash and $664 million in availability under our revolving credit facilities, positioning us with ample liquidity for the future. Yesterday, the board declared a dividend of $0.31 per share for the quarter, which is payable in December of 2022.\n\nAt this point, I will turn it back over to Andy.\n\nAndy Rose -- President and Chief Executive Officer\n\nThanks, Joe. We're off to a good start in fiscal 2023 with our second best first quarter ever. Adjusted earnings per share of $1.61 and EBITDA of $140 million are solid accomplishments in the face of declining steel prices and continued challenges throughout our supply chain. We continue to pare our nonstrategic assets with the sale of our 50% ownership interest in ArtiFlex during the quarter.\n\nWe are approaching the end of this multi-year process of repositioning our businesses for growth by exiting non-core and underperforming operations and beginning to invest in higher returning products and markets. We had almost $60 million of free cash flow during the quarter and our net debt to EBITDA is very modest at 1.2 times. End market demand remains steady across most of our products and markets. But recent market volatility could lead to changes in this outlook as higher rates impact various markets.\n\nOur employees continue to go above and beyond to deliver for our customers. Despite the many challenges the world has faced over the past few years. Today, we announced an exciting plan to separate our steel processing business into its own separately traded public company. The remaining business, which we are calling New Worthington for now, has market leading products and services in consumer products, building products, and sustainable energy.\n\nThis side of our business was recently resegmented to better align with the attractive markets it serves and develop broader growth strategies to leverage our strong market positions. New Worthington is poised to capitalize on key trends in sustainability, technology, remodeling and construction, and outdoor living, and will continue leveraging its robust new product pipeline of sustainable tech-enabled solutions to disrupt mature markets. We believe that new Worthington's high margins and lower asset intensity will provide the opportunity for premium sector multiples. Worthington Steel is a best-in-class steel processor with excellent growth opportunities in automotive lightweighting solutions and electrical steel laminations, positioned well to take advantage of fast growing trends in electrification, sustainability, and infrastructure spending.\n\nIt deserves its own platform and capital structure to accelerate its growth and value creation opportunities. This business will be run by Geoff Gilmore and the existing Steel leadership team. Geoff is currently our chief operating officer and previously ran steel processing and the former pressure cylinders. He has a broad skillset and is well qualified to lead steel as its own public company.\n\nGeoff is here to answer questions later and will join us for future earnings calls as well. We do not anticipate any material changes to our modest leverage and ample liquidity mindset for both companies, and we are likely to continue with similar capital allocation strategies. Both businesses will be run with our philosophy and Golden Rule principles and utilize the Worthington business system of transformation, innovation, and acquisitions to drive growth and shareholder value. This is a historic decision for us, so I thought I might try and answer two simple questions for you, why are we doing this and why now? The team and board are laser-focused on shareholder value.\n\nAnd it has become clear that we have two very distinct businesses that should be valued differently and will benefit from their own strategic focus and capital allocation priorities. Secondly, both companies are now big enough to succeed on their own as independent public companies, and we are coming at this from a position of strength. We just had two of the best years in the company's history and the business is performing well. We have low leverage and both businesses have robust growth strategies and are well positioned for the future.\n\nOur team and the board collectively made this decision and we are confident that both businesses will thrive as their own separately traded public companies. In doing so, we will be able to better service our customers, provide more and better career opportunities for our employees, and deliver stronger returns for our shareholders. I am in my 14th year at Worthington Industries and could not be more excited about our future. Our business is well capitalized, performing well, and poised to embark on a journey to take one great company and create two great companies.\n\nTo all of our customers, suppliers, employees, shareholders, and other stakeholders, I hope you share in our excitement for where we are headed. I'm sure there are lots of questions and we'll try to answer them all. But I would ask that you limit questions to quarterly results until we answer all those, and then you can reenter the queue and we'll discuss the separation. All right.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Martin Englert from Seaport Research. Your line is open.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nHi. Good morning, everyone.\n\nAndy Rose -- President and Chief Executive Officer\n\nMartin, good morning.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nSo just to clarify. Holding losses in steel for the quarter was about $1.5 million for the absolute value, correct?\n\nJoe Hayek -- Chief Financial Officer\n\nThat is correct. And part of that, Martin, was a bit of a bring forward, if you will, of losses that we could identify that we knew we were going to have in Q2 and we brought those forward into Q1, about $4 million.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK. And then your forward-looking comments was losses comparable or potentially exceeding the prior year gains, which I think was $42.1 million. Is that correct?\n\nJoe Hayek -- Chief Financial Officer\n\nSo the number is right. What we actually said was that they could be as large or larger than the losses that we had in Q4 of '22, which were $42 million. But your number is exactly right, because in Q2 of last year, we had $42 million in gains. So that's the way that we're thinking about it, just given the really steep decline that we've seen in steel prices.\n\nAs we all know, they were coming down and then the Russian invasion of Ukraine, they pop back up to $1,500, $1,600. And then since then, they've resumed their rather steep decline into under $800.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nGot it. So that -- thanks for clarifying that was relative to the 4Q loss of $42.3 million, something like that or actually greater. That's helpful. Can you provide a little bit of color commentary across the end markets on both the steel business as well as some of the consumer building products? What you're seeing incrementally on the margin, order books are looking, is there still -- there was a backlog of activity and that was supporting steel demand exiting out of COVID for quite a bit of this year.\n\nHow that's changing as it's changing at all.\n\nJoe Hayek -- Chief Financial Officer\n\nSure. So by end market, there are some things that are a little unique in each. But one of the things that's inherent to all the businesses and really to the entire market is inflation. You see higher prices, but then you also see much higher costs.\n\nAnd so in consumer products and in building products specifically, you have higher costs. In building products you actually have -- and in consumer products, excluding the purchase accounting for the Level5 acquisition, you saw increases in EBIT dollars, but then you saw decreases in EBIT margins. And that's a direct reflection of the inflationary trends that we're seeing. Steel is a bit more unique just because of the impact that rapidly rising prices have there and rapidly declining prices have in terms of people's behavior and on the way that sort of things can get priced, etc.\n\nAutomotive is starting to show some signs of life. We're not ready to declare that things are back. The -- everybody seems to have semiconductor solutions, but other supply chain limitations are holding them back. I think all the the Detroit Three have mentioned same over the last month or so.\n\nConstruction markets are reasonable as is Ag. All that being said, across our markets we see evidence, right, and signs that things are happening, that are slowing down and nothing is very steep and nothing is catastrophic. But as Andy mentioned, you're in an environment where the economy has higher prices and some potentially slowing growth. So we've got our eye on everything.\n\nBusinesses have a really good feel for what's happening. And the other thing that you would have see, I think in some of those results with respect to Temple, and then the markets at their end, those markets will continue to grow exceptionally well regardless of kind of where GDP is just because it's electrification, decarbonization, and infrastructure. So lots of and markets that we that we follow and lots of end markets that we're in. But for the most part, we feel really good about where we are and -- but we're certainly aware of the market conditions that we're in and where things may or may not go over the next 6 to 12 months.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nWhen you comment about kind of from a high level, things are slowing a bit on the margin, were you seeing this in construction and Ag? I mean, auto seems like it might be a little better on the margin incrementally here, but what about other key end markets as it pertains to steel, if you think about construction and Ag?\n\nJoe Hayek -- Chief Financial Officer\n\nNothing, nothing really specific that we would say strong growth or decline, Martin.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK. All right. Thank you for that color. I'll get back to you.\n\nJoe Hayek -- Chief Financial Officer\n\nSure.\n\nOperator\n\nYour next question comes from the line of Phil Gibbs from KeyBanc Capital Markets. Your line is open.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nGood morning.\n\nAndy Rose -- President and Chief Executive Officer\n\nGood morning, Phil.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nQuestion I just -- I had was on the consumer portfolio. And I know that that the volumes there have -- over the last 12 to 18 months have been very resilient. And then just anything that you all may be seeing to the extent is some of the big bucks guys could be taking down inventories into the end of the year. We're just reading what Walmart and Target are saying and the like.\n\nAnd how are you seeing that flow through to your consumer businesses?\n\nJoe Hayek -- Chief Financial Officer\n\nYeah. I mean, everything you said is true, Phil. Inventory levels at our customers have increased. Sometimes what that causes them to do is to want to kind of pare back on weeks of inventory that they have or how they're thinking about things like that.\n\nIt has a probably a bit of a more outsized impact on our tools business. There -- those products and those solutions really have longer supply chains and they end up in those retailers doing a good job. And so seeing a little bit of that. Our camping fuel and our torch business continues to be very solid.\n\nThat's, we believe, a bit countercyclical if people decide to travel less and spend more time at home, that's good. That's a benefit to those products. And then as we look at our helium business, there's actually a shortage of helium worldwide. We're fortunate that we have really good relationships with folks and are able to continue producing that domestically.\n\nAnd so as things are happening and as kind of retailers and consumers are sort of behaving a bit differently, we have pretty good data and pretty good insights and we're able to respond where we think it's appropriate. But as I said, nothing seems to be alarming at all but we've got our eye on it and we'll certainly stay vigilant.\n\nAndy Rose -- President and Chief Executive Officer\n\nMaybe just one other comment, Phil, on the one pound propane cylinder business. For a long time, we are kind of allocating product because we were behind. We are no longer on allocation, but I'm not sure inventory levels at some of the retailers are excessive for that product. That's the highest volume product that we have.\n\nAnd then the other thing, which I never really like talking about, but that business does benefit from natural disasters. And so there'll probably be some uptick in this quarter related to the hurricane in Florida.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nThanks, Andy. And then last question just here on the industrial portfolio. Well, what are you all seeing? Because I know it's -- I think it's reasonably diversified. A lot of it's North America, but some of it may be outside the U.S.\n\nSo maybe talk about what you're seeing in the industrial side of things and then I'll jump out here. Thanks.\n\nJoe Hayek -- Chief Financial Officer\n\nSure. I think you're talking about building products, right?\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nI was thinking about home or your industrial type cylinders.\n\nJoe Hayek -- Chief Financial Officer\n\nSure. So Phil, yeah. So those are embedded in building products. Those those larger propane cylinders continue to benefit from our team's really good work and our exposure to end markets that are continuing to grow rather nicely.\n\nThe JVs are a little sort of distinct WAVE and ClarkDietrich behave a bit differently. I think we mentioned in our prepared remarks that ClarkDietrich has been doing exceptionally well but they're a bit more susceptible to declines relative to steel prices. And so we do expect their results to moderate a bit going forward. Their outlook and their execution remains very strong as does the execution for WAVE.\n\nWAVE had to lap, I think, some of the lagging indicators they had relative to demand and some pricing dynamics that they had a year ago and we do expect them to continue doing a good job as well. The other businesses there are refrigerant, foam, and adhesive-oriented, and a bunch of other things. And while they'll always be pockets of issues that could be specific to product lines or anything else, overall, we feel like those businesses are solid GDP growers. And we obviously hope to do better than that through taking share and thinking about things that we can enhance relative to our products.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nThanks, guys.\n\nOperator\n\nYour next question comes from the line of Seth Rosenfeld from BNP Paribas. Your line is open.\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nGood morning and thanks for questions our questions. On the demand side, I was wondering if we can follow up your earlier comments on what you've seen across Europe is a bit of color on the scale of decrease and weakness you've witnessed of late. Did that kick in just recently in autumn or much earlier in the year when energy costs first start to increase? And what your sentiment is disregard to activity levels looking ahead through winter. Thank you.\n\nJoe Hayek -- Chief Financial Officer\n\nIt's a great question, Seth, and obviously you have a probably a better window to it than most of us. But the economy -- there are two economies that we have to really pay a lot of attention to in Europe. One is the general economy and then obviously the other is for high hydrogen, CNG, and alternative energies. Long term, what's happening for alternative energy solutions, it's going to accelerate adoption of hydrogen and fuels for all the reasons that we know about.\n\nShort term, there's going to be a fair amount of dislocation and -- I don't say this lightly, but some economic pain and some real hardship for people and for businesses. When we look at that economy, it was slow six to nine months ago. We anticipate it will be even more challenged moving forward as you mentioned, as you get into colder weather and you have scarcity issues with respect to energy, raw materials, things like that. Our businesses are doing everything they can to take care of their people, take care of our customers, and try and source things where they're available.\n\nAnd that's happening, I think, everywhere. But I don't think we would have kind of an order of magnitude because our business there is relatively specific, but we don't see it getting terribly worse than it has been and probably be as kind of an incremental down, but not much.\n\nAndy Rose -- President and Chief Executive Officer\n\nYeah. The other thing there, Seth, is it's not a huge revenue component for the overall business, our exposure there.\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nGreat. Thank you. And then maybe just coming back to the question on autos. Can you give any additional color on the scale of pickup you're witnessing? I think the feedback from many of your peers that because of continued delay in the pickup that we expected much earlier in the year.\n\nAny additional color on the scale witnessed to date and what your customers are telling you might happen looking forward as well?\n\nJoe Hayek -- Chief Financial Officer\n\nYeah, we think it's -- sequentially, it's pretty flat, Seth, the supply chain challenges. It seems as though most OEMs have solved or addressed their semiconductor shortages and those should get better. At the same time, there are shortages for other products and their ability to produce is bounded by lots of different things. And so we actually see automotive sequentially up slightly but from a low base.\n\nSo I would call it creeping along the bottom, searching for some upside. And the first half of 2023 calendar certainly looks better. And I think some of that -- some of the commentary was on was on Q3, which for a lot of those folks ends tomorrow. So --\n\nOperator\n\nYour next question comes from the line of Katja Jancic from BMO Capital Markets. Your line is open.\n\nKatja Jancic -- BMO Capital Markets -- Analyst\n\nGood morning. Thank you for taking my call. Can you talk a little bit about about the inflationary pressures? Specifically, what do you think -- how these will develop through the rest of the year? And maybe are you taking any actions that you could mitigate those? Thank you.\n\nJoe Hayek -- Chief Financial Officer\n\nSure we. We, like others, have seen inflation everywhere, whether it's in our business or at the grocery store or at the pump. And so we have taken kind of actions across the board with understanding that our input costs, everything from materials to labor have gone up. We have tried to pass along those costs so that we're able to execute on our business plan, and we pay attention to the elasticity of demand and we pay attention to what's happening out there.\n\nBut suffice it to say, we we don't see it sequentially going up by 10%, but we also don't see it going down. I think we feel like we're at a relatively high level and signs we're seeing is that it'll be relatively plateaued for at least the next several months.\n\nKatja Jancic -- BMO Capital Markets -- Analyst\n\nOK. Just maybe one more on the. So the steel prices are coming down. Shouldn't that benefit the former cylinder businesses a bit or is there a delay that we should be looking at?\n\nJoe Hayek -- Chief Financial Officer\n\nThat's that's exactly right there. We try very hard to understand and we've got to take care of our customers with fixed price contracts for anywhere from nine months to a year. And so anytime prices go down like this, there is absolutely a bit of a delay in terms of the potential benefit that we would have there.\n\nKatja Jancic -- BMO Capital Markets -- Analyst\n\nOK. Thank you very much.\n\nJoe Hayek -- Chief Financial Officer\n\nSure.\n\nOperator\n\nYour next question comes from the line of John Tumazos from JTI Research. Your line is open.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nHi. Did we buy any shares back in the current quarter?\n\nJoe Hayek -- Chief Financial Officer\n\nWe did not.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nAre you benefiting from a rebound in vehicle output either on the programs that Worthington supplies or you're competitors getting busier leaving you other business, given that the chip shortage is easing?\n\nJoe Hayek -- Chief Financial Officer\n\nYeah, we definitely feel like we have done well. And our ability to manage these complex solutions is increasingly attractive to our customers. When you see it, direct volumes are actually up a bit. That's, we believe, a market share gain.\n\nAnd so we don't anticipate. Automotive recovering to pre- or post-COVID levels just because those supply chain challenges are persisting, John. But we do feel pretty good that they won't be any worse volume wise than they have been the last six or nine months.\n\nAndy Rose -- President and Chief Executive Officer\n\nYeah, I mean, end market demand is still pretty good. I think the SaaS rate is in the 14s, 14 million and 14 but dealer lots are still very low with respect to inventory. So even if there is some softness on the sales side, we expect at least for the next several quarters, that demand will be good in the steel business.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nWill ArtiFlex be gone in the November quarter entirely?\n\nJoe Hayek -- Chief Financial Officer\n\nYes.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nIs Servius Sarah the only J.V. that will be with the steel processing company?\n\nJoe Hayek -- Chief Financial Officer\n\nThe majority owned JVs that are embedded in steel today will certainly also remain with steel. TWB, Spartan, Samuel, WST.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nOne irony has been that the other large distribution company, Reliance, seems to have outperformed Worthington a great deal in terms of share price. With this separation, do you think the new steel processing will be in a better position to match or exceed Reliance in terms of --\n\nJoe Hayek -- Chief Financial Officer\n\nI mean, that's part of the thesis here, John, is more focused leadership teams and more focused capital allocation that we do expect the business to accelerate its growth and obviously hopefully outperform. We don't control the share price, but there is obviously some intent here to unlock value for both businesses.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nThank you.\n\nOperator\n\nAnd your next question comes from the line of Martin Englert from Seaport Research Partners. Your line is open.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nHi. You think you're OK with taking some questions on the separation?\n\nAndy Rose -- President and Chief Executive Officer\n\nYeah. John provided us a great segue. So, absolutely. Go ahead, Martin.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nExcellent. Thank you for that. Any anticipated separation costs or goalposts that we can use?\n\nAndy Rose -- President and Chief Executive Officer\n\nYeah, we're -- we don't have a great feel for that. We're not going to disclose that but we absolutely will keep you posted and will disclose that number every quarter as we go forward.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK. What about thoughts on loss of synergies separating here, whether it be purchasing power or the corporate overhead aspect of it?\n\nAndy Rose -- President and Chief Executive Officer\n\nYeah, we absolutely know that those are real. We don't believe that any of those numbers or amounts will be material.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK.\n\nAndy Rose -- President and Chief Executive Officer\n\nI mean they're not -- obviously, they're not nothing, but we'll -- we've -- we're making that into our assumptions and we're confident that it won't impact either company's ability to reach its goals.\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nOK. That's all I had on that. Thank you very much.\n\nOperator\n\n[Operator instructions] Your next question comes from the line of Seth Rosenfeld from BNP Paribas. Your line is open.\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nThank you for taking our questions again. First, with regard to the separation, can you touch on if there's any need to refinance any of the debt in order to complete the spin of your different businesses? I'll start there, please.\n\nAndy Rose -- President and Chief Executive Officer\n\nI think you said the need to refinance, Seth, if I understood correctly.\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nYes, please.\n\nAndy Rose -- President and Chief Executive Officer\n\nSo we have not finalized capital structures for either company. What we can say is that we expect both business to businesses to be conservatively capitalized. We use the phrase modest leverage and ample liquidity. And so we want both companies to come out of the gate with plenty of capital to meet the needs of growing the business.\n\nWe obviously are going to be very focused on trying to preserve most, if not all, of the attractive financing that we have in place, some of that will have to be refinanced. Hopefully, not all of it.\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nOK. Thank you. As a separate question, please. Would we think about this? Because obviously the last two years have been exceptional, but Worthington Steel historically has seen more volatile windfall gains and losses than perhaps industrial business.\n\nAnd the guidance for Q2 is a sharp reminder of that. How do you think about how Worthington Steel operates going forward? Is there an effort to adjust inventory management to try to limit the risk of inventory losses on stand-alone basis? Or do you view it as being adequately stable and that you don't need a change in strategy?\n\nAndy Rose -- President and Chief Executive Officer\n\nI mean, I do not anticipate a change in strategy. I should probably let Geoff answer this question. But the reality is we are always focused on trying to minimize the amount of inventory and hence the amount of price swings or volatility in earnings related to that. We've talked about this historically.\n\nWe run kind of a balanced position. When we sell to a customer, we match it up with a mill contract, but we have inventory in our system and that's where we get this volatility. But we have an amazing price-risk management team and a sales team and purchasing team that work tirelessly to minimize that volatility as best we can. But the reality is at the end of the day, we're always going to have some of it.\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nOK. That's very clear. Thank you.\n\nOperator\n\nOur next question comes from the line of Phil Gibbs from KeyBanc Capital Markets. Your line is open.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nHey, guys. As we look to this potential separation in early calendar 2024, we've obviously got some time before then -- before that occurs, perhaps a year and a half. Will you continue to essentially operate your capital allocation structure as the current enterprise as the way you've done in the past, which is be very opportunistic in terms of the stock buybacks and then be also focused on M&A or will some of those things be put to the sidelines as you sort of get your arms around capital structures and how you want to work those businesses moving forward? In other words, business as usual for you all in the next 18 months, or you can almost operate with the mentality that they're already separated?\n\nAndy Rose -- President and Chief Executive Officer\n\nYeah. I mean, that's a little bit of a difficult question to answer, Phil. What I would say is both companies -- well, historically we've had sort of a balanced capital allocation strategy. We've deployed capital in the capex, we've paid dividends, we've bought back stock and we've pursued M&A but it's really just part of our strategy and our DNA.\n\nAnd that will likely continue for both companies. I will tell you, there is some focus right now on trying to make sure that when we do separate that both businesses are very well capitalized to go forward. Now, that doesn't mean we're not going to deploy capital. It just means that we're going to be cognizant of making sure that both businesses are set up for success.\n\nAt the same time, I will tell you, we still want to keep the gas pedal on our businesses and their strategies. We don't want to just stop pursuing growth and generating strong returns for shareholders. So there will be a delicate balance to trying to find the right mix for that, which could be more of the same, but it also could change things up a little bit.\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nThanks.\n\nAndy Rose -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nAnd your next question comes from the line of John Tumazos from JTI Research. Your line is open.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nI didn't rename my business, by the way. For the new companies going forward, how clear will the demarcations be in terms of new acquisitions? For example, a business like the old Dietrich Industries that was acquired over three decades ago became the new J.V. -- subsequent JV. Would that be considered a old Worthington business or a new Worthington business?\n\nAndy Rose -- President and Chief Executive Officer\n\nI'm not sure how to exactly answer that question, John, other than to say that certainly for the steel processing business, Worthington Steel, as we're referring to it, there are a number of consolidation opportunities. When we bought Dietrich a long time ago, we were pursuing kind of a, I'll call it a hub-and-spoke strategy by downstream steel consuming businesses. The steel processing business may do some of that or they may continue to just consolidate and some of the higher growth markets like electrical, steel, and automotive lightweighting, laser welding, where there's a lot more growth and frankly, a lot more margin than in the core business. But there's absolutely a consolidation component there.\n\nFor new Worthington, our M&A focus is on building strong branded consumer and building products and then also looking at the high growth and sustainable energy. So our focus is probably a little more, I'll call it, asset-light, finding great businesses that are less capital intensive and pursuing growth that way. But for at least the spin, when it happens, ClarkDietrich will stay with new Worthington.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nI recall calling on the late Bill Dietrich in '94 to take him public before Worthington bought the business, and he described it as buying non-prime, galvanized, and running it through a dive, but it was prime for steel framing but not prime for automotive or metal buildings. So he deconceptualized the business like a secondary steel business. So there's a lot of cracks, if you would. In terms of the two new companies going forward, will there be a common director and a procedure to make sure the two companies aren't bidding against one another for the same deal because of the overlaps?\n\nAndy Rose -- President and Chief Executive Officer\n\nThat's something we haven't really talked about. As you know, this separation is going to take 12 to 15 months or so. I don't actually expect there to be much, if any, conflict between the M&A strategies of the two different businesses. I think we're -- part of the thesis behind the separation is that the businesses are very different in terms of their strategic focus and where the growth is going to come from.\n\nSo I don't expect that's going to be an issue.\n\nJoe Hayek -- Chief Financial Officer\n\nYeah, but John, with respect to your question on common directors, one of the common things that we will have is our largest shareholder, right, who today owns a third of the company, will own a third of both companies. And so that piece of what has always been inherent and appreciated by the company will be in -- will stay in place.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nExactly. Thank you.\n\nOperator\n\n[Operator instructions] And there are no further questions at this time. I'll turn the call back over to Worthington Industries management for some closing remarks.\n\nAndy Rose -- President and Chief Executive Officer\n\nGreat. Thank you, everyone, for joining us today. This is an exciting day for all of us here at Worthington and hope you share in that excitement. We will keep you posted as things develop and look forward to speaking with you soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMarcus Rogier -- Treasurer and Investor Relations Officer\n\nAndy Rose -- President and Chief Executive Officer\n\nJoe Hayek -- Chief Financial Officer\n\nMartin Englert -- Seaport Research Partners -- Analyst\n\nPhil Gibbs -- KeyBanc Capital Markets -- Analyst\n\nSeth Rosenfeld -- Exane BNP Paribas -- Analyst\n\nKatja Jancic -- BMO Capital Markets -- Analyst\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nMore WOR analysis\n\nAll earnings call transcripts"
}