{
  "companyName": "The Toro Company",
  "companyTicker": "TTC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/the-toro-company-ttc-q3-2022-earnings-call-transcr/",
  "content": "The Toro Company (TTC -0.05%)\nQ3 2022 Earnings Call\nSep 01, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Toro Company's third quarter earnings conference call. My name is Latif, and I will be your coordinator for today. [Operator instructions] As a reminder, this conference is being recorded for replay purposes. I would now like to turn the presentation over to your host for today's conference, Julie Kerekes, treasurer and senior managing director of global tax and investor relations.\n\nPlease proceed, Ms. Kerekes.\n\nJulie Kerekes -- Treasurer and Senior Managing Director of Global Tax and Investor Relations\n\nThank you and good morning, everyone. Our earnings release was issued this morning, and a copy can be found in the investor information section of our corporate website, thetorocompany.com. In addition, we have introduced a quarterly earnings presentation, as well as an updated general investor presentation, both of which are now available on our website. We hope you find these new materials helpful.\n\nOn our call today are Rick Olson, chairman and chief executive officer, and Renee Peterson, vice president and chief financial officer. We also have Angie Drake, our newly promoted vice president of finance, and Jeremy Steffen who recently joined our team as director of investor relations. We begin with our customary forward-looking statement policy. During this call, we will make forward-looking statements regarding our plans and projections for the future.\n\nThis includes estimates and assumptions regarding financial and operating results, as well as economic, technological, weather, market acceptance, acquisition-related and other factors that may impact our business and customers. You are all aware of the inherent difficulties, risks and uncertainties in making predictive statements. Our earnings release, as well as our SEC filings detail some of the important risk factors that may cause our actual results to differ materially from those in our predictions. Please note that we do not have a duty to update our forward-looking statements.\n\nIn addition, during this call, we will reference certain non-GAAP financial measures. Reconciliations of historical non-GAAP financial measures to reported GAAP financial measures can be found in our earnings release and on our website in our investor presentation, as well as in our applicable SEC filings. We believe these measures may be useful in performing meaningful comparisons of past and present operating results and cash flows to understand the performance of our ongoing operations and how management views the business. Non-GAAP financial measures should not be considered superior to or a substitute for the GAAP financial measures presented in our earnings release and this call.\n\nWith that, I will now turn the call over to Rick.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nThanks, Julie, and good morning, everyone. I'd like to start by congratulating Angie on her promotion and welcoming Jeremy to our investor relations team. Angie most recently served as vice president of our construction business and was previously the chief financial officer of Charles Machine Works. She is a proven leader with strong financial expertise and impressive experience in strategic planning and acquisition.\n\nHer promotion is part of our succession planning for The Toro Company's finance leadership. Jeremy joins us with previous investor relations experience, along with roles of increasing responsibility across accounting and FP&A functions at several large publicly traded companies. We look forward to the many contributions they will make in their new leadership roles. Moving to our third quarter results.\n\nWe continue to execute at a high level and build upon our long history of delivering financial performance in line with our expectations. We achieved record quarterly results driven by strong professional segment performance and margin improvements. Our third quarter net sales grew by 18.8% while our adjusted diluted earnings per share grew by 29.3% both on a year-over-year basis. We continue to see favorable demand for our innovative products, along with incremental improvements in our supply chain and manufacturing efficiency.\n\nOur top line growth was driven by net price realization, as well as our ability to produce in what remains a dynamic operating environment. Professional segment demand was robust and broad-based and our team continued to focus on serving our customers well in this time of constrained supply. For our residential segment, demand was solid, moderating as expected and in line with more typical seasonal trends. Importantly, we achieved healthy, single-digit growth in the Residential segment, and that's on top of the higher base we've built with two years of double-digit growth.\n\nTurning to profitability. As a percent of net sales, we grew our adjusted operating earnings 100 basis points year over year and 30 basis points sequentially from the second quarter of this year. These results underscore our team's resiliency, dedication and ability to execute well. With this progress, we are raising our fiscal 2022 adjusted diluted earnings per share guidance for the second time this year.\n\nRenee will share more details on our guidance in a few minutes. Throughout the quarter, we remained focused on our strategic priorities of accelerating profitable growth, driving productivity and operational excellence and empowering people. As a result, we delivered strong performance in the near term while also setting ourselves up to capitalize on attractive long-term growth opportunities. This includes our integration of the Intimidator Group, which remains on track.\n\nOur teams are sharing resources and technology as we build our market leadership in the large and growing zero-turn mower space. We're excited about the publication of our latest corporate sustainability report. At the Toro Company, sustainability has long been ingrained in our purpose, actions and growth strategies. It is core to how we invest in our people, serve our customers and communities and compete and win in the right way.\n\nOur latest report outlines performance goals and specific targets aligned with our strategic priorities, including increasing battery and hybrid product sales, reducing absolute Scope 1 and 2 greenhouse gas emissions and increasing the number of women and racial and ethnic minorities in leadership positions. We are committed to doing our part in addressing today's global challenges while simultaneously strengthening our business. This includes developing next-generation solutions such as our battery and hybrid technologies. We're designing no compromise products that help our customers reduce or eliminate exhaust emissions while also delivering exceptional performance and productivity.\n\nIn July, our fully electric eTriFlex Greens Mowers were used to prepare the greens for the 150th Open Championship at St. Andrews Golf Club. This supported the club's sustainability practices, and it addressed their staffing challenges by allowing eight operators to perform the work previously done by 24. Equally important, these mowers created world-class playing conditions while providing a second-to-none experience for the operators.\n\nOur commitment to sustainability is also demonstrated in the way we partner with community and industry leaders. Recently, we hosted our first Sustainability Lab, which is a forum we established to share ideas and facilitate increased collaboration between The Toro Company and urban park systems across North America. Through this initiative, we hope to gain a deeper understanding of how agencies and manufacturers can work together to better support sustainable solutions and best practices. These highlights are just two examples of the many ways we support our purpose of helping our customers enrich the beauty, productivity and sustainability of the land.\n\nI will now turn the call over to Renee for a more detailed review of our third quarter financial results.\n\nRenee Peterson -- Vice President, Chief Financial Officer\n\nThank you, Rick, and good morning, everyone. We delivered record results in the third quarter, by driving operational excellence and profitability improvements. While the overall supply chain environment remains dynamic, our team continued to adapt and execute well. We grew net sales to $1.16 billion, an increase of 18.8% compared to the third quarter of last year.\n\nReported and adjusted diluted EPS for the quarter were both $1.19, up from $0.89 and $0.92, respectively, in the third quarter a year ago. Professional segment net sales for the third quarter were $886.2 million, up 23.3% year over year. This growth was primarily driven by net price realization, increased shipments of zero-turn and stand-on mowers and incremental revenue from our acquisition of the Intimidator Group earlier this fiscal year. This was partially offset by lower volumes in certain key product categories due to product availability constraints.\n\nProfessional segment earnings for the third quarter were $166.2 million. and when expressed as a percent of net sales, 18.8%. This was up from 17% in the third quarter of last year. The year-over-year increase was primarily due to net price realization, productivity improvements and net sales leverage.\n\nThis was partially offset by higher material, freight and manufacturing costs and the addition of the Intimidator Group at a lower initial margin relative to the segment average. Residential segment net sales for the third quarter were $270 million, up 7.1% from last year despite unfavorable hot and dry weather patterns in certain regions this year. This builds on the 23% year-over-year growth we reported in the third quarter of fiscal 2021 and 38% year-over-year growth in the third quarter of fiscal 2020. The increase for this quarter was primarily driven by net price realization and higher shipments of zero-turn riding mowers and snow products.\n\nThis was partially offset by lower sales of walk-power mowers and portable-power products. Residential segment earnings for the quarter were $26.3 million, and when expressed as a percent of net sales, 9.8%. This was down from 12.5% for the third quarter last year. The year-over-year decrease was primarily driven by higher material, freight and manufacturing costs, partially offset by increased net price realization, productivity improvements and favorable product mix.\n\nTurning to our operating results. In the third quarter, reported and adjusted gross margin were both 34.5%. This was a 60 basis point improvement compared to 33.9% for both in the same period last year. The year-over-year increases were primarily due to net price realization and productivity improvements, partially offset by higher material freight and manufacturing costs, and the addition of Intimidator Group at a lower initial gross margin relative to the company average.\n\nWith our strong operational execution, we achieved a 200 basis point sequential improvement in adjusted gross margin compared to the second quarter of this year. We continue to manage the factors within our control and are focused on restoring and improving margins over the long term. SG&A expense as a percent of net sales for the quarter was 20.5% compared to 21.4% in the same period last year. This improvement was primarily driven by a onetime legal settlement in the prior year period and net sales leverage.\n\nThis was partially offset by higher indirect marketing expenses. Operating earnings as a percent of net sales for the third quarter were 14%, up from 12.5% in the same period last year. Adjusted operating earnings as a percent of net sales for the quarter were 14.1%, up from 13.1% in the same period a year ago. Interest expense for the quarter was $9.2 million, up $2.2 million from the same period last year.\n\nThis was driven by incremental borrowing to fund our first quarter acquisition, as well as higher average interest rates. The reported and adjusted effective tax rates for the third quarter were 20.3% and 20.7%, respectively compared to 18% and 19.3%, respectively, in the same period a year ago. Turning to the balance sheet. Accounts receivable were $351 million, up 16% from a year ago, primarily driven by higher organic sales and our acquisition of the Intimidator Group.\n\nInventory was $939 million, up 41% compared to last year. This increase was driven by higher finished goods, work-in-process and service parts. In addition, this includes the impacts of inflation and incremental inventory from our acquisition. We made progress on reducing raw materials and work-in-process balances from Q2 to Q3 this year.\n\nAnd we expect our inventory composition and turns to normalize as we manage through this unique environment into fiscal 2023. Accounts payable increased 18% from last year to $487 million. This was primarily driven by higher purchase activity and inflation, improved payment terms and the acquisition. During the quarter, we issued 10-year private placement notes to refinance $100 million of outstanding revolver borrowings.\n\nThis was the final step in our planned refinancing related to the Intimidator Group acquisition. We also paid down $35 million of debt in the quarter. We remain within our gross debt-to-EBITDA target ratio of one to two times. We continue to follow our disciplined capital allocation approach, supported by a strong balance sheet.\n\nOur priorities remain making strategic investments in our business to support long-term profitable growth, both organically and through acquisitions, returning cash to shareholders through dividends and share repurchases, and maintaining our leverage goals to support financial flexibility. These priorities are highlighted by our actions this year, which include our plan to deploy approximately $140 million in capital expenditures to fund capacity, productivity and new product investments. Our $400 million acquisition of Intimidator Group in January and a return of $204 million to shareholders year-to-date with $94 million in regular dividends and $110 million in share repurchases. We are entering the fourth quarter with strong momentum, and we're encouraged by the incremental supply chain and operational improvements we are seeing.\n\nAs Rick mentioned, we are updating our full year fiscal 2022 guidance based on current visibility. For the full year, we now expect net sales growth of about 14%. This change reflects our expectation for the ongoing normalization of residential demand trends and takes into account the impact of unfavorable weather patterns this spring and summer. For the residential segment, we anticipate full year net sales growth in the mid-single digits.\n\nFor the professional segment, we continue to expect net sales growth above the company average. Looking at gross margins, we have made sequential improvement in each of the three quarters of the year. Taking into account current macro factors and the addition of Intimidator Group, we continue to expect fiscal 2022 gross margins to be slightly below fiscal 2021 levels. Moving to operating earnings.\n\nFor the full year, we continue to expect adjusted operating earnings as a percent of net sales to be similar to fiscal 2021. This takes into account the operational improvements we are realizing, the expectations for continued supply chain and inflationary pressures, as well as our acquisition of the Intimidator Group. This also anticipates more normalized SG&A spending in our fourth quarter of fiscal 2022. As we expect to continue to engage more directly with our customers and prioritize strategic research and development investments, we expect the full year professional segment margin to be slightly higher than last year and the residential segment margin to be lower.\n\nWe are confident as we close out the fiscal year, and we're raising our full year adjusted diluted EPS guidance to a range of $4.07 to $4.17. As a reminder, our adjusted diluted EPS guidance excludes the benefit of the excess tax deduction for stock compensation, as well as onetime acquisition-related costs. We are also updating our free cash flow conversion guidance to a range of 60% to 80% of reported net earnings. This reflects the working capital investments we are making as we manage through this time of constrained supply.\n\nWe expect free cash flow to revert to a more typical conversion rate in fiscal 2023 as we work to normalize inventory levels. In addition, we continue to expect depreciation and amortization of about $120 million, interest expense of about $36 million and an adjusted effective tax rate of about 21%. We remain focused on building our business for the long term as we execute on our strategic priorities and make prudent investments to support future growth. I will now turn the call back to Rick.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nThanks, Renee. As we enter the final quarter of our fiscal year, we remain well positioned in each of the attractive markets we serve. The supply chain continues to show signs of incremental improvement. We are making operational adjustments to drive enhanced agility and flexibility.\n\nWe are focused on serving our customers well and winning in our markets. Overall, end market demand remained solid. We are benefiting from the essential nature of our products as they are used to perform necessary work across outdoor environments. We're also benefiting from our market leadership and extensive distribution and service networks.\n\nCustomers recognize and trust our brands and appreciate the innovation, quality, durability and support that comes with our products. I'll now comment on the macro factors we are seeing in our markets, which could impact future results, starting with our professional segment. For underground and specialty construction, we continue to see strong demand with both private and public infrastructure investments, providing a multiyear tailwind. With the most comprehensive underground and specialty construction equipment lineup in the industry, we are prepared to capitalize on this heightened demand.\n\nFor golf, demand shows no sign of slowing down and course budgets are healthy. Rounds played continue to trend at a pace well above pre-pandemic levels. As the only company to offer both equipment and irrigation solutions and as the market leader in both, we are poised to build on our momentum. For municipalities and grounds, we continue to see the prioritization of green spaces, as well as increasing interest in zero-exhaust emission products.\n\nFor customers seeking sustainable solutions, we are well positioned with a growing suite of no compromise offerings geared to professionals. For snow and ice management, we're seeing healthy preseason bookings following the late-season storms earlier this year that cleared out inventory in the channel. We continue to enhance our leadership in this market, including our recent expansion into the liquid de-icing category. Our new de-icing products are being well received by customers and provide exceptional performance.\n\nThey also significantly reduced the amount of salt required. For landscape contractors, we're seeing more typical seasonal trends in retail demand. This large, growing market remains extremely attractive. In the current environment, the need for solutions that drive productivity and efficiency are especially important and our three brands, Exmark, Toro and Spartan do just that and position us well to extend our leadership in this space.\n\nMoving to the residential segment. We continue to see signs that demand patterns are normalizing as expected. This includes a more typical alignment with seasonal trends. Importantly for us, this normalization of retail demand is on top of the higher base we have built over the last few years.\n\nThis has been driven by our investments in product lineup, expanded placement and refresh brand marketing. From a broader perspective, we continue to keep an eye on overall business confidence, as well as consumer sentiment and spending. We're also monitoring inflation, monetary policy actions and the geopolitical environment and acknowledge a heightened level of macro uncertainty. We remain confident in our ability to navigate these headwinds.\n\nKey drivers of future growth include our strategic investments in alternative power, smart connected and autonomous solutions. Today, we are leveraging advances in these areas across our broad portfolio. We believe our leadership and innovation, coupled with our sharp focus on enterprisewide operational excellence, deep relationships and prudent capital allocation will drive value for all stakeholders going forward. As always, our extended team is the key to the Toro Company's success.\n\nOn that note, I would like to thank our employees for their dedication and resilience. I would also like to extend my gratitude to our channel partners, customers and shareholders for their continued support. With that, we will open up the call for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of David MacGregor of Longbow Research. Your line is open.\n\nDavid MacGregor -- Longbow Research -- Analyst\n\n Good morning, everyone, and thanks for taking the questions. I guess -- hi, Rick. On the walk behind mowers, the weakness there in the residential business, can you just give us a sense of how much of that is tied to big box inventory management, which might be more temporary in nature versus a change in retail POS, which may have more long-lasting consequences.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nYeah. Walk-power mower is just reflecting really the seasonal demand within that business. That happens to be one of the categories that was more affected by, for example, the late spring. And then, when we got into the mid-portion of the summer, it really converted to a drought situation.\n\nThat just doesn't reflect anything more than that.\n\nRenee Peterson -- Vice President, Chief Financial Officer\n\nYeah. And I think it's also important to recognize that during that same period, we saw growth in zero-turn mowers within residential, as well as within pro.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nAll right, maybe just one other positive is for our Flex-Force electric mower, we really saw continued growth in that area, and that's just -- that's part of that suite that we're very excited about.\n\nDavid MacGregor -- Longbow Research -- Analyst\n\nRight. OK. And then, turning to the professional side. You indicated a couple of times that supply chain is improving, which is encouraging.\n\nBut it seems like it's maybe still a drag in golf and also for Charles Machine Works. And so, I'm guessing -- I'm curious what's your best estimate for kind of get validates would be for those supply channels for golf and Charles Machine Works. Are we looking at 2023?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nRight. Yeah, we are very focused on the supply chain. We have incredible demand that looks like it's very solid well into 2023 and beyond in some cases. And so, our focus is on supply chain.\n\nWe have multiple meetings per day, per week focused on the top issues that we've got. And when I say that we're seeing improvement, we're seeing improvements in the bottom line results of producing product. We're also seeing these -- the top issues really go away. So we're working further down the list.\n\nWe don't have as many engine issues as we did last year at this time. But the big challenge on the more professional side of the businesses, a lot of the components are shared across multiple markets. So it's the common threads of hydraulic components, higher horsepower, power transmission elements, anything to do with -- a lot of areas having to do with electrical and electronics, so wire harnesses. We're having the same chip challenges that other markets are having as well.\n\nSo it's really -- we're working our way through the top issues further down into the list, but there are still a lot of issues that come up in different areas that we're working through. The good news is our team has really extended beyond our sourcing team to go -- or to include the design team, marketing team and working together to find solutions. So it could be alternative designs. It's not always the supplier got better.\n\nIn many cases, that's finding a way to have an equally good design with an alternative.\n\nDavid MacGregor -- Longbow Research -- Analyst\n\nGreat. Last question for me is just on pricing. Do you still expect price growth in 2023 will remain above normal?\n\nRenee Peterson -- Vice President, Chief Financial Officer\n\nYeah. As we look forward to price, the demand for our products, David, remains very solid, and it's been very dynamic over the last number of years. But we'll continue with our pricing discipline. And we price competitively, we price to market, but our competitors are also very rational from that standpoint.\n\nSo our focus is to improve and restore our margins over time. So I think you will -- can expect that as we look forward that will incorporate pricing that supports them.\n\nDavid MacGregor -- Longbow Research -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. Our next question comes from Eric Bosshard of Cleveland Research. Please go ahead.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nThanks. Two things. First of all, you used the expression a couple of times you're seeing normalized demand in residential. And I think you used the same expression as it relates to the landscape contractor demand.\n\nCan you just explain what normalized means?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nYeah. So if you think about the residential business specifically, that business has been an absolute champ through the pandemic period for the last couple of years. We grew that business -- that team grew the business from '19 to '21 by more than 50%. And obviously, we benefited from some of the pandemic effects, but underlying that was the foundational work that we did to change that business, adding channel partners, completely rebooting the product line, the marketing messaging and so forth as we've talked about in the past.\n\nSo we are at a new plateau of that business that's substantially higher than it was in 2019 and before. That being said, we're returning to the more normal drivers of the business, which would be the seasonal drivers, the timing of spring, the weather patterns. Is there enough moisture in the spring? How does that play out during the summer and fall? So it's really referring to the normal patterns that have been part of that business for a long time. And this last season actually was challenging for the residential business, starting with a late -- very late spring and then converting over to a very dry summer.\n\nSo it was a challenging time in the macro environment. But it's real -- it's returning to that normal pattern. And we grew that -- we did grow that business in Q3, so the team continues to do a great job there.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nAnd then on the landscape contractor side, is it -- it sounds like residential has done, perhaps, better than normal, and so it's returning to normal. Is that the same way to view landscape contractor? Or does normalization is something different there?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nLandscape contractor continues to be very strong. If you're talking about the mowing aspect of that, if anything, there are a certain percentage of those products that are purchased by large homeowners as well. So they have -- there's a small portion of that business that acts more like a residential type of customer. That's probably the referring.\n\nIn terms of the broader contractors' landscape creation, landscape contractors that maintain properties. That continues to be very strong from a pro perspective. And in most cases, they're behind on their purchases -- their capital purchases and are working to catch up. And that's where we're working to meet that demand.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nAnd then secondly, the sales guidance 90 days ago was 14 to 16 and today, it's more than 14. And so, it's similar but different. What's different now versus 90 days ago that takes what appears the top end of the range out of the discussion?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nIt is the residential portion that took the range to the 14 versus 14 and 16 because of the factors I just mentioned in the residential market.\n\nRenee Peterson -- Vice President, Chief Financial Officer\n\nAnd just building upon that from an EPS standpoint, we did raise our guidance in that area, and that's really the improvements we're seeing from both the supply chain and operational performance across the portfolio.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nOK. And then, one more, if I could. In terms of -- you mentioned, Rick, as it relates to landscape contractor being behind that purchase. As you mentioned earlier, I think golf demand is strong into, if not through '23.\n\nCan you frame or dimensionalize at all backlog or channel inventories as you start to think about -- as we start to think about 2023, would either channel inventories or backlog look like relative to history or what that -- how do you think about that as it relates to '23?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nSure. I can comment on both of those. First of all, field inventory, in general, for Toro Company is significantly lower than we would like to see. There's a few exceptions.\n\nWe talked about residential and the market during the summer and the late spring but there are some categories of residential that have started to return to more normal levels of inventory in the field across virtually all of our pro categories and markets we do not have enough field inventory to be at normal levels. And that's been something we've been working very closely with our channel partners to try to help the end customers do the work that they need to do in a constrained supply environment. So we will work. As the supply chain gets better, obviously, we fulfill the end customer demand, and then we will work to bring back field inventories to a more normal level.\n\nJust speaking specifically to the backlog, we have -- the demand continues to be very strong, and the backlog position is higher than it was when we ended our fiscal year. We've made some progress just within the last couple of months on bringing it down from the peak, but it continues to be very strong and primarily coming from those areas we talked about previously, the underground, specialty construction business, golf, rental, landscape creation, also very healthy position from a professional snow and ice management business. They all -- there's a significant need for products for professional customers at this point, and we feel very confident in that demand.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nThank you. Our next question comes from Timothy Wojs of Baird. Your line is open.\n\nTimothy Wojs -- Robert W. Baird and Company -- Analyst\n\nYeah. Hey, everybody. Good morning. Maybe just if you think about seasonality, I think just given kind of what you've seen from kind of backlog fulfillment and things, you're kind of tracking above in the back half of the year, what would kind of be normal seasonality? I mean when would you expect, just given where you are in backlog and field inventories and things to start to see more normal seasonality for the business kind of heading into fiscal '23?\n\nRenee Peterson -- Vice President, Chief Financial Officer\n\nYeah. Maybe I can start, Rick, and you can add on. I think, Tim, we expect to see probably the residential business being more normal from a seasonal perspective. But the professional business, as Rick just said, is really constrained by supply chain.\n\nSo we think that's going to take a little bit longer for us to return to a more normal cadence. It's difficult to predict exactly when that will occur. But for some of our businesses such as golf and grounds and underground construction, we think that's going to take a little bit longer. For some businesses, we're seeing a little more recovery sooner such as a landscape contractor.\n\nBut we do think the professional business will continue to be supply constrained going into next year and some of it for a good portion of next year as well.\n\nRick Olson -- Chairman and Chief Executive Officer\n\nOK and just one additional point. If you think about the newer parts of our business, the Ditch Witch business, special construction, underground, snow, they have different seasonal patterns and those are new factors, especially from 2019 on. In the case of the underground business, it's not really very seasonal. It's not really driven by the shift in seasons for example.\n\nSo it provides more consistent base that takes some of the variability out long term.\n\nTimothy Wojs -- Robert W. Baird and Company -- Analyst\n\nOK. OK. That's helpful. And then, I guess as you maybe think about kind of next year, I mean, from a high-level perspective, I mean relative to kind of 25% normalized incremental margin? I mean are there any kind of high-level puts and takes that we should kind of consider as we think about next year?\n\nRenee Peterson -- Vice President, Chief Financial Officer\n\nWe think that we'll still see an inflationary environment next year. We do think that we're seeing some -- the rate of inflation has begun to decline. Hopefully, that continues, as well as some of the commodities we've seen kind of coming off their peaks from a future standpoint. So we expect to see that.\n\nWe'll continue to focus on our supply chain. And as Rick said, really working to try to improve that. Our end markets are very healthy. All of our customers are in a great position.\n\nAnd we are seeing, as Rick just mentioned, the strength of our portfolio and the broad portfolio really helping us as we look at diversification. So we feel pretty positive about next year as we go into it and do think it will be a strong year.\n\nTimothy Wojs -- Robert W. Baird and Company -- Analyst\n\nOK, OK. Good. And then, just the last one, just on price and volume. Is there any way to kind of break out kind of ballpark what price and unit volumes are in the quarter?\n\nRenee Peterson -- Vice President, Chief Financial Officer\n\nYeah. What we would look at is price was a -- price realization was a major driver, Tim, to our growth, as well as the Intimidator Group acquisition, factoring that in and also especially the strength of zero turns, we saw positive volume in that area as well. We are realizing the impact of the multiple price actions that we took in response to the inflation that we saw last year. So again, that's the driver behind price.\n\nAnd the professional business, as we stated, is still supply constrained. So we -- if we could build more from a professional standpoint, we would ship more. And we did see growth in key product categories from a volume standpoint. So demand overall solid, but we're seeing more of an impact of price versus volume and overall for the company.\n\nTimothy Wojs -- Robert W. Baird and Company -- Analyst\n\nOK, good. Thanks for the time and and good luck on the rest of the year.\n\nOperator\n\nThank you. Our next question comes from Tom Hayes of Northcoast Research. Your line is open.\n\nTom Hayes -- Northcoast Research -- Analyst\n\nHey, good morning, everyone. Appreciate the time and thanks for taking my questions. Maybe, Renee, kind of -- I know you guys on the margin front, called out the impact from the Intimidator Group. I was just wondering when you kind of expect that negative headwind from that acquisition to abate and move toward a more normalized cadence, if you will.\n\nRenee Peterson -- Vice President, Chief Financial Officer\n\nYeah. We are working on our acquisition synergies and really seeing -- we're on track from an integration standpoint and seeing the benefits of those actions. We would expect -- we acquired Intimidator Group, the acquisition was recorded in Q2 and going forward -- I mean so certainly, there'll be some impact from that first year just from an absolute standpoint. But we are making margin improvements within the Intimidator Group and do expect them to continue to improve going forward.\n\nAnd it's -- the zero-turn market is a really fast-growing market. So we're also seeing the benefit, not just with an Intimidator Group, but across the whole landscape contractor portfolio. What we're also really focused on is how do we leverage our technology with Intimidator Group, but also across our other brands as well.\n\nTom Hayes -- Northcoast Research -- Analyst\n\nOK. Great. And then, maybe, Rick, obviously, there's large portions of the U.S. have been and likely will continue to be impacted by drought conditions that really don't seem to be letting up.\n\nI was just wondering if you've seen any change in the demand for any of your irrigation products either for the residential or on the professional side?\n\nRick Olson -- Chairman and Chief Executive Officer\n\nI would really characterize them as normal demand variation that happens in these kinds of periods, which we are accustomed to in our business. So those -- it can actually be good initially for irrigation business. And at some point, where full water restrictions are put in place, then it starts to negatively affect it. But we're seeing pretty normal response of what you would expect in the circumstances.\n\nWe've had great growth across the areas that would be affected over the last couple of years. And so, nothing unusual, but what you would expect in the drought conditions.\n\nTom Hayes -- Northcoast Research -- Analyst\n\nAll right. Thanks for taking the time today.\n\nOperator\n\nThank you. This concludes the question-and-answer session. Ms. Kerekes, please proceed to closing remarks.\n\nJulie Kerekes -- Treasurer and Senior Managing Director of Global Tax and Investor Relations\n\nThank you, Latif, and thank you all for your questions and interest in The Toro Company. We look forward to talking with everyone again in December to discuss our fourth quarter and full year results for fiscal 2022.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJulie Kerekes -- Treasurer and Senior Managing Director of Global Tax and Investor Relations\n\nRick Olson -- Chairman and Chief Executive Officer\n\nRenee Peterson -- Vice President, Chief Financial Officer\n\nDavid MacGregor -- Longbow Research -- Analyst\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nTimothy Wojs -- Robert W. Baird and Company -- Analyst\n\nTom Hayes -- Northcoast Research -- Analyst\n\nMore TTC analysis\n\nAll earnings call transcripts"
}