{
  "companyName": "Madison Square Garden Entertainment Corp.",
  "companyTicker": "MSGE",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/19/madison-square-garden-entertainment-corp-msge-q4-2/",
  "content": "Madison Square Garden Entertainment Corp. (MSGE 0.45%)\nQ4 2022 Earnings Call\nAug 19, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning. Thank you for standing by, and welcome to the Madison Square Garden Entertainment Corp. fiscal 2022 fourth quarter and year-end earnings conference call. [Operator instructions] I would now like to turn the call over to Ari Danes, senior vice president, investor relations, financial communications, and treasury.\n\nPlease go ahead.\n\nAri Danes -- Senior Vice President, Investor Relations\n\nThank you. Good morning, and welcome to MSG Entertainment's fiscal 2022 fourth quarter and year-end earnings conference call. David Byrnes, our EVP and chief financial officer, will begin today's call with a discussion of the potential spin-off transaction, as well as an update on the company's entertainment and Tao Group segments. This will be followed by an update from Andrea Greenberg, president and CEO of MSG Networks.\n\nDavid will then conclude with a review of our financial results for the period. After our prepared remarks, we will open up the call for questions. If you do not have a copy of today's earnings release, it is available in the Investors section of our corporate website. Please take note of the following.\n\nToday's discussion may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Any such forward-looking statements are not guarantees of future performance or results and involve risks and uncertainties that could cause actual results to differ materially from those in the forward-looking statements. Please refer to the company's filings with the SEC for a discussion of risks and uncertainties. The company disclaims any obligation to update any forward-looking statements that may be discussed during this call.\n\nOn Pages 5 and 6 of today's earnings release, we provide consolidated statements of operations and a reconciliation of operating income to adjusted operating income, or AOI, a non-GAAP financial measure. And with that, I will now turn the call over to David.\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nThank you, Ari, and good morning, everyone. This past fiscal year demonstrated the resiliency of our business and the robust demand of our portfolio of live experiences, while we continue to make significant progress on our company's next chapter MSG Sphere. And as we look forward, we remain focused on ensuring that our company is well-positioned to drive ongoing growth and value creation for our shareholders. With this objective in mind, yesterday, we announced that our board of directors approved the exploration of a potential spin-off that would separate our businesses into two publicly traded companies.\n\nThe first company would include a valuable portfolio of assets highlighted by Madison Square Garden, the Christmas Spectacular production and MSG Networks. This company is expected to generate substantial free cash flow and benefit from the attractive growth profile of the live entertainment business. The second company would be comprised of MSG Sphere and Tao Group, two businesses with global brands and significant long-term growth opportunities. If we proceed with the transaction, we expect that MSG Entertainment shareholders would receive a tax-free pro rata distribution equivalent in aggregate to an approximately two-thirds economic interest in the live entertainment and media company.\n\nThe remaining one-third stake would be retained by MSG Entertainment. These retained shares would be available for use in a tax-free exchange for MSGE common stock and/or to raise capital for general corporate purposes, with any remaining retained shares for use in a follow-on pro rata spin-off to MSG Entertainment shareholders. At this time, we have not set a timetable for completion of this potential transaction which would be subject to various conditions. We believe this separation would provide both companies with enhanced flexibility to pursue their own distinct business and capital allocation strategies.\n\nWe also expect the spin-off would provide investors with greater visibility into each company's businesses and growth prospects. This includes the distinct opportunity associated with MSG Sphere, which will begin in Las Vegas. This past year was highlighted by a number of important milestones related to the construction of MSG Sphere at The Venetian. In May, we topped out the venue Steel Exosphere marking the completion of primary structural work on the venue.\n\nAnd following the topping out, the team began work on installing the fully programmable LED exterior, which will be the largest LED screen on Earth, offering a one-of-a-kind canvas on the Las Vegas skyline for partners, artists, and brands. We have conducted an extensive review of project costs and as a result, have adjusted our construction estimate for the venue to approximately $2 billion, with the increase relative to our prior estimate of $1.865 billion, largely reflecting the impact of inflation and global supply chain pressures. We continue to aggressively manage all aspects of the project and are pleased with our progress to date. Substantial portions of the work are now behind us, and we plan to spend this fiscal year finishing up construction on the venue as we remain on target to open in the second half of calendar '23.\n\nWork this fiscal year will include completing the LED exterior, the build-out of the interior spaces and installation of the immersive technology that will enable multisensory experiences at an unparalleled scale. To deliver those unique experiences, we have continued to make progress on our content initiatives. In May, we unveiled our MSG Sphere Studios facility in Burbank, which includes a quarter scale, full resolution prototype of the Las Vegas screen, as well as demonstrations of Sphere's capabilities, including sphere immersive sound and the Exosphere. Our team is already hard at work with artists and partners creating and testing content and experiences for Sphere.\n\nAnd tonight, we will debut Sphere immersive sound at the Beacon Theatre, with the first of two acoustic performances by Trey Anastasio. This groundbreaking new sound system, which was developed and is being further customized and scaled for MSG Sphere in Las Vegas will be the world's most advanced concert audio system. We look forward to providing more updates on MSG Sphere as we get closer to the opening in Las Vegas. With that, I'd now like to go through some operational highlights from this past year, starting with our entertainment segment.\n\nAfter the pandemic shut down our business for nearly all of fiscal '21, we were pleased to see our venues busy again this year as we hosted a wide variety of marquee entertainment and sporting events. This included the Christmas Spectacular, which returned to Radio City Music Hall this past holiday season for its 88th year. Despite concert touring only beginning to ramp up this past fall and the Omicron variant temporarily slowing our momentum in the winter, we're proud to have hosted over 4 million guests at more than 700 events in fiscal '22. This reflected the demand we saw from artists and promoters, as well as from consumers, to return to our venues, which was demonstrated in strong ticket sales, including numerous sold-out events and in-venue per cap spending, which was above pre-pandemic levels by a double-digit percentage this past year.\n\nWe also saw the strong trends continued through the end of the fiscal year as we hosted more concerts in our fourth quarter as compared to our third quarter with the number of concert tickets sold exceeding the pre-pandemic fourth quarter of fiscal 2019. Looking ahead, fiscal '23 will represent our first full year of events at our venues since fiscal '19. Our calendar continues to fill up, and we're in the midst of a busy first quarter, highlighted by a number of multi-night runs by some of the world's most popular artists, including a 15-night Harry Styles residency which puts the Garden on track to host a record number of concerts for our first quarter. We are also looking to build on the momentum we saw in marketing partnerships this past year as our partners sought to reengage with our assets and brands.\n\nThis was highlighted by the renewal of several signature partnerships, including Anheuser-Busch and Lexus, as well as a number of new multiyear agreements, most notably in the mobile sports betting space with BetMGM, Caesars Sportsbook, and DraftKings. Looking ahead to fiscal '23, we have meaningful visibility into our sponsorship revenue base and are currently on a path to deliver sponsorship revenue that is well ahead of fiscal '19, our last fiscal year before the pandemic. The same holds true for our premium hospitality business, which also swiftly rebounded this past year. We now head into fiscal '23 with the majority of our suites under multiyear agreements, along with growing interest from companies who are ready to make a full return to corporate entertaining.\n\nTurning to Tao Group, which delivered exceptional financial results for the year as its business also benefited from consumers' desire to gather again. In fact, Tao ended the year on a high note with quarterly revenue in its fourth quarter at their highest levels since capacity restrictions were broadly lifted last summer. This was led by Las Vegas, which saw a pool and beach venues open for the season, including the grand reopening of a completely renovated TAO Beach at the start of April. And like our core entertainment business, guests continue to spend as average check sizes exceeded pre-pandemic levels by double digits in the quarter.\n\nLooking ahead, Tao has a strong pipeline of new venues planned for fiscal '23, including multiple branded locations at a new Moxy Hotel on the Lower East side in New York, a waterfront venue planned for Miami and Stanton Social Prime at Caesars Palace in Las Vegas. So as we reflect on both the quarter and year that we've had, we are proud of the role our company has played in the return of live entertainment. Looking ahead, we are excited for what fiscal '23 will bring, including putting us closer to the opening of MSG Sphere in Las Vegas as we also explore a potential separation of our businesses, which we are confident will position us well to drive long-term shareholder value. With that, I will now turn the call over to Andrea.\n\nAndrea Greenberg -- President and Chief Executive Officer, MSG Networks\n\nThank you, David, and good morning. After the challenges of the last few years, we were delighted during fiscal 2022 to welcome back full regular season schedule for our five professional sports teams and even more delighted to continue that momentum with extensive post-season coverage of the Rangers, including pre- and post-game programming for every Rangers game in all three playoff rounds. Our Rangers playoff coverage was well received by our viewers with game ratings in the first playoff round, more than double the team's regular season average and MSG Go viewership levels for the Rangers at all-time highs. In addition to Rangers' playoffs during the quarter, we also showcased a diverse slate of other programming from live coverage of the early rounds of the French Open, to the first ever major darts competition at the Madison Square Garden Complex.\n\nTurning to our financial performance for the fiscal year, while affiliate revenue included the impact of our nonrenewal with Comcast and a continued decline in traditional subscribers, we delivered record overall advertising revenue for the full fiscal year. Our results reflected robust increases in per game advertising revenues for all of our teams, including double-digit percentage increases for the Knicks and Rangers, driven by both higher rates and sell-through. We saw significant demand across many advertising categories for both traditional and nontraditional inventory, including from mobile sports betting, our single largest advertising category for fiscal '22. This momentum continued into the playoff with strong per game sales for all seven first-round Rangers playoff games against the Pittsburgh Penguins.\n\nAnd while it is still early in fiscal '23, we expect to see continued strength in our advertising business based on our multiyear deals, strong returning business and the unique value of live sports. Similar to sponsorship revenue at the entertainment segment, sports betting will again play an important role as we will see the run-rate impact in our advertising revenue from our integrated partnerships with BetMGM, Caesars Sportsbook, and DraftKings, as well as with our other media partners, FanDuel and Bet365. As a reminder, this past year, we launched an exciting block of sports betting programming, and we will continue to solidify and where appropriate, expand our coverage of this and other types of content as we seek to engage our existing audiences and attract new viewers. This includes our recent multiyear renewal as the TV partner of the New York Giants, live airings of multiple Gotham FC matches and expanded offerings of live sports and studio-based content.\n\nSo in this evolving media landscape, we continue to innovate as we stay at the forefront of regional sports television. This includes not only the introduction of new programming but new ways of distributing our content and our ongoing progress in developing a direct-to-consumer offering, which we now anticipate will launch during the second half of the 2022-'23 NBA and NHL seasons. To that end, we have recently renewed our digital rights agreement with the NHL for multiple years, and we are confident that we will soon renew our agreement with the NBA as we have many times in the past in the ordinary course. We will provide more details on our D2C offering as we get closer to our launch date.\n\nWith that, I will now turn the call back over to David.\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nThank you, Andrea. Let's now review our financial results for our fiscal fourth quarter. On a total company basis, we generated revenues of $453.5 million and adjusted operating income of $0.7 million. The entertainment segment generated $179 million in revenues and an AOI loss of $51.3 million.\n\nThe wider AOI loss relative to our fiscal third quarter primarily reflects the seasonality of our business, including lower revenues related to our Arena license agreements, as well as lower ad sales and sponsorship commissions, primarily due to the Knicks and Rangers regular seasons ending in April. SG&A expenses also increased sequentially, which includes the impact of higher MSG Sphere costs as we prepare for the opening in Las Vegas, as well as the timing of certain corporate expenses. This was partially offset by the ongoing positive momentum in our bookings business during the quarter. Turning to MSG Networks.\n\nThe segment generated $139.1 million in revenues and $35.4 million in AOI. The decrease in revenues on a year-over-year basis reflected lower affiliate revenue, as well as lower advertising revenues due to fewer live professional sports telecasts as compared to the prior-year period as a result of the timing of the NBA and NHL 2021 seasons. The decrease in AOI versus the prior-year period also reflects higher direct operating expenses as MSG Networks has returned to normalized levels of programming costs, including rights fees with full NBA and NHL regular season telecast schedules this past year. Finally, Tao Group generated revenues of $139.8 million and adjusted operating income of $17 million.\n\nResults were led by the strong performance of the Las Vegas market, while AOI also reflected higher labor and venue entertainment expenses, as well as the impact of inflation on food and beverage costs, which the team has been working hard to mitigate. While we are mindful of the current macroeconomic environment, we are currently seeing many bright spots across our business as we look ahead to fiscal 2023. Our traditional entertainment business is poised to deliver substantial revenue growth versus fiscal 2022, as well as relative to fiscal 2019. We expect this to reflect a full 12 months of event activity at our venues with continued strength in consumer demand, the return of the Christmas Spectacular for 181 shows for the 2022 holiday season versus 101 shows this past year and ongoing momentum across marketing partnerships and premium hospitality.\n\nFrom an AOI perspective, we expect the results to reflect the significant profitability of our traditional entertainment business, along with higher MSG Sphere costs, including the impact of additional headcount as we get closer to the planned opening of the Las Vegas venue. At Tao, we anticipate strong ongoing demand, along with the benefit of over 10 new branded locations during the year. We also expect Tao's results to reflect the continued return of staffing to normalized levels, in addition to ongoing effects of inflation. And lastly, the year-over-year comparability of MSG Networks results will be impacted for an additional quarter as a result of the nonrenewal with Comcast.\n\nHowever, we anticipate continued positive momentum for advertising revenues. Turning to our balance sheet. In June, we enhanced our financial flexibility by completing two significant refinancings. First, Tao Group increased its credit facilities from a combined $50 million to $135 million, with a portion of the proceeds used to repay the subordinated loan owed to MSG Entertainment.\n\nIn addition, the outstanding $642 million term loan related to our traditional live entertainment business was refinanced with a new $650 million term loan, which included adding a $100 million revolver lowering the minimum liquidity requirement and reducing borrowing costs. As of June 30, we had approximately $829 million of cash on hand and our debt balance was approximately $1.76 billion, which reflects these recent refinancings. With respect to MSG Sphere, our project to-date construction costs through June 30 were approximately $1.53 billion, which includes approximately $190 million of accrued costs that were not paid as of June 30 and is net of the $65 million received from The Venetian. With that, I will now turn the call back over to Ari.\n\nAri Danes -- Senior Vice President, Investor Relations\n\nThank you, David. Operator, can we open up the call for questions, please?\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Brandon Ross from LightShed Partners. Your line is open.\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nThanks for taking the questions. Ari, I think I need to endorse you on LinkedIn for Form 10 writing at this point. Quite a few of the --\n\nAri Danes -- Senior Vice President, Investor Relations\n\nThanks, Brandon. I appreciate that.\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nAnyway, take a little deeper on the rationale behind the spin and the structure there. First, you completed the purchase of MSGN what a year ago now. Why is now the right time for this transaction? And then did you look at other structures to highlight the value of the asset? Just to me, intellectually, it feels like the simplest way to do that would be just to respin out MSGN. Why wasn't that not the solution you employed here? And then I have a follow-up.\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nSure. Thanks, Brandon. Look, as you know, MSG companies have a long history of pursuing strategic transactions like this with the goal of creating long-term value for our shareholders. Over the years, that's included spin-offs, acquisitions, asset sales, investments in core assets like the Garden.\n\nAnd as you mentioned, we acquired MSG Networks last year. And since that time, that transaction has provided a number of important benefits for us, including significant cash flow, which we've directed toward our Sphere initiative. And it will continue to do that until this proposed separation is completed, which could take some time and assuming we move forward with the transaction. Also, timing-wise, we now have line of sight to the end of the construction in Las Vegas, which is -- it's less than 12 months away at this point.\n\nAnd as a result, we've been exploring the optimal long-term corporate structures for our company, and we believe this proposed transaction would position both of these companies for continued success. For example, the separation, it best aligns the areas of our business based on their growth profiles and on their cash flow profiles. And both the traditional live entertainment and MSG Networks businesses have a long-term track record and are well understood by our investors. We also expect these businesses to continue to generate substantial AOI and free cash flow.\n\nAnd the remaining company which will have Sphere and Tao, our businesses with global brands and significant long-term growth opportunities, which we believe will appeal to higher growth-oriented investor base. So the transaction would provide each company with enhanced flexibility to pursue its own business and capital allocation strategies while also offering investors greater visibility into each company's businesses and greater investment choice. So we're excited at this point that we've taken this first step, and we look forward to sharing more as we make progress.\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nOK. And then how should we think about the future growth outside Las Vegas for Sphere Co, or MSGLD, whatever you're going to call it? You're leaving all the cash there and you have the retained interest. How does that play into your future growth plans? And should we expect additional capex-heavy projects at that company after the Sphere is completed?\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nSure. OK. Got it. First, we've talked about before how bullish we are on the opportunity around Sphere.\n\nAnd our expectation is that our Las Vegas venue will generate substantial revenue in AOI once it opens. And that success will pave the way for us to expand MSG Sphere to additional markets. You've heard us also discuss before that these future venues for them, we would plan to pursue capital-light opportunities, license models and managed venue models, for example, among others. And with that backdrop, our priority is to ensure that this -- our company has a strong balance sheet and the appropriate flexibility to execute on its growth strategy and be able to capitalize on opportunities if and when they arise.\n\nWith regard to Las Vegas, we're confident that we have sufficient liquidity at this point to complete the construction of the Sphere at The Venetian. The remaining capex for that will be funded from cash on hand and from cash flow from operations. We expect the majority of our cash on hand at the time of the spin-off to stay behind with the Sphere-Tao company which, again, we believe is prudent given that it's in its early stages, and we'd like to maintain maximum flexibility to drive growth and value creation. It's also in recognition of the fact that the live or the live entertainment and media company will be generating substantial free cash flow right from the start and has less immediate capital needs.\n\nAnd then the way to think about the retained interest is that it will provide the Sphere-Tao company with optionality and financial and strategic flexibility, as those shares would -- they will be available in a tax-free exchange offer as a possibility and/or monetize to raise capital for general corporate purposes, if needed, with any of the remaining retained shares for use in a follow-on pro rata spinoff to shareholders. I'd also add that we consistently evaluate our capital structure. That now includes what the optimal capital structures would be for the Sphere-Tao company and the live entertainment media company. And as you'd expect, we would always consider various financing options if they make strategic and financial sense for us in the future.\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nGot it. Thank you very much.\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nThanks, Brandon.\n\nOperator\n\nYour next question comes from the line of Farshid Javar from Jefferies. Your line is open.\n\nFarshid Javar -- Jefferies -- Analyst\n\nThanks. I guess with regard to the Sphere budget increase, can you talk more about like what was behind that? And how do we know that that's sort of it in terms of increases?\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nSure. First, we're pleased with where we are on our progress to date on the Sphere in Vegas. I was just out there visiting the sites. The venue really looks fantastic, and we're really excited about it.\n\nTo answer your question, while we are aggressively managing every aspect of the project, we're not immune to what's happening on the macro level. Like any other big project of this size, we've been dealing with impacts of inflation, as well as global supply chain pressures across various areas of the project. An important reminder here is we serve as a construction manager. So we have numerous packages of work that we've competitively bid to subcontractors, and each of those costs are being managed on a time and materials basis.\n\nSo as the subcontractors complete all those packages and areas of the construction, which could take 12, 18, 24 months and bill us for those costs as time goes on. And again, many of these were bid out months ago. We're seeing these actual costs come in as the actual materials get delivered and the actual work is getting done. So as time has gone on, those costs have gone up over, again, various work streams, primarily due to global inflation and supply chain pressure.\n\nSo after a review of our costs and where we are, we adjusted our estimate to approximately $2 billion. And at this stage in the project, substantial portions of the work are behind us, including topping out the venue Steel Exosphere, which we did in May. That was -- that completed most of the primary structural work. And we have less than 12 months to go on the construction at this point.\n\nRemaining work for this fiscal year includes the LED exterior, the build-out of the interior spaces and the continued installation of the immersive technology in the Sphere. So as we progress, the unknowns are getting smaller and smaller with each day, and we're really getting in striking distance now of completion. So we're proud of the progress we've made, and we're looking forward to opening the venue in the second half of '23.\n\nFarshid Javar -- Jefferies -- Analyst\n\nAppreciate the color. And then just one last question. You mentioned on the call, strong consumer demand, per cap spending higher. Just qualitatively speaking, any expectations for this year and maybe indications in the first quarter?\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nWe were -- I think we've been pretty clear on that. Our business has been strong. Bookings have been strong. Our ticket sales have remained strong.\n\nWe have a 15-night Perry style show kicking off tomorrow, which we're all really excited about. And the ticket demand has been great. As you mentioned, per caps' food and beverage, merchandise, sales, all with positive momentum at this point in time. So nothing new to share there, other than what we've already mentioned.\n\nFarshid Javar -- Jefferies -- Analyst\n\nAll right. Appreciate it. Thank you.\n\nOperator\n\nYour next question comes from the line of David Karnovsky from J.P. Morgan. Your line is open.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. First here, wondering if you can quantify at all expected launch or creative content costs in advance of the opening. And then when do you think you'd be in a position to update investors more specifically on the expected financial profile of the venue?\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nSure. As we've noted in the past several quarters, we have seen increased operating costs related to the Sphere, and that primarily relates to content development, including headcount as we're building out that team. And then as we look to the year ahead, we do expect headcount related to the Sphere to increase, both for continued content development and to make sure that venues appropriately staffed ahead of the opening, which again, we're getting into striking distance of that. So that will include staffing up areas like venue management, security, food and beverage teams, merchandise teams, everything you think about just being ready to have the venue open in the second half of '23.\n\nWe'll also leverage a lot of the expertise in the infrastructure that we currently have in place at our company. And with that said, we expect to generate substantial levels of revenue in AOI and at attractive margins once we open in Vegas, and that is inclusive of the overhead that we're currently carrying. With your question on sharing more and the expected financial profile, I'll just reiterate. We -- as we've said, we have less than 12 months to go on construction.\n\nAnd now that we're within that time frame, we should soon be in a position to start sharing positive news on sponsorships, corporate partnerships, beginning to announce first artist to play the Sphere and so on. So we do continually discuss timing. And while we don't have anything more to say today, we look forward to sharing more in the months ahead and as we get closer to the opening.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nOK. And then one for Andrea. Just on the DTC product. I think the time line there was pushed out slightly.\n\nI don't know if you can comment on that. Is that about getting the tech right or something to do with rights or conversations with your existing distribution partners? Any color would be helpful.\n\nAndrea Greenberg -- President and Chief Executive Officer, MSG Networks\n\nSure. Well, let me say that since we last spoke, the design and the build of our DTC product has gotten underway. So we're in the process of building, and we're making good progress. But we really do want to ensure that we take the appropriate time to launch an exceptional product when that meets our internal expectations and the expectations of our potential DTC customers.\n\nSo this is really about getting the build and launch right. As we mentioned, we are -- we've recently reached a multiyear digital rights agreement with the NHL. We soon expect to reach one with the NBA as we've done in the ordinary course. So all on track, it's really just a result of wanting to get the product rights.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nThanks.\n\nOperator\n\nYour next question comes from the line of Paul Golding from Macquarie Capital. Your line is open.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nThanks so much. So I just wanted to ask, I guess, as we get more color on Sphere and we get closer to the finish line from an operational perspective and maybe as a leading indicator, I wanted to ask about the Burbank Studio operation, how that's been faring? Any wins to note? And then to ask the same question a different way as others, if that -- as we get closers and forming any kind of ROI discussion or estimates for the venue? I know in the past, there's been comparison to what's been done with the Garden facelift and that ROI. So just any color on that would be great. Thanks.\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nSure. Thanks, Paul. As we've said, the Sphere is going to introduce an entirely new entertainment medium. It will be the first large-scale venue to deliver immersive experiences for up to 20,000 people at once, including multisensory technologies.\n\nAnd this includes original transactions -- attractions, which would be able to run multiple times a day, year round and really drive the utilization of the venue, as well as concert residencies, which would help build our base of events. As I've mentioned earlier, to create and produce the content, including the attractions, we unveiled our new MSG Sphere studios in Burbank, as you know, and we're hard at work with creators, artists, technologists and visionaries to bring the future of entertainment and immersive experiences to life at Sphere. The studio itself known as big dome, features an ultra-high-resolution LED interior screen. It's a quarter scale of the full resolution MSG Sphere display plan that's going to be in Vegas.\n\nAnd it also includes demonstrations of the Sphere Immersive sound, our Exosphere and other technology tools that allow us to create these experiences at a scale that's never imagined before, and you'll see in the Sphere in Las Vegas. We're not providing specifics on the costs associated with Burbank necessarily. What I'll say is that an important added benefit to the studio is it will enable us to keep higher utilization at the Las Vegas venue as we'll be able to fully test content without having to pause our attractions that are running in Las Vegas. And we're really energized by the possibilities, and we expect to have exciting news to share with you as we advance toward the venues opening and share more about our content.\n\nAnd on your ROI question, again, these are the things that we've said before. We are confident that the Sphere is going to create significant long-term value for shareholders, the immersive experiences, including the attractions, the performances from our concerts and residencies and corporate events and expos. The Sphere is all designed to host eSports and select sporting events, such as MMA and boxing, which, as you know, is in our wheelhouse. It will also provide innovative ways for companies to showcase their brands, including the Exosphere, which will be the world's largest LED screen, and we expect will drive substantial sponsorship revenue for us.\n\nSphere will also have extensive premium hospitality and club space, and that Tao's experience will provide tremendous value and create additional revenue opportunities for us there. At this point, we're excited from the excitement we're seeing from potential partners, including the filmmakers we're working with and the global artists for the potential residencies and concerts, promoters of marquee events and corporate partners. And we have Formula One that will be part of the inaugural Las Vegas Grand Prix toward the end of calendar '23. And we talked about the two Trey Anastasio shows at Beacon Theatre featuring the debut of the Sphere immersive sound that we've been talking about.\n\nThis is another great example of the interest we're seeing in artists and partners wanting to engage with MSG Sphere. So we remain confident that the opportunities created with MSG Sphere will translate into substantial levels of revenue, and AOI and we look forward to providing more details on that as we get closer to the launch in the second half of next year.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nThanks. And just --\n\nAri Danes -- Senior Vice President, Investor Relations\n\nOperator, we have time for one last caller.\n\nOperator\n\nYour last question comes from the line of Ben Swinburne from Morgan Stanley. Your line is open.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nGood morning. Thanks for squeezing me in. Just David, on Sphere, I don't know if you're willing to share the opex for fiscal '22, but I take a stab. And then on the content development costs, are those material? And are those capitalized or expense? Just wondering if that's something we should be thinking about as we think about the two different companies, if you move forward with the spin? And then I was just wondering if, Andrea, is there anything you've learned or seen from the RSN D2C rollouts with Nesson or Bally that you think is worth highlighting good, bad or otherwise is informing your go-forward? and any update on your ability to work with your MVPD partners and going to market with your streaming service, which we really haven't seen from those other examples? Thank you, both.\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nSure, Ben. It's nice that you take a stab, but we're not going to get into the specific opex on Sphere at this point in time. And then on your question on content costs. Also, I'm not going to get into specifics.\n\nWe're making progress and moving ahead. But at this point in time, it's fluid, and we're just not prepared to get into specific content cost at this time. We've said that content will allow us to drive Sphere to be the most highly utilized venue in our portfolio and the original attraction that we're developing for the Sphere upon opening will play a significant part in that. We believe Vegas with all the visitors, 40 million visitors a year is really the perfect debut market for these attractions.\n\nAnd we'll have the ability to play the attraction multiple times a day, year round based on demand. We're energized by the excitement we're seeing, as I've mentioned from potential partners, including artists and filmmakers, which are partnering with us to create original content for Sphere.\n\nAndrea Greenberg -- President and Chief Executive Officer, MSG Networks\n\nAnd I think, Ben, just on the D2C front, we're in the process of building a product. We're certainly looking at what others are doing in this space, not just RSN for best practices and taking them into account. We'll have more to report in the upcoming months. And as to our affiliate partners, I think we've said in the past that we continue to be very mindful of our traditional linear business.\n\nWe have extremely important partnerships with our MVPD distributors, and we value those relationships and what we derive from them. So as we work through this D2C offering, we're certainly taking that into consideration, and we'll have more to report in the future.\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nAnd this ends our question-and-answer session. Mr. Ari Danes, I turn the call back over to you for some closing comments.\n\nAri Danes -- Senior Vice President, Investor Relations\n\nThank you all for joining us. We'll speak with you on our next earnings call. Have a good day.\n\nAndrea Greenberg -- President and Chief Executive Officer, MSG Networks\n\nGoodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAri Danes -- Senior Vice President, Investor Relations\n\nDavid Byrnes -- Executive Vice President and Chief Financial Officer\n\nAndrea Greenberg -- President and Chief Executive Officer, MSG Networks\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nFarshid Javar -- Jefferies -- Analyst\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nPaul Golding -- Macquarie Group -- Analyst\n\nBen Swinburne -- Morgan Stanley -- Analyst\n\nMore MSGE analysis\n\nAll earnings call transcripts"
}