{
  "companyName": "DOW",
  "companyTicker": "DOW",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/dow-dow-q3-2022-earnings-call-transcript/",
  "content": "DOW (DOW -0.51%)\nQ3 2022 Earnings Call\nOct 20, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and welcome to Dow's third quarter 22 earnings call. Please note this call is being recorded, and for the duration of the call, your lines will be in listen mode only. [Operator instructions] I will now hand over to Pankaj Gupta, investor relations vice president.\n\nPankaj Gupta -- Vice President, Investor Relations\n\nGood morning. Thank you for joining Dow's third-quarter earnings call. This call is available via webcast and we have prepared slides to supplement our comments today. They are posted on the Investor Relations section of Dow's website and through the link to our webcast.\n\nI am Pankaj Gupta, Dow's Investor Relations vice president. And joining me today on the call are Jim Fitterling, Dow's chairman and chief executive officer; and Howard Ungerleider, president and chief financial officer. Please read the forward-looking statement disclaimer contained in the earnings news release and slides. During our call, we will make forward-looking statements regarding our expectations or predictions about the future.\n\nBecause these statements are based on current assumptions and factors that involve risks and uncertainties, our actual performance and results may differ materially from our forward-looking statements. Dow's forms 10-Q and 10-K include detailed discussions of principal risks and uncertainties which may cause those differences. Unless otherwise specified all financials were applicable exclude significant items, we will also refer to non-GAAP measures. In a conciliation of the most directly comparable GAAP financial measure, and other associated disclosures is contained in the Dow earnings release in the slides to supplement our comments today, as well as on the Dow website.\n\nOn Slide 2 you will see our agenda for the call. Jim will begin by reviewing our third-quarter results and operating segment performance. Howard will then share our outlook and modeling guidance. And then to close, Jim will discuss how our actions and long-term strategic priorities enable us to deliver value growth in a dynamic environment.\n\nFollowing that, we will take your questions. Now let me turn the call over to Jim.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nThank you, Pankaj. Beginning on Slide 3. In the third quarter, team Dow continued to proactively navigate higher energy costs and geopolitical uncertainties that are impacting consumer demand, particularly in Europe. As macroeconomic conditions began to erode in the quarter, we responded quickly by implementing a set of actions to prioritize resources toward higher return products, aligning production rates to supply chain and logistics constraints, as well as demand, and reduce operational costs across the enterprise.\n\nIn addition, our advantaged portfolio enabled us to capitalize on demand strength in higher-value functional polymers, and packaging and specialty plastics, and performance silicones in performance materials and coatings. Third quarter net sales were $14.1 billion, with sales declines of 5% year over year, and 10% quarter over quarter. Local price increased 3% year over year, with gains in performance materials and coatings, and industrial intermediates and infrastructure. Sequentially, price declined 6% and was down across all operating segments and regions.\n\nVolume was down 4% versus the year-ago period, as declines in Europe, the Middle East, Africa, and India, or EMEA more than offset volume growth in the U.S. and Canada and Asia-Pacific. Sequentially, volume was down 3% led by EMEA. Continued strength of the U.S.\n\ndollar also impacted net sales by 4% year over year, and 1% sequentially. Operating EBIT for the quarter was $1.2 billion. Our consistent focus on cash flow generation and working capital management in the quarter supported cash flow from operations of $1.9 billion, or a conversion of 104% of EBITDA, and free cash flow of $1.5 billion. We returned $1.3 billion to shareholders in the quarter, including $800 million in share repurchases, and $493 million in dividends.\n\nAnd our balance sheet continues to have no substantive long-term debt maturities due until 2027. Turning to our operating segment performance on Slide 4. In the packaging and specialty plastics segment, net sales were $7.3 billion, down 5% year over year as price gains in resilient demand and functional polymers were more than offset by lower polyethylene pricing. Sequentially, net sales were down 11%, also driven by lower polyethylene prices with reduced volumes as we decreased operating rates in response to continued global marine park cargo, logistics constraints, and lower demand in EMEA.\n\nOperating EBIT for the segment with $785 million, compared to $2 billion in the year-ago period, and $1.4 billion in the prior quarter. These results were impacted primarily by higher raw material, and energy costs, and lower local prices. Moving to the industrial intermediates and infrastructure segment, net sales were $4.1 billion, down 9% from the year-ago period, with price gains in both businesses. Volume was down as strong demand for pharmaceutical, agricultural and energy applications, and industrial solutions were more than offset by declines in polyurethanes and construction chemicals due to inflationary pressures in EMEA, decreased consumer durable demand, and the slowing housing market.\n\nSequentially, net sales were down 7%, and stable volumes primarily in mobility and markets were more than offset by lower local price and currency. Operated EBIT for the segment was $167 million, compared to $713 million in the year-ago period, and $426 million in the prior quarter. As lower EMEA demand, an increased energy and raw material costs were partly offset by higher prices. Sequentially, operating EBIT margins declined by 560 basis points on lower price and higher energy costs.\n\nAnd in the performance materials and coatings segment, we reported net sales of $2.7 billion, up 5% year over year with price gains in both businesses and all regions. Volume was down as resilient demand in mobility, and home care end markets were more than offset by declines in building and construction. Sequentially, net sales were down 12%, driven primarily by lower demand and decreased local price for siloxane due to supply additions in China, as well as planned maintenance turnaround activity. Operating EBIT for the segment was $302 million, compared to $284 million in the year-ago period, as margins expanded by 20 basis points due to price gains for both silicones and coatings applications.\n\nSequentially, operating EBIT declined $259 million, driven by lower prices for siloxane and increased raw material and energy costs. I'll now turn it over to Howard to review our outlook and actions on Slide 5.\n\nHoward Ungerleider -- President and Chief Financial Officer\n\nThank you, Jim. Turning to Slide 5. In the fourth quarter, we expect to continue navigating high inflation, supply chain constraints, and the impact of geopolitical tensions. In Europe, high energy and feedstock costs are driving record eurozone inflation, reaching a new high of 10% in September.\n\nAs a result, we see reduced industrial production and consumer spending. In China, COVID-19-related lockdowns continue to hinder economic activity with weaker-than-expected regional consumer spending and infrastructure investments. That said, we're seeing continued strength in the mobility sector, with automotive sales are up more than 25% in September year over year. In the U.S., healthy consumer spending and low unemployment rates have supported resilient underlying demand despite high inflation.\n\nWith U.S. consumer confidence rising in September for the third consecutive month. Looking forward, we're closely monitoring the impact of rising interest rates on demand. And in Latin America, we continue to see robust demand for flexible food packaging and consumer durables, as well as transportation, infrastructure, and markets.\n\nTo manage these evolving dynamics, we continue taking actions region by region, and business by business. Throughout the third quarter, Dow implemented plans to reduce natural gas consumption at our sites in Europe by more than 15% due to high energy costs. In August, we also temporarily lowered our polyethylene nameplate capacity by 15%, and have now implemented a cold furnace idling program at our crackers for fixed and energy cost savings. In parallel, we continue to prioritize higher-margin functional polymers to capitalize on continued demand strength, while working to ease logistics constraints along the U.S.\n\nGulf Coast. We're also reducing operating rates and shifting production across polyurethanes, siloxane, and acrylic monomer assets in Europe to manage our costs and our inventory levels. And as we plan for next year, we have additional actions focused on production optimization, turnaround spending, and reductions in purchase services with the potential to deliver more than $1 billion in cost savings on a run-rate basis. Turning to Slide 6, you'll see our current expectations for the fourth quarter.\n\nIn the packaging and specialty plastics segment, we see stable demand for consumables and food packaging applications. We anticipate global energy markets to remain volatile in response to geopolitical dynamics, as well as the weather in the northern hemisphere, and continue to expect lower consumer spending primarily in Europe. While lower turnaround costs will be a sequential tailwind, in total, we expect $150 million seasonal headwind for the segment versus the prior quarter. In the industrial intermediates and infrastructure segment, demand for energy applications, particularly in the U.S., and a seasonal increase in deicing fluid demand are expected to positively impact the quarter.\n\nInflationary pressures, however, continue to impact consumer durables and building and construction demand, particularly in Europe. We also expect continued pressure on propylene oxide and energy margins due to increased supply from producers in Asia. After completing major planned maintenance activity in the prior quarter, on a net basis, we expect similar dynamics with a typical seasonality on a sequential basis. In the performance materials encoding segment, demand for personal care and mobility applications remains stable as consumers move toward holiday season buying patterns.\n\nHowever, we also anticipate a seasonal decline in demand for coating applications. Lower spending on planned maintenance activity will partially offset margin pressure from supply of both the siloxane and acrylic monomers from Asia, particularly to Europe. All in, we anticipate a $250 million headwind for the segment. So in total for the fourth quarter, we expect a $400 million net EBIDTA headwind compared to the third quarter.\n\nWe have also provided updates to the full-year modeling inputs in the appendix of the presentation. Equity earnings have been revised to align with the current market conditions and the weaker margins in Asia. We've lowered full-year CapEx from $2.1 billion to $1.9 billion, and the full-year tax rate is now expected to be slightly higher than our prior guidance due to the geographic mix and lower equity earnings. This upward pressure on the full-year rate is also expected to increase the fourth-quarter tax rate to account for the typical year-to-date screw-up.\n\nWith that, I'll turn it back to Jim.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nThank you, Howard. Turning to Slide 7. As a result of our actions over the last several years, we've created a streamlined portfolio with unique levers to manage through the current macro backdrop. We have global scale and leading positions across a diverse set of attractive market verticals, geographies, and value chains.\n\nThis gives us significant flexibility to quickly respond to evolving demand trends, and capture demand better than our peers. 65% of our production capacity is in the cost advantage the Americas, and we have 2 to 3 times more LPG flexibility in Europe versus our peers. Our advantaged cost position and unmatched feedstock and derivative flexibility enable us to optimize our margins. And our commitment to operational and financial discipline underpinned by a culture of benchmarking and a best-owner mindset has resulted in a low-cost operating model and strong cash conversion.\n\nThese advantages have served us well since been providing a solid financial foundation that supports long-term value creation, despite the current unprecedented events impacting the market. Importantly, our early cycle growth investments and our efficiency programs are enabling us to raise our underlying mid-cycle earnings above pre-pandemic levels. We've nearly tripled our three-year trailing cumulative free cash flows and spend across a variety of macro environments, and will continue to execute on levers to drive even higher cash flow, including working capital improvements, joint venture dividends, and cash interest savings. And our balance sheet is now the strongest it's been in my more than 35 years with the company, creating a solid financial position that offers significant flexibility.\n\nThe combination of robust cash flow generation and a strong credit profile enables us to deploy capital in a disciplined and balanced manner, as we advance our decarbonizing growth strategy, while also consistently returning cash to our shareholders through the economic cycle. Moving to Slide 8. In 2022, we expect to deliver an incremental underlying EBITDA run rate of approximately $300 to $400 million, comprised of $300 million from growth initiatives across our operating segments, as well as $50 to $100 million from efficiency levers. We have two alkoxylation investments coming online this year to serve high-value home care and pharma and markets.\n\nOur 60-kiloton project in the United States started up in the third quarter, and our 34-kiloton project in Spain is on track to start up in the fourth quarter. Our 150-kiloton FTTH pilot plant in Louisiana is also on track to start up in the fourth quarter. And year to date, we have completed 13 downstream silicones debottlenecking projects. Longer term, we remain on track to grow underlying EBITDA by greater than $3 billion by 2030, while reducing our carbon emissions by 30% versus our 2005 baseline.\n\nOur suite of higher return, lower risk, and faster payback investments will deliver $2 billion in additional run-rate EBITDA, while we also reduce our carbon emissions by approximately 2 million metric tons by the middle of this decade. These investments target higher-value applications that enable us to capitalize on increasing demand for more sustainable and circular solutions. Let me highlight a couple of examples. Our Engage Elastomers increased the lifetime of solar panels and enable over 50 gigawatts of solar power generation around the world.\n\nAnd we recently launched silastic, the world's first silicone-based self-sealing tire solution that can be easily recycled, which is being commercialized in upcoming Bridgestone tires under the technology name B-SEALS. We also remain on track to reach a preliminary investment decision by year-end for our Path2Zero project in Alberta to build the world's first zero carbon emissions, ethylene, and derivatives cracker complex, which will grow our global polyethylene supply by 15%, while decarbonizing 20% of our global ethylene capacity. This project will generate an additional $1 billion of underlying EBITDA by 2030. As we deliver on our growth strategy, we remain committed to the disciplined and balanced approach to capital allocation that has served us well since then.\n\nOur first priority is to maintain safe and reliable operations. We continue to advance our growth investments with CapEx at or below DNA, and drive return on invested capital greater than 13% across the economic cycle. With adjusted debt EBITDA, inside our long-term target range of 2 to 2 and a half times, we have the financial flexibility to deploy cash to maximize long-term shareholder value creation, and we're targeting to return 65% of our operating net income to shareholders. Since then, we've exceeded this target, returning an average of 78%.\n\nTurning to Slide 9. Despite near-term macroeconomic challenges, innovating circular and sustainable solutions remains a key aspect of our long-term decarbonization growth strategy. We see increasing demand for these products, which represent a significant growth opportunity for Dow, with attractive pricing that will support longer-term higher-quality earnings. We have continued to accelerate our actions to capitalize on this opportunity and create a circular economy.\n\nAnd we recently announced a new commitment to commercializing 3 million metric tons of circular and renewable plastic solutions annually by 2030. This new goal expands our sustainability targets and our focus on advancing a circular plastics business platform to meet our customers' increasing demand for more sustainable and circular products, as evidenced in the recent letter published by the Consumer Goods Forum, citing demand for advanced recycled plastic material. To achieve this goal, we will exceed our original target to enable 1 million metric tons of plastic waste to be collected, used, reused, or recycled. And we're well on our way as we scale a robust pipeline of more than 20 strategic collaborations to enable recycling infrastructure, to partner across the value chain, to bring hard-to-recycle waste into the circular economy, and to help communities address waste management and recycling gaps.\n\nThis includes our most recent and significant commitment today to scale advanced recycling with Mura Technology, which positions it now to be the largest consumer of recycled plastic feedstock for polyethylene globally. These collaborations are a unique advantage, as demand for circular solutions continues to grow. When you consider together this circular and renewable sales target, along with the additional capacity from our Alberta project. In 2030, our combined circular, renewable, and zero carbon emissions capacity will comprise greater than 50% of our global polyethylene capacity.\n\nI'll close on Slide 10. Our strategic priorities remain unchanged. We will continue to operate with agility, as we navigate the current market dynamics, as evidenced by our recent actions to balance production while ensuring we remain well-positioned to capture demand as market conditions improve. At the same time, we remain focused on executing our long-term growth strategy, expanding our competitive advantages, and delivering on our financial priorities to position the company for long-term success.\n\nWith that, I'll turn it back to Pankaj to open up the Q&A.\n\nPankaj Gupta -- Vice President, Investor Relations\n\nThank you, Jim. Now, let's move on to your questions. I would like to remind you that our forward-looking statements applied to both our prepared remarks and the following Q & A. Operator, please provide the following instructions.\n\nOperator\n\nThank you. [Operator instructions] We will take the first question from PJ Juvekar from Citi. Please go ahead.\n\nPJ Juvekar -- Citi -- Analyst\n\nGood morning, Jim and Howard. With the IRA and CCS going to $85 per ton, are there any projects in CCS that you could deploy to your existing plans, that come into the money now that weren't there before? And then secondly on Europe, would you accelerate CapEx in the U.S. given the situation [Inaudible], and then if Europe is not producing much chemicals, how did that impact in your mind sort of downstream, automotive, building, and construction businesses in Europe. Thank you.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nGood morning, PJ. Two really good questions. I think when we look at the IRA, which has a lot of good elements in it for our sustainability agenda, both hydrogen and CCS, as well as advanced nuclear. The challenge right now is where do you have the availability of the existing pipeline infrastructure to get carbon of an existing asset into a CCS category.\n\nThat's why we put the project in Terneuzen, and the project in Alberta first, because we have existing capacity there. I should say in Terneuzen, not yet, but Terneuzen about a plan in place to get it in place. This is going to help us get some infrastructure in place in the U.S. Gulf Coast to make that possible.\n\nAnd as that becomes available, we'll look at accelerating deployment here in the U.S. Gulf Coast. And I would say $85 a ton, we think long term those numbers are probably going more toward $100 a ton or higher, and that should really help accelerate hydrogen and CCS. On CapEx in the U.S., the future of chemicals in Europe, third quarter, the two big challenges we had were the biggest was primarily electricity-related, and third quarter we saw European electricity cost go as high as 400 euros a megawatt hour.\n\nThey've come off a little bit now because natural gas has come off. About half of our footprint in Europe has advantaged electricity. So we did in the quarter was bring down rates to the advantaged positions. We're kind of run break even in Europe and obviously lowered other assets with that demand.\n\nI think in the short term you're seeing more product flow into Europe from the Middle East, and some right now from China. I think longer term we're working with the governments through energy policy changes that are going to help. One of the reasons we announced the project in Stade, one of the five floating regas units that will be put in Germany. To really help Germany diversify away from just solely Russian gas.\n\nTo make the European question, long-term will be in front of us through next year. But in the short term, we've got a good game plan to navigate the winner and to navigate next year, and that's why we announced $2 billion worth of cost reductions for 2023.\n\nOperator\n\nWe will now take the next question from Hassan Ahmed from Alembic Global Advisors. Please go ahead.\n\nHassan Ahmed -- Alembic Global -- Analyst\n\nGood morning, Jim and Howard. I'm just trying to reconcile the Q4 guidance you guys have given. It seems to me you're guiding to an EBITDA of roughly $1.4, $5 billion. If that is the case, I'm just trying to sort of understand what sort of polyethylene pricing you're baking into that guidance because it just seems that, you know, there's some price hikes on the table.\n\nYou know, some consultants are out there sort of doubting some of those price hikes going through. So, if you could provide any color on that.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nThank you, Hassan. Good question. Obviously, we saw pricing in polyethylene through the third quarter decline. It started to stabilize at the beginning of the fourth quarter.\n\nMost of what's in that fourth quarter outlook is more stable pricing in polyethylene, but you get the dollar averaging that happens through the quarter. So we start the lower pricing in the curious through the quarter. Inventories came down on the Gulf Coast, stepped down from the high levels that they were in the third quarter, and so that's helping. And we've seen some better marine-packed cargo logistics.\n\nWe had good volumes out in the third quarter. We could have done more, and so we're continuing to try to work on the logistics constraints. And so most of what's in there is dollar averaging, more stabilized pricing, and then a little bit of tailwind because we have lower turnaround costs in the fourth quarter for polyethylene. The other thing I would mention is that input costs are starting to look more favorable.\n\nWe started to see a little bit of improvement in the ethylene chain. Oil is obviously, oil inventories continue to be low and natural gas production continues to be higher. And so that's positively skewed. I'd say the estimates skewed to the upside if oil and gas continue on these trends.\n\nOperator\n\nWe will now take the next question from Jeffrey Zekauskas from JPMorgan.\n\nJeffrey Zekauskas -- JPMorgan Chase and Company -- Analyst\n\nThanks very much. Two questions. Can you talk about MDI prices and volumes sequentially, and your general expectations? And secondly, in performance materials, there seems to be a fair amount of pressure in siloxane prices. Or are we entering some kind of cyclical downturn in that business? And so what we should expect is a relatively.\n\nLevel of earnings from the fourth quarter going forward.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nYeah. Good morning, Jeff. Thank you for the question. On MDI in industrial means an infrastructure.\n\nYou know the supply demand balances through the middle part of the decade look good on MDI, where we've seen market weakness is in consumer durables mobility's held up pretty well. Electric vehicles are really probably the shining star on growth in that space But its housing and construction were where we've seen the biggest weakness, and then of course appliances closely related to that. I would also say, where do you see in the numbers and what you see in the guide, remember that we have quite a bit of footprint in Europe. And so with the energy situation there, that just really compresses the margins and I think it's less of pricing and less that issue than it is the input cost issue.\n\nSo that's why we've brought rates down to low levels in Europe. China also seeing housing and construction slow, and I think we'll see what happens after we come out of this party congress and whether we see a change in COVID restrictions that might signal that 2023 would be better. And so I'm saying the capacity has come on in China, and that's really what's brought the prices down. And we're really back to the kind of long-term mid-cycle average prices for so our claims in the marketplace and yes, we expect that will continue into 2023.\n\nI think it's more the timing of the supply coming on, it's put that pressure on.\n\nOperator\n\nWe will now take the next question from David Begleiter from Deutsche Bank.\n\nDavid Begleiter -- Deutsche Bank -- Analyst\n\nThanks. Good morning, Jim and Howard. Howard, just the modeling guidance, does the $4 million of sequential EBIT headwinds fully capture the seasonality in Q4? And if any benefit in the guidance from $1,000,000,000 of cost savings you highlight today as well? Thank you. \n\nHoward Ungerleider -- President and Chief Financial Officer\n\nGood morning, David. So, yeah, the outlook at an enterprise level, the short answer to your question is it does. So the $400 million net of really EBITDA decline, I would call half of that is enterprise-level seasonality or typical Q3 to Q4 seasonality. And the other half is the averaging effect of the margin decline that we saw through the third quarter.\n\nAnd then you've got two pieces that are kind of offsetting each other. The higher the more favorable turnarounds or the lower turnarounds that Jim mentioned that are getting offset by some currency headwinds that we're seeing sequentially. Embedded in that are some of those interventions that we listed in the slide that are in the earnings deck. So we are already and have been intervening since the beginning of the third quarter.\n\nSo we're going to see that continue through the fourth quarter, and then obviously in a bigger way next year.\n\nOperator\n\nWe will now take the next question from Vincent Andrews from Morgan Stanley.\n\nVincent Andrews -- Morgan Stanley -- Analyst\n\nThank you, and good morning, everyone. Just wondering if you can talk a little bit more about sort of the delta between what you think underlying demand is versus maybe some destocking that's going on, just given all the macro uncertainty out there? And part of what I'm getting at is you've obviously, made some seasonality assumptions sequentially from 3Q to 4Q. And just trying to understand how much of what we've seen already in terms of weak demand might have been a pull forward of what we might have previously thought could have happened more traditionally in November and December. So just sort of any comments you have helping us a bridge, and serve the weak volume with destocking versus underlying demand would be helpful.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nThat's a good question, Vince. Obviously, the retail sector saw a lot of higher inventories and pulled back. I would say in automotive, things are still restricted primarily by the supply chains of all the different various parts coming together, so the auto companies can make their deliveries. That probably shows up more on internal combustion engine vehicles, somewhat on EVs, but EV growth in the U.S.\n\nand EV growth in China have been really, really strong. So I think that's going to continue to be good. Our outlook for automotive next year is 86 million light vehicles, up from 80 million projection this year. I think that's good.\n\nPackaging, I don't think we saw a lot of destocking in packaging in the market. I would say we saw adjustment to lower operating rates because of the slowdown of demand in EMEA may have been off 12% was a significant slowdown. Consumer pressures in EMEA are much stronger than even the consumer pressures here and there, and they're significant. The durable goods and the consumer electronics is a tough one to call.\n\nIt pretty tightly connected to the housing. China's housing is down 38%. Their housing starts to down 38% year over year. So that's a pretty low level.\n\nI'd say there's opportunity for upside going into next year. The U.S. has slowed down, but we're still working off of the finishes of houses that are under construction. And so I think the general consensus demands a little bit slower for 2023 on housing here.\n\nThe other bright spot is infrastructure, and so for those businesses that are tied to infrastructure, we still see very good infrastructure spending.\n\nOperator\n\nWe will now take the next question from Michael Sison from Wells Fargo.\n\nUnknown Speaker\n\nHi, this is Richard on for Mike. Just wanted some color on the $1 billion in cost savings for 2023. Is any part of this embedded in the $3 billion to $3.9 that you're targeting to increase sort of your earnings ranges through the cycle? And also is that also includes the temporary 15% reductions in polyethylene, and maybe additional reductions in capacity potentially, and maybe II and I.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nYeah, that's a good question, Richard. So our target is to come up with more than $1 billion in cost saves. I would break it down into a few different buckets for you. One is what we can do with optimizing our mix or flexing the assets across geographies, and product, and application mix to actually improve margins.\n\nThe second would be what you talked about in terms of plan islands or shutdowns. Right now we don't have anything lined up for shutdowns, but we obviously have reduced rates for higher-cost plans, and we'll continue to do that, especially in Europe, while energy costs remain as high as they are. And then we're working on always things to drive operational excellence. And the other big moving part next year is we're going to reduce turnaround spending.\n\nWe're starting to see commodities come down and input costs come down and some relief on freight and logistics costs. We've got a big effort on purchased materials and freight and logistics to get costs down and also on purchase services, including contract labor. And then we've been implementing digital and acceleration of finishing those projects deliver bottom line margins and productivity too. So those are really the five big buckets that we're working on.\n\nThe target here, if you look at the earnings corridor that we published back in Investor Day, our 2023 lower end of the corridor is about $7.2 billion. So our efforts here are really driven to protect that earnings corridor that we put out there. A lot of the Path2Zero project growth in that earnings corridor, the Alberta project, which is $1 billion of underlying EBITDA growth. Starts in 2027, that project will come on in two phases between 2027 and 2030, but the other 2 billion comes on through the years as we bring on these smaller, higher return, lower risk projects.\n\nOperator\n\nWe will now take the next question from Kevin McCarthy from Vertical Research Partners.\n\nCory Murphy -- Vertical Research Partners -- Analyst\n\nHi. Good morning. This is Cory on for Kevin. Turning back to a question on the outlook, you had mentioned benefits in the ethylene chain.\n\nWhat are you baking into your 4Q outlook as it relates to ethane costs? And what is your view in light of today's natural gas market backdrop? And then for the cold furnace idling program, can you talk through or quantify what impact you expect that to have on fixed cost absorption at your reduced plans? Thank you.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nRight. That's a good question on ethylene. I mentioned natural gas earlier, so gas production continues to be high. More than half a million barrels a day of ethylene in rejection.\n\nThat is really brought the frac spreads down. And so we've seen frac spreads come back down to about $0.33 a million BTU. So off of some of the highs that we saw in first, second quarters, and I think our projection is it's going to continue to be that way. Natural gas production at 100 BCF a day right now, and the outlook for next year is 110 BCF a day.\n\nThere will be plenty of ethylene available. And I think our feeling is we expect through winter, $0.40 to $0.60 a gallon on depending on what happens with winter gas demand. That's really where it was, $0.35, $0.65 in third quarter. And I think next year we're going to see continued availability and lower price in all ethylene.\n\nIn terms of the cold furnace idling, I don't have a good number for you to estimate what that is. Essentially, the practice historically would have been to keep those assets on hot standby and ready to go. But with the slower demand, there's no need to do that. And with these higher gas costs, taking them cold and then warming back up is not going to penalize us in the marketplace.\n\nOperator\n\nWe will now take the next question from Steve Byrne from BOA.\n\nMatthew DeYoe -- Bank of America Merrill Lynch -- Analyst\n\nThanks. It's Matthew DeYoe for Steve. Can we talk about the trend in functional polymers a bit? I think price was up year over year but sounds like maybe down sequentially. Did margins in that business improve quarter over quarter with base commodities deflating? And when we look at 4Q.\n\nDid that performance catch you up on the downside, or do you still think things should hold in pretty well?\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nThank you. Good question. Prices typically are pretty resilient through the cycle in that space. We saw.\n\nPrices are flat really from quarter to quarter. And so net margin declined a little bit because of the higher energy and raw material costs. But the demand continues to be good on demand. And in areas like commercial construction, which is holding up relatively well, mixed-use, both residential and commercial buildings are going up pretty strong around the world and that takes a fair amount of material.\n\nObviously, products into automotive are holding up pretty well. And then energy, energy infrastructure takes a lot from the wiring cable business and that continues to hold up well. So I think what you'll see is the margins can [inaudible] and flow a little bit, but the volumes and the price trends are very strong.\n\nOperator\n\nWe will take the next question from John Roberts from UBS.\n\nMatt Skowronski -- UBS -- Analyst\n\nGood morning, Jim and Howard. This is Matt Skowronski on for John. Some of the consultants have reported that polyethylene storage levels are very high in North America. Would you consider taking operating rates lower than the 15% reduction you've already taken if demand weakens further? And then sitting here today, do you think it's possible that further reductions in production will need to happen either through the end of this year or early 2023?\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nThanks for the question. I think the storage levels primarily at the ports, are waiting for ships to arrive to get the product out. A lot of the product was packaged for the export market, so it is just that that product is going to magically turn around into the North American market. And with what we've seen with demand growth in the North American market, I don't see a reason to reduce operating rates any further.\n\nI'd also say Latin American business is holding up relatively well, so that gives us some opportunity as well. I think it's going to be worked out as we get better ship arrival times and better loading. I think you're going to see those numbers deplete pretty quickly.\n\nHoward Ungerleider -- President and Chief Financial Officer\n\nI would just also add the latest ACCD data says that inventory levels actually decreased by 7% or about four days month on month. So I mean, I think you still see fundamental demand in the United States and Canada hanging in there.\n\nOperator\n\nWe will now take the next question from Christopher Parkinson from Mizuho.\n\nChristopher Parkinson -- Mizuho Securities -- Analyst\n\nHi, good morning. I was just wondering if you can pass out a little bit about what end markets and regions you saw the biggest shift in demand vs kind of your original expectations in the second quarter, and how those areas are trending into the fourth quarter? Is there any area where you're more optimistic or more concerned as we head into the end of the year in 2023? Thank you.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nYeah. Good question, Chris. So areas of strength are industrial electronics. And think about telecom, 5G infrastructure, and data centers, and that continues to be pretty good.\n\nThere can be some supply chain constraints there, but they're pretty strong in industrial solutions. We make intermediates and shipments for the pharma industry. That demand has been strong, we're looking at greater than 7% compound average growth rates through 2026. And so that's I think that's going to continue industrial solutions in general, I would say has good growth trends and silicones downstream.\n\nSilicones and Joe, have good growth trends. Automotive, we're seeing some supply constraints easing. And even though sales this year, deliveries this year are flat year over year, really robust growth, especially in China. If you look at China, EVs are up 90% year over year, and automotive in China is up 25% year over year.\n\nI think that's a bright spot. We expect to continue. EVs in the United States are also strong and I expect that to continue. That's good for us because 2 to 3 times more silicone materials in EVs, and similar amount of materials that we would have in an internal combustion engine for things like controlling noise, vibration, and harshness.\n\nInfrastructure is going to continue to be strong. There are stimulus packages out there, many governments around the world, and that tend to put a lot in functional polymers, which we just talked about. It will pull some polyurethanes and construction materials that will pull some in coatings and that infrastructure space and some in Dow Industrial Solutions. In plastics, it tends to pull in things like water pipelines, natural gas pipelines.\n\nI think we'll continue to see that grow. Steady markets, I would say would be oil and gas. We're starting to see an uptick in oil and gas production that pulls amines from our Industrial Solutions business. Personal care has been very resilient.\n\nCosmetics have come back after a soft second quarter in China and packaging for food. And so the issues of packaging are really more not demand, but really more the higher energy cost and slowing economic activity in Europe. And then places, where I mentioned before, are weak, are related to housing and big ticket items. So appliances, food and beverage, activities like furniture and bedding, I mean, not food and beverage, appliances and furniture and bedding slowed down, third quarter and in the fourth quarter, and then consumer electronics slowed down as well.\n\nLarge TVs, large home PCs, and electronic devices. Our residential softening here in the U.S., Europe, also in China. But commercial construction has been relatively good, mixed residential and commercial buildings, especially in big cities. I think next year, India, U.S., Canada, and Latin America will be bright spots.\n\nWe'll still have to manage through Europe and the situation with Russia, Ukraine having a biggest impact there. And then China, we had the best quarter in China, we were up 13% quarter over quarter, and 7% year over year in volume, and could have been better with the ability to get more plastics out of the Gulf Coast. So, I think there's been a lot of concern about what they have reported or not reported. But our view is that demand has been good.\n\nOperator\n\nWe will now take the next question from Josh Spector from UBS.\n\nJosh Spector -- UBS -- Analyst\n\nYeah, hi. Good morning. So just curious if there is a way to think about the costs you guys are absorbing in Europe from higher energy. So we think about 3Q and 4Q expectations versus the level of 2Q.\n\nIs there any way to quantify how much you feel like you've had to absorb and not be able to kind of shift away from flexing or production or through pricing or other means? So if pricing or energy prices were to move down with demand environment remain similar, how would you think that would play out? Thanks.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nSimple answer, two-thirds of the total EBITDA decline in third quarter, whether it was versus previous quarter or last year was in EMEA. And that's the impact of high inflation, elevated energy costs on our raw materials, and then what that high inflation has done to consumer demand in EMEA. Volume was down 12% in the quarter in EMEA.\n\nOperator\n\nWe will now take the next question from Arun Viswanathan from RBC Capital Markets.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking my question. Good morning. So my question is around North America and potential outlook there.\n\nI know Europe was responsible for two-thirds of the weakness in Q3, and that's likely been the case for a little while now. Are you at all concerned of a weakness that could emerge in North America, as North America is just a little bit behind Europe and China in the weakness that you're seeing there? I mean, I guess you're not seeing signs of weakness, but on Europe. And what are some of the factors that would differentiate and keep North America a little bit more resilient? Maybe you can touch on inventories or supply demand or anything else. Thanks.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nWell, the cost position that we have in the Americas is very advantaged. And so I think that's the most important thing to keep in mind. The consumer demand has been strong, especially consumer non-durables, consumer discretionary has been good. I would say big ticket items like I mentioned have already slowed this year.\n\nSo if anything, there's a chance for upside next year. I think that same is true on automotive. Automotive really been supply constrained, and so we get through some of that, we'll start to see that move up. We're starting to see, and here I'm not talking just about Dow's business, but we're starting to see prices come down in bulk commodities.\n\nIt takes those prices a while to work through the fabrication shops and get themselves into the price of a product that a consumer would buy in the store. So those prices have come down through the year, and I think you'll start to see those show up in the consumer markets next year, and that may actually help things improve. European energy situation is totally different than the United States, and right now we're trying to work through how we can help the government get to a better energy policy that will help them. I think that'll be the biggest improvement globally that'll help the economy move.\n\nOperator\n\nWill now take the next question from Aleksey Yefremov from KeyBanc Capital Markets. Please go ahead.\n\nUnknown Speaker\n\nHi, this is Paul on for Aleksey. As we first winter, how are you guys managing the cost on both the U.S. and Europe? And do you see the potential for any idling of assets in Europe? Maybe not your assets, but just broadly in the industry? Thanks.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nYeah. I think we have seen an energy-intensive industry in Europe like steel and aluminum already idling of assets. A lot, maybe not complete closure, some energy-intensive industries' complete closure may jeopardize the long term. You know, probability of starting them back up by a lot of pressure on smaller producers in Europe, especially having some scale matters and having good advantage cost positions matters.\n\nAbout half of our energy footprint in Europe is advantaged, and so we've nailed back to those rates to take advantage of that cost layer. And then we've loaded that demand onto other locations that are more cost advantage. We'll continue to do that. I think the other answer to shutdowns is going to be whether we see a way through the energy policy situation.\n\nThe longer we stay in this situation, the longer the Russia-Ukraine situation last. It'll put more pressure on the industry to take a look at rationalizing. And they've already got a lot of pressure there. They need government help more than anything.\n\nOperator\n\nWe will take the next question from Laurence Alexander from Jefferies.\n\nLaurence Alexander -- Jefferies -- Analyst\n\nGood morning. So can you describe how you're thinking about CapEx flexibility over the next couple of years given the credit cycle in prior cycles, downs kind of more to look at retrenching? But as you look at the investments required for the circular economy initiatives, could you pull forward or be opportunistic in expanding sort of what you do in that value chain? As other people retrench.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nGood question, Laurence. And obviously, we're trying to have the financial flexibility to keep moving on those projects, because I don't think long term any of those trends are going to change, which either consumer demand throughout the year in spite of what's going on in the global macroeconomy. Consumer has come back to us consistently wanting more and more and more of both mechanical, recycled, advanced, recycled products, and products made with bio-based ingredients, more and more renewable products. And that's what we're investing in.\n\nSome of it's our capital, some of it is joint capital together with partners. Like I mentioned, with neuro technologies, we have about 20 projects in plastics today. We had a 1 million metric ton target, and we have a good line of sight to be able to deliver the 1 million, and we just increased it to 3 million metric tons of circular and renewable solutions by 2030. Mainly because of those brand owners who are telling us the demand is there for those products, and so we will keep those projects moving forward.\n\nWe will keep our decarbonization and Path2Zero projects moving forward. Obviously, we're going to be disciplined about it. Most of the money that we spend on Path2Zero right now is engineering dollars, and we will not pull the trigger and start those projects until we see the bulk contracts for steel and fabricated products and long lead time items in the right range. And when we see that, I will be ready to go.\n\nAnd I think in this next wave we'll have first mover advantage with the Canadian project, just like we did with the U.S. Gulf Project that started in 2017.\n\nOperator\n\nWe will now take the next question from Jaideep Pandya from On Field Research.\n\nJaideep Pandya -- On Field Investment Research -- Analyst\n\nThe first is on the silencing value chain. Could you just tell us what is the current cost French of between Europe versus the U.S. and China on a lended cost basis, if you include the energy cost? And given that significant supplies coming in China in the next 12 to 18 months, especially in Xinjiang and Yunnan, what do you expect for siloxane utilization outside of China? That's my first question. And the second question really is around the ethylene oxide [inaudible] chain.\n\nThis chain has done extremely well for not just yourselves, but a lot of your peers as well. And again, we are starting to see as freight rates normalize products come out of China. So what do you expect for the [inaudible] chain in 2023 and 2024? Do you expect a normalization, or do you think that demand is going to continue to be good? Thanks a lot.\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nSo I say prices, their available there in China have become available in all the regions around the world already. So I think it's already at that spot. Silicone metals market prices are down a bit, mainly just because demand and some higher volume applications are down. Higher volume applications related to building and construction.\n\nBut that I think, is going to steadily improve. I would expect it to be in this level in 2023. And then as we see, inflation comes down, which I do believe it will. I think you'll see the demand start to pick back up again, and things will tighten back up.\n\nAnd that's put more pressure on Europe, I would say North America. And that's why we took some slower rates in our U.K. facility. On EO, demand was at the second half of the question.\n\nJaideep Pandya -- On Field Investment Research -- Analyst\n\nMEG\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nMEG is the weak spot. And if you look at our industrial solutions strategy, it is to keep investing in high-value EO applications. And so all of our [Inaudible] investments that you see investments in our oil and gas franchise remains, those are continuing to do very, very well. And we're going to continue investing there to try to increase the amount of business that goes to those higher value applications for purified EO and away from MEG.\n\nMEG prices were actually in a low spot in the third quarter and have improved a little bit since because of falling inventories. I think a big part is going to be dependent on higher China activity after they've stopped zero COVID lockdowns.\n\nPankaj Gupta -- Vice President, Investor Relations\n\nYeah. Thanks, everyone, for joining our call. I think that's all the time we have for today. We appreciate your interest in Dow.\n\nFor your reference, a copy of our transcripts will be posted on our website site within approximately 24 hours. This concludes our call. Thanks once again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPankaj Gupta -- Vice President, Investor Relations\n\nJim Fitterling -- Chairman and Chief Executive Officer\n\nHoward Ungerleider -- President and Chief Financial Officer\n\nPJ Juvekar -- Citi -- Analyst\n\nHassan Ahmed -- Alembic Global -- Analyst\n\nJeffrey Zekauskas -- JPMorgan Chase and Company -- Analyst\n\nDavid Begleiter -- Deutsche Bank -- Analyst\n\nVincent Andrews -- Morgan Stanley -- Analyst\n\nUnknown Speaker\n\nCory Murphy -- Vertical Research Partners -- Analyst\n\nMatthew DeYoe -- Bank of America Merrill Lynch -- Analyst\n\nMatt Skowronski -- UBS -- Analyst\n\nChristopher Parkinson -- Mizuho Securities -- Analyst\n\nJosh Spector -- UBS -- Analyst\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nLaurence Alexander -- Jefferies -- Analyst\n\nJaideep Pandya -- On Field Investment Research -- Analyst\n\nMore DOW analysis\n\nAll earnings call transcripts"
}