{
  "companyName": "Planet Fitness",
  "companyTicker": "PLNT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/planet-fitness-plnt-q3-2022-earnings-call-transcri/",
  "content": "Planet Fitness (PLNT -0.48%)\nQ3 2022 Earnings Call\nNov 08, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, everyone, and welcome to the Planet Fitness third quarter earnings conference call. My name is Emily, and I'll be coordinating your call today. [Operator instructions] I'll now turn the call over to Stacey Caravella, VP, Investor Relations. Please go ahead, Stacey.\n\nStacey Caravella -- Investor Relations\n\nThank you, operator, and good morning, everyone. Speaking on today's call will be Planet Fitness Chief Executive Officer Chris Rondeau and Chief Financial Officer Tom Fitzgerald, both of whom will be available for questions during the Q&A session following the prepared remarks. Today's call is being webcast live and recorded for replay. Before I turn the call over to Chris, I'd like to remind everyone that the language on forward-looking statements included in our earnings release also applies to our comments made during the call.\n\nOur release can be found on our website, investor.planetfitness.com, along with any reconciliation of non-GAAP financial measures mentioned on the call with their corresponding GAAP measures. I'd also like to invite everyone to listen in to our Investor Day on Tuesday, November 15. You can find details on timing and the link to the webcast on our Investor Relations website. Now, I'll turn the call over to Chris.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you, Stacey, and thank you, everyone, for joining us for today's call. We ended the quarter with more than 16.6 million members, an all-time high, and added 29 new locations during the quarter, growing our total store base to 2,353. We continue our steady recovery over the pandemic. Member trends we made strong with Q3 to, in fact, historical pre-COVID seasonality.\n\nAlso, members were busy in the gym, continue to visit more frequently, and cancels are lower compared to 2019, which we believe are signs that members are more committed to business. We recently hosted our franchisee conference, and the energy was amazing. And we're back meeting in person for the first time in three years. The theme of the conference was unstoppable, highlighting our ability to succeed over the past three years for all types of economic and political climates.\n\nWhile the industry recorded that 25% of health and fitness facilities have closed due to COVID, given the strength of our model and franchise system, we survived the pandemic without a single permanent foreclosure, emerging even stronger with tremendous opportunity for future growth. While all age generations are nearly back to or above their pre-pandemic penetration levels, a major topic of prior presentations during the conference were our efforts to continue to increase our penetration of all generations with a strong focus on Gen Z. We're excited about the potential long-term opportunity we have with Gen Z, as evidenced by the 3.5 million teens who signed up for the High School Summer Pass program. When the program ended in August, more than 14% of all high school-aged teens in the U.S.\n\nwere high school from the past participants. How far did they enroll in the program? Teens logged 17 million workouts. We made the signing process even more seamless this year, allowing teens to register online, which enabled us to connect with them and their parents or guardians. In fact, our app topped the downloaded list of apps in the Apple Store during the initial days following the launch.\n\nThrough a targeted acquisition strategy, we began reaching out to the participants and their parents and guardians throughout the summer via email, in-app messaging, and text with an offer of one month free if they joined the paying member once the summer was over. Today, nearly 300,000 teens and parents or guardians have joined for a total conversion rate of 5%, helping to drive member growth in the third quarter. We're already outpacing the conversion rate we had in 2019, the last time we ran a similar program, and we have a much bigger base, more than three and a half times the participants we experienced in 2019. We continue to market to them and believe that when they join again, Planet Fitness will be top of mind.\n\nAlong with our franchisees, we're focused on gearing up for our first quarter marketing plans. Pre-pandemic, we would have typically get 60% of our full year net membership gains in Q1. We look forward to the first quarter of 2023, which we're planning to be our first uninterrupted Q1 in four years without any impact from COVID. For the eighth year in a row, we will once again be the presenting sponsor for the Times Square New Year's Eve celebration.\n\nWe're the longest-running sponsor, as well as the only gym company ever, given our marketing size and scale range. This will also kick off our January national brand campaign, focused on reinforcing the benefits of working out besides physical health. Like mental wellness, managing stress can improve sleep, as well as a post-workout positive energy feeling and the glow. As we are in our second quarter call, the percent of mature stores that have recovered and surpassed previous membership levels remain stable at around mid-30%, but we added to our membership count.\n\nGiven our historical join seasonality, we don't anticipate this to move significantly until the first quarter when you typically see high net member growth. The systemwide rollout of the Black Card price increase on May from 22.99 to 24.99 continues to outperform the cash results. While the price increase is only for new join, it's driving up our overall average rate. Thirty percent of our 8.2 Q3 comparable was driven by rate, with the balance coming from that member growth.\n\nThis helps our franchisees and corporate store segments partially offset increased operational costs experienced in the last couple of years. Yesterday, we announced a promotion that if you join the Black Card member between November 7 and November 15, you receive a free Halo View, Amazon's fitness and health wearable tracker. We're excited about this collaboration. We will continuously look for possibilities for working with other well-known large brands who are an adjacent category to the fitness industry.\n\nWe believe that we were an attractive brand partner given our size and scale and the diversity of our more than 16.6 million members across gender, age, incomes, and other attributes. Lastly, I'm excited about our recent announcement that we promoted Jen Simmons, previously senior vice president of business strategy and analytics, to division president of corporate clubs, and that Paul Barber has joined as our chief information officer. Jen has been with Planet for nine years and has built the business strategy and analytics functions from the ground up, using data and analytics to develop and drive our overall corporate strategy. We look forward to her leadership of corporate store fleet, driving performance through insights that will help benefit the entire franchise system.\n\nPaul will lead our technology evolution and strategy to deliver technology solutions that will continue to enhance the member experience while optimizing infrastructure, data, and operations for flexibility and scale. I would search for president is still underway, but I feel good about our organizational structure, and I believe that we have the leaders in place who will drive our next stage of growth as we emerge even stronger post-pandemic. We also look forward to discussing this in more detail at our Investor Day next week. I'll now turn the call over to Tom.\n\nTom Fitzgerald -- Chief Financial Officer\n\nThanks, Chris, and good morning, everyone. Through the third quarter of this year, we have repurchased 1.5 million shares, inclusive of a $50 million share repurchase that we executed in Q3, at an average price of $61.68, which we believe underscores the strength of our balance sheet only two years after having all of our stores temporarily closed due to the pandemic. We also announced this morning that our board of directors approved a new $500 million share repurchase authorization that replaces the existing one from 2019. We believe this is another signal of our confidence in the reliability and consistency of our asset-light model to generate significant free cash flow.\n\nNow, I will cover our Q3 results. All of my comments regarding our quarter performance will be comparing Q3 2022 to Q3 of last year unless otherwise noted. We opened 29 new stores compared to 24 last year, where positive same-store sales growth of 8.2% in the quarter. Franchisees' same-store sales grew 8.1%, and our corporate same-store sales increased 9.7%.\n\nAs a reminder, same-store sales for the Sunshine Fitness franchise stores that we acquired in Q1 of this year will not be reflected in our corporate-owned same-store sales until February of 2023, but they will continue to be reflected in our systemwide same-store sales, consistent with how we've treated prior acquisitions. Approximately 70% of our Q3 comp increase was driven by net number growth, with the balance being driven by rate growth. The rate growth was primarily driven by a 5-basis-point increase in our Black Card penetration to 62.9%, as well as our recent price increase in May from 22.99 to 24.99. As a reminder, the Black Card price increase that we took in May was for new joins only so that should slowly begin to drive up average monthly dues over time.\n\nFor the third quarter, total revenue was 244.4 million, compared to 154.3 million. The increase was driven by revenue growth across all three segments. The 7.1% increase in franchise segment revenue was primarily due to an increase in royalties from same-store sales growth and new stores. Partially offsetting the increase was a decrease of approximately $2.6 million as a result of the stores acquired in the Sunshine business transaction moving from the franchise segment to the corporate-owned segment, higher net expenses, and the higher equipment placement expense.\n\nFor the third quarter, the average royalty rate was 6.4%, which was flat to the prior-year period. The 131% increase in revenue in the corporate-owned store segment was primarily driven by the Sunshine Fitness acquisition, as well as same-store sales growth and the new store openings. The equipment segment revenue increased 78%, driven by higher equipment sales to existing franchisee-owned stores. For the quarter, replacement equipment accounted for approximately 75% of total equipment revenue, which was higher than we typically experienced, largely due to reequips that shifted from Q2 to Q3 of this year due to COVID-related supply chain disruptions in China earlier this year.\n\nWe completed 28 new store placements in Q3, flat to last year. Our cost of revenue, which primarily relates to the cost of equipment sales to franchisees in stores, amounted to $48.5 million, compared to 27.1 million. Store operations expense, which relates to our corporate-owned store segment, increased to 57.9 million from 27.8 million, primarily due to the additional stores from the Sunshine acquisition. SG&A for the quarter was 27.1 million, compared to 23 million.\n\nPayroll costs primarily drove this increase with the addition of the Sunshine Fitness team, as well as increased travel expense and expense related to our franchisee conference. National advertising fund expense was 17 million, compared to 16.6 million. Net income was 30.7 million, adjusted net income was 38.2 million, and adjusted net income per diluted share was $0.42. A reconciliation of adjusted net income to GAAP net income can be found in the earnings release.\n\nAdjusted EBITDA was 93.9 million and adjusted EBITDA margin was 38.4%, compared to 61.7 million and adjusted EBITDA margin of 40%. A reconciliation of adjusted EBITDA to GAAP net income can be found in the earnings release. We are no longer excluding pre-opening costs from our adjusted EBITDA, adjusted net income, and adjusted earnings per share. In the reconciliation, you'll find that the prior-year period restated reflecting this change.\n\nBy segment, franchisee adjusted EBITDA was 53.5 million and adjusted EBITDA margin was 66.3%. Corporate store adjusted EBITDA was 39.6 million and adjusted EBITDA margin was 38.4%. Equipment adjustment -- adjusted EBITDA was 15.8 million and adjusted EBITDA margin was 25.4%. Now, turning to the balance sheet, as of September 30th, 2022, we had total cash and cash equivalents of 467.2 million, compared to 603.9 million on December 31st, 2021, which included 62.7 million and 58 million of restricted cash in each period.\n\nAs I mentioned earlier, during the quarter, we used $50 million to repurchase approximately 830,000 shares. Total long-term debt, excluding deferred financing costs, was 2.0 billion as of September 30th, 2022, consisting of our four tranches of fixed-rate securitized debt that carries a blended interest rate of approximately 4%. Finally, to our 2022 outlook, as a reminder, our view assumes there is no material resurgence of COVID that causes member or supplier disruptions, whether it be a shutdown or more stringent mandates that result in a significant change in membership behaviors. In our earnings press release this morning, we reiterated and updated our growth targets for the year.\n\nWe continue to expect systemwide same-store sales growth in the low double-digit percentage range. We decreased our outlook for equipment placements in franchisee-owned locations from approximately 170 to a range of 150 to 160. This update primarily reflects a worsening of the HVAC supply chain issue. We're continuing to monitor the situation carefully, but we do expect that some placements that we thought would happen in 2022 will now take place in early 2023.\n\nWe now expect revenue to increase in the high-50% range. Previously, we expected it to increase in the mid-50% range. This revision reflects our better insight into inventory availability to meet franchisee demand for reequips. We now expect adjusted EBITDA to increase approximately 60%, adjusted net income to increase in the low-100% range, and adjusted earnings per share to increase in the mid-90 range.\n\nPreviously, we expected adjusted EBITDA growth in the high-50% range, adjusted net income growth in the low-90% range, and adjusted earnings per share in the mid-80% range. Our adjusted EPS guidance is based on diluted shares outstanding of approximately 90.5 million, inclusive of the issuance of equity as part of the Sunshine acquisition and share repurchases through the third quarter. We also continue to expect 2022 net interest expense to be approximately 86 million, which reflects our first quarter debt refinancing and upsizing. As Chris said, we are looking forward to a solid Q4, and assuming there is no virus resurgence, we are optimistic that we will have a strong January in Q1.\n\nI'll now turn the call back to the operator to open it up for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question today comes from the line of Randy Konik with Jefferies. Please go ahead, Randy. Your line is open.\n\nRandy Konik -- Jefferies -- Analyst\n\nThanks a lot, and good morning, guys. I guess, Chris, a question for you. You've mentioned in your commentary the change in utilization patterns that you saw, I guess, moved up and your cancel rate moved down. It sounds like it was, you know, significant in trend.\n\nSo, just wanted to kind of understand, you know, how that is changing sequentially. It sounds, again, significant. And what do you think is driving that change in those two items?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, this has -- that's trend has been somewhat consistent almost coming out of COVID, where the people that are working are working out more than they were previously. If I remember, you know, back since the IPO, the average person was working out about five times a month. Now, it's come up to six times a month. And the -- and so, I think that's kind of staying there.\n\nBut the cancellation rate is right. People are just more committed. So, it has sprung slightly from the past, though. Both are -- you know, both trends are very good, mostly for the longer term because, you know, attrition gets better.\n\nJoins continue to flow like they're flowing, and it's going to add more base, you know.\n\nRandy Konik -- Jefferies -- Analyst\n\nGot it. Super helpful. And I guess maybe a question for Tom. You know, I know we hadn't disclosed how much you think the conversion could occur of the teen summer challenge members to paying members over time.\n\nBut I guess what I wanted to try to understand is if you look back to 2019, the last time this program took place, and I think 25% of those members -- 25% of those participants converted to members, can you give us some perspective on the time frame of those conversions, i.e., you know, how long do -- should you expect or how should the conversions start to take place? When should we notice them, you know, this time around in 2022 and 2023?\n\nChris Rondeau -- Chief Executive Officer\n\nRight. Hi, Randy. This is Chris. The -- yeah, when we said the 25%, that was, you know, from the time of the ending of the program in 2019 through the whole COVID years and stuff.\n\nSo, well, you know, three years ago now, right? And then we had reported that there's about 11% are still members today and about 5% of the parents are still members. So, it's three years later, you know. But by the -- but right now, we are trending ahead of the conversion rate for the remainder of 2019 compared to that year. So, if you look at between the end of the program or the program itself through the end of 2019, we are trending higher conversion rates than back then.\n\nSo, I think that probably leads itself, one, to just the general Gen Z joining trend is positive in the right direction, it's coupled with the fact that we have all their text messages, in-app messaging, and emails now because it was all digital signup, you know. So, I think it is -- the trending is showing that it's doing better, and I can't imagine that it's not going to continue, you know, over the next couple of years ahead.\n\nTom Fitzgerald -- Chief Financial Officer\n\nYou know, and maybe one thing, Randy, as Chris said in his prepared remarks, that conversion rate is not only ahead of where we were in 2019, but it's off a base that's, you know, three and a half times-plus larger. So, the impact on membership is much greater.\n\nRandy Konik -- Jefferies -- Analyst\n\nSuper helpful. Thanks, guys.\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. Thank you, Randy.\n\nOperator\n\nOur next question comes from Brian Harbour with Morgan Stanley. Please go ahead, Brian.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nYes. Thank you. Maybe for the question on the replacement equipment revenue, which seems like it's really picking up quite quickly. Is that something that you kind of expect to continue in the fourth quarter and into next year or any kind of puts and takes there that we should think about?\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah. Hey, Brian, it's Tom. I'll start that. So, I think part of the mix shift and it being 75% of the equipment revenue is because of the shifting of reequips from Q2 to Q3 because of the Shanghai shutdown, so it pushed reequip into Q3, and then some of the supply chain issues moving the new stores, you know, around a little bit.\n\nSo, you know, for the year, maybe this is -- the direct answer to your question, for the year, with the change in our placement outlook, we believe reequip will be closer to 60% of total equipment revenue compared to where we were saying before, it'd be closer to 50-50.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nThat's helpful. Yeah, thank you. And then maybe just a question on kind of new unit openings. I mean, do you think the -- you said in the HVAC issues, do you think those start to kind of, you know, come off next year? I don't know if is it like the crux at the end of the year.\n\nIs there anything else that's at play in openings this year?\n\nTom Fitzgerald -- Chief Financial Officer\n\nNo, the issue this year primarily is the HVAC issues. And from what we hear, no one yet knows when they abate or, you know, go away. I think it's a combination of changing standards catching the manufacturers off guard a little bit, but also the Shanghai shutdowns and continuing, you know, sort of rolling lockdowns here and there in China. So, you know, we've -- we were in discussions with some larger franchisees here recently, and the frustrations continue because you sort of don't know until it's too late in the cycle.\n\nSo, you know, we'd love to say it's going to end in Q1, but we're not in the -- in any position to say we know when it'll end. Hopefully, it's sometime in '23. But all manufacturers -- all big manufacturers are telling us they don't yet have a firm commitment on when it'll return to normal, so to speak.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nThank you, guys.\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, thank you.\n\nOperator\n\nOur next question comes from Rahul [Inaudible] with JPMorgan. Please go ahead, Rahul. Your line is open.\n\nUnknown speaker\n\nGood morning, guys. Thanks for taking my question. Chris, you guys talked about the franchise conference. Can you just like give us some more insight on what kind of conversations did you have in terms of how the franchisees are feeling in terms of store openings or in terms of their financial health or anything as that kind of stood out, that makes sense to discuss? That would be appreciated.\n\nChris Rondeau -- Chief Executive Officer\n\nSure, yeah. There's excitement around the fact that the trends we're seeing with all the generations, specifically Gen Z, and the increase of their propensity to join. So, that's already good stuff. On top of that, you know, some of the conversations were some things about the build-out costs.\n\nThere's definitely some inflationary costs of build-out and construction, which, you know, luckily, the model can weather that storm. It's not, you know, not that we want expenses to go up, but it is for the time being. Will it come down in the -- in time? Hopefully. But, you know, time will tell.\n\nWe don't really have a crystal ball on that one. But -- so a lot of things about around that type of stuff. But all in all, it was -- people were excited to talk about the future. You know, the pandemic is now behind us, it seems like, and everybody's thinking about how to get back on track, but looking at real estate and driving marketing and sales and membership back to where it was, and we're well on our way today, which is great.\n\nSo, they're, you know, bullish and excited to get back to business here that just definitely be greater from the inflationary cost when the build-out and construction came down, I would think it'd just add more fuel to the fire.\n\nUnknown speaker\n\nGot it. Just to follow up on that, talking about real estate, like, is there anything new in terms of like store formats or anything that makes sense to consider given the changing trends and the kind of frequency of visitations? Have you guys revisited that, or like were there any conversations with the franchisees in terms of the whitespace going ahead when it comes to the format of the books?\n\nChris Rondeau -- Chief Executive Officer\n\nI think the only thing that we're looking at now, preliminarily, but looking at a lot of data to look at is the change in our membership base. If you go back pre-COVID, Gen Z were our smallest segment of our member base. The next being the boomer, boomer-plus generation, which is boomer and silent. And today, they're our second largest part of our member base, believe it or not.\n\nSo, it's grown substantially over the last three years. So, we're paying attention now just to look at some of their utilization of what they're using in the facilities and is there some retooling slightly of just our equipment makeup. You know, is it ellipticals or is it treadmills or is it kettlebells and different functional training stuff, which functional training is definitely something of the younger generation. So, just paying attention to some of that as the makeup of our base changes.\n\nBut as far as size of box, no, I think that'd be about the same but maybe just retooling of inside the four walls.\n\nUnknown speaker\n\nThanks for this, Chris.\n\nChris Rondeau -- Chief Executive Officer\n\nVery welcome.\n\nOperator\n\nOur next question comes from Joe Altobello with Raymond James. Joe, please go ahead.\n\nJoe Altobello -- Raymond James -- Analyst\n\nThanks. Hey, guys. Good morning. Just want to go back to the HVAC shortage situation.\n\nI guess, first, is there an opportunity to find alternate suppliers outside of China? And secondly, could it actually benefit your store openings next year, given the shift in timing from this year and the assumption, obviously, that it gradually gets better?\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah. Hey, Joe, it's Tom. I'll take that. So, we -- we're in contact with the large suppliers, you know, Carrier, Trane, and so on.\n\nAnd I think we're doing all that we can to get, you know, our fair share -- more than our fair share of the -- of that. The problem is, unlike with equipment, we don't have a real preferred supplier relationship there. It's something we're looking into. But, -- so, you know, we are opening stores.\n\nWe -- it's not like there are none. There's just not as many as we need. And we've done all that we can to try to secure equipment in advance. Many of our franchisees, as we've talked to them, are actually, you know, looking to refurb or keep the equipment there if they can via code and just wait until more supplies are available and then replace it.\n\nThey tend to like to replace it all at once so they don't have to worry about, you know, going back in and doing it a year or two later. So, I'd say we're doing everything possible as the franchisor and working with our franchisees and with the suppliers to secure what we can. It's just, you know, the demand exceeds the supply. And I know we're not alone.\n\nWe're hearing it from other multiunit folks trying to open up new units. So, I wish I had a better answer on when it will end. It's not a forever thing for sure. It's just we're not sure exactly when it returns back to normal, as I said previously.\n\nJoe Altobello -- Raymond James -- Analyst\n\nOK. Understood. Just maybe the follow-up on that. Curious, you guys haven't done an Investor Day in quite some time.\n\nMaybe kind of preview for us what we should expect to hear next week.\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. It's going to be great to bring, you know, bring a team out. Usually, all you really hear from is me and Tom and, previously, Dorvin. So, it's great to bring our team out and talk about a lot of our different strategies and endeavors we're on with each of the departments, whether it's digital and data and the generational trend.\n\nWe'll share a lot of what we're seeing and historically what we've seen other grown, as well as marketing in gym and so on. So, it'll be a lot of the team there, talking about where we've been. You know, a lot of the people, a lot of the -- even current investors haven't really heard the story from back in the IPO days and the last 30-year history, what got us here, what's made us be successful and going through many ups and downs and why we're still here today after COVID with no bruises. So -- but a lot of it will be strategies, future-looking plans that we're working on, and much like the -- you saw my remarks on the Amazon Halo partnership we're in the middle of right now.\n\nWe just started yesterday. Just a lot of exciting things that doors that are opening up here with the size and scale and coming out of COVID and to highlight our own health and wellness is at an all-time high, I think, from not only just members but also partnerships like this.\n\nJoe Altobello -- Raymond James -- Analyst\n\nGot it. Thank you, guys.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you.\n\nTom Fitzgerald -- Chief Financial Officer\n\nAll right.\n\nOperator\n\nOur next question is from Alex Perry with Bank of America. Alex, your line is open.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking my questions here. Just first, I just wanted to square away through the membership numbers from the quarter. So, you're at about 100K net new joins in the quarter.\n\nYou said churn was lower than 2019. You had 300K new joins from High School Summer Pass compared to about 65K in 2019. But you sort of added the same amount of members quarter over quarter compared to 2019. So, what would sort of be the delta if we sort of compare, you know, the quarter-over-quarter join versus 2019? Thanks.\n\nChris Rondeau -- Chief Executive Officer\n\nI believe that -- well, I think the 300,000 is really from the beginning of the program, which was in May.\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nGotcha. OK. \n\nChris Rondeau -- Chief Executive Officer\n\n[Inaudible]\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nOh, gotcha. So, you just added the -- OK. So, you added the high school summer participants earlier this year compared to 2019. Gotcha.\n\nAnd then -- OK, that makes sense. And then my second question was, can you just talk about the health of the franchisee base and their willingness to open in the rising rate environment here? You know, sort of once we get back to that sort of 200-plus algorithm, is the only thing restraining that, you know, HVAC right now or, you know, how are you sort of seeing sort of the overall health and you mentioned build-out costs, but, you know, the rising -- you know, how are you sort of thinking about the rising rate environment? Thanks.\n\nChris Rondeau -- Chief Executive Officer\n\nSo, I'll hit on the inflation stuff and have Tom talking about interest rates stuff. The -- you know, what we don't really know quite yet, Alex, is that, you know, every year, franchisees are required open a certain number of units contractually under their area development agreements. But a lot of developers, you know, pre-COVID were opening ahead of their schedule, right? So, what we're not sure of now is with the cost -- the rising cost or risen costs of build-outs is that will franchisees open up a, you know, two or three units themselves that really aren't required to open into for future years? Or do they want to wait until maybe costs come down then open them? You know, so we just don't know if they're going to open ahead of their schedules, you know, here go forward until cost come down or maybe they want to wait to open future ones when they do come down. So, that's just the part we really don't know, their appetite for opening ones early and that side of things.\n\nBut Tom can answer the interest rates.\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah. Alex, I think the, you know, interest rates going up isn't helpful, but I'd still think on a relative basis the returns as we talk to our franchisees, and we've talked to our largest franchisees here, top 30 as we do every year. We've completed almost all of them now. You know, no one's really saying rising interest rates are holding them back from building.\n\nA lot of the stores are funded just from the cash flows of the business. And frankly, a lot of the PE folks don't take money out of the business. They plow the money back in. So, that's -- you know, there's a fair amount of momentum for those new store builds.\n\nAnd I think what Chris said is right. You know, the costs are definitely higher. But as we've looked at commodity costs and even shipping costs, you know, I forget the numbers up the top of my head, but the cost of moving a can from Asia was, you know, a few thousand. I don't want to -- you know, high-teen thousands, and now it's back even below where it was pre-COVID.\n\nSo, these things are moving around quite a bit. So, we've heard from some franchisees that time is their friend. I'd say the other thing that's very encouraging on the development side is as we've talked to a number of these larger franchisees and we, you know, talk about their financials, a lot of their mature store have returned or are very close to the pre-COVID profit levels. So, you know, while membership still may be trailing a little bit here in there, depending on their geography, the continued increase in Black Card mix and the recent Black Card pricing will continue to improve margins.\n\nAnd I'd say the last thing on the inflation side, there is a lot of talk about wage inflation. You know, that has really slowed down quite a bit. And as we've talked about, you know, even with wage inflation and in some markets being, you know, fairly considerable, one good year of same-store sales growth because of our model and low labor costs really offsets the impact, and margins basically returned back to where they were before the wage inflation after one year of mid-single-digit same-store sales increase. So -- anyway, I hope that kind of rounds out the picture for you.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nYeah, that's perfect. Best of luck going forward.\n\nChris Rondeau -- Chief Executive Officer\n\nThanks, Alex.\n\nOperator\n\nOur next question is from Warren Cheng with Evercore ISI. Please go ahead, Warren.\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nHey, good morning. My first question, I know this is sort of a seasonal low period for joins, but do you have data on where your new members are coming from? Are you seeing any uptick in members coming from other gyms or higher-priced gyms?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, from what we've seen from closed gyms is a little less than 1% from coming from closure. Twenty-five percent of our joins now are rejoins still, and almost 40% of our members are still first-time gym members. So, not too much has changed there. But we don't really -- we haven't really seen or heard of anything coming from higher-priced gyms.\n\nAnecdotally, I'm sure it's happening from people trading down. And If I go back to 1999, 2000, the dot com bomb went off, and it's only back then we sort of having -- we only have four clubs back then, but we saw it and it varies back then as well. But I'm sure it's happening and the people get more cost-conscious of what they're spending money on. And as many people have longer multipurpose clubs, you realize you don't use the rock wall or the pool, then why pay for it? So, it's probably something that's in our favor.\n\nWe had some great interest sales back in that era, late '90s.\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nThat's very helpful. My second question, I just wanted to ask a -- about the Amazon Halo collaboration. Is there any back-end integration, well, with the Halo, you're on a data-sharing basis or integration with your own Planet Fitness app? We can kind of tap into that activity tracking data.\n\nChris Rondeau -- Chief Executive Officer\n\nNot yet, but that's -- this part of the plan is to have, you know, Halo or other wearables also be talking to the app and have the data flow. But strictly right now where it's basically just a free Halo with any Black Card purchase, zero enrollment, 24.99 a month and the Halo is free for the first year. And then after that, they -- if they want to continue with it, they go and pay Amazon there. They're 399 or 349.\n\nBut it was a free one-year membership with the Halo as well.\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nGot it. Thank you. Good luck.\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, thank you.\n\nOperator\n\nOur next question is from Max Rakhlenko with Cowen and Co. Max, your line is open.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGreat. Thanks a lot and congrats, guys. So, first, Gerry feels like it's going to be a very important season for you following some of last -- some of this year's challenges. So, just curious, how do you feel about your readiness heading into the season and what do you plan to do differently next year compared to both this year, as well as the pre-pandemic years?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, this year, we have our annual New Year's Eve celebration here to kick it off in Times Square. This will be our eighth year and the longest-running sponsor of Times Square. But the normal integration you see with our stage and hats and such and commercial that kicks off our January promotion, and then we'll normally do an extension toward the end of the month as well for this but -- and usually, we also push the $10 membership as that entry-level pricing throughout that commercial. The branding and messaging will be similar to what we've been doing this year, which is really about that post-workout glow, the feel-good feeling, the mental health benefits of exercise as opposed to the general thought that people think about the waistline, right? So, we're going to continue with that theme.\n\nOne of that might be a little different this year is going to lead up to some last week of December promo, end-of-the-year special before we go into that January push. So, little bit different timing in that one where normally December is a mid-month flash sale, so a little push to the end as opposed to the middle of the month. Besides that, nothing out of the ordinary, but just more of the same. But I think it's going to be -- you know, it's quite amazing.\n\nI think it'll be the first quarter in four years that, you know, hopefully, will not be interrupted by anything. So, I think it should be a real good one for us.\n\nTom Fitzgerald -- Chief Financial Officer\n\nAnd, Max, it's Tom.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGot it.\n\nTom Fitzgerald -- Chief Financial Officer\n\nOne thing to add there. I think our agencies have transitioned on a -- across our franchise system away from publicists and to one of the two existing agencies that we've talked about. So, in our discussions with franchisees, they're very settled and happy about where they are with their agency and very confident looking forward that the execution will be back to what they were used to. So -- and we're also feeling very good about reconnecting with Barkley, you know, strategically on the creative and also working with us as our agency of record for now.\n\nSo, compared to where we were several months ago, we feel like we're on terra firma here when it comes to agency.\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. And I think one I want to add, too, is, as you know, Max, in marketing flywheel, we have -- we're going into this first quarter with once again the largest member base we've ever had, which is just more marketing goals. So -- and I think if you go back even pre-pandemic, you couldn't even join in the Planet Fitness app. So, you know, that's in our favor with marketing and have an uninterrupted first quarter.\n\nNow, we expect a special first quarter.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nAwesome. That's great. Appreciate all the color on that. And then separately, just congrats on appointing Jennifer Simmons to corporate club -- club's president.\n\nShe's very well deserved. Chris, what are Jennifer's top priorities today, and how's the integration of Sunshine going? And then what can you share about just some of the best practices that you're seeing that can be translated to the rest of the portfolio?\n\nChris Rondeau -- Chief Executive Officer\n\nSure. Yeah. She really helped build up our strategic and data analytics here in the business, and most, all our decisions here with the franchise system, its marketing, size, the box, demographics, means a lot of this will come from data that she's put together that improves our best practices. So, to have her influence our corporate store fleet of 200-plus stores of these now and growing it with her background is going to be kind of the perfect storm, I think, in a lot of great ways.\n\nSo, I'm excited to have her take over that fleet, along with Mary, who's the VP of ops down there; and Scott, who's been in the marketing position down there. They've been there in the Sunshine that we brought on board. And I think it's important to note that with our same-store sales of 8.6% system -- I mean 8.2% systemwide, that our corporate store legacy fleet, right, is where [Inaudible] we call, Max, our legacy fleet because they're our oldest, most mature markets, you know, back from 30 years ago. We don't have a lot of new store builds in the legacy fleet that influenced same-store sales.\n\nSo, this is like the first couple of quarters here with their influence that our corporate fleet has outpaced the same-store sales of the system, which has never happened. So, there's no doubt there are some best practices from our marketing and operational storefront that they have already put in place in our legacy fleet that are having influence. So, really great news there. And with Jen's support now down there as well in Orlando with their home offices, I expect some really good things.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGot it. That's very helpful. Best regards, and I'll look forward to the Analyst Day.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you.\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah, thanks, Max.\n\nOperator\n\nOur next question comes from Chris O'Cull with Stifel. Please go ahead, Chris.\n\nUnknown speaker\n\nGreat. Thanks, guys. This is Patrick on for Chris. Good morning.\n\nYou know, Chris, I appreciate the all comments. Hey. I appreciate all the comments around the supply chain constraints and development. But I do want to ask just one follow-up, if we step back from all of that, can you just give us a sense of what's in the pipeline today in terms of projects and whether you're seeing the number of projects in that pipeline grow, you know, over the last six to 12 months or so relative to where it was?\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah. Hey, Patrick, it's Tom. I'll take that. You know, I think what you're getting at is sort of the outlook for 2023.\n\nAnd we'll talk about that. We really don't talk about where things are in the flow and in the pipeline. But, you know, I kind of come back to what Chris was saying. You know, franchisees absolutely know what those obligations are they have to build.\n\nThe returns are still, you know, very strong. We've had new folks PE come in and invest in some of our larger franchises here recently, you know, knowing that the cost to build are up and, you know, who knows how long they stay up, but still aggressively looking to build because the returns, as they tell us, are still relatively better than anything they see. So, while there might be a slight step back because of -- on the ROI because of the higher cost to build, you know, we don't see it really diminishing the appetite nor the -- they know the requirement is there. So, we'll certainly talk more about, you know, where this all looks for 2023 as we normally do when we provide that outlook on our year-end call.\n\nUnknown speaker\n\nGot it. That's helpful. And then, Tom, I was hoping you could provide just a little bit more color on the relative contribution to the corporate store margin that the legacy store portfolio had. I know Chris just mentioned that, you know, the comps are really strong in that segment of the corporate store portfolio this quarter.\n\nBut, you know, to what extent have you seen the membership levels continue to recover in those gyms, sort of excluding the higher margin performance in the Sunshine units? And how should we be thinking about that heading into 4Q and then in the next year in terms of the trajectory of the corporate store margin?\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah, it's a good question. And I think, you know, the good news is, as Chris said, the stronger same-store sales from our legacy markets will certainly -- given our model and the largely fixed cost nature of it will flow to the bottom line and continue to enhance those legacy store margins from a four-wall standpoint. So, all that is very strong. And Sunshine, you know, also, they continue to perform.\n\nAnd you might remember, Patrick, we talked about at the time of the acquisition, you know, pre-COVID, the Sunshine mature stores were several hundred basis points higher in four-wall EBITDA margin than our legacy stores, primarily because of the markets they are in, you know, lower cost to build, lower cost to operate. And so, that's remaining intact. But as comps, you know, continue to drive higher AUVs and those dollars flow to the bottom line, $0.80-plus on the dollar, you know, both sets of stores' margins should continue to increase. And I'd say the other piece that we talked about year on year with Sunshine is they had a full -- more of a full team there leading that unit where we had more of a hybrid approach from an SG&A standpoint, for lack of a better term.\n\nAnd now that that is fully incorporated into our run rate, you know, that might have been a little bit of a headwind on a margin basis but won't be going forward as we leverage that because sales will grow faster than the SG&A.\n\nUnknown speaker\n\nGot it. Thanks, guys.\n\nOperator\n\nOur next question is from Jonathan Komp from Baird. Jonathan, your line is open.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nYeah. Hi. Thank you. Good morning.\n\nI'll ask one more question on units, and I'm sure we'll have more questions next week, too. But I guess, big picture, if you don't get back to opening 200 units a year on the franchise side, should that be viewed as any sign that the long-term potential is not as large or as good as you thought it was pre-COVID? And maybe on the company stores, are you planning any slowdown in the company growth just given the inflation challenges with construction?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. I don't see -- yeah, I don't -- you know, we saw over a thousand the pipeline, Jon, community area development agreements with the franchisees on top of the 2,300-plus that are open today. And as we've talked about in the past, you know, the franchisees, their territory that they have undeveloped is, you know, almost as valuable as the ones they have that are developed, right? And that's where a lot of the value of their business comes from is their units along with the runway. So, you know, they never want to lose their runway from not developing and have it contractually taken away from them, which then would resell to another franchisee that's going to build it.\n\nSo, I think the big question that they mentioned earlier, we're not sure if they didn't want to open ahead of schedule just because of the cost of opening stores right now is they want to wait and see if it comes down in a year or two because they would sometimes, Jon, open up units that maybe weren't committed until, you know, here, right now, it's 2022. They might open it up 2023, '24, and '25 in the same year, right? So, they might just kind of slow down slightly so that you fulfill contractually but not open ahead of schedule. So, you know, whether we get back to 200, you know, or we get back to 260 like we did in 2019, I think it might be just a little bit of hesitation to go, you know, open up, you know, 20% more units than they're required to because of that. So, you know, still a lot of units to be open and a lot of contractual units to be open.\n\nSo, it'll push a lot of openings each year. Just hard to say if we go from, you know, 200 to 260 to 300 or are we going to be a slow ramp until costs come down?\n\nTom Fitzgerald -- Chief Financial Officer\n\nAnd, Jon, on the corporate side, I mean, as you know, part of the attraction of the Sunshine acquisition was not only the current portfolio they had and the profitability and the team that they had, but also the pipeline. And so, in addition to the, you know, the opportunities in our legacy markets, we really like the ROI opportunities for the new stores in the Sunshine territory. So, we do not anticipate slowing down corporate store development. We want to maintain roughly our 10% penetration, so we would look to grow with the system.\n\nIn any given year, it might be a little bit ahead, a little bit behind just based on real estate opportunities and what's happening, you know, side by side. But our intent strategically is to stay around the 10%.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nYeah, that's great. And then just one follow-up on pricing. I think year over year, you saw maybe a little less increase in the Black Card penetration. So, any drivers behind that? And are you seeing any pushback on the higher Black Card monthly pricing? And then any decision on annual pricing and just trying to think about how much pricing benefit you might see for new units going into 2023?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, we'll say that slight pullback in Black Card acquisition this quarter was mostly just from the increase in the $10-a-month High School Summer Pass teens converting into. So, just drove a little bit of a slight decrease from the Black Card acquisition this quarter but wasn't related to the pricing on the Black Card itself. The acquisition of those -- of just general off-sale period was normal. Actually, it was slightly even better, believe it or not, which is interesting because this is the first time we've raised the Black Card price, which is the third time we've done it.\n\nBut it was the first time we've done it where we didn't see a decrease -- initial decrease in Black Card acquisition for a couple of months before it rebounded. So, really interesting that even though with the $2 increase, we saw an increase in acquisition, just that the teens actually drove it down this quarter.\n\nTom Fitzgerald -- Chief Financial Officer\n\nAnd, Jon, we said on the call that the Black Card, since the rate increase, were still outperforming the test results that we have.\n\nChris Rondeau -- Chief Executive Officer\n\nAnd I don't see -- as far as I think price increase in general, I don't see that $10 changing, make that still, as we've always talked about, that kind of get you off the couch price. And I think it's just an amazing business model where we advertise 10, generally speaking, and people come in and when they realize the benefits, they end up taking the Black Card, you know, in that 50% range. So, it's a great curiosity price because people are interested in checking it out. And then we hope we get them to convert upwards.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nGreat. That's helpful. Thanks again.\n\nChris Rondeau -- Chief Executive Officer\n\nThanks, Jon.\n\nTom Fitzgerald -- Chief Financial Officer\n\nThanks, Jon.\n\nOperator\n\nOur next question comes from the line of Simeon Siegel with BMO Capital Markets. Please go ahead, Simeon. Your line is open.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nThanks. Hey, guys. Hope you're all doing well this quarter.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nSo, Chris, you've had Sunshine for a bit now, and you're seeing the full pop. I needed that recognition. Just any learnings or changes to how you're thinking about long-term corporate versus franchise numbers going forward? And then just, Tom, can you -- sorry, if I missed this, can you just remind us how long the NAF expenses should outweigh the NAF revenues? And any help on what that discrepancy is during that time? Thank you.\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, I think the times -- the growing economy that may gear. I think we want to say that kind of the center range that we relay when we bought Sunshine. So, as a fleet grows as we continue to build corporate stores in all our markets, the legacy markets, as well as the Sunshine markets, and probably, you know, any smaller tuck-into franchises that come up for sale in and around our current locations that we're in, right? So, anything in that southeast part of the country or northeast where we have most of our corporate stores are as smaller franchises as they come for sale for like tuck them in. But I think it's -- you know, I think leveraging their ops and some of their marketing techniques that they've put in place.\n\nAs I just said there, our legacy stores' same-store sales are ahead of systems, which just never happened. So, it's a great influence there that they're having in the system, which is great. I think, now with Jen in the leadership down there, with the rest of the team, I look for, first, really good things that are happening and continue to build ground-up stores as well there. So, the same plan, but I think probably a better outlook, I think, in the future.\n\nTom Fitzgerald -- Chief Financial Officer\n\nAnd, Simeon, on the NAF side, you know, pre-COVID, we always kind of balanced what we spent with what we collected. And then during COVID, we decided to make some unilateral moves where we spent more than we collected. And then coming into this year, we were intending to be sort of back to where we were historically. But I think with all the impact of the omicron variant in January during the peak join season, the fits and starts, frankly, that we had Publicis and some of the things that we ended up having to pay for that we thought, you know, part of a longer-term contract would have been free really changed the dynamic there.\n\nAnd we didn't -- we thought that was appropriate for us to absorb to where NAF will be greater than -- NAF expense will be greater than collections. You know, I think it's 7.3 year to date, on track to be right around 10 million full year. Our intent, as Chris said, you know, assuming COVID is behind us and we get back to a more normal Q1 in January, which certainly looks like it will be the case compared to what we've seen here in the last couple of years, our intent would be for NAF collections and expense to match up as they did pre-COVID.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks a lot, guys. Best of luck ahead and looking forward to seeing you next week.\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah. Likewise.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you. Thank you.\n\nOperator\n\nOur next question is from John Heinbockel with Guggenheim. Please go ahead, John.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nHey, Chris, let me start with what is your current thought on national versus local, or I guess I think the idea was maybe eventually you would do more national, less local. But if the local is improved, right, and tweaked, you know, do you more -- do you move more in a national direction? And then I think -- that's question one. And then the other part of that, right, was maybe that would pave the way for a royalty rate increase down the road. Are we quite a ways away from that, particularly given the cost increases that franchisees are absorbing to get a club open?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, I think it's a good question, John, and I think I've mentioned it in the past, but if it wasn't for COVID, you know, we have 53 straight quarters of positive comps leading into it. And we were probably at a point where reasonable loyalty probably would have been in the card. But actually, now coming out of COVID, and we're not 100% restored and back to where they were, and there's some, you know, payroll expense increases, some of these, and operational expense. So, you know, even on margins that they returned to close or pass where they were then it definitely is a topic of discussion, I believe.\n\nSo, we're not quite there. But I believe, you know, we've seen the same-store sales. And as, you know, the flow through to that is a matter of time. As far as the lap, I think a couple more, you know, at least a year, maybe two with Zimmerman, Moroch, and Barkley now as our agency of record and now collecting the data.\n\nWe just had our big annual October sale, as I'm sure you saw. We're going to have a postmortem now every sale in all three agencies and get in the room, we're all going to go over at most outperforming markets and mostly performing markets and then boiled down exactly reasons why and what media mix and spend they did so that we can now have that to teach and show all the Zs what to do for the next sale, you know. And then -- and that would be refined every time we do this, right? We'll learn something every time. And I think as we get there, we end up understanding the mix better and make the spend more efficient, which then leads us to where we just put more money in national and then pave the way so it's easier and the franchisees have way about on their own end, you know, and just maybe moving some of that over.\n\nAnd now, the efficiency goes better. Perfect storm would be that the 9% doesn't have to be 9% anymore, you know. And, you know, the 3,000 to 4,000 store reopened, does that really need to be 9%? Maybe not. So, that just gives us more opportunity for a royalty increase as well.\n\nAnd it's the same dollars outside of the four wall that the franchisee pays, which would really be great. You know. So, I think it's just a matter of time. I believe we get there.\n\nIt's just a matter of how soon.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nAnd maybe secondly, what's your thought now on pace, timing, right, and geography of international expansion, right? I -- you know, do you want to step it up? And I guess it would be greenfield Asia would be the focus initially.\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, I think, you know -- I think, as you have talked about in the past, kind of a hybrid approach, we didn't really have an international team per se. It was just a development team here and ops team here, you know, doing a country a year, right? You know, we've yet to go anywhere that didn't really work. You know, Mexico's been phenomenal, of course. Australian, as well as Toronto.\n\nI mean, they all average more members than, you know, Mexico where store open three or four times the members of the U.S. store. Panama has done great. Australia's done great.\n\nNew Zealand is going to be open for store this coming year. So, on pricing, now, putting -- we're going to look to put an international team together that focuses solely on just international and begin to build that team out. And, you know, I don't think it would be normal for us to now look at doing two or three countries a year. You know, I think some will have to be creative and whether it be an acquisition of a brand, you know.\n\nAs you know, in Europe, there's a lot of big ones. And it makes sense for somebody to go one at a time what we acquire. Asia, on the other hand, Japan specifically, there's not really any large scale, low-cost provider that -- therefore, it doesn't make sense to go in Planet and start to build our stores. So, I think you'll see more focus and probably see more than, you know, if I see more two or three possibly a year as opposed to one.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nThank you.\n\nChris Rondeau -- Chief Executive Officer\n\nThanks, John.\n\nTom Fitzgerald -- Chief Financial Officer\n\nThanks, John.\n\nOperator\n\nA final question today comes from Paul Golding with Macquarie Capital. Paul, your line is open.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nThanks so much and congrats on the quarter. I wanted to talk a bit more about Black Card. I mean, in the past, you've noted that reciprocity was the biggest benefit, and I was wondering how that trend has evolved sort of post-COVID now and with maybe more hybrid work and how PF plus is also factoring in given the inclusion of the platform in Black Card now and any engagement metrics around that? Thanks\n\nChris Rondeau -- Chief Executive Officer\n\nThis is Chris. We have -- you know, the reciprocity is still the most used feature by far, even with some of the either work-from-home or hybrid approach. We haven't seen, you know, these fall off at all on the reciprocity side thing. Second most popular is the guest privileges, strong second.\n\nSo, you bring a guest free to work out with you. And all the others are pretty relatively small, whether it's hybrids -- I mean, where it's the hybrid massage beds or tanning or the general usage. It's all fairly small in that sense. The other ones, the reciprocity as well.\n\nThe Black Card amenities. I mean, the reciprocity and the guest is definitely the most used by far. You know, it's all bundled, so it's really hard to see what is driving the Black Card acquisition sale. You know, is it the reciprocity or is it the digital? We only -- we have very few 5.99 digital subscribers.\n\nBut the interesting thing is the ones that do, more than half of them end up becoming a bricks and mortar after the fact. So, it's -- you know, it's very few of them. When they do it, they end up being kind of a gateway into the bricks and mortar down the road. So, it is converting people over, but it's a very small number in that sense.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nGot it. And then in terms of the Amazon Halo offering, is there any opportunity there that you're taking advantage of cross-selling or cross-marketing, or are you getting any sort of media collateral from them? And what are the opportunities there?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah, it's not something we can disclose how the partnership is working. But they're really great to work with, first off. And this is the beginning. Hopefully, if all goes well with the sales, probably going to be the beginning of a lot of other stuff we can do in the future with them.\n\nWe haven't -- or no one's really sold gym memberships on Amazon yet, so if there was a way to do that, that'll be something that'll be pretty interesting to understand. But we haven't crossed that bridge at all. But I think it's just the beginning of a hopefully a long-term relationship granted that those sale goes well this year. But what's really good about it is if it does form to work, as you probably seen or know, we had to do a dollar down or zero down during a promotion.\n\nYou know, where do you go from there, right? Unless we pay them to join, it doesn't get any -- can't get any cheaper, right? And at 10 bucks a month. But, you know, I think when you start giving stuff away like this, it is like paying them to join. So, hopefully, this could be the beginning of understanding and learning way to drive volume otherwise -- other than just going to, you know, normalcy.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nGreat. Thanks a lot, Chris.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThat is all the questions we have for today. I'll now turn the call over to CEO Chris Rondeau for concluding remarks.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you, everybody, for joining us today, and hopefully, get to join us at the Investor Day next week. Very excited to wrap up fourth quarter here, as well as how Halo promotion goes. Times Square kick-off here for New Year's Eve and an uninterrupted great first quarter. So, hope to see you all next week.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStacey Caravella -- Investor Relations\n\nChris Rondeau -- Chief Executive Officer\n\nTom Fitzgerald -- Chief Financial Officer\n\nRandy Konik -- Jefferies -- Analyst\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nUnknown speaker\n\nJoe Altobello -- Raymond James -- Analyst\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nWarren Cheng -- Evercore ISI -- Analyst\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nPaul Golding -- Macquarie Group -- Analyst\n\nMore PLNT analysis\n\nAll earnings call transcripts"
}