{
  "companyName": "Crown Castle",
  "companyTicker": "CCI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/crown-castle-cci-q3-2022-earnings-call-transcript/",
  "content": "Crown Castle (CCI -2.00%)\nQ3 2022 Earnings Call\nOct 20, 2022, 10:30 a.m. ET\n\nOperator\n\nGood day, everyone and welcome to the Crown Castle's Q3 2022 earnings call. As a reminder, today's call is being recorded. At this time, I would like to turn the conference over to Ben Lowe, senior VP of corporate finance. Please go ahead, sir.\n\nBen Lowe -- Senior Vice President, Corporate Finance\n\nGreat. Thank you, Melinda. And good morning, everyone. Thank you for joining us today as we discuss our third quarter 2022 results.\n\nWith me on the call this morning, are Jay Brown, Crown Castle's chief executive officer; and Dan Schlanger, Crown Castle's chief financial officer. To aid, the discussion, we have posted supplemental materials in the Investors section of our website at crowncastle.com that will be referenced throughout the call this morning. This conference call will contain forward-looking statements, which are subject to certain risks, uncertainties, and assumptions, and actual results may vary materially from those expected. Information about potential factors which could affect our results is available in the press release and the Risk Factors section of the company's SEC filings.\n\nOur statements are made as of today, October 20, 2022, and we assume no obligation to update any forward-looking statements. In addition, today's call includes discussions of certain non-GAAP financial measures. Tables reconciling these non-GAAP financial measures are available in the supplemental information package in the Investors section of the company's website at crowncastle.com. So with that, let me turn the call over to Jay.\n\nJay Brown -- Chief Executive Officer\n\nThanks, Ben and thank you, everyone, for joining us on the call this morning. As you saw from our third quarter results, and the 6.5% increase to our dividend, we are seeing the benefits of a strong leasing environment as we support our customers' growth initiatives with their deployment of 5G. With this increase, we have grown dividends per share at a compound annual growth rate of 9%, since we established our long-term growth target of 7% to 8% per year in 2017, returning over $10 billion or 20% of our current market capitalization to shareholders over that period of time. Our customers have focused on utilizing towers during their initial deployment of 5G, resulting in the second consecutive year of 6% organic revenue growth in our tower business as we continue to outpace the industry.\n\nWe expect this momentum to carry into 2023 with another year of solid organic growth of at least 5% for our tower business. In addition, we expect to double the rate of small cell deployments next year compared to the 5,000 nodes we expect to install this year to meet the growing demand for our customers, as 5G networks will require small cells at scale. For fiber solutions, we expect revenue to be flat in 2023 compared to 2022 as a result of several discrete items that Dan will discuss later. We expect revenue growth to return to approximately 3% by the end of the year.\n\nConsistent with what we have previously disclosed, we also expect the rationalization of a portion of Sprint's legacy network by T-Mobile to have some near-term impacts on our financial results, without altering our long-term growth potential of our strategy. We continue to believe the total impact of the Sprint network rationalization will be approximately $275 million of annualized churn, concluding in 2025. As I'll speak to in just a moment, I see tremendous opportunities ahead of us, giving us confidence in our ability to deliver on our long-term target of growing dividends 7% to 8% per year. However, with $225 million of remaining Sprint churn, and $140 million of additional run-rate interest expense, we expect dividend per share growth in 2024, and 2025, to be below our long-term target.\n\nLooking back over the last several decades in the wireless industry, we have experienced periods of network rationalization by our customers, following consolidation events. In each of those instances, we saw increased demand for our assets over time as our customers reinvested the synergies gained from those combinations back into their networks to further improve their competitive positions, and keep pace with wireless data growth. I expect we'll see a similar dynamic play out this time around. As such, over the long term, I believe our strategy and unmatched portfolio of 40,000 towers 115,000 small cells on air under contract and 85,000 route miles of fiber concentrated in top U.S.\n\nmarkets have positioned Crown Castle to deliver significant value to shareholders for many years to come. We are focused on the U.S. because we believe it represents the best market in the world for wireless infrastructure ownership when considering both growth and risk. The relative strength of the U.S.\n\nmarket has been clear to us during times of global economic prosperity. And I believe that gap and performance is widening further in current challenging macroeconomic environment. The operating conditions underlying our shared infrastructure model have been better in the U.S. than any other market in the world.\n\nWe have benefited over time from persistent growth and mobile data that has required hundreds of billions of dollars of network investment by our customers. As a result of the quality of the networks and the user experience enabled by this level of investment, U.S. consumers have used their wireless devices more and more, and have been willing and able to pay for that improving mobile experience. In turn, the wireless carriers have taken the higher cash flows generated from their customers and invested even more in the networks and the cycle continues.\n\nWhen we assess the global landscape for wireless infrastructure ownership, we do not see evidence of that same virtuous cycle in any other market. The combination of persistent growth and mobile data and the value we deliver to our customers by providing a low-cost shared infrastructure solution has enabled us to consistently generate growth through various macroeconomic cycles. Further, I believe our core value proposition of reducing the overall cost of deploying and operating communications networks is even more compelling for our customers in times of increasing capital costs. Adding to our positive view of the opportunity we have in the U.S., I believe we are still in the early stages of 5G development, providing a long runway of growth and demand for our comprehensive communications infrastructure, offering across towers small cells, and fiber.\n\nSimilar to other generational network upgrades, we expect 5G to drive sustained growth in our tower business as our customers add equipment to our 40,000 towers. We also believe 5G will be different as it will require the deployment of small cells at scale to increase the capacity and density of wireless networks, as more spectrum deployed across macro towers will not be sufficient to keep up with the growth in mobile data demand, as a result of the requirement to build out this denser network, we believe the duration and magnitude of 5G investment will likely exceed prior network investment cycles, further extending our long-term growth opportunity. With this view in mind, we have invested $6 billion of capital in high-capacity fiber and small cells that are concentrated in top U.S. markets.\n\nThat capital has a weighted average life of approximately five years, and is yielding more than 7% today. With more than 60,000 contracted small cell nodes in our backlog, including a record number of colocation nodes, we expect the yield to increase over time as we put those small cells on air. In 2023, we expect to double our small cell deployments, with over half of the nodes co-located on existing fiber. With the increased mix and colocation, we expect our net capex to increase by only 10% over 2022 levels, reflecting attractive incremental lease-up return.\n\nThe resulting incremental returns are consistent with our expectation for small cell co-location to drive two tenant system returns to low double-digit yields on invested capital, just like we have achieved and towers. As we proven out the value proposition for our tower assets over time, those assets now generate a yield on invested capital of approximately 12% with meaningful capacity to support additional growth. Looking at how well our overall strategy is performing, since 2017, we have increased our consolidated return on invested capital by 160 basis points to 9.5% and returned over $10 billion to shareholders through our dividend that has increased at a compound annual growth rate of 9%, while also investing $7 billion of capital into attractive assets we believe will generate returns well in excess of our cost of capital and contributed to dividend growth in the future. I believe that the combination highlights how compelling and differentiated our strategy is.\n\nWe provide investors with the most exposure to the development of next generation that works with our comprehensive offering of towers, small cells, and fiber, a pure play U.S. wireless infrastructure provider with exposure to the best growth and the lowest risk market, a compelling total return profile with a current yield of nearly 5%, and a long-term annual dividend growth target of 7% to 8% and the development of attractive new assets that we believe will extend our runway of growth and shareholder value creation. In the context of our 6.5% dividend per share growth this year, it is remarkable to consider that the underlay -- to consider the underlying strength of our business can absorb the significant headwinds of interest expense increases, and Sprint cancellations in the near term without disrupting the long-term growth of the business. I believe this durability of the underlying demand trends we see in the U.S.\n\nthat provides significant visibility into the anticipated future growth of our business, the deliberate decisions we have made to reduce the risks associated with our strategy, and our history of steady execution makes Crown Castle an excellent investment that will generate compelling returns over time. And with that, I'll turn the call over to Dan.\n\nDan Schlanger -- Chief Financial Officer\n\nThanks, Jay, and good morning, everyone. We delivered another solid quarter of results in the third quarter, as our customers are actively deploying 5G at scale. Our strong operating results this year are helping absorb the impact from higher interest rates, leaving our 2022 AFFO growth expectations unchanged. Looking ahead to 2023, we expect overall leasing activity to remain healthy, resulting in growth and cash flow flows that supports the 6.5% dividend increase we announced yesterday.\n\nBefore I walk through some of the moving pieces within the 2023 outlook, I want to briefly discuss the third quarter results. Turning to Page 4, core organic growth of more than 5% benefited from robust tower growth of 7% and included 4% small cell growth and 1% growth in fiber solutions. The strong top-line growth contributed to 10% growth in adjusted EBITDA and 5% growth in AFFO as our operating results were partially offset by higher interest expense. Turning to our outlook on Page 5, our expectations for 2022 remain unchanged and for 2023 we expect 4% site rental revenue growth, 3% adjusted EBITDA growth, and 4% AFFO growth.\n\nAs you saw on the earnings release, there are a few moving pieces within the 2023 outlook that are not typical. So let me spend a minute walking through those components. Consistent with what we previously disclosed, we expect T-Mobile to cancel a portion of their tower, small cell, and fiber leases over the next few years related to the consolidation of a legacy Sprint network. We expect to see an impact of this network rationalization in our financial results in 2023.\n\nAs Jay mentioned, we continue to expect total churn from the T-Mobile Sprint network consolidation to be approximately $275 million, consisting of tower churn of approximately $200 million recurring in 2025, as well as approximately $45 million of small cell churn and $30 million in fiber solutions over the next three years. As you saw in the press release, we expect a reduction of $30 million in small cell and fiber solutions run-rate revenue in 2023 from the Sprint cancellations. Based on our customer agreements, T-Mobile was obligated to pay the remaining contracted revenue on those sites at the time of cancellation, resulting expected cash payments of $165 million to 2023. Given the nature of the churn and the associated payment of accelerated future contracted revenue, and to make the comparisons more helpful, we've excluded the $135 million net benefit and 2023 from the organic growth comp group comparisons in the remainder of this discussion.\n\nTurning our focus to the fundamental trends we expect in 2023 on Page 6, we anticipate another year of solid tower growth, complemented by a doubling of our small cell activity, as we expect to install 10,000 nodes in 2023, up from 5,000 this year. With respect to fiber solutions, we expect underlying activity growth to be offset by items that contributed 2022 revenue that are not forecast to recur in 2023, as well as the rollover impact from approximately $10 million of Sprint churn that occurred in 2022. As a result of these discrete items, we expect fiber solutions revenue to be consistent with 2022 levels and believe the business will return to our previously discussed 3% per year revenue growth going forward. Putting those components together, we expect 2023 organic contribution to site rental buildings of approximately $360 million, or $225 million, excluding the $135 million net benefit from the Sprint cancellation, the $225 million of organic growth consists of 5% growth and towers, 8% growth in small cells and flat revenue and fiber solutions.\n\nTurning to Page 7, 2023 AFFO growth is expected to be $100 million to $145 million, which includes the $135 million net benefit of the Sprint cancellation, a $140 million increase in interest expense, and $20 million of cost increases above typical levels due to labor and other inflationary related expenses. The rapid rise in interest rates has accelerated the increase in interest expense we included in our long-term planning, causing some near-term headwinds, but not impacting our capital allocation decisions. We believe our investment grade balance sheet is well-positioned with 85% fixed-rate debt, a weighted average maturity of approximately nine years limited debt maturities through 2024, and more than $4.5 billion in available liquidity under our revolving credit facility. We ended the third quarter with 4.9 times debt-to-adjusted EBITDA and expect to remain around five times through 2023, as we plan to fund our discretionary capex with incremental debt capacity generated by growth in cash flows for full year 2023.\n\nTo that point, we expect our discretionary capex to increase in 2023 to approximately $1.4 billion to $1.5 billion from approximately $1.2 billion this year. Out of our total capital expenditures next year, approximately $300 million is expected to be spent in towers and $1.1 billion to $1.2 billion in our fiber segment. Consolidated capital expenditures, net of prepaid rent contributions, are expected to be approximately $1 billion in 2023, compared to $900 million this year. As Jay mentioned, a relatively small increase in net capital expenditures in 2023 demonstrates the benefits of our co-location model, even while we continue to invest in new assets that we believe will contribute to long-term growth.\n\nWrapping up, we're excited about the opportunity we see, as our customers continue to deploy 5G in the U.S. We believe focusing on the U.S. provides the highest risk-adjusted return for our shareholders, as our portfolio of towers, small cells and fiber provides unmatched exposure to the best market in the world for communication infrastructure ownership. Since we made significant investments in the small cell and fiber portion of our business in 2017, we have delivered 9% dividend per share growth while continuing to invest organically in new assets to take advantage of the opportunity ahead of us.\n\nThe ongoing 5G investment cycle and the persistent growth in mobile data demand, combined with the inherent durability of our business model and our low-risk balance sheet, provide us confidence in our ability to deliver on our long-term 7% to 8% dividend per share growth target and create a compelling total return opportunity consisting of current yield, and future growth. And with that, Melinda, I'd like to open the call to questions.\n\nOperator\n\nThank you, sir. [Operator instructions] And we'll take our first question from Simon Flannery of Morgan Stanley.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nGreat, thank you very much. Thanks for all that color. On the small cell business, you've got a large backlog here. Could you give us a little bit more color about pacing up the build and to what extent, there are supply chain issues that you need to take into account? And is it possible that you can take this rate above 10,000? I think in years past, there was a hope that it could continue to accelerate from these levels.\n\nAnd any updated thoughts on the demand side, given the rise of fixed wireless system more interest in densification, even then six or 12 months ago? Thank you.\n\nJay Brown -- Chief Executive Officer\n\nGood morning, Simon. Thanks for the questions. As we mentioned, Dan, and I think both mentioned in our comments, we would expect in 2023, we're going to double the number of nodes that we put on air compared to 2022, so seeing an acceleration from that. And then given the number of nodes that we have in the backlog and the significant, somewhat recent commitments that we received from Verizon and T-Mobile have 50,000 nodes to be put on air.\n\nIt certainly pretends and a continued acceleration as we go into 2024 and beyond. So that's what we currently have in the backlog. I think I would draw out from that a little bit and based on what we're seeing for the deployment of 5G and the densification, that's required in the networks, we think there's going to be a lot of demand for small cells, well beyond just what's currently in the backlog. Some of that is probably drawn from our experience as nodes or going on air and meeting the need in the network, solving -- the solving some of the gaps and covering some of the increase in data traffic that we're seeing discrete locations, in the network where small cells have been placed, and how well that works as a network strategy to reuse the spectrum on both macro sites and small cells.\n\nAnd then also our view of where data traffic is going to grow too, the combination of those two things both are actually experienced, and where we think traffic is going portends a continued increase in the overall number of nodes that are going to need to be built inside of these networks. Supply chain challenges have certainly occurred. I think our team has done a really good job working closely with the carriers to navigate through those supply chain challenges. I don't want to -- I don't want to sound like there are no challenges to that, because there have been numerous challenges, but our team has been able to navigate those without impacting our expectation of node builds.\n\nAnd as we sit here today, I don't think that will impact our ability to get to 10,000 or more nodes in 2023, as we put into our guidance. So I think that's what I would point to an answer to your question.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nNext, we'll hear from Jon Atkin of RBC.\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nThanks very much. I was interested in, if you can comment on your ability to adjust for higher CPI, either in your new contracts, new co-locations, or your amendments or even any provisions under your existing MOAs.\n\nJay Brown -- Chief Executive Officer\n\nYeah, Jon. Typically, in our revenues that are on the books currently, the vast majority of those revenues are fixed escalator and not CPI-based. I would note the same thing is true on the cost side of the equation, our largest costs being our ground leases, which also have a similar characteristic of a high percentage of those being fixed escalator. So for the majority of the current run-rate cash flows were fixed at both the revenue line and then down at the down -- down at the at the largest item that affects direct margins.\n\nThen on the balance sheet side, we obviously have more than 80% of the debt, that's fixed currently. So the current cash flow stream is largely fixed with regards to CPI and implications from inflationary pressure. As you think about the go forward, when we contract with customers, we're typically doing some level of three to five years of a framework under which they'll find new leases. So we're in the middle of that at any given point, and when we reach the natural end of those contracted periods of time with a customer that relates to new sites that they will go on, then we have the opportunity to think about OK, what will the appropriate escalation provisions be in that next set of contracts.\n\nAnd as we have in the past, we balance out the benefits of doing floating rate versus doing a fixed rate on those contracts.\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nAnd then just on small cells, given what you talked a little bit about the backlog which the conversion of that backlog seems to be kind of accelerating. Are we to assume that it will be more of a back-end weighted contribution to the top line for 2023 for small cells?\n\nJay Brown -- Chief Executive Officer\n\nYes. It will be back-end loaded during calendar year 2023. We will get the benefit of getting those nodes on air into the run rate as we go into 2024, but the actual work and the completion of those notes coming on air and then turning into cash-paying notes that will be back-end loaded in the calendar year.\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nAnd then given -- finally, just given the higher discretionary capex that you're projecting for 2023, any -- if you maybe just review a little bit, I know Dan mentioned this at the end, but kind of how you fund a dividend if it's going to stay at a similar level next year, sounds like you will need to kind of lever up using the revolver or how do we think about the sources of funding a similarly sized dividend for next year, if that's what the board decides?\n\nJay Brown -- Chief Executive Officer\n\nI just want to make sure I answer the question you're asking, are you referring to the dividend in 2024 or the dividend in 2023?\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\n'23.\n\nJay Brown -- Chief Executive Officer\n\nSo we thought about sizing the dividend. We did the same process that we do have done historically, and I'll go back to kind of 2017 at the end of '17 when we increased our targets to 7% to 8%. We look at the upcoming when we get to this time of year in the October timeframe. We look at the upcoming year and we look at what will the cash flow generation of the business be and then what do we expect the run rate of cash flows to be by the time we exit the year.\n\nSo the dividend that we size is the increase of 6.5% considers where do we think we're going to exit the next 12-month period of time as we roll around to October of next year and we look at the uplift that will occur in that run rate, and the dividend that we gave the 6.5% increase is size so that when we roll around to October, that's basically the run rate of the business. The other benefit that we got, the other thing that we're considering is what is the cash flow characteristic during that 12-month period of time. And in the case of the next 12 months, we're obviously benefiting from the payment of T-Mobile of the early cancellation fees that Dan referenced in his comment, which increased the cash flow during this calendar year. So those are the two considerations that we make when we're setting our dividend policy for the upcoming year.\n\nDan Schlanger -- Chief Financial Officer\n\nAnd so, Jon, just to put a point on that. We don't anticipate that we would fund any of that dividend with debt borrowings. That's from the operating cash flow of the business, as Jay mentioned, and that's how we size the dividend. That's how we think about sizing the dividend in any period.\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nAnd moving on to Ric Prentiss of Raymond James.\n\nRic Prentiss -- Raymond James -- Analyst\n\nHi. Good morning, everyone.\n\nJay Brown -- Chief Executive Officer\n\nGood morning, Ric.\n\nRic Prentiss -- Raymond James -- Analyst\n\nCouple of questions. First, on the churn front, it looks like based on '22 guidance, churns are going to step up sequentially from third quarter, fourth quarter. Anything special to call out there as far as what's driving that increase in insurance is that part of that fiber, Sprint T-Mobile thing?\n\nJay Brown -- Chief Executive Officer\n\nI don't think there is really a step up going in from the third quarter, the fourth quarter. And there's nothing going on that would increase the churn that we see in the business at all. That will likely be on the low end of our churn for 2022 as we end the year. So like I said, there's nothing going on the business that we see is increasing our churn at all.\n\nIt's pretty flat quarter over quarter.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. And then on the Sprint cancellation churn, $275 million expected to be total. Did I hear you Jay say talking about there's $225 million left in that? I was trying to read my notes fast early.\n\nJay Brown -- Chief Executive Officer\n\nYeah. That's a left going into 2024 and beyond, so we're going to realize some of that in 2023. So as we look into 2024, and I think what Jay was mentioning was thinking about the 2024 and 2025 dividend. So we're just sizing the amount that would be remaining at that point.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. Second round of questions is kind of around rates. What are you assuming for interest rates when we updated the guidance? We didn't have to change '22. But when you look at '23, what kind of rates are you assuming in there, just so we can kind of keep track of what the Fed actually does where rates have?\n\nJay Brown -- Chief Executive Officer\n\nWe have assumed at this point, the forward curve for rates as of right now, which does move around a bit, but if you just look at the forward curve, that's what we have in our assumptions.\n\nRic Prentiss -- Raymond James -- Analyst\n\nThat's something in the low 4% range, kind of.\n\nJay Brown -- Chief Executive Officer\n\nYeah, yes, ultimately. And like I said, it moves around a little bit, so low to mid-4s.\n\nRic Prentiss -- Raymond James -- Analyst\n\nOK. Last one, similar on the rate question. What are you hearing, if anything, from the carrier customers as far as is the debt market and interest rates doing anything to their capital spending or activity with you, any worry about we get the questions from investors about what happens if there's a recession? What are you hearing from the carrier customers as far as -- concerned about recession pressure or concerned about interest rates as far as their ability and desire to spend with you in the short term.\n\nDan Schlanger -- Chief Financial Officer\n\nWe have seen the carriers be remarkably consistent in their activity and focused on 5G deployment, and that has been our experience frankly through past economic cycles as well. The carriers, obviously, are well funded. They have the cash flow capabilities to continue to invest in 5G, and we haven't seen any change in the consumer behavior either. So I think the place to watch for that is really is the consumer behavior changing, it's not.\n\nIn fact, the consumer demand continues to grow, and as we -- as I mentioned, in my comments, consumer has been willing to pay for that improved and increased service. And so, we've seen the carrier investment cycle continue and at this point, I don't have any concern that we're going to see a pullback from that front on the carrier side. They all have multiyear plans that they've shared with us. And they've obviously made sizable commitments to us around that, around those deployment cycles.\n\nSo our teams are busy working with them closely on multiyear deployments. So don't expect to see a change in that demand profile.\n\nRic Prentiss -- Raymond James -- Analyst\n\nThanks, guys.\n\nOperator\n\nAnd next, we'll hear from Michael Rollins of Citi.\n\nMichael Rollins -- Citi -- Analyst\n\nThanks, and good morning. First, I'm curious if you can unpack the change from the tower leasing organic growth in '22 of about 6%, to about 5% in '23 and the stepped out in activity dollars. And within that context, if you can give us an update on the visibility that you have going forward in terms of what the shape of tower leasing, organic tower leasing, without the T-Mobile churn should look like? And I'll save one for the end, the follow-up.\n\nJay Brown -- Chief Executive Officer\n\nLet me just talk about a little bit about the environment, and then Dan can kind of walk through the numbers on the organic calculations. We're in this cycle is I made some comments around early in the cycle around 5G. And at the beginning part of every one of the technology upgrades that we've seen in the business over the years, as the carriers have gone from 2G to 3G, 3G to 4G, and now the same, we're seeing the same thing as the carriers go from 4G to 5G. They focus the early day investment on macro sites, the towers that they're already on in the places where they go through and they upgrade their network, add additional equipment to those sites that they're already on in order to accommodate the new technologies.\n\nOnce they do that overlay, then they go back and they start to focus on increasing the density of their network. And they've done that historically, just by going on towers that they were not on previously. What's unique about the 5G cycle relative to prior cycles is that a part of that network planning is not only going on macro sites but also utilizing small cells to increase the density of the network. So we're working with the carriers both on the tower side, the macro site side, as well as the small cell side to cover the increase in traffic that they're seeing, as well as the technology upgrades that that we're seeing.\n\nAnd we think there's a really long runway of growth on the tower side. Our view is we're going to be multiyear north of -- or about 5% growth on the tower side, and we'll continue to be really good and healthy demand for towers for an extended period of time. And we'll see that coupled with investment by the carriers on the small cells in order to increase the density.\n\nDan Schlanger -- Chief Financial Officer\n\nAnd, Mike, just -- we are moving from about 6% growth and 2022 to 5% growth in 2023. But as Jay said, we're excited about that, because we've been about 6% for a couple years now. And continuing on at 5% is a really good continuation of a long trend of growth. And what we look for is to try to stack really good years of growth year over year over year as opposed to have outsized growth in one year and then undersized in another.\n\nAnd this is just that type of trend playing out. And it puts us what we think is -- like we've talked about the last couple of years leading the industry the last couple of years, and staying within what is a relatively robust level of tower leasing growth of 5% to 6%. And as Jay said, we have a lot of visibility of that growth going forward. So you add all that together, and we're just -- we're excited about it.\n\nI think it's a great place to be.\n\nMichael Rollins -- Citi -- Analyst\n\nAnd just a follow-up. And I apologize, just a little bit more of a complicated setup, but I was looking at two different numbers in your supplemental. So I was looking at the midpoint of the revenue guidance. And I was looking at what you disclosed on the projected site rental buildings from tenant contracts that you gave over a multiyear period of time.\n\nAnd if I compare like for '23, I adjust it to make it apples-to-apples, take out straight line, take out prepaid pick up the one-time benefit. If I look at '23, what's implied in the guidance, it's about the midpoint, it's about 90 basis points higher than what that contracted tenant revenue number is later in this supplemental. But if I do the same thing historically, like last year, it was 200 basis points and for the couple of years before that, it was an average of almost 300 basis points. So, I apologize for that complicated setup of the question, is there something different about 2023, where you're expecting less incremental activity above the commitments that you have from customers? Or did you approach maybe guidance in a different way than you've done historically?\n\nJay Brown -- Chief Executive Officer\n\nYeah, Mike, thanks for the question. I think we can probably walk -- we could try to reconcile the numbers that you're talking about. But I think the big picture answer to your question is the way that we've contracted with customers and what's occurred over the last several years. We have a much higher percentage of our growth that has been contracted with customers as a result of the holistic agreements that we've signed with them.\n\nSo there's not a change in the way that we're thinking about doing the guidance or the aggressiveness or conservatism that's in our forecast for the year, but rather, you're seeing the benefit of the significant amount of contracted revenue that we have. Dan mentioned this a couple of times in his prepared remarks, but we're north of $40 billion of contracted customer commitments. So over a multiyear period of time, we've contracted that growth. So going back to the comments that I made and answer to your first question, we have a lot of visibility around that 5% plus growth, because it's so much of it is contracted.\n\nWe still have the benefit of -- the upside is uncapped, but we have a really solid view of where growth is. So I think what you're seeing when you go back and look at the billings, and you compare the historical, in each of the years that you laid out, when you look at the forecasted revenue compared to the amount that was in the buildings, those are going through past periods where we were adding some of these holistic agreements. So at each of those points, we may have had kind of no holistic agreements, all the way up to holistic agreements with several of our customers as we sit here today.\n\nMichael Rollins -- Citi -- Analyst\n\nThanks for that additional color.\n\nOperator\n\nDavid Barden with Bank of America has our next question.\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks so much. A couple if I could. I guess the first one was -- I guess I want to ask this question in the context of normalizing 2023 rather than maybe 2024.\n\nBut, Dan, I think during your comments, you mentioned that net of churn the fiber solutions businesses not going to grow or at least not expected to grow in '23. But you made the comment that we're not for some of the macroeconomic headwinds, you would expect to grow at the more normal long-term target of 3%. I was wondering if you could kind of maybe give us some color, as we kind of look at the other segments, small cells, presumably, losing the Sprint turn will help it on a normalized basis. And then in macro, obviously a little bit down from the 2021 level -- sorry, 2022 levels of growth guided in '23 if there is kind of wiggle room in quote unquote, more normal circumstances for that to maybe be better.\n\nAnd I guess the second question is, regarding to roughly flat prepaid rent amortization in '23 but that obviously is benefiting from a $50 million, a onetimer. And then at least on the forward-looking, prepaid rent amortization schedule that you put inside -- in number 18 in the supplement. It looks like it's going to drop down pretty substantially from there again in 2024. So looking at those offsets potential, normalized performance in the core business offset by decline in prepaid rent arborization, recognizing it's non-cash.\n\nBut how should we think about what the revenue and EBITDA trajectory might look like, on a normalized basis with those two forces opposing each other? Thanks.\n\nJay Brown -- Chief Executive Officer\n\nI'll take the normalized revenue growth question and Dan can speak to kind of some of your questions around prepaid. And I'll just stick through each of the business lines. And if I missed something that you're trying to reconcile, feel free to ask again that. But on the tower side, if you exclude the Sprint cancellations, the bulk of which we talked about, it's going to occur to us in 2025.\n\nIf you ignore that and just look at normalized activity, we think that normalized activity in the business is going to see churn of somewhere in the neighborhood of about 1% to 2%, just like our historical average has been. So there's nothing else occurring on the tower side that I would point to as the need to normalize other than removing the Sprint cancellations in a couple of years. And my comments before around the growth that we're seeing both the contracted growth and the opportunity for upside, gives us confidence that we think we'll be able to see organic growth in and above that kind of 5%, organic growth levels. I don't think there's anything else in those numbers, you really need to normalize in order to get the right run rate.\n\nOn the small cell side. We obviously talked about the churn and where that churn is going to hit. If you ignore the churn and get down to the normalized level, the one thing you have to adjust for is this significant rate of growth and the timing of that growth. So the number of nodes that we're going to turn on air next year, doubling obviously increases the activity, and the fact that the activity itself and when those nodes turn cash paying, being backend loaded.\n\nWhen you look at our contribution to the to the financial results, whether it's organic growth in terms of number of dollars, or you look at it on the face of the financial statements, you don't see the full effect of those 10,000 nodes, until as we roll into 2024, we get to the full run rate of those notes getting turned on air by the end of 2023. So you have to normalize for the activity and -- the doubling of the activity, as well as the back-end loading in order to get to a more normalized run rate of growth. On fiber solutions, as I mentioned in my comments, we think the revenue growth is going to be flat, that's a function of in part the churn activity that we saw this year, partly due to the Sprint cancellations that we'll see popping over into 2023. But by the time we get to the end of the year, when we get to kind of fourth quarter results and look backwards over a quarter over quarter meaning quarter 2023, compared to quarter 4 of 2022, we think we'll be back at that 3% growth that we've expected in the business, normalizing for all of the churn and the other items, we're seeing that level of activity currently in the business.\n\nSo we're not forecasting growth in activity as we get toward the back of the year. We're just looking at normal activity and removing all of the one-time items and that gets us back to growing. We think that'll be reflected in the results of growing at about 3% per year, which is our base expectation.\n\nDan Schlanger -- Chief Financial Officer\n\nOK. And Dave, I'll take the prepaid rent amortization. I think you've positioned it well. This year, there was -- if you looked at and going into 2023 at the tables in the supplements are looked like there was going to be a big drop off.\n\nThe table itself is just the book of business that we have at the time we put the table together. It's not a forecast. And the difference between those two concepts of the book of business in the forecast is as we get more prepaid or capital expenditures reimbursed to us from our customers as we build out any type of assets, either towers or small cells. We then amortize that additional prepaid rent that we receive over the life of the contract.\n\nAnd we don't project that out and put it into the table. The table is just what do we know as of the date that we put that table. And because of that, you will see a decline at times like this, like we see in the tower business specifically. And that decline will be offset by in 2023, whatever additional reimbursements -- capital reimbursements we get from our customers that will then be amortized over the life of those contracts.\n\nAnd typically speaking, the life of our contracts are in the range of 10 years. So that would be the only thing that would offset a reduction going from '22 into 2023 is the additional capital that we're going to get reimbursed for. And as I mentioned in my comments earlier, we think our total capital expenditures in 2023, will be about $1.4 billion to $1.5 billion. And the net capital expenditures will be about a $1 billion.\n\nSo that's about $450 million of capital that we anticipate will get back from our customers. And the amortization of that will add to the table. And as you look out going forward, we continue to do to have those additions over time as we get more reimbursements. But other than that, I think everything you said about the prepaid rent and the table was exactly right.\n\nAnd we do anticipate that there will be drop-offs, particularly in our tower business.\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And as we kind of think about -- I think the earlier question about the dividend and funding the dividend and how you think about it coming out of operating cash flow. Obviously, a lot of that cash flow coming this year is coming from the termination payments, $165 million midpoint from the Sprint situation. In the absence of those payments, being present, either you'd have to have had a smaller dividend growth, or you would have had to either get more aggressive on leverage to fund it, or use equity to fund it.\n\nCould you kind of walk us through your thought process on what if the Sprint termination payments didn't exist?\n\nJay Brown -- Chief Executive Officer\n\nSure. Let me just go back and start with how do we size the dividend, and then we can talk about the what-ifs. So we size the dividend each year, what we look at is what do we believe the cash flows in the business are going to grow over that subsequent 12-month period of time. And given the visibility that we have in the business, we have a really good view of what the growth is going to be over the year, because by this point, you know, as we talked about on the tower side 70% plus of the overall business that's largely contracted at this point.\n\nSo we have a really good view of that. On the small cell side. Similarly, those notes have been contracted. And we've been working on them.\n\nSo we have a good sense of when they're going to come on air. So that we start there with what do we believe, over the subsequent 12 months the growth in cash flows are going to be. And then what we look at secondly, is we look at what's the cash flow generation of the business over the next 12 months when we set the dividend policy. Historically, if you go back and look at go back to 2017, and roll that all the way forward through the conversation that we're having this morning, we have size that dividend between 96% and 99% of the expected cash flows in the business for that subsequent 12 months.\n\nAnd we did the exact same thing in this quarter as we're releasing the expectation for dividend growth and throughout 2023. So if we had gotten to this place, and there was a different set of circumstances, a different set of facts, and the cash flow generation were different, whether it was higher or lower, or the expected run rate of cash flows as we exited 2023 were higher or lower then our dividend would be higher or lower. We don't utilize the capital markets to fund our dividend. So if the cash flows of the business were lower than the expectation we would have is that we would lower the dividend, we would not be accessing the debt markets or the equity markets to fund that dividend.\n\nWhen we think about the opportunity to invest in things, that's where we utilize the capital markets. So the comparison that we're making there with the utilization of as Dan mentioned, the opportunity to use growth and cash flows and EBITDA to fund growth, we look at what's the highest and best use of that capital. And then we'll access the capital markets as appropriate to fund those opportunities. But the dividend is funded based on the cash flow characteristics of the business and we set the policy based on that.\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nAll right. Thanks, Jay. That's clear. Appreciate it.\n\nOperator\n\nNext, we'll hear from Phil Cusick of J.P. Morgan.\n\nPhil Cusick -- JPMorgan Chase and Company -- Analyst\n\nHi, guys, thank you. I wanted to ask about the services guidance, which looks pretty steady, year over year. Should we think of that shifting some from towers to fiber and small cells? And is there any shift in margins as that happens? Thank you.\n\nJay Brown -- Chief Executive Officer\n\nGood morning, Phil. No, there's no shift. We would expect a similar contribution from towers as what we were expecting and seeing in 2022 to continue into 2023. And no change in behavior from the carriers or margins or anything else that would cause us to lead to a different answer.\n\nSo we think we'll see a pretty similar result both in terms of revenue and margins and mix in '23.\n\nPhil Cusick -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nAnd moving on to Brett Feldman of Goldman Sachs.\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nThanks. Two questions if you don't mind. So you said during your prepared remarks that the Sprint cancellation payments getting -- are tied to when they actually terminate leases. I guess the biggest year for the churn coming off of Sprint is going to be 2025.\n\nSo does that mean that actually in 2025, there could actually be some fairly significant cancellation payments as well? And then the second question is, it looks like you're using a bit more stock-based compensation this year, we see that in the AFFO reconciliation. I'm curious if this is a bit of a philosophical shift in how you're looking to compensate the team going forward and if we should be modeling out a higher run rate from here. Thanks.\n\nJay Brown -- Chief Executive Officer\n\nOn the first question, the Sprint cancellations, those are coming to their natural term end dates in 2025, on the tower side so we would not expect to receive any significant payments in 2025 from T-Mobile. Just to be clear about what we're receiving in 2023 are expecting to receive in 2023. Those are the cancellations of nodes that have contracted terms remaining. And so they're funding the remaining years of those contracted payments in 2023.\n\nSo it's a little bit different approach to how they're thinking about their network, between towers and small cells, and why there's a difference in terms of the cash flow characteristics. On the non-cash comp, I would say -- first of all, there's no change in our philosophy in terms of the way we're thinking about percentages or contributions of overall comp for the organization from past years. I think what you're seeing there is just a range of potential outcomes that we put into the outlook as we look forward. So not a meaningful shift in the way that we're thinking about using stock, using stock as we compensate employees.\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nAnd next, we'll hear from Matt Niknam of Deutsche Bank.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nHey, guys, thank you for taking the questions. Just two if I could. First on the Sprint cancellation payments, any color you can share on the cadence of those payments, how they roll in over the course of next year? And maybe the allocation of those payments between small cells and fiber solutions?And then secondly, maybe bigger picture question, we've seen a couple of announcements from cable around starting to build out some of their own spectrum to supplement their MVNOs. I'm just wondering if you can comment on how meaningful this can be for your business given your ownership of both towers and small cells.\n\nThanks.\n\nDan Schlanger -- Chief Financial Officer\n\nThanks, man on the ETLs, the payments will happen as Jay mentioned when those contracts ultimately get cancelled. No likely be at the beginning of the year, we think, but we are not in control of that specifically. So we'll wait and see, and we'll let you know. But it could happen through the course of the year or may happen close to the beginning of the year.\n\nThe majority of the cancellations are going to be in the small cell business. So I would just say that there's more than half and small cells less than half in fiber solutions.\n\nJay Brown -- Chief Executive Officer\n\nOn your second question around cable, we're certainly working with the various cable companies as they're thinking about their mobile strategy. And have seen some benefits, both on towers, as well as small cells. I think we will continue to see that, over time, I believe that we have an opportunity for that to be a growing component of our revenue growth. Broadly, without just being completely limited to cable companies, there are a lot of institutions and organizations that are thinking about their mobile strategy.\n\nAnd so we have seen an uptick in the last couple of years of customers outside of what you would traditionally think of as the big four operators, the big four carriers, leasing space on towers and also small cells. And we think that's a growing opportunity. One, we're focused on capturing as much of that demand as possible. I wouldn't describe it in our either -- our current results 2022, or what we expect in 2023 as being material.\n\nBut it is a growing segment and I think it gives us opportunity for future growth in the years 2024 and beyond.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nThat's great. Thank you.\n\nOperator\n\nAnd moving on to Nick Del Deo of MoffettNathanson.\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nHey, good morning. Thanks for taking my questions. First, for Dan, can you just share the expected dollars of churn and the expected dollars of escalation for towers in '23, having those alongside the leasing number would be helpful.\n\nDan Schlanger -- Chief Financial Officer\n\nYeah, so leasing, as we talked about, I'll give you kind of midpoints to try to help with that is around $140 million on towers on escalators. It should be in the neighborhood of $90 million, and on churn, it should be in the neighborhood of $35 million.\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nOK, great. Thank you. And then, on the small cell front, I think you've historically said that anchor small cell nodes typically costs about $100,000, each from a gross capex perspective, and obviously, a fraction of that for co-locations. I guess in light of the inflation, we've seen in some of the expense pressures that you've called out, are those averages still about right? And if there has been any upward pressure there, are you seeing any pushback from getting corresponding lease rates up, or customers kind of accepting it?\n\nJay Brown -- Chief Executive Officer\n\nNick, thanks for the question. We've used $100,000 as a proxy to try to help people understand the quantum that affects our financial statements. But the way these agreements are priced is based on yield or expected yield. So when we build nodes, we're typically seeing a 6% to 7% initial yield on invested capital and then growing that invested capital, as I referred to, in some of my comments around what we think in 2023, the percentage of co-located notes into that high-single digit yields once we get to second tenant low-double digit yield, as we get to a two tenant system.\n\nSo we're pricing, think about customer contracts the way, the way the actual contracted rate of revenue, works itself out through the combination of both upfront funded capital from the carrier, and then the ongoing rent being driven more by the yield required to get to the levels that I just described. And that $100,000 is more theoretical than it is anything than it is anything else. Each system is differently priced, and it's priced to return. So the inflationary pressures that that you're referring to are absolutely -- have absolutely happened.\n\nThey have a similar and direct impact on what we receive from a customer in front of in terms of upfront capital, as well as where the rental rate on those nodes once they're built.\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nOK. So you've been able to push that through in pricing to sustain your yields at your historical levels.\n\nJay Brown -- Chief Executive Officer\n\nRight. OK, great. Thank you, guys.\n\nOperator\n\nAnd next, we'll hear from Brandon Nispel of KeyBanc Capital Markets.\n\nBrandon Nispel -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thank you for taking the question. Two, one for Dan, one for Jay. Going back to Michael's questions $140 million in tower leasing.\n\nHow should that trend throughout the year? Is it linear-- is it first half second half weighted? That was for Dan. Jay, second question is just on overall backlogs in the small cell business. You've been stuck at 60,000 nodes a year. And obviously, you have like multiple years to build those nodes at 10,000 a year to really work through that backlog.\n\nBut how should we expect the backlog to build really over the next 12 to 18 months, if at all? Thanks.\n\nJay Brown -- Chief Executive Officer\n\nI'll take the first one. Thanks. The tower leasing is pretty radiable through the course of the year, I wouldn't call out any difference between the first half or the second half, it goes to the course of the year.\n\nDan Schlanger -- Chief Financial Officer\n\nOn your second question around small cell builds in the backlog, I think this is a business that's going to likely forever be very different than what we've seen with towers where there's more a consistent level of activity with towers where we see the backlog build and grow at a more consistent pace. Small cells by their nature, because of the number of them that have to be deployed and how they're deployed at the market level, I think we'll always see kind of lumpy orders. And the work that we're doing now with customers is, in part working on deploying all the commitments that they've given us, as you referenced, the 50,000 commitment that we received from Verizon and T-Mobile. We're also working with them as they think about the next leg of small cells and what they're going to need in the next part of the densification of their network.\n\nAnd so while it hasn't resulted in orders yet, those are the conversations that we're working on with them across multiple markets. So my expectation for how will it build if you take a really long-term view, Brandon, on your question. My long-term view is the total number of small cells in the backlog will go up and to the right. And over time, we'll see this business continue to scale and grow.\n\nBut I don't think we're likely to see that business have a backlog where it's a steady change every quarter to quarter. I think we'll see some lumpiness in it as we get large commitments from the carriers and visibility toward what their future build is, and then we go through the process of working on it with them and then figure out what's, next on their agenda for densification around the network. I think it's just the nature of the way the business is going to work.\n\nBrandon Nispel -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thanks for taking the questions.\n\nJay Brown -- Chief Executive Officer\n\nOperator, may we have time for one more question.\n\nOperator\n\nYes, sir. Our final question will come from Greg Williams of Cowen.\n\nGreg Williams -- Cowen and Company -- Analyst\n\nGreat, thanks for taking my questions. First ones on the small cell capex. Obviously, you're doing a good job leveraging existing nodes with over half of the nodes. And, I've heard in the past those capex efficiencies could be up to four to one.\n\nWhat's a good runway as we think about beyond '23 of how often you could leverage existing nodes? Is it going to be around that 50% part that I imagine it goes way down as you have to Greenfield additional nodes? Second question is just around the fiber M&A landscape, you probably need color on funding the dividend just with cash. But when you go out and grow, yield, the debt markets, or equity markets, obviously not a good time now, but multiples are also coming down quite a bit in the fiber space we're hearing. So just trying to understand your calculus and what you're seeing in that fiber M&A landscape. Should you go out and need additional fiber.\n\nThanks.\n\nJay Brown -- Chief Executive Officer\n\nYou bet. Greg, thanks for the question. On your first question, over last several years, if we look at the percentage of co-location we've been in and around 20% to 30% of the total activity that we've seen, has been in the form of co-location. And as I mentioned in my comments, and you refer to we expect in 2023, that about 50% of the activity will be co-location.\n\nIf you roll that forward into the future years, we've talked about that the vast majority of the nodes that were committed by T-Mobile 35,000 node commitments that they made. The vast majority of those will be co-located on existing fiber systems. So the vast majority of those are co-location. And then on the Verizon commitment, we think that's a mix of new markets and co-location.\n\nSo we'll get some of both, but based on the current backlog that would tend toward that higher percentage of colocation. So driving capex efficiencies and increases the return on the systems and we're continuing to see, as I said in my earlier comments, really encouraging trend lines when we get down to the system levels of seeing the returns come -- the incremental returns come in where we expected when we underwrote those investments. So really encouraged by that story, starting to shape up more and more like the tower model, and what we've seen historically if you get scale in towers and then grow the return through the acquisition process. The second question around fiber M&A, we've been really careful about what we've looked to acquire in order to be interesting to add to the acquisition.\n\nThe fiber strands have to be high capacity and they need to be located in densely populated areas that we believe there is going to be significant small sell opportunity in order to grow those returns. Today, as evidenced by the fact we haven't done any acquisitions since 2017, we have not found any acquisitions that meet that criteria. And at this point, we continue to believe that the vast majority of the opportunity is going to be through organic builds, rather than acquisitions. So we'll continue to look and pay attention to what's out there.\n\nAnd if there's an opportunity that makes sense, we would consider it. But we think it's much more likely that will be an organic builder of the fiber that will be needed for small cells for the carrier customers rather than in acquisition mode in order to gain that fiber.\n\nGreg Williams -- Cowen and Company -- Analyst\n\nGot it. That's helpful. Thank you.\n\nJay Brown -- Chief Executive Officer\n\nGreat. Well, thanks, everyone, for joining us this morning. Appreciate the time, and we look forward to catching up with you soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBen Lowe -- Senior Vice President, Corporate Finance\n\nJay Brown -- Chief Executive Officer\n\nDan Schlanger -- Chief Financial Officer\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nRic Prentiss -- Raymond James -- Analyst\n\nMichael Rollins -- Citi -- Analyst\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nPhil Cusick -- JPMorgan Chase and Company -- Analyst\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nNick Del Deo -- MoffettNathanson -- Analyst\n\nBrandon Nispel -- KeyBanc Capital Markets -- Analyst\n\nGreg Williams -- Cowen and Company -- Analyst\n\nMore CCI analysis\n\nAll earnings call transcripts"
}