{
  "companyName": "RADA Electronics Industries",
  "companyTicker": "RADA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/rada-electronics-industries-rada-q2-2022-earnings/",
  "content": "RADA Electronics Industries (RADA)\nQ2 2022 Earnings Call\nAug 17, 2022, 9:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to the RADA Electronic Industries second quarter 2022 results conference call. All participants are present in listen-only mode. Following management's formal presentation, instructions will be given for the question-and-answer session.\n\nAs a reminder, this conference is being recorded. You should have all received by now the company's press release. If you have not received it, please contact RADA's investor relations team at GK Global Investor Relations at 1-212-378-8040 or view it in the news section of the company's website, www.rada.com. I would now like to hand over the call to Mr.\n\nEhud Helft of GK Global Investor Relations. Mr. Helft, would you like to begin, please?\n\nEhud Helft -- Investor Relations\n\nYeah. Thank you, operator. I would like to welcome all of you to this conference call to discuss RADA's second quarter 2022 with us. I would like to thank the management for hosting this call.\n\nWith us today on the call are Mr. Dov Sella, chief executive officer of RADA; Mr. Avi Israel, chief financial officer of RADA; and Mr. Michael Dippold, chief financial officer of Leonardo DRS.\n\nDov will summarize the key highlights of the quarter, followed by Avi who will provide a summary of the financials. We will then open the call for the questions and answer session whereby Mr. Dippold will address any questions related to the DRS and the announced merger between DRS and RADA. Before we start, I'd like to point out that the safe harbor published in today's press release also pertains to the content of this conference call.\n\nAnd with that, I would now like to introduce RADA's CEO, Mr. Dov Sella. Dubi, go ahead, please.\n\nDov Sella -- Chief Executive Officer\n\nThank you, and good day to all our call participants. Let's start with an overall summary. As we announced in early July, we experienced another quarter in the United States where our revenues mainly remained paused. The lag in U.S.\n\nDOD spending of the fiscal year 2022 appropriation has been a material headwind for the entire U.S. defense sector, including ourselves by extension. While we had hoped that others would resume fairly quickly once the CR, the Continuing Resolution was concluded by the end of March, it has taken time to really start impacting spending across the entire industry and us as well. The shortfall in revenues impacted our profitability.\n\nWe have not reduced our expenses as we expected the orders and revenues will come to us eventually. Once we are back to our expected revenue level, our profitability will also be at the expected range. We are seeing the order from the U.S. starting to resume, and we do expect the second half of the year to be better than the first.\n\nWhile this short-term bump in our road is frustrating, and we do every -- and we do very much see it as a bump in our long-term growth path, we remind that it has always been a risk we live with, as part of the fast-growing package that comes with being a small defense player providing technology by short-term orders rather than via backlog. Next topic is our merger with Leonardo DRS. The most important event for RADA, however, is our announced pending merger with a leading mid-tier U.S. defense technology company, Leonardo DRS, which is a subsidiary of the Italian defense company, Leonardo, just to remind and update any new listeners.\n\nDRS will acquire 100% of the shares of RADA in exchange of 19.5% equity ownership in the combined company allocated to RADA shareholders. Pending a shareholder vote in the coming month, we expect the merger to close in the fourth quarter. The combined company will maintain the name Leonardo DRS and will trade on NASDAQ and TASE, and the ticker symbol will change from RADA to DRS. We are working closely with DRS for almost a decade now, and DRS has been a significant contributor to RADA's successful penetration into the U.S.\n\nmarket over this period. This merger takes our collaboration with DRS to the next stage. Our advanced Tactical Radars strongly improved DRS's position in air defense, counter-UAS, and vehicle protection market segments, accelerating its transformation into a provider of integrated sensor systems, and leader in advanced sensing and force protection markets. It also increases RADA's addressable markets on one hand, and de-risks RADA's position as a small player in our high growth but increasingly competitive market space where we are indeed seeing many of the major defense players starting to join this market, and putting pressure on small players, together with DRS, the leading mid-tier defense electronic company addressing high growth markets with a formidable competitive force.\n\nLet's have a view of our markets. I want to highlight the key points that, despite the short-term U.S. lockdown, the fundamentals of our markets have not changed, and on the contrary, is only strengthened in the past half year. Following the invasion of Russia to Ukraine, Western countries throughout the world realize the need to provide the best and most advanced active defense solutions for their maneuverable military assets and, ultimately, their troops.\n\nOur software-defined and mobile radars are in the heart of modern warfare protection needs like short-range air defense, counter-UAS, active protection on armored vehicles, counter-rocket, artillery and motor, and similar. Our U.S. market is now moving from the JUN phase, meaning Joint Urgent Need statements into the programs of record phase. The switch of -- the switch to programs of record is another contributing factor to the current short-term U.S.\n\norders resumption. This trend will enable us as part of DRS, to build many more products over a longer period based on an order backlog generating long-term revenue visibility and long-term stable and profitable growth. In the early years of our penetration and growth into the U.S. market, to capitalize on our market position, we produce radars to stock and apply a book and ship commercial approach.\n\nThis unique approach not only made us attractive to our U.S. customers, but because it relied on high level -- high levels of inventory and components, it shielded us from much of the negative impacts and challenges that COVID placed on us over the past two years, including what is now the continued supply chain constraints that everybody faces. Globally, Europe and NATO countries are typically following the doctrine and solutions of the U.S. military, and the need for short-range air defense or point defense is becoming widely recognized.\n\nWe have already initial engagements with prominent European weapon system providers, and our radars are integrated and continuously being tested as part of their solutions. The New East and Indian markets are both waking up around the need to mitigate the counter-UAS threats -- the UAS threats and counter-UAS solutions. This is even more prominent given the multiple armed drone attacks, for instance, the last -- this Monday -- the last Monday, against U.S.-led coalition forces in Syria. And in summary, obviously, we are not thrilled with our results in the last two quarters which were impacted by external factors that are beyond our control and have impacted the entire U.S.-related defense sector, not just us.\n\nI can say though, that we have not lost any opportunity, and expect our business to come through eventually either in the second half of this year or next year. Looking ahead to the merger with DRS, and will put us -- that will put us in a stronger position to continue our long-term growth path. At this point, I'd like to hand over the discussion to Avi, CFO. Avi, please go ahead.\n\nAvi Israel -- Chief Financial Officer\n\nThank you, Dubi. Good day to all of our participants. You can find our results on the press release we issued earlier today. And I'll provide short summary of the second quarter results.\n\nSecond quarter revenues were $23 million versus $28.3 million in the second quarter of last year. Our gross margin in the quarter was 35%. I note that our gross margin is the level of fixed cost within them, so they were impacted by the lower level of revenues. Operating loss was $3 million versus $4.5 million of income in the second quarter of 2021.\n\nI note that we had about $2.6 million of merger-related expenses. Net loss was $4.4 million versus $10.4 million of net income in the second quarter of last year, which included a one-time tax income of $6 million. We reported an adjusted EBITDA for the quarter of $1.8 million versus EBITDA of $6.3 million in the second quarter of last year. I'd also like to summarize and point out some highlights from our balance sheet.\n\nAs of June 30th, 2022, we had $55.6 million in net cash and no financial debt at all. I note that as of Q2 end, all our needs for cash investments in working capital and inventories have been made, and we are -- and are all behind us. We expect the cash revenue to increase and revenues to -- as revenues ramp up again. As of quarter end, our shareholders' equity stood at $152.8 million, financing 78% of our balance sheet.\n\nIn summary, as Dov indicated, looking ahead to the second half of this year, and expected to show an increase in revenues, and as a result, an improvement in profitability. That ends my summary. We shall now open the call for questions. Operator, please.\n\nOperator\n\nThank you. Ladies and gentlemen, at this time, we will begin the question-and-answer session. [Operator instructions] Please stand by while we poll for your questions. The first question is from Ellen Page of Jefferies.\n\nPlease go ahead.\n\nEllen Page -- Jefferies -- Analyst\n\nThe revenue outlook and the order environment. What's improved in the past few months? And how much visibility do you have to return to growth for the top line?\n\nDov Sella -- Chief Executive Officer\n\nYeah. You know, we start to see the momentum. We are still in the book and ship mode of operation. But based on our estimations, we can return to the levels that we had last year, or end of last year, or even in the coming quarter or so.\n\nSo, we are optimistic about the continuation of the growth of our business, except the last two, three quarters that kind of posed up from this.\n\nEllen Page -- Jefferies -- Analyst\n\nGreat. And just can you talk about some of the larger opportunities that you called out, such as M-SHORAD, CV-90 or [Inaudible] or ABAD? Just how are you thinking about those opportunities and any time when you can share?\n\nDov Sella -- Chief Executive Officer\n\nYeah. The growth that we expect is coming from these programs. We have four major programs and some still urgent needs that pop up, by the way, also around Ukraine. But the air base, air defense, and SOCOM SIP are producing inputs of orders.\n\nSHORAD is always there. We may expect even things to come forward around SHORAD. And the Marine Corp GBAD is in the background progressing as planned, and we expect that it will affect our revenues mainly next year and onwards.\n\nEllen Page -- Jefferies -- Analyst\n\nGreat, thanks. That's it for me.\n\nDov Sella -- Chief Executive Officer\n\nSure.\n\nOperator\n\nThe next question is from Jeff Bernstein of Cowen. Please go ahead.\n\nJeff Bernstein -- Cowen and Company -- Analyst\n\nHey, guys. Just a real quick question, just reading about this U.K. SERPENS program, this ultracompact multimission radar. And I was just wondering, does that compare at all with any of your products? Or is that a different class of radar?\n\nDov Sella -- Chief Executive Officer\n\nIt depends. The SERPENS program, first of all, it's a long-term share program, and it's in incubation phase. It will take a few years until it becomes a program. But it is an end-to-end comprehensive solution to the U.K.\n\nmilitary or Army, and it includes a variety of radars. We are tracking it. We are operating with additional companies in the -- while currently, we cannot address the high end, but the bigger radars, we do believe that what we have is very relevant. And also, we're teaming with the right partners, we can come as part of an end-to-end solution.\n\nJeff Bernstein -- Cowen and Company -- Analyst\n\nThat's great, thank you.\n\nDov Sella -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Austin Moeller from Cannacord. Please go ahead.\n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nMorning Dubi and Avi. My first question here. Last week, I heard DRS's management discuss using your radars, which we traditionally think about as an air defense application, for disseminating comms and also being -- uses in the electronic warfare system. So can you just expand on this a little bit?\n\nDov Sella -- Chief Executive Officer\n\nI would like to defer these questions to later stages. This is really in the heart of our strategy going forward, and I don't think it's mature enough to give further details as of now.\n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nAnd then, as far as the ATON program goes, is -- are we expecting work for that to start ramping in the second half of this year? Or will we not see that until 2023?\n\nDov Sella -- Chief Executive Officer\n\nWe will see initial sales toward the end of this year, but mainly it's 2023 and onwards, yeah.\n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nOK. And then, what do we think about timing for the army making a decision on the directed energy SHORAD, and who might be the radar supplier for that?\n\nDov Sella -- Chief Executive Officer\n\nTo our best knowledge, as of now, it should be completed on the laser next year. So probably it will become a program in 2024. Currently, there are four prototypes that are being delivered to Europe, that were developed by the RCCTO arm of the Army rapid capabilities force. And we are already engaging in that to a certain extent, but it should be completed probably next year.\n\nWe do hope and believe that our radars will stay the incumbent radars because we are kind of effect or agnostic.\n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nOK, fantastic. Thanks for all the color there.\n\nDov Sella -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Scott Huntington of Brighton Securities. Please go ahead.\n\nScott Huntington -- Brighton Securities -- Analyst\n\nGood morning. I have a combined kind of questions. First of all, was your bookings amounted for the second quarter in net --\n\nDov Sella -- Chief Executive Officer\n\nI'm sorry, you were not clear. Can you repeat your question?\n\nScott Huntington -- Brighton Securities -- Analyst\n\nYes. Was your bookings announced for the second quarter?\n\nDov Sella -- Chief Executive Officer\n\nNo, we did not announce bookings for the second quarter as of now.\n\nScott Huntington -- Brighton Securities -- Analyst\n\nOK. Well, just -- it's kind of sad moment to miss a dynamic independent growing company that had been anticipating $250 million in sales in the next three, four years, possible expansions in India and Europe. And last we heard was looking at making some small accretive acquisitions. And June 21st, we get this announcement as I suppose, 20% premium merger with a much larger Leonardo.\n\nAnd the next day, the shares closed below where they had announced the prior day before the announcement. And the valuation isn't quite a concern. I know that Mr. Lynn has stated that they used a conservative valuation that represented a 20% premium.\n\nAnd I think Mr. Lynn is thinking might be a little off because back in March of 2021, when they're looking to do an IPO, they said that the Street inadequately valued Leonardo, and they pulled their acquisition. And I contend that the same type of valuation disconnect is right in the middle of Lynn's growth plans. And I don't know what the board can do at this particular time, but I would consider this valuation coming off of continuing resolution, looking for substantial growth going up in the next three, four years.\n\nI think it's just unacceptable. Do you have any comments that by the time that you're shopping the company and this was the best offer you could give? I don't understand this, but my ears are open.\n\nDov Sella -- Chief Executive Officer\n\nI don't think this is the time and moment to comment on the merger. This is an earnings call. The merger was announced. We do believe this is the right strategic move for both companies going into the future, and we are confident that also the shareholders given a reasonable time will realize that.\n\nThank you.\n\nScott Huntington -- Brighton Securities -- Analyst\n\nSo, Dubi, that would be at any price you could agree on the merger?\n\nDov Sella -- Chief Executive Officer\n\nThe terms of the merger were already agreed and we are not going to change that.\n\nScott Huntington -- Brighton Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Please stand by while we poll for more questions. There are no further questions at this time. Mr.\n\nSella, would you like to make your concluding statement?\n\nDov Sella -- Chief Executive Officer\n\nYes. Thank you, operator. On behalf of RADA and DRS management, I would like to thank you all investors for your continuing interest in our business. We look forward to speaking with you soon again.\n\nStay well and good day to all. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEhud Helft -- Investor Relations\n\nDov Sella -- Chief Executive Officer\n\nAvi Israel -- Chief Financial Officer\n\nEllen Page -- Jefferies -- Analyst\n\nJeff Bernstein -- Cowen and Company -- Analyst\n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nScott Huntington -- Brighton Securities -- Analyst\n\nMore RADA analysis\n\nAll earnings call transcripts"
}