{
  "companyName": "Duolingo, Inc.",
  "companyTicker": "DUOL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/duolingo-inc-duol-q3-2022-earnings-call-transcript/",
  "content": "Duolingo, Inc. (DUOL 0.86%)\nQ3 2022 Earnings Call\nNov 10, 2022, 5:30 p.m. ET\n\nDebbie Belevan\n\nGood afternoon, and welcome to Duolingo's third quarter 2022 earnings webcast. All attendees are in listen-only mode. Today, after market close, we released our quarterly shareholder letter with our Q3 results and commentary, which you can find on our IR website at investor.duolingo.com. On today's call, we have Luis von Ahn, our co-founder and CEO; and Matt Skaruppa, our CFO.\n\nThey will begin with some prepared remarks before opening the call to questions. [Operator instructions] Please note that this event is being recorded. Just a reminder that we will make forward-looking statements regarding future events and financial performance, which are subject to material risks and uncertainties. Some of these risks have been set forth in the risk factors in our filings with the SEC.\n\nThese forward-looking statements are based on assumptions that we believe to be reasonable as of today, and we have no obligation to update these statements as a result of new information or future events. Additionally, we will present both GAAP and non-GAAP financial measures on today's call. These non-GAAP measures are not intended to be considered in isolation from, a substitute for, or superior to our GAAP results, and we encourage you consider all measures when analyzing our performance. And with that, I'll turn it over to Luis.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nThank you, Debbie, and welcome, everyone. I'm pleased to report that we delivered another strong quarter, continuing the momentum we've seen all year. We saw accelerating user growth with daily active users increasing 51% year over year. We also saw bookings grow 41% year over year, which came from growth in conversion year over year and from steady retention rates.\n\nWe're not seeing any signs of consumer softness in our subscription metrics. And as a result, we're raising our full-year guidance again. I want to spend a little more time talking about our user growth because it's so important for our business. Daily and monthly active users continue to accelerate for the fifth quarter in a row, reaching all-time highs in this third quarter.\n\nOf course, we can't expect this acceleration to go on forever, but the trend this year is evidence that our focus on organic growth, coupled with modest and efficient marketing spend is an effective strategy. This is why we continue to invest in R&D to make our products even more fun and engaging, which is what drives word-of-mouth growth. And our strong user growth this year will also help drive bookings growth in the future because we have a great free product without a paywall, a good portion of the learners that have joined us this year will convert to paying subscribers in the coming quarters, providing a tailwind for subscription bookings. As to other parts of our business, you all know that the digital advertising market has faced headwinds this quarter.\n\nAnd while this impacted our ad revenue, the overall impact to our business has been small because ad monetization isn't a major focus for us. Rather than actively seeking to grow this revenue stream, ads have served more of a strategic purpose for us, which is to help give learners a reason to convert to paying subscribers. On the other hand, in-app purchase revenue is a priority for us, as we believe it's a bigger opportunity than ad revenue. Today, IAPs or in-app purchases only make up about 5% of revenues, up from 3% last year.\n\nBut we believe we have plenty of room to increase this as we experiment with new features that encourage learners to make a la carte in-app purchases. Overall, we continue to maintain our financial discipline and manage our costs prudently. While our headcount continues to grow, we have never gone nuts on hiring. And because of that, we don't have to implement cost controls like layoffs or hiring freezes in order to achieve profitability.\n\nAs I reflect on 2022, it's been a stellar three quarters for our business even as the macro situation has gotten more uncertain. And the fourth quarter is a busy and fun quarter for us. We have just launched our new home screen to most users, launched our new Math app, and we launched our New Year's promotion in late December. I'm excited about these efforts and look forward to all the energy and innovation that a New Year brings.\n\nAnd with that, I'll turn it over to Matt to talk about our financial outlook.\n\nMatt Skaruppa -- Chief Financial Officer\n\nThanks, Luis. We had another exceptional quarter, outperforming our expectations on the top line and on profitability. And given our outperformance, we are raising our full-year guidance. During the third quarter, we delivered total bookings growth of 41% year over year.\n\nAnd as a reminder, over half of our revenue comes from outside the U.S. So, on a constant-currency basis, bookings growth would have been nearly 50%. As to our guidance, for Q4 2022, we are guiding to $112 million to $115 million in total bookings, $98 million to $101 million in revenue, and an adjusted EBITDA of negative $3 million to breakeven. For the full year 2022, we are increasing our guidance to $414 million to $417 million in total bookings, $364 million to $367 million in revenue, and an adjusted EBITDA of positive $7 million to $10 million.\n\nOur full-year bookings guidance reflects 41% to 42% year-over-year growth, up from the 37% to 39% year-over-year growth we guided to on our last earnings call. Our updated guidance assumes current foreign exchange rates, and note that every 1% increase in the value of the dollar versus our basket of currencies has about $0.5 million impact on bookings in the final quarter of the year. As Luis mentioned above, we continue to be disciplined in how we manage our expenses. In the fourth quarter, we expect non-GAAP R&D will increase as a percent of revenue as we continue to invest in making our products more fun, engaging, and effective.\n\nOur non-GAAP sales and marketing expense as a percentage of revenue is expected to increase slightly and non-GAAP G&A should stay roughly flat. For the full year, we expect to achieve approximately two to three points of operating leverage compared to last year. We ended Q3 with approximately 47.6 million fully diluted shares outstanding using the average Q3 closing price, and we expect to end the year with approximately 3% dilution from equity issued to employees. We will provide our full-year 2023 guidance on our fourth-quarter earnings call.\n\nBut in the meantime, I'd like to remind everyone that we believe we are still early in our monetization efforts and believe we have strong top-line growth ahead of us. We will continue to invest in R&D to drive user growth and monetization, and we will invest more in early stage efforts like the Duolingo English Test, Duolingo ABC, and Duolingo Math. But even as we do that, we will stay focused on making measurable progress each year to our long-term profitability target of 30% to 35% adjusted EBITDA margins. And with that, I'll turn it back to Luis.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nBefore we get into Q&A, I'd like to thank the entire team who continue to deliver excellence in everything they do, creating engaging apps that are fun and effective, helping our learners reach their goals on converting more subscribers who ultimately support our mission. And now, we would be happy to take your questions. I'll turn it back to Debbie to manage the queue.\n\nDebbie Belevan\n\nAll right. Thank you, Luis. [Operator instructions] And the first question comes from Andrew Boone at JMP Securities. Go ahead, Andrew.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nHi, guys. Thanks so much for taking my question. I'd like to go to localized pricing. Bookings on our numbers was down 16% year-over-year bookings per -- sorry, it was down 16% year over year.\n\nCan you just break that out versus FX versus the shift to localized pricing? And then just update us in terms of what you guys are seeing as you roll that out in terms of conversion benefits. And then secondly, as we think about profitability going forward, Matt, you mentioned this in your remarks in terms of driving toward those long-term margins. Is there any way you can help us think about that though as just there's been a greater shift toward the focused profitability, how you guys are thinking about just expanding margins and more of a steady cadence there? Thanks so much.\n\nMatt Skaruppa -- Chief Financial Officer\n\nSure. Yeah. So, on your first question on regional pricing, just to remind everyone, we rolled out localized pricing starting last year, but really more broadly in Q2 of this year because we saw it as a first step toward better international monetization, getting the pricing more akin to what's the purchasing power in the local markets. And when we did that, we were testing that thoroughly for a long period of time to make sure that the net impact of lowering the price was an increase in bookings and ultimately, an increase in lifetime value of those subscribers.\n\nAnd we feel confident when we roll those out, but that was true. So, while that probably has an impact on our preferred metric of pricing, which is revenue per subscriber, not bookings, the ultimate impact will be a bigger LTV over time. This past quarter, to your point, our bookings per quarter and then flowing through the revenue was impacted by FX. So, that was another headwind to revenue per subscriber.\n\nSo, on that, we feel confident that we're making the right choices for the long-term LTV of the business even if pricing goes down in any particular quarter. As to your second point around profitability, the good news is it's actually not a shift in how we run the business. The businesses forever have been run disciplined so that we weren't burning through cash. And so, there really is no change.\n\nThe fact of the matter is we're going to continue to increase revenue faster than expenses. The operating leverage will flow through to the bottom line and will become more profitable over time.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThank you.\n\nDebbie Belevan\n\nAll right. Thanks, Andrew. And your next question comes from Ralph Schackart William Blair.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nGood evening. Thanks for taking the question. First question on macro. Luis, I know you said you haven't seen it -- or at least broadly.\n\nBut just curious if you're seeing it even on the edges or any small signals. And I guess maybe give us a sense of sort of the durability in the use case for the product that might be able to continue to help it grow. Should there be stiffening macro headwinds? And then I have a follow-up. Thanks.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nYeah. So, of course, we're aware of the macro situation. So, we've been looking for our subscriptions product, we just haven't seen anything even if you say geographically. I mean, we just haven't seen any softness in the numbers.\n\nLike I said, in terms of ad revenue, we've seen that, but it's small for us. So, our main -- we're mainly a subscription product, and we just have seen no softness. And we just feel pretty good about it in terms -- and like also like I said, in terms of -- this year, we just have seen a pretty strong user growth, and that usually will convert over the next several quarters will convert in pretty strong bookings growth. So far, so good.\n\nI mean, of course, like I've been saying also in every single call, I don't know what will happen in terms of if there's a major recession or anything because we, as a company, have never gone through a major recession, but so far, we just haven't seen any softness.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nGreat. And then in terms of in-app purchases, it seems like you're having some success there with I think gems you called out in the shareholder letter. Maybe give us a sense, is this sort of an added focus for the company? Are you merchandising more? Is this just gems just sort of an exceptional product? Just give us a sense there would be helpful. Thank you.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nYeah, that's a great question. We are spending more effort on in-app purchases. That's something that we really -- it wasn't until recently that we had a team really focused on that. And when we're growing at this point, where about 5% of our revenues are in-app purchases, sometimes people ask us how big can that be as a subtraction of our revenue.\n\nAnd the honest answer is I don't know. But if you look at comparables, something like Tinder has about 30% of the revenue from in-app purchases. So, we think there's a lot of room to grow from 5%. The main way in which we're going to be doing in-app purchases is through this gem economy, which is a virtual currency for Duolingo.\n\nAnd mainly, we're going to be building more and more features that encourage users. These are usually gamified features that encourage users to spend their gems. And you're going to see us building a lot more of those over the next several years.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nAll right. Thanks. Appreciate it.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nThank you.\n\nDebbie Belevan\n\nThanks, Ralph. And your next question comes from Ryan MacDonald at Needham.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThanks for taking my question, and congrats on a nice quarter here. I want to start with international. Obviously, that's been a big focal point for the business with earlier this year reentering China. But I thought it was interesting as well that Duocon you talked about sort of two new launches.\n\nOne Cantonese from Mandarin speakers and then English for Bengali speakers, which really unlocks two large learner populations in India and China. So, just curious what progress you're seeing internationally in the quarter and maybe how those new languages really drove that business or what's happening there.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nYeah. Thank you for the question because it's something that we are spending a lot of effort on. Just to remind everyone, we are, again, mainly a subscriptions business. And about half of our revenue comes from English-speaking countries, U.S., U.K., etc.\n\nWe think there's a lot of room to grow internationally. If you look at the language learning market, like the off-line language learning market, the vast majority of it, the spend is internationally, in particular, learning English, which is -- we're a little different. We are -- because we are online, we're an app. We're still getting a lot of the spend come from places like the U.S.\n\nor the U.K., but off-line, you would see the majority of the spend internationally. So, we think there's a major opportunity. And that's going to be a focus for us over the next several quarters. We're doing exactly what you said.\n\nWe are not only adding courses to -- typically courses to teach English to different populations, but not only adding them but, more importantly, expanding those courses and really making them teach to more advanced users. We're spending a lot of effort on that. And things like in-app purchases are going to be helping us for that also because there are certain regions where subscriptions are not preferred. So, kind of one-time payments are probably going to be helping us for that.\n\nSo, I mean, the main thing that I would say is this is a major focus for us, and we're going to be working on that again for the c.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThat's really helpful. And maybe then on marketing and advertising campaigns, this an area where you've been really efficient. It was great to see the nice progress you made off of the Game of Thrones collaboration. But there's a major sporting event coming up at the end of the month that brings millions of people together from all different languages.\n\nIt seems like a potential natural opportunity for Duolingo to maybe capitalize on that. Just curious here, are you doing anything around this event? And perhaps previously when we look at Olympics or other major soccer tournaments like has that -- have you seen sort of that as a catalyst to drive more learners to the platform? Thanks.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nYeah, it's a great question. So, we definitely have a lot of stuff planned, particularly our social media. I mean, if you've been following our social media, we're quite good at social media. I mean, we do -- we really kind of strike a chord with it.\n\nSo, there's just a lot of stuff planned. Certainly, you'll see our Mascot Duo doing silly things with -- in soccer fields. So, we have a lot of stuff planned for that. You're not going to see us do things like sponsor the entire World Cup or something like that that would, in our view, not be very efficient marketing.\n\nBut I think we're going to be able to capitalize a lot on this. We're also doing these things where -- that allows -- that are going to allow people to send either cheers or insults to -- well, I mean, these are clean insults. They're not like terrible insults to teams in other languages. So, we have marketing campaigns like that on social media.\n\nSo, we're going to be -- it's pretty cool. So, I'm pretty excited about that.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nThat was great. Well, congrats again. Thanks for taking the questions.\n\nDebbie Belevan\n\nThanks, Ryan. And the next question comes from Mario Lu at Barclays.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thanks for taking the questions. The first one is on the in-app purchases. As you continue to build out these new features like Match Madness, how do you strike a balance between optimizing for learning efficiency and monetization?\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nYou know, that's a great question. For every feature that we build, we try to do three things -- well, there's three things that we're really looking at, whether it's engaging, whether it helps with monetization and whether it helps with teaching. And in all cases, usually, each feature helps with one thing, but what we try to do is that it does not hurt the others. So, for in-app purchase stuff, most of the features that we're going to be building are probably going to be mainly helping with monetization, but we just want to make sure that they don't hurt engagement and also don't hurt learning.\n\nSo, generally, whenever we put something out there, even if it's like what may seem like a silly game like Match Madness, there's actually quite a bit of learning value there from the time aspect to it, basically tries to get the words kind of more cemented in your head. So, we're going to be trying just to make sure that it does not decrease any learning outcomes.\n\nMario Lu -- Barclays -- Analyst\n\nOK. That makes sense. And then maybe one on the New Year's promo. It seems from the shareholder letter, you guys are pretty excited about it this time around, especially after last year's success.\n\nAnything to really look out for this time around that may be different that we should monitor?\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nYou know, it's -- we've done the New Year's promotion several years in a row, we've gotten quite good at it. We know when to start it. We know which day to start, it's like basically December 28, that's the best day to start. We've A/B tested the hell out of all of these.\n\nAnd so, we're pretty excited because every year, it worked out pretty well. Where you're going to see -- one thing, of course, it looks different than previous years because we changed the look and feel of our subscription. It used to be called Duolingo Plus now it's called Super Duolingo with much better graphics. It's going to look different.\n\nAnd we're going to try a new A/B -- a number of new A/B tests, for example, we're also going to be including the Family Plan, whereas in previous years, we hadn't included the Family Plan. So, there's stuff like that. But generally, we're just excited because it is a really exciting time of growth for Duolingo. And we see it every year during new year.\n\nNot only do we get an influx of users because of New Year's Resolutions, but the New Year's promotion allows us to really capitalize in terms of money for that. So, we're pretty excited by it.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thank you.\n\nDebbie Belevan\n\nOK. And your next question comes from Mark Mahaney at Evercore. Go ahead, Mark.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. I think the -- one of the most interesting things in the print is this number of MAUs. I think 7 million. I think that's a record high.\n\nSo, could you tell us what the source of those MAUs were? And any early read into whether they are likely to convert into subscribers as well with the lifetime value of these record-high MAUs is? Thanks.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nSo, yes, so this quarter, I mean, basically, we've seen accelerated both DAU and MAU growth. And so, we're very happy with that. The source is -- the same thing that's been throughout -- basically most of our growth is organic through word of mouth. And we just keep -- the flywheel just keeps getting better and better, I think, mainly because the product keeps better -- is getting better and better.\n\nWe're able to retain uses more, and they tell their friends more when we add more social features and stuff like that. So, there's that. In terms of how likely they are to convert. Our conversion rates are staying pretty steady or increasing over time.\n\nSo, they're about as likely to convert as all the ones that have been in the past. So, this is why we think for us, we're very excited with general user growth because it's kind of the top of the funnel that gets us more users, which then gets us more subscribers, which, you know, makes us more revenue.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nAnd then two more questions. Just anything interesting geographically wise in terms of where those MAUs came from? Is that like 6.5 million people from Beijing? Just -- it's a big number, so I'm just asking where those people came from? And then can I switch over to Duo Math, though? So, I've downloaded the app, but I haven't used it enough yet. I'll do it. Just talk, if you don't mind about the monetization path forward, not how quickly you want to monetize it.\n\nBut do you think that the path is there to monetize it, as well as you've done language? Math is a critical skill. And I saw you have adult stuff and stuff for early training. It's a critical skill arguably may be more critical than language, I don't know. But just talk about how you think about the path of getting it out there, monetizing it.\n\nDo you think it will be just as organic in its growth as Duolingo has been as a language app to date? Thanks a lot.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nSure. OK. So, the first question is in terms of geography and where are the kind of the new MAUs coming from and kind of the geographic spread. Generally, we're seeing that we're growing across all geographies.\n\nOf course, some are growing faster than others. Asia continues to be our fastest-growing place. It's not China. I mean, China has been growing some, but I mean, it's countries like India, Vietnam, etc.\n\nBut that's the fastest-growing region. We're actually seeing above-average growth in countries where we monetize really well. So, U.S., U.K., Western Europe are all growing above average for us -- above the average, I guess, 51% DAU growth or whatever, 35% MAU growth. U.S.\n\nand U.K. are growing above that. So, it's across all regions, but there's a few regions that are doing a little better. The -- in terms of Math and monetization.\n\nSo, first of all, we launched this app two weeks ago. We're very happy with the launch so far. Everything has gone as expected or better than expected. We're very happy with the product.\n\nAs you noticed, we have stuff for adults and also for children, one of the things that is interesting. So, the content there so far, the content is basically third and fourth-grade Math. And if you have forgotten what that means, it's fractions, multiplication, angles, area of certain geometric shapes, perimeter of certain geometric shapes, etc. It turns out that adults really like this.\n\nAnd if you actually look at it, we have more adult users than we have children users in the Math app so far. Again, it's only been two weeks, so it's early, but I think this app is going to be used more by adults than children. And that's kind of what I think. In terms of monetization, I'm pretty confident we'll be able to monetize this app pretty similarly to Duolingo.\n\nAnd I think what will happen -- and again, this is -- I'm talking about something that's going to happen quite in the future. So, take it with a grain of salt. But I think what we'll end up doing is we'll probably end up putting an ad at the end of a lesson, and then we're going to have the Super Duolingo subscription, which is going to be shared across our apps to help monetize this. We think that the Family Plan is going to help with this, but we also think that the Math app by itself is going to stand on its own.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thank you, Luis.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nSure.\n\nDebbie Belevan\n\nThanks, Mark. And the next question comes from Eric Sheridan at Goldman Sachs.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the questions. Maybe I'll follow up on that discussion you just had with Mark about Math, but broaden out a little bit. When you think about the long term and building more and more experiences and more and more apps and building out a platform, how should we be thinking about you utilizing the core Duolingo user today to potentially mine for additional use cases and additional platform strength and growth or leaning into virality, which you did with the original Duolingo app? How do we think about the platform strength building versus elements of outing to maybe spend more marketing there are individual use cases by apps? And then to bring Matt into the question as well, how should we think about that in terms of like what you had to invest in '22 against the product mobile app and as we get into '23 and '24 and layer more monetization on top of those investments, how should we think about margin lift over the medium to long term? Thanks, guys.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nThank you, Eric. Thank you for the question. So, OK, the first thing to say is, and it's something that I think we need to emphasize in every earnings call. For the foreseeable future, the majority of our business is going to continue being language learning.\n\nI mean, language learning is -- we have a lot of room to grow in language learning. We really only believe we're scratching the surface, and we're early in our monetization days. And as you can see, our app is -- the growth is actually accelerating for the language learning app. So, for the foreseeable future, call it, the next two, three years, at least it will be mainly language learning.\n\nNow, of course, we're working on other apps. The Math app is the first one. We have -- we're probably going to be releasing other ones. And we are going to be working quite a bit on cross-promotion to be able to send some of our users to the new apps.\n\nNow we want to do it in such a way -- by the way, games are very good at this. We want to do it in such a way that we spend some of our users from Duolingo to, for example, the Math app such that we also don't lose the Duolingo users. So, they stay. It's kind of like a double win there.\n\nThey stay on Duolingo, but we send them to also start using the Math app, we think that will be able to seed that quite well. We're starting a team that is exactly doing that. And we think we have quite a bit of potential for cross-promotion here. But this is early, and we'll see what happens over the next we'll see over the next year to year and a half how that goes in terms of growth.\n\nMatt Skaruppa -- Chief Financial Officer\n\nYeah. And then, Eric, on the second part of your question around the investment. So, I think one of the really special things about the Duolingo platform is that we were able to not only launch Math faster than we otherwise would have been if we were kind of a de novo app. But all of the learnings that we've had from what makes an app engaging and effective port really nicely from language learning into Math.\n\nAnd so, when you ask about our 2022 investment and the investment that we'll be making over time, it's primarily engineers, product managers, and designers. But we're able to launch these with very small teams because they're leveraging all of the mechanics that we've built, and it's just incredibly scalable. So, for me, when I think about the margin impact, it's not been very much, and I don't think it will be that much more in 2023. And then when you think about marketing, again, we fully expect these to be organically grown apps.\n\nIn fact, that's what -- that's our goal with them. And so, the marketing impact will be small as well. So, that's the power of the platform that we've built.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for the color.\n\nDebbie Belevan\n\nOK. The next question comes from Aaron Kessler at Raymond James.\n\nAaron Kessler -- Raymond James -- Analyst\n\nThank you. Two questions. First, just maybe if you can update us on the Family Plan adoption and kind of what that's doing for retention rates? Second, you talked a little bit about shifting some of the ad supply from more internal promotion. Just curious if you're seeing the results thus far in terms of that driving more subscriptions.\n\nAs well as I guess third question would be just any macro softness you're seeing on advertising overall. Thank you.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nOK. So -- sorry, the first question. What was the first question?\n\nAaron Kessler -- Raymond James -- Analyst\n\nFamily Plan.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nYes. Family Plan. So, Family Plan is growing quite nicely. We've -- we now, I think, are -- last time we spoke, Family Plan was in the single digits, we've crossed double digits.\n\nAnd it keeps growing, growing quite nicely. And of course, the really nice thing about Family Plan is that retention of people in the Family Plan is much higher. Again, because if you're paying and as long as any of them -- any other people in your family are still using it, you're going to continue paying. So, we feel very good about that.\n\nIn terms of the exact -- what exactly has done to our overall retention, I don't actually know off the top of my head, I'm sure Matt does, but I'm not sure if we release that. But I'll let Matt answer that one. I don't know.\n\nMatt Skaruppa -- Chief Financial Officer\n\nYeah, for sure. So, I mean, I think the way to think about retention, there's two types of the retention that we measure. So, on user retention, user retention is continuing to grow nicely for us. Your focus -- your question was primarily around subscriber retention.\n\nSo, when you look at the platform level, so take all of the subscribers we have and how are they retaining, that retention rate has gone up dramatically over the past year or two because we've seen a real big mix shift from monthly to annual plan, and the annual plan retains better. Family Plan is a subset of that that retains even better. And so, while it's probably not like the biggest material platform level shift, we expect the cohort level retention to be improved for some time and even more as we increase the Family Plan percentage. So, we're really happy with how that's retaining and how that's going to impact the LTV of the platform.\n\nYour next question was on ads. And so, the ad revenue, as you can see from our financials, was impacted, we think, by what looks to be a kind of industrywide advertising slowdown. So, I don't think there's anything super surprising in that. I think there was some foreign currency impact as well because a lot of our ad business comes on Android outside the U.S.\n\nBut again, ads to us, again, as Luis mentioned, they're not a material part of our business. They're not strategic outside of the fact that they help us convert free users to subscribers. So, we saw it, but we think it's just not that big of a deal for our business going forward.\n\nAaron Kessler -- Raymond James -- Analyst\n\nThank you.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nPart of your question, I think, was also that we -- whether we've tried switching some of our ads to subscribe. And yes, we keep running experiments to do that. There's some optimal mix, and we keep trying to find it. So, yes, we are always running experiments to see what is the right mix.\n\nIt turns out the mix depends on the user. There are some users that are a lot more likely to subscribe for them, it's probably a lot better to give them ads to describe where there are some users that are just essentially never going to subscribe. And for them, the best thing we can do is just probably give them programmatic apps.\n\nAaron Kessler -- Raymond James -- Analyst\n\nAll right. Thank you.\n\nDebbie Belevan\n\nThanks, Aaron. And the next question comes from Nat Schindler of Bank of America.\n\nNat Schindler -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Hi, guys. A couple of questions. First, on the user numbers.\n\nJust digging in a little bit there. Q3, at least in the Northern Hemisphere is when school starts. So, was there any new promotions and pushes to get school children using the product that would have helped that number? Or is this just, I don't know, viral?\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nWell, it's a good question. So, yes, in the Northern Hemisphere, school starts in Q3 usually. And every year, we see a growth that has to do with back-to-school. We do -- we run some -- we don't do a promotion, but we run some kind of very efficient marketing that is either on our social media or a little bit of paid acquisition that is related to schools.\n\nWe also have a schools product, which is Duolingo for Schools. What it is, it's a dashboard for teachers. So, the students use the normal Duolingo, but the teachers have a dashboard that tracks what the students are doing as opposed to having to go and look at every phone kind of in person. So, we have that product.\n\nBut we've had that product for a couple of years. And so, we see this growth every year. We -- but this year, we see accelerated growth is, I guess, we're doing even better than the previous years, not just with back-to-school. My guess is that had something to do with it, but more of it was just organic growth that keeps getting better and better.\n\nNat Schindler -- Bank of America Merrill Lynch -- Analyst\n\nGreat. And second question, has there been any change, or can you give us any clarity on what the -- where you are on the duration of your average booking, what you're selling? I think last time you were around 90% annuals. Has that changed? And can you tell us what it was like over the last few quarters so that we can be aware when this is -- how it's been affecting numbers?\n\nMatt Skaruppa -- Chief Financial Officer\n\nYeah, it's a great question. And so, Nat, the answer is we are roughly still around 90% annual plan. And I think when you look back a year ago, the number was in the 70s. So, as we've gone through the course of the past, call it, four to six quarters, the percentage of that the annual plan has gone up quite substantially.\n\nIt can't go up the same amount anymore, right? If it went from 70% to 90%, it can't go from 90% to 110%. So, the way we're extending the retention of it, Luis, [Inaudible] question now.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nMaybe it could go above a 100%, I don't know.\n\nMatt Skaruppa -- Chief Financial Officer\n\nBut the way we're extending the kind of the synthetic duration, I guess, to use a bad phrase is through things like the Family Plan, right? That's how you actually extend the lifetime of the subscribers longer as you increase the retention to things like that.\n\nNat Schindler -- Bank of America Merrill Lynch -- Analyst\n\nNo, not -- it's not just a problem for the extending the lifetime. That's great, too. But I assume when you -- if everybody is looking at bookings growth, if you're increasing the amount of annuals, you're selling 12 months instead of one month, one and a half months, I guess, in a quarter on average, that can have a pretty big effect. Is there a quarter where we should really watch for that, the difference is big year over year.\n\nMatt Skaruppa -- Chief Financial Officer\n\nYeah. Over the course of 2023, we will see some impact from that. But there's not going to be one particular quarter. And in general, we still feel that we'll be able to lap those quarters as well in terms of growth.\n\nNat Schindler -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nDebbie Belevan\n\nThe next question comes from Arvind Ramnani at Piper Sandler.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nHey. Thanks for taking my question. I wanted to ask a couple of questions on Math. It's still early days for Math, and it's too early to kind of say, you know, where this is going to go.\n\nBut I know you're going to kind of track data by the hour, by the day, certainly. So, these early days, like how is the adoption numbers if you have? And if you don't have the -- don't want to share numbers, like maybe I think, can you give us cohorts, right? Like existing language users, folks who are paying users of Duolingo, or these fresh greenfield users? Like just give us a nature of the cohort of customers have signed up for the Math product. Thank you.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nThank you, Arvind, for the question. So, there's a number of things to say. So, yes, first of all, early days. It's not like we even know that much.\n\nI mean, obviously, we have all the data, you are right. We track it by the hour. We really look at it a lot, but it's very early days. And our experience is that when you launch an app, it just takes a while to -- for things to settle for you to really figure out what are, and we just have had this for two weeks.\n\nI can tell you a few things. One, if you look at the retention of the users of the Math app, so far, it looks actually quite good. It's not as good as Duolingo, but Duolingo is an app that's been optimized for 10 years. So, it's hard to compete with, but it is certainly a lot better than the initial retention of Duolingo when we launched Duolingo 10 years ago.\n\nSo, it's a lot better. So, we feel pretty good about a completely new app having such good retention. We feel good about that. In terms of the users, we haven't done much -- I mean, it's not like we've done any paid advertising.\n\nWe've not done any marketing campaign or anything. So, where the users would come from now is our social media pushes that we've done and some of the press that was written around it, and some of the word of mouth that has happened. But there's just not a lot of time that has -- for word of mouth to happen. There's only been two weeks.\n\nSo, so far, we know that more than half of the users of the Math app have a Duolingo account. We know that. But other than that, there's just not -- we don't know much more than that.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nOK. And then, you know, from a product perspective, just kind of looking at initial feedback, have there been any like big product enhancements that we need to see? Or you feel like -- because kind of the product is never done, right? Like Duolingo you've 10 years and changing. So, I understand there will be an enhancement in Math, but have there been any sort of big sort of like flaws in terms of design, product, anything else that you've identified? Or you feel pretty good about kind of keeping things going at its own gradual pace?\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nI mean, the truth is we feel pretty good. Before launching, we knew what the road map is for the next several years, and the road map remains the same given all the user feedback. And it's just going to be like -- it's going to be like Duolingo, like you said, over the last 10 years, Duolingo is still getting better every single quarter, even though we've been working on it for the last 10 years, I think it's going to be the same for the Math app. We have 10 more years of work to do.\n\nSimilarly, I know there's been a lot of questions about Math, but I just really want to remind people language learning is our main thing right now, and it's going to take a while for Math to catch up. I mean, it took 10 years for Duolingo to make whatever revenue we're making these days, roughly $100 million a quarter. It's going to -- hopefully won't take 10 years for the Math app to get there, but it will take several years to get there just. And we just have -- and in terms of the road map, we know we need to add more content.\n\nI mean, we have third and fourth grade-type of content. We're probably going to go to fifth and sixth-grade type of content. So, we're going to add more content, and we have a number of other things that we just know we need to add that are -- that come from Duolingo. So, for example, the streak in the Math app is not as sophisticated as the streak in Duolingo the other day, we were looking at our streak mechanic for Duolingo.\n\nThat thing is so sophisticated. Like you would be surprised how sophisticated is to make sure that users don't lose their streak because losing your streak is like a terrible thing. Whereas the Math app has a pretty simplistic version of the streak. So, we're -- stuff like that, there's all these things that we know from Duolingo that we just need to start putting into the Math app what we haven't yet.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nYeah. Just one last question on Math. You know, when I look at Duolingo language, there's no other product. There's no user base.\n\nYou kind of have to kind of build this brick by brick. Math, you have this massive user base and actively engaging. Is there a plan to kind of use this -- I would say, kind of the core application to promote Math? I mean, have you started to do that, like [Inaudible]?\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\n100%. We plan to do that. We have not started that at all, we will. And the type of integration -- you can actually get really good at this type of integration.\n\nThis is the type of stuff we've talked about. So, the simplest thing in which -- we haven't even done the simplest thing. The simplest thing is just at the end of a Duolingo lesson, put an ad that says, hey, by the way, we have a Math app. That's the simplest thing.\n\nBut you can get more sophisticated. So, slightly more sophisticated is your ad could be playable. So, you can write there be like \"Oh, try it for a second.\" And then you can go to the app. But then you can start getting much more integrated.\n\nFor example, on Duolingo, we have these things called Daily Quests where you have to do certain things like complete three lessons or do a story on Duolingo, etc. We can make one of the quests be, go do a Math lesson, or you can make it so that now your streak on Duolingo and the Duolingo language learning app could be extended by doing Math. So, you can do just much better integrations. And so, you'll see us do that.\n\nWe're going to try all these things over the next, however, long this takes. We're going to be trying all these things.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nThank you very much.\n\nDebbie Belevan\n\nGreat. Thanks, Arvind. And I'm showing no further questions. So, I'll turn it back to you, Luis, for any closing remarks.\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nJust thank you for all the questions and keep learning languages or math if you want. But yes, remember, Spanish or vanish.\n\nDebbie Belevan\n\nThanks, everyone.\n\nDuration: 0 minutes\n\nDebbie Belevan\n\nLuis von Ahn -- Co-Founder and Chief Executive Officer\n\nMatt Skaruppa -- Chief Financial Officer\n\nAndrew Boone -- JMP Securities -- Analyst\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nMario Lu -- Barclays -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nAaron Kessler -- Raymond James -- Analyst\n\nNat Schindler -- Bank of America Merrill Lynch -- Analyst\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nMore DUOL analysis\n\nAll earnings call transcripts"
}