{
  "companyName": "General Dynamics",
  "companyTicker": "GD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/general-dynamics-gd-q3-2022-earnings-call-transcri/",
  "content": "General Dynamics (GD -0.45%)\nQ3 2022 Earnings Call\nOct 26, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning and welcome to the General Dynamics third quarter 2022 earnings conference call. [Operator instructions] Please note, that this event is being recorded. I would now like to turn the conference call over to Howard Rubel, vice president of investor relations. Howard, please go ahead.\n\nHoward Rubel -- Vice President, Investor Relations\n\nThank you operator and good morning everyone. Welcome to the General Dynamics third quarter 2022 conference call. Any forward-looking statements made today represent our estimates regarding the company's outlook. These estimates are subject to some risks and uncertainties.\n\nAdditional information regarding these factors is contained in the company's 10-K, 10-Q, and 8-K filings. We will also refer to certain non-GAAP financial measures. For additional disclosures about these non-GAAP measures, including reconciliations to comparable GAAP measures, please see the slides that accompany this webcast which are available on the Investor Relations page of our website, investorrelations.gd.com. With that completed, I turn the call over to our chairman and chief executive officer, Phebe Novakovic.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nThank you, Howard. Good morning, everyone, and thanks for being with us. Earlier this morning, we reported earnings of $3.26 per diluted share and revenue of $10 billion. Operating earnings of $1.1 billion and net earnings of $902 million.\n\nRevenue is up, $407 million or 4.3% against the third quarter last year. Operating earnings are up $18 million or 1.7%. Net earnings are up 4.9% and earnings per share are up 6.2%. So the quarter-over-quarter results compare favorably.\n\nThe sequential results are even better. Here we beat last quarter's revenue by 8.6%, operating earnings by 12.3%, net earnings by 17.8%, and EPS by 18.5%. We beat consensus by $0.11 per share on somewhat higher revenue than anticipated by the sell side. Operating margin is about as anticipated.\n\nMost of the beat came from various other items including a lower tax rate than anticipated by the sell side. On a year-to-date basis, net earnings are up $93 million or 4% and earnings per share are up $0.45 a strong 5.5%. We also had another very strong quarter from a cash perspective, net cash flow provided by operating activities is $1,280 billion. Free cash flow was $1.03 billion, a 114% of net income.\n\nThis follows a very strong cash performance in the first half. Order performance was good in the quarter across all segments and particularly strong at Gulfstream. You will hear more detail on cash and backlog from Jason a little later. In summary, we enjoyed a strong quarter particularly so unlighted supply chain foreign exchange and inflation headwinds.\n\nSo let me move right into some color around the performance of the business segments. First aerospace. Aerospace had revenue of $2,350 billion and operating earnings of $312 million with a 13.3% operating margin. Revenue is $281 million more than a year ago quarter up 13.6%.\n\nOperating earnings up $50 million more, up 19.1% on higher revenue and a 60 basis point improvement in margins. The sequential improvement is even better, revenue is up $480 million or 25.7% and operating earnings are up $74 million or 31.1%. To be fair, the prior quarters revenue and earnings were somewhat lower as a result of the inability to deliver for Aircraft, due the airworthiness directive, which was fully resolved in the third quarter. From an audit perspective, this was yet another good quarter reflecting continuing strong demand.\n\nThe aerospace book-to-bill was 1.15:1, Gulfstream Aircraft alone had a book-to-bill of 1.3:1 and 1.9:1 year to date. The first point and perspective since the end of the third quarter of 2021, aerospace total backlog has grown $4,362 billion, to reach a very robust $19.1 billion. Despite apparent macroeconomic headwinds, we continue to experience a strong level of interest, good activity and a replenishing pipeline, Certainly, demand in the quarter was not as super-heated as prior quarters, but still the book-to-bill was very good against a significant increase in deliveries. Only time will tell about the macroeconomic impact, but we continue to see strong interest in Gulfstream aircraft and services.\n\nFrom a product perspective, the G500 and G600 of now seen FAA removed the wind-related airworthiness directive right on the schedule we had previously forecast. Almost the entire fleet had received the installation of the upgraded software by the end of the quarter. We have delivered 188 of these aircraft to customers through the end of the quarter. The G500, G600 together led the quarter in orders follow closely by G650.\n\nThis is a very successful program with real market momentum. With respect to G700 development, the control law software validation is scheduled to begin FAA-type inspection authorization during the first week of November. We estimate we will certify this upcoming summer but much depends on available FAA resources. Gulfstream had 35 deliveries in the quarter.\n\nIf everything goes as planned, we'll deliver 40 to 41 aircraft in the fourth quarter. I haven't said much about Jet Aviation, but suffice it to say, it performed well in the quarter with improving margins in its MRO activities. In short, aerospace exhibited very strong performance in the quarter and should have an even stronger fourth quarter. Next, combat.\n\nCombat systems had very similar results on a quarter over year-ago quarter basis, but with strong improvement sequentially. The combat systems revenue of $1.790 billion is up 2.5% from the year-ago quarter. earnings are down 1.8% on a 60 basis point reduction in operating margin. Nevertheless, the operating margin in the quarter is an impressive 15.2%.\n\nOn a sequential basis, combat systems revenue is up $122 million or 7.3%, while operating earnings are up a very significant 10.6% on a 50 basis point improvement in operating margin. Demand across the segment provided a book-to-bill of 1.3:1 with a large order for Abrams main battle tanks for Poland, orders for $370 million for munitions and ordinance, and in order for 39 labs from the Canadian government. We also received our first order related to the Ukraine at our munitions business. All of this increases the combat systems total backlog to $13.8 billion.\n\nIn summary, this was an impressive new business quarter with strong operating performance once again by the combat systems group. Next, Marine. Revenue of $2.8 billion is up $132 million, 5% over the year-ago quarter. This quarter's revenue growth was distributed fairly evenly between electric boat and NASCO.\n\nRevenue is also up $118 million or 4.5% sequentially. Year-to-date revenue is up $415 million or 5.4%. Revenue in this group has been up for the last 20 quarters on a quarter-over-quarter basis. This is very impressive continued consistent growth.\n\nOperating earnings are $238 million in the quarter, up $9 million or 3.9% on operating margins of 8.6%. On a sequential basis, operating earnings are $27 million or an impressive 12.8% on a 60 basis point improvement in margin. At electric boat, the Columbia first ship remains on cost and on contract schedule. The ship is more than 25% complete.\n\nNASCO had a particularly good quarter with improved TAO revenue and better margins across the board. From an orders perspective, electric boat received a large maintenance and modernization order for the USS Hartford. NASCO received orders for an additional ESB and two TAO oilers. As a result, book-to-bill was 1.1:1, leading to a $400 million increase in backlog.\n\nThroughout the group, we have a solid backlog of new construction and repair work. Our programs are also well supported in the FY '23 budget. In summary, revenue growth is clearly visible. And as I've said before, the real opportunity given the steady revenue visibility is margin improvement over time.\n\nMoving to Technologies. This segment has revenue of $3.71 billion in the quarter, down $49 million from the year-ago quarter or 1.6%. The revenue decrease was fairly evenly split in dollar terms between mission systems and IT. mission systems suffered from nagging supply chain disruptions and the failure of some government customers to obligate funds for authorized and appropriated products.\n\nIn the case of IT services, it was largely timing and program mix. Operating earnings of $285 million are down $42 million or 12.8% on a 120 basis point reduction in operating margin, exclusively attributed to mission systems and largely related to the issues impacting revenue. Total backlog remains relatively consistent overall comparative periods with a book-to-bill of 1:1 in good order prospects on the horizon. The pipeline remains very active at both businesses.\n\nGDIT enjoyed another solid operating quarter with healthy earnings and particularly strong cash in part due to good results in the federal civilian division. While we continue to see procurement delays, GDIT's year-to-date wins exceeded full year 2021 awards in dollar terms. These wins highlight the nice momentum in the business as GDIT begins to realize the benefits from targeted investments in the technical differentiation of its offerings. And this, despite the more than $3.5 billion tied up in prolonged protest and nearly $17 billion pending adjudication at the end of the third quarter.\n\nOn the people front, GDIT remains focused on attracting and retaining the very best technology talent. The culture of this business has created. One of empowerment, accountability, and inclusivity is a clear differentiator and a fiercely competitive talent market. Mission systems experienced a series of challenges in the third quarter, additional supply chain disruptions, inflation, labor availability and select intel programs, and customer contracting delays.\n\nMany mission system customers have a serious shortage of contracting officers that have hampered their ability to execute on programs of record. In addition, quite understandably, customer focus has been redirected in some areas to meet the more urgent demands of the Ukraine. The business has offset some of the bottom-line impact by productivity improvements and cost-cutting initiatives. They will make every effort to catch up in the fourth quarter.\n\nNonetheless, we anticipate these fact of life realities to continue for a while. I have more to say on that subject in a moment. That concludes my remarks with respect to a solid quarter for the entire company. So as we look toward the end of the year, we expect performance to be largely in line with the update to guidance that we gave you on the last call.\n\nAs I just referenced, we expect technologies to fall short of our previous estimates, but we expect aerospace to run somewhat ahead of our previous forecast. All up, they should offset each other. In all other respects, our guidance remains the same. We stand by our previous EPS guidance.\n\nI'll now turn the call over to our CFO, Jason Aiken, for further remarks.\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nThank you, Phebe, and good morning. Starting with our cash performance. It was another strong quarter with operating cash flow of nearly $1.3 billion. This was achieved once again on the strength of the Gulfstream orders and particularly strong cash performance from our Technology segment.\n\nThis brings us to $3.9 billion of operating cash flow through the first 9 months of the year, which also includes the ongoing collections on our large international combat vehicle contract according to the contract restructure that occurred back in 2020. Including capital expenditures, our free cash flow was just over $1 billion for the quarter and $3.3 billion year to date, yielding a conversion rate of 137% through the first nine months. The continued strong performance positioned us very well to achieve our target for the year of free cash flow conversion at or above 100% of net income. With respect to the status of the tax treatment of research and development expenses, I think everyone can sense that despite the broad-based bipartisan support for immediate expensing of these investments, the window of opportunity for action in 2022 is quickly closing.\n\nAs we've said all throughout the year, if the Congress acts to defer or reverse the capitalization requirement, we would expect free cash flow for the year at or above 110% of net income. Looking at capital deployment. Capital expenditures were $255 million in the quarter or 2.6% of sales. That's up from last year, consistent with our expectation to be around 2.5% of sales for the year.\n\nFor the first nine months, we're at 2.2% of sales, but 2.5% remains our full year target, so obviously an implied uptick in capital investments in the fourth quarter. We also paid $345 million in dividends during the quarter, bringing the total deployed in dividends and share repurchases through the first nine months to just over $2.1 billion. The net result at the end of the third quarter was a cash balance of $2.5 billion and a net debt position just under $9 billion, down over $1.5 billion from this time last year. Net interest expense in the quarter was $86 million, down from $99 million in the third quarter of 2021.\n\nThat brings the interest expense for the first nine months of the year to $279 million, down from $331 million for the same period in 2021. At this point, we continue to expect our interest expense for the year to be approximately $380 million, including the assumed repayment of $1 billion of notes that mature in the fourth quarter. The tax rate in the quarter was 14.3%, bringing the rate for the first nine months to 15.1%. This is consistent with our guidance last quarter to expect a lower rate in the third quarter and a higher rate in the fourth.\n\nSo no change to our outlook of 16% for the full year, which, of course, implies a higher tax rate in the discrete fourth quarter. One more comment on the tax front. The inflation Reduction Act, which was signed into law in August included a 15% corporate minimum tax and a 1% excise tax on stock buybacks. We don't expect either of these provisions to have a material impact on our financial results.\n\nOrder activity and backlog were once again a strong story in the third quarter with a 1.1:1 book-to-bill for the company as a whole. As mentioned earlier, aerospace continued to have a strong order activity with a 1.2 times book-to-bill in the quarter and 1.6 times over the trailing 12 months. On the defense side, the combined book-to-bill was 1.1 times, with each of the segments achieving a book-to-bill of at least one time. We finished the quarter with a total backlog of $88.8 billion, while total potential contract value, including options and IDIQ contracts was $125.8 billion.\n\nThe increase in backlog was particularly notable given a headwind from foreign exchange rate fluctuations of approximately $275 million in the quarter and $650 million year to date, with the vast majority of the impact in combat systems. Incidentally, the FX fluctuations also negatively impacted combats revenue by $55 million in the quarter and $123 million in the first nine months of the year due to the surging dollar versus the euro and the British pound. But for the FX headwind, the combat systems group's revenue would have been up by 5.6% in the quarter and down only 3.9% for the first nine months. That concludes my remarks, and I'll turn it over to Howard to start the Q&A.\n\nHoward Rubel -- Vice President, Investor Relations\n\nThanks, Jason. [Operator instructions] Operator, could you please remind participants how to enter the queue?\n\nOperator\n\n[Operator instructions] Our first telephone question today comes from Seth Seifman of J.P. Morgan. Seth, please go ahead, you may begin.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nThanks very much. Good morning. Sorry, Jason, to waste a question on pension here, but you guys are a little bit different than your peer group in terms of the way that you account for things. When we think about where interest rates and asset returns are year-to-date and we think about the income below the line next year, where that might migrate to you.\n\nAnd when we think about the cash impact if any, in terms of the contributions that you would expect. Can you give us an update on that?\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nYeah. As you said, Seth, we are somewhat different from most of the peer group in this regard. And as a result, right now, we're not expecting anything material from an income perspective on the pension front. Obviously, that's something we'll roll up as part of our full operating plan process here in the fourth quarter and give you more specific detailed guidance in January.\n\nBut I think the bottom line is both from an earnings as well as from a cash perspective, we don't expect that at this point to be a material item.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nOK. Just to clarify, the $40 million or so of income below the line each quarter, that kind of continues?\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nSome version in that range. I don't have an exact number at this point. You can expect it to decline as you would modestly. But again, that's not 100% pension income there.\n\nIt's a big piece of that is pension income on the commercial side of the business. So it should down take a little bit, but not in a material way.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nOK. OK. And then maybe as a quick follow-up, we saw some news during the quarter about the Australian sub and the potential to do some work on that outside of Australia. And we all kind of know about the capacity constraints on sub building right now.\n\nMaybe could you talk a little bit about your thinking on that topic?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYeah. So we are driven entirely by the demand of our customer and the prioritization of our customers. So we're working with them, our U.S. Navy, to determine what the focus should be going forward.\n\nAnd as we work through these -- some of these capacity issues then how do we accommodate not only U.S. demand but potentially other demand.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. Thanks very much.\n\nOperator\n\nThank you for your question. Our next question today comes from David Straus of Barclays. David, go ahead.\n\nDavid Strauss -- Barclays -- Analyst\n\nThanks. Good morning.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nHi.\n\nDavid Strauss -- Barclays -- Analyst\n\nPhebe, were there any unusual costs at the aerospace segment in the quarter related to the 500, 600 software fix?\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nYeah. David, we did have, I think you're aware, some customer accommodation related to the software issue, both in the second quarter and the third quarter wasn't material to the results, but that has been absorbed in the numbers that you see, and is inherent in the improved margins that the group posted in the quarter.\n\nDavid Strauss -- Barclays -- Analyst\n\nOK. And it's completely behind nothing lingering in Q4, Jason?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nRight.\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nThat's correct. It's behind us at this point.\n\nDavid Strauss -- Barclays -- Analyst\n\nOK. Great. And a follow-up on free cash flow conversion. Given where you are year to date, I mean over 100% for the full year looks pretty conservative unless there's something unusual, I guess, from a working capital perspective that you're expecting in or baking in in Q4.\n\nCan you just elaborate on that? Thanks.\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nYeah. As you point out, the cash flow has been particularly strong through the first 9 months. So as I said in the opening remarks, we're very comfortable with the 100-plus percent for the year. To be completely candid, there's probably some opportunity for some upside there.\n\nIf I look at the things that we're monitoring, number one, to the first nine months, we've had a significant benefit from working capital reduction. Some of that's timing. So some of that could turn in the fourth quarter. We'll watch that.\n\nThe other big piece is, as I noted, we're still expecting or forecasting capex for the year to be in the 2.5% of sales range. So that implies a pretty meaningful uptick in capex in the fourth quarter. I'll acknowledge that often chased our capex forecast and rarely hit it. So there could be some upside opportunity there if we don't get everything in, in the year.\n\nBut if we do that, that's a headwind to the fourth quarter. And frankly, the third item is something that everybody continues to monitor and that is we need to resolve our situation on the Ajax program. So those are some of the things we're monitoring for the fourth quarter. We come through all that.\n\nAnd certainly, to your point, we have some opportunity for some upside.\n\nDavid Strauss -- Barclays -- Analyst\n\nThanks very much.\n\nOperator\n\nThank you for your question. Our next question today comes from Ron Epstein of Bank of America. Ron, you may begin.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Good morning.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nGood morning, Ron.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nJust maybe the supply chain question. It seems like you guys are navigating it really well. Most airplane companies today are having aren't going to deliver more than they thought they were going to deliver the opposite problem. So I guess my question for you is how is the supply chain going for Gulfstream? And then b, when you look at the defense business you have, you heard kind of across the sector, similar issues on chips and so on and so forth.\n\nHow is it going there?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nSo we've had a fair number of supply chain challenges on the aerospace side, which we have accommodated heretofore. But supply chain remains a potential challenge going forward. And as we go through our planning process in the fourth quarter, we get a lot more clarity airplane by airplane of what the supply chain is able to do. But we have so far managed.\n\nThere are, however, as you quite rightly note, a fair number of headwinds out there. On the defense side, we have accommodated most of the supply chain perturbations, except obviously in the Marine group. But most profoundly in the quarter and most impactfully is at mission systems. And while they had with a lot of the more pedestrian supply chain challenges, specialty chips continue to dog them and the additional delays that they experienced in the quarter were very, very hard for them, in fact, impossible for them to overcome.\n\nMission systems is a very high-performance organization, and they produced several high-value complex products that have experienced delays before, but again, even beyond some of the chip problems, some of the specialty products going into that production those production lines were also impacted. So the Mission System is credit. They have taken a lot of cost-cutting and restructuring initiatives to offset the margin impact and earnings impact of the revenue decline, but we're going to have to work through some of that. And so more to come as we look into the fourth quarter and then into next year.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Got it. And then maybe as a follow-on, on the labor side, what are you seeing across the businesses, right? We clearly hear from the Navy that they want to have more shipbuilders out there. But I mean what are you seeing across all the businesses you have in the portfolio in terms of skilled labor?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYeah. So there are some across the businesses, there are some specialty engineering and specialty fields that have had some headwinds on labor, but those are beginning to resolve in terms of manufacturing, we had some perturbation in -- we've had a lot of perturbation in the labor market, but felt that, particularly at constant point, but that's beginning to resolve itself. When you think about shipbuilding, shipbuilding is a very complex, high-touch labor business. And when you have a nationwide perturbation in the labor market is going to be impacted.\n\nI mean while we kept open, not all of the supply chain did, but we also lost a number of experienced shipbuilders as well as experienced people manufacturing folks in the supply chain. So all of that at a higher level than we normally experience. And I don't think that we are alone in that. People took the opportunity in the middle of the pandemic to retire.\n\nSo we've got to work through some of that. But ultimately, we do not see and I think this is an important point here. We do not see labor as constraint for our revenue growth at the moment. Certainly not in the longer term.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Our next question today comes from Rob Stallard of Vertical Research. Rob, please proceed.\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nGood morning. Phebe, your comments suggest that we're finally seeing some of this strong defense demand turning into orders. But what sort of time line are you expecting for these orders to actually convert into deliveries?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYou talking about combat?\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nWell, across the defense divisions, but firstly, combat. Yeah.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYeah. Let's talk about Combat because I think -- and then we can talk if you want a little bit about technologies. And before I get to combat, marine is pretty clear. The orders continue to be healthy.\n\nThe revenue projection, while you have some quarterly lumpiness, it signifies nothing for the long-term growth. With respect to combat, we saw a number of things in the quarter, primarily Stryker and Abrams as well as MPF is beginning to ramp up as in Poland. And we saw some munitions orders also related to the Ukraine. So I suspect that -- and if we parse through, we focus in on the Ukraine, what we anticipate that our U.S.\n\nArmy customers telling us they want more ammunition and munitions. So we're working with them to ramp up production. In Europe, we've seen demand for bridges because frankly, a lot of water in Europe. And we've got a very nice business in Germany to provide river crossings at various widths and weight levels.\n\nAnd then we're seeing -- beginning to see increases in vehicle orders and vehicle RFPs coming out, particularly, but not exclusively in the former Eastern block. So technologies is really, I think, a tale of two cities. GDIT has had good bookings. They grew last year.\n\nWe anticipate them to grow this year. This is all about mission systems, as I think, tried to give you a fair amount of detailed color on what's impacting them. The demand for their high-value products is out there. It's just our -- the inability to deliver because of the supply chain is constraining some of the orders, but they're there.\n\nThey're just waiting to be executed once we get through all of this, and we will, we will get through it.\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nSo just to follow up on combat, and these orders you've had from Europe, for example, is there roughly a 12-month to two-year lead time between the contract getting signed and actually GD delivering?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nCompletely depends on the product. Less so on the bridge side and it depends and again, less so potentially on the vehicle side, it just depends on the vehicle, and exactly what modifications or changes folks want. We're not looking at clean sheet vehicles. We're looking at changes to existing vehicles that we have updated consistently and throughout the years.\n\nSo it will depend. I suspect a year, in some cases, 18 months. Certainly, I don't expect a whole lot more than that.\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nYeah. It was great. Thanks so much.\n\nOperator\n\nThank you. Our next question comes from Myles Walton of Wolfe Research. Myles, please go ahead.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nThanks. Good morning.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nHi, Myles.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nI know that there's the $1 billion maturity coming in November, but curious maybe, Phebe, how you're thinking about capital deployment in a broader sense, obviously, cash flow coming in ahead of expectations. I think. Go ahead.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYeah, yeah. No, no, no. And that's a very good question. Our capital deployment priorities remain the same.\n\nBut let me give -- ask Jason to give you a little bit more color on the details.\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nYeah. I think the way to think about it, Myles, we've talked about the $1 billion coming due in November. We do plan to pay that down. When you think on the debt side, we'll have additional maturities coming up in 2023, and that's where we said we'll start to look, think back to the CSRA acquisition and the additional debt we took on, we would bring it down to a point where it's some undefined point in the future, we'd start to think about whether we've hit the right level or not.\n\nAnd I think when we get into next year, we'll start to have that conversation in a more substantive way in terms of decision making. When you look at the other elements, share repurchase, as you know, is always tactical and opportunistic. It was a very volatile market in the third quarter. So we were a little more hands off just kind of trying to see what -- where things shake out, but that doesn't change our long-term approach to share repurchase in a tactical and opportunistic way.\n\nAnd I think importantly, the dividend is always going to be there. You've always heard us talk about that, and we'll continue to expect to be on that trajectory that we've been on for the past quarter century, frankly. So as Phebe said, no changes in the deployment strategy. It will just be a matter of what's in the moment in a given quarter.\n\nAnd I think importantly, our cash flow performance and our liquidity resources afford to see optionality to address all of those priorities without having to forgo one for the sake of the other.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nAnd just a quick follow-up, Phebe said, it's the M&A market attractiveness. Is that improved become worse the same?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nWe're just not going to comment on M&A. So I think we can leave it at that. You want one more shot, one more question?\n\nMyles Walton -- Wolfe Research -- Analyst\n\nNo. I'll stay through. I don't want to get Howard angry.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYes. That's a scary thing, Isn't it?\n\nOperator\n\nThank you. Our next question comes from George Shapiro of Shapiro Research. George, go ahead.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nYes. Jason, I wonder if I could pin you down a little bit as to how big a number of the software fixes were in the margin for Gulfstream in the quarter. Are we talking a few million dollars or something more?\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nGeorge, I don't actually have a discrete number on the software fix. I mean, I have a sense of the overall R&D budget and that sort of fits into that context. So I think as David asked earlier in terms of impacts to aerospace in the quarter, you saw the nice margin improvement, frankly, even a little bit ahead of where we were expecting, which is why as Phebe alluded, we think we'll -- the group perform better for the full year. But even within those strong results in the quarter, we did have an impact, an adverse impact in terms of the accommodations we made with customers on the 500, 600 airworthiness directive.\n\nAgain, that's fully behind us. And we are in a, at this point, sustained elevated R&D mode. Part of that was the resources that were diverted from the 700 over to the 500, 600 AD fix, and that will sustain through next year, as we've talked about as we continue toward certification of the 700 and then ultimately the 800. So I'll give you a little more color around that, but I apologize, I don't have a discrete number around the airworthiness directed fix.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nOK. And then a quick one, Phebe, a usual question. There's a $59 million difference between the gross and the net bookings in aerospace. Was that a cancellation? Was it FX related? Or if you can quantify that?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nAll of the above. I mean really absolutely immaterial.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nOK. And let me sneak in one last one.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYou're risking Howard's ire. Go, George.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nI always got Howard's ire. That's OK. when you commented about your deliveries in '23 and '24, it presupposed the book-to-bill of one. Obviously, we've run a lot better than that.\n\nSo are you thinking of changing those delivery forecasts or just stay conservative with the delivery forecast that you have out there?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nNot at the moment. We assumed 1:1, and at the moment, I don't see any reason to change that. But as we go through our planning process, to the extent that we need to modify it, we certainly will and we'll be very explicit about that in the fourth quarter.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nOK. Thanks very much.\n\nOperator\n\nThank you. Our next question comes from Kristine Liwag of Morgan Stanley. Please go ahead.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nKristine. Hello?\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nHey. Sorry about that. You guys hear me.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYep.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nOK. Great. Thanks. Good morning, everyone.\n\nAnd Phebe, on international defense sales, we're seeing changes in relationship between the U.S. and Saudi Arabia. With your foreign military sales to Saudi Arabia through Canada, how do we think about this evolving relationship potentially affecting your business?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nWe see no indication of that in a moment. You want to ask one more.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nYeah. Following up on what George was asking about on aerospace. I mean book-to-bill was at one time at aerospace. We've seen this above two times in the past few quarters.\n\nBut at the same time, the backlog is at record levels. Can you provide some color on the demand resilience you're seeing? Is this a demand from corporate customers, individuals? And then also, is there some sort of level of backlog where you're comfortable at so not to extend the duration of when people have to wait for their aircraft. Any color you could provide there would be really helpful.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nSure. So we -- let's take your question in the inverter. We always watch the delivery times for our aircraft to our customers. And so far, that's all been manageable.\n\nWell, just to remind you, starting in mid-February of last year, we frankly entered the hottest in notranic demand market that I've ever seen. And the order level in the quarter was by any measure, spectacular. So we've seen strong U.S. demand, Fortune 500 Mideast, Southeast Asia.\n\nAnd our demand interestingly, and I think not surprisingly, our pipeline going into the fourth quarter looks very much like the pipeline going into the third quarter. So at the moment, we've got some pretty good visibility of what orders look like.\n\nOperator\n\nOur next question comes from Cai Von Rumohr of Cowen. Cai, please go ahead.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nYes. Thanks so much, and good results, Phebe.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nThank you.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nSo how is the software accommodation split between the second and third quarter. And as we look going forward, with that out of the way, and presumably R&D flat to down and volume up, what should we look for about the margins in the fourth quarter and going forward?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nSo we'll see some margin upside, which we alluded to or about stated rather, in our guidance for the year. But the software fixes work almost entirely done by the end of the second quarter and the financial issue, it's about 50-50. So we're -- we like where we are. And frankly, you haven't asked this, but let me just give you a little bit of transparency around that.\n\nThe transparency of the engineering resources that -- and the cooperation between the FAA and the Gulfstream was very strong and very apparent throughout that process. So we expect that kind of relationship to continue.\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nIf I could add just one thing. Cai, there was a predicate in your question that R&D would be coming down, we don't yet expect R&D to be coming down. If you look through next year with the 700 and the 800 will remain at a sustained and potentially even elevated level next year. So I just want to make sure that point is also clear.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYes. Good point.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nExcellent. And as a follow-up, if we turn to GDIT, you mentioned $3.5 billion in protest, $17 billion in bids awaiting. How does that compare with the second quarter? And given that they lifted the occupancy restrictions at DoD in the middle of September, have we seen a pickup in any of that flowing through to bookings?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nYeah. We have. But tell me again what the first part of your question was?\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nWell, you had $17 billion in business awaiting at $3.5 billion in progress.\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nSome of the protests have resolved to our favor. And these are -- when we say protest, these are items that we've won that have been protested. And we've got one in there that's got to be approaching the federal level of number of protests. So hopefully, we'll get through that in the fourth quarter.\n\nAnd I think there's -- it's down somewhat, as I said because they've resolved. But we still see a fair amount of proposals in the decision-making cycle, which has, as we've said elongated. But even given that, GDIT continues to grow.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nThank you, very much.\n\nOperator\n\nOur next question comes from Ken Herbert of RBC. Ken, proceed.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nYes. Good morning. Thank you. I wanted to first ask on the schedule for the seven and the 800.\n\nIs it fair to assume that resources that were diverted from the 700 are now 100% back on that program? And in the last few months, considering issues, OK, great, considering issues on the five and six have been resolved. Are you seeing anything else from the FAA that could potentially put entry to service schedules at risk?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nSo as I said, we've cooperated very well with the FAA. We expect that to continue. I would note that we learned a lot in that process of how to work through the new software requirements from the FAA. I think that, coupled with the fact that the G700 is the most mature aircraft to enter the FAA certification process as a result of its software system and considerable and successful testing that preceded FAA review.\n\nWe see -- we're sticking with our at the moment with our summer 2023 estimate. But look, when we give you sort of our best guess on when the certification is. That's a result of a lot of things that we control and that we can talk about with certainty. But ultimately, this is an FAA issue, and it's the availability of their resources, and they are the regulator and they're going to control it.\n\nSo we've always tried to be transparent about that, but recognize that the U.S. government controls ultimately the pace.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nOK. Very helpful. And if I could, just one quick follow-up. On the defense side, how would you look at the risk of your business if for whatever reason, we have a continuing resolution that extends into calendar '23?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nAt the moment, we don't see a particular risk. And if we get three to four quarters in the entire year of a CR, which I find in this threat environment, very difficult to imagine. And we'd have to come back at you. But nothing we hear would suggest that it's the desire of Congress to do that.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Doug Harned of Bernstein. Doug, please go ahead.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nGood morning. Thank you. When you look at the demand you're seeing at Gulfstream right now, can you give us kind of a picture of how this looks? And what I mean is we're seeing a lot of things such as first-time customers going straight to large cabin jets, perhaps shifts in international versus U.S. Can you give us a picture of what that outlook is today for you? And has that changed some over the past couple of years?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nSo I think you and I, a couple of years ago, had a discussion about structural versus cyclical change. And I still think it's premature to see any to declare that there's been a structural change. We've certainly seen some increase in first-time buyers, but that was in part because a lot of wealth was created during the pandemic. The higher the pandemic.\n\nSo I don't have exact data about what's in the pipeline, but I can imagine that it will be much different than this quarter, which is heavy U.S. Fortune 500, again, Southeast Asia and the Middle East.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nAnd then just switching over, earlier when you talked about munitions, this is something that also looks like -- it looks like there's a lot of potential growth here. How do you think about this? I mean, I think of it as a high-margin business for you within Combat and potential to have orders well beyond that 3.70 that you got this quarter?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nSo -- and I think I may have alluded to this in my remarks that, our customer has expressed an interest in increasing that demand. So we're working with them on increasing production. But I think your predicated about a high-margin business is not quite based. In fact, we are -- OTS where we do all of this work is a high-performance organization with respect to operating leverage.\n\nBut that comes from a very wide and vast portfolio. So we do OK, but I wouldn't say that they were additive.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nSo you don't think of it as a higher-margin business. I just thought traditionally, it was a higher-margin business than perhaps some of the other parts of combat vehicles, and that's not the case?\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nOTS, on occasion, will be a higher-margin business, but that's largely about mix, and it's not driven by one particular line of business. They've got an awful lot of contracts and the high-velocity contract turnover. So I think that's how you should think about them.\n\nHoward Rubel -- Vice President, Investor Relations\n\nThanks, Doug. Lisa, we'll take one more question, please. This will be our final.\n\nOperator\n\nOur final question today comes from Scott Deuschle of Credit Suisse. Go ahead.\n\nScott Deuschle -- Credit Suisse -- Analyst\n\nHey. Good morning. Thanks for taking my question. Jason, I think ROIC is something that you've historically been very focused on.\n\nAnd honestly, it's held up really well here despite the capital that you put in the business. So just curious, as you get past the bulk of the capex phase of marine working capital comes out of the business and you have margins reflected aerospace? Where do you think ROIC can go over the next few years?\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nIt's a great question. Obviously, as we've been in this period of extended investment, you'd expect to see ROIC become a little bit muted as a result. And we saw a little bit of a downtick in that during that investment period. But as we emerge having had essentially the investment period behind us.\n\nTo your point, we absolutely expect to see ROIC back on decline. We'll see that this year, and we expect to see it next year and beyond. So our targets over the long term ought to be back in the range as we were in prior to the investment period we entered into a few years ago, and that's what you should expect as well.\n\nScott Deuschle -- Credit Suisse -- Analyst\n\nOK. Great. And then Jason, does the recently announced facility expansion of Savannah, does that have any impact to the prior guidance you gave on '23 capex? Or was that embedded in the 2% figure you previously talked about? Thank you.\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nYeah. That's all embedded and now look we've given previously. So no change to those projections.\n\nScott Deuschle -- Credit Suisse -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. That concludes the Q&A session. I'll hand back to the management team for any closing remarks.\n\nHoward Rubel -- Vice President, Investor Relations\n\nThank you all for joining us today. As a reminder, please refer to the General Dynamics website for both our earnings release and, of course, our highlights presentation. If you have any other questions, I can be reached at 703-876-3117. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHoward Rubel -- Vice President, Investor Relations\n\nPhebe Novakovic -- Chairman and Chief Executive Officer\n\nJason Aiken -- Senior Vice President and Chief Financial Officer\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nDavid Strauss -- Barclays -- Analyst\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nMyles Walton -- Wolfe Research -- Analyst\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nScott Deuschle -- Credit Suisse -- Analyst\n\nMore GD analysis\n\nAll earnings call transcripts"
}