{
  "companyName": "VTEX",
  "companyTicker": "VTEX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/vtex-vtex-q2-2022-earnings-call-transcript/",
  "content": "VTEX (VTEX -1.83%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nJulia Vater Fernandez\n\nHello, everyone, and welcome to the VTEX earnings conference call for the quarter ended June 30, 2022. I'm Julia Vater Fernandez, investor relations director for VTEX. Our senior executives presenting today are Geraldo Thomaz, founder and co-CEO; and Ricardo Camatta Sodre, finance executive officer. Additionally, Mariano Gomide de Faria, founder and co-CEO; and Andre Spolidoro, chief financial officer, will be available during today's Q&A session.\n\nI would like to remind you that management may make forward-looking statements relating to such matters as continued growth prospects for the company, industry trends, and product and technology initiatives. These statements are based on our currently available information and our current assumptions, expectations, and projections about future events. While we believe that our assumptions, expectations, and projections are reasonable in view of the currently available information, you are cautioned not to place undue reliance on these forward-looking statements. Certain risks and uncertainties are described under risk factors and forward-looking statements sections of VTEX's Form 20-F for the year ended December 31, 2021 and other VTEX's filings with the U.S.\n\nSecurities and Exchange Commission which are available on our investor relations website. Finally, I would like to remind you that during the course of this conference call we may discuss some non-GAAP measures. A reconciliation of those measures to the nearest comparable GAAP measures can be found in our second quarter 2022 earnings press release available on our investor relations website. Now, let me turn the call over to Geraldo.\n\nGeraldo, the floor is yours.\n\nGeraldo Thomaz -- Founder and Co-Chief Executive Officer\n\nThank you, Julia. Welcome, everyone, and thanks for joining our second quarter 2022 earnings conference call. We're excited to announce that once again this quarter our GMV outperformed the overall commerce markets. That was driven by two key factor: first, our existing customers GMV growth outpaced the market, demonstrating the resiliency of our enterprise-focused customer base.\n\nSecond, new customers join our platform demonstrating their trust in the VTEX platform to add value even under the volatile macroeconomic conditions. As a testament to that, in Q2, our GMV grew year over year by 27.6% in USD, while global and Latin American e-commerce growth was flattish, just single-digit growth at most. We continue seeing VTEX consolidating its leadership position in Latin America. During the quarter, we delivered solid results in special events, such as hot sales in Mexico and tax-free day in Colombia, giving us confidence in the ramp-up of Mexico and the consolidation of more mature markets such as Colombia.\n\nAdditionally, we continue making solid steps forward in our international expansion, something that was noticed by industry experts, which I will address later though. Over the past couple of years, we were in a type investment cycle, an important phase for the tax that allows us to roughly triple our headcount and create a menu of future growth opportunities. Now, as part of the plan, it is only natural for us to prioritize the opportunities created and leverage our current structure to continue delivering strong growth. With this, VTEX is doubling down on the most promising growth opportunities in our menu.\n\nThis privatization of growth opportunities and setting of our optimal structure came up with the hard decision that included the layoff of 193 employees. We deeply appreciate and thank the hard work and commitment of those employees who were impacted by the layoff. We are happy to inform that approximately 50% of them have already found new opportunities, and we will continue helping to reallocate the remaining form of VTEX. Pursuing strong growth in a sustainable manner is not something new to us.\n\nVTEX was born in Latin America, we practically self-funded our growth into $100 million in ARR in 2020. We welcome and we are actually excited about demonstrating how we at VTEX can deliver strong and consistent top-line growth while being disciplined with our investments. We're confident in the future growth of the company and we feel the power of having all the taxes aligned in pursuing the enormous opportunities that we have in front of us. The underlying long-term trends from the sector continue to be affected.\n\nIn the shorter term, some of our key priorities for the remaining of the year will be to continue helping our customers outperform the market, keeping improving our gross margin, and optimize our expenses to gain operational efficiency. On helping our customers outperform the market, we will continue innovating to provide the infrastructure our customers need to accelerate the operations and stay relevant to consumers through multiple sales channels and fulfillment channels. And a great demonstration of how that translates into value add to our customers is that in the second quarter of 2022, as already mentioned, our customers GMV outperformed the Latin American e-commerce market. On gross margin, I'm extremely proud that we've been able to increase our non-GAAP subscription gross margin by 370 bps on a year-over-year basis.\n\nThis margin expansion was mostly driven by technology improvements, such as the migration of some of our cloud environments to more efficient processes, operating systems, and frameworks, among other initiatives. We also improved our service gross margin, which contributes to an overall non-GAAP gross margin improvement of 510 bps on a year-over-year basis. We expect to continue showing improvements in this line going forward, while also providing best-in-class service levels to our customers. On expenses, we will show significant operational leverage in the second half of the year without jeopardizing our growth in the short, medium, or long term.\n\nAs I mentioned before, we calibrated our organizational structure in order to deliver our adjusted priorities, which resulted in that one-off layoff expenses in Q2 on top of the already anticipated additional Q2 expenses related to the Tax Day, an event that is key for positioning our company among prospects, partners, and existing customers. In Q3, we expect to have a clean P&L that will start to clearly demonstrate the trajectory of our operating income. Now, moving to our commercial updates, in the second quarter, we continue to attract premier brands and retailers. Some new customers that went live this quarter that didn't have online store presence in their respective countries before were Elo, SumUp, ZeBrand in Brazil, Groupe Seb Andeans in Colombia, and BRF in Chile.\n\nAdditionally, new customers that migrated from other platforms that went live this quarter was the number [Inaudible] and Hering in Brazil, Garbarino in Argentina, Grainger and Citric in Mexico, Yamaha in Colombia, Momentum Textiles in the U.S., and Invitadisima in Spain. On top of that, we continued building and treasured sticking relationship with our existing customers. Some premier brands and retailers that expanded their operation with us opening new line stores in new countries during the second quarter were AB Inbev added the Dominican Republic in addition to nine other countries in Latin America, and Sugo added Mexico in addition to other four countries in Latin America. As mentioned last quarter, while the average number of months our new customers are taking to implement the VTEX platform continues to be above the historical average, we see no structural changes in the demand for the VTEX platform.\n\nTherefore, we continue to be encouraged by the long-term opportunity we have ahead of us. On that note, in May of this year, VTEX was named with a contender in the first wave, B2C Solutions Q2 2022. The Forrester report stated that VTEX has recently begun to succeed on its mission to gain a foothold in markets outside Latin America and that VTEX is strong in digital products and subscriptions. We are proud of this recognition, and we will continue to work hard on our international expansion as we see a strong feed from our product and sales traction is increasing according to plan in this new geography.\n\nWe know we cannot do all this alone. We believe in the multiplying force of collaboration. One of our key competitive advantages is our ecosystem, and that's why we will continue to nurture and expand our partners. Aligning with our payment partnership strategy shared last quarter, we are excited to announce that we launched a partnership with Adyen, the global payments platform of choice for many of the world's leading companies.\n\nWe're confident that the partnership brings a powerful value proposition to the ecosystem. Both companies are committed to enabling enterprise brands and retailers to start having an omnichannel operation that drives business growth and provides a consistent customer experience in offline and online channels. We are also focused on generating partnerships with independent software vendors, or RSV, to boost innovation and keep expanding the offering and customization layers available in our platform. VTEX acceleration program seeks innovative e-commerce-related solutions that can meet the needs of our customers.\n\nThe project is focused on fostering the global e-commerce ecosystem by integrating third-party apps with the VTEX app store. In the second quarter of 2022, we included a few new partners in this program. One of them was MailUp, who launched an app called Bizu in Brazil that helps customers have detailed control and analytics of the e-commerce operation. Another one was WoowUp, who added the CRM capability to our ecosystem, which enables us to already win customers.\n\nBefore wrapping up, I'd like now to revisit our four strategic priorities, focusing on our innovation update section and VTEX cases from our customers. But remember, Ken is a retailer which sells clothing and home appliances technologies, with two business units, and more than 400 stores in 200 series in Brazil chose VTEX for this headless approach. They wanted to implement continuous customization in the website and mobile app while avoiding any limitations. Additionally, they wanted a solution that enabled them to keep a consistent experience between channels, providing a true omnichannel experience.\n\nThe internal team from Pernambucanas, with the support of the VTEK team was able to implement this complex case in only five months, achieving our clients go to reformulate the online experience in an impressive timeline. Last quarter, we mentioned that we were going to have our first live shopping event in the West. Now looking back at the results, our customer experience and a time increase in conversion rate from viewers during that event, which led them to consider leveraging live shot, not only for product launches, but also for sales events, social media campaigns, and product demonstration. Live stream is a global trend, and we are encouraged to see our solution continue to penetrate our customer base.\n\nIn fact, this quarter, we had 231 live shopping events, which represents a quarter of a quarter an increase of almost 80%. Briggs & Stratton, world's largest producer of air-cooled petrol engines for outdoor power equipment, chose VTEX in the West for the B2B project, with three different business units supporting multilanguage and motorcar with one single account. They use it to run the operation with two different parts of forms and decided to relaunch with us in a single e-commerce platform, resulting in a more consistent user experience, improving maintainability of the platform, leveraging all of our out-of-the box e-commerce features, including, for example, our quick order app which provides a frictionless process to place orders. Embargosalobestia a home appliance retailer in Spain with 20 physical stores choose us to help them with our robust omnichannel capability in order to scale up their sales and unify the multiple sales channels.\n\nThe company has been experiencing a high-growth trajectory over the last five years. In fact, they were recently included in the list of top 1,000 highest growth companies in Europe by the Financial Times. The in-house developer website was facing difficulties is scaling up given the growth of SKUs. The customers wanted to grow both the physical and online operations, generating synergies between them, a clear need for robust omnichannel capabilities.\n\nThey were also focused on improving the overall performance and usability of the website. They are now leveraging VTEX, improving the checkout statistics, conversion rates, and other key commerce performance metrics, while also building a true omnichannel strategy by integrating the physical stores and other sales channels. On the development platform of choice for digital commerce, we're proud to announce that we continue attracting developers to our local platform, gaining momentum in the community, and scaling our capabilities. Monthly active developers accessing VTEX developer portal increased to more than 28,000 in the second quarter of 2022, from more than 24,000 in the first quarter of the same year.\n\nWrapping up the operational update section, I would like to thank our 1,560 VTEX that are working to fulfill our mission, as well as our customers, partners, and investors. Now, I will turn the call to Ricardo so he can cover our financial progress reports for the quarter.\n\nRicardo Camatta Sodre -- Chief Financial Officer\n\nThank you, Geraldo. Hi everyone. It's a pleasure to be here to update you on our financial performance for the second quarter of 2022. This quarter, our revenue increased to $38.7 million, a year-over-year increase of 25% in U.S.\n\ndollars, and 20% on our FX neutral basis. Subscription revenue reached $36.6 million in the second quarter of 2022 from $29.7 million in the same quarter last year, a year-over-year increase of 24% in U.S. dollars, and 17% on FX neutral basis. This quarter, subscription revenue accounted for 95% of total revenue versus 96% in the same quarter last year, explained by the implementation of our backlog, which leads to increases in our services revenue.\n\nNon-GAAP subscription gross profit was $26.6 million, compared to $20.4 million in the second quarter of 2021. Non-GAAP subscription gross margin was 72.5% in the second quarter of 2022 compared to 68.8% in the same quarter of 2021. The 370-basis-points year-over-year margin expansion reflects operational hosting improvements as we migrate noncore hosting services and optimize our codes -- clouds in computing usage. On top of the non-GAAP subscription gross margin expansion, we also improved our services gross margin, which led to an overall non-GAAP gross profit reaching $25.7 million, representing a year-over-year increase of 36% and a margin improvement of 510 basis points.\n\nOur non-GAAP total operating expenses increased to $43.3 million in the second quarter of 2022 from $29.4 million in the same period last year. This resulted in our non-GAAP loss from operations to be $17.5 million during the second quarter of 2022, compared to $10.4 million in the second quarter of 2021. The increase in expenses and loss from operations was primarily due to VTEX Day and one-off layoff expenses. Both accounting is slightly more than $5 million with the VTEX Day representing the majority of this amount.\n\nAlong these lines and when you foresee you had all those previous comments, we expect not only to continue delivering gross margin improvements but also to see significant operational leverage in our expenses in the second half of 2022. Leverage on the expenses side will come from our already well-invested structure, as well as a result of the hard decision of laying off 193 employees, a decision we handled with transparency, respect, and utmost responsibility. Our end market and business model make us confident in our ability to demonstrate attractive capital allocation, achieving top-line growth for many years to come. Our non-GAAP operating income margin from existing stores has ranged between 35% and 15% in 2020, 2021, respectively, giving us a clear path to continue executing our growth plans, while also seeing our potential operating margin opportunity.\n\nAs of the three months ended June 30, 2022, in June VTEX had a negative $12.7 million free cash flow compared to $14.7 million negative free cash flow in the second quarter of 2021. Since the beginning of 2022, we've been working diligently to optimize our working capital, which resulted in an improvement in cash flow despite the one-off expenses already mentioned. These improvements in working capital is a result of operational improvements in our collection of receivables, as well as procurement optimization in our prepaid expenses and accounts payables. Regarding our future outlook, we continue to see macroeconomic uncertainty impacting our new stores' average time to implement the VTEX platform, as well as generating volatility in our existing customers' GMV performance.\n\nWe had a solid performance in Q2, and for the second half of the year, we will continue focusing on helping our customers outperform the market while also improving our gross margin and operating income margins. In the third quarter of 2022, although we are entering into cleaner comps macroeconomic conditions remain uncertain. Therefore, we are currently targeting revenue in the $37.0 million to $38.0 million range for the third quarter of 2022, implying a year-over-year growth of 18% in U.S. dollars and 20% on FX neutral basis in the middle of the range.\n\nFor the full year 2022, despite the incremental volatility, we maintain our FX neutral year-over-year revenue growth target of 24% to 27%, implying a range of $158 million to $162 million based on July average FX rates. VTEX is well positioned to navigate the current environment. We have clear visibility of our path to break even. We are capitalized with over $250 million in liquidity in the balance sheets.\n\nConsidering our excess liquidity after funding our organic growth plans, we see three key areas as potentially interesting capital-allocation opportunities. We could use part of this capital to pursue M&A opportunities. Although they -- the mass gap between public and private markets may pose short-term challenges over the medium and long term, this could be an interesting capital deployment opportunity. We could also use part of his capital to accelerate our international expansion.\n\nAlthough in the early and intermediate stages of international expansion, capital should be deployed with caution over the medium and long term, as we see clear evidence of commercial traction, this could be an interesting capital allocation. Finally, as approved by our board of directors, we now have shares repurchases as an additional tool for capital deployment, which could be useful in moments of market dislocations. We will always digitally evaluate these options and allocate capital in the best interest of long-term shareholders of the company, based on the evaluation of market conditions, and applicable legal requirements. Wrapping up today's call, we are clearly adding value to our customers by helping them outperform the market.\n\nWe continue to have a strong backlog undergoing implementation. We have an expanding gross margin and expect to deliver operating income margin improvements in the second half of the year. All these together give us confidence in our business today and in the long-term opportunity, we have ahead of us. We continue focusing on what makes VTEX unique.\n\nOur blue chip and resilient customer base, the quality of our platforms, technology, products, and features, and a strong and difficult-to-replicate ecosystem. With that, let's open it up for questions now. Thank you.\n\nOperator\n\nThank you. We will now begin the Q&A session. [Operator instructions] The first question is from the line of Fred Mendes with Bank of America. You may proceed.\n\nFred Mendes -- Bank of America Merrill Lynch -- Analyst\n\nHello. Good afternoon, everyone, and thanks for the call. I have two questions here. The first one you mentioned again, a client in the U.S., Momentum Textiles, it looks like it's wrapping up this operation.\n\nSo, if whatever you can share in terms of the profile of these clients, the roadmap for gaining for the market share in the U.S. I mean, I think -- any ways, any kind of information on the U.S. market would be great. That'd be my first question.\n\nSecond question. When I look for the guidance in 2022, if I consider what you already delivered and the $38 million in the third Q, the top of the range for the third Q, you'd need to deliver something like $47 million in the fourth Q is like 23% acceleration quarter over quarter, which is higher than what happened last year. So, just how confident here are you in terms of reaching this guidance considering that 4Q need to be a strong one in order to deliver the numbers for the year? Thank you.\n\nMariano Gomide de Faria -- Founder and Co-Chief Executive Officer\n\nOK. So, I'm going to -- Mariano here. I'm going to answer for the expansion in the U.S. and then I will pass through to Sodre.\n\nSo, on the U.S. we keep seeing strong pipeline. We are seeing a change on the profile a little bit more organic leads are coming. This is good.\n\nIn our view, this is the recognition of our visibility, increasing our ability to generate our own deals. And the pipeline is planned to be stronger as we are announcing those at the beginning of the year. So, all the clients that we are implementing in the U.S., it is following the plan. The momentum that you saw in the client, it is -- we're going to continue to focus in midsize B2B as Briggs & Stratton, as we put [Inaudible] them.\n\nWe're going to continue to focus in migration of old legacy platforms. And we are pretty much confident that we will be able to deliver the momentum that we plan to the U.S.\n\nRicardo Camatta Sodre -- Chief Financial Officer\n\nPerfect. And Mariano, just to complement the second question. Hi, Fred, it's Ricardo Sodre here. Thanks for the question.\n\nRegarding the implicit guidance right for Q4. So, we believe Q4 may show some acceleration versus Q2 in our guidance for Q3. That will be driven mainly by fourth quarter 2022 seasonality more aligned with previous years than the fourth quarter 2021 seasonality, which was a little bit weaker than usual, as well as the GMV performance of our existing customers, and the ramp-up of our recently implemented new customer. And those are the key drivers for some acceleration in the fourth quarter.\n\nFred Mendes -- Bank of America Merrill Lynch -- Analyst\n\nPerfect, super clear. Thank you, Mariano. Thank you, Ricardo.\n\nOperator\n\nThe next question is from the line of Clarke Jeffries with Piper Sandler. You may proceed.\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nHello. Thank you for taking the question. You know, from a high level, Ricardo, you guided to 20% FX neutral growth, you hit the 20% FX neutral growth, and you're maintaining the full year. I mean, I guess beyond the GMV trends, and sort of adjusting for that, what are you seeing in terms of pipeline bookings? And especially, comparing to Q1, how is the appetite changed as 2022 is going on?\n\nRicardo Camatta Sodre -- Chief Financial Officer\n\nYeah, thanks. Happy to start and others to complement. So, yeah, for the second quarter, we delivered the 20% FX neutral growth in the middle of the guidance. And we are guiding for 20% and we have the guidance for Q3 as well.\n\nAnd we are maintaining the guidance for the year. As we mentioned in the prepared remarks, we continue to see strong demand for the tax platform. E-commerce continued to have very attractive long-term opportunity, the omnichannel strategy, and integrating different channels, both on the sales side and on the fulfillment side. It's almost important for the brands and retailers out there.\n\nVTEX helps a lot on that. So we continue to see strong demand for the VTEX software. And that's the most important driver for the long term of the company. Right? Macroeconomics and uncertainties does impact some volatility in the GMV of our existing customers.\n\nBut that's taking into account in our guidance for three years as we see it right now.\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nAll right, perfect. And then, anyway, to help us think through how to think through the margin expansion for the second half the year. Is it -- might it be fair to say that operating expenses could go back to Q1 levels, and then stay there for the rest of the year or any kind of insight there to help us think through what's possible on an expansion basis?\n\nRicardo Camatta Sodre -- Chief Financial Officer\n\nYeah, great question. Yeah. So we appreciate the opportunity to share some additional details on this topic. We believe a good way to look at it is that our layoffs reduced our headcount by roughly 10%.\n\nAnd we are also optimizing other expenses not related to headcount at a similar level. Therefore, after excluding the effect -- the layoff impacts from our Q2 expenses, you could expect 10% savings going forward. So in other words, that will translate into slightly more than $1 million savings per month going forward.\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nPerfect. Thank you very much.\n\nRicardo Camatta Sodre -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. The next question is from the line of Diego Arago with Goldman Sachs. You may proceed.\n\nDiego Aragao -- Goldman Sachs -- Analyst\n\nYes. Hi, thanks for taking my question. Two questions, if I may. The first one is maybe a follow-up on the previous one related to the passcode initiative started during the quarter.\n\nI guess, Ricardo, what can you share with us regarding let's say, any efficiency programming place? And how should we be thinking about potential impact at the EBITDA level, right? And not only like for the next quarters but just want to understand how this could structurally impact your business and eventually also change your views regarding the breakeven at the EBITDA level that if I'm not mistaken, was expected for the end of 2023. So, this is the first question. Thank you.\n\nRicardo Camatta Sodre -- Chief Financial Officer\n\nGreat. Thanks, Diego, for the question. So maybe first, starting from the end there on the breakeven, as mentioned in the previous earnings call, right, we are aiming to reach non-GAAP operating income by the fourth quarter of 2023. That continues to be our commitment.\n\nThe recent adjustment that we mentioned, the layoff is a clear demonstration of this commitment. Now, if there is an opportunity to reach breakeven sooner while not impacting our growth plans, we will definitely pursue it. So I think that's on the timing there. On EBITDA level impact, as I mentioned in the previous question from Jeff, the optimization that we did in our organization structure should create savings of roughly slightly more than a million dollars per month going forward.\n\nSo if you remove our total expenses for Q2 was roughly $43 million, $43.3 million. So, we move a slightly more than $5 million that we had, from the tax day and layoff expenses, you'd get your $38 million, or something around that neighborhood. And then if you remove these, slightly more than $1 million per month, there'll be kind of the expected expenses going forward. And then with that, you can have a sense of the EBITDA impact.\n\nHopefully, I answered the question, Diego. But if it's not clear, please, please do a follow-up question.\n\nDiego Aragao -- Goldman Sachs -- Analyst\n\nNo, no, this is this was very, very helpful, Ricardo. Thank you for that. And I guess we can jump into the second question, which is regarding the profitability of existing customers versus new customers. As I understand, the operating margin for existing stores in 2021 was around like 50%, which compares to a negative margin of 100%, 200% for new stores opening the same year.\n\nBut I was just wondering if you can comment about, let's say, the long-term margin for those existing clients, as your business mature, right? So how we should be thinking about those margins in the long term? I guess that's a question. And maybe if I can follow up on Fred's question regarding the profile of customers you are adding, particularly in the U.S. and Europe. I just want to understand if you are adding new brands to your portfolio, or if you are adding brands that have been using the VTEX platform in Latin -- in these regions.\n\nThank you.\n\nRicardo Camatta Sodre -- Chief Financial Officer\n\nGreat, Diego. So, starting with the margins on existing customers and how they're evolving long term, so we are not providing long-term margins for the business. But we do believe that breaking down our P&L between the existing customers' P&L and the new customers' P&L, as we are doing on a yearly basis, it's very helpful to understand the potential margin of the business. And as you mentioned in 2021, our existing customers' P&L had roughly 15% non-GAAP operating margins.\n\nIf you look back in 2020, this was actually 35%. So, this shows the margin opportunity that we have ahead of us. And over time, we customers tend not to change their margins after they turn from new customers into existing customers, right? Now, as we have been showing over the past few quarters, we are improving our subscription gross margin which is the driver for the gross margin of the existing customers, and we believe there's an opportunity to continue improving the gross margins. So, I think on the second question was more related to customers in the U.S.\n\nSo, Mariano, if you want to take that one?\n\nMariano Gomide de Faria -- Founder and Co-Chief Executive Officer\n\nYeah, yeah. So, on the expansion of brands, we are seeing brands expanding with VTEX. We can mention, for example, Whirlpool that launched in India with us. So, it is a global contract with Whirpool and every single new country that is being added.\n\nIt is added value for VTEX, and we're very proud to support global clients like Whirlpool, Motorola, AB Inbev, and others. So it's organic as they go, as they're moving forward on their own kind of digital transformation. We are the backbone of it. On the profile of the clients in the U.S.\n\nand in Europe, we are focusing in two profiles: midsize B2B companies, midsize online versions for enterprise companies like Briggs & Stratton. It is one like a ACA that's already one that we disclaim. So, we are seeing momentum on these midsize B2Bs of enterprise in the U.S. and in Europe.\n\nAnd the second one is the migration of legacy platforms on the B2B side on a B2C side. So, those will be -- you can expect those as the profile of the clients that we're going to be adding in the next year in the U.S. and Europe.\n\nDiego Aragao -- Goldman Sachs -- Analyst\n\nSounds good, Mariano, and Ricardo. Thank you. Thank you, again.\n\nOperator\n\nThank you. [Operator instructions] The next question is from the line of Josh Beck with KeyBanc. You may proceed.\n\nUnknown speaker\n\nHey, guys, this is Maddie on for Josh. Just to double click a bit on what we were just talking about. And in terms of your capital-allocation priorities, what kind of investments do you think you need to make internationally from this point with the momentum that you're seeing? And could any of that be achieved through M&A? Are you looking through M&A from a product perspective or a geo perspective or any other color that would be helpful? Thanks.\n\nMariano Gomide de Faria -- Founder and Co-Chief Executive Officer\n\nSo, Mariano here, and please I invite Sodre and Geraldo to complement. The capital allocation, we will be always open for M&A. As we always be, what we are seeing is that we will be very curated in the way we analyze them and the opportunities right now in this market in this location. So we want to see the kind of -- the right prices for the right companies with the right values.\n\nSo we will always be looking for M&A. But this is not the case that we are seeing like heavy opportunities right now in the market. The other way, we will continue to invest in our organic growth. That's -- this is our kind of plan -- has been always our plan.\n\nAnd we will continue to invest in our organic growth in Europe and U.S. We were very conscious with allocation of our investments. We have this playbook of VTEX that gives us every unit of economics in each region that we are acting to be very responsible in how we go to market in those countries. And we are on track in our plan, and these should be shown in our numbers.\n\nRicardo Camatta Sodre -- Chief Financial Officer\n\nAnd Mariano, just to complement. Sorry just to complement on that. I believe we have a well-invested structure in U.S. and Europe that we are looking to continue leveraging going forward.\n\nOn many opportunities, we see some gaps in the data mask between private and public markets. So that's something that we are mindful of in the short term. And as the question was also related to capital allocation, right, we also have now to do share repurchase as an additional option for capital allocation, right? So as a high-growth company, we will prioritize our organic growth plans, international expansion, product development, and M&A opportunities. Now, considering the excess liquidity that we have in our balance sheets, as well as current market volatility, having the ability to do share repurchase during market dislocations could be a very attractive capital allocation to the long-term shareholders as well.\n\nUnknown speaker\n\nAwesome. And just one follow-up for me. Do you have any color on where you feel your most defensive verticals are in the perspective of your total GMV going forward? Thanks.\n\nGeraldo Thomaz -- Founder and Co-Chief Executive Officer\n\nHello. Hello, this is Geraldo. Nice to talk to you. I would say that the ideal customer profile of VTEX right now and in the future are customers that sell in multiple channels and have several physical stores.\n\nThey can be grocery retailers. They can be fashion brands. They can be B2B companies. As long as they are omnichannel, they want to serve multiple channels through a single source of truth.\n\nWe're the platform, that's the ideal customer profile for us.\n\nUnknown speaker\n\nThanks. I appreciate the color.\n\nOperator\n\nThank you. There are no questions remaining in the queue. I'd like to pass the call back over to Geraldo for closing remarks.\n\nGeraldo Thomaz -- Founder and Co-Chief Executive Officer\n\nWe are encouraged about our results in the second quarter and excited about the results to come. As we are already seeing opportunities coming from the engineering sales and product with top line coming at strong pace, we can control the macro. But we can for sure be bold in our actions in order to help our customers navigate this environment with the right set of tools to accelerate the business and tried higher than the market growth. Our discipline in capital allocation will continue to translate into high-growth company with an extraordinary commitment to its mission to become the backbone for commerce globally.\n\nThe opportunity we have ahead of us is huge. E-commerce penetration in Latin America still has a long road ahead. While on top of that, our journey outside of the region is just starting. None of the fundamentals changed.\n\nEnterprise brands and retailers need to partner with companies such as VTEX to build a proper omnichannel strategy in order to stay relevant. The best is yet to come. Thank you, everyone, for joining us today. I'm looking forward to update you about the progress in our next earnings call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJulia Vater Fernandez\n\nGeraldo Thomaz -- Founder and Co-Chief Executive Officer\n\nRicardo Camatta Sodre -- Chief Financial Officer\n\nFred Mendes -- Bank of America Merrill Lynch -- Analyst\n\nMariano Gomide de Faria -- Founder and Co-Chief Executive Officer\n\nClarke Jeffries -- Piper Sandler -- Analyst\n\nDiego Aragao -- Goldman Sachs -- Analyst\n\nUnknown speaker\n\nMore VTEX analysis\n\nAll earnings call transcripts"
}