{
  "companyName": "Cloudflare, Inc.",
  "companyTicker": "NET",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/cloudflare-inc-net-q3-2022-earnings-call-transcrip/",
  "content": "Cloudflare, Inc. (NET -0.33%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Cloudflare Q3 2022 earnings call. At this time, I would like to hand the call over to Mr. Jayson Noland. Please go ahead, sir.\n\nJayson Noland -- Head of Investor Relations\n\nThank you for joining us to discuss Cloudflare's financial results for the third quarter 2022. With me on the call, we have Matthew Prince, co-founder and CEO; Michelle Zatlyn, co-Founder, president, and COO; and Thomas Seifert, CFO. By now, everyone should have access to our earnings announcement. The announcement, as well as our supplemental financial information, may be found on our investor relations website.\n\nAs a reminder, we'll be making forward-looking statements during today's discussion, including but not limited to, our customers, vendors, and partners' operations and future financial performance; anticipated product launches and the timing and market potential of those products; the company's anticipated future revenue, financial performance, operating performance, non-GAAP gross margin, non-GAAP net income or loss, non-GAAP net income or loss per share, shares outstanding, non-GAAP operating expenses, free cash flow, non-GAAP tax expense, dollar-based net retention rate, paying customers, and large customers. These statements and other comments are not guarantees of future performance, but rather are subject to risks and uncertainties, some of which are beyond our control, including but not limited to challenging general economic conditions, including foreign exchange, inflation, rising interest rates, and other impacts of the ongoing COVID-19 pandemic and Russia-Ukraine conflict. Our actual results may differ significantly from those projected or suggested in any forward-looking statements. These forward-looking statements apply as of today, and you should not rely on them as representing our views in the future.\n\nWe undertake no obligation to update these statements after this call. For a more complete discussion of the risks and uncertainties that could impact our future operating results and financial condition, please see our filings with the Securities and Exchange Commission, as well as in today's earnings press release. Unless otherwise noted, all numbers we talk about today other than revenue will be on an adjusted non-GAAP basis. All current and prior-period financials discussed are reflected under ASC 606.\n\nYou may find a reconciliation of GAAP to non-GAAP financial measures in our earnings release on our investor relations website. For historical periods, a GAAP to non-GAAP reconciliation can be found in the supplemental financial information referenced a few months ago. We would also like to inform you that we will be participating in the RBC Capital Markets Global Technology, Internet, Media, and Telecommunications Conference on November 16th and the Credit Suisse 26th Annual Technology Conference on November 30th. Now, I'd like to turn the call over to Matthew.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nThank you, Jayson. We had a strong quarter even as the economic environment has continued to be challenging. We generated $254 million in revenue, up 47% year over year. Unsurprisingly, the slowdown in the economy we discussed on the last two earnings calls is starting to show up on our top-line revenue number.\n\nEven with those economic headwinds, this quarter marked a milestone for us, crossing through $1 billion in annualized revenue. Only 6% of public software companies achieved this milestone, so we're proud to have crossed it, but nowhere close to finished. We added 4,197 paying customers for a total of 156,000 paying customers. For large customers, those that pay us more than $100,000 per year, we had 159 new large customers for a total of 1,908, up 51% year over year.\n\nLarge customers now account for 61% of revenue. And our large customers keep getting larger. The number of customers over $500,000 in annual spend grew 88% year over year. And customers over $1 million grew 63% year over year.\n\nEven with inflation hitting some of our costs, our gross margin held strong at 78.1%, still above our target gross margin range of 75% to 77%. We achieved a record operating profit of $14.8 million, representing an operating margin of 5.8%. We are confident we can deliver meaningful operating margins over time but continue to plan to hold them near breakeven as long as we're able to deliver exceptional revenue growth. Our dollar-based net retention in the quarter was 124%, flat year over year and down from 126% last quarter.\n\nWhile there is some noise in that number based on when contracts renew, we will continue to be dissatisfied until it's over 130%. And we believe that is still very achievable as we add seats and storage-based products, like Zero Trust and R2. We are proud to have crossed through $1 billion in annualized revenue, but it has us thinking about our next milestones. While there are economic challenges for every business in the near term, we know that the opportunity Cloudflare has ahead for the long term is massive.\n\nEven as we achieve $1 billion, we have penetrated less than 1% of our identified market for products we already have available today. That's why we're confident we're on the path to organically achieved $5 billion in annualized revenue over the next five years. Less than 1% of all public software companies reach the $5 billion milestone. And while today's global economy will continue to present headwinds in quarters ahead, as we look further out, we are confident we have the products already in market to get us there.\n\nCrossing the $1 billion milestone is also an opportunity to reflect on our team. It's a natural, normal process to have different leaders for different stages in a company's life. Earlier this year, Chris Merritt, who runs our sales team, reached out to me and Michelle to say that, while he wasn't in a hurry, he thought it made sense for someone else to take us to the next milestone past $1 billion. Chris himself is a unicorn.\n\nHe started at Cloudflare almost 10 years ago as our first sales hire. He grew our revenue from $0 to $1 billion. I tried to count the number of sales leaders to accomplish that and have come up with fewer than 10 across all the history of software. I wanted to give Chris the floor for a second to recognize him and all he's accomplished and helped us build at Cloudflare.\n\nChris Merritt -- Chief Revenue Officer\n\nThanks, Matthew. I remember meeting with Michelle all the way back in 2013 as Cloudflare was looking for someone to build its sales organization. It was very clear from that very first meeting that the opportunity at Cloudflare had was just incredible. Fast forward to present day, and I'm so proud of the team we've built that brings Cloudflare's products to market to solve real problems for our customers.\n\nIt is a truly world-class organization doing amazing work. And as Matthew said, I had a terrific run, and I decided the billion-dollar mark was the right time for me to transition out and bring in another leader for the next phase of Cloudflare's growth. I worked closely with the team to help identify the great leader we found to do that, and I'll continue to be involved to help with a smooth transition through at least the end of the year. What a great 10-year journey it's been, and I'll always believed the Cloudflare Orange.\n\nBack to you, Matthew.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nThanks, Chris. We couldn't have gotten here without you. As Chris said, he worked closely with us over the last several months to identify the right person to lead our sales team going forward. The person we found is terrific.\n\nHe understands enterprise sales from his time as a senior leader in Oracle, can help accelerate our Zero Trust go-to-market based on his experience in the identity and access management space throughout the desires of developers as we turn workers into a massive business, and recently led sales for Twilio, another software-as-a-service company, which grew more than 50% organically compounded during his tenure to a $4 billion annualized run rate. Marc Boroditsky is uniquely qualified to take us to our next milestone and beyond. I wanted to give him the floor to talk a bit about why he joined Cloudflare.\n\nMarc Boroditsky -- President of Revenue\n\nThank you, Matthew. I've been on the team now for a little over a week, and I couldn't be more thrilled. I was very fortunate to attend Cloudflare's recent customer day in San Francisco. In all my years at similar events, I've never seen more engaged customers of all types who are eager to do more with us as a strategic partner.\n\nLet me tell you, what's especially compelling about Cloudflare is the breadth of solutions that are a part of our platform today. We don't need to go out and buy companies. We don't need to invent new technologies. I see a clear path to $5 billion in five years simply by selling what we already have in the bag to the customers that already know us.\n\nThat's an incredible opportunity and what compelled me to join the Cloudflare team. Back to you, Matthew.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nThanks, Mark. We are excited for you to build on the great team Chris has put in place and further mature our go-to-market efforts as we sell more products to larger and larger customers. With that set up, let me tell you about some customer wins last quarter. A Fortune 500 technology financial services company signed a one-year $2.8 million contract.\n\nThey faced an increasing number of sophisticated cyberattacks. They compared us against nearly all of our competitors. While the competitors tried to offer lower pricing, it didn't matter. This company was so convinced that we were the clear technical leader that they paid a premium for our services.\n\nThey see the value of our integrated approach and are now evaluating us to be their Zero Trust provider as well. A Fortune 500 pharmaceutical company expanded their relationship with Cloudflare. They signed an additional $915,000 three-year deal, bringing their total contract over that period with us to $7.4 million. They're adopting our data localization suite powered by Cloudflare Workers.\n\nThis product allows customers to process data locally in the countries where their customers reside. These features are unique in the industry to Cloudflare and increasingly important to highly regulated customers like this one. A Fortune 500 European telecom signed a three-year $1.2 million deal. The customer was moving more of their security services from on-premise hardware to the cloud.\n\nWhile they evaluated our security services as best of breed, the showstopper for them again was our data localization suite. None of the other vendors they considered, including the hyperscale public cloud, had an equivalent solution. We're seeing more and more EU companies adopting Cloudflare in order to meet the increasing data localization and data residency requirements becoming law in the region. A Fortune 500 retailer expanded their relationship with Cloudflare, signing a $442,000 deal and bringing their annual commitment to nearly $1 million.\n\nThey are using workers to build highly scalable functions across their e-commerce application. They're also using Cloudflare's network to route traffic between different hyperscale public cloud vendors they use. Being multi-cloud as a priority for them, and Cloudflare is the only vendor they see as being able to help them achieve their vision. They've started experiments with R2, our object store, and D1, our first database.\n\nWhile their spend is still modest, we think there's an opportunity. And they've expressed interest in making us one of their strategic vendors going forward. A Fortune 500 life sciences conglomerate signed a $745,000 three-year deal. They use a range of our products, including Magic Transit, to better protect their on-premise data centers.\n\nThey're handing traffic directly to our network, completely replacing their ISP. We've signed an MSA with them and believe there's a significant opportunity to expand across their other 20 subsidiaries. A Fortune 500 apparel company signed a three-year $1.1 million deal. They bought our full set of security services, as well as Cloudflare Workers.\n\nA fun fact that my co-founder Michelle, had an opportunity to be this company's CEO's chief of staff out of business school. Instead, she chose to start Cloudflare. And now, they are our customer. A Fortune 500 consumer products company expanded their relationship with us, signing an additional $292,000 one-year deal.\n\nThat brings their total spend with us to nearly $1 million per year. They are using our Zero Trust product, and we worked with a large channel partner to win and service them as a customer. A Fortune 500 financial services company signed a $236,000 one-year deal. We believe this will be another example of how we can land with one product, sign a general MSA, and then expand over time.\n\nIf you've been counting, that's a lot of Fortune 500 companies. And we're actually up to 32% of the Fortune 500 now using us. I see a clear path to nearly every Fortune 500 company using us for something in the next five years. And a big part of Marc and the team's job there is to expand those relationships and then get them to use us for everything.\n\nWe aim to be the network for every Fortune 500 company. But not just the Fortune 500. In Q3, a large building materials manufacturer in Europe signed a $1.2 million 31-month expansion deal. They have broadly adopted our Zero Trust products across their 25,000 employees.\n\nThey've been hit by a ransomware attack earlier this year that their existing email security vendor failed to catch. We included our Area 1 email security product as part of their Zero Trust solution, something no other Zero Trust vendor provides in native integration. During our POC, we caught phishing messages that other existing vendors missed. They went from POC to live in two days and signed the deal a week later.\n\nThey've been a small customer previously but turned to us for an integrated solution the minute they had another network security need. And we delivered. Finally, a large software monitoring company signed a $3.6 million expansion deal, bringing their annual spends of more than $5 million. They're a big user of Cloudflare Workers, processing 7 trillion requests just in September.\n\nThey're migrating more and more of their application from AWS to Cloudflare Workers for our performance and easy scalability. In a few weeks, we have our upcoming developer innovation week, where we'll be announcing some incredible new Cloudflare Workers milestones. But I couldn't resist sharing a few here now. As of the end of Q3, we're up to 2.2 million unique applications running on Cloudflare Workers.\n\nCloudflare Pages, which is a product within the Cloudflare Workers portfolio, is up to 367,000 project and has doubled since May. In September, we announced that R2 was now generally available along with our other generally available storage products, Workers KV and Workers Durable Object. We are now storing over a petabytes of customer data. And before the end of the quarter, D1, our first database product, will be available in open beta.\n\nIncreasingly, we're hearing about more and more start-up companies that are skipping the hyperscale public cloud and building exclusively on Workers. Reflecting that trend, in September, we announced the Workers Launchpad Funding Program, in which 26 of the top venture capitalists collectively earmarked up to $1.25 billion in funding for innovative new start-ups building on Cloudflare Workers. The funding program came about because DCs kept coming to us to do due diligence on companies they were considering investing in when more and more of their tech stacks were powered exclusively by Cloudflare Workers. So, from the Fortune 500 to the hottest new start-ups, increasingly, the future seems powered by Cloudflare Workers.\n\nI wanted to close by reminding everyone in the United States that we have an election next Tuesday. That makes this a time of heightened cybersecurity concerns for the country. During Cloudflare's Athenian Project, we provide our services for free to any state and local officials who help oversee elections. Today, election authorities in more than half of the U.S.\n\nstates and most of the so-called battleground states are participants in the Athenian Project. We are proud that we helped cyberattacks not be part of the story in the 2020 election. We have our teams standing by, and they'll be available 24/7 over the next week to help ensure cyberattacks won't be part of the story for 2022 either. So, we'll do the thing we're best at.\n\nYou, don't forget to vote. With that, I'll turn it over to Thomas. Thomas, take it away.\n\nThomas Seifert -- Chief Financial Officer\n\nThank you, Matthew, and thank you to everyone for joining us. As Matthew mentioned, we achieved an important milestone in the third quarter, surpassing $1 billion revenue run rate for the first time. This milestone is a testament to our enormous market opportunity, our ability to land and expand larger enterprise customers, and the durability of our subscription-based revenue model. Turning to revenue for the quarter.\n\nTotal revenue for the third quarter increased 47% year over year to $253.9 million. Area 1, the email security company we acquired in April, again contributed less than 1% of revenue this quarter. While we are seeing foreign exchange headwinds and global economic uncertainty impact the business, we continue that traction upmarket and believe we are very well-positioned in this environment. From a geographic perspective, the U.S.\n\nrepresented 53% of revenue and increased 49% year over year. EMEA represented 27% of revenue and increased 51% year over year. APAC represented 13% of revenue and increased 28% year over year. APAC performance has improved meaningfully from last year, but we are seeing more price sensitivity and buying decision delays in the APAC region.\n\nTurning to our customer metrics. In the third quarter, we had 156,000 paying customers, representing an increase of 18% year over year. Similar to last quarter, we saw a higher level of churn in our pay-as-you-go customer base, primarily due to more customers shifting down to our free customer tier. We think that's a function of a more challenging macro environment.\n\nHowever, we are pleased to see these customers to remain on our platform. Turning to large customers. We ended the quarter with 1,508 large customers, representing an increase of 51% year over year and an additional 159 large customers in the quarter. We were pleased to see large customer revenue contribution increase again sequentially.\n\nWe're also encouraged to see the quality of wins continue to increase across the Fortune 500 in a broad array of verticals, including consumer, retail, healthcare, life science, pharmaceutical, industrial, telco, and financial services. While sales cycles at the high end of the business have elongated, we continue to see our 500,000-plus and $1 million-plus cohorts scoring faster than top-line revenue. We also achieved the milestone of 75 customers larger than $1 million in the third quarter. Our dollar-based net retention was 124%, representing a decrease of 200 basis points sequentially and consistent year over year.\n\nThe decline was primarily driven by less net expansion. We have not seen elevated churn. As we mentioned previously, while we expect DNR to continue to trend upward over time, we expect some variability quarter to quarter. We continue to target 130%-plus dollar-based net retention rate, given our momentum with large enterprise customers and the net expansion characteristics of fee-based solutions.\n\nMoving to gross margin. Third quarter gross margin was 78.1%, representing a decrease of 80 basis points sequentially. Network capex represented 13% of revenue in the third quarter. We expect fiscal 2022 network capex to come in at the lower end of the 12% to 14% range due to the timing of purchases and inherent efficiencies in the network.\n\nTurning to operating expenses. Third quarter operating expenses as a percentage of revenue decreased 7% sequentially and 6% year over year to 72%. Our total number of employees increased 42% year over year, bringing our total number of employees to approximately 3,180 at the end of the quarter. We will continue to invest in the business.\n\nSo, as we mentioned last quarter, we continue paced hiring based on current market conditions. Sales and marketing expenses were $103.5 million for the quarter. Sales and marketing as a percentage of revenue decreased 3% sequentially and decreased to 41% from 45% in the same quarter last year. Research and development expenses were $46.4 million in the quarter.\n\nR&D as a percentage of revenue decreased 2% sequentially and decreased to 18% from 19% in the same quarter last year. General and administrative expenses were $33.6 million for the quarter. G&A as a percentage of revenue decreased by 2% sequentially and decreased to 13% from 14% in the same quarter last year. Operating income was $14.8 million compared to an operating income of $2.2 million in the same period last year.\n\nThird quarter operating margin was 5.8%, an increase of 150 basis points year over year. Overseas operating expenses benefited from the strengthening of the U.S. dollar, which contributed to the increase in operating profit. Turning to net income in the balance sheet.\n\nOur net income in the quarter was $19.1 million or net income per share of $0.06. Tax expenses for the quarter was $1.7 million. We ended the third quarter with $1.6 billion in cash, cash equivalents, and available for sale securities. Free cash flow was negative $4.6 million in the third quarter or 2% of revenue compared to negative $39.7 million or 23% of revenue in the same period last year.\n\nOperating cash flow was $42.7 million in the third quarter, or 17% of revenue, compared to $6.9 million, or 4% of revenue, in the same period last year. As stated previously, we continue to expect to be free cash flow positive in the second half of 2022. Remaining performance applications, or RPO, came in at $831 million, representing an increase of 9% sequentially and 52% year over year. Current RPO was 75% of total RPO.\n\nBefore moving to guidance for the fourth quarter and full year, I would like to reiterate our expectations in light of the uncertainty in the macroeconomic environment. While we saw foreign exchange benefit to operating expenses, we also saw FX headwinds to revenue as we offered concessions to offset the strength of the U.S. dollar internationally. In the quarter, we observed an increase in our sales cycle and expect similar sales dynamics to continue, leading to longer lead time deal closures.\n\nWe are cognizant of the increasingly cautious environment and have factored this into our outlook. Now, turning to guidance. For the fourth quarter, we expect revenue in the range of $273.5 million to $274.5 million, representing an increase of 41% to 42% year over year. We expect operating income in the range of $12 million to $13 million, and we expect net income per share of $0.45, assuming approximately 343 million common shares outstanding.\n\nAnd we expect a tax expense of $1.9 million. For the full year 2022, we expect revenue in the range of $974 million to $975 million, representing an increase of 48% to 49% year over year. We expect operating income for the full year in the range of $31 million to $32 million. And we expect net income per share over the period in the range of $0.11 to $0.12, assuming approximately 342 million common shares outstanding.\n\nWe expect a tax expense of $6.1 million. Also, challenges to remain in the current environment, we are confident in the continued growth of our business and the durability of our subscription model. Before closing, I would like to let you know that Jayson Noland, our head of strategic finance and investor relations, is leaving us. This is happy and sad news.\n\nHappy for him to pursue his first CFO opportunity at a pre-IPO software company, but sad to lose such an integral member of the team. I want to thank him personally for his leadership and partnership and wish him great success in his next chapter. In closing, I'd like to thank employees for their continued dedication in delivering exceptional service to our customers, partners, and communities. And as Matthew mentioned, now that we have reached $1 billion revenue run rate, we are setting our sight from the next milestone of $5 billion in five years.\n\nWith that, I'd like to open it up for questions. Operator, please pool for questions.\n\nOperator\n\n[Operator instructions] And we will go first to Phil Winslow, Credit Suisse.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nHey, thanks for taking my question. One for Matthew and then a follow-up for Michelle and Thomas. Matthew, obviously, you've talked about the macro for a couple of quarters now. When you look across Cloudflare's portfolio, obviously, it's broad, you know, Zero Trust services, network services, application services, developer platform.\n\nWhere have you seen the most impact to the business? And then, conversely, what has actually held up the most? And then, a follow on for Thomas and Michelle. You talked about it being, you know, keeping your eye on hiring relative to revenue growth. What are the puts and takes that you're seeing there, trying to balance, obviously, the long term $5 billion target, but also the sort of the near-term realities.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nYeah. So, I'll start and then hand it off to Thomas and Michelle. So, I think that what we have been seeing, and I think we've been very transparent about talking about is that the velocity of sales at large companies, especially -- and especially in getting new logos is slowing down. It feels like everyone right now is measuring twice to cut once.\n\nAnd, you know, I think we started to see that as we've talked about on previous calls in December of last year. And you're seeing some of that slowness and new business now flow through and hit our top line. What I think is continuing to hold up extremely well right now and, in fact, in some cases we're seeing acceleration is in the security portion of our business. While it is worrisome that the global conflicts that we're all watching in multiple parts of the world, that is putting more pressure on companies to make sure that their security is in a good place.\n\nAnd so, I think that, while, as I said last quarter, the economy, the macro economy is challenging right now, and we have said that, I think, consistently for the last the last three calls, we do believe that we are very well-positioned. And I continue to say that I wouldn't trade places with any other CEO at any other company.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nGreat, and then on --\n\nThomas Seifert -- Chief Financial Officer\n\nIn terms of hiring --\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nYes.\n\nThomas Seifert -- Chief Financial Officer\n\nSo, you know, you saw that our employee had gone through 42% year over year in the quarter. I think we've been very restrained when it came to corporate functions and G&A expenses. But we have made sure that we hire our sales capacity and our go-to-market functions in a way that we are not hindering our -- the potential and the opportunities that is in front of us. So, we tried to be very balanced where we slow down, and we have been very strategic where we added headcount in terms of numbers, but also in terms of footprint from a regional perspective.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nGreat. Thanks for taking my question.\n\nOperator\n\nYour next question comes from Matt Hedberg, RBC Capital Markets.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGreat, guys. Thanks for taking my questions, Matthew, in your prepared remarks, you noted economic headwinds that you've been talking about the last couple of quarters have showed up here. I wonder if you, or if Marc's in the room, too, can talk a little bit about, perhaps, what your sales force can do to kind of navigate these headwinds. Is it a different sales motion? Is it a different way to engage the customer? Just sort of curious on, you know, how sales organizations adapt to these headwinds.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nYes. So, first of all, I don't think there's anything that has dramatically changed this quarter and at this time versus what we were seeing earlier in the year. And so, I think the adjustments that we made in terms of our go-to-market strategy are actually things that we've made previously and we've seen positive benefits from those changes. The nature of subscription businesses is that if you see slowdowns in the beginning of the year, they show up in your top line later in the year.\n\nBut the things that we did that I think have been successful and will continue to be successful is really focusing on how do we get to know the customers that already know us and trust us? How do we sell more to those customers from the broad portfolio of products that we have? And how do we make sure that they are getting all of the value from Cloudflare? And one of the things that I think we are hearing over and over again is that as companies are thinking about how can they reduce their cloud spend, how can they rationalize it, how can they make sure that they are getting the most out of the IT dollars that they're deploying, over and over and over again, we are able to deliver services that help companies save money, get better performance, get higher reliability, get more variability at a, you know, multi-cloud environment, and make sure that they are secure. And so, as we look at our customers, they see us more and more as a strategic partner on making sure that they're getting the most out of every IT dollar they spend. The -- go ahead.\n\nThomas Seifert -- Chief Financial Officer\n\nI just wanted to put an additional comment on it. I'm just coming back from a customer trip in Europe at the time where it's meant to set their security products are holding up nicely in light of all the security and threat concerns we see out there, leading heavier on the intelligence we have. We just launched a threat intelligence product, Cloudforce, a couple of weeks ago, leading on this effort we have in terms of the intelligence and the insight we have is helping us, especially with opening up the doors with new logos.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThat's super clear. And then, maybe Matthew, obviously, R2 is early, but it's great to hear the success already with a petabyte of storage. Can you talk about what sort of customers you're seeing leverage these? Are these some of your biggest strategic customers? Are they -- just maybe a little bit of color on where you're seeing that usage?\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nYeah. So, in the quarter, the usage was mostly still during our beta period. And so, the users of that product have primarily been developers that are using it to build new services or small teams within larger organizations. What I think that we'll see now that it is out of beta as of the very end of the quarter is that you'll see much more large companies who are looking to figure out how they can reduce their cloud spend and make sure that they can have a multi-cloud presence adopt R2 services.\n\nAnd so, we're talking to very large companies about moving more and more of their stored objects to where we can store that with R2. And one of the benefits is not only can we help them save money on the egress fees, but it allows them to then use those objects across any of the different cloud platforms they're using. So, by being that neutral third party, we can let people adopt a little bit of Amazon, a little bit of Microsoft, a little bit of Google, a little bit of SaaS vendors, and share that data across all of those different places. It actually -- the use case that makes putting data in the network one of the things, which is really valuable.\n\nAnd I think you'll, quarters to come, see larger and larger companies adopt that as the object store for their company.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nSuper helpful. Thanks, guys.\n\nOperator\n\nNext up is Brent Thill, Jeffries.\n\nBrent Thill -- Jefferies -- Analyst\n\nMatthew, one of the key things we keep hearing is this theme of consolidation that you're using in a lot of pockets of organizations, and many are saying that they could consolidate. Do you feel, over the next year, you can use that to your advantage? Is there a sales motion or an opportunity you're starting to see where you're getting, you know, wider enterprise license agreements to take on more and more solutions?\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nYeah, Brent. I think that we are extremely well-positioned to help companies ferret out any type of savings that they can find across their organization. And the conversations that we're having are very much around how can companies consolidate their vendors into what are those critical vendors that provide services and how can they really save money in the process of doing that. The fact that we've got as broad a portfolio of products as we do means that what we're seeing is more and more companies are adopting the complete Cloudflare Network.\n\nAnd I think the way that that shows up in the numbers is the fact that, you know, our customers that are over $500,000 a year spend over $1 million a year spend are growing faster than our overall revenue growth rate and our overall customer growth rate. And so, I think that's a good indication that our customers are doubling down and using more of our services. I think that's going to make it a more challenging environment for those cloud solutions that are out there and that we will increasingly take share and help be that strategic vendor to become the network for our customers.\n\nBrent Thill -- Jefferies -- Analyst\n\nAnd can I just quickly clarify with Thomas. The slowdown that you're seeing, did you see that more pronounced in small and mid versus large? Or did you see it against mid and large?\n\nThomas Seifert -- Chief Financial Officer\n\nI see you see -- in each one of the segments you mentioned, you'll see some impact. You know, we talked about pay-as-you-go downgrading to free, saying our customer stay on the platform but downgrading. We see elongated sales cycles at the very high end in that very large customer cohort. And we see, you know, the expansion in the mid-market segment and slow down a bit, churn.\n\nThey didn't churn off, but the expansion was a bit harder. So, it really depends on what segment you look at.\n\nBrent Thill -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nOur next question today comes from James Fish, Piper Sandler.\n\nJames Fish -- Piper Sandler -- Analyst\n\nHey, guys. Thanks for the questions. Matthew, you highlighted that Fortune 500 retail win with Cloudflare is kind of that glue between the hyperscalers. And you also said you see Fortune 500 penetration getting to 100% over time.\n\nI guess, how are you balancing that strategy of being that glue or fabric between the hyperscalers versus being that full infrastructure as a service offering alternative to the hyperscalers? And how does that success of one or the other change your view or ability to hit that $5 billion goal five years from now?\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nI think I think that our approach is very different than the hyperscalers. The hyperscalers sort of start from the inside and work their way out. We are starting from the outside and working our way in. And what I mean by that is fundamentally what Cloudflare is, is a network.\n\nAnd we want to be the best network to connect anything online, to connect cloud to cloud, cloud to home office, cloud to remote office, cloud to branch office. Anything that is having to be connected by a network, we want to be that network. There are things that make a ton of sense to live in the network itself. So, for instance, a shared object that you're going to use across Google and Microsoft and AWS.\n\nSo, now R2 makes a ton of sense because we're not going to charge you the egress tax to be able to access that across all of those different platforms. You're also going to, for some applications, want to make some parts of the application as fast and as scalable and as reliable as possible. And so, those parts can live inside of Cloudflare. But our strategy is not to completely recreate every single thing that the Hyperscalers do.\n\nWe want to be the best network that is there. And there will be places at the margins where we absolutely will compete with them. And again, I think increasingly, we're seeing that companies are able to build entire applications using the Cloudflare stack in a way which is much more modern and much more reliable. But we're never going to be the place that you can lift and shift SAP HANA.\n\nThat's just not what we're building. Instead, what we're building is for those applications that need to live inside the network for either the performance, reliability, compliance requirements, and the data that live inside the network for those same reasons. We want to be the network to be able to do that. I think regardless, you know, we see, with the products that we have in market today, a clear path to getting to $5 billion of revenue.\n\nAnd that doesn't assume any M&A. We believe that that is through organic -- organically that we can get to $5 billion of revenue in the next five years with the products that are in market today. And so, I think that we don't have to -- the hyperscalers don't have to fail for us to succeed. We actually see ourselves as much more of that glue between them.\n\nAnd whether companies want to be multi-cloud or not, they all are. And so, that glue is critically important. And again, I think we provide the only solution as we see companies that are trying to struggle with reconciling that increasingly multi-cloud world.\n\nJames Fish -- Piper Sandler -- Analyst\n\nThomas, maybe for you. Is there any way to understand the impact or adoption of that monthly to annual conversion with Enterprise specifically this quarter? You know, are customers actually looking for staying with shorter duration just given the macro uncertainty? Or are they alternatively looking to lock in for longer on the infrastructure side? Thanks, guys.\n\nThomas Seifert -- Chief Financial Officer\n\nGood question. As we said in the past, you know, the moving from monthly billing and contracts to annual is our biggest lever on our path to delivering free cash flow. In a world, especially outside of North America, where exchange rates are high, customers are more resistant to lock in. And, you know, we don't want to discount too much in order to lock in lower revenue in a world of difficult exchange rate.\n\nSo, we have been more consilient, I think, to customers and partners in general in this environment and have not pushed as hard, you know, moving forward in this transition. But it is still the biggest lever we have. And it's an opportunity that is in front of us, and it will materialize in our free cash flow numbers moving forward.\n\nOperator\n\nOur next question will come from Shaul Eyal, Cowen.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nThank you. Good afternoon, guys. Matthew, on Area 1, when you've acquired them, I think you've indicated they can assist you in taking you guys deeper into the cloud community. How is that coming along thus far? And maybe any commentary about win rates versus Zscaler, maybe even Palo Alto, that you flagged in recent quarters?\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nYes, sure. So, Area 1 team is amazing. And I think they brought to us three distinct things. The first is a product, which I think is a natural gateway to our overall Zero Trust solutions.\n\nThe second is a world-class threat intelligence team, which we are now turning into a product, both to sell to our existing customers and also as a great way to attract new customers and create some of the marketing around the threat intelligence that we do. And then the third is a really much deeper and more mature understanding of channel through some of their leadership that we have -- that we've brought on board. And again, I think that has matured, helped us mature what our channel strategy has been. I think looking at Area 1 in particular, we're seeing particular strength in Asia, actually around the Area 1 product.\n\nAnd I think our sales team, especially in Japan, has done a great job selling the Area 1 product. We're seeing a lot of it. And that's the straight email security product. And once we have got someone using the email security product, it's a very natural extension for them to turn to the rest of our Zero Trust product.\n\nI think in addition, the threat intelligence team has helped us win larger and larger customers and being able to help customers understand if something goes bump in the middle of the night, what's going on has been something that is -- the Area 1 team, again, has really helped us with. And then, again, the channel -- our channel strategy, you're seeing more and more of our deals, especially in the Zero Trust space, come through our channel. Our win rates against Zscaler and Palo Alto Networks continue to be very strong. Our product in that space competes extremely well with them.\n\nThat is -- the challenge and the thing that I think we are continuing to work on is just increased awareness in the market. And that's something where, as we were thinking about who is the right replacement for Chris, you know, Marc's background in identity and access management both at Oracle and at Twilio, he really understands that market, and I think is going to help us increase the awareness that's there. But when a customer is considering going on their Zero Trust journey, if we're in that consideration, we love our win rates in that. And so, our job is now just to increase our awareness and go from the company that people might have known us for doing one thing is today a much more sophisticated, much more broad portfolio.\n\nAnd I'm excited as that grows. And I think that Zero Trust is very much going to be the story of the next few years to come.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nThank you.\n\nOperator\n\nWe will take the next question from Hamza Fodderwala, Morgan Stanley.\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nMatthew, and, perhaps, Thomas as well, I wanted to dig in a little bit around the net expansion point. And you spoke a little bit about this already. But just to get more specific, you know, we're hearing from a lot of cloud service providers around rationalization. Matthew, you spoke a little bit about how the costs there are getting too high.\n\nBut as it relates to Cloudflare, are you seeing any of that rationalization as it relates to your usage and expansion? And obviously, you have a very different pricing model as a subscription-based company, and this is kind of where Thomas comes in. How do you expect that to play out mechanically over the next few quarters as we likely see these expansion rates continue to be impacted? Thank you.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nYes, I think that if you are a usage-based, a purely usage-based model, it is a place where people are looking for areas to save money. Similarly, if you are a seat-based model, as you're seeing some companies, you know, do layoffs or, at a minimum, not expand their seats, that is something that is challenging in the current environment. I think we are fortunate that, today, most of our revenue is not usage-based and not seat-based. And so, while we are adding products that are in both of those categories, and we think that over time that that will be an expansion driver for us, that today, we're not seeing that downward pressure from people trying to rationalize or consolidate their bills.\n\nI think the one place which Thomas referenced, where we are seeing some pressure is actually with new accounts because we bill all in U.S. dollars. That is putting some pressure, especially outside of the United States. And we are making concessions in order to accommodate what are the foreign exchange pressures that are there.\n\nAgain, though, it's less about our existing customers trying to figure out how to use less of us. In fact, if anything, we're seeing that they are trying to say, how can we use more of you instead of using what are some of the other consumption-based alternatives which are out there. So, I think we have been less exposed to that downward pressure than some of the pure consumption-based services that exist.\n\nThomas Seifert -- Chief Financial Officer\n\nThat was a very complete answer. I have nothing to add.\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nYeah. Thank you for the clarification.\n\nOperator\n\nNext up is Sterling Auty, MoffetNathanson.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nThanks, guys. So, Matthew, in terms of thinking about the threshold of keeping the margins basically flat within that context of growing to $5 billion, is there kind of like a threshold growth rate that you think about? So, as long as you're over 30 or 35 or 40, you'll keep it there, otherwise, you would reconsider kind of the margin profile?\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nI don't know that we have, you know, a specific guidance. I've always personally -- and Thomas will probably slap me for saying this, but I've always personally kind of found the sort of idea of the rule of 40 to be pretty compelling. And so, I think that we like that. And I think that, that would -- if we're growing north of 40%, then I think that that's showing that we can continue to execute and deliver on the enormous opportunity that we have ahead.\n\nAnd so, again, I think we're -- we want -- we know that we have the levers to when it's the right time for us to be a business that delivers very significant operating profits. But while we see a total addressable market ahead of us that we only have, you know, less than 1% penetration on, we think that it makes sense to continue to invest in that market and continue to drive growth going forward. And today, we're still living above the rule of 50. So, I think we've got some time to think about that.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nMakes sense. Thank you, guys.\n\nOperator\n\nOur next question today comes from John DiFucci, Guggenheim.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nThank you. I have a question for Matthew and then a quick follow-up for Thomas. Matthew, I just want to make sure I understand your comments about acceleration in the security portion of your business. Security businesses have so far anyway generally held up well against the macro slowness.\n\nIt sounds like that's continuing or even getting stronger for you given your comment there. But I wanted to make sure in that the macro backdrop is really manifesting itself more broadly in the rest of your business. Is that correct?\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nYes. So, first of all, you know, I don't -- I think we have been consistent in talking about the macro pressures now for the last three quarters. And there isn't something that has dramatically changed since we started to warn that there were pressures in the macro space. What I think, if we dig down a little further into the security business, I think especially in February of this year, when we saw Russia invade Ukraine, a lot of security companies [Inaudible] tailwind to their business.\n\nWhat I think actually ended up happening was that that tailwind did not materialize, and that the threat that the Russians are coming turned out to not be something which was showed up outside of the Ukrainian theater. However, in the last several months, and especially in Q3, we started to see an increase in cyberattacks coming out of both Russia and other parts of the world. That drives increasing adoption of products like Cloudflare's products at a very, very, very high velocity. So, where we'll see close rates that, you know, you can often measure in hours or days.\n\nAnd so, I think that that expectation of the war in Ukraine and other political conflicts around the rest of the world leading to more security business was something that, I think, a lot of the industry expected would show up in Q1 and Q2, and we actually saw it show up more in Q3. But generally, the overall macro environment hasn't changed substantially throughout this entire year based on what we're seeing. And so, I want to make it clear that we're not saying that we're seeing a big change. We have seen that there was softness in the macro economy since Q1, and we've been talking about it since Q1.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nYeah. And you've been very clear on that, Matthew. Thomas, just a quick sort of a follow-up to what Matthew was just talking about. You talked about -- when you gave the outlook and you talked about your caution in that outlook, I just want to make sure I understand what's implied in that outlook.\n\nAre you looking at sort of similar effects due to the macro backdrop? Or are you expecting further deterioration?\n\nThomas Seifert -- Chief Financial Officer\n\nYou know, we are talking about a subscription-based model. So, a lot of the things we see in the third quarter and we'll see in the fourth quarter are the impact of when we started to talk about the macro climate going to change. So, when we -- when we give guidance for the fourth quarter, it's less the in-quarter impact of the business. It's just a flow-through of what already has happened.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nI understand that. But do you -- are you -- do you expect to see the macro backdrop, the effects on your business show further deterioration even if we can't see it, although we kind of think we try to anyway? Or do you expect it to sort of stay about where it is in the softness you've seen over the last couple of quarters, I guess?\n\nThomas Seifert -- Chief Financial Officer\n\nWe, of course, for sure not assumed [Inaudible] of the macroeconomic environment. And with an outlook in Q4 and Q1, there's nothing, that signal, that it's going to get better anytime soon.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nOK. Thank you very much, guys.\n\nOperator\n\nNext up, we'll take a question from Andrew Nowinski, Wells Fargo.\n\nAndy Nowinski -- Wells Fargo Securities -- Analyst\n\nThank you. I just want to start with a quick sort of follow-up to John's question. I was wondering if you could just provide any color around maybe your pipeline of renewals for Q4 because I assume Q4 pretty big in terms of renewals. I'm wondering if you perhaps changed how you're handicapping the likelihood of those renewals closing in Q4, given the lengthening sales cycles you're seeing.\n\nAnd then I have a follow-up.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nYeah, I don't think -- again, we have not seen an uptick in overall churn across the business. That has continued to hold very, very strong. And so, we haven't changed how we've handicapped the renewal forecast.\n\nThomas Seifert -- Chief Financial Officer\n\nAnd keep in mind, you know, most of our revenue still gets built monthly and not annually. So, we don't have this massive renewal quarter in the fourth quarter, at least not yet.\n\nAndy Nowinski -- Wells Fargo Securities -- Analyst\n\nGot it. OK. I just want to also just dive a little deeper on the security and how security demand is holding up. You know, we heard, obviously, over the last few days, Fortinet talking about how they're seeing sort of more normal spending patterns from customers where they're not ordering, you know, placing orders for firewalls 12 months in advance because the supply is starting to free up.\n\nI suppose you could view that negatively as sort of a change in the overall security spending environment. But could you also view it as a positive for Cloudflare because now customers aren't making sort of irrational purchase decisions in buying firewalls, whereas now they can actually evaluate and deploy a smarter solution like Cloudflare One? Just wondering kind of how you view that change that the firewall vendors are talking about.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nI mean, I think that there's -- I think that you've had a series of head stakes from the hardware space for quite some time going back to the Trump tax cuts that moved forward a lot of incentives on capex spending, the beginning of COVID, where everyone was just scrambling to keep the lights on, and then the supply chain crisis, which again made people place orders just to get in line for products that they may not eventually even want to have. So, it is -- in the grand course of history, you can't solve the problems of a distributed workforce, you can't solve the problems in the cloud by shipping a box or a virtual box. It just doesn't work. And so, I think that anything that gets the market back to being rational without any kind of sort of artificial incentives to continue to invest in hardware is definitely beneficial for Cloudflare and other cloud-based security solutions.\n\nAndy Nowinski -- Wells Fargo Securities -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nUp next is Fatima Boolani, Citi.\n\nFatima Boolani -- Citi -- Analyst\n\nThank you for taking my question. Matthew, one for you, and then Thomas, one for you as well. Matthew, wanted to ask you about your pricing strategy, pricing philosophy question. So, we heard a lot in your prepared commentary about the downshifting of customers or trade-down from customers to some of your free solutions, which, of course, have better TCO in this environment.\n\nI'm wondering what's the rationale for you to maybe not, I guess, raise the floor on that so you can hold on to the paying customers. I'm just curious about how you're sort of thinking about that. And then, I have a follow-up for Thomas, please.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nSo, first of all, our pay-as-you-go business is a relatively small portion of our business. It's much less than 20% of revenue. And so, I think that what we see as the value from that pay-as-you-go business is that those customers, whether they pay us something or not, end up being our biggest advocates and our biggest champions inside whatever large organization that they operate at. So, if you look at two of our largest customers, and you go down the top 10 customers, almost all of them came to us originally because some technical leader inside that organization used Cloudflare's pay-as-you-go services, fell in love with us, understood us, and was able to adopt us as part of that.\n\nAnd so, I think that, that benefit is so substantial to us that we always want to make sure that we're treating those customers well. And so, as Thomas said, well, they may go from paying us $20 a month to not paying us something because gas prices went up, that isn't something that we're trying to optimize for. What we're trying to optimize for is that those customers love us, they understand us, and they take us to work. And so, as they do, that's how we've been able to close so much of the Fortune 500.\n\nBehind almost every one of those Fortune 500 wins is a pay-as-you-go customer who advocated for us internally, and that is, you know, our secret sales force.\n\nFatima Boolani -- Citi -- Analyst\n\nFair enough. Appreciate you sticking to your ethos on that. Thomas, on the dollar net expansion rate discussion, I appreciate you kind of shared some of the granularity as to where some of the pressures are coming from there. But I'm curious from a product pillar perspective, if you can shed light on, are you seeing expansion levels moderate within the application services bucket or the network services bucket? Just kind of curious to get a sense of what future functionalities across your portfolio are more prone to that, you know, expansion velocity dynamic? Thank you.\n\nThomas Seifert -- Chief Financial Officer\n\nI think the first statement to make is, for us, is it's a very true number. It's an all-in number, covering our pay-as-you-go business, our mid-market, and our enterprise. And as we just discussed over the last 50 minutes, different segments behave differently. We just spent talked about pay-as-you-go customers churning off and becoming free customers, that is something, you know, that hinders across the cohort expansion.\n\nWe have seen exchange rate headwinds from a billing and contracting perspective in overseas accounts. So, that is something that would be reflected in an expansion number. And then, we talked about prolongated sales cycles at the very high end in the very large cohorts. And that is if you go back to the KPIs we shared, where a lot of growth dynamics are happening, those cohorts are growing, in general, significantly faster than our average growth rate.\n\nSo, any movement we have in terms of sales cycles in the very large cohorts is impacting DNR in the current quarter. But this does not take away from the opportunity that it is in front of us, and it falls into the logic that we always had when we talked about DNR. We really see a path forward to get north of 130%, but there will be movement around that number. It will not be a straight line that gets us there.\n\nFatima Boolani -- Citi -- Analyst\n\nI appreciate that. Thank you.\n\nJayson Noland -- Head of Investor Relations\n\nThanks, Fatima. Operator, can we take a question from one last analyst, please?\n\nOperator\n\nAbsolutely. Our final question will come from James Breen, William Blair.\n\nJim Breen -- William Blair -- Analyst\n\nThanks for taking the question. Can you just talk a little bit about the M&A environment? I know you talked about getting to $5 billion organically. It seems with valuations coming down and given the cash you have, are there going to be opportunities out there to maybe add products or some scale in certain divisions around other companies? Thanks.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nYeah, Jim. I think our -- different companies are built in different ways. And so, if you look at Cisco, they were very much an M&A and acquisition machine, whereas if you look at an Apple, they do M&A, but it's usually for core technologies. It's not for products.\n\nI think we are much more like an Apple than we are like a Cisco. We have watched as some of the competitors in the space have really tie themselves up in not building what is effectively a Frankenstein-type solution through a series of M&A, and they don't get the same level of efficiency that we do. And so, I think that, you know, we will always be biased against M&A, and we will always have a very high hurdle rate to do any sort of a transaction, which isn't to say we won't do transactions. When we find great technologies, great teams, great ways to integrate like we did with Area 1, we will jump on that.\n\nAnd as the valuations and multiples, especially in some of the private markets, continue to fall, we look at lots and lots of deals. But I don't think that, that has changed that relative to other companies, I think we're going to maintain a very high hurdle rate. We have very much optimized around internal development. And as Marc said in his responses, we believe we can get to $5 billion without having to build or buy any new products or companies that are out there.\n\nWe think we've got the right products in the bag today. It's just a matter of us continuing to execute on the go-to-market side.\n\nJim Breen -- William Blair -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nAnd that does conclude our question-and-answer session. I'd like to hand things back to Mr. Matthew Prince for any additional or closing remarks.\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nJust wanted to thank everyone on Cloudflare's team for delivering what has been, again, another strong quarter. We're proud of the fact that we're protecting the U.S. elections, and we're standing by to make sure that they go off smoothly. I also want to specifically thank Chris for his nearly 10 years of service at Cloudflare and appreciate all that he's doing to transition and get Marc on board, and to wish Jayson good luck in his new role as CFO.\n\nAssigning all of those SEC statements, hopefully, won't keep him up too much at night. And I know that he's going to do an amazing job going forward. Thank you, all, for being investors. Look forward to talking again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJayson Noland -- Head of Investor Relations\n\nMatthew Prince -- Co-Founder and Chief Executive Officer\n\nChris Merritt -- Chief Revenue Officer\n\nMarc Boroditsky -- President of Revenue\n\nThomas Seifert -- Chief Financial Officer\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nJames Fish -- Piper Sandler -- Analyst\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nAndy Nowinski -- Wells Fargo Securities -- Analyst\n\nFatima Boolani -- Citi -- Analyst\n\nJim Breen -- William Blair -- Analyst\n\nMore NET analysis\n\nAll earnings call transcripts"
}