{
  "companyName": "Nano-X Imaging Ltd.",
  "companyTicker": "NNOX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/nano-x-imaging-ltd-nnox-q2-2022-earnings-call-tran/",
  "content": "Nano-X Imaging Ltd. (NNOX 4.98%)\nQ2 2022 Earnings Call\nAug 16, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Nano-X Imaging second quarter 2022 earnings call. At this time, all participants are in a listen-only mode. After the speakers' presentation there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to turn the conference over to your speaker today, Mike Cavanaugh, managing director of investor relations. Please go ahead.\n\nMike Cavanaugh -- Investor Relations\n\nGood morning, and thank you for joining us today. Earlier today, Nano-X Imaging Limited released its financial results for the quarter ended June 30, 2022. The release is currently available on the investors' section of the company's website. Erez Meltzer, chief executive officer; and Ran Daniel, chief financial officer, will host this morning's call.\n\nBefore we get started, I would like to remind everyone that management will be making statements during this call that include forward-looking statements regarding the company's financial results, research and development, manufacturing and commercialization activities, regulatory process operations, and other matters. These statements are subject to risks, uncertainties, and assumptions that are based on management's current expectations as of today and may not be updated in the future. Therefore, these statements should not be relied upon as representing the company's views as of any subsequent date. Factors that may cause such a difference include, but are not limited to those described in the company's filings with the Securities and Exchange Commission.\n\nWe will also refer to certain non-GAAP financial measures to provide additional information to investors. A reconciliation of the non-GAAP to GAAP measures is provided with our press release, with the primary differences being goodwill impairment, change in obligation in connection with a merger, and acquisitions, stock-based compensation, amortization of intangible assets and class action litigation, and SEC inquiry related expenses. I'd now like to turn the call over to Erez Meltzer.\n\nErez Meltzer -- Chief Executive Officer\n\nThank you, Mike, and thank you all for joining us today. As always, we appreciate your continued support of Nanox. As in our last call, I will give an overview of our recent achievements and share our outlook on the coming months, before turning the call over to Ran Daniel, our chief financial officer, to review our financial results, we will then open the call up to questions. We've continued to make progress during the past quarter to advance the Nanox.ARC system toward commercialization and we continue to proceed full force ahead to make headway in the FDA clearance process.\n\nOn the call today, I will discuss the advances we have made since our last earnings call by breaking my comments into three distinct segments regulatory, commercialization, and finally, AI and teleradiology. I will discuss what we have done in each of these segments and how we have moved closer to our goal of system deployment at scale. Before I do that, I'll touch on our financial results at a high level, but we'll leave most of the details to Ran's commentary later in the call. Nanox generated top line revenue of $2.2 million in the second quarter of 2022, compared to $1.8 million in Q1 2022.\n\nAs in the previous quarter, all revenue was generated by the Nanox teleradiology services business unit and Nanox AI our deep learning machine analytics company. As most of you know, these business units began generating revenue since their acquisitions in November 2021. And it's gratifying to see our teleradiology services growing quarter over quarter. These revenues were relatively small at this time, and are important for two reasons.\n\nFirst, they help us to improve our cash flow and its management. And second, we believe they demonstrate that customers and other stakeholders, such as hospitals and integrated health systems, value these services. Which in turn strengthens our belief that these applications and services will add value within our multi-source system when integrated with our proprietary imaging technology. I'm happy to report that during the second quarter of 2022, we signed 14 new client agreements for teleradiology services.\n\nOur clients in the Philadelphia segment include hospitals, outpatient imaging centers, urgent care, multi-specialty physicians group, research facilities, and mental health facilities. We continue to see accelerated revenue growth in our teleradiology services, driven by new client additions as well as organic growth from existing clients. The AI solution business continued to gain traction both in the US and abroad. For example, Nanox had their first go live at five Northwell health outpatient centers on July 26, followed by South Shore Hospital on August 8th.\n\nAdditional hospitals and outpatient sites throughout the system are anticipated to go live through the remainder of August and into September. In addition, we previously reported a large strategic agreement with one of the leading [Inaudible] in the northwest of the US to use our AI population health solution. We can now share that this customer is spectrum health, and Integrated Health Care Network is based in Michigan with 16 hospitals and health facilities. I'd now like to discuss our progress on the regulatory front.\n\nBeyond the beneficial revenue streams, I just mentioned, we made further progress in our efforts to gain FDA clearance for the Nanox.ARC multi-source system. Recently we received feedback from the FDA on our Q submission supplement that we previously submitted to the agency. The feedback we have received has been invaluable and it's helping us to optimize our 510(k) submission. Subsequently, we are now preparing our 510(k) submission to the FDA for a multi-source Nanox.ARC, which we expect will have the full power levels and indications that we believe will result in a successful deployment of the Nanox.ARC.\n\nIn parallel, we are preparing for the global deployment of our multi-source Nanox.ARC, according to local regulations and subject to requisite approval in each market. Regarding regulatory efforts to obtain the CE mark for Nanox.ARC, we have submitted all necessary documentation to begin the process for CE marking. We look forward to providing additional updates as this process advances. Moving on to commercialization, we have continued to progress toward the commercialization of the multi-source Nanox.ARC in several areas.\n\nI'm happy to announce that we have taken steps to advance the deployment of the multi-source and Nanox.ARC in Nigeria. In April, we sent a preliminary deployment team to be on the ground there and are preparing to send our first commercial unit for demonstration and training purposes. Our shipment plan to Nigeria is progressing hand-in-hand with the local regulatory process. I also have the pleasure to announce another new agreement that we have signed recently with a distributor in Ghana under which we agreed to deploy 350 units subject to local regulatory requirements, which brings our total contracted units to 6,850 worldwide.\n\nThis is a great milestone for the company, and we are pushing forward on the development and the deployable system to fulfill these orders. We believe that once we begin to deploy the multi-source Nanox.ARC in Nigeria and other early adoption areas health systems, hospitals, and distributors will see the service that Nanox.ARC provides, and that we will then begin to fulfill the backlog of orders we have built up. In addition, we have an agreement in place with a non-governmental organization, Bio Ventures for Global Health, known as BVGH for developing and implementing a medical imaging training initiative in Nigeria. BVGH is a Seattle-based nonprofit organization that strategically develops and managed programs across the for-profit and nonprofit sectors to accelerate, accelerate research, and development for poverty-related diseases, build biomedical R&D capacity in low and middle-income countries and improve cancer patient care in Africa, some new books, collaboration, and developments.\n\nFinally, I'd also like to take a minute to announce another milestone on the path to commercialization that we are excited about. We are in the process of establishing a technology development center based in Israel to develop the chips and the tubes that will need for the Nanox.ARC in the years to come. This center will complement our facilities in Korea and Japan. To close my remarks, I want to thank the Nanox team for all their hard work and progress achieved in this quarter.\n\nBut most of all, I want to thank all our investors for their continued support for our mission to democratize healthcare by making imaging affordable and available anywhere in the world. We look forward to reporting more progress on our next earnings call. With that, I would like to turn the call over to Ran Daniel, the chief financial officer, to review our financial results.\n\nRan Daniel -- Chief Financial Officer\n\nThank you, Erez. First, I'm delighted to announce that we were added to the Russell 2000 and Russell 3000 Indexes effective after the US market opened on June 27th as part of the 2022 Russell Indexes annual reconstitution. It is a great development for our company. As for our financial results, we reported a GAAP net loss for the second quarter of 2022 of $19.6 million, compared to a net loss of $13.6 million in the second quarter of 2021, largely due to expenses related to the acquisition of the Nanox market platform in November 2021, the consolidation of Nanox AI and US [Inaudible] with the company since the fourth quarter of 2021, an increase in our research and development expenses, goodwill impairment, and increase in our general and administrative expenses, which was mitigated by a decrease in our sales and marketing expenses and a decrease in our obligation in connection of mergers and acquisitions.\n\nOur revenues for the second quarter of 2022 were $2.2 million and growth was $1.8 million. Revenue from teleradiology services for the period was $2.1 million, with a gross profit of $0.1 million on a GAAP basis and a gross profit of $0.9 million on a non-GAAP basis. Which represents gross profit margins of approximately 43% on a non-GAAP basis. Revenue from licensing of AI solutions for the period was $0.1 million, with a gross loss of $2.1 million on the GAAP basis, and $0.1 million on a non-GAAP basis.\n\nResearch and development expenses for the second quarter of 2022 were $6.5 million, compared to $4.3 million for the comparable period in 2021. The increase in our research and development expenses was mainly due to the consolidation of Nanox AI with the company since November 2021. An increase in our survey, compensation, and the balance due to the development of the multi-source Nanox.ARC system and the Nanox.CLOUD. Sales and marketing expenses for the second quarter of 2022 were $1.1 million, compared to $1.8 million for the comparative revolt period in 2021.\n\nThe decrease was mainly due to a decrease of $0.6 million in our share-based compensation. General and administrative expenses for the second quarter of 2022 were $11.1 million, compared to $7.4 million for the comparable period in 2021. The increase of $3.7 million was mainly due to the acquisitions of the Nanox market platform in November 2021. The consolidation of Nanox AI in the US filed with the company in the fourth quarter of 2021, an increase in the company headcount and the overall organization infrastructure, and an increase in the company's legal fees due to the US Securities and Exchange Commission inquiry and the class action litigation as described in the company's Form 20-F for the year ended December 31, 2021, filed on May 2, 2022.\n\nChanging allegation in connection with mergers and acquisitions for the second quarter of 2022 was $2.6 million, compared to none for the second quarter of 2021. The increase was mainly due to the change in the company's contingent and earn-out liability. Goodwill impairment for the three months ended June 30, 2022, was $14.3 million, due to the goodwill impairment in connection to the acquisition of Nanox AI. Our non-GAAP net loss for the second quarter of 2022 was $8.2 million compared to [Inaudible] and a non-GAAP net loss of $8.6 million for the same period in 2021.\n\nA reconciliation between GAAP net loss and non-GAAP net loss for the second quarter of 2022 and 2021 is provided in the financial results that are part of the press release we issued this morning. The difference between GAAP and non-GAAP net loss is mainly due to goodwill impairment, change in the obligation of connection of merger and acquisition, amortization of intangible assets, share-based compensation expenses, and legal fees in connection with the class action litigation, and their equal rate and the secondary operating expenses. Turning to our balance sheet as of June 30, 2022, with cash, cash equivalents, and marketable securities of approximately $126.7 million, we ended the quarter with a property and equipment net of $42.9 million compared to $37.4 million as of December 31, 2021. The net increase of $5.5 million during the first half of '22 is mainly due to the completion of the construction of the company's fabrication facility in South Korea and the purchase of machinery and equipment.\n\nAs of June 30, 2022, with intangible assets of $140.5 million, as compared to $160.1 million as of December 31, 2021. The decrease is mainly due to the periodic amortization of intangible assets and impairment of goodwill. As of June 30, 2022, the company had approximately 52.2 million shares outstanding, compared to 51.8 million shares outstanding as of December 31, 2021. The increase was mainly due to the exercise of 122,927 warrants and the exercise of 141,067 options.\n\nThe company generated approximately $0.5 million in gross proceeds from the exercise of such options and warrants. In addition, during the first half of 2022, the company issued 89,286 shares to the former equity holders of Nanox AI due to the use of the achievement of milestones pursuant to the terms of the agreement and plan of merger dated August 9, 2021. As amended among the company Nanox AI and Perryllion LTD as representative of Nanox AI equity holders. With that, I will hand the call back over to Erez.\n\nErez Meltzer -- Chief Executive Officer\n\nThank you, Ran for the financial update. And once again, thank you all for joining us today. I feel very good about Nanox results in the second quarter and CEO. But all of us recognize there is more to do.\n\nWe hope to provide additional updates in the coming weeks and months. I would also like to share with you that the Nanox management team will have a non-deal roadshow with investors in late September. If you would like to schedule a meeting, please contact our investor relations partners at ICR. With that, I'd like to open the call for questions.\n\nOperator, please begin the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Jeff Cohen with Ladenburg. Your line is now open.\n\nJeff Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nHi, Erez, and Ran. How are you?\n\nErez Meltzer -- Chief Executive Officer\n\nGreat. And yourself?\n\nJeff Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nJust fine. A couple of questions for Erez. So could you talk about the technology center you're planning on opening in Israel and the capabilities that you anticipate there versus the current and anticipated capabilities in the facilities in Korea and Japan?\n\nErez Meltzer -- Chief Executive Officer\n\nFirst of all, it's going to be very similar, but we're going to strengthen the fact that we are willing to base our future on further advanced technologies. Right now, we have both centers in Japan and in Korea for the chips and the tubes. We thought that it would be appropriate that the core technology and knowledge will be developed very close to where we do the R&D, the product design, the roadmaps, our future products, etc. And that the -- and that Korea will be a kind of more of manufacturing and supply for the chips and further development that will be on the engineering side.\n\nJeff Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nOK. Got it. Could you talk about ARC manufacturing and the number of ARCs, which have been manufactured, and maybe the anticipated number of ARCs manufactured by the end of the year? And then, tie that into your anticipated timeline at the FDA as far as your product today.\n\nErez Meltzer -- Chief Executive Officer\n\nOK. So first of all, we are accelerating the production as mentioned. Obviously, we're not disconnected from the reality of what's going on at the market in terms of the supply chain, terms of the various components which are part of the assembly. So we have, actually part of the systems will be pushed to 2023, hopefully for the beginning.\n\nAnd this is with respect to the production we are even before the end of the year, we are going to go even to the next step to further explore the discussion with the mass production. And I mean beyond the 1,000 units in one or two locations, which are not in Israel. We mentioned that the first 1,000 units will be assembled in Israel and we hope that in either Q4 or Q1 next year we will have the arrangement for the assembly of all the systems following after the first 1,000 units. With respect to the question that you ask about the FDA, first of all, I was very happy with the meeting that was held last week, which was actually the last -- not the last, but the last meeting before the final preparation for this submission.\n\nI would say that the feedback that we received from the FDA was very helpful and meaningful for us. So as we say, we are in the final preparation for the formal submission and it's going to be aligned with our path moving forward. Right now, I would say, that the idea to go to the pre-sub into the Q submission and to take advantage of I would say about an eight, almost eight-month dialog -- continuous dialog with the FDA and prove itself to be the right decision. And I think that all the feedback that we got and the cooperation that we had with the FDA and continue to have with the FDA will make it much easier for us to do it, so.\n\nJeff Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nGot it. And then finally, talk about Ghana as far as manufacturing and delivering ARC units. How many would you expect to be delivered there in the coming quarter or two?\n\nErez Meltzer -- Chief Executive Officer\n\nRight now, I would say, we explained in the past that basically not all the countries that we're working in require FDA regulation. Like we mentioned, Nigeria is one of them, and Ghana will be another one. We have another two that are not really related to the submission to the formal approval of the FDA. Ghana has a special process that we are going through.\n\nThey give us indications, but I wouldn't actually -- until I see it in my eyes, I wouldn't actually commit to -- we hope to have the approval to send the systems during the fourth quarter. And I would say, starting in Ghana next year will be probably more of a system that will be sent. Overall, the agreement is for 350 units.\n\nJeff Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nGot it. And then one quick question for Ran. Would you expect any goodwill impairment in the back half of the year for Q3 or Q4?\n\nRan Daniel -- Chief Financial Officer\n\nBut as we say in the PR, it really depends on the market parameters, but the interest rate, yes there will be an increase or there will be any change in other capital market formats. So we may have to do an impairment again, we have to test it at least. And it also depends on our internal management estimate.\n\nJeff Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nOK. Perfect. That does it for us. Thanks for taking the questions.\n\nErez Meltzer -- Chief Executive Officer\n\nThank you, Jeff.\n\nRan Daniel -- Chief Financial Officer\n\nThank you, Jeff.\n\nOperator\n\nThank you. Our next question comes from the line of Suraj Kalia with Oppenheimer. Your line is now open.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nGood morning, Erez, and Ran. Can you hear me all right?\n\nErez Meltzer -- Chief Executive Officer\n\nLoud and clear.\n\nRan Daniel -- Chief Financial Officer\n\nPerfect.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nPerfect. Hope everyone is safe and healthy. Hey, so, Erez, just following up on Nanox.ARC the multisource submission. Was a full power level ever in doubt, maybe I'm misreading from your comments on the feedback from the FDA.\n\nIf I remember correctly, last quarter, I think so you all had mentioned that from 40 to 120 KvP, it would cover the entire gamut. So maybe if you could kindly shed some additional light on your specific comments at the full power level feedback?\n\nErez Meltzer -- Chief Executive Officer\n\nFirst of all, I hope that they understand the question, but I think would have never been a doubt.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nOK. Fair enough. So, Erez, when -- are you at -- or can you give us a timeframe as to when the multisource 510(k) will actually be filed? And when you're expecting clearance?\n\nErez Meltzer -- Chief Executive Officer\n\nAs you already know, I'm actually I can say or indicate, or willing to commit only things which are 100% sure that there will be on the time that I'm actually committing. So right now, I think that they gave enough background and information about the timeline. We are in the final preparation for the submission and it will be done shortly. And I think that this is, I would say, positively saying the feedback that we got from the FDA gave us the advantage to add a few things in the submission that will be done in the next few weeks that will be added to the system.\n\nSo I hope that this submission will be will then shortly. And once it's submitted, I'm sure that you'll know about it.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nSo you will file more than likely in Q4?\n\nErez Meltzer -- Chief Executive Officer\n\nYou said so.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nYeah.\n\nErez Meltzer -- Chief Executive Officer\n\nI'm -- basically, I'm always trying to do things earlier on all levels and all fronts.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nErez the CE mark, in a, generally speaking, companies have voiced a lot of concern. Just the MDR process has become very cumbersome in a CE process overall become very cumbersome. And maybe I missed it in your prepared remarks on the updated timelines for the CE mark for Nanox.ARC multi-source.\n\nErez Meltzer -- Chief Executive Officer\n\nFirst of all, we have already submitted all the necessary documentation for the registration with the notified body. We have selected the notified body. We gave them all the information, when I was a young guy, I learned that you have to do whatever you can when you can control things. You have to be patient when you cannot, but you hope that you will have the wisdom to differentiate between them.\n\nThis is basically right for the CE and for the FDA. We can control what we are doing, OK? We could not control we are not managing the CE or the FDA. And we hope that the fact that they have a lot of overload in their systems and processes will not hurt us and will give us the privilege that the preparations that we have done during the last few months will give the results sooner rather than later.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nI've got it. Erez, two final questions, and I'll hop back in the queue. So in terms of Ghana, what do your validation testing been done before you'll start shipping these units? And the second -- the last question from my side Erez is the 6,850 units that you referenced in terms of contractual amounts. If memory serves me right, a substantial portion of these or more than three-year-old contracts, I remember seeing these in 2019.\n\nMaybe you could just talk to us about whether they are still valid or if have there been any amendments? Any additional color there would be greatly appreciated. Gentlemen, thank you for taking my questions.\n\nErez Meltzer -- Chief Executive Officer\n\nOK. So first of all, I'm not sure about the first question about the validation. What exactly are you referring to, with respect to the systems that we check? The answer is, yes, so I would say positive. To the second question with respect to the clearance in the region, are you referring to what kind of validation in terms of technology, or in terms of regulation in Ghana?\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nNo, Erez what I meant was before you launch, any product commercially, you have to go through a slew of testing, performance testing --\n\nErez Meltzer -- Chief Executive Officer\n\nYeah, yeah, of course. Yeah, yeah. The answer is they're basically, yes -- not basically, the answer is, yes.\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Rahul Rakhit with LifeSci Capital. The line is now open.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nHey, guys. Thanks for taking the question. So, yeah, you mentioned that there are two other countries that don't necessarily require FDA clearance for deployment. Maybe if you talk about where you are in the conversations in those geographies and provide any indication on timing there?\n\nErez Meltzer -- Chief Executive Officer\n\nThe answer is no because since we have not announced it to the public, as soon as we are going to announce that the public will actually share. My preference would be that only when we sign agreements, we will let the market know that they were signed. In the past, in the 20-F there are a few countries, which do not necessarily need the FDA.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nRight. Right. OK. That makes sense.\n\nI mean, really exciting to hear about, some of these AI agreements that you guys announced. Maybe could you help us think about, the broader revenue potential? There are obviously big health systems, what is integration like? What does the integration look like there? And ultimately, what is the broader revenue opportunity?\n\nErez Meltzer -- Chief Executive Officer\n\nSo first of all, with respect to the integration, I think we mentioned this in the script of the 6-K that these are -- we have already implemented in a few and they installed the system over there. And we are -- and there is a timeline right now for the next few months, I think the last one is going to be October, or in November, I think, November will be the last one that we're going to install the system in all the hospitals that this specifically Northwell gave us to, as part of the plan. In terms of IDN in general, our business model is basically that it can go -- and this is, by the way, unlike what used to be in the past and in the old, what used to be Zebra Medical. Right now, it's everywhere between a few $100,000 to a few million dollars in scale.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nGot it. OK. Now, I appreciate that. And then, just based on, a lot of the community so far, it sounds like conversations with the FDA have been very fruitful.\n\nI know you don't want to lock in on specific timing for the submission, but maybe can you help us understand what the impact of these conversations and the Q submission has had on the actual timing of the decision? So, once you do submit the 5-K filing, how long do you expect it to take to actually obtain FDA clearance from there?\n\nErez Meltzer -- Chief Executive Officer\n\nSo basically, the one thing I would say ideally a reasonable and logical market and in the timeline, I would say the Q submission would be probably unworthy for us because it's very helpful in the process to accelerate the process. But right now, we know that the FDA based on the dialogue, we know that since we are working with them and cooperating with them, we know the overload that they have and I hope that it will not -- that it will give us the -- I would say, the benefit, or the -- I wouldn't say the privilege, but I would say the benefit of the process that we have done to make it sooner rather than later, and that's what I was mentioned. Overall, I think the process would have had a positive impact on the process that I hope it will be the same in the clearance process.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nGot it. Makes sense. Appreciate it.\n\nOperator\n\nThank you. That's all the time we have for questions today. I'd now like to turn the call back over to Erez Meltzer for closing remarks.\n\nErez Meltzer -- Chief Executive Officer\n\nSo -- sorry. So once again, I'd like to thank you all for being part of this call today. We'll see you shortly. For those of you who are in the US sometimes then in September, at the end of September and we're always with the ICR are willing to address any question that may come from investors or from any audience that knows that question that is related to what we're doing and what we were doing so far.\n\nThank you so much, and for the day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Cavanaugh -- Investor Relations\n\nErez Meltzer -- Chief Executive Officer\n\nRan Daniel -- Chief Financial Officer\n\nJeff Cohen -- Ladenburg Thalmann and Company -- Analyst\n\nSuraj Kalia -- Oppenheimer and Company -- Analyst\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nMore NNOX analysis\n\nAll earnings call transcripts"
}