{
  "companyName": "Aurora Cannabis Inc.",
  "companyTicker": "ACB",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/aurora-cannabis-inc-acb-q1-2023-earnings-call-tran/",
  "content": "Aurora Cannabis Inc. (ACB 2.26%)\nQ1 2023 Earnings Call\nNov 10, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Aurora Cannabis Inc. fiscal 2023 first quarter conference call. All participants will be in a listen-only mode, and a question-and-answer session will follow the formal presentation. This conference call is being recorded today, Thursday, November 10, 2022.\n\nI would now like to turn the conference over to your host, Ananth Krishnan, vice president, strategic finance. Thank you, sir. Please go ahead.\n\nAnanth Krishnan -- Vice President, Strategic Finance\n\nThank you, John. We appreciate you all joining us this afternoon. With me today are CEO Miguel Martin; and CFO Glen Ibbott. After the market closed, Aurora issued a news release announcing our fiscal 2023 first quarter financial results.\n\nThis news release, accompanying financial statements, and MD&A are available on our IR website and can also be accessed via SEDAR and EDGAR. In addition, you can find a supplemental information deck on our IR website. Listeners are reminded that certain matters discussed on today's conference call could constitute forward-looking statements that are subject to risks and uncertainties related to our future financial or business performance. Actual results could differ materially from those anticipated in these forward-looking statements.\n\nThe risk factors that may affect actual results are detailed in our Annual Information Form and other periodic filings and registration statements. These documents may similarly be accessed via SEDAR and EDGAR. Lastly, I want to remind everyone that we will be holding our Annual General and Special Meeting of Shareholders on November 14th, and the meeting materials have been mailed out to shareholders or can be found on SEDAR or on our IR website. We encourage you to review the meeting materials before voting your shares at the meeting and look forward to your participation in the virtual-only format.\n\nFollowing prepared remarks by Miguel and Glen, we will conduct a question-and-answer session with our covering analysts. However, we ask that you limit yourselves to one question and then get back in the queue for follow-up. With that, I will turn the call over to Miguel. Please go ahead.\n\nMiguel Martin -- Chief Executive Officer\n\nThank you, Ananth. We will keep our remarks brief as our Q4 conference call was held recently, but I want to reiterate a few key items before I turn the call over to Glen for an in-depth financial review. We are very close to achieving our primary objective of reaching positive adjusted EBITDA by the end of the calendar year. This will be an incredible achievement that we believe is also sustainable.\n\nIn fact, the structural changes we have made over the past several quarters have resulted in long-term benefits for Aurora, and we look forward to demonstrating consistent financial performance in the coming quarters. Our enthusiasm is anchored by our position as the No.1 Canadian LP in global medical cannabis, and the underlying top-line trend is undeniable, upwards and to the right with a loyal base of patients within existing medical markets and more developed countries poised to open up. Beyond revenue, medical cannabis also commands enviable adjusted gross margins that consistently exceed 60%, twice that of consumer cannabis. For these reasons, along with its defensive nature and volatile times, we believe medical is the best segment to invest behind.\n\nThe second anchor of our enthusiasm has been our ability to rationalize the business to the current environment. The annualized cost savings of $150 million to $170 million will be complete by the end of the calendar year, at which time we will have materially reduced our cash burn and become EBITDA positive, as I said a moment ago. A third anchor of success is our balance sheet, which is stronger than ever. It's enabled us to repurchase approximately $217 million in convertible debt since Q3 2022 and has resulted in considerable savings on cash interest costs, about $12 million annually.\n\nWe are further benefiting from improved working capital and cash flow and are fortunate to be one of only a handful of companies within the cannabis interest to have a net cash position. In turbulent and uncertain times, this is imperative. Finally, our investments in science, breeding, and genetics are really beginning to pay off. Proprietary cultivars launched from our breeding program in the last 12 months were responsible for almost a third of our revenue in Canada during Q1, have driven meaningful improvements to yields, and are now generating incremental, high-margin revenue through license agreements.\n\nWe have recently signed royalty-based agreements to license genetics to two of the largest Canadian LPs by cannabis revenue and expect more to follow. So, with those key strengths as a backdrop, let's take a deeper dive into our global medical cannabis business. During Q1, international medical revenue fell compared to Q4 last year. This was largely due to timing of shipments to the Australian market, which resulted in lower sales in Q1.\n\nAlthough we expect a solid delivery and recovery in Q2, as we have long said, international is somewhat unpredictable on a quarter-to-quarter basis and revenue contributions from individual countries can ebb and flow as these new markets develop. This is why it is so important for us to be operating across many countries, nearly a dozen outside of Canada. A broad reach affords us relative insulation to the economic climate and conditions in specific markets across Europe, Israel, and Australia, and means the overall trend is toward growth. And our regulatory expertise, compliance protocols, testing, and science capability support our leadership position.\n\nNow, let's discuss developments in a few select countries. In Germany, the largest market in the EU with 83 million citizens, but only about 100,000 to 120,000 medical cannabis patients, the health minister presented a cornerstone paper on planned rec legislation on October 26. The plan is designed to regulate the control distribution and consumption of cannabis for recreational purposes among adults, and he said it could become law in 2024. We believe Aurora's position as one of only three companies with a medical domestic production license and our current position as the No.\n\n2 LP in the dried flower segment will give us a significant advantage as the regulatory framework continues to be developed. In Poland, we are maintaining our leadership position by continuing to invest in marketing to support our flower and extract products despite new entrants. We completed two shipments during Q1 and submitted dossiers for three new products for regulatory review, with a timeline to market of approximately one year. In France, a market that we believe could be as big as Germany, authorities have announced that the French medical cannabis pilot program is going to be extended by another year, until March of 2024.\n\nAfter internal assessment, as well as discussions with our distribution partner, we decided to continue participating as the sole supplier of dried flower to the country to ensure Aurora's position for success following the French pilot. In the Czech Republic, beyond our continued success in the dried flower segment, regulators approved the import of new extract products including THC-dominant and balanced extracts. We also hold leadership positions in other key markets including U.K. and Australia and expect continued growth in these markets as the number of prescribers and patients steadily grow.\n\nAnd so, the cannabis growth story continues to play out across international medical and recreational markets, with growing acceptance acting like a domino effect. The bottom line is this, as we said many times, our success in medical cannabis provides us with a significant first-mover advantage. And we believe our leadership will be portable to rec markets as they open up. Turning to Canadian -- to the Canadian medical market, we saw some churn of noninsured patients, but we continue to improve the contribution of this business through finding efficiencies.\n\nImportantly, the absolute level of revenue from insured patients has not declined, and insured patients comprised 83% of all medical sales, compared to 81% in Q4, while our leading market share is approximately 24%. We are very optimistic about the future of this segment as we continue to increase the number of patients in the insured category and have seen consistent increases in basket size and participation rates over the past few quarters as we continue to improve our offerings. Switching to Canadian adult rec. Our Q1 revenue increased sequentially by 9% compared to Q4, primarily because of our strength in product offerings made possible through our Thrive acquisition.\n\nIn Q1, we benefited from an extra month of Thrive contributions versus the previous quarter. However, the Aurora business declined slightly due to the OCS cyberattack and a strike in B.C. But thankfully those issues are now fully resolved. In addition, margins were roughly flat quarter over quarter.\n\nLooking ahead to Q2, we will miss a shipping week due to the December holidays. As our Canadian rec business continues to evolve despite a long and continuing period of macro challenges, our focus remains on maximizing profitability through low-cost production and high-margin categories. We continue to believe our investment in science and innovation drives a significant competitive advantage. And this quarter debuted an unprecedented fall lineup of cannabis products across adult use and medical markets.\n\nThese new products were developed from a deep understanding of consumer and patient interests and needs, and contain all the critical components necessary to compete, intense and exciting aromas, key visual and tactile attributes, and high-potency THC. In fact, beginning last month, Aurora patients were given access to the largest-ever selection of products and formats on Aurora Medical. During Q1, we launched 24 SKUs in the medical channel, and we'll be launching another 78 in Q2. The products from our full portfolio of adult-use cannabis brands including Being Quickstrips, Greybeard premium flower, a wider selection of pre-rolls, new concentrates, and a new offering of minor cannabinoid oils.\n\nThis online rollout is then followed by availability in Canadian adult-use retailers with select products available in certain regions. The synergies related to innovation and the leveraging of infrastructure in developing and launching medical and adult rec products are clear, and our ability to be competitive in both provides us with inherent advantages. Turning to our scientific leadership in cannabis breeding and genetics, we think these attributes will provide us with a distinct advantage to drive value across all tiers of the consumer and medical categories as our new product launches demonstrate. We continue to drive meaningful improvements and yield through new proprietary cultivars, while our breeding program enables us to produce top-quality flower and industry-leading margins.\n\nAs an example, our Farm Gas cultivar delivers nearly double the yield of our traditional cultivars and does so an average of 26.5% THC. We also remain committed to furthering medical cannabis clinical research in Canada, with the first shipment of product to a palliative care study occurring last August. Finally, let's discuss Bevo, which is one of the largest suppliers of propagated vegetables and ornamental plants in North America. Recall that we purchased a controlling interest in Bevo back in August and anticipate that will drive significant shareholder value to us in the long run.\n\nAs part of the transaction, we are repurposing the Aurora Sky facility for orchid and vegetable propagation with minimal capital investment. This will greatly increase Bevo's production capability and extended shipping range in Canada and the U.S. We will also enable us to generate incremental revenue and adjusted EBITDA while saving on previously announced wind down and selling costs. For the approximately five weeks that we controlled Bevo in Q1, it contributed $3.3 million to our revenues and achieved adjusted gross margins of 16%.\n\nWhen we announced the controlling investment in Bevo, we highlighted the seasonal nature of their business with the January to June period representing the majority of the revenue and EBITDA generation of the business. Bevo is performing to internal expectations and is expected to be a positive contributor to our path for positive adjusted EBITDA. And with that, I'd like to turn the call over to Glen for our financial review.\n\nGlen Ibbott -- Chief Financial Officer\n\nThank you, Miguel, and good afternoon. I'd like to begin by reminding everyone that we're pleased to have one of the strongest balance sheets among Canadian LPs and this quarter is no different. As of yesterday, we have approximately $393 million of cash including $58 million of restricted cash. And we have $186 million of principal remaining on our convertible notes that are due in 2024.\n\nSubsequent to our September 30 quarter end, we repurchased $23 million in principal on our convertible notes at a total cost of $21.8 million in cash, including accrued interest. We believe that debt reduction, even though maturity, is still more than a year out, is a smart and defensive capital allocation decision, which reduces balance sheet risk, especially important during turbulent markets. Our debt reduction since Q3 2022 has resulted in annualized cash interest savings of approximately $12 million, and we continue to have access to significant capacity under our base shelf prospectus, including $156.8 million remaining under our ATM program. That reflects how we issued 23.7 million shares subsequent to September 30 for gross proceeds of $40.2 million, and that's to be used for strategic purposes including debt reduction.\n\nOur cash flow is improving with $20.1 million used in operations and working capital in Q1 or $12.4 million excluding restructuring costs. And that's down from $22.5 million in Q4. In Q1, we reported approximately $5.5 million in capital expenditures, down from $7.8 million the last quarter. Q1 capex was fully offset by proceeds from disposals of property and equipment and from government grants.\n\nOur ongoing cost transformation program is expected to continue to improve operating cash use over the next several quarters. Total revenue in Q1 was $49.3 million, and of that net cannabis, revenue was $46 million, compared to $50.2 million last quarter. This change was driven mainly by timing of shipments into Australia during the prior quarter and our ongoing strategic focus in our Canadian medical business on the higher margin insured patient base. It was partially offset by contributions from our Thrive acquisition to our consumer cannabis business.\n\nSo now, let me address each of our segments in a bit more detail. At the core of our plan to achieve near-term positive EBITDA is our focus on protecting and growing the profitability of our industry-leading Canadian and international medical cannabis businesses. Canadian medical revenue was $23.4 million in Q1, down 6% from Q4. We continue to focus on growing the bottom line of this business by improving our portfolio, protecting our margins, and becoming a more efficient provider of medical cannabis to our patients.\n\nOur international medical revenue was $8.2 million and reflects the 30% decline versus Q4. The sequential decrease was due to the timing of shipments into certain international markets, particularly Australia, during the prior quarter. We do expect a rebound in our international medical segment next quarter, that being Q2, returning to levels more consistent with Q4 of 2022. Taken together, our medical businesses in Canada and internationally generated $31.6 million in sales and a gross margin of 67%, up from 62% in the prior quarter.\n\nThe strong margin profile remains above our minimum target of 60% and is an important gross profit driver for us that distinguishes Aurora from our key competitors. In Q1, our consumer revenue was $13.7 million, a 9% increase compared to last quarter. The increase is mostly due to full quarter of contributions from Thrive consumer cannabis brands, which more than offset the impact of the cyberattack at the Ontario Cannabis store and store closures due to an employee strike at B.C. cannabis stores.\n\nThis is the second consecutive quarter of growth in our consumer business, which in the face of consumer market headwinds is very gratifying. Adjusted gross margin before fair value adjustments on our consumer cannabis net revenue is 25% in Q1 compared to 26% in the prior quarter. We recognized $3.3 million in net revenue during Q1 from our controlling stake in Bevo. As Miguel mentioned, Bevo has a seasonal cadence with a period from January to June expected to deliver roughly two-thirds of Bevo's full annual revenue and EBITDA, which is reliable, predictable, and support to our overall drive to positive EBITDA.\n\nExcluding restructuring and other normalizing costs of $10.4 million, our SG&A and R&D continued to be well controlled, down at $33.4 million during Q1 versus $37.8 million in the prior quarter, and in line with our previously stated range of being below $35 million. We are on track to deliver the company's commitment to reducing SG&A to below $30 million by the time we exit December 2022. So, pulling all of this together, we generated an adjusted EBITDA loss in Q1 of $8.7 million, compared to $11.6 million in the previous quarter. This improvement is driven mostly by reductions in SG&A and by a 3% increase in overall adjusted gross margin.\n\nNow, as part of our business transformation plan, you are aware of our commitment to annualized cash cost savings of $150 million to $170 million. Beyond posting positive adjusted EBITDA, we have been working hard to rationalize our operations footprint and continue to improve our cash flow. These actions are on track with annualized savings of $140 million already achieved and the remaining coming in Q2. With respect to cost of goods, these have been crucial initiatives for the company, as you can see our gross margins continue to deliver value for us and to lead the industry.\n\nFinally, a quick reminder on an important housekeeping item, fiscal year 2023 has only three quarters as we're changing our fiscal year end to March 31, 2023, in order to achieve certain internal cost and staffing efficiencies. So, to wrap my section up, the key drivers for Aurora to reach our positive adjusted EBITDA milestone by the end of this calendar year, starting from our Q1 loss of $8.7 million are as follows: first, we expect revenues to recover in Q2 as the negative impact of certain cultivar supply and wholesale distribution disruptions affecting our European medical and Canadian consumer business units have been resolved, and our non-new international segment revenue returns to normalized levels consistent with that of Q4 2022. Second, we expect a full quarter of revenue and positive adjusted EBITDA contributions from the Bevo business, albeit on a seasonally affected basis. Third, we expect adjusted gross margins to be consistent with fiscal Q1 2023.\n\nAnd finally, we expect to achieve our previously stated objective of quarterly SG&A expenses being below $30 million. So, thanks for your interest. I'll now turn the call back to Miguel.\n\nMiguel Martin -- Chief Executive Officer\n\nThanks, Glen. I'm going to leave me with four thoughts before taking your questions. First, we're just one quarter away from achieving our goal of positive adjusted EBITDA. Cost savings are nearly complete and going forward we'll have a lean and flexible operating model.\n\nSecond, our medical cannabis business is a formidable force in the industry, both domestically and internationally. It remains the smartest cannabis segment to invest behind today with excellent growth opportunities. Third, the Canadian rec market is correcting, and the two acquisitions we've made in Thrive and Bevo will be even more beneficial to us, once the recovery is upon us. And last, our science and innovation program as a high-margin opportunity is just starting, and we look forward to sharing more in the future as the business grows.\n\nTo conclude, we're well on our way to becoming a leader in global cannabis and are making strategic progress to that end with each passing quarter. Our completion of the business transformation is near, on time and on budget, and we've done it without sacrificing our investments in growth. We've also done this while strengthening our balance sheet, which is critical in today's environment. The end result will be a positive and sustainable structural change to our business that will enable us to be successful in the long term and create significant shareholder value.\n\nThank you for your time and interest in Aurora, and we look forward to sharing our progress. We'll now be happy to take your questions. Operator, please open the line for questions.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] We ask that you please limit yourself to one question only, and if you have a follow-up, please reenter the queue. One moment, please, while we poll for questions.\n\nOur first question comes from the line of Vivien Azer with Cowen. Please proceed with your question.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nThank you. Good evening.\n\nMiguel Martin -- Chief Executive Officer\n\nGood evening, Vivien.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nSo, I wanted to touch on Europe, please. So, you guys have been really transparent about your expectations for fiscal 2Q and why you're expecting a recovery, and it all makes sense. But Miguel, I was just hoping to get some perspective on how you view that business's defensibility in a more challenged macro environment, certainly, through kind of traditional consumer staples earnings, European weakness, especially the further east you go has been incredibly topical. So, I'd just love to get your perspective on that.\n\nThanks.\n\nMiguel Martin -- Chief Executive Officer\n\nIt's a great question, Vivien. I think if you look at Canada as an example, you've got over 250, 300 LPs that compete in the rec business, and we got a bunch of people that are facing some tougher times. If you look at the medical business, it's very concentrated. And why I bring that up is because it's been going on for a long time.\n\nSo, we have a 24 share, which is the leader in Canadian medical by a mile, then you have 9%, which is the No. 2 company, and then it really falls off. And there's just not a lot of companies participating. When you look at Europe, and I think Germany is a really good example, you've got basically four companies, maybe five companies that do the vast majority of the business.\n\nIt's incredibly expensive to get in. It's incredibly challenging to continue to deliver. And the regulatory thresholds are significant. And so, there really is sort of a moat around medical.\n\nAnd it's not just Germany, you see this in other markets, where it's a consolidated number of companies, it takes a very specific skill set. And what is interesting that is starting to really come to the forefront now is that that challenge, that difficulty is portable. So, the best example I can give is if you look at the framework presented by Karl Lauterbach, who is sort of the federal minister of health in Germany, that's now going through the E.U., you just saw that Czech Republic, which is another great market and a really good market for us, talk about wanting to mirror or just get the learnings from the German experience. And so, I think you're going to start to see consistency in these markets from a regulation standpoint, everything from manufacturing, to testing, to packaging, to sales and marketing.\n\nAnd so, I think, while it's going to be challenging and it's going to be difficult, there's definitely going to be advantages for those handful of companies that are regulated -- really regulatory forward in those markets. So, I think that's why we're so thrilled about it. And I think we'll be competing against four or five companies, not 200 companies. Does that answer your question?\n\nVivien Azer -- Cowen and Company -- Analyst\n\nIt does. Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd our next question comes from the line of Michael Lavery with Piper Sandler. Please proceed with your question.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nThank you. Good evening.\n\nMiguel Martin -- Chief Executive Officer\n\nGood evening, Michael.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nI just wanted to come back to the profitability milestones, and you led with the revenue improvement, which makes perfect sense. Just curious if you could unpack that a little bit more, maybe a couple of things. One is how much maybe? Is it mix driven or operating leverage? Does it need to be a big number or just the right product? And how much visibility do you have on that? We're close to halfway through the quarter. Do you have a line of sight on forward bookings or some things that give you a sense of that being on track?\n\nMiguel Martin -- Chief Executive Officer\n\nYeah. I mean, let me make a couple of comments, and then I'll turn it over to Glen. I mean, I'm not going to give comments about the quarter, but let me sort of add some color to what Glen mentioned. So, clearly, with 2x the margins in the medical business and in most cases the international business, those revenues make a huge difference.\n\nAnd so, when you have sort of these one-time ebbs and flows in a key market like Australia and you get it back, it makes a really big difference. Because it's almost entirely upside because you've already grown the cannabis and you don't have increased sort of fixed costs for it. So, that's one. Secondly, we're really thrilled that the OCS -- and I don't wish the cyberattack on anyone, but they addressed it quickly, and the same thing with the B.C.\n\nstrike. So, I'll let you take our comments about that and where we are in the quarter sort of bear. From the cost side, I think we've been pretty consistent in terms of that. So, not to rehash Glen's words, but if you go back to where we think we should be on revenue and you look at the margin and then you add Bevo, you're there.\n\nAnd I think the part that is sort of powerful about all this is we get there in the model that can grow and has future growth opportunities, and whether that's Western Europe or some other aspects that will be there. So, I think when you describe mix, I would say it's more business mix than it is say product mix. But Glen, anything you want to add to that?\n\nGlen Ibbott -- Chief Financial Officer\n\nNo, that's exactly right, Miguel. The cost reductions and the SG&A that we committed to and a bit of incremental Bevo cuts the Q1 EBITDA loss in half. So, the rest of this is coming from holding our margins up and then the business or market mix and with it being mainly focused on medical, a lot of that drops to the bottom line. So that's --\n\nMiguel Martin -- Chief Executive Officer\n\nAnd Michael, I guess the point is we're not saying it goes beyond where it's been in the past. So, the comment of getting back to traditional levels in those two key businesses, I think, is why we're saying what we're saying. There's not some great promise of a new piece of business or some additional form of growth.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nThat's great. Helpful color. Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nThank you, Michael.\n\nOperator\n\nAnd our next question comes from the line of Pablo Zuanic with Cantor Fitzgerald. Please proceed with your question.\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nThank you. Good evening. Hi, everyone. Two quick questions.\n\nTwo-part question if I can, Miguel. First, I think you're one of the few companies that has tied to this view that Germany will start only with domestic production and that the imports won't be allowed. And obviously the draft -- that's what the draft says. But most other companies are talking that imports will be needed because domestic production won't be enough.\n\nSo, maybe if you can just explain your point of view, which seems to be in the minority. Most of the companies expect the imports from day one. And then the second part to the equation is that in the event that the regulator only allows domestic production, how long will it take you to ramp up, I don't know, a greenhouse or production to supply the market? When would you need to start investing? And are we looking at a one-year or two-year time frame? Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nYou got it. So, I think our position on Germany is led by having significant resources on the ground. We have full time people there. We have a tremendous government relations organization.\n\nAnd we've been consistent in that opinion. And I'm not here to disparage any of my competitors because I really -- that's not my place. But we've been very consistent that for medical cannabis, in that part of the world, in Germany, particularly, you'd be able to import; for recreational cannabis, whether it was around the UN convention or a variety of other two-party agreements, there's just did not seem to be a pathway for that. And as one of only three companies that are currently producing cannabis in market under a medical license, we're very close to the regulators, and we have incredible respect.\n\nSo, going back to what we've seen, and this is me referencing what Mr. Lauterbach said, he's the health minister. What they're really talking about is that they are going to have a science-based integrated framework. And I give them a lot of credit.\n\nThey're talking to regulators across the world in different markets. They're talking to a variety of people. And they are talking to industry to get sort of this consolidated opinion. And I would not lose the topic that what's happening with rec is not also --- is not taking away from what's happening in the medical channel, there's also enhancements being made to that critical medical channel.\n\nSo, what are the key elements of this? And what did he say? Possession up to 30 grams, no limit on THC, which is a really important piece, potential limits for those under 21, cannabis tax being applied on TH content. The aim of the final consumer price, try to keep that close to the black market to create that attraction. Clearly, there'll be advertising and sales and marketing prohibitions. And at least in the initial draft, edibles are not allowed, and as you mentioned, Pablo, so clearly, domestic production.\n\nAnd they've been very interested in understanding what's that clear regulatory framework around quality, security, and production standards to still be there. I would also mention they've been very proactive in getting the feedback from the EU. And that doesn't happen in a vacuum. We're thrilled about that type of process.\n\nThey have such a critical country, then go to the EU. And as I mentioned in my other comments, having the Czech Republic be looking toward Germany and trying to, in some cases, mimic or mirror those learnings, has to indicate that you're going to see consistency in these regulations. So, that's sort of the general overview, more to follow. We're thrilled with what we've seen so far.\n\nIn terms of timing, depending on the magnitude of the facility, Pablo, you're talking about a year and a half to two years from the moment you say go and write the check and have these items be at that high quality. They're aware of that. The regulators clearly are aware of that. And there's been some tremendous, I would say, conversation back and forth about the realities of what that looks like.\n\nAnd we'll continue to be respectful of that. We're thrilled to be in market. But Germany is going to be a really important bellwether country in a lot of different ways. And I would encourage folks to stay close to it.\n\nOperator\n\nAnd our next question comes from the line of Andrew Carter with Stifel. Please proceed with your question.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nHey. Yeah, thanks. I guess I wanted to ask that Canadian consumer came in well ahead of our estimate, or well ahead of what we were thinking. And I guess, you guys have kind of a tepid guide around the disruptions, yet sequential growth.\n\nFirst off, can you tell us how much Greybeard contributed? And also, maybe disaggregate the performances by channel. Quebec's been strong, love to hear that. And of course, the Headset data says you were down 13% POS. Of course, could be backwards looking if things are just working their way through.\n\nSo maybe also give us an aggregate of what shipments were outside of Quebec. Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nLet me make a comment about I guess Headset problems, first, then I'll kick it over to Glen on the rest of the question. Quebec is our largest province in terms of shipments. We really value our partnerships with all the provinces, but Quebec has been particularly good for us. As you know, Andrew, many of the syndicated services do not include Quebec and the province on stores.\n\nAnd so, it does skew the results a bit, particularly for us as someone who does the majority of their business in there. I think, Greybeard was a significant contributor but also, we've had successes on two fronts that has helped us. One is our significant improvements in yield has allowed us to go back into some of the, say, larger format sizes, that now makes sense for us in a way that they didn't make sense for us before. And we're also participating at a much higher level in some of the faster-growing, higher-margin segments, such as pre-rolls and concentrates.\n\nGlen, do you want to take the rest of it?\n\nGlen Ibbott -- Chief Financial Officer\n\nYeah. Greybeard and the Thrive brands are important brands to us. But they are our premium brands. So, they don't drive a ton of revenue.\n\nI'd say they're probably in the 15% range this quarter and certainly growing, but margin-wise, they're very important to us. As Miguel mentioned, the provincial distribution, that actually drives a lot of our bottom line, heading into the right provinces and the right products, and with the distribution, say Quebec offers you with the distribution in all the stores. The provincial mix is as important as the product mix to us on our bottom line. So, I think it continues to be an important market for us.\n\nOntario's got a very big revenue market. But I'd say, we certainly are choosy on what products we launch in Ontario to make sure that we continue to have that focus on protecting our margins and being able to drive the profitability.\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nJust clarifying in there, you said getting back into large formats. Does that mean -- which I thought the focus was 100% premium. Is it just the lower cost structure allows you to do that? I just wanted to make sure and clarify that comment.\n\nMiguel Martin -- Chief Executive Officer\n\nYeah. So, we -- particularly on discounting and value, we got out of spots where 14 grams and 28 grams just didn't make any sense. And what we -- because of the cost structure that we had with this -- with the enhanced genetics, and in some cases, getting 2x the yield per square meter, it allows you to go back into some of that. And then you covered about an idea of the growth of 28-gram, and some of those larger formats have been pretty significant.\n\nSo, you can get in there and actually make some money on it. It's a win from a revenue standpoint. The other point I guess I would make is the fragmentation and whether we're at the bottom or not, you've got the top five companies that right now are, I don't know, 36% of the business, and last year there were 48%. So, there is a lot of consumer movement, Andrew, which I know you know.\n\nBut so, when you come out with new things like we have, the environment is pretty ripe to make some quick gains. And so, we've been pretty pleased with that, outside of Greybeard.\n\nOperator\n\nThank you. And our next question comes from the line of John Zamparo with CIBC. Please proceed with your question.\n\nJohn Zamparo -- CIBC Capital Markets -- Analyst\n\nThanks. Good evening. I also wanted to touch on the consumer channel but on gross margins. And you've repositioned into premium and you've added Thrive but adjusted margins are down sequentially and year over year.\n\nIs that mostly a function of volume and you just need to increase that to get higher margins? I know the press release mentioned packaging costs, but is there any other color you can add there? Thanks.\n\nMiguel Martin -- Chief Executive Officer\n\nYeah. I mean, John, as you know, the rec business is really challenging right now. And so, the pricing continues to drop. So, the macro environment makes it a challenge.\n\nYou've talked about packaging. There are other sort of inputs on the inflation side that push down the margin a little bit. Clearly, utilization and spreading the fix across does make a difference. We are seeing some opportunities, as I said in my prepared remarks, leveraging common infrastructure for rec and medical that we think will have some margin.\n\nBut I think the margin in the rec business overall is going to be under pressure. As sort of we look forward, we've been able to find spots where we've been able to keep it at where it's at through a little bit of mix, to Glen's point, a little bit of geography and a little bit of introduction of new products, particularly premium products. But overall, I think for most manufacturers, you're going to be dealing with a challenging pricing environment in the meantime. Now, you make a big move on yield, you make a big move on something in a pre-roll or in a concentrate or in a premium or ultra-premium flower, you can make a move there.\n\nBut I think overall, I think, it's a little bit of the environmental catching up. But yeah, clearly if you improve your overall production and you move through the fixed cost, you're going to improve your margin. I mean, Glen, I don't know, anything you want to add on margin and rec?\n\nGlen Ibbott -- Chief Financial Officer\n\nYeah. John, that's a great question. You're exactly right. So, I mean, what we see in contribution margin so that incremental margin on the next unit of sales is quite compelling.\n\nSo, I think there is a volume there and that's why it's nice to see us kind of getting a little bit of stability and even a bit of growth in the consumer channel. So, as we do -- and we've got some exciting new products that have dropped recently and that we're seeing nice pickup across some of the provinces. So, I'm excited to see what that does in terms of margins. Lots of headwinds as Miguel said, lots -- but at least we've got some levers we're trying to protect and maybe even grow some of those margins with a bit of volume.\n\nOperator\n\nThank you. And our next question comes from the line of Matt Bottomley with Canaccord Genuity. Please proceed with your question.\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nAll right. Good evening, everyone. Just wanted to take a step back just on the Canadian medical market, that side of the business. I think we chatted Miguel about this a couple of quarters ago.\n\nBut just given that this has essentially been a $100 million business for some time now, and I understand there's some strategy, and going after margin on insured patients versus just trying to grow the top line for the sake of it. But I'm just curious if there's any other variables or elements other than insurability that might drive the overall industry growth and then if Aurora can keep its 25% share to see the commensurate growth with that. Is it just insurance or there's anything that you guys can do that's in your control in the interim to try and help that? And then maybe another side of that question, just also related to just sort of the doctor acceptance or doctor uptake. Are we seeing more doctors prescribe cannabis? Where is sort of that segment of the market in terms of where the medical professionals are at? Really no other LP talks about this line of the segment, just given that most are focused on other things, or adult use.\n\nSo, I think just a lay of the land might be helpful.\n\nMiguel Martin -- Chief Executive Officer\n\nSure, I'd be happy to. Right now, when you look at the Canadian medical business, you got 1% of the Canadian adult population that participates in it. And if you're looking for drivers of it, first and foremost, because the margin is so compelling, compared to rec, not compared to pharma or traditional sort of forms of medical, you get a lot of folks playing around it. And as I mentioned, it's a pretty consolidated piece of business.\n\nSo, what are the aspects that will improve the overall medical business? Well, first and foremost, I would remind people how early we are in this. And for most clinicians, physicians, and patients, clinical research and efficacy and the real science behind medical cannabis is just coming online. And so, we've been honored to participate in some clinical research, you've seen stuff in U.S., you're seeing a ton of stuff in Israel. And as that comes online, you're going to really start to change the equation for all the key stakeholders, everything from the insurance companies, to the clinician, to the patient around that.\n\nAnd some of the stuff that's coming out is pretty compelling around some of the traditional use cases that you see around medical cannabis, whether that's anxiety, or sleep, or PTSD, or neuropathy, or whatever those things may be. So, that's a very important driver. I think the next driver is that you're starting to see some of the insurance companies and the private companies and those that have coverage, bringing cannabis coverage into the -- more into the mainstream in terms of the benefits program, up to including companies like ours that have direct billing, and that really makes a big difference. And obviously, some of these large union contracts make a lot of noise in terms of how they're coming online.\n\nAnd I think third, Matt, is this general sort of increasing acceptance around cannabinoids and their use beyond things like Epidiolex, and you're really starting to see that come to the forefront. And that definitely changes the overall equation. When you only have 1% of the adult population receiving that benefit, any sort of movement makes a massive difference, and I think the benefits will be outsized to a very small subset of companies that participate in it. And it's a very expensive program.\n\nAnd it takes an incredible amount of work and nuance and effort to support patients and insured patients, and obviously, the veteran patients who we owe so much to. So, I think in all of that, as people try to model what this is, it's going to grow. It's going to become more mainstream. It's going to become more clinical.\n\nIt's going to become more science driven. And the benefits will fall down to a small group of companies. And that sort of progression is portable. The German regulators are deeply interested in the science and in the history of what's happening in the Canadian medical experience, same thing with France, U.K,.\n\nIsrael, and on and on and on. So, it really is a global network and a global sort of lineup. And I think for companies like us, we're going to continue to participate in those, and hopefully, that alignment allows us to be able to respectfully and responsibly work with the regulators. And so, we're very bullish on medical cannabis -- true medical cannabis, not what you may have seen in certain markets.\n\nAnd I think if you look at the overall global numbers on medical cannabis, even being conservatively, while it's hard on our market by market, but the overall growth on it is quite significant. Did I answer your question, Matt?\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nGreat. And actually, not to try and put another second question, but just on what you were saying, curious in terms of the patients that are onboarding in the Canadian market. Is there any element of obviously, if it's insured, that's different, but for people that aren't insured, is there any element of them joining the medical market? Obviously, there's some friction with registering with LPs and things that aren't really typical in a lot of industries. But once they ship in order or two, do they then just go and know the products they like, and then just for the sake of ease go to their local dispensary? I know, in Ontario, there's one on every corner now.\n\nSo, is that part of the dynamic that's making it hard to ramp up patients in the country?\n\nMiguel Martin -- Chief Executive Officer\n\nNo, I wouldn't say so. I mean, there has clearly been some interaction with the medical market to the evolution of the rec market. But this, I think, is maybe where in certain markets this gets misconstrued. This is primarily a conversation that a patient has with a clinician or a physician, or an advisor to go get medicine.\n\nAnd so, obviously, from an insurance standpoint, there's no economic advantage to go into the rec. But for the vast majority of the patients we interact with, this is a medical aspect and medical case that is connected to a physician or a clinician or an advisor. And that interaction in the same way you would have with, others form of medications, this doesn't lend itself to that. Now, maybe an uninsured patient that finds something and sees some other reason to go get there.\n\nBut when you're talking about people that are overindexing on things like capsules and oils and other things that maybe aren't the sort of the flavor of the day and the rec business, you really find this as truly a medical construct and the medical infrastructure that lends itself to that more so, then just a surrogate for rec use.\n\nOperator\n\nThank you. And the next question comes from the line of Frederico Gomes with ATB Capital. Please proceed with your question.\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nHi. Good evening. Thanks for taking my question. Just on the Netherlands, could you provide an update on your investment there? And I know that you've talked a lot about Germany.\n\nBut how do you view the opportunity in the Netherlands? And potentially in terms of timelines, when can we expect sales from that project to start? Thank you.\n\nMiguel Martin -- Chief Executive Officer\n\nYou got it, Fred. So, in the Netherlands, there are two aspects of it. There's the medical aspect that we continue to participate in where the government is reviewing products and will make a final assessment probably in May or June of next year about that is. From the rec standpoint, there really isn't an update for us.\n\nWe're still waiting to hear about a firm date and what is the process. And there have been general details for those 10 licensees to service roughly 500 coffee shops in a variety of towns and cities throughout the country that would give everybody the opportunity to look at everything from data to service levels and whatnot. So, I don't really have an update for you right now. At the time in which we have one, we'll give it, but we're still waiting for some information on exactly what it's going to be, and when it's going to kick off, and exactly what that all looks like.\n\nBut to be clear, the information that we've seen previously has been -- there would be a test for those 10 licensees, and I know, Fred, you're well aware of how that all worked out, and then post that test after an undetermined period of time, they would then talk about a different construct.\n\nOperator\n\nThank you. And the next question comes from the line of Tamy Chen with BMO Capital Markets. Please proceed with your question.\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nHi. Thanks for taking my question. I was just curious, in terms of inventory impairments, when do you expect that will kind of get through past that? Because I know you've had Sky shutting down and all of that. So, I'm just wondering when we get past that and don't really see more of the impairments going forward.\n\nThank you.\n\nMiguel Martin -- Chief Executive Officer\n\nGlen?\n\nGlen Ibbott -- Chief Financial Officer\n\nYeah, sure. I'll take that. Tamy, thanks for the question. There's a few things going on here.\n\nOne under IFRS, as I'm sure you're aware, there's a biological asset standard that ends up with some fair values in our inventory that when you have to write things down to net realizable value, at the end of the day, there's an ongoing sort of noise quarter to quarter of just provisioning down to realizable value on your inventory. But more to the point, a lot of the footprint rationalization that we've done with our production facilities are to get us to a better spot, where we are producing high quality, low cost, and very focused on what the consumer wants and minimizing excess production. Now, it is an agricultural crop and certainly, in the consumer markets, we do find the consumer taste do evolve. So, it's never going to be perfect, I think, in terms of alignment.\n\nWe think we would expect that there would always be some, hopefully, small percentage of inventory that ages out a little bit. Now, what we do find though is that we're developing more and more channels for our cannabis. So, it may fit the rec market in Canada. It may fit the medical market in Canada.\n\nIt may be excellent of an export product to another medical jurisdiction. Even within those international medical jurisdictions, we're starting to develop different tiers of product and what we call a premium and value. So, two things that we can do here is continue to rationalize our production footprint and really focus on producing high-quality cannabis and to continue to develop more and more channels for outlet of that cannabis. So, we expect it to improve over time, Tamy, but being agricultural, there will always be a little bit of noise in the inventory.\n\nOperator\n\nThank you. There are no further questions at this time. And I would like to turn the floor back over to Miguel for any closing remarks.\n\nMiguel Martin -- Chief Executive Officer\n\nWell, I appreciate everybody's interest in our business and in this quarter. We're thrilled about where we're at and we're looking forward to the next call. And we look forward to having the conversations with many of you. So, I wish everyone a safe -- and for those that are celebrating Remembrance Day tomorrow, which is obviously an important day for everyone, we have well-wishes on that.\n\nBut thanks to all. And we look forward to talking to you in the future. All the best.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAnanth Krishnan -- Vice President, Strategic Finance\n\nMiguel Martin -- Chief Executive Officer\n\nGlen Ibbott -- Chief Financial Officer\n\nVivien Azer -- Cowen and Company -- Analyst\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nPablo Zuanic -- Cantor Fitzgerald -- Analyst\n\nAndrew Carter -- Stifel Financial Corp. -- Analyst\n\nJohn Zamparo -- CIBC Capital Markets -- Analyst\n\nMatt Bottomley -- Canaccord Genuity -- Analyst\n\nFrederico Gomes -- ATB Capital Markets -- Analyst\n\nTamy Chen -- BMO Capital Markets -- Analyst\n\nMore ACB analysis\n\nAll earnings call transcripts"
}