{
  "companyName": "BJs Restaurants",
  "companyTicker": "BJRI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/21/bjs-restaurants-bjri-q3-2022-earnings-call-transcr/",
  "content": "BJs Restaurants (BJRI -1.60%)\nQ3 2022 Earnings Call\nOct 20, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the BJ's Restaurants, Inc. third quarter 2022 earnings release and conference call. Today's conference call is being recorded. At this time, I would like to turn the conference over to Greg Levin, `chief executive officer and president.\n\nPlease go ahead, sir.\n\nGreg Levin -- President and Chief Executive Officer\n\nThank you, operator. Good afternoon, everyone, and welcome to BJ's Restaurants fiscal 2022 third quarter investor conference call and webcast. I am Greg Levin, BJ's chief executive officer and president, and joining me on the call today is Tom Houdek, our chief financial officer. We also have Greg Lynds, our chief development officer on hand for Q&A afterwards.\n\nAfter the market closed today, we released our financial results for the fiscal 2022 third quarter. You can view the full text of our earnings release on our website at www.bjsrestaurants.com. Our agenda today will start with Rana Schirmer, our director of SEC Reporting, providing our standard cautionary disclosure with respect to forward-looking statements. I will then provide an update on our business and current initiatives, and then Tom Houdek will provide some commentary on the quarter and the current environment.\n\nAfter that, we will open it up to questions. Rana, please go ahead.\n\nRana Schirmer -- Director of Securities and Exchange Commission Reporting\n\nThanks, Greg. Our comments on the conference call today will contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the company to be materially different from any future results, performance or achievements expressed or implied by forward-looking statements. Investors are cautioned that forward-looking statements are not guarantees of future performance and that undue reliance should not be placed on such statements.\n\nOur forward-looking statements speak only as of today's date, October 20, 2022. We undertake no obligation to publicly update or revise any forward-looking statements or to make any other forward-looking statements, whether as a result of new information, future events or otherwise, unless required to do so by the securities laws. Investors are referred to the full discussion of risks and uncertainties associated with forward-looking statements contained in the company's filings with the Securities and Exchange Commission. Greg?\n\nGreg Levin -- President and Chief Executive Officer\n\nThanks, Rana. BJ's third quarter results beat our internal forecast, showing our ability to leverage extra sales growth and drive incremental profit despite the ongoing inflationary environment. While our sales have continued to recover nicely on a comparable restaurant basis, restaurant costs remain elevated, impacting restaurant-level margins compared to our historical levels. However, we have seen a more recent moderation of inflation, and we are beginning to see the initial benefits of our margin improvement initiatives, which when combined with our sales driving initiatives, give us the opportunity to expand our margins back into the mid- to upper teens over time.\n\nFrom a top line sales perspective, our quarter three comparable restaurant sales increased 8.2% as compared to the same quarter in 2019, which accelerated from 4.8% in the second quarter on the same three-year basis. Likewise, comparable restaurant sales increased 8.9% over the same quarter in 2021. Looking at our different sales channels, dine-in comparable restaurant sales traffic trends improved in the quarter, reflecting our ability to staff at higher levels ensuring that guests know they will be taken care of with our gold standard level of service and gracious hospitality during every visit. Our dine-in comparable restaurant sales have now beat the casual dining industry as measured by Black Box on a three-year basis every quarter in 2022.\n\nIn fact, we increased our diamond sales lead over the industry in each quarter of 2022 and the third quarter represents our widest lead yet over the industry during the pandemic era. Off-premise sales also remained very strong and continue to pace at more than double pre-COVID levels. Even as dining room traffic recovers, we continue to see very healthy sales levels for both takeout and delivery. Our comprehensive strategy to grow sales, as I outlined in detail on our previous quarterly call, is working, even though we are only in the early innings.\n\nThese sales initiatives over the long run will allow us to leverage the fixed costs inherent in our business to drive margin expansion. Our sales building initiatives starts with great best-in-class restaurant leadership and staffing. Earlier this month, we held our Annual General Managers Conference in Denver. After spending time with our restaurant leaders from around the country, I am confident we have the right people with the right mindset to execute our culture around craft matters, gold standard level of operational excellence and gracious hospitality to drive BJ's forward on our road to $2 billion in sales and beyond.\n\nTo that goal, BJ has added the first stand-alone chief people officer, Amy Krallman, to its leadership team in early Q4. We are thrilled to have Amy join the team and know she will help make BJ's even more competitive in the marketplace. In the third quarter, hourly retention rates continue to improve and were better than year ago levels, but still not back to pre-pandemic levels. Because there remains a strong correlation between restaurant staffing levels and comparable restaurant sales, we intend to continue adding team members as necessary in the coming weeks to capture more sales in the near term and to have the right teams in place as we head into the busy holidays, so we are able to maximize our fourth quarter sales potential.\n\nAnother area of growth within the four walls of our existing restaurants is our remodel initiative. We have now added seating capacity in seven restaurants and have had similar sales success at each location, creating a very attractive return profile. We have also updated the bar statement in a high-volume legacy restaurant by modernizing the woodwork, streamlining the bar by moving the taps to the back wall and adding a new 130-inch TV as the centerpiece. It looks absolutely great, and we have another bar remodel plan for later this month.\n\nWe also plan to remodel two patios in the fourth quarter to increase the number of days we can offer patio seating, effectively increasing the capacity for these restaurants as well. With the restaurant return profile we have seen to date, remodels improved the economics of our existing restaurants and will be an important part of our capital allocation strategy going forward. We will continue to analyze and refine this plan through the balance of this year, and we will incorporate a larger remodel initiative into our 2023 capital planning. We also made considerable progress in the quarter on initiatives that will drive future sales.\n\nFor example, we continued our work on expanding our high-potential catering business. We are testing a more high-touch catering experience to help further expand the corporate channel, which tends to have more recurring orders with a higher average check. In the third quarter, our catering business was up approximately 75% over 2021 and more than double 2019 levels. We expect the trend of more workers returning to office and more in-person meetings to be a tailwind for catering in the near term.\n\nNext, we continue to progress with some great best-in-class guest and team member technology. We updated the software in our server handheld tablets used for order taking to improve functionality and reliability. Our team member feedback has been fantastic, and our servers are much more effective with the devices. Additionally, our digital order tracker is now live, so guest ordering takeout, curbside and white label delivery can track their order status in real time.\n\nWe are seeing approximately 75% usage for the relevant orders, which proves how useful this technology is to our guests. As an added surprise and delight feature aligning with our Brewhouse concept, the tracker is a pint of beer that fills up as the order moves through to completion. We have also integrated the order tracker with our existing digital curbside check-in portal. Digital curbside check-in usage has quickly increased by 5% with the rollout of the digital order tracker, illustrating the benefit of providing our guests with a broader set of digital convenience tools.\n\nAnother key initiative is our digital call-ahead waitlist, which uses artificial intelligence to determine and communicate accurate table wait times to our guests through digital and automated voice channels. This is another example where our tech innovation and adoption helps both guests and team members since the legacy process is slower and more labor intensive. We have been testing digital call-ahead waitlist for a number of months and intend to roll it out across our system in the fourth quarter. Finally, we are far along the process of designing and building a new BJ's e-commerce platform.\n\nWe intend to launch our next-generation web-based ordering platform by the end of this year. The team has been hard at work preparing the consumer interface and flow to make it easy and enjoyable for guests to order and reorder. We will then leverage the web design work to update our mobile app next year. We believe that modernizing digital ordering will deliver a strong payback in terms of increased digital orders.\n\nWith regards to our new restaurant expansion strategy, last week, we opened a new restaurant in Las Vegas, Nevada, which is our fourth opening this year. We are very pleased with the strong sales performance of all of our new restaurant openings, which continue to demonstrate that guests love the BJ's concept in both new and existing markets. We also recently closed a legacy small-format restaurant that was no longer financially viable to operate, bringing our current footprint to 214 restaurants. We now expect to open two additional restaurants in the fourth quarter, which would bring our total openings this year to six restaurants.\n\nDue to supply chain and construction delays, we now expect these two restaurants that were initially slated to open this year to open in the first quarter of 2023. Looking to next year, our new restaurant pipeline is in excellent shape. However, we are still finalizing our 2023 new restaurant openings, given the challenges from construction inflation, supplies of HVAC and kitchen equipment, construction labor shortages and delays in permitting from municipalities. Additionally, we plan to prudently balance new restaurant growth with high return remodels, which drives sales through, among other things, added seating capacity.\n\nTherefore, while we have not finalized our 2023 new restaurant opening plan, I would anticipate that we will open a similar number of new restaurants next year. We also resumed returning capital to shareholders this past quarter through share repurchases. Therefore, as we finalize our 2023 capital allocation strategy later this year, we plan on prudently investing in sales building initiatives, new restaurant growth, remodels and opportunistically returning capital to shareholders. With respect to the broader macro environment and consumer demand, BJ's underlying guest measures have remained steady.\n\nWeekly sales have followed a pretty typical seasonal pattern and our three-year comparable restaurant sales were in the middle to upper single-digit range throughout the third quarter and into the first three weeks of the fourth quarter when adjusting for promotions and Hurricane Ian. Guest expectations rise with menu prices, which I believe benefits BJ's, giving our attention to providing exceptional service, hospitality and food quality. We are committed as ever to making sure our guests leave smiling and wanting to come back for more. Shifting to costs, operating costs in our business remain high through the -- remain high, though the level of inflation has moderated recently, which Tom will cover in more detail.\n\nAs I outlined on our last earnings call, we launched our cross-functional margin improvement initiative to identify a wide range of cost-saving opportunities to benefit our restaurant margins. We have made tangible progress over the past quarter of finding meaningful cost-saving opportunities. Our cross-functional team has been actively identifying, vetting and when appropriate, implementing identified cost savings. Our third quarter results reflect hourly labor savings as we rolled out more efficient labor scheduling early in the quarter.\n\nWe also tested and approved a number of changes across our food inputs that save money while maintaining or even improving and enhancing food quality. These saving opportunities began rolling out in late Q3, so the benefit is largely not reflected in our third quarter results. We also have several other savings initiatives at different stages of testing and approval. So to offer more insight into our program and the effort and creativity of the team, let me quickly review recent changes we made to our chicken wings as an example.\n\nFor years, we have served a large precooked bone and wing that we would fry when ordered. An idea from our margin improvement team was to test sourcing raw jumbo wings, cooking them in our slow-roast ovens that only we can do at BJ's because of our technology in the chain casual dining segment and then fry these slow-roasted wings when ordered. They say necessity is the mother of invention. These wings are delicious and the best wing BJ's has ever served.\n\nThese new wings are in all BJ's Restaurants as of earlier this month and we are now saving materially by sourcing a commodity raw jumbo wing as opposed to a precooked wing that was made specifically for BJ's. This change alone saves us more than $3 million annually based on current prices and benefits to restaurant level cash flow margins by approximately 20 basis points. We remain committed to identifying cost-saving opportunities that could enhance our restaurant margins by as much as 200 basis points. Given the progress to date and the number of opportunities still being explored, I am confident we will achieve this goal.\n\nMoreover, this is a powerful initiative since cost savings directly reduced the pricing required to offset inflationary pressures, which in turn, further strengthens our competitive value position. In summary, we are focused on a comprehensive set of initiatives aimed at significantly increasing our average weekly sales, growing our restaurant margins and continuing our national expansion with a controlled pace in top quality sites with a goal of growing BJ's sales to $2 billion and beyond and delivering meaningful earnings growth and shareholder returns over time. In the meantime, we are incredibly optimistic that guest affinity for our brand and menu offerings, coupled with the trajectory of our business and our current growth and margin-enhancing initiatives will enable us to achieve attractive near and midterm growth and margin objectives. Now let me turn it over to Tom to provide a more detailed update from the quarter and current trends.\n\nTom?\n\nTom Houdek -- Chief Financial Officer\n\nThanks, Greg, and good afternoon, everyone. I will provide details of the quarter and some forward-looking views. Please remember this commentary is subject to the risks and uncertainties associated with forward-looking statements as discussed in our filings with the SEC. For the third quarter, we reported total sales of $311.3 million.\n\nOur sales increased approximately 10% versus Q3 of 2021 and 12% versus Q3 of 2019. On a comparable restaurant basis, sales increased by 8.9% compared to Q3 of 2021 and by 8.2% compared to Q3 of 2019. Our three-year comparable sales accelerated from negative 1.5% in Q1 to 4.8% in Q2 to 8.2% in Q3. The comparable sales improvement in conjunction with certain savings we started to realize from our margin improvement initiative and the benefit of our August pricing round helped partially mitigate the typical margin decline that accompanies our seasonally lowest sales quarter.\n\nOur restaurant-level cash flow margin was 10.3% in Q3 of 2022 or 160 basis points lower than Q2 of 2022, which tends to be our highest sales quarter seasonally. As a reference point, in 2019, our restaurant level margins declined 350 basis points from Q2 to Q3. So we are encouraged by the factors that helped offset a meaningful portion of the typical seasonal margin decline in Q3 this year. Adjusted EBITDA was $15.2 million and 4.9% of sales in our third quarter behind Q3 2021 reported levels.\n\nAs a reminder, we had a $3.1 million employee retention tax credit in conjunction with the CARES Act that benefited our labor and benefits line in Q3 of 2021. When removing this one-time benefit, our adjusted EBITDA and adjusted EBITDA margin both improved this quarter from a year ago. We reported a net loss of $1.6 million and a diluted net loss per share of $0.07 on a GAAP basis for the quarter, which was an improvement from a year ago. From a sales perspective, we averaged in the mid- to high single digit positive comparable restaurant sales range through the quarter compared to 2019.\n\nThis equated to a weekly sales average of more than 111,000 per restaurant or approximately 8,000 higher than Q3 of 2019. We maintained our off-premise weekly sales average in the low $20,000s while generating dine-in sales of more than 91,000 in Q3. Moving to expenses. Our cost of sales was 27.3% of sales in the quarter, which was 30 basis points favorable compared to last quarter, though 10 basis points unfavorable compared to the third quarter of 2021.\n\nFood costs remain high, but the increases to our food basket have moderated. Our food cost inflation was approximately 5% higher than the third quarter of 2021 and up modestly from the second quarter of this year. As Greg highlighted, we are implementing margin improvement savings that will benefit food costs. We rolled out some minor changes during the third quarter and expect to realize more meaningful savings opportunities beginning this quarter.\n\nTo help offset inflationary pressures, we increased our menu prices by an additional 2% in August. We have now increased our menu prices by approximately 12% since the beginning of 2020 as compared to food cost inflation of about 23% over the same period. We raised menu prices slower than the inflation impacting our business to gauge the sustaining cost increases while being careful to maintain strong competitiveness in known value items and offer our guests a range of options to enjoy regardless of their budgets. Our next menu pricing ground is planned for January 2023, and we will price accordingly to further recapture restaurant margins and offset inflation that we are not able to mitigate through our margin improvement initiative.\n\nTo date, we have seen no guest pushback to our menu pricing rounds. Labor and benefit expenses at 37.7% of sales in the quarter were 50 basis points unfavorable for the third quarter of the prior year as reported, but 60 basis points favorable when removing the one-time ERTC benefit from the prior year figure. Our hourly labor efficiency greatly improved in the quarter. We improved our hourly labor as a percentage of sales by 30 basis points from Q2 to Q3, even as our weekly sales declined seasonally by approximately $7,000.\n\nThat's quite an accomplishment by our restaurant operators. Part of the improvement was driven by more efficient labor scheduling tools from our margin improvement initiative. We also lowered our overtime and training hours, which are now 20 basis points higher as a percentage of sales than Q3 of 2019, an improvement of 50 basis points from the pre-pandemic comparison last quarter. Occupancy and operating expenses at 24.7% of sales in the quarter were 30 basis points unfavorable to the third quarter of 2021.\n\nIncluded in our O&O expenses was marketing spend at 1.7% of sales, which was higher than the third quarter of 2021 by 40 basis points, driven by media investments, including connected television in certain markets to drive incremental sales. Excluding the additional marketing investment, our O&O expenses would have been favorable by 10 basis points compared to Q3 of 2021. G&A for the third quarter was $18.9 million, in line with our expectations. We continue to forecast full year G&A in the $74 million to $75 million range, including the impact of our 53rd week in Q4.\n\nTurning to the balance sheet. We maintained our debt balance at $50 million and ended the quarter with net debt of about $31 million. We are very pleased with the strength of our balance sheet and remain consistent in our approach of prioritizing growth driving investments by a return profile, including building new restaurants, improving our existing restaurants and funding sales-driving initiatives. We continue to expect capex spend in the $90 million to $95 million range this year, which includes six restaurants we intend to open in 2022 and two additional restaurants opening -- two additional restaurant openings now slated for 2023 -- early 2023.\n\nEven though we postponed two restaurant openings to the first quarter of 2023 due to supply chain and construction delays, most of the related capex spend will still occur in 2022. As Greg alluded to earlier, the strength of our balance sheet allows us to continue our growth investments while again, opportunistically repurchasing shares. Our operating stability, sales building and margin improvement success positions BJ's to opportunistically return capital to shareholders through share repurchases in the third quarter. During the quarter, we repurchased and retired approximately 91,000 shares at a cost of approximately $2.4 million, which leaves approximately $22.1 million remaining available under our currently authorized share repurchase program.\n\nLooking to the fourth quarter of 2022, we remain encouraged by our recent sales trends. Our comparable restaurant sales period to date in October increased approximately 8% and 6% compared to the same periods in 2021 and 2019, respectively, when adjusting for the impact of Hurricane Ian in 2022. As Greg said in his remarks, we have yet to see any meaningful shift in our guest trends, but we continue to monitor the situation and remain agile to appropriately manage to any environment. Historically, our sales build from the third quarter to the fourth quarter, driven by improving restaurant traffic leading up to the holidays.\n\nFor example, in 2019, our average weekly restaurant sales increased from approximately $104,000 in Q3 to approximately $108,000 in Q4. In Q4 of 2022, I anticipate that our sales will follow a similar seasonal trend, which will allow us to leverage the additional sales and improve margins. Given the higher expected sales, the 53rd week and early margin improvement opportunities we've realized and other opportunities in front of us, which will help mitigate inflationary pressures, we are targeting Q4 restaurant-level margins in the low to mid-12% area. In terms of taxes, I expect a modest tax expense in Q4.\n\nIn summary, we know the best way to grow margins and profit is to grow sales. Recent sales trends have been encouraging, and we remain committed to being sales drivers, first and foremost. We intend to continue to build sales and what we believe will be a busy holiday season with demand for experiential dining remaining strong. At the same time, we have elevated productivity and cost savings through our margin improvement initiative which -- with nice momentum built over the last quarter.\n\nWe have a clear path to sales growth and margin recovery, and our long-term strategy remains intact. While new challenges emerge through the pandemic, we continue to meet these challenges head-on, manage our business for both near and long-term objectives and remain steadfast in our focus on providing our guests with the best experience, which will allow us to continue delivering outsized growth in the years to come. Thank you for your time today, and we'll now open the call to your questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] And we will go to our first question from Alex Slagle with Jefferies.\n\nAlex Slagle -- Jefferies -- Analyst\n\nAll right. Thanks. I had a question on capital allocation. If you could kind of talk through a bit more how you're thinking shifted over the last few months with the restart of the buyback efforts and the plans to expand the remodel program in '23, maybe just what you are seeing in the business with and with the remodel tests and I guess, just how best in your views the broader development landscape has evolved at this point?\n\nGreg Levin -- President and Chief Executive Officer\n\nYeah. I'll start off, Alex, and sure Tom or even Greg Lynds, our chief development officer, might be able to add in here. So I think on a broad picture, getting restaurants built on time has probably been a big challenge for us in the industry. I think it used to take us somewhere near about 130 to 150 days to get a restaurant built if maybe even a little bit earlier than that or quicker than that.\n\nAnd it's basically doubled. It's somewhere is in the 260 range or so to get a restaurant built. And that's how we started to push at this.. At the same time, we still like the sales levels and returns we're getting from new restaurants.\n\nBut because of the challenges of getting restaurants done timely and just the supply and demand, we continue to see elevated construction cost there. And while our sales to investment ratio are still above one based on the solid sales of new restaurants, it just makes us, frankly, kind of take a look across the board as to how we want to allocate capital at the current time where we want to have that right balanced approach of investing in new restaurants, knowing then that we got these high-return remodels, especially when we can add capacity and keep our concepts in a like new first-class and contemporary manner. So I think as we go through this year knowing some of the challenges on the construction side, pivoting a little bit more toward remodels being able to drive that sales, that will help drive improved margins and economics in those restaurants, I would say that's as high a priority in our business as opening new restaurants, as well as some other sales building initiatives. I think third on that three-legged stool is the capital allocation program, and we'll continue to evaluate that in regards to share repurchase, but we don't want to do it at the expense of being able to invest back into remodels and their sales building initiatives and building new restaurants.\n\nTom or Greg, is there anything to add to construction or anything you've seen?\n\nGreg Lynds -- Chief Development Officer\n\nThis is Greg Lynds. I think from a construction standpoint, when you think about what's happening in the future here, if we're out to bid right now, we're going to feel all the pressures that the development cycle has right now. So you're seeing not only the construction costs that you're seeing, entitlement delays, permitting delays, inspection delays. And we do see that abating next year.\n\nSo in terms of building our pipeline, we're really looking for mid- to late '23 and 2024 type projects when we see a lot of this abating.\n\nGreg Levin -- President and Chief Executive Officer\n\nThank you, Alex.\n\nOperator\n\n[Operator instructions] And we'll go next to Jon Tower with Citi.\n\nJon Tower -- Citi -- Analyst\n\nGreat. Thanks for taking the questions. Just a few, if I may. The quarter-to-date commentary is encouraging in terms of what you're seeing for same-store sales.\n\nI'm just curious if maybe you could give us any sort of color into perhaps if the California stimulus is helping that number at all? Or if you're seeing this more spread across the system?\n\nTom Houdek -- Chief Financial Officer\n\nSure thing, Jon. We've looked at it when the stimulus has started earlier this month and I would say Southern California has been outperforming on average, and it continues to. So there might be a little bit there, but it really hasn't shown up in any big way in the numbers. So we're happy to have it.\n\nBut it does look like the business itself was performing well before and is still where we like it.\n\nJon Tower -- Citi -- Analyst\n\nThat's great. And curious, maybe going back to the commentary regarding fourth quarter margins and specifically getting into the food cost inflation. I don't think -- I think you offered it as a said 5% or so for the third quarter. But I'm curious to see or hear what you're seeing for the fourth quarter and if you're starting to be able to lock into 2023, if you have any insight into how that's forming at least the start of the year?\n\nTom Houdek -- Chief Financial Officer\n\nYeah. As we're going into the fourth quarter here, the two main factors is, one, just the overall commodity cost; and then two, the margin improvement initiatives and the benefits we'll see there. So we're still seeing -- even from Q2 into Q3, we still saw modest inflation. So there -- going into Q4, we're not modeling in any deflation.\n\nThere could be some help from the margin improvement initiative. But going -- as we look into next year, we are expecting more inflation. We're still early days with walking in our contracts that most are ones that we would set in January. So early to really determine what levels yet.\n\nBut yes, as we're looking into next year, anything that's kind of processed and labor driven, it could be going up. So it's early to tell, but we are expecting some inflation going into next year on more of the contracts that have been locked for the year. But otherwise, we're seeing some inflation at those levels. We're also seeing some good movements in the fresh meats and the grocery, the produce that have been -- are ones that we pay market rates for.\n\nGreg Levin -- President and Chief Executive Officer\n\nYeah. I think Jon, and this is Greg, just kind of adding on there. I still think we're going to see another -- I wouldn't say inflation going up, but I don't think we're going to see it coming down right away. I think as a lot of contracts are on annual basis, as we go into next year, that labor number, which is an input into everything is still going to result in a level of negotiations with our vendors from a contract standpoint.\n\nI still think you'll see the same thing come in January as well, just with State adjusting minimum wages, thankfully being in California, the California dollar step-up is done even though it's not tied to CPI, so there will be an increase there. But as a result, I think we're going to see still a little bit more inflation going into Q1 of next year. And then I think it will start to abate after that time frame after contracts get locked in and companies move forward. It also gets to Tom's point earlier, that we have not yet assessed what our pricing is going to be in January because we're going through it here in this kind of fourth quarter to understand where we're going to be from an inflationary standpoint and make sure that we take reasonable pricing to offset that.\n\nJon Tower -- Citi -- Analyst\n\nAwesome. I appreciate all the color on that. Just going back to the 200 basis points of margin improvement at the store level over time based on the initiatives that you've kind of dug into during the call, including the chicken wings, etc. Is that incremental to just underlying improvement that you expect in the business, meaning hitting that mid-teen store margin target that you discussed, is that including that 200 basis points? Or would that 200 basis points be additive?\n\nGreg Levin -- President and Chief Executive Officer\n\nI think it's a combination of both. Ultimately, we'd like to be above that, let's call it mid-teens. We want to continue to drive that. Some of that comes with sales.\n\nSo when you start to look at those numbers, it's always a function of the dependent variable of sales that play through to it. So it's additive in one sense, but at the same time, if sales don't continue to perform, it's going to be inclusive in it.\n\nJon Tower -- Citi -- Analyst\n\nOK. Got it. I will pass it along. Thanks for the time.\n\nGreg Levin -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd so we'll go to our next question from Nicole Miller with Piper Sandler.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. Can we just reconcile the price in 4Q? I had about 8% then and I wanted to see if that was right. And then if you don't, let's just say, you don't take price in January, knowing that it is under consideration.\n\nDoes it rachet down a couple of hundred basis points in February when you took price in this year?\n\nTom Houdek -- Chief Financial Officer\n\nHi, Nicole. So in Q4, you're, I'm sure, asking for the year-over-year change in price. We'll be carrying a kind of 6% area into Q4.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nOK. OK. Yeah, I said that wrong. I meant I was getting up to maybe almost 8% when we added the 200 basis points in August.\n\nThat's exactly what I meant. So thanks for reading my mind. But -- so 8% is a little too high. It's like the 6% range in 4Q, so something must be coming off in the prior year.\n\nTom Houdek -- Chief Financial Officer\n\nCorrect. We took 1.4% in November of last year, which will roll off.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nOK. So 6% as you get into 4Q? And then if you don't take price for 1Q of next year, you get down -- you'd be around 4%, something like that in February?\n\nGreg Levin -- President and Chief Executive Officer\n\nThis is about right. We're going to lose about 2%, 2.5% of pricing that would come off in kind of mid-January.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nOK. Perfect. So I just wanted to level-set that so we can get the comp right. And is there anything -- yes.\n\nTom Houdek -- Chief Financial Officer\n\nAnd just to make sure I have the right Q4 number, it's 6.5%. So that's the full number.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nThat's super helpful. And can you just talk a little bit about the contract then of mix and traffic in terms of the almost 9% comp in 3Q and traffic was quite a bit less than -- or excuse me, price was less than that. So how is mix and traffic playing out?\n\nTom Houdek -- Chief Financial Officer\n\nWe -- so it's a great question. We are still seeing more guests per check and more incidents, higher incidents in our checks. So people and guests are coming into our restaurants, they're spending more. So there's an element of better mix that we're seeing in our checks because our check is higher than just the pricing alone.\n\nSo we're getting an additional benefit from the increased mix to go along with the pricing.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nOK. And then just a final one, Greg, I also found your supplier commentary pretty fascinating. So is there anything in the underlying health of that business getting more back on track in terms of like stuff getting to you on time and there were substitutes and out of stocks, which I guess, to your point, made you kind of reinvent certain things like around the chicken wings that's interesting. Can you just talk about the delivery times and the product they're bringing and how that's trending.\n\nAnd again, just cover that mid-teens margin otherwise and then another 200 basis points, I mean that's pretty outstanding but yet you maybe would invest against that. Is that the way to think about that? I just want to get that conclusion right.\n\nGreg Levin -- President and Chief Executive Officer\n\nYeah. So let me handle a couple of those things. So on the distribution side, things are continually improving. They are not perfect by any means, but they are getting better.\n\nAnd the things that you hear about in the airline industry, to the hotel industry, to the restaurant industry, that being also seen in the distribution or trucking industry in regards to drivers or things coming out of processing plants and so forth. But it is getting better, and it's moving in the right direction for everybody. So I do think going into next year, we're going to see even more consistency there and not having to worry about substitutions and out-of-stock areas. So that's the first part.\n\nIt's not back to where we want to be, but it's getting better every day just like our restaurant staffing levels continue to get better. And then in regards to margins, the hard thing with discussing margins at times is people want to talk about margins outside or absent of sales levels. And this business leverages or deleverages a lot based on sales levels. So when we talk about the 200 basis points that we're going after, a lot of that is based on where we are today.\n\nBut I can tell you, if our sales stay exactly where they are today and don't grow next year, the 200 basis points won't necessarily show up in a positive way per se, on our P&L because we'll deleverage from other inflationary costs. So we need to grow top line sales. I think everybody in this industry sometimes just thinks about margins as such an independent variable versus being a dependent variable on sales. So when we talk about our capital allocation programs, we want to make sure we're investing in remodels because it drives top line sales.\n\nWe want to be investing in our menu. We want to invest in marketing and so forth to drive all that top line sales that moved margins naturally up on the fixed cost and then, again, leverage some of these other initiatives on top so that we can be above mid-teens. We will always -- I think you've set a really great point there. and that is we will always invest back into our restaurants or back into our guests for the long-term nature of our business or the long-term value that you get from the guests coming back.\n\nSo as we look at certain things, I will tell you on the call if you're familiar with our company, we could go a frozen salmon, we taste the frozen salmon in our test kitchen downstairs, and we could save money on frozen salmon versus fresh salmon. Our fresh salmon is so good. I would ask everybody to go to BJ's restaurant and get our salmon. The way we cook it, it's unbelievable.\n\nAnd you can tell the difference between frozen and fresh. We use fresh ground beef for our burgers. We can taste the difference between frozen and fresh. So we're always going to err on the side of quality to drive our business long term.\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nThank you for that. Appreciate it. Thanks guys.\n\nTom Houdek -- Chief Financial Officer\n\nAnd Nicole, just to -- I want to make sure we get the pricing levels out there. So for the quarters this year, just so everybody has them, we were up about 5% year over year in Q1 and then about 6% for Q2, Q3 and Q4. So about 6% is the -- where we've been for Q2, Q3 and Q4 as we've taken price and lapped price.\n\nOperator\n\nAnd we'll move to our next question from Drew North of Baird.\n\nDrew North -- Robert W. Baird and Company -- Analyst\n\nGreat. Thanks for taking the question. I wanted to circle back to recent top line trends. Your results suggest some nice acceleration in comps exiting Q3.\n\nSo wondering if you could share some perspective on what you think drove the strength in comps exiting the quarter? And then perhaps why you think the underlying growth versus pre-pandemic or 2019 settled a bit here in October when including the impacts of the hurricane? And then just are you willing to share what the quarter-to-date figure would be including the impact of the hurricane, just to level-set us there?\n\nGreg Levin -- President and Chief Executive Officer\n\nYeah. Hey Drew, I'll take the first part on this. We are looking at that as well, trying to look at the business and see the nice comp sales, and it's come down a little bit in Q3, so obviously very solid comp sales in the mid-single digits in the 6-plus percent range, as Tom talked about. And looking at the business and trying to understand the business a little bit, I think what we saw, and this is a little bit of the data and what we've seen in front of us is during the latter two months of the summer time frame, we started -- we saw larger parties.\n\nI think it's what you see in kind of the leisure and hospitality world where people wanted to take trips, they want to get on airplanes, they want to get to hotels and spend that kind of leisure and hospitality. And so our guests per check was higher in the summer months and -- versus where our guests per check is now. And it seems like that's probably a little bit of a difference in our business between where we ended Q3 and where we are today. And what we're seeing when we look at that is we're really seeing a return to kind of pre-COVID trends.\n\nAnd that is, as we get back into the October time frame, sales bottom out a little bit and we start to grow a little bit in the holiday time frame. And that tends to be what we've seen in our business. Now as Tom mentioned, when we look at incidents per check or incidents per guest, those are still high. We're still selling a lot of appetizers, back above 2019 level.\n\nWe're still selling more alcoholic beverages above 2019 levels. So that incident seems pretty much in line there. It's just the party size has actually gone down a little bit, going into kind of the end of Q3 and here into Q4. And then in regards to comps, I'll let Tom take it, but it's getting less and less every day.\n\nSo I think what we're trying to talk about this is kind of where we see a run rate, but Tom, anything you want to add to that?\n\nTom Houdek -- Chief Financial Officer\n\nYeah. The most impacted week was the first week. This is about the hurricane Ian question you had. Our first week of October was the most impacted, and it was about a 100 basis point impact to comp that week.\n\nSo we're three weeks in, so it would have weighed about, call it, 30 bps or so on this three-week window, rolling it out through the quarter, it won't be material, but I just wanted to kind of adjust for it for these early weeks as it's more material for just looking over three weeks.\n\nDrew North -- Robert W. Baird and Company -- Analyst\n\nThank you. That's helpful.\n\nTom Houdek -- Chief Financial Officer\n\nSure. Thanks, Drew.\n\nOperator\n\nAnd we'll go to our next question from Joshua Long with Stephens Inc.\n\nJoshua Long -- Stephens, Inc. -- Analyst\n\nGreat. Thanks for taking the question. Just wanted to circle back, you might have mentioned it, and if so, I missed it, but when you talked about trends through the quarter, from an average weekly sales basis, was that relatively steady? I think that's what we had talked about in 2Q, but just curious if there was any sort of upward/downward trajectory during the quarter from an average weekly sales basis?\n\nGreg Levin -- President and Chief Executive Officer\n\nJosh, not really. I think it all really played out much more seasonally like we'd expect. So when you're talking about average weekly sales, it's going to be higher in July and August than it was in September after Labor Day. And so we saw that historical seasonal trends come back into our business.\n\nAnd I think that's the way we're tending to look at even here in Q4 is the business now reminds us a lot of how 2019 weekly sales average trends played out. Because the difference is, obviously, we got the inflation and supplier challenges, etc., that we didn't have in '18 or '19. But from a top line sales perspective, very consistent, and I would even say off-premise trends tend to work the same way as well, meaning after Labor Day, off-premise sales came down, same percentage of sales but came down to kind of match up a little bit with the weekly sales -- the seasonality of sales trends.\n\nJoshua Long -- Stephens, Inc. -- Analyst\n\nGot it. That's helpful. Thank you. And then when thinking about some of the large investments you made in your human capital side earlier in the year with, I think, something around the nature of 6,000 hires.\n\nIt sounds like that's progressing well from getting those team members ramped up and you're relatively pleased with efficiency. Any sort of additional comments you can provide there? And then when we think about the need to add on or supplement some of those efforts with ongoing hiring and efforts at the store level. Can you put that in perspective? Is it -- are we in kind of a more normalized range now where those additions would be balanced against some of the seasonal trends we're seeing and just kind of the normal backfilling of the pipeline as it were?\n\nGreg Levin -- President and Chief Executive Officer\n\nYeah, that's a good way to frame it up, Josh. The improvements we saw over the quarter, I mean, it certainly was great to see everything from training and overtime start to get back to normalized levels, still not exactly back to 2019 pre-COVID levels, but much closer to it. So as we think of the new team members that we hired in Q2 that we talked about, the big ramp-up in our staffing, we're really starting to see the efficiencies now in really the third quarter we saw in the numbers, but into the fourth quarter here. So -- and I would say it's much more back to regular seasonal times.\n\nWe increased our sales going into Q4, and we typically staff up a bit more ahead of the holiday. So it's -- we definitely want to keep adding to our team member base so we can drive the most sales as possible in Q4, but it feels much more seasonal than anything still pandemic related.\n\nJoshua Long -- Stephens, Inc. -- Analyst\n\nGot it. That's helpful. And then last one for me. In terms of thinking about 4Q, am I correct in that there's going to be a 14 -- or an extra week, so 14 weeks in the 4Q period? And if that is correct, anything you'd point to or talk about in terms of leveraging that extra week, especially as we lap over what might have been kind of a partially impacted 4Q from Omicron last year?\n\nGreg Levin -- President and Chief Executive Officer\n\nYeah, you're correct. We do have a 53rd week here. And as we forecasted, it is looking back to last year, but also looking back to the trends of '19, which seasonally, we can see where we leverage the fixed cost. You get some leverage on the labor lines, you get some leverage on the -- more the fixed elements of the restaurant costs and corporate costs in that -- just from the seasonal benefit of sales, but then also some of those fixed costs as well into the 53rd week.\n\nSo as we guided on the restaurant level margins, that was inclusive of that benefit we'd expect.\n\nJoshua Long -- Stephens, Inc. -- Analyst\n\nGreat. Thank you.\n\nGreg Levin -- President and Chief Executive Officer\n\nThanks, Josh.\n\nOperator\n\nAnd now we'll go to a question from Todd Brooks with The Benchmark Company.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nHey, good afternoon. Just a couple of wrap-up questions here, if I could. On the 200 basis points of savings from your cost and efficiency work. If you -- if we look at a recovering sales environment, what's the window to harvest those savings? How long does it really take to extract those if the sales are improving?\n\nGreg Levin -- President and Chief Executive Officer\n\nYeah. It's probably through the first half of next year or so. Some of the things will come in faster. Some will take time to roll out.\n\nAnd Todd, we've talked in the past even about the wings. And we've been talking about the wings probably about 90 days, and we were just able to get them through supply chain here in October. So as we go through and test some other items that we have out there and things that we're looking at to get those lined up and supply chain and rolled out, take longer, then wow, this is great, it can be implemented by Wednesday of next week, meaning we can get it done in seven days. So I tend to look at that aspect of it.\n\nAt the same time, Tom has talked about the labor scheduling system and things that we put in place there, and we've seen some really nice improvement on labor. I think even to the other question that Josh asked the fact that we've gotten ourselves staff and team members have gotten their sea legs under them, that's improved our operational capability as well in the restaurants. But we still have some areas to go there as well that will continue to work through. So I think it's a gradual roll-in over the next two to three quarters, including Q4 here.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nPerfect. Thanks, Gret. That's helpful. Another quick one.\n\nThe six openings that are targeted for next year. Are there any, as of now anticipated closures against those? And do you have a kind of a quarterly opening cadence beyond the two that you're sliding into early Q1?\n\nGreg Levin -- President and Chief Executive Officer\n\nAs far as the opening cadence, I think we're looking at two in the first quarter. I don't know, look toward Greg Lynds and Tom here. In regards to closures, we've got a couple of leases that we're continuing to take a look at and we'll make decisions on them. Most of them are leases coming up at the end of the year, and we're just trying to figure out, do we stick with that or do we relocate them in another area.\n\nAs far as our legacy small footprint restaurants, I think there's a handful of those that as those come up, we will continue to evaluate those as well. But there is no initiative in place as of today that says, let's go and close 10 restaurants. It's mainly about the lease negotiations on a few restaurants here and there, but nothing too significant or too material.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. Great. And then just a final one for me. Greg, on the last call, you hinted at continued work around menu rationalization and going through and testing some changes there.\n\nI guess where does that process stand? And if you are making any changes to shrink the menu, when should we expect to see that?\n\nGreg Levin -- President and Chief Executive Officer\n\nGreat question, Todd. We do have in restaurants right now a smaller menu. I think we reduced somewhere in the neighborhood of about 20-plus menu items, some single source items, some kind of SKU rationalizations and so forth. We will let that test for somewhere in the neighborhood of three to six months and taking a look at that.\n\nAnd based on that work there, we would see -- if it's fruitful and where we want to go with it. We'd end up seeing a smaller menu somewhere toward the middle of next year. We generally roll out new menus in the January time frame because that's our menu pricing. We do have pricing somewhere in the May, June time frame.\n\nAnd then as we just did it this year, we do a new menu in the kind of September, October time frame. So right now, a smaller menu is not scheduled for the January time frame. We'll let the test through the holiday time frame. So if we ended up with a smaller menu, that would come in the June time frame.\n\nI will say this though, just in general, we need to bring down that menu so we can introduce new menu items that our culinary team is building in the pipeline. So more likely than not, come June time frame, we will see a smaller menu. But at the same time, it might not be a -- it might not be 20, it might be a net 15 because we might end up introducing five new items at that time.\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nOK. Great. Very helpful. Thanks, Greg.\n\nGreg Levin -- President and Chief Executive Officer\n\nMy pleasure.\n\nOperator\n\nAnd our last question comes from Brian Mullan of Deutsche Bank.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nGreat. Thank you. Just a question on the late night business. Wondering what level of sales have you recaptured versus 2019 as of the third quarter? I'm just curious if you decided -- if all those operating hours are back? Or if maybe you made a decision that some of them might not come all the way back based on any analysis, I know in the past you were looking at.\n\nGreg Lynds -- Chief Development Officer\n\nSure. So the afternoon daypart has been the one that's outperformed all others throughout this pandemic time. And in Q3, late night was a very, very close second. And that's without increasing any hour.\n\nSo we're still -- we're about a half an hour per restaurant on average less per day. So it is the late-night daypart that we just haven't increased hours in a lot of our restaurants. And some of that is making sure we're doing the right thing for our team members and our managers and balancing it from the sales we'd expect, but even without that extra, call it, half an hour, the positive comp sales on a three-year basis -- in some weeks, it's higher than afternoon. Sometimes it's right below.\n\nBut our late night daypart is very well performing.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nOK, thanks. So just to clarify, is the late night average weekly sales back to where they were in 2019 in some total? Or is there still --\n\nTom Houdek -- Chief Financial Officer\n\nYes, above.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nGot it. OK. And then just a --\n\nTom Houdek -- Chief Financial Officer\n\nGo ahead.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nNo. Go ahead. I'm sorry.\n\nTom Houdek -- Chief Financial Officer\n\nNo. I just wanted to make sure that was better clear that, yeah, on a comp basis versus '19, yeah, we're well above 2019 levels currently on a dollar basis.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nGot it. And then just a follow-up, a similar question, but just the lunch business. I know you referred to the afternoon daypart, I don't know if that's separate, but could you just speak to the lunch business for 2019? Is that all the way back? And if not, are there some initiatives that you can proactively look at to drive that business specifically next year and beyond?\n\nTom Houdek -- Chief Financial Officer\n\nYeah. It's back to 2019 levels. We're happy about there. We did come out with a $10, $11 lunch menu.\n\nSo we've got some great value in there. So we're getting the traffic back. But it's -- part of it is the -- as dayparts go in the middle of the week, if people aren't back in the offices, they're not fully using casual dining for this lunch business. So it is back to 2019 levels.\n\nBut in terms of growth, I think as you see the -- more people come back to offices, that only gives more tailwind to that lunch business.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nThank you.\n\nTom Houdek -- Chief Financial Officer\n\nThanks, Brian.\n\nOperator\n\n[Operator signoff]\n\nGreg Levin -- President and Chief Executive Officer\n\nThank you, everyone.\n\nTom Houdek -- Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nGreg Levin -- President and Chief Executive Officer\n\nRana Schirmer -- Director of Securities and Exchange Commission Reporting\n\nTom Houdek -- Chief Financial Officer\n\nAlex Slagle -- Jefferies -- Analyst\n\nGreg Lynds -- Chief Development Officer\n\nJon Tower -- Citi -- Analyst\n\nNicole Miller Regan -- Piper Sandler -- Analyst\n\nDrew North -- Robert W. Baird and Company -- Analyst\n\nJoshua Long -- Stephens, Inc. -- Analyst\n\nTodd Brooks -- The Benchmark Company -- Analyst\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nMore BJRI analysis\n\nAll earnings call transcripts"
}