{
  "companyName": "Montrose Environmental Group, Inc.",
  "companyTicker": "MEG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/montrose-environmental-group-inc-meg-q2-2022-earni/",
  "content": "Montrose Environmental Group, Inc. (MEG 2.68%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, greetings, and welcome to the Montrose Environmental Group, Inc. second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. I will now turn the conference over to your host, Mr.\n\nRodny Nacier, investor relations. Please go ahead, sir.\n\nRodney Nacier -- Investor Relations\n\nThank you. Welcome to our second quarter 2022 earnings call. Joining me on the call are Vijay Manthripragada, our president and chief executive officer; and Allan Dicks, chief financial officer. During our discussion today, we will be referring to our earnings presentation, which is available on the investors section of our website.\n\nOur earnings release is also available on the website. Moving to Slide 2. I would like to remind everyone that today's call will include forward-looking statements that are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Actual results may differ in a material way due to known and unknown risks and uncertainties that should be considered in evaluating our operating performance and financial outlook.\n\nWe refer you to our recent SEC filings, including our annual report on Form 10-K for the fiscal year ended December 31, 2021, which identify the principal risks and uncertainties that could affect any forward-looking statements as well as future performance. We assume no obligation to update any forward-looking statements. In addition, we will be discussing or providing certain non-GAAP financial measures today, including consolidated adjusted EBITDA, adjusted net income and adjusted net income per share. We provide these non-GAAP results for informational purposes, and they should not be considered in isolation from the most directly comparable GAAP measures.\n\nPlease see the appendix to the earnings presentation or our earnings release for a discussion of why we believe these non-GAAP measures are useful to investors, certain limitations of using these measures and the reconciliation thereof to their most directly comparable GAAP measure. With that, I would now like to turn the call over to Vijay, beginning on Slide 4.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nThank you, Rodney, and welcome to all of you joining us today. I will provide a few business highlights then hand it over to Allan Dicks for our financial review. We will then open it up to Q&A. I will speak generally the Pages 4 through 8 of the presentation shared on our website.\n\nRegarding the second quarter of 2022, I am proud of the stellar execution of all of our team members who have helped us produce another solid quarter. We successfully navigated the turbulent macroeconomic environment, and we successfully responded to a cyberattack in June that temporarily disrupted our operations for a few weeks. Despite these challenges, we produced a strong broad-based revenue growth and more than offset the previously communicated and expected normalization of CTEH-COVID-19 related revenues. In addition to record second quarter revenue and continued organic revenue growth outperformance excluding CTEH, our solid year-to-date operating cash flow, excluding contingent payments, was a stellar $16.6 million, which allows us to continue investing in our business.\n\nThe Montrose team's dedication to providing excellent service to our clients continues to drive our success and define Montrose as one of the leading environmental solutions providers. To our team members joining us for the call, thank you. It is important to reiterate that demand for our environmental services does not follow fiscal quarter patterns and is best evaluated on an annual basis. In the context of our continued business performance, there are several key themes I would like to highlight from the second quarter.\n\nFirst, there was outperformance in organic revenue growth in most of our service lines. Our PFAS water solutions and our negative carbon intensity energy or biogas teams were a big contributor to this organic growth surged through the first half of the year. Second, the deceleration in CTEH's COVID-related work continued, as we have discussed over the past few quarters and is trending as expected. As you can see in our results, the decline in CTEH is more than offset by growth in the rest of our business.\n\nThird, with costs. We have seen certain variable costs such as travel expenses accelerate faster than anticipated, but we remain confident in our ability to respond with efficiencies and pricing adjustments to produce attractive margins. Our 2022 and long-term margin expectations have not changed. Fourth, our cash flow continues to improve and remains very strong.\n\nThe strength of our cash flow, as I mentioned earlier, gives us financial flexibility and the ability to continue investing in environmental remediation. Fifth, we continue to execute on our plan to consolidate parts of our highly fragmented environmental industry. Our acquisitions are often immediately accretive and add great talent and service capabilities to our team. Consistent with that track record, we are pleased to welcome the TriAD team to Montrose as of last week.\n\nTriAD our leading environmental consultants based out of Nashville, Tennessee. In addition to providing Montrose's with specific clients, industry access and geographic expansion, the TriAD team brings a great culture and history to Montrose. Complementary acquisitions such as TriAD remain an important growth lever that underpin our long-term growth and value creation strategy. Finally, as you saw last night in our press release, based on feedback from various stakeholders, including the SEC, we have removed the added back of start-up investments from the definition of consolidated adjusted EBITDA.\n\nThis is nothing more than a methodology change. Given the success we are having with R&D and technology development, for example, we expect these start-up investments to be less onetime in nature than they have been in the past. This new methodology doesn't change our total guidance for the year, it doesn't change our cash flows or any fundamental economics. This new methodology also doesn't alter our long-term outlook on revenue or margins as previously communicated.\n\nWe are reiterating our outlook for the year, given business momentum, and Allan will address this further in his section. Next, let me take a few minutes to walk through some recent developments and some of the catalysts that we see for our business moving forward. As it relates to regulatory and industry opportunities, first, we continue to see tailwinds from the private sector focused on better environmental stewardship and opportunities created by regulatory activity. We have been able to capitalize on broad demand for PFAS remediation, greenhouse gas measurement and mitigation and renewable energy in particular.\n\nSecond, we have recently been awarded large U.S. government projects, reflecting the growing importance of our environmental solutions across both the private and public sector. On regulatory changes as it relates to methane emissions, the Inflation Reduction Act passed in the U.S. Senate over the weekend is expected to impose a first-time fee on excess emission of methane from select facilities.\n\nOf note, this legislation also includes hundreds of millions of dollars in incentives for the oil and gas industry to monitor and clean up methane leaks to avoid future fees. Improved leak detection, repair and enhanced methane emissions quantification and verification have been key areas of focus for Montrose for years. As the regulatory environment evolves in our favor, for example, with a focus on improving equipment and processes to reduce emissions, supporting innovation and permanently closing wells on nonfederal lands in particular, we expect our software capabilities, our methane testing and measurement advisory, greenhouse gas detection and mitigation services and our program management capabilities to see increased tailwinds. The bill also aims to invest over $60 billion to support communities that are disproportionately impacted by the negative environmental and public health effects of climate change.\n\nWe see additional direct overlap with Montrose capabilities. For example, the increase in demand for projects like our fence line and real-time ambient air monitoring for Suncor Energy in Commerce City and North Denver, Colorado, where the community, industry and regulators are working together to reduce emissions impacts. The bill is new and needs to be fleshed out, so we will continue to update you as we learn more. But in aggregate, we are really encouraged by what it represents for Montrose.\n\nAnd as it relates to PFAS, in April, the EPA announced three clean water actions as part of its PFAS strategic road map. First, a proposal for the Clean Water Act aquatic life criteria for PFAS to permit authorities to reduce discharges of PFAS at the source and measure for absorbable organic fluorine and water samples. This increases demand for our lab and remediation services. In May, the EPA issued five regional screening levels for PFAS, which determine whether response remediation activities are needed for cleanups.\n\nWhile these screenings are not enforceable standards, they do service guidance for states. Companies rely on Montrose interpret these guidelines and help them develop remediation plans that will meet federal, state and local requirements. And in June, the EPA released four drinking water health advisories for PFAS. In conjunction with this announcement, the EPA has also invited states and territories to apply for $1 billion in bipartisan infrastructure low grant funding to address PFAS and other emerging contaminants in drinking water, specifically in smaller and disadvantaged communities.\n\nThe needs of our clients due to these announcements are very complementary to our existing service offerings. We expect that demand for our capabilities will continue to gain momentum in both the public and private sector. It is for all these reasons that we believe, as we have for a while, that Montrose is exceptionally well positioned to help our clients navigate the rapidly evolving regulatory landscape as environmental remediation and protection become more and more central to corporate and government policies. I would next like to discuss our second quarter business performance by segment.\n\nWithin our Assessment permitting and response segment, despite the deceleration of CTEH revenues, most of the revenue in this segment continues to be driven by CTEH, which remains at elevated levels relative to their normalized run rate. The CTEH team continues to do an exceptional job for our clients with business continuity services. Excluding CTEH, we are pleased to see positive contributions from our acquisitions over the past 12 months, which were mostly added to this segment. Our acquisitions supporting West Coast Utilities managing fire risk, for example, are performing well, along with attractive growth in select areas such as our greenhouse gas advisory services.\n\nThe shift in mix is the primary reason for our increase in margins relative to last year. Within our measurement and analysis segment, demand for our services remains very strong and drove solid organic growth during the second quarter. Given the regulatory momentum around greenhouse gas emissions and PFAS, as I just discussed, we remain optimistic about the future growth in this segment. Margins in this segment were impacted by mix and the temporary impact of the cybersecurity attack in June, which primarily impacted our Enthalpy lab network.\n\nWe expect to recoup the impact of the disruption over the subsequent quarters. Putting quarterly variances aside as fiscal quarters aren't the best way to assess our business, we continue to have conviction that margins will remain at industry-leading high teens to 20% annually as previously discussed. Within our remediation and reuse segment, our organic growth outperformance in the second quarter was once again driven by demand for our PFAS water treatment and renewable energy services. As noted on prior calls, margins remain below what we consider and expect as normalized levels given our ongoing investments.\n\nWe are investing in our teams, our geographic footprint and our technology to harness the increased client demand and regulatorily evolving landscape in this space. In summary, I am incredibly grateful to the entire Montrose team for all they do for our business, each other and our clients. It was through their hard work and execution that we were able to overcome the challenges we faced and continue delivering for our clients and our communities. Our second quarter results reflect the continued momentum in our business.\n\nAnd as a result, we are reiterating full year guidance. I remain incredibly excited about our future. At Montrose, we look forward to helping solve our collective environmental challenges and to creating value for our shareholders. We also look forward to sharing more with you in the upcoming quarters and are grateful for all of your continued support.\n\nWith that, let me hand it over to Allan. Thank you.\n\nAllan Dicks -- Chief Financial Officer\n\nThank you, Vijay. We are pleased to have delivered solid second quarter results, which reflect the resiliency of our business and the in-demand nature of our environmental solutions. Since our IPO two years ago, the need for environmental remediation and monitoring, particularly for PFAS, has gained significant momentum across the globe. We believe that our core business remains strong and continues to grow, benefiting from our expanding relationships with notable customers, continued success with our cross-selling initiatives and successful execution of accretive M&A.\n\nMoving to our revenue performance on Slide 9. We continue to drive strong organic growth in our business. Our second quarter revenues increased 2.7% to $139.9 million compared to the prior-year quarter. Year to date, revenues were up 1.7% versus the prior-year period to $274.6 million.\n\nThe primary driver of revenue growth in both periods was organic growth in our measurement and analysis and remediation and reuse segments as well as the positive contributions from acquisitions. This was partially offset by significantly lower COVID-19-related services provided by CTEH and our planned exit from legacy O&M contracts. Looking at our consolidated adjusted EBITDA performance on Slide 10. As Vijay mentioned, we are no longer adding back start-up losses to consolidated adjusted EBITDA.\n\nThe significant opportunities ahead to grow our business through innovation, we'll make start-up initiatives, a more recurring expense in our business. So we believe this change to our methodology is appropriate. With that said, second quarter consolidated adjusted EBITDA was $15.6 million or 11.2% of revenue, inclusive of $0.9 million of start-up losses in the second quarter of 2022. This compares to consolidated adjusted EBITDA of $19.8 million or 14.6% of revenue, inclusive of $1.1 million of start-up losses in the prior-year quarter.\n\nYear to date, consolidated adjusted EBITDA was $31.3 million or 11.4% of revenue, inclusive of $1.7 million of start-up losses in the first six months of 2022. This compares to consolidated adjusted EBITDA of $35.7 million or 13.2% of revenue, inclusive of $2.1 million of start-up losses in the prior-year period. The year-over-year change in consolidated adjusted EBITDA dollars and as a percentage of revenue for both periods was driven by business mix, the cyberattack in June 2022 and higher variable costs impacting travel, field and lab supplies and other direct costs. Year to date in 2022, we have seen great traction with our pricing initiatives.\n\nHowever, the magnitude and duration of the increase in variable costs has been more severe than we initially anticipated. In addition, the labor shortages we are experiencing in certain of our businesses has increased the need to move our workforce to different geographies with more frequency than usual to meet our high demand. That said, the traction we've seen so far with our recent price initiatives, we remain confident in our ability to offset costs through pricing in the coming quarters. I'll reemphasize that Montrose performance needs to be assessed annually.\n\nThis is consistent with how we evaluate the business due to the stronger predictability of our performance on an annual basis. This is consistent with how we hire staff, allocate resources and manage the company. Turning to our business segments on Slide 11. In our assessment, permitting and response segment, revenue and operating segment adjusted EBITDA decreased to $50 million and $10.8 million, respectively.\n\nThe year-over-year decreases in both revenue and adjusted EBITDA in this segment were driven by lower revenue from COVID-19-related services provided by CTEH, partially offset by revenue from companies acquired subsequent to the second quarter of 2021. The normalization of our CTEH revenues was expected given the waning of COVID-19-related demand for testing and prevention services in the U.S. as pandemic restrictions lifted. Operating segment adjusted EBITDA as a percentage of revenue was 21.6%, slightly higher than the prior-year quarter despite the decrease in lower-margin COVID revenues, primarily due to the acquisitions of Environmental Intelligence, Horizon and Environmental Standards, which typically operate at lower margins than our other businesses in this segment.\n\nIn our measurement and analysis segment, revenue increased 7.9% to $42.2 million, primarily attributable to organic growth as well as the acquisitions of Vista and ECI. Measurement and analysis adjusted EBITDA as a percentage of revenue decreased to 16.7% as a result of unfavorable business mix, variable cost increases in excess of pricing taken earlier in the year, the timing of projects in some of our specialty labs and the impact of the cyberattack, which temporarily disrupted some of our labs ability to operate. And finally, in our Remediation and Reuse segment, revenues increased 18.5% year over year to $47.6 million, reflecting a significant increase in demand for PFAS water treatment services and organic growth in our biogas business. The decrease in remediation and reuse adjusted EBITDA as a percent of revenue to 14.8% was the result of lower margins in our PFAS water treatment business as a result of project timing, lower soil remediation margins where we have experienced significant increases in direct labor, travel and subcontractor costs in excess of responsive pricing increases implemented earlier in the year, the impact of the discontinued O&M contracts and our continued investments in the operating infrastructure in our biogas and water treatment technology businesses, which temporarily impact margins.\n\nMoving to our capital structure on Slide 12. Year to date, cash flow used in operating activities was $2.9 million, which improved compared to cash used in operating activities of $17 million in the prior-year period. Cash used in operations includes the payment of acquisition-related contingent consideration of $19.5 million in the current year and $15.5 million in the prior year, respectively, primarily related to the payment of CTEH earnouts. Excluding acquisition-related payments, cash from operating activities was $16.6 million in the first six months of 2022 compared to cash used in operating activities of $1.5 million in the first six months of 2021, an increase of $18.1 million.\n\nThis increase was driven primarily by lower increase in working capital in the current year period of $10.2 million compared to an increase in working capital in the prior-year period of $30.9 million. These strong cash flows reflect our ongoing focus on balancing the generation of cash with investments in technology, R&D and corporate infrastructure to ensure continued scalability. Our leverage ratio as of June 30, 2022, which includes the impact of acquisition-related contingent earnout obligations payable in cash was at 1.1 times down from 3.1 times at the end of the prior-year quarter. Our Series A-2 preferred stock has no maturity date, and we have the option, but not the obligation to redeem the preferred shares at any time for cash, subject to a make-whole payment if prepaid prior to April 2023.\n\nWe view this preferred equity instrument as favorable to the value creation potential in the business, given its flexible dynamics. If you include the $182 million balance of the Series A-2 equity in our market cap, our total equity capitalization stands at approximately $1.4 billion. Looking at a review of our base business trajectory on Slide 14. As we've discussed over the past few quarters, we anticipate an annual revenue run rate of $75 million to $95 million for our CTEH business.\n\nAlthough CTEH revenue continues to normalize, CTEH revenues remained elevated compared to our expected revenue run rate for this business. Therefore, we maintain our view that the revenue bump from COVID services is not expected to reoccur at the same level in the coming years as the impact of COVID-19-related demand continues to wane. When excluding the above trend revenue from CTEH, the remainder of our revenue is what we refer to as our base business, which includes the normalized revenues we would expect to see from CTEH in addition to all of our other business lines. Our base business continues to grow at a solid trajectory, reflecting the organic tailwinds we've discussed on this call.\n\nMoving to our full year outlook on Slide 15. Based on our resilient performance in the first half of 2022, we reiterate our outlook for the full year 2022 revenue to be in the range of $520 million to $570 million. Our outlook for consolidated adjusted EBITDA under the revised methodology is expected to be in the range of $68 million to $73 million for the full year 2022, inclusive of $5 million of start-up losses. In conclusion, overall demand for our services remains resilient and our reaffirmed outlook for 2022 reflects our confidence in our ability to deliver shareholder value through our differentiated approach to provide best-in-class environmental solutions.\n\nVijay and I would like to both thank our tremendous team members again for their hard work in helping Montrose's produce another quarter of solid results. Thank you all for joining us today and for your continued interest in Montrose. We look forward to updating you on our progress next quarter. Operator, we are ready to open the lines to questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Tim Mulrooney from William Blair. Please go ahead.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nHey. Vijay, Allan, good morning.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nHey, Tim. How are you?\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nDoing well. Thank you. So sorry, I joined a little late, so I apologize if you already discussed this, Vijay, but I was hoping you could just briefly comment on how the IRA might impact your OGI business. It sounds like the proposed legislation includes a hefty penalty for excess methane emissions.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nYeah, Tim we did -- we talked about it briefly. But let me shed a little bit more light. We think it's actually quite beneficial, Tim, and it's beyond just our OGI business. As we think about the support for better measurement for the replacement of equipment for the quantification of what's coming out because there's going to be penalties.\n\nIt looks like above a 25,000 metric ton threshold. We anticipate the significant opportunities for our advisory business for our leak detection and repair business. OGI is part of that, Tim. As you know, it's kind of a next-generation mechanism to measure and quantify.\n\nAnd then there's also some program management work that we think we can benefit from because there's verbiage in there to support the closure of old wells that are on nonfederal land. So as we kind of look across the overall assessment permitting, measurement analysis and remediation reuse service lines for us, Tim, we think all three are likely to see tailwinds as a result of the act.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nAll right. That's really helpful. Thanks, Vijay. One more for me, pivoting to margins, specifically, your R&R business, EBITDA margins there, if I'm reading the slides correctly, it looks like they were down about 150 basis points year over year.\n\nAnd Allan, I heard you give quite a few reasons for why that is, including lower margins in your PFAS treatment business. As PFAS continues to grow as a percentage of the mix, how do you expect that to impact the overall profitability of that segment over the next couple of years?\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nTim, why don't I take a macro look at it. And then Allan, if you want to address the specific question. Tim, the main theme is this is why the quarters are really choppy. A lot of it has to do with how these projects starts and ends ebb and flow and how some of these time lines shift.\n\nSo as we kind of look at a 2021 versus a 2022 outlook, you'll see us put forth some really attractive margin accretion in that macro segment over the course of this year. Quarter in, quarter out, there's going to be a little bit of noise. That's just a function of how these projects have been slowed. So I just want you to keep that in mind when you're comparing specific quarters, it may look like there's a trend that's going to be extrapolated over the course of the year.\n\nI really don't think that's the case here. But why don't I let Allan expand on that further.\n\nAllan Dicks -- Chief Financial Officer\n\nYes. Yes, you're exactly right. These large projects that span several quarters, Tim, don't have a -- don't necessarily have a consistent margin. It depends on the underlying deliverables is pretty complex revenue recognition associated with them.\n\nSo over the course of the full project, we are generating very healthy margins and continue to believe that particular business, and that segment will deliver low 20% margins at scale, but be just like quarter-to-quarter project timing and the nature of the project deliveries in that quarter can have an impact on margins. That segment also includes our soil remediation business. Those projects can also typically span a couple of quarters. And there, we've seen some headwind from variable costs for the pricing that we have been able to take earlier in the year, has somewhat been eroded by the rapid increase in travel and the tight labor market, which is also forcing more travel on us.\n\nAnd because of the nature and the length of those projects, it takes a couple of quarters to rereact to those cost increases. So you'll see us start to offset those higher costs in the next quarter or two.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nOK. So it sounds like 14.8% is not the steady state or go-forward expectation. It's just timing lumpiness.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nIt's not.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nIt's something you guys have given in the past.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nYeah. If you look at the first half of the year, Tim, as a contrast to that, margins are up 300 basis points, right? So it's kind of we struggle with this because we try to say it every time. You've got to look at the year. You can't look at any individual quarter because there's a lot of noise in the way the numbers flow out.\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nYeah. Probably a few more times I might eventually get it. Thank you, Vijay. Thanks, Allan.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nThanks, Tim.\n\nOperator\n\nThank you. Our next question comes from the line of Andrew Obin from Bank of America. Please go ahead.\n\nUnknown speaker\n\nHey. Good morning. You have Sabrian Abrahams on for Andrew Obin. \n\nVijay Manthripragada -- President and Chief Executive Officer\n\nHey, Sabrina. How are you? \n\nUnknown speaker\n\nGood. So back on the EBITDA margins, can you talk about sort of the initiatives you're taking to sort of mitigate the higher variable costs and labor shortages? And sort of I understand like you talked about how it's -- how EBITDA is lumpy and kind of has to do with the full project and what is booked when. But can you talk more about how you're thinking about the margin ramp in the second half?\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nYeah. Yes, why don't I take a swing at that Sabrina. And Allan, please jump in. I think in Q2, Sabrina, there's a couple of themes to keep in mind.\n\nOne is that the cyberattack that we faced in June impacted our quarter Q2, primarily June, the most. There's a little bit of spillover into July, and it primarily impacted our Enthalpy lab network. And so we expect and certainly anticipate that we're going to recoup that over the course of the next couple of quarters, but there's some noise in the system. It's about $1 million of impact in Q2.\n\nSo that's one variable to keep in mind as you kind of look at the macro trend profile quarter on quarter. And then from a pricing perspective, there's two dynamics at play. We, as you know, have thousands of pump thousands of projects that are short term in nature. For those projects, we're able to react very quickly on pricing.\n\nIt's the longer-term multi-quarter projects that primarily are more remediation, water treatment biogas oriented, where it takes us a little bit more time to respond. We have a lot of conviction that we can respond in pricing and customers have been very receptive to it. They are facing the same environment we're facing. And the team, candidly, at the beginning of the year did a really nice job taking up prices.\n\nWe talked about how our labor costs have gone up and our prices have commensurately gone up to offset those, which is why our margin expectations remain unchanged. We were a little bit caught off guard with the escalation of costs like travel, and so we're just responding to those, and we'll get those right sized over the next couple of quarters. Does that make sense?\n\nUnknown speaker\n\nYes, thank you. That makes perfect sense. And just a follow-up. Thinking about geographic expansion, can you talk a little bit about what your priorities here are and whether the potential for macro slit out in Europe impacts your near-term priorities?\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nYes. In terms of geographic expansion, it's primarily North America. So we are continuing to, as you saw with the TriAD acquisition, adding select capabilities in attractive geographies, where we're effectively building scale and an ability to execute across the broader landscape, both here in the U.S. and in Canada.\n\nOur European efforts, Sabrina, are a function of our technology and our intellectual property getting pulled across the Atlantic. And so there, because we have unique ways to remove PFAS from water, which are really compelling and are increasingly proving out, that's why we're there. We're going to be very careful with how we expand there, but we're really bullish on the long-term opportunity with what we see and whether that's in the form of partnerships or our execution on the ground, that is still to be determined. But that's not something we set out to do.\n\nIt's something that we were opportunistic with if that makes sense.\n\nUnknown speaker\n\nThank you. I'll pass it along.Enthalpy Thanks, Sabrina.\n\nOperator\n\n[Operator instructions] Our next question is from the line of Jim Ricchiuti from Needham Company. Please go ahead.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nThank you. Good morning.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nHey, Jim.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nHow are you, Vijay? Looking at the growth in the remediation and reuse segment, and I'm wondering if there's any way you could help us understand the contribution that you're seeing to that growth rate from PFAS and biogas. Is there a way to give us a little bit more color on the extent to which they're driving the growth in that area?\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nYes, Jim. Let me -- I was chuckling at the way they pronounce your last name, by the way. It's how I usually get called.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nIt's always an adventure.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nTrust me. I was like in third grade by the time I figured out how to say my name. It's most of it, Jim. So if you kind of look at the year, the quarter-on-quarter numbers that we posted, almost all of it is a function of the success we're having on the water and the biogas side.\n\nJust to put a little bit more, again, if you look at the quarterly organic or even the first half year organic, it's incredibly strong. And this goes back to my narrative around, please don't look at this just on a quarterly basis, look over the course of the year. We certainly do anticipate that organic growth this year will be well in excess of 20% year on year. And that is being driven primarily by our water and our biogas practices and then to a lesser extent, some of the benefits we're seeing on the greenhouse gas side.\n\nThis is all information we've provided kind of in the public context Jim, so I'll just repeat it to help put some more framework around this. As we look at PFAS, it sits across all three segments. It's across our advisory, our testing and our remediation practices. And it represented less than 10% of Montrose's revenue last year, obviously, growing materially from 2020.\n\nThis year, we think it starts to approach 20%. So that gives you a sense of order of magnitude for how much of an influence it's having.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nSo if we think about the contribution first half or even in Q2, the PFAS was a bigger contributor to that growth rate, although you're seeing pretty good growth. It sounds like from a biogas practice as well.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nYes. In order of impact, it's the PFAS water treatment than biogas then the greenhouse gas work.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nGot it. And Vijay, you alluded to some larger U.S. government projects. And I wonder if you could talk a little bit more about that because we normally think of Montrose's business as very much commercial focused, the bulk of the revenue is coming from there.\n\nAnd so, is there anything that's changed and that's potentially going to add some incremental growth that's coming from that area?\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nYes. It has, Jim, and it's certainly in our favor. It's the U.S. Department of Defense, just to be a little bit more explicit about what that is.\n\nIf you go back to where our technology tends to have relative advantages, both cost and efficacy, Jim, we've talked about this before, it's why industry leans in our favor. It's when you have more complex water and you have more contamination. So there's concerns around -- as you know, it's a family of molecules, the short chain and the long chain, a fair degree of uncertainty around how to remove it, let alone how to measure it. The DoD because of the drills they run, right, the Air Force, for example, on Army and Air Force and other bases, Navy bases, often has similar highly complex issues with contamination within the groundwater, surface water or even some instances, potable water.\n\nAnd so as a result, we're seeing our technology increasingly get adopted by government agencies for the same reasons we see our technology getting adopted by the private sector. It's actually very similar, Jim, to what happened in Australia and in Northern Europe where you had a really tough water treatment situation, the government pulled us in and the private sector noticed and adopted it, which is a little different here at home where it really was started with the private sector and then now seems to be adopted by the government. Does that make sense?\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nIt does. Yes.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nSo we're not -- again, we're going to stay -- I mean, sort of a real opportunistic set of circumstances. We don't really play as much in the municipal space. But certainly, where you have complex problems for the U.S. Department of Defense, our technology as expected is resonating, and we're starting to see some nice multiyear awards -- potential multiyear works come our way.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nAnd last question, just relates to some of the cost pressures and pricing actions, which appear that you're going to see more of a benefit of the pricing over the next couple of quarters. But I'm kind of curious just in terms of outright labor shortages, where are you seeing it in your business lines more acutely? And how much of a concern is that?\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nWe're seeing it primarily in our hourly and entry-level staff in what we would consider our measurement and analysis segment services, Jim. So a lot of our field teams that go on site to collect samples, conduct tests or entry-level biologists and chemists, the -- so it is a concern. That's where we're seeing it primarily. We are obviously focused, first and foremost, on making sure we serve our clients.\n\nAnd with that, our team is doing really well. But offsetting select departures or material increases in costs, either with pricing or efficiency is kind of where our next focus is. So it's something we're acutely aware of. It's candidly something we anticipated.\n\nAnd so on the labor side, our team has done a really nice job responding to that. What we didn't anticipate is the magnitude of the increase in nonlabor-related costs, like travel. And those are direct costs that we face as these projects roll out, which is why we have conviction that we can get those incorporated into our broader pricing scheme over the next couple of quarters.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of the question-and-answer session. I would now like to turn the conference over to Mr. Vijay Manthripragada for closing comments.\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nThank you, all again for the time. If there's any further questions, we're happy to address them one on one. We really appreciate all of your support. Wish you all the best, and take care, and we'll talk to you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRodney Nacier -- Investor Relations\n\nVijay Manthripragada -- President and Chief Executive Officer\n\nAllan Dicks -- Chief Financial Officer\n\nTim Mulrooney -- William Blair and Company -- Analyst\n\nUnknown speaker\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nMore MEG analysis\n\nAll earnings call transcripts"
}