{
  "companyName": "Tencent Holdings",
  "companyTicker": "TCEHY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/18/tencent-holdings-tcehy-q2-2022-earnings-call-trans/",
  "content": "Tencent Holdings (TCEHY -2.15%)\nQ2 2022 Earnings Call\nAug 17, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and good evening. Thank you for standing by. Welcome to Tencent Holdings Limited's 2022 second quarter result announcement webinar. [Inaudible] At this time, all participants are in listen-only mode.\n\nAfter management's presentation, there will be a question-and-answer session. [Operator instructions] Before we begin, we would like to remind you that it contains forward-looking statements that are subject to a number of risks and uncertainties and may not be realized in the future for a variety of reasons. Information about general market conditions is coming from a variety of sources outside of Tencent. This presentation also contains some unaudited non-IFRS financial measures that should be considered in addition to, but not as a substitute for, measures of the company's financial performance prepared in accordance with IFRS.\n\nFor our detailed discussion of the risk factors of non-IFRS measures, please refer to our disclosure documents on the IR section of our website. Now, let me introduce the management team on the webinar tonight. Our chairman and CEO, Pony Ma, will speak off with a short overview; president Martin Lau will discuss strategy review; chief strategy officer James Mitchell will provide a business review, chief financial officer John Lo will conclude with a financial discussion before we open the floor for questions. I will now pass it to Pony.\n\nPony Ma -- Chairman and Chief Executive Officer\n\nThank you, Wendy. Good evening. Thanks to everyone for joining us. During the second quarter, we actively exited non-core businesses, tightened our marketing spending, and trimmed operating expenses.\n\nThese enable us to sequentially increase our earnings, despite difficult revenue conditions. Total revenue was RMB134 billion, down 3% year-on-year and 1% quarter-on-quarter. Gross profit was RMB58 billion, down 8% year-on-year but up 1% quarter-on-quarter. Non-IFRS operating profit was RMB37 billion, down 14% year-on-year but up 0.4% quarter-on-quarter.\n\nNon-IFRS net profit attributable to equity holders was RMB28 billion, down 17% year-on-year but up 10% quarter-on-quarter. For our key services, we generally became our first place positions in activities including social games, long-form video, views, music, etc. payment, and mobile browser. The combined MAU of Weixin and WeChat was 1.3 million.\n\nMobile devices, MAU of QQ was 569 million. Before I hand over to Martin, I would like to welcome Professor Zhang Xiulan as a new director and member of the Corporate Governance Committee. Broaden our board's independence, gender diversity, and areas of expertise. With that, I hand it over to Martin for strategic review.\n\nMartin Lau -- President\n\nThank you, Pony, and good evening and good morning to everybody. The internet industry in China has really faced significant changes and challenges since early 2021. And as a result, our revenue conditions have become difficult, and financial performance was under pressure over the last few quarters. We announced our results for the fourth quarter of 2021.\n\nIn March, we laid out our strategic plan to proactively embrace changes and reposition our businesses to align with the new industry paradigm. So today, in this section, I would like to share with you the encouraging progress that we've made so far. To start with, let me walk you through efficiency initiatives that we have implemented that have reduced our costs, and that's stabilizing our earnings. First of all, we closed down certain non-core or redundant businesses in areas such as online education, e-commerce, and game live streaming.\n\nSecond, we rationalized under-performing businesses, including loss-making digital content services and sub-scale social media products. Third, we tightened our control measures for marketing programs and cut down on spending with low return on investment, especially in the area of user acquisition. As a result, we reduced our selling and marketing expenses for the second quarter significantly by 21% year-on-year. Fourth, we migrated all domestic in-house services to Tencent Cloud for higher productivity and enhanced cost efficiency.\n\nFifth, we controlled our headcount by optimizing our workforce and controlled growth in staff costs. At the end of the second quarter, our total headcount was down by over 5000 sequentially. While our second quarter results reflected the initial cost savings from these efficiency initiatives, we expect to benefit more from them in the coming quarters. So, in addition to the aforesaid efficiency initiatives that help us stabilize earnings, we have been and will be implementing additional efficiency initiatives at business level to support our earnings recovery even while the macro environment remains challenging.\n\nFor Cloud services, we have been scaling back loss-making activities and shifting focus from customization and subcontracting heavy projects to more rapidly growing out internally developed products, driving margin improvements. For commercial payment, we are proactively managing our funding channels to lower our unit transaction costs, and we are targeting our development and operational efforts on higher-value services, such as industry-specific use cases, which will enhance our unit economics and margins. But long-form video, we are introducing more discipline in our content spending and putting a strong focus on return on investment when reducing discounts on Tencent video subscriptions, which has the effect of raising our effective video app. For video accounts, with our ecosystem reaching a virtuous cycle stage of critical mass where more viewers attract more content creators and vice versa, we can reduce our content procurement spending.\n\nAnd with the product reaching scale, we can also devote our engineering resources to optimizing bandwidth and service utilization associated with the service, bringing down our unit costs per video view. So in addition to the last two stages, if you will, we have also developing, we have been developing new and high-quality revenue streams that will drive earnings growth in this period. Now today, I would discuss the most immediate of these revenue initiatives, and that is advertising within video accounts. Video accounts have become one of the most popular short video services in China with substantial user engagement.\n\nIn the second quarter, its total time spent exceeded 80% of moments level. Its total video viewers increased robustly by over 200% year-on-year. In addition, several features of the Weixin ecosystem amplify the effectiveness of video account ads for advertisers. Firstly, we provide transactional functionalities within Weixin, such as many programs where advertisers can create powerful lending pages and facilitate transactions, and we come where advertising salespeople can interact with interested consumers.\n\nSo, advertisers can drive sales and lead conversion seamlessly within the Weixin ecosystem. Secondly, the range of interactions with our users enables us to help advertisers better target their audiences. And thirdly, our social graph enables advertisers to reach a broad audience base and build deep user engagement. To believe that video accounts in fit ads represent a very significant value creation opportunity for us because strategically, they allow us to expand our end-market share.\n\nAs advertisers have already been spending aggressively on multiple short-form video platforms, we should be able to capture more advertising budgets, and financially deliver a new revenue stream with high incremental margin onto our existing cost base. In terms of schedule, we launched in-feed ads in mid-July, initially selling the ads on the contract basis, and we will be making additional inventory available on a bidding basis by the end of August. Our monetization framework for video account ads is similar to that of Weixin moments in terms of a progressive claim over time. For your reference, Weixin moments took five quarters to reach RMB1 billion in quarterly ad revenue.\n\nWe expect to surpass that level more quickly with video accounts, given the current size of traffic and already strong advertiser demand for short-form video ads. Video accounts will eventually grow into a substantial revenue source for us over time. Before closing my strategy review section, I would like to share with you how we are positioned to enhance and broaden our revenue growth when the macro environment improves. On top of driving near-term earnings bottoming out, as well as a recovery through efficiency and revenue initiatives that I just talked about.\n\nFirstly, we believe that the regulatory environment in China is progressing from rectification to normalization gradually, which should bode well for the industry over time. Specifically, for platform economy, we saw recent regulatory direction trending more positive and supportive, supporting well-regulated, healthy, and sustainable development of the industry. For games, we believe the issuance of new Banhao should help the overall industry renew growth over time. We expect to receive Banhao in the future, which should benefit our domestic game business.\n\nSecondly, several of our businesses were adversely affected by the COVID-19 resurgence and economic deceleration but are significantly geared toward a future economic upturn. Approximately half of our revenues are from activities that closely contribute to and benefit from China's economic activity in the form of FBS and advertising. As an example, commercial payment volume slowed to low single-digit growth in April as major cities locked down, but recovered to a high single-digit growth in June. For advertising business, the revenue decline rate stabilized in the second quarter before the benefit of launching video counts in ads and under the current macro environment.\n\nSo, in conclusion, we remain confident about our resilience in navigating through challenges and our ability to capture opportunities when they arise. Now with that, I'll pass to James to talk about the business review.\n\nJames Mitchell -- Chief Strategy Officer\n\nThank you, Martin. For the second quarter of 2022, our total revenue was down 3% year-on-year. VAS represents 53% of our total revenue, within which the social network sub-segment was 21%, domestic games 24%, and international games 8%, online advertising was 14%, and FinTech and business services was 32% of total revenue. The Value-Added Services segment revenue was RMB72 billion, broadly flat year-on-year.\n\nSocial network revenue was up 1% year-on-year to RMB 29.2 billion. Increased revenue from video account live streaming services were largely offset by decreased revenue from music and game-related live streaming services. Video subscription revenue increased year-on-year as less promotional activity resulted in subscriptions dipping to 122 million, but higher ARPU. We do several popular self-commissioned drama series such as A Dream of Splendor, which ranked first by video views across all online platforms in China in June.\n\nPer QuestMobile, Tencent video widened its audience lead with its mobile DAU more than 20% higher than that of its closest peer in June. Our music subscription count and subscription revenue increased year-on-year. In July, Tencent Music sold over 6 million units of Jay Chou's digital album, reflecting pent-up demand for user engagement with artists. Domestic game revenue was down 1% year-on-year to RMB31.8 billion, reflecting transitional industrywide challenges, including fewer big game releases, lower user spending, and minor protection measures.\n\nRevenue from existing games Honor of Kings, League of Legends, and Moonlight Blade Mobile decreased. Our recently launched games fight of the Golden Spatula, Wild Rift and Return to Empire contributed incremental revenue. International game revenue decreased 1% year-on-year to RMB10.7 billion due to an industrywide normalization in user spending on mobile games post-COVID. PC game revenue increased, benefiting from robust growth in Valorant and the launch of V Rising.\n\nWeixin video accounts on the consumer side, total video views increased over 200% year-on-year, benefiting from increased social sharing and improved AI recommendation algorithms. Video views for AI-recommended content increased over 400% year-on-year. On the producer side, daily active creators, and video uploads, and video accounts grew over 100% year-on-year, providing additional content, breadth, and depth to support future consumer engagement. The increased video counts mindshare among live streaming fans with a series of live concerts, each attracting tens of millions of viewers as well as top-tier sponsors.\n\nOn QQ, we enriched virtual experiences by users interact using their super QQ show avatars. We introduced shared virtual spaces where users can make friends and engage in community activities, such as holding virtual beach parties and graduation ceremonies. We enable users to chat over live audio using their avatars. Turning to domestic games, we're using the current digestion periods to develop our technical capabilities and sustain our player engagement, which should position us well once conditions normalize.\n\nThe measuring engagement, one can look at the time spent on our games in the most popular and fastest growing game categories relative to competing titles in those categories and relative to the past. The most popular game categories in China are Battle arena and action shooter games, within which the flagship honor of Kings Battle Arena game was the first place game by total time spent across all games in China in the second quarter. While its monetization decreased year-on-year, its total time spent by adult players slightly increased. [Inaudible] about the arena game while adrift, ranked sixth by total time spent.\n\nOur action shooter game, Peacekeeper Elite, was the second-place game by total time spent industrywide, and also increased its adult player total time spent year-on-year. Among the fastest-growing genres, we entered the management simulation category with the July release of League of Legends Esports Manager, which is currently the highest-grossing simulation game yet to date. We entered the extraction shooter category with Arena Breakout, which ranked eighth by total time spent among all games in July. And auto-battler game Fight Off the Golden Spatula that released late last year has climbed to the fourth highest time span game industrywide in the second quarter.\n\nThe international games industry is also experiencing a digestion period, but we're progressing on some key strategic initiatives which we view as positive signposts for the future. Illustrating our studio's game operation capabilities, Riot [Inaudible] Valorant achieved a record high MAU and quarterly gross and receipts. second quarter. Valorant has broken into went from the crowded tactical shooter category, through super-serving unmet player needs, prioritizing fairness over monetization, and layering highly professional esports activities on top of a compelling competitive experience.\n\nOn the acquisition frontier, European Mobile Game Studio Miniclip recently acquired SYBO, developer of the endless run of games Subway Surfers. Subway Surfers is the most downloaded mobile game globally over the past decade, and boosts Miniclips daily active user base by 30 million to a total of 70 million. Positioning Miniclip is one of the biggest developers by DAU worldwide. On the new game front, our Swedish studio Stunlock, V Rising game sold over 2 million copies in its first month value of early access on Steam, showcasing our competitiveness in the increasingly important genre of survival open world crafting games.\n\nMoving to online advertising, our advertising revenue was RMB19 billion in the second quarter, down 18% year-on-year, reflecting weakness, particularly in the Internet services, education, and finance sectors. However, this quarter marked our first sequential revenue growth since the second quarter of 2021, with a tailwind from positive seasonality and a headwind from comparing against the Winter Olympics in the first quarter of this year. Ad spending on our platform was impacted in April and May by the pandemic resurgence and logistics disruptions. In June, the year-on-year decline rate narrowed as large e-commerce platforms increased ad spend with us for the 618 promotions, as year-on-year comparisons began to ease, and as underlying advertising demand slightly improved.\n\nIn moments, we introduced frame-breaking ads, which are popular with brand advertisers. He began rolling out video accounts in-feed ads on a contract basis in July to influential brands such as BMW, Armani, and Louis Vuitton. For media advertising, our long-form video ad revenue increased quarter-on-quarter due to stronger content releases and positive seasonality, despite a tough comparison against the Winter Olympics. Looking at FinTech and business services, segment revenue was RMB42 billion, up 1% year-on-year and down 1% quarter-on-quarter.\n\nThe FinTech services revenue growth paused in April and May as disruptive COVID 19 Resurgences impacted commercial payment activities. Nationwide, our commercial payment volume slowed to low single-digit growth in April but bounced back to high single-digit growth in June. On a regional basis, payment volume for every province and tier one city in May that China has now returned to positive growth rates. In business services, our revenue declined slightly year-on-year as we continue to scale back loss-making activities, in particular projects with a high proportion of subcontracting.\n\nOur own product revenue grew sequentially, especially in areas such as databases, big data, and AI. Hence, our business services gross margin increased quarter-on-quarter, benefiting from the improved revenue mix to reduce cost space. In platform as a service, TDSQL database revenue grew over 30% year-on-year, contributing over 5% of our cloud revenue. Key financial institutions is increasingly adopted our database for their court systems.\n\nWe released a new version of our Cloud Native Solution TDSQL-C, with comprehensive upgrades in product architecture, hardware capabilities, and engine kernels. Frost & Sullivan named TDSQL the leader in distributed databases in China, citing our strengths in areas such as scalability and industry solution service support. For software as a service, Tencent meeting launched a marketplace for plug-ins in June. Examples of plug-ins include Tencent e-signature, which enables users and enterprise sign agreements in a secure manner anywhere.\n\nEvernote, which provides a convenient way for participants to create notes during meetings. And near CRM plug-in, which simplifies scheduling before a call, database access during a call, and maintaining missing records after a call. I will now pass to John's to discuss the financial review.\n\nJohn Lo -- Chief Financial Officer\n\nHi, everyone. For the second quarter of 2022, total revenue was RMB134 billion, down 3% year-on-year or 1% quarter-on-quarter. Gross profit was RMB57.9 billion, down 8% year-on-year or up 1.4% quarter-on-quarter. Net other gains were RMB4.4 billion, down 79% year-on-year or 66% quarter-on-quarter, which were primarily on average assets and items such as net gains on disposals, disposals, and devaluation of certain investments, partially offset by impairment provisions against certain domestic investees.\n\nOperating profit was RMB30.1 billion, down 43% year-on-year and 19%quarter-on-quarter. Net finance costs were RMB1.8 billion, down 7% year-on-year and quarter-on-quarter. The year-on-year change was mainly due to forex gains recognized this quarter, compared to losses for the same period last year, partly offset by the increase in interest expenses due to an increase in [Inaudible]. Share of losses of associates and JV were RMB4.5 billion compared to RMB3.9 billion last year.\n\nNon-IFRS share of losses of RMB1 billion compared to RMB0.4 billion last year, mainly reflecting the impact from JV.com seizing to be associated. Income tax expense increased by 25% year-on-year to RMB4.6 billion, primarily driven by the low base effect resulted from a one-off deferred tax adjustment associated with an investee last year, as well as the provision of withholding tax during the quarter. The effective tax rate was 19.2%. IFRS net profit attributable to equity holdings worth RMB18.6 billion, down 56% year-on-year or 20% quarter-on-quarter.\n\nDiluted EPS was RMB1.915, down 56% year-on-year and 20% quarter-on-quarter. On a non-IFRS basis, operating profit was RMB36.7 billion, down 14% year-on-year or up 0.4% quarter-on-quarter. Net profit attributable to equity holders was RMB28.1 billion, down 17% year-on-year or up 10% quarter-on-quarter. Diluted EPS was RMB2.896, down 17% year-on-year or up 11%quarter-on-quarter.\n\nMoving on to gross margins The overall gross margin was 43.2%, down 2.2 percentage points year-on-year or 1.1 percentage points quarter-on-quarter. By segment, gross margin for VAS was 50.6%, down 2.3 percentage points year-on-year or up 0.2 percentage points quarter-on-quarter. The year-on-year margin decrease was a result of a revenue mix shift within the segment, particularly more revenue contribution from lower margin video accounts, live streaming services, as well as high staff closed with stable revenue. Gross margin for online advertising was 40.6%, down 8.2 percentage points year-on-year or up 3.9 percentage points quarter-on-quarter.\n\nThe year-on-year margin decrease reflected higher operating costs in particular. Post associated with video accounts, [Inaudible] as well as the fact that full exemption from coverage [Inaudible] construction fee no longer available this year. The quarter-on-quarter margin improvement was driven by 618 e-commerce festival, video content cost optimization, as well as the absence of content costs from Winter Olympics. Gross margin for FinTech and business services was 33.3%, up 1.3 percentage points year-on-year or 1.7 percentage points quarter-on-quarter.\n\nThe year-on-year margin improvement was due to central shift within FinTech services and lower revenue proportion from business services, which carry a lower margin. The quarter-on-quarter margin improvement was proven by cost optimization and reduction of loss-making activities of crossovers. On operating expenses. Selling and marketing expenses were RMB7.9 billion, down 21% year-on-year or 2% quarter-on-quarter, reflecting more disciplined marketing activities, particularly for digital content services.\n\nSales and marketing expenses were 5.9% of revenues, down 1.3 percentage points year-on-year. R&D expenses were RMB15 billion, up 17% year-on-year or down 2% quarter-on-quarter. The year-on-year increase was mainly due to higher staff costs, and quarter-on-quarter reflected our efforts to optimize workforce and control growth as staff force. R&D expenses was 11.2% of revenues.\n\nG&A expenses, excluding R&D, were RMB11.2 billion, a 14% year-on-year or down 0.6% on quarter-on-quarter. The year-on-year increase was mainly due to higher staff force and office expenses. As [Inaudible], we had approximately 111,000 employees, up 18% year-on-year or down 5% quarter-on-quarter. Let's take a look at our operating and net margin ratios.\n\nOur non-IFRS net margin was 27.4%, down 3.6 percentage points year-on-year or up 0.4 percentage points quarter-on-quarter. Non-IFRS net margin was 21.6%, down 3.8 percentage points year-on-year or up 2.2 percentage points quarter-on-quarter. The sequential improvement reflects our business rationalization and cost optimization initiatives as well as lower associate costs. Finally, I'll summarize some key cash flow and balance sheet metrics.\n\nTotal CapEx was RMB3 billion, down 57% year-on-year and quarter-on-quarter. Within CapEx, operating CapEx was RMB2.1 billion, down 65% year-on-year, as we proactively reassessed and tightened our spending plan for the year. Non-operating CapEx decreased by 8% year-on-year to RMB0.9 billion. Operating cash flow for the quarter was RMB35.7 billion, up 12% year-on-year and 6% for quarter-on-quarter.\n\nFree cash flow for the quarter was RMB22.5 billion, up 30% year-on-year or 47% in quarter-on-quarter, reflecting operating cash flow generation and more [Inaudible] spending with CapEx at media and content. Net debt position was RMB20.4 billion, compared to RMB11 billion last quarter. In addition to currency translation difference, the sequential increase was mainly due to payment of cash dividends by the company amounting to RMB13 billion, and repurchase of shares by the company amounted to RMB3 billion, largely funded by free cash flow generation during the quarter. Fair value of the holdings in listed investee companies, excluding subsidiaries, was approximately RMB602 billion as of 30th of June 2022.\n\nOperator\n\n[Operator instruction] Our first question comes from Ronald Keung of Goldman Sachs. Your line is open.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nThank you. Thank you, Pony, Martin, James, and John. Hearing all the impressive users and time-spent growth of video accounts. So what to hear what is management's expectation of the potential room for advertising revenues from these video accounts? If we benchmark with other form video platforms, how do we see e-commerce as a potential within that? And would that be any time spent cannibalization within WeChat as video accounts continue to grow? Thank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nThank you very much for the question, Ronald. In terms of benchmarking the long-term revenue opportunity for video accounts, then we provided a couple of references. What is that video account? Now represent roughly 80% as much time spent as Weixin moments, and that ratio has, of course, been rapidly climbing all out sequel The CPM on video accounts will likely be slightly lower than moments, but the advertising intensity will be higher. And so, net net, the revenue potential per minute of use of time spent will be higher.\n\nAnother way of benchmarking is against the incumbent short-form video services. Currently, video accounts has lower aggregate time spent but the CPM appears competitive with those incumbent services of superior to those incumbent services. And I think if you take the two together, they actually tie out at fairly similar outcomes to each other. In terms of the risk of video accounts cannibalizing Weixin moments, then we have not seen such cannibalization, and we do not expect to see such cannibalization because the different services provide different user needs, just as the growth of the moments did not cannibalization Weixin chat.\n\nWe believe the chat experience, the experience of sharing photos and articles with your friends, and then the experience of watching short-form videos provided by algorithms, three discrete internet use cases.\n\nMartin Lau -- President\n\nIn terms of e-commerce right now, I would say we do see e-commerce live streaming to be an opportunity potential, but that would take some time. I think in terms of staging, we actually have to go from that short-form video to live streaming. As you can see, we actually have been building the user habit of live streaming over time, including the very successful launch of some of the live concerts. And once we have built a habit of people watching live streaming, then we actually need to have an ad system right there, which actually can allow some of the merchants to bring traffic not just from organic basis, but also by throwing ad dollars to attract a user's head to into their live streaming commerce.\n\nAnd then when that happens, then we need to recruit merchants to be doing live streaming for the purpose of commerce. After all, this is starting right now. I think, you know, our ecosystem eventually would start coming into play because our mini-programs can actually very easily help the merchants to conclude transactions. And our private domain advantage can actually help merchants to accumulate customers of their own, and establish a longer-term relationship than just a one-time transaction.\n\nSo I think those will be sort of, you know, the progression of the live streaming e-commerce, and would try to do it on a stage-by-stage basis.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nGot it. Thanks, Martin.\n\nOperator\n\nThank you, Ronald. Our next question comes from the [Inaudible]. Your line is open now.\n\nUnknown speaker\n\nHi management, many thanks for taking my questions. Firstly, could you update us on any developments in the regulatory backdrop following the recent commentary from the authorities around the healthy development of the platform economy and completion of rectification? Last quarter, you provided some helpful observations, arguing it would likely take time for these high-level directives to filter through to specific regulators, and they'd also likely follow a sequence. Are there any developments to highlight? Then, secondly, operating cost growth slowed further in Q2 relative to recent quarters, demonstrating good cost control. Could you help us think through the trajectory of cost growth over the rest of the year and the key put intakes? Many thanks.\n\nMartin Lau -- President\n\nOK. Well, in terms of your first question on the regulatory front, I think you would have given some of the highlights in our strategies section. But I think, as you have observed right now, the recent regulatory direction is actually trending toward more positive form for platform economy. And the key messages is like, one, to promote well-regulated, healthy, and sustainable development; two, to complete the ratification; and three, to carry out regular supervision.\n\nAnd that's reiterated in both the state council meetings as well as the Politburo meetings in late July. And I would say along that guiding principle, right, we have seen a number of observations. Number one is that there's actually no new regulation this year that materially detrimental to the industry. And the second one, there is a resumption of the issuance of Banhao and there are multiple batches that have been issued.\n\nAnd addition to that, thirdly, we also have seen initiatives to formulate more supporting policies for platform economy across various regulatory bodies. For example, one is in MDRC led to Interministerial task force that has been set up to foster the development of digital economy and coordinate policies on the strategic areas such as big data and Internet Plus. And Ministry of Commerce also announced opinions to promote the development cultural content, for example, expanding pilot program of game approval, fostering internationally renowned brands in games. So we have seen quite a few new developments along the line of the general, more supportive direction.\n\nHaving said that, we do expect. The supporting measures will take time to play out, and we look forward to seeing more of them coming in the near future.\n\nJames Mitchell -- Chief Strategy Officer\n\nAnd when on your second question around the impact of the various margin initiatives, then Martin talked about the first batch of cost initiatives that we've already implemented. And for those, I think you've started to see the marketing expenses come down quite sharply already. You have begun to see a partial, although not full flow through to lower cost of sales, and you haven't yet in the second quarter, but you would in subsequent quarters see a flow through to G&A from some of the headcount and compensation adjustments we made. Martin also talked about a second batch of expense initiatives, which are more business specific, which will take effect and show through during the second half of the year.\n\nAnd then finally, we have some high-margin revenue initiatives of which the most immediate is video accounts that will flow through. So we believe, with those three sets of initiatives taken together, we can return the business to year-on-year earnings growth, even if the macro environment remains as it is today.\n\nUnknown speaker\n\nMany thanks for the color.\n\nOperator\n\nThank you. Next question comes from Thomas Chong of the Jefferies. Thomas, your line is open.\n\nThomas Chong -- Jefferies -- Analyst\n\nHi. Good evening. Thanks, management, for taking my questions. I have a question regarding the macro headwinds that we are seeing globally.\n\nUnderstand that management has different initiatives and cost control measures. But just want to get some color with regard to the gaming side, we are seeing international games and domestic games are impacted by soft game spending. Just want to get some color about our gaming strategy on this regard. How would we tackle these macro headwinds going forward? And then my second question is also relating to the cost side, given that we have done a great job in the cost control measure.\n\nJust want to get some color about the earnings growth with all these initiatives. Should we expect this to happen starting in Q3? Thank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nThomas, on the cost control, as we mentioned, we've taken a number of steps in the first half of the year. Some of those have already born fruit in the second quarter results, others will bear fruit in the second half of the year. We'll take some further steps and we believe that we can return to earnings growth in the coming quarters, even if revenue remains as it is now. In terms of the game business, then you're right.\n\nIt is a digestion year for different reasons, both domestic and international games. And our strategy is to accept that and to focus on really deepening our engagement with users, which we've talked about in terms of leadership and total time spent. And also, our focus on developing our capabilities, especially in the international markets as well. So, growth model is not predicated on the game business returning to revenue growth.\n\nWe believe we can grow earnings even with the game business as it is now. And for the game business, both domestically and internationally, we're focused on engagement and capabilities, and we believe, and also developing good new games, and we believe that in time, as we move into next year, then that will position us very well to resume game revenue growth. But I want to reemphasize that game revenue growth is not a precondition for earnings growth.\n\nOperator\n\nThank you, Thomas. Our next question comes from the Eddie Leung of the Bank of America. Eddie, your line is open. It seems that Eddie has some technical problems.\n\nLet's move to the next question. On next is John Choi of Daiwa. Choi, your line is open.\n\nJohn Choi -- Daiwa Securities -- Analyst\n\nOK. Can you hear me?\n\nOperator\n\nYes, we can.\n\nJohn Choi -- Daiwa Securities -- Analyst\n\nOK. Thank you for taking my question. My question is more on the cloud business services. I think you guys mentioned that with the more internal strategy shift, focusing more on quality revenue growth, such as reducing loss-making activities, this has been a major reason.\n\nHow long do you think this will last? Or can you provide some color there? And at the same time, we are hearing the macro conditions are preventing a lot of the cloud deployments from many of your customers. Are you also seeing that have a major bigger impact? And just quickly on the margins, what are the key areas that we could further improve profitability, except for introduce more on SAS on past products? And a quick follow-up earlier. I think you guys did mention on the ads video accounts that you will be progressive, but at the same time, it will be faster than what happened to our Weixin moments. So should we be expecting a different growth or trajectory for video accounts or revenue momentum in the coming quarters? Thank you.\n\nMartin Lau -- President\n\nIn terms of cloud, I would say it is indeed partly macro and a proactive initiative from our side to reduce the loss-making activities. Now, on the macro side, very clearly the most impacted industry vertical is actually Internet industry. Industry Internet customers basically got impacted the most, as the industry face to macro challenges as a whole. And then, at the same time, the macro environment also impacted some enterprise clients, and even in some cases, the deployment already signed contracts.\n\nDeployment actually sort of got impacted because of the COVID-19 resurgence in different cities. So those are the factors on the macro side. And then on the proactive side, I would say one is actually we reduce the loss-making activities such as subcontracting, and very heavy customization because those tend to be loss-making businesses. And at the same time, we also refrain from cutthroat pricing.\n\nSo certain projects which clearly going to lose money and at the same time they have little value. And for example, if it's purely a CDN type of business without much opportunity for upselling, then we, in the past, would still fight for those projects. More recently, we actually sort of attempted to give them up. So those combinations of factors would mean that our revenue actually is seeing less growth, and in the past quarter it actually declined year-on-year.\n\nBut I think what we try to try for is actually an increase in terms of gross profit and a narrowing of the losses that the business actually incurs over time. And I think we actually are making good progress toward those goals. Now, in terms of margins, I would say a very important part is actually given. We have very large existing customer base already, and we actually focus our development and our operational and marketing efforts on upselling our existing customers into a higher margin path.\n\nAnd SaaS products, especially when these products are internal developed, they carry both revenue opportunities as well as margin improvement and profit-generating opportunities. Now in addition to that, I would say on the ice and on the cost side, we actually also tried to improve our cost efficiency by managing our supply chain better, by introducing new technologies such as newer tech and newer cheap technologies. In some cases, we actually sort of work with the cheap developers very closely, and sometimes we work with domestic cheap developers very closely to get cheaper supplies. And at the same time, we actually mentioned that as part of the cost effort and as a very long initiative of moving all our domestic in-house services onto our cloud infrastructure, we finally, after a few years, have got it done.\n\nAnd this actually helped to increase the scale of our cloud infrastructure. And by that, it's not just about the procurement, but also on the same tech infrastructure. It's supporting both internal and external clients, and that actually helps to improve our cost efficiency. And these are all activities which would help to increase our margin.\n\nJames Mitchell -- Chief Strategy Officer\n\nAnd on that video accounts, the question was whether the advertising round would be faster for video accounts at the moment. And the answer is, yes, it is. And you'll see in coming days, we'll launch the bidding for the video account in-feed ads to supplement the contractual pricing, which should contribute to that parameter.\n\nOperator\n\nThank you. We are trying to reconnect with Eddie. So next is Eddie down from the Bank of America? Eddie, your line is open now.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nCan you hear me?\n\nOperator\n\nYes, we can hear you now. Thank you.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nThank you, Wendy, and I apologize. Just a follow-up question about video account. I think you guys mentioned a quite a bit about newcomers advertisers. Definitely with the connections through mini-programs that we call them, we can see that.\n\nBut just wondering down [Inaudible] for example, in one or two years' time, what type of use cases you can foresee from retailer kind of advertising beyond e-commerce transactions? And then related to that, how we deal or how will affect the online advertising space specifically, do you think is more competing for projects on either, let's say, online media platforms, or do you think is are creating new advertising demand and why? Thanks.\n\nJames Mitchell -- Chief Strategy Officer\n\nYeah, Eddie. So, it's obviously competing with other short-form video platforms. You know, advertisers have a budget for short-form video and they already split that two ways, and going forward, they're increasingly splitting that three ways. So, advertisers say we're going to spend X amount online.\n\nY percent of that will be on short-form video. And previously we didn't tap into the X percent, and now we've begun doing so. So, that's where we think the budgets will come from. In terms of the e-commerce commentary then, with regard to the second quarter, what we called out was really that we saw an uplift in our e-commerce advertising spending in June, and an uplift for the overall quarter versus the first quarter.\n\nAnd that's a number of reasons for that, including the proliferation of mini-programs. Also, including some of the changes in the China Internet landscape, meant that some big e-commerce companies, which underspent on Tencent properties in the past, have begun spending more aggressively on Tencent properties. And so that's been a market share shift in our favor from those really big companies. In terms of video accounts, advertisers by category.\n\nJust as with moments, we expect a broad spread of categories. So e-commerce is one, but Internet services is another, consumer, goods, food and beverage, automobiles all important as well. And automobiles actually are another area where advertising has been slightly healthier in the last couple of months for us.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nThat's very helpful. Thank you.\n\nOperator\n\nThank you. Next, we will take the questions about Alicia Yap of the Citigroup. Alicia, your line is open.\n\nAlicia Yap -- Citi -- Analyst\n\nHi. Can you hear me?\n\nOperator\n\nYes, we can.\n\nAlicia Yap -- Citi -- Analyst\n\nHi. Good evening, management. Thanks for taking my questions. I have two.\n\nThe first one is regarding the global gaming landscape. Obviously, you mentioned this is the post-pandemic digestion period. Is that fair to assume these digestion periods will start to normalize in the next couple of quarters? How should we factor in the inflation issues into the gaming virtual item prices versus the entertainment spending priority among the global gamers? So will gaming industry also face challenges on the backdrop of these global macro weaknesses? Or if we actually if we maintain the virtual item pricing despite these inflationary environments, will gaming actually become more affordable or entertainment choices that we could actually see benefiting from there? So any thoughts that management could help us think about the growth prospects of the global gaming industry will be helpful. And then second, very quickly on the cloud business.\n\nI understand we have make some progress on enhancing and upgrading the various productivity software services. So a monetization of maybe still at early stage. But any color on the latest adoption rate for these new solutions? Will this slight decline year-over-year that you mentioned on business services revenue are tapered off in the second half that we started to see the positive growth earlier expected? Thank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nAlicia, so on the game questioning, there's a great deal to unpack there and I won't even begin to start because it's actually not the most important thing for us. So, whether the international game industry returns to growth as we enter next year, or takes longer, depends on whether the weakness we're seeing now is primarily a post-COVID phenomenon, which it should cycle out late this year, which would be positive, or whether it's primarily a macroeconomic phenomenon, which could last for longer, depending on how global economics play out. And historically, the game industry has not been very economically sensitive. However, historically, the game industry was more of an upfront purchase model.\n\nNow, with much of the monetization of games being driven by in-game kind of cosmetics decisions, one could argue that the game industry has become more discretionary in nature, and there are consumers who have been playing their favorite game, have been purchasing items in their favorite game. And then when conditions are more difficult in terms of employment or inflation, they reduce their spending while still continuing to play the game. And the reality is we just don't know. No one really knows what the answer is to those imponderables.\n\nWhat we do know is that we have some exciting games in the pipeline, and we'll be launching underway in China in the coming weeks, which we're very excited about. We have that coming up internationally in the coming months. And then what we do know is that irrespective of whether the game business for us takes months or quarters to reaccelerate, we can grow the rest of our business in-depth for our overall earnings, irrespective of what's happening with that game recovery. Thank you.\n\nMartin Lau -- President\n\nNow in terms of the productivity software and the monetization, I would say this is definitely a revenue opportunity, and it's one of the revenue opportunities that we have in our coffers, but because it's not the most immediate and sizable in the near future, so that's why we didn't talk about it in the strategy update. So instead, within the strategy update, we only talk about the ads within the video accounts. The longer term, obviously, this is a revenue opportunity. In terms of the stage, I would say the adoption is due at the beginning.\n\nWhile it's encouraging, it's still small in absolute numbers, and we believe there needs to be a longer conversion and educational process through which we can get the enterprises to start paying for this productivity software. As a matter of fact, if you would notice, this conference call, we have actually moved from a previous webcast to our own Tencent of meeting service. So, in effect, I would become a paid user of our own productivity software, and we hope the service level is actually satisfactory, and you would actually help us to promote the service to other enterprises. Now, in terms of the business services and, in particular, cloud, which is the biggest component, I would say for the moment, we actually much more focused on making sure that we can grow our gross profit pool, and at the same time, we can narrow our absolute dollar in terms of losses of the cloud business.\n\nSo this is actually the more near-term objective. And I would say, in terms of the revenue growth rate, I think we probably put pushing it into the next year.\n\nOperator\n\nThank you. Our next question comes from the Charlene from the HSBC. Charlene, your line is open now.\n\nCharlene Liu -- HSBC -- Analyst\n\nThank you so much, Wendy. I would like to ask if we can get some comments on recent news on potential further divestment of your portfolio companies [Inaudible]. And can you tell us your thoughts more broadly on the subject, and whether there is any lesson learned from our early disposal of JV and C sticks this year? And a related question is on how were you thinking about your buyback plans under the backdrop of Prosus and Naspers lowering their holding in Tencent. As well as our long-term and continual investments in strategic areas like international game sales and video accounts.\n\nThank you very much for the opportunity.\n\nJames Mitchell -- Chief Strategy Officer\n\nYeah. Thank you, Charlene. So this specific news article you cited was not accurate. We are very focused on capital, returning capital to shareholders, given we believe our share price is very undervalued, and also undervalued in the context of our investment portfolio.\n\nSo if you look at what we've done year to date, we have returned around $17, $18 billion to Tencent shareholders, and we've been largely neutral in terms of our investments, divestments, and in other companies executing the substantial JV divestiture. So our focus from a sort of investments perspective has been buying back on dividends to our own stock, and that will likely remain the case going forward for some period of time. In terms of your question as to how we can fund ongoing buybacks and dividends, then if you take our second quarter results, we generated annualized free cash flow of mid-teens billions of U.S. dollars, and that's after investing in the CapEx and so forth to support video accounts and support international games, and support enterprise software.\n\nIn addition to that, we have disclosed that we have an investment portfolio whose market value was $90 billion at the end of the quarter. And we have demonstrated with JV and C that we're willing to work down that investment portfolio over time to more effectively return capital to Tencent shareholders. In addition to that, we have under state private investment portfolio where the book value is over $50 billion, and we believe that's been substantial appreciation on that over $50 billion book value. And we also look for opportunities to return capital from that private investment portfolio in the form of dividends, distributions, and buybacks.\n\nSo I think if you add all of the above, the annual free cash flow and the [Inaudible] of billions of dollars, the listed and unlisted investments in excess of $150 billion, then you'll see that we have substantial ammunition relative to our $370 billion market cap to continue doing dividends and buybacks at an aggressive rate. In terms of what are the lessons we have learned from the JV and C distributions, then I would say that we've learned how to process some of the logistics efficiently, which is good and means we can draw future such distributions or sales more rapidly. We've also developed our ability to manage relationships around those transactions and demonstrate that while we have sharply reduced our stake in JV, as an example, we continue to have a very good business relationship with JV and also with C on an ongoing basis. And then finally, I think our investors have responded quite favorably to the dividends and distributions, and that encourages us to think about how to continue down that capital return path going forward.\n\nThank you.\n\nCharlene Liu -- HSBC -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you, Charlene. Next question comes from the [Inaudible]\n\nUnknown speaker\n\nHi, yeah. Thank you for the opportunity to ask questions. My first question is related to our FinTech or payments business. How should we look at the revenue opportunity going forward? This is a revenue line which is mostly related to consumption or macroeconomics.\n\nSo how should we look at that in second half, maybe going into next year? Second, a follow-up on video accounts. I think we mentioned that our time spent is exceeding 80% of moment, and if assuming these are to surpass the time spent moments very soon. So does it mean that sometime next year or in the foreseeable future, video accounts will very soon become our number one kind of advertising channel, within that as an ecosystem system with revenue even exceeding the moment? And if we compare with other peers, are we confident that we can have a revenue per time spent, which is at least equivalent or even better than some of the other short video peers? Thank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nThank you for the questions, Gary. So in the FinTech business, I think sometimes people operate under the misapprehension that Tencent operates more in the virtual world rather than the physical world and is therefore immune to slowdowns and unaffected by accelerations in the broader economy. And there may have been some truth to that misperception many years ago, but it's no longer the case today. Today, the FinTech business is its biggest single activity.\n\nAnd if you look at payment merchant acceptance businesses like Visa, MasterCard in the Western world, then they're very clearly geared to economic activity. They slowed down a great deal when Western economies slowed down, and they reaccelerated as Western economies reopened. And the same thing is proving true for our payment business, as we mentioned in the introductory remarks. Our payment volume growth slowed to low single-digits year-on-year in April and May, when cities went through the COVID-19 shocks, and then accelerated to high-teens growth year-on-year in June, and accelerated again in July, and the payment volume growth correlates quite neat with the payment revenue growth.\n\nSo we had a sharp deceleration just as Visa and MasterCard dipped because of the COVID-19 shocks. And now we're experiencing an upturn, and to the extent, the China economy accelerates, then certainly our payment business, also our advertising and our business services activities should enjoy the benefits just as they have suffered during the slowdown period. So that's on the FinTech question. In terms of the video accounts and how we stack up versus peers from a monetization perspective, then we have been running in-feed ads within the video accounts for several weeks now.\n\nThose in-feed ads, assaults on a contract basis currently. The eCPM on those contract ads is moderately lower than the eCPM on contract ads on moments, but it's higher than the eCPM, the blended eCPM for ads on the two incumbent short video services. We will be rolling out bidding price ads within video accounts in the coming days. And from that experience, we will have a clearer picture of what the long-term eCPM is for video accounts based on the two incumbent services.\n\nBut based on the data that we've seen so far from both the contract price ads and, before that, from the quality and the enthusiasm of the sponsors for the live stream concerts and video accounts, I'd say that we're quite optimistic that the eCPM will achieve for our video account ads should be at least par with the eCPM of the leading short video platform in China today.\n\nOperator\n\nThank you, Gary. We will take the next question from Jerry Liu from UBS. Jerry, your line is open.\n\nJerry Liu -- UBS -- Analyst\n\nYes. Thank you. Thanks, management, Wendy. I wanted to ask about maybe a little bit of the reverse of some of the questions earlier about cost control.\n\nIt sounds like with payments, with advertising, we're seeing some improvement in these businesses in just recent months and weeks. And sooner or later, we're going to have new games coming through. So one of the investor questions we've been getting is, as that happens, are we going to ramp up some of the social marketing and spending? So I get that if revenues flattish, then we were seen as we can still get to our earnings growth environment. Now, would we, if we have the opportunity, go back to a slight investment mode to drive revenue growth? Thank you.\n\nMartin Lau -- President\n\nI think the assumption is correct, right? If we have a new game, then, of course, it will actually support it with a marketing campaign. And we believe it will be money well spent and especially if it's on a pretty significant title like [Inaudible].\n\nJerry Liu -- UBS -- Analyst\n\nIf I may ask a follow-up. So there's been some questions recently about the steep ramp of a video account. And I'm just wondering, what is the kind of limiting factor to the bottleneck due to the pace of the ramp if you will? I know in the past, for example, with moments we've talked about user experience in terms of how fast we crank up the ad load. Is that also the key consideration here, or what is maybe the priority to determine the pace we can ramp up advertising.\n\nThank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nYeah. So that's continual optimization and reoptimization process where we expand the percentage of video account users who can see ads, we show them one ad per user day, we measure the performance of that ad, we optimize, then we increase the number of ads per user day, we measure the performance of the incremental ads, we reoptimize, and for Weixin moments, that optimization, reoptimization took a long time because it was the first time we'd done it at scale, at least within a Weixin property. And because we didn't have external comps to benchmark against for the video accounts, we're going through that process faster because we have the experience of moments, because we have the external comps to benchmark against. And also, I believe because machine learning hardware and software are better now than they were then.\n\nSo by point of reference, I think if you look back at moments, then the time lag between us launching contract price ads versus bidding ads was many quarters versus for video accounts, it's a few weeks.\n\nJerry Liu -- UBS -- Analyst\n\nThank you.\n\nOperator\n\nThank you, Jerry. Next question comes from the [Inaudible] from Macquarie. [Technical difficulties] Your line is breaking.\n\nUnknown speaker\n\nI do apologize for that, and thanks very much for taking my question. This is [Inaudible] of Macquarie. My first question relates to video accounts. So I'm just supplementing the previous questions that were asked.\n\nObviously, the user-moment engagement momentum is very strong. So it's a firm, clear roadmap that we have and that bodes well for informatization. So just looking at this very holistically, what are the synergies within the Weixin ecosystem, and how does that compare with at formats such as moments and official accounts, given our perspective of a full-on the strategy? And I'll ask the same question about gains later. Thank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nI think that Martin touched on some of the synergies in the opening remarks, including the fact that when an advertiser buys a video account, they can have that link through to that mini program, which is that private domain transaction or environment that they value very highly, including the fact that they can have the ad link through to WeCom, so that a consumer who is interested in a high-value product such as an electric vehicle, can then in a chat with a salesperson for the electric vehicle OEM or dealer.\n\nMartin Lau -- President\n\nThere's no cannibalization right now, both from the perspective of user time spent, as well as from ad dollars spent.\n\nUnknown speaker\n\nSure. Thank you. That's very clear. And then my second question would be in terms of our international game and also how that aligns with our investment strategy.\n\nFor a broader investment strategy would be to emphasize on strategic growth, and right now we're in the face of rebalancing. So, given that recent news headlines about Tencent could potentially raise stakes in a global game company, how should we think about global M&A opportunities? And also, how does that align with the Tencent international game strategy? Thank you.\n\nJames Mitchell -- Chief Strategy Officer\n\nYeah. So in Tencent, our international game strategy, there are sort of three in a promise for delivering new games. One is the existing international investees bringing new games to market, and some of those investees consolidated investees, such as Ride and Supercell, are very well known to investors. But in the last five years, we've invested in a range of other Investees such as Stunlock, that are less well known to investors.\n\nBut with the success of re rising, we hope the forthcoming success of Darktide, we believe they'll be in a more understanding of the value with these international studios. And then secondly, we have our big domestic studios such as Quantum, Timi, Aurora, and more fun that are developing games that will be released both in China and overseas, such as [Inaudible]. And then thirdly, we continue to be quite active in terms of acquiring new game studios. So we called out the fact that, with recent Munich, that was acquired with mini-clippers.\n\nAnd so, as you probably know, a consolidated subsidiary has acquired SYBO, and SYBO brings with it big game Subway Surfers, and Subway Surfers has 30 million daily active users, which is actually a gigantic number. We normally in China, when we look at international game studios, the revenue is very impressive, the product is very impressive. But the daily active users are an order of magnitude smaller than what equivalence would achieve in China because the China game market has many users, but in a 30 million daily active users, it's a big number by anyone's standards, including our standards. So, as you can see from SYBO and its 30 million people playing Subway Surfers each day, we continue to be active in acquiring game studios outside China.\n\nUnknown speaker\n\nThank you. Thanks for the insights.\n\nOperator\n\nThank you.We will take the last question from from Alex Yao of JPMorgan. Alex, your line is open now.\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\nThank you, management, for taking my question. Two questions. Number one, can you share with us your latest thoughts on FinTech development strategy? For example, does Tencent need to apply for a financial holding company license? Does Tencent need to establish a separate credit scoring unit and apply for a relevant license? Are you guys going to build your FinTech business in a similar or different way compared to comparable-sized Fintech peers? So that's the number one question. And number two, I think after hearing your aspects of video accounts monetization.\n\nAm I getting it right that you guys are monetizing this as property philosophically different way compared to your approach moments? And thinking about the long-term monetization potential, would you say you will run the ads load in a similar level as the current peers in the market, given that the ads load over the moments after years of the monetization is few significantly below general purpose of feeds based products. Thank you.\n\nMartin Lau -- President\n\nSo in terms of our FinTech development, I think it's actually relatively stable and progressing quite well. And as you can see, FinTech is already a pretty significant part of our overall business. And in the past year, we have been engaging with the regulatory authorities to make sure that each part of the FinTech business is completely compliant, and that we've gone through a lot of business changes to make sure that these are all done. And in terms of the financial holding company, we are still working with the regulators on the licensing part.\n\nAnd I would say whether we're going to be getting a financial holding company license, it would not have a major impact on our businesses. The key goal is actually to understand what will be satisfying the regulators' most stringent requirements. So if the end result of the exercise is that we will be applying and that regulator would give us one license, then that would be great. And we believe it will not have an impact on our business.\n\nOur business can continue to be conducted. And likewise for the other specific questions about whether you need a license here or you need a license there, or whether you need to make some changes to the current practice. We believe we have actually been through the examining exercise for the past year and a half, and we're pretty comfortable that we know exactly what we need to do in order to continue to grow our FinTech business.\n\nJames Mitchell -- Chief Strategy Officer\n\nAnd on the video account monetization, has the philosophy changed versus moment monetization? No, the philosophy is exactly the same, and that we prioritize the user experience first. And you can see that the prioritization is paying off because the number of video views within video accounts grew over 200% year-on-year. Now, there are some differences between now and when we began monetizing moments. One difference is that the benchmarks are much clearer for short-form videos, and they were for moments.\n\nThe second difference is that the machine learning software and hardware is better. A third difference is arguably that the cost to the consumer of an ad load within a short-form video is lower than within a social network such as moments because, within the short-form video, the consumer is continually previewing videos, swiping through those she doesn't want to watch and accepting those she does want to watch. And so if, in the same way, she sees an advertisement that she doesn't want to watch, she swipes through it. She doesn't view that as necessarily detracting from our overall engagement with the short-form video product.\n\nAnd that's why if you look at the two incumbent short-form video services in China, they're able to maintain ad loads of roughly 14% to 16%. For moments, as you may know, the ad load would be shown free per ad per user per day. Given that not all users see all of those ads for various reasons, the effect of ad load is closer to 2% to 3%. And yes, we do expect video accounts to transcend to overtake moments in terms of ad load, given where the two incumbent pairs are already at today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPony Ma -- Chairman and Chief Executive Officer\n\nMartin Lau -- President\n\nJames Mitchell -- Chief Strategy Officer\n\nJohn Lo -- Chief Financial Officer\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nUnknown speaker\n\nThomas Chong -- Jefferies -- Analyst\n\nJohn Choi -- Daiwa Securities -- Analyst\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nAlicia Yap -- Citi -- Analyst\n\nCharlene Liu -- HSBC -- Analyst\n\nJerry Liu -- UBS -- Analyst\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\nMore TCEHY analysis\n\nAll earnings call transcripts"
}