{
  "companyName": "Neogen",
  "companyTicker": "NEOG",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/02/neogen-neog-q1-2023-earnings-call-transcript/",
  "content": "Neogen (NEOG -0.97%)\nQ1 2023 Earnings Call\nSep 27, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the Neogen Corporation first quarter fiscal year 2023 earnings call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to John Adent, CEO and president. Please go ahead.\n\nJohn Adent -- Chief Executive Officer\n\nGood morning, and welcome to our regular quarterly conference call for investors and analysts. Today, we will be reporting on the first quarter of our 2023 fiscal year, which ended on August 31. As usual, some of the statements made here today could be termed as forward-looking statements. These statements are subject to certain risks and uncertainties, and our actual results may differ from those that we discuss today.\n\nThe risks associated with our business are covered in part in the company's Form 10-K as filed with the Securities and Exchange Commission. In addition to those of you joining us by live telephone conference, I also welcome those of you joining us via the Internet. Following our prepared comments this morning, we will entertain questions from participants who have joined this live conference. I'm joined this morning by Steve Quinlan, our chief financial officer, who will provide some additional details on our results for the quarter.\n\nAs we stated in our press release this morning, we reported 3% growth across our business in the first quarter of our new fiscal year, despite the challenging business environment that we've been operating under throughout these months. Steve will talk about it more in his comments later on the call, but we faced particularly strong currency headwinds that impacted our business. Without these, total revenues would've increased 6% and our food safety business would've been up 9%. I can't say enough about our incredible team here at Neogen and their continued dedication to our mission in Neogen's success.\n\nThe first quarter presented us with many challenges, both with the current state of the economy and the added responsibilities of our existing job duties as we worked to close the 3M's food safety transaction on September 1. Thanks to the collective efforts of the Neogen team and our new 3M team members from around the world, we are pleased to successfully close the transaction on the morning of September 1 and begin the integration of the former 3M food safety business with our operations. Since day one, members of our Neogen team, including myself, have been traveling to visit our new food safety teams in person. I just returned home from a trip abroad, where I was able to visit many of our new locations and team members.\n\nOn my trip, I met with teams across Europe and I returned home more excited than when we announced the deal. The enthusiasm among our team members was fantastic, and we were able to discover new synergies between our businesses. I feel confident that under the new management structure, we can accelerate the growth of the business and capture this untapped potential. The sales teams are very excited to be part of the Neogen team and are very eager to begin cross-selling Neogen products with their former 3M food safety products.\n\nI also visited the Bridgend facility in the UK that we obtained in the merger, and it was tremendous. I was so impressed with the teams, resources, and capabilities there, and I'm really excited about the opportunity to grow that business. The team is excellent, and having been a pilot site for 3M's SAP implementation, they will be one of the first teams to implement our SAP platform. They've been instrumental in assisting with the blueprinting of the system and their assistance and expertise will be invaluable in the months to come.\n\nWhile I was there, I found our Bridgend team and our Ireland-based Megazyme business had already found opportunities to increase the efficiencies of both locations because of similar manufacturing processes and systems. These are just a few examples of what we believe can be achieved with these businesses as we more fully integrate them into Neogen. I really enjoyed being able to interact face to face with these new members of the Neogen family, answering questions and providing updates in person. The excitement I gained from this trip is a great motivator as we look to the rest of the fiscal year.\n\nThese are very strong teams that bring great value to Neogen. And I'll be looking to them to strengthen our leadership across Europe. We also welcomed our new food safety division leaders to our corporate headquarters in Lansing, Michigan during the second week of September, where they connected with their teammates and began holding important conversations regarding our 30, 60, and 90-day plans. And they've helped us identify a number of new sales and operational synergies.\n\nOverall, it's been an incredibly positive first month as a combined company, and I feel very confident about the team that we've put together. This has been a busy time for Neogen with many positive changes and we're very excited about the future. We're well-positioned at the forefront of food safety and digitization. And together as a global industry leader in food security, we'll be able to better serve our customers at every stage of the food chain from behind the farm gate, all the way to the dinner plate.\n\nNow I'm going to turn it over to Steve for some more insights into our numbers for the quarter.\n\nSteve Quinlan -- Chief Financial Officer\n\nThank you, John, and welcome to everyone listening this morning. Before I talk about the numbers, I'd like to also recognize our Neogen team members for both their efforts in the quarter and in getting the 3M food safety transaction across the finish line. Earlier today, we issued a press release announcing the results for our first quarter which ended on August 31. Revenues for the quarter were $132.3 million an increase of 3%, compared to $128.3 million in the same quarter a year ago.\n\nExcluding the impact of currency translations, this increase would've been 6%. Income for the quarter was $5.2 million or $0.05 a share, compared to $17.1 million or $0.16 a share a year ago, excluding $13.7 million in deal costs associated with the 3M transaction. And after adjusting for taxes, that income would've been $15.9 million or $0.15 a share. In the next few minutes, I'll give you some color around the numbers, and I'll start by talking about the negative currency translation impacts to the business in the first quarter.\n\nThe pound and euro have each devalued 13% against the U.S. dollar compared to the first quarter a year ago. And to a lesser extent, we also experienced negative impacts of a weekend Australian dollar and Argentine peso. In total, revenues would've been $3.9 million higher in the first quarter had currency been neutral, which would've resulted in 6% growth.\n\nOur overall organic increase, excluding the currency impact was 4% for the quarter, with the acquisitions of CAPInnoVet, Delf, GVS, and Thai-Neo Biotech contributing the remainder of the growth. The dollar if strengthened further into the second quarter, which will adversely impact our top line for this quarter as well. Revenues for the food safety segment were $64.6 million in the first quarter of fiscal '23, an increase of 3%, compared to $62.7 million in last year's first quarter. As our UK and Ireland operations report through the food safety segment, most of the adverse currency impact was felt here.\n\nExcluding currency, overall food safety segment sales increased 9% and organic sales increased 7%. International revenues rose 2% for the quarter. This increase was 10% excluding the currency headwinds. Our UK operations posted a 5% increase when the sales were converted to U.S.\n\ndollars, or was 19% in pounds, partially due to the contribution of Delf, the cleaner and disinfectant business in Liverpool we acquired in November 2021. Organic growth for our UK operation in pounds was 12%, led by strength in aflatoxin test kits, cleaners and disinfectants, genomic services, vet instruments, and animal care products. Offsetting some of this growth were lower sales in several of our diagnostic product lines and softening market conditions in Europe and the Russia-Ukraine conflict are impacting customer buying patterns. At our Brazilian operations, fiscal 2023 first quarter sales increased 13%, driven by strong sales of aflatoxin and deoxynivalenol test kits as increased presence of these mycotoxins during harvest season are requiring more testing.\n\nBrazil also posted strong increases in sales of vet instruments and genomic services. At Neogen's Latin American operations, sales increased 19% led by broad-based gains on our diagnostic test kits and culture media. Rodent control products and cleaners and disinfectants sold through distributors also recorded revenue increases. Sales in China were down 18% in U.S.\n\ndollars and 14% in Chinese yuan. Our business there was negatively impacted by COVID-19 lockdowns in the first quarter. Our domestic Food Safety business was flat for the quarter. As I already mentioned in regard to Europe, we are also seeing the impact of inflation and softening market conditions in the U.S.\n\nand Canada. Our sales team is seeing customers tightening their belts and reducing testing volumes where they can. They have also reported prolonged pipelines, especially in regard to equipment sales. Increases in aflatoxin test kits, Soleris consumables, and food quality test kits were offset by a significant decline in Soleris equipment due to a difficult comparison against strong sales in the prior year.\n\nOur allergen and environmental sanitation product lines also declined, due to reduced buying patterns from customers and supply chain disruptions on certain products. On a worldwide basis, sales of our mycotoxin test kits increased 3%. Food quality products manufactured by Megazyme in Ireland increased 9% and Soleris consumables increased 6%. Offsetting some of this growth, allergen decreased 9%.\n\nGeneral sanitation products declined 2% and Soleris equipment placements were lower. The animal safety segment recorded revenues of $67.7 million for the quarter, up 3% over the $65.6 million achieved in last year's first quarter. Our Australian business reports through this segment in the Australian dollar, was 7% lower in this year's first quarter compared to the same period a year ago. On a neutral currency basis, animal safety segment revenues increased 4%.\n\nThis increase was 1% after excluding contributions from the CAPInnoVet and Genetic Veterinary Sciences acquisitions. Sales of our core animal care products including supplements and vitamin injectables increased 16% over the prior year with continued strong end customer demand. We also recorded a 14% increase in insect control products and a 7% increase in cleaners and disinfectants. Partially offsetting these increases, rodent control products declined 12%, a result of diminished rodent pressure in the U.S., and sales of veterinary instruments declined 6% off a very strong quarter in the prior year.\n\nGenomics revenues recorded in the animal safety segment increased 7% with sales from the GVS acquisition, partly offsetting lower sample volumes in the porcine market and a difficult prior-year comparison due to a large research project in fiscal '22. On a worldwide basis, genomics revenues increased 5% as our international labs were negatively impacted by currency headwinds in the UK and Australia, and COVID-19-related closures in China. Excluding the FX impact, growth here was 8%. Gross margins were 47% for the quarter compared to 46.8% in last year's first quarter.\n\nThe slightly improved gross margin is a result of pricing actions taken earlier in the year and favorable product mix in the animal safety segment. We're still experiencing significantly higher freight costs than a couple years ago, but I'm pleased to report our cost for inbound container shipments have gradually come down over the past several months. Operating expenses included $13.7 million of 3M transaction-related costs. Excluding these charges, operating expenses increased 11%.\n\nOf this growth, $2.1 million was a result of our recent acquisitions. Within sales and marketing, which was 14%, business travel, trade shows, and other customer-facing activities increased significantly, as in-person events were still limited in the first quarter of last year. Compensation and other personnel-related expenses also increased, including headcount from recent acquisitions, as did shipping costs on higher rates and volume. G&A expense increased 6% after excluding the deal costs, primarily due to higher accruals for performance-based incentives and new expense, including amortization from recent acquisitions.\n\nR&D expense increased 13%. This includes incremental expense at GVS from R&D personnel absorbed in the acquisition, and a large increase on external product development costs. Operating income for the first quarter was $6.1 million, compared to $21.7 million in last year's first quarter. Excluding the $13.7 million in 3M food safety deal costs, operating income was $19.8 million.\n\nExpressed as a percent of revenues, adjusted operating income was 15%, compared to 16.9% in last year's first quarter. We recorded $969,000 in interest income as yields on our investment portfolio continue to rise due to higher interest rates. This compares to the $203,000 in the prior year. Effective rate for the first quarter was 21.8%, compared to 21.4% in last year's first quarter.\n\nThere was minimal tax benefit in the first quarter from the exercise of stock options. Our adjusted EBITDA was $26.9 million or 20.4% of sales, compared to $28.9 million or 22.5% of sales in the first quarter of the prior year. On the balance sheet, our net receivable balances declined by $6.6 million compared to year end and our days to collect is currently at 60, compared to 59 in the prior-year first quarter and 62 at May 31. Inventory increased by $6.7 million or 5% on raw material cost increases and increased safety stock levels to avoid back orders and delays caused by the ongoing and unpredictable global supply chain issues.\n\nOur operating cash flow was negative for the quarter due in large part to payments made relating to the 3M deal, and to a lesser extent, increases in inventory. Deal expenses will continue into the second quarter, and we should then return to positive cash generation from operations in the third quarter. On the September 1st close of the 3M food safety business, we assumed $1 billion of debt, and we'll be paying the principal down aggressively in the next few months as we unwind our marketable securities portfolio. At the end of September, we plan on paying down $60 million on the term loan.\n\nIn addition to the 3M food safety transaction, we made a small acquisition in July purchasing our Thailand distributor, which provided some minor incremental revenues and also created a legal operating entity in the country making it easier to absorb the 3M business in Thailand. Although, we'll be laser-focused on the integration of the 3M business, we will continue to look at smaller acquisitions that add to our product or geographic portfolio and that are good fits with our existing business. Our teams continue to perform in a very challenging operating environment and we're grateful for and proud of their efforts. We got a lot accomplished in the first quarter.\n\nAnd despite some of the headwinds currently in our faces, are cautiously optimistic for the remainder of the year ahead. And at this point, I'll turn it back to John for further comments.\n\nJohn Adent -- Chief Executive Officer\n\nThanks, Steve. We are well on our way to integrating the new business and providing customers with new products and solutions to enhance their food safety systems. Post close, we've added 28 new countries to our employee footprint, which also expanded our commercial presence to over 40 countries. We're thrilled to have had a very high conveyance rate of the former 3M food safety employees.\n\nThe outstanding work done by our HR team has allowed us to retain the talent who bring critical business knowledge with them to Neogen, placing us in a strong position for continued forward growth and maintaining business continuity. In addition, 55% of those conveying employees were sales and marketing-focused, which greatly expands our ability to penetrate our markets and grow our customer base around the world. Our IT team has been working diligently to integrate our systems with the former 3M food safety systems and evaluating efficiencies as we manage a lot of new data and work to share it with each other. The team has deployed a global CRM instance to support harmonization between our conveying sales teams and our existing sales teams.\n\nThis platform helps the teams to align targets across the groups and ensure that the targeted benefits associated with the merger are clearly defined and tracked. We are currently in the design phase of our global ERP platform implementation as we look to bring the organization together, eventually enabling shared services and optimizing our supply chain once complete. The former 3M food safety commercial software and cloud capabilities are being migrated to the Neogen cloud, and both groups have pulled together to accelerate our commercial data and analytics roadmap. We're also evaluating our global R&D platforms between teams and are developing a plan for the optimization and acceleration of our product development activities.\n\nWe expect this activity to align with the targeted deployment of our new R&D facility in Minnesota in Q1 of the 2023 calendar year. Our operational teams are working diligently with 3M to fix their back order situation, which has slowed their food safety sales over the last two quarters by 5% to 6%. Doing so, we'll improve sales in the remainder of the fiscal year. We are receiving a positive reception from customers around the world, which gives us a lot of excitement and momentum as we move forward to combining the company.\n\nPost close, we met with the senior leadership of a leading commercial lab company and presented the unique opportunity that Neogen was now able to provide. They are very excited about the opportunity to work with the combined business and immediately saw improved service levels. Longer-term, the combined company will offer them opportunities to invest in the improved automation technology, which will drive further customer efficiencies and increase the usage of Neogen's consumable products. This excitement from our customers is incredibly encouraging, and is driving our teams to work together to find the best systems and solutions to reach our markets around the world.\n\nIn July, we ceremoniously broke ground on our plan to $85 million expansion of our Lansing Food Safety facility. This expansion is centered around the construction of a three-story, 175,000-square-foot dedicated manufacturing and research building for our food safety products. We are pleased to report that in August, we received the necessary approvals and secured the desired state incentives to move forward with the expansion. Construction will begin immediately and continue for the next 14 months with a completion target date of December 2023, with validation and other progress taking place through 2024.\n\nThis expansion represents a significant investment in our business, technology, people, and community, demonstrating our strong belief in Neogen's long-term success. This is an important step in our growth. And as we focus on the integration of the former 3M food safety business with our operations, this Lansing expansion will be the location for the manufacturing of the Petrifilm indicator organism testing line of products. We are currently expanding our distribution centers in Kentucky and Ireland to ensure that we are able to ship products quickly, getting our customers the solutions they need in a timely manner.\n\nThese are critical for our business, as we grow our markets and reach new customers through our expanded food safety division. These larger distribution centers will help us, as we make our Animal Safety products available to our new food safety division customers. As we educate them on the importance of protecting the food supply from farm to fork, and creating a sustainable food chain. There is a lot of potential growth for Neogen and our entire team is ready to capture it.\n\nNow that the 3M food safety transaction is closed and these expansions are underway, Neogen looks at a transformative remainder of the 2023 fiscal year. We've just acquired a business that generated $370 million in revenue in its last reported 12-month period. We have over 400 new talented team members worldwide and we are excited about the potential of this business. We have a great team working here, who are passionate about protecting the global food supply and dedicated to our mission to be the leading company in the development and marketing of solutions for food and animal safety.\n\nThis group does not back down from challenges and takes all change in stride, working together to make Neogen the best company that it can be. The detailed work of capturing deal synergies is ongoing. And as we seek to position our new global portfolio and set the tactical direction for our line sales and marketing teams, we continue to validate our growth opportunities and refine our targets across the combined portfolio, including our microbiological, immunodiagnostic, and genomics platforms. Execution against these growth strategies at a customer and product level has already begun.\n\nThere will be a lot of change in the upcoming months and years, but we are well prepared and confident in our ability to continue growing and leading the food security market. Now back to Steve for some additional comments from him regarding our forward-looking financials.\n\nSteve Quinlan -- Chief Financial Officer\n\nThanks, John. As you all realize, we have owned a business for less than a month. We have had numerous calls from analysts, trying to model the company going forward, given some of the recent headwinds in the 3M business in particular. We are currently working with the commercial teams to review the forecast for the rest of this fiscal year, and our plan is to present our revised projections for the combined business for at least the rest of this fiscal year at our second-quarter earnings call, which is currently scheduled for the first week of January.\n\nWe appreciate your patience and your support as we better understand and integrate the businesses.\n\nJohn Adent -- Chief Executive Officer\n\nThanks so much, Steve. Before we move to Q&A, I'd like to take a moment to announce that Steve will be retiring next year. Steve and I have been working together to plan for this transition and he will remain with the company through May 31, 2023, the end of Neogen's fiscal year. As you all know, Steve has served as Neogen's CFO since 2011, leading the company through more than 30 acquisitions, including the company's most recent acquisition of 3M food safety business.\n\nI and all of Neogen employees are very grateful for Steve's service and commitment to Neogen over the past 11 years. Helping us deliver on our mission of protecting the world's food supply from behind the farm gate to the dinner plate. And I want to wish him well on his retirement. Simultaneously, I'm excited to welcome Dave Naemura, who will take on the role of chief financial officer, effective January 2, 2023.\n\nDave will work closely with me and Steve until his retirement in May to ensure his smooth transition. Dave has extensive experience working as a chief financial officer for public companies, most recently for Vontier Corporation, where he played an instrumental role in the company's separation and launch as an independent public company. Steve, is there anything you'd like to add?\n\nSteve Quinlan -- Chief Financial Officer\n\nThanks, John. A little more than a year ago, I discussed with John my future with Neogen, including my potential retirement plans and here we are. I've had the good fortune to be the CFO of this great company since the beginning of 2011. We ended our fiscal 2011 with $147 million in revenues and 654 employees.\n\nAt the end of last year, we were at $527 million in revenues and over 2,000 employees. It's been a great ride with a lot of great experiences and friendships made, but I'm now looking forward to a lot of quality time with my wife, our three daughters and their families, which includes four grandchildren and making up for a lot of time spent away. There's a lot of travel in our near future. I'm excited about the future of the company.\n\nWe have a passionate and committed employee base. John has taken what Jim Herbert and Lon Bohannon put together and is built on that, putting a great leadership team together to take the company to the next level. And Dave comes in with large public company experience. So I believe we're in good hands and I look forward to what I am sure will be a successful integration of the 3M food safety business.\n\nAnd then to see what will be next. And I'm not done just yet. I've committed to staying through the end of the 2023 fiscal year to assist in whatever way I can to assure a smooth transition. As I exit, I'll still be a shareholder, and I plan to continue to be one going forward.\n\nI've always appreciated the support the investing community has shown me and the company over these past nearly 12 years, and I thank you all for that. John?\n\nJohn Adent -- Chief Executive Officer\n\nThank you, Steve. Now, I'll open up the floor to any questions you may have.\n\nOperator\n\n[Operator instructions] The first question comes from David Westenberg from Piper Sandler.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nCongrats, Steve. It's been nice working with you, and it's nice to read that I think I still get to work with you until May. So plenty of time to keep chatting. So before I get into the knits of what an analyst has to do and does my responsibility to give those knits, I'll just thank you -- congrats to you guys on closing this on time.\n\nAnd you had a lot of work to do all this stuff, and congrats on it. So, anyway, I'm going to start with this $300 million EBITDA target. And I know you mentioned, you're still kind of assembling the way to think about it. Are we pushing out the timeframe to that $300 million? Or is it maybe you're going to give a number lower than that? I mean just any kind of way to think about what it is here? And then can you confirm that it is the 3M business that would be the culprit for kind of the changes of weighing to think about that $300 million?\n\nJohn Adent -- Chief Executive Officer\n\nYes. Thanks, David. So Steve and I talked about, we've had the business for about 28, 27 days, so we're learning more about it. The positive is we're finding a lot more synergies than what we even thought we were there before.\n\nThe negative was that the 3M business over the last couple of quarters has not performed to the way it was forecasted, when we kind of put out the initial $300 million. So what we want to do is take this time, sit down with that team, and we're doing it already, and really going over kind of the forecast, where the business is, where the opportunities are, what our executions are going to be on the 30, 60, 90-day plan, and then give you and the rest of the investor community a lot clearer picture kind of going into January of where we see the business going. And to your point, whether it's the bridge on 300 million or whether it's a timeframe to 300 million, that's what we're working through right now.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nOK. Can I -- maybe I'll ask another, kind of way. I mean, what about in terms -- I think when you laid out the borrowing case, we saw you borrowed $1 billion. I think you had about $300 million on the balance sheet, and then we had that $300 million estimate and you had -- leverage was going to be below 2.5.\n\nAs we think about leverage here, I mean is -- we're -- I mean if -- I know you can't necessarily say that even the number, but I think it is important to give some sort of framework in context of that leverage target. I don't know how comfortable you feel about getting that.\n\nJohn Adent -- Chief Executive Officer\n\nYes. No. I think that when we said I think on a net leverage basis, we were at 2.8, and then we had about $370 million in assets on the balance sheet in cash. So Steve and our expectation is, we are not going to be far from that.\n\nWe're going to -- I can't give you the exact number, but it's not going to be far from that 2.8 number. So we feel pretty confident that it will still be a very reasonable debt-to-EBITDA ratio for the business. Steve?\n\nSteve Quinlan -- Chief Financial Officer\n\nYes. No. I agree.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nOK. OK. Good. Got it.\n\nAnd then can we -- I know you only have that business for 28 days or so. I think the last S-4 was a few months ago. Can you talk about -- can you mention this, about the backlog and it being, if you wanted to clarify, it was a 5% headwind to that? Can you maybe give us the number at which it's been growing over the last couple of months, maybe what it is this exact month? And then kind of on a forward basis of that 3M growth rate of business? And I'm looking on to continue this question by maybe asking, if this is a backlog issue, can we expect some numbers above market growth rates, as you are fulfilling that backlog because it's kind of double sales? Because I would have to imagine your customers have to keep using these products, like I can't imagine they have to stop.\n\nJohn Adent -- Chief Executive Officer\n\nYes. No. That's right.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nMaybe there is some attrition. I don't know.\n\nJohn Adent -- Chief Executive Officer\n\nNo, David. So I'll talk about the back order situation and Steve can talk about the others. So, yes, we quantified the back order situation and it's about a 5% to 6% headwind that's been on the business for the last quarter or two. And we are working diligently with 3M to fix that.\n\nAnd the way that we are doing that was when 3M Food Safety was a part of 3M, they were a very small part in a very big business, so they are at the end of the line for manufacturing, they are at the end of the line for critical raw materials, they are at the end of the line for everything. As of September 1st, the role has changed, where 3M is our contractor manufacturer for these products. So we have been able to work with 3M to reprioritize kind of those things under the new reality of the business. And so, those are the things that we are seeing that are going to help us alleviate back orders much faster than what 3M, that team would have traditionally been able to do, they are now following their own.\n\nSo we feel confident and 3M has been a really good partner to help us move that forward. On the second part of your question, take this Steve.\n\nSteve Quinlan -- Chief Financial Officer\n\nYes. I think David, you asked if we'll get a kind of a kick in sales from the back order situation, I think it's really going to -- it will be gradual and it's really going to restore the growth to levels that we were contemplating when we signed the deal originally. But I don't know that you are going to get a massive bump in results. It's really just getting the growth back to where we think it needs to -- can be and needs to be.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nGot it. I'm going to hop back in queue, but I think Andrew probably has some questions and I'll take it from there.\n\nOperator\n\nAnd our next question comes from Brandon Vazquez from William Blair. Please go ahead.\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nHi, everyone. Thanks for taking the question and congrats on closing the 3M deal. John, you talked a lot about more of these new synergy opportunities, as you are kind of meeting the team and traveling across the new location. I was hoping maybe you could talk a little bit about where you are seeing some of these synergies either qualitatively or quantitatively, both on the sales and profitability lines.\n\nAny kind of additional details you can give us there would be helpful.\n\nJohn Adent -- Chief Executive Officer\n\nYes. So I think I'll give you anecdotal one, Brandon. So when I was at -- day after close I was in Europe, meeting with the team members, and when I went to the Bridgend facility, I was talking about that, I was touring the facility and the group has got bioreactors and they're making the separates and they're making this product line. And it's a 10-liter reactor and I go to Ireland and we've got four 100 liter reactors and the Megazyme team says, yes, we've already talked to that group and we're going to help them.\n\nWe'll take that over because we do it much more efficiently. We can do it a lot cheaper, we can send it to them. And so that was a big raw material for the Bridgend group that now we've got scale and efficiency in our other manufacturing that's going to help reduce kind of the costs. And those were -- that's just one of many, many things that we saw as the team members started talking and working together.\n\nAnd what I was happiest about was this is day three and they've already identified new opportunities and they already had a plan to execute on it, which I was really excited about, right? The teams aren't waiting, they're finding opportunities or documenting them and they're getting started. And so around broader, larger opportunities that's the stuff that we're gathering now, right? And that's the things that we keep telling everybody. Look, there's opportunities around make sure that if you have a question about why things operate something, ask, right? So I'll give you another example. I was in France and the group was complaining because they were forced to use a Pan-European distributor that was a larger 3M distributor, but that distributor had no food safety business, but they couldn't have a three, they couldn't have a food safety distributor because they were forced to use this one.\n\nWell, we fixed it, right? That automatically increase sales because now you have a distributor that knows the business, is tied to the market and isn't being driven by a larger organization, who had a relationship then with other product lines, right? So we just keep finding a little bit of opportunities like that to where once you carve this group out and get them more focused on what they do, they can make other decisions that will help drive the business forward. So putting all that together, quantifying it, and like I said, in January we're going to have a much better picture of what that kind of forecast looks like going forward.\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nAnd then in terms of going back to the kind of the back orders within the 3M business, is there any kind of timing that you could give us and how long it may take? It sounds like you may need to ramp some manufacturing internally. How long of a process does that usually take? And then kind of the follow-up to that is, correct me if I'm wrong, but I think the 3M business used to be more like a double digits organic grower. So how do you get maybe from that five to six points gets you into the mid-single-digits? What gets you to the delta to like a high single or a double-digit grower? I think in the proxies we -- in the filings we saw some other headwinds like China, Russia, Ukraine, any other kind of color you can give around those.\n\nJohn Adent -- Chief Executive Officer\n\nYes. So I think like -- it's going to take a little while, but I would -- our expectation is we're going to see easing on the back orders by the end of the second quarter. So we'll see some easing there. That alone is just the headwind of 5% to 6%.\n\nThe other things we have to do is continue to grow. And it was interesting because I thought 3M had a much larger share of market and sitting down with their team members when they were showing us the potential markets we can go into. The team has our share of market at about 18%, which gives us a tremendous amount of runway for indicator testing even more than what we were expecting. So there's big opportunities for us to continue to grow the market and take share from traditional methods, because that's really our biggest challenges on the traditional method side.\n\nAnd then even entering other market segmentations, where Petrifilm is applicable, and can be used that 3M didn't -- at that point, didn't want to go into those markets, which are markets that Neogen is already in. So these are big opportunities for us to accelerate those growth rates with the current business model.\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nGot it. And then last one for me is kind of pivoting a little bit and appreciate it maybe a little difficult to maybe take out a crystal ball here, but a lot of investor concerns kind of around recessions especially as we head into calendar '23. Love if you could just talk a little bit about how resilient your businesses may be the food safety and animal safety businesses may be during a more prolonged recession than what we're seeing today. And if those businesses can still kind of grow on a year-over-year basis?\n\nJohn Adent -- Chief Executive Officer\n\nYes. And I think it's a great question, Brandon, and I think you can go back and look, if you look at during the last time we had a slowdown in 2008 to 2010. If you look at Neogen's growth, we continue to grow. And the reason for that is, even in a recession, people need to eat.\n\nIt's not a discretionary item, right? I'm not eating today. I mean, maybe if you're fasting, but I don't do that very often. So I think there's opportunities for us to continue to find ways to grow in a recessionary environment. And I do think, we're heading there, right? I think we see it, I think you can see it around capital equipment.\n\nWe mentioned that our placements for Solaris were lower than the past. I think people are preparing, we're talking a lot about it. I think inflation is impacting other businesses. They're tightening their belts.\n\nBut even I saw a great report that came out of Wells Fargo the other day that was talking about how food companies perform during in recessionary environments. And it's not that we are not impacted, it's just that we are not impacted as much. And I think, Neogen's ability to grow whatever the market situation has been kind of our trademark and our hallmark. And I think, that's something that we pride ourselves in.\n\nWe're 121 out of 127 quarters of growth. And so as we head into a tough environment, whether it's currency headwinds, whether it's recession, we know that we find ways to continue to grow, because we've got a really strong resilient based market. And I think, we're blessed that we're in the right markets. But we also work very, very hard to find opportunities and to continue to meet customer needs and find new ways to be creative to help customers in these tough times.\n\nBecause when the times are tough is when customers are really looking for creative solutions. When everything's great, everybody's making money, the resistance to try new things and change is very low. So we have a really good opportunity to now position the new organization with our breadth of solutions and portfolios to really bring something new and exciting to the market when they're looking for something new and exciting because their end market is a little more challenging.\n\nOperator\n\n[Operator instructions] And our next question is coming from David Westenberg back from Piper Sandler. Please go ahead.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nThank you, guys, for the follow-ups here. So can you talk about -- because there is kind of a big delta between constant currency and the growth rate that looks like it's more than currency. Can you talk about how much -- sorry, the organic and the constant currency one. So can you talk about how much M&A was in food safety business and for us that are not perfectly math inclined, if you could.\n\nMaybe just give us a number of the acquired business in that food safety? And then obviously not the 3M, but what was in the prior quarter?\n\nJohn Adent -- Chief Executive Officer\n\nSure, David. On the food side, there's about $1.4 million of acquisition revenue and that's the Gulf and the Neogen Thailand business. And then on the Animal Safety, it's more about $2.1 million.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nOK. Perfect. Thank you so much for that. And then as we talk about -- you gave that kind of that context of like you can be hit and you do think that there would be incoming recession.\n\nAs we think about fiscal year 2023, is this a more mid-single-digit growth year for macro? And I'm not saying your business specifically, I'm just thinking about the businesses that you operate in. What's kind of the longer-term way to think about the business in food and animal safety? I know you have historically said food safety I think is 8% to 10%, animal safety is 6% to 8%. Is that still the year-out way to think about it?\n\nJohn Adent -- Chief Executive Officer\n\nYes. I think we have had some really good years on the up trail for animal safety for growth, because we had three really bad years. So we have talked about David, the cyclicality of that business and kind of how it moves. So I think that we are kind of at the peak of that.\n\nSo we may not see, as that stronger growth rate going forward in animal safety. Food safety to me is harder to say, because while we are entering what I think is going to be a tough environment from a recession standpoint, I don't know, on the 21st, the Biden Administration announced that they were going to -- they had a $2 billion investment to strengthen global food security and they are putting $2 billion behind it. And so that's a huge tailwind for us. Now there is no details as to what it is.\n\nSo I'm not quite sure whether that's going to help with our analytics platform or whether it's going to be around our blockchain solutions or whether it's going to be around our supply chain solutions for our customers or whether it's going to be around increased testing, because we have seen more food-borne illness. We just saw a big recall on listeria the other day. So I'm unsure as to where that's going to go, but that commitment with that type of money in food security is a huge tailwind for Neogen. So I'm trying to balance that with kind of the recession on the environment side.\n\nSo I'm not willing to say that, we're going to slow down yet. I know it's going to be challenging, but we have got some tailwinds that could help push us right along. So I'm unwilling to go and tell you, yes, David, knock that back three points or four points because we've got some positive stuff that I see that I just don't know how to quantify yet.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nYou actually took my last question, but I'm going to ask it anyway. And that was going to say, a couple days ago, we did see the hunger -- I think it was called, the Hunger, Nutrition & Health initiative. Anything, anything there to spot, anything that you see in there? I know Jim used to talk to a lot of the centers. What was the act in 2000 -- I think it was the Food Safety Service Act.\n\nJohn Adent -- Chief Executive Officer\n\nYes. Food Safety Modernization Act.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nModernization Act. I know that was a tailwind for the business. Is there anything in there that to call out and I know you just kind of answered that, but don't know if you have to say something...\n\nJohn Adent -- Chief Executive Officer\n\nNo. You're right. So that particular one was $220 million for feeding programs for schools, but that was part of this $2 billion set aside. And we've had meetings, I know our governmental affairs group has met with Secretary Vilsack.\n\nWe've had opportunities to meet with the FDA, FGIS, and really the government groups, and they're laying out this platform. But I think what's obvious is that everyone is very -- and you saw a little bit, I don't know if you've seen it, but I mean, there are a lot of questions around congressional questions around the FDA, right? How do we improve the FDA on food? So all of those things are tailwinds for Neogen. Now, they haven't specifically said what that money is going for, but with our breadth, you know that part of that's going to be a positive for us. So we're working on it.\n\nWe're actively involved with the government agencies to see how we can help and the direction they want to go and help set policy because we think that's a really big opportunity for us.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to John Adent for any closing remarks. Please go ahead.\n\nJohn Adent -- Chief Executive Officer\n\nGreat. Thank you. So, again, appreciate all of you being on the call. Once again, I want to thank Steve for just doing a great job over the last 10-plus years.\n\nHard to compete with the grandkids, that's what I learned. We worked really hard to try to convince, but hard to compete with the grandkids. So we're excited. And, Steve, as you mentioned, going to stay a shareholder and we've got a really nice transition put together.\n\nSo really going to long time to make sure that's successful. Lastly, just a reminder, get your proxy votes in the Annual Shareholder Meeting is Thursday the 6. And we look forward to talking to you all again on our second quarter call in January. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Adent -- Chief Executive Officer\n\nSteve Quinlan -- Chief Financial Officer\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nMore NEOG analysis\n\nAll earnings call transcripts"
}