{
  "companyName": "Kimberly Clark",
  "companyTicker": "KMB",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/kimberly-clark-kmb-q3-2022-earnings-call-transcrip/",
  "content": "Kimberly Clark (KMB -1.09%)\nQ3 2022 Earnings Call\nOct 25, 2022, 10:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for your patience in holding. We now have your presenters in conference. [Operator instructions] It is now my pleasure to introduce today's first presenter, Brian Ezzell. Please go ahead.\n\nBrian Ezzell -- Vice President, Financial Planning and Analysis\n\nThank you, and good morning, everyone. Welcome to Kimberly Clark's third quarter earnings conference call. With me today are Mike Hsu, our chairman and chief executive officer; and Nelson Urdaneta, our chief financial officer. This morning, we issued our earnings news release and published prepared management remarks from Mike and Nelson that summarized our third quarter results and 2022 outlook.\n\nBoth documents are available in the Investors section of our website. In just a moment, Mike will share opening comments, and then we'll take your questions. During this call, we may make forward-looking statements. Please see the Risk Factors section of our latest annual report on Form 10-K and our latest 10-Q for further discussion of forward-looking statements.\n\nWe may also refer to adjusted results and outlook, both of which exclude certain items described in this morning's news release. The release has additional information about these adjustments and reconciliations to comparable GAAP financial measures. And now I'll turn it over to Mike.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nAll right. Thank you, Brian. Good morning, everyone. Our teams around the world continue to execute strongly in what remains a dynamic and challenging environment.\n\nI'm pleased with our continued organic sales growth momentum with 5% growth in the third quarter, reflecting broad gains in all of our segments. Our third quarter results also reflect ongoing volatility in the operating environment, which continue to pressure operating margin and earnings. Throughout the year, we've taken decisive action to offset persistent inflation with pricing and cost savings. We're making progress as those initiatives enabled sequential expansion of gross and operating margins in the quarter.\n\nAs we near the close of 2022, we're maintaining our sales and earnings outlook for the year. We continue to manage our business with discipline and remain confident we'll restore our margins over time. We're executing our growth strategy to elevate our categories and expand our markets by putting the consumers front and center. We'll continue to invest in innovation and our commercial programs to continually sharpen the value proposition of our brands.\n\nWe're committed to delivering balanced and sustainable growth over the long term as we work to fulfill our purpose of Better Care for a Better World. With that, we're ready to address your questions.\n\nOperator\n\n[Operator instructions] We'll take our first question from Lauren Lieberman with Barclays.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nGood morning, Lauren.\n\nNelson Urdaneta -- Chief Financial Officer\n\nHey, Lauren.\n\nLauren Lieberman -- Barclays -- Analyst\n\nGood morning. Hey, I was hoping if we could just start out with an update on the input cost outlook. You've held the outlook for the year. There's one quarter to go.\n\nBut just we see it looks like pulp is kind of flattening out in terms of market data, but there are industry participants that has sort of said otherwise. We've gotten a lot of questions in the last few weeks about European energy prices, how that impacts your business. So any color you can provide would be great. And also, I know it's early, but looking into 2023 as well.\n\nThanks.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. I'll start maybe, and Nelson will give you his perspective. But overall, I'd say it's stabilizing, but at the high level, and we're still experiencing some volatility. So I don't know if, Nelson, you want to give a little more texture.\n\nNelson Urdaneta -- Chief Financial Officer\n\nSure. And Lauren, I mean, a few things there. I mean, we've held our guidance for the full year and the $1.4 billion to $1.6 billion. And it's important to note that through the first nine months of the year, we've seen about $1.2 billion of these costs materialize.\n\nWe did see sequential improvement in terms of the impact as we lap last year's $1 billion out of the $1.5 billion that impacted us in the second half of the year. So for the quarter, you would have seen a $360 million commodity impact versus $470 million in Q1 and $405 million in Q2. So the trend that we had talked about is playing out in Q3. Secondly, overall, we're not calling down because the reality is commodities remain elevated.\n\nThe environment remains quite challenging, and we're maneuvering through it. We've seen overall a few dynamics that I'd like to highlight. First, on the pulp and fiber components, prices remain pretty elevated. Eucalyptus is trading today at around $1,600.\n\nThat's an all-time high. And we -- while the market is projecting for some easing at the end of this year, we have yet to see that play out. If we look at distribution costs, those remain challenging as well, especially on the international front. We have seen some giving up prices on spot transportation in North America, but still, that's not offsetting the overall challenges we're seeing on a global basis.\n\nSo net-net, we remain at the guidance that we had provided. And the messages I would say in terms of next year, right now, it's too early for us to provide any guidance on 2023. We'd still have the full year to play out. But a few thoughts that I'd share.\n\nOne, we remain at historical highs in the whole commodity and cost structure. As a reminder, on a two-year stack, with $3 billion at the midpoint of our guidance today. And again, we have not seen any meaningful move versus our assumptions that we gave you back in July. Secondly, ForEx markets.\n\nWe have seen, and you see it in our -- in the deconstruction of our numbers. ForEx has become more volatile and challenging. And as a reminder, we have about a third of our profits coming from overseas. So that is something that we are taking into account in our outlook, but we will have to carefully watch as we think about next year.\n\nThe underlying business environment remains volatile. As Mike said in his opening remarks, we're managing through it, but it's something we will take into account again over the next few months as we prep up to give you guidance in January when we talk about Q4.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nLauren, you may have gotten more than your bargain for on that question.\n\nLauren Lieberman -- Barclays -- Analyst\n\nNo, it's great. I'll always take it. Thanks.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nAll right. Thank you, Lauren.\n\nOperator\n\nThank you. [Operator instructions] We'll take our next question from Kevin Grundy of Jefferies.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nHey, Kevin.\n\nKevin Grundy -- Jefferies -- Analyst\n\nQuestion for me, just kind of zooming out a bit, Mike, just observations on kind of the elephant in the room, right? Observations on consumer demand and then elasticities. I guess as we kind of look at the quarter, elasticities are a bit better in tissue and towel, worse in personal care, at least versus our model. So maybe just comment on what you're seeing from a consumer perspective, any signs of consumer weakness that are at all worrisome to you? And then maybe you could just share your own thoughts on how the elasticities in the quarter came in relative to your own expectations and thoughts as we look ahead. Thanks.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nOK. Yeah, Kevin, you have to guide me a little bit. I've got a lot of thoughts here. So I'll give you a few things.\n\nI mean, one, I do want to emphasize, I feel very good about our strong execution of our strategy in what remains a very challenging and dynamic environment. The continued organic momentum I feel very good about. Obviously, we were a little soft on North American personal care, which I can come back to you, but that was -- I think consumption was fine. It was more around some inventory changes cycling some supply constraints that we had last year.\n\nBut overall, I think we had excellent execution of our pricing initiatives globally and great brand support through our commercial programs. I think it was in the prepared remarks, but high single digit across all developed markets, high single to double-digit growth across all key D&E markets. And then North America, as you saw, was down too because of some of the supply changes. On top of that, I'd say we feel very good about our share performance.\n\nWe're up or even in about half of our categories, a little bit more than that in personal care. And we were very fast on pricing. We've been very decisive on pricing all year. And so we knew we're going to give up a little share in the near term.\n\nAnd it does look like our share performance is improving in the latest quarter. And so we like where the trends are going and feel good about that. And then lastly, I'd say, on the overall environment, we're navigating some shipment volatility, particularly in North America because of the Texas storm and everything that happened last year. So that's kind of the overall on us.\n\nAnd then with regard to the consumer, I would say, overall, I feel like the consumer remains resilient, but we are increasingly seeing some bifurcation in demand. And I don't know if I like that word, but it's -- I'm just trying to describe that we're seeing two different patterns emerge. And it's mostly along, as you would expect, having socioeconomic lines. I mean, certainly -- hence we do the research in a developed market like in North America, there's a broad swath of consumers that their savings are still higher than they were three years ago.\n\nThey're employed. And while they may be curtailing some big-ticket purchases in our categories, which are essentials, we're not seeing a discernible change in behavior there. However, there's about 40% of the population in the U.S. that is more living paycheck to paycheck.\n\nI grew up in one of those households and I know what it's like. And so we are seeing some changes in the consumption patterns, whether that is buying lower count packs or trading down a bit. But I would say the important thing for us is to recognize that we're trying to serve our consumers and meet them where they need us, and that's both sets of consumers. And so our premium business continues to grow and do well.\n\nAnd then we've got a -- we've got a make sure that we're addressing the right value -- having the right value proposition for the value -- more value-oriented consumers. So there is some, I would say, bifurcation. We saw that happen about three years ago in a lot of markets in D&E, but we are seeing a little bit more of that in developed markets. I'll pause there.\n\nKevin, anything to add?\n\nKevin Grundy -- Jefferies -- Analyst\n\nI'm sure there's other questions into queue, Mike. That's really helpful. I'll pass it on. Thank you.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Chris Carey with Wells Fargo.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nHey, Chris.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nHi. Good morning. I just wanted to follow up on that line of questioning around volumes, specifically in personal care, but perhaps from a bit different angle. It's harder for us to see, but just taking what you said about commodities and what we know about pricing, it doesn't look like you've experienced much notable volume deleverage to gross margins this quarter from the weaker volumes, but certainly, the operating margin performance was different.\n\nCan you just frame how do you think weaker volumes to the extent that sustains are expected to impact your P&L as you go forward, specifically between the gross and operating margin line? And just connected to that, how you would envision addressing some of the weaker volume performance that we've seen, whether in demand building? Or is it simply that your algorithm will change between pricing and volume such that you're still achieving your overall organic sales growth objectives?\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. Let me start and maybe Nelson can talk -- give you some more of the texture. But I'll start with -- let me unpack the volume performance, particularly, I think it's probably -- everyone's probably got a question about North American personal care. And I'll say our North America team is doing a great job navigating what I would call excess volatility in demand.\n\nAnd really I think we put this in the remarks, consumption remains stable. And so just for reference, Chris, in the third quarter, our all-outlet consumption, which I don't think you see, we were up 4% in diapers on consumption, 9% in adult care, and 16% in fem care. And the real fact is, and I mentioned before, the storm that occurred in Texas last January, February, shut us down for a few weeks in early Q1 and created a lot of volatility in shipments. I'll give you a sense of the volatility.\n\nIf I go back to the fourth quarter of 2020 and then give you other quarters, just in diapers, our consumption in December of 2020 was -- or the fourth quarter was plus 6%, then we were minus 7% in the first quarter, plus 7%, plus 8%, plus 18%, plus 14%, and then plus 6% last quarter. So you could see there's been a lot of movement. And I would say it took us a while to recover from our supply constraints. You would think that being down for a couple of weeks, there was more of the roll through it because we had material supply issues as well.\n\nAnd so we were on allocation for most of last year. And so what happened in this quarter is you can see our consumption was stable, but we were cycling, I would say, elevated shipments in the year-ago period as retailers were rebuilding their inventories following -- being on allocation. So overall, I feel very good about our offering across personal care, as you can see by the consumption numbers. I do expect some ongoing volatility in demand as we continue to work through various supply challenges and cycle some of the things that happened last year.\n\nAnd then in terms of the volume deleverage, yes, certainly, yes, we're -- fixed costs are a big component of our P&L. So we're close to that. Again, I would say I'm not expecting in personal care North American ongoing volume issue. This is, I would say, more of a one-timer.\n\nAnd then globally, we feel very good about our volume performance and our elasticities have held up to the model in general. D&E, our volumes were down high single digit. We think most of that was concentrated understandably in Eastern Europe, given the conditions that are happening there. And so overall, I think we're feeling good about our volume performance.\n\nBut Nelson, you want to give us some more texture.\n\nNelson Urdaneta -- Chief Financial Officer\n\nYeah, absolutely. So a couple of things there that I would highlight, Chris. I mean, one, the pricing realization that we had in the quarter really accelerated. So that's flowing through.\n\nAnd you can see that in the margins, which you rightfully point out. And that is something that we were talking about back in July based on the pricing actions that we had taken midway in the latter part of Q2 and also in Q3. So that's more than helping offset some of the deleverage that you would see on the overall business. Secondly, we begin to lap some of the commodity increases from last year, not that commodities are deflating, but they begin to not be as high in terms of the impact year on year.\n\nAnd those two are playing out for us to have for the first time in several quarters, a net pricing -- favorable realization net of commodities and ForEx. That's one thing. Secondly, if you look at our segments, the only segment where we saw a drop in margins for the quarter was really personal care. And that had to do with one, the one-offs that Mike's talked about, and we factored in some of those as we go into Q4, because some of those, we do expect to maintain as we go there.\n\nBut then secondly was the fact that, yes, we had a little bit of a mix as well in there because North America personal care is our most profitable region within the segment in personal care. So that factored in into that one, which would have been that. Obviously, we continue to be very watchful of overall costs and fixed costs. And the teams are doing all the actions necessary to ensure we address that.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nOK. Thank you very much for that. If I could just on just how you would, in addition, addressing some of the volume pressure appreciating that there were certain dynamics in the quarter, which will fade as we go forward because of the base period, but just philosophy on addressing volumes. I know there's been some debate in recent quarters just around what is the right promotional levels and requirements for demand building.\n\nSo perhaps you could just contextualize how you would look at supporting volumes over a sort of more medium-term horizon? Thanks.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. Chris, again, I feel very good about our commercial execution around the world. I mean, we had strong innovation this year. I feel great about our lineup for next year, even though we're not talking about next year yet.\n\nBut -- and I think we feel very good about our advertising. Our digital investments are working very hard for us. And then our sales execution has been very, very strong around the world. And so overall, I think our commercial programs overall are working as intended.\n\nWe're going to keep a close eye on the promotional environment, though. I'll comment in terms of North America, I would say the environment at this point remains fairly typical, and that's kind of -- it's rebounded from being I would say, more suppressed during the peak years of COVID and is now, I would say, normalized in terms of promotional frequency, maybe still a little lower on depth. And frankly, we're not going to drive our business by driving depth. It doesn't fit with our high-road approach to building the brand.\n\nAnd so -- but we're prepared. And one thing I'll add, though, too, is I think we're being prudent in developing the right kind of action plans in the case of a more recessional environment. And so as I mentioned, we're going to -- our strategy is to elevate and premiumize our categories over time. That is exactly the right long-term strategy.\n\nAnd I think that's going to be our strategy for a long time to come. That said, we recognize the environment we're operating in, and we've been very good at running, I would say, more value plays when necessary. But our goal is to make those productive and profitable as well while addressing the needs that the consumers have.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nOK. Much appreciated.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nThanks, Chris.\n\nOperator\n\nThank you. Our next question comes from Steve Powers of Deutsche Bank.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nHey, Steve.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nGood morning. And apologies, you may have been talking a little bit about this with Chris. I got called away from the call for a brief second there. But -- just as you march from 3Q to 4Q, it implies, I think, either a lot of SG&A leverage or really big step-up in gross margin sequentially and year over year.\n\nAnd I guess I'm just -- I guess when I play that back to you and figure out kind of what the main drivers are? Because I get that the inflation gets a little bit less impactful as you go 3Q to 4Q, FORCE picks up. But it just seems like you need some other variables to really move the needle as much as I think is implied in the guidance. I just want to play that back to you.\n\nNelson Urdaneta -- Chief Financial Officer\n\nSure. So Steve, I mean, a couple of things I would highlight. I think first, I'd start by reiterating what happened in Q3, and you would have seen an acceleration in overall pricing realization. And as you mentioned, our expectation, which played out in Q3 of the year-over-year impact of commodities beginning to subside, even though they remain elevated.\n\nSo as we look into Q4, our outlook in which there is an implied step up like what we saw in Q3, the drivers behind it would be, first, is around pricing realization. As a reminder, we've implemented additional pricing actions in the third quarter, and those will be fully realized as we go into the fourth quarter. So we do expect in the fourth quarter another step-up in terms of price realization as we look at our overall outlook. So that should be playing out in the quarter.\n\nSecondly would be on our FORCE productivity savings. In the third quarter, we delivered $80 million of FORCE savings, which is an acceleration of around $30 million versus the average we were delivering in Q1 and in Q2. We expect this trend to continue going into Q4. And then last but not least, is stabilized input cost inflation.\n\nAgain, this does not mean that we expect overall cost to come down. It's more of the year-over-year impact. As of today, we have a year-to-date impact of around $1.2 billion in commodities. And at the midpoint of our guidance of $1.4 billion to $1.6 billion for the full year, this would imply that for Q4, we should see another quarter of a reduction sequentially in terms of overall input cost inflation.\n\nSo when you combine those three, that's what gives us the building blocks for the continued step-up sequentially quarter over quarter on EPS for the fourth quarter. I think it's also important to note that for the full year -- for the full year at the midpoint of our cost guidance, we are at around $1.5 billion of input cost inflation. And as we exit the year, we expect to more than fully offset not just the commodity impact, but also the ForEx based on our current assumptions and what we've modeled out. So that is something that will be planning on Q4.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nOK. Yeah. That makes sense. That's helpful.\n\nI guess the other thing that I wanted to ask about, and I appreciate that '23 is a long way away. You're not really talking about it. But consensus estimates have the company delivering above algorithm EPS growth next year, which I think implies that the price realization that you just spoke to continues to hold even as you get some hopeful relief on costs. And I wanted to get your perspective on just your comfort level with that level of assumption as you look at it.\n\nAnd especially in the context of -- I appreciate what you said earlier about sort of the timing impacts in North America and how that impacted shipments. But we are watching those private-label shares in personal care, specifically diapers pick up. Hopefully, that gets better. But as you push through more price and the consumer potentially degrades from a confidence perspective, concerns about that, those share trends not rebounding.\n\nAnd it just -- it speaks to if the deflationary backdrop does play out next year, do you have to roll back some of this price. So a lot in there, but just really thinking about the consumer demand trends, your pricing trends, net of commodities, and just some perspective on your comfort level with consensus being above algo next year?\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. Steve, maybe my comfort level is probably not comfortable addressing what '23 looks like yet. And I hate to do that. But I think the underlying is because of what we're seeing right now in the marketplace, which is, one, the volatility in the marketplace, which we experienced in Q3 and it's going to continue; and then the other part is we're still rolling out our plans.\n\nAnd so I really feel would love to comment, but I don't feel like in a place where it would be reasonable for us to comment at this point. I don't Nelson, if you have a different --\n\nNelson Urdaneta -- Chief Financial Officer\n\nYeah. No, I fully agree, Mike. And as I said to Lauren in terms of her ask, one of the variables that, again, we're looking into today as we build plans and everything is where we stand today. And the reality is commodities have not subsided.\n\nThey remain pretty elevated, and ForEx is becoming and has become a bit of a challenge as we look forward. We've got three months to go for the year, but it's a variable that we're going to have to take into account, Steve, as we look forward, too. So again, too early for us to comment, but those would be kind of my thoughts in terms of where we stand today.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. The thing I'll add, Steve, though, is we are continuing to manage our business with discipline, and we remain confident we'll restore our margins over time. I mean, as Nelson pointed out, we've taken on over the last two years, $3 billion of inflation, that's 1,500 basis points of gross margin, which is a lot. And we've taken decisive action.\n\nAnd the good news is, and we -- for the third quarter, our pricing fully offset inflation plus FX in the quarter. And so we do continue to expect sequential improvement. Commodities also -- as people who have been following us for a long time, commodities will eventually revert. We're not counting on that for our margin recovery.\n\nBut when that does happen, that will likely accelerate our recovery. So we're taking a thoughtful holistic approach to mitigating inflation and running our business. And hopefully, you all appreciate that.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nOK. I appreciate it. Thanks so much.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nThank you, Steve.\n\nOperator\n\nThank you. Our next question comes from Jason English of Goldman Sachs.\n\nJason English -- Goldman Sachs -- Analyst\n\nHey, folks. A couple of real quick housekeeping questions here. For guidance, I appreciate you reiterated EPS, but you didn't provide an update on your EBIT outlook. Can you provide that now? Has it changed at all?\n\nNelson Urdaneta -- Chief Financial Officer\n\nNo, no. In general, it remains where we're at.\n\nJason English -- Goldman Sachs -- Analyst\n\nExcellent. And then productivity, you have a nice uptick in the fourth quarter implied by the full year guide here on FORCE savings. What's driving the uptick, and would it be unreasonable for us to look at that and assume that that run rate continues through next year, therefore, implying that what was under delivery this year is going to be followed by over the year next.\n\nNelson Urdaneta -- Chief Financial Officer\n\nSure. So a quick one there, Jason. As we've said in the past, FORCE is not necessarily a straight line. We've never seen that in the past, and I don't project that that's going to happen in the future.\n\nBecause it just builds up over the year, and we do see ups and downs. Because remember, it is a net number. So it does build some of the -- some headwinds and costs that we might be facing. As you indicated, there is a step-up in Q4.\n\nAnd to me, the key to look at is what happened in Q3. In Q3, we delivered $80 million versus an average for Q1 and Q2 that was below 50. So the acceleration was there, and we delivered year to date $175 million. We expect to see further delivery in Q4 based on the strong pipeline of productivity that our teams have across the globe.\n\nAs we look into next year, yes, the teams are building up the gross productivity pipeline, and I'll stress that gross productivity pipeline. And again, we will be walking through the delivery as we go through next year. But I can't -- and I would not commit to whatever run rate we have exiting this year and Q3 being what we see in the first couple of quarters of next year. It's too early to say, Jason.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nThe thing I'll emphasize is, yes, it is a net number. And so our gross productivity has continued to climb. I think our teams are doing really a fantastic job driving the productivity. The issue we have is the inflation isn't just in our inputs.\n\nIt happens in all places of the P&L. And so some of it, unfortunately, gets nets out. So I could complain my teams around their overall net productivity, but that's kind of like complaining about like trucking lane rates or -- I mean, we don't like them, but some of that is not in their fully under control. And so we have to navigate that.\n\nThat's why we have to drive our gross savings higher.\n\nJason English -- Goldman Sachs -- Analyst\n\nYeah. Totally understood. Thanks a lot, guys. I'll pass it on.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nThanks, Jason.\n\nOperator\n\nThank you. Our next question comes from Andrea Teixeira with J.P. Morgan.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nAndrea, good morning.\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nHey, good morning. Just a couple of questions. Mike, can also -- if you can elaborate a little bit more on the price elasticity that are embedding in your guidance for 4Q. I understand that, obviously, it implies a huge decline in organic sales.\n\nAnd I do understand the comp for personal care. I believe it was 11% last year in the same period. So I was wondering if you can comment, it does look like your pricing at least in the Nielsen data seems a bit below peers. So I was wondering if there is anything embedded there in terms of promotions or -- and part of the also question on promo is your SG&A, is there anything that you'd call out specific in the quarter, if that's recurring into the fourth quarter? And then if there is any phasing or timing of it that you pulled from the fourth into the third.\n\nAnd then lastly, just a clarification on Suzano's to you. Are you getting any proceeds from the sale of [inaudible] and the sale of Mogi plant? So I was wondering if there is anything related to that or the royalties will pay off over time and you were going to be puts and takes on those or HSC material, so none of the companies are provided immaterial for you and for Suzano.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nOK. All right. That's great list of questions. And so let me -- we will try to tackle them between Nelson and I will tag team here.\n\nFirst of all, on the -- I think on the pricing versus peers, I think probably what you're seeing is the fact that we were out fastest generally in pricing in most markets. And so if you're seeing a lag there because we've already started cycling our pricing a year ago. I mean, the reality is, I think, in general, we've priced, I would say, very early, we moved very quickly on pricing last year. And I would say we also moved at higher levels than a lot of our competitors.\n\nAnd so -- and the reference for that is -- I think we've had a price gap, meaning we've been ahead on price on Huggies all year until I would say recently, maybe in the last couple of weeks or so. So overall, I think our pricing is in line with where we set it. And I think the good news, Andrea, is that in general, in most markets, we are seeing the market -- rest of market pricing kind of move generally in the direction that we've moved. That's not the case in all areas and -- but generally, that's kind of my overall take.\n\nIn terms of elasticity, I'd say in the first half, I think the volume performance really outdrove the elasticity models. And I think that's where I think the consumers are feeling confident. You remember all the unemployment reports and stimulus and all those other things that we're driving consumer confidence. I have seen a change in that in some markets.\n\nAnd so at this point, the elasticities that we're seeing are more \"normalized\" or what we originally modeled. And so we are seeing a bit more volume come out in relation to all the pricing. That's notable. And I would -- from my earlier comments on maybe the bifurcation, it's coming out a little bit more on more of the value-oriented tiers, let's say, Snug & Dry diapers for us, which is our value tier diaper in the U.S.\n\nor Scott 1000. So those are some things that we're going to pay closer attention to and make sure that we're managing the business in the appropriate way to serve our consumers where they need us. So again, that's the overall take. I don't know if -- I know there's a couple of other questions.\n\nI think Nelson will address some. But did that answer kind of the first part?\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nYeah. No, absolutely. That's super helpful. And the SG&A part, the component of that is just understanding as you try to scaffold and be more kind of conscious about that consumer that is stretched -- is there anything that we should know of? Like I think the SG&A your gross margin came in, I think, better than anticipated, but your SG&A was a bit higher.\n\nIs there anything that we should be aware of in terms of phasing of promo or marketing spend that's -- or is just inflation in general across all lines?\n\nNelson Urdaneta -- Chief Financial Officer\n\nYeah. Andrea, let me address that. So first, I think the important thing to look at is spending in absolute dollars for the third quarter for between the lines, which includes our SG&A and our advertising and promotion was roughly in line with what we saw in Q1 and Q2. So there was really not a big step-up or change sequentially throughout the year.\n\nThe thing that would have -- that you would have seen is an expansion in terms of percent year over year in terms of the between lines, and that was really driven largely because of last year's one-time adjustment to incentive compensation, which we talked about at the third quarter earnings call. So that was the lion's share of the change. It was a one time we were lapping. Absent that, as we've been saying all year long, we are continuing to invest behind the business.\n\nIt's the right thing to do. As Mike has said, we are fully committed to sustainable and long-term balanced profitable growth. And the only way to achieve this is to continue to invest in the business. We are investing behind our brands, we're investing behind innovation, we're investing behind capabilities and our people to ensure that we're there to go forward.\n\nThose investments are there, and we've continued to make them, but there was no particular step-up in Q3 versus Q2 or Q1.\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nOK. That's fair to you. And then the Suzano deal?\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. Let me make a couple of comments, not exactly your question, but I did want to address a couple of things related to the result tissue agreement. Overall, Andrea, hopefully, you'll recognize it's consistent with our overall approach that we've been talking about on portfolio management. I really believe we have a long runway of growth ahead of us in our categories and our markets.\n\nAnd we're going to pursue on the plus side, markets and adjacencies that are going to be accretive to our growth in margin. And I've always said for a few years now that we'll consider exits in businesses that are not accretive to our growth and/or margin profile that we expect. So this transaction specifically enables us to focus on our faster-growing, higher-margin personal care business in Brazil and creates a better future for both the Neve brand and the tissue business -- the Brazilian tissue business. The Neve business in combination with Suzano is really going to be better positioned to adapt to the unique dynamics of the local market.\n\nAnd we fully expect our partnership -- strong partnership with Suzano to continue well. I'll defer to Nelson. I don't think we're ready to comment on any specifics related to the transaction and --\n\nNelson Urdaneta -- Chief Financial Officer\n\nYeah. No, absolutely. And again, the only thing I would say is overall revenue from this -- from the transaction that's being divested is just around the 1% level, and profits are immaterial. So -- but other than that, we're not going to be disclosing any terms at this stage.\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nThat's helpful. Thank you.\n\nNelson Urdaneta -- Chief Financial Officer\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question comes from Anna Lizzul of Bank of America.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nGood morning, Anna.\n\nAnna Lizzul -- Bank of America Merrill Lynch -- Analyst\n\nHi, good morning, and thanks so much for the question. Just regarding the consumer sensitivity to pricing at this point. I wanted to follow up on your comment on consumer bifurcation. Are you seeing premiumization holding up well in certain categories versus consumers [inaudible] and others? And -- are you seeing any specific products holding up well, which indicate consumers are willing to continue to pay for premium solutions despite a more challenging inflationary environment.\n\nThanks.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. I would say -- and it's less differences by category. I would say, in general, where we're driving premiumization is generally working across markets. And so not specific there.\n\nI think it is more typically by sub-brand or sub-line or what we might call internally our tiers, right? Like the value tiers tend to be a little bit more price sensitive in this environment because, as I was mentioning earlier, there are a significant number of households, let's say, in the U.S. that are -- have less to spend now given all the inflation that's occurred over the last couple of years or so. So I think it's more on a sub-brand basis or a tier basis in our vernacular -- and that's where I say, working to continue to drive our premiumization strategy or creating more value through our premium products. We feel great about our innovation lineup this year.\n\nAs I mentioned, we've got a lot of more coming next year with great features that I think consumers are really going to like. That said, we're also making the right adjustments as we said earlier, that to prepare for a recessionary footing if needed. And that means that emphasizing the great value that our brands offer. And in some cases, we will make some adjustments, whether that's related to pack count or sizing or something along those lines to make sure that consumers have the right pack and affordability that they need.\n\nAnna Lizzul -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Any specific product lines you can call out as seeing resilience in those?\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nWell, Huggies. Again, I think we feel great about our diaper lineup -- our adult care lineup in North America. But if you go around diapers, China, we continue to have mid- to high single-digit growth, double-digit growth in feminine care. And so we feel good about that.\n\n[inaudible] where consumers are very value-oriented because of what's happening in the economy last few years and our organic performance was up strong double digits in the quarter. So overall, across our markets, we saw strong organic growth, and that's because we feel that we've continued to improve the products. At the same time, we are recognizing that we are taking price to offset the commodity headwinds.\n\nAnna Lizzul -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thanks very much.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question comes from Javier Escalante of Evercore\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nGood morning, Javier.\n\nJavier Escalante -- Evercore ISI -- Analyst\n\nGood morning, everyone. I would like to come back to the U.S. And if you can, Mike, comment on how you see retailers approaching pricing and the profitability of their own private label operations in tissue versus diapers. And I have a follow-up.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. Javier, welcome to our coverage, and we appreciate it. And this is something I've talked about over the years. We have a very productive and collaborative relationship with our retail partners.\n\nAnd I've been doing this for 30 years and been through many cycles. And so we approach it and notably, let's say, in the U.S. I think the big change that occurred for us at over the last 10 years is we recognized we had to clean up our own house. We've been very focused on growing the categories and working with our retail partners to grow the categories the right way and it's reflected.\n\nI mean, we're really proud to note that in the advantage survey for the first time, we were rated No. 1 as a customer organization and No. 1 across most disciplines because I think our customers' view that we've been working with them in a partner-like fashion. Funnier side, I will say, in the first quarter of last year, I think our service levels in diapers was below -- far below 50%, and somehow in other of these publications rated us No.\n\n1 on logistics last year. And so I think that does reflect kind of the way we work with them. And so when you take that, I would say, we generally approach business planning with our customers on a growth basis for both their sales growth and their profit growth, and we pay attention to their margins as much as we pay attention to ours. And so for us, we're working for win-wins.\n\nAnd so I wouldn't say regarding, let's say, for your question, whether it's diapers or private label, anything different that we're seeing in terms of the profit play of them trying to change distribution or emphasize different lines. But we are very cognizant that we're trying to deliver an overall category growth plan and own our part of that. And because of that that's kind of how we manage the plan. And so -- and then with regard to price sensitivity, yes, I mean, there's been a lot of price coming at it.\n\nWe have a fair number of customers that skew more toward value shoppers and that's their role to -- in their minds, serve the shopper as well, and so we understand that. And so we're willing to work with them. But we recognize also there has been a lot of price in the marketplace at a necessity. And so the important thing is we feel like we have to recover they recognize that they need to deliver margins and growth the same way that we do.\n\nAnd so we're going to continually work for ways to find the win-win and grow the categories the right way.\n\nJavier Escalante -- Evercore ISI -- Analyst\n\nThat's great to know. And then basically, Mike, again, on tissue versus diapers, you feel I mean, from the outside, that Scott is very clearly positioned on the value side. Huggies has been premium and I appreciate that you mentioned that I believe a competitor just follow price increases and that we do not have an all-channel view. But if you can walk again on the drivers of your confidence that Huggies didn't take too much pricing and you are competitive on the pricing front vis-a-vis your main branded competitor and private label because, in our data, we do not see private label following price increases.\n\nThank you very much.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. Huggies, I wouldn't say -- again, I would -- correct, we've priced, as I said, our goal is to restore margins and eventually expand margins over time. So we've priced accordingly with the right discipline and we're very cognizant of our product offering and our lineup and our commercial programming. And one of the reasons we've priced is that -- and I think we've talked about this with our customers is we feel like it's our role to help grow the category and drive category growth, and that requires marketing.\n\nI've worked in other categories that when they pulled back the categories commoditized, and that's not a good place for brands. And so we've been very disciplined about that. So what I did say is that we felt like we had a price gap or we advanced pricing further and faster than some of our other competitors earlier this year, and last year as well. And so there was a bit of a gap.\n\nThat gap is now -- I think that's basically closed over the last few weeks. And so -- so we would probably see -- anticipate slightly better performance on Huggies. And again, we feel very good about our innovation lineup, the value we're offering to consumers. We are going to pay a little more attention to Snug & Dry, which, Javier, is our value tier in the U.S.\n\nAnd so make sure that that has the right accounts and the right price points on shelf that can compete effectively.\n\nJavier Escalante -- Evercore ISI -- Analyst\n\nThank you very much.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nOK. Thank you, Javier.\n\nOperator\n\nThank you. Our next question comes from Jonathan Feeney of Consumer Edge.\n\nJonathan Feeney -- Consumer Edge Research -- Analyst\n\nHi. Thank you very much. Hi. How are you doing? Just for a quick follow-up.\n\nEarlier in the call, you mentioned that you thought promotional activity was back to something like normal, let's say, pre-COVID normal. And I look at -- specific data providers, Nielsen IRI have this measure of merchandising that would seem to indicate across the company in the U.S. anyway that that merchandise was still several points. So it's like mid-30s, but the measure they use, and now it's like high 20s or something that it off a low of like 20% when at the peak of demand.\n\nSo any comment you can give us about the likely shape of that and impact restored promotional activity might have on demand? And secondly -- that's a follow-up. And secondly, related question maybe, you talked last week about household inventory. And I know different companies have different ways of measuring that. Earlier, you mentioned something about all channel consumption.\n\nI'm thinking that's still a takeaway data -- measure. But if you have any color about where you think household inventory stand U.S., globally, and what impact that's having on potential future demand in '23. Appreciate it.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nYeah. So a couple of things in there. I mean -- and I would say, well, if you go into Nielsen and longer, but I used to be the highest user of Nielsen throughout my career. So there are so many variables that are related to promotional -- measuring promotion.\n\nAnd so -- so what I said earlier, Jonathan, was frequency kind of returned to normal in tissue probably in 2020, the third quarter were -- but maybe by the end of last year. And then in personal care, I would say, at the beginning of this year, and that's in terms of frequency. The volume -- and I would say the other key measure is depth. And I would say depth is shallower both in personal care and tissue than it historically had been and remains so.\n\nAnd I think that's an artifact of all the inflation that all the companies are seeing. And then if you look at the percent of volumes sold on promotion, it's a little bit lower, right, slightly lower, which is, I think, corresponds to what you were looking at. So overall, that's why I say I put promotion \"normalized\" but it's probably still a little bit lower than historical at this point. So that was, I think, part one.\n\nAnd then any follow-up to that, Jonathan?\n\nJonathan Feeney -- Consumer Edge Research -- Analyst\n\nNo, that makes a lot of sense to me. I also confess to spending way too much time with syndicated data. So it's nice to have a full picture.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nNo, no. I'm proud. I feel like I invented half of these measures. So – but --\n\nJonathan Feeney -- Consumer Edge Research -- Analyst\n\nYou probably did.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nThe other side that you asked about was inventories. I mean, there's a couple of points. Certainly, I mentioned earlier, we are cycling some retailer inventory build back. And at the same time, and I think we mentioned in our prepared remarks, there was some retail inventory reductions late in the quarter.\n\nAnd so that was a topic that came up at the last investment conference that I was at. And so that remains out there. And I would say that it's typically the case. Every other year or maybe every year retail inventory changes, and that's part of what we get paid to manage on.\n\nIn terms of the household inventories, we think they've reverted back to normal. There was -- and really where it was really relevant was on consumer tissue, there was quite the buildup, I would say, self-critically, I don't know that we were very good at predicting how the household inventories were going to evolve. But I think over the past years, and there was a lot of volatility in the tissue demand. I think in the second quarter of 2020, I think our tissue demand was up -- back tissue was up 30%.\n\nAnd then a year later, it was down 27%. So again, that tissue historically is very stable and goes with -- certainly, volume growth goes with highly correlated to population growth. At this point, we feel like it has reverted back to normalized levels. But it might be fair to say that there's a lot of people carrying more that tissue than they were three years ago.\n\nJonathan Feeney -- Consumer Edge Research -- Analyst\n\nOK. Thanks very much. Helpful.\n\nOperator\n\nThank you. Our next question comes from Lauren Lieberman of Barclays.\n\nLauren Lieberman -- Barclays -- Analyst\n\nI'm back. It's OK. I can let it go to -- I'll follow up offline. Then I guess, we've come in a couple of different ways through different series of questions and so on.\n\nBut I guess, how do you think about volume versus pricing versus market share? Because I think one thing that I get asked about quite a bit with regard to your business, in particular, is sort of, hey, but don't you see private label and my read is that, yes, that's a dynamic of your categories. It always is in economic cycles. It's what you -- it's what you'd expect to happen is it private label would gain some share there be some change in consumer behavior. So I don't know how you could answer this.\n\nBut as you look at how to manage through the continued high levels of inflation as you put in the incremental pricing that you mentioned this quarter, is market share the right gauge for you to judge kind of the health of the business at this point? Is it aggregate organic sales growth? What are the metrics by with if you've gone too far or not gone far enough?\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nLauren, such an awesome question.\n\nLauren Lieberman -- Barclays -- Analyst\n\nThen I'm glad we waited.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nThis is the age-old problem of management in the consumer business. And that's why it goes back to what we've been saying for years now. We remain committed to delivering balanced and sustainable growth for our shareholders. And so -- and it's been interesting as we've unpacked this for the organization because they're like, what do you mean by balance is sustainable? Well, the key things we're managing against organic growth, profit growth, market share, and cash.\n\nAnd so those are the four things. And I would say internally, a lot of the organization used to look to this role to decide what we're going to prioritize. But again, when I say balance, I want all four of those metrics to go in the right direction. I think -- so we're taking what I would say are high road actions to position the company to grow for the long term sustainably.\n\nAnd right now, given the, I would say, the supply shocks or the input cost shocks that we've taken on in the last three years, as I mentioned before, 1,500 -- the equivalent of 1,500 basis points of gross margin, margin improvement right now this year remains my top priority. I'm confident we'll return to pre-pandemic levels, and we're making progress as events in the Q3. But at the same time, we're not going to harvest the business to do that. And so at the same time, we're still watching shares.\n\nBut we recognize that when we moved to size twice, both in terms of pace and level, we were out ahead of the rest of the market for a period of time. And so we recognized that we were going to leak a little share. But in our sense, I think that was the necessary trade-off to make sure that we can get the margin recovery. That said, at the same time, we continue to invest in innovation.\n\nWe can do to support our brands with great marketing. I think our marketing has gotten better and our digital executions has gotten better. And so we're really proud of that. And so that's what we're trying to walk the fine line.\n\nI mean, I'm very encouraged that we're up and even insure in about half of our markets. It's a little bit lower than we experienced in 2020, 2021, where we were up in two-thirds. I would say we're really proud of that, but we also recognize our competitors are pretty good, too. And so we can't expect that every year.\n\nAnd so if you get the sense, it's a complex trade, but it's something I feel like our organization has really stepped up to and they know what we're trying to do. And we're doing the margin recovery, but we're paying close attention of shares as well. So that was a long reply. I don't know if I answered anything that you asked.\n\nLauren Lieberman -- Barclays -- Analyst\n\nThat was great. It was a long question, so thanks very much.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nAll right.\n\nOperator\n\nThank you. And at this time, it appears we have no further questions. I'll turn it back to management for any additional or closing remarks.\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nOK. Thank you, all, for joining. We look forward to sharing our fourth quarter and full year results with you in January.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Ezzell -- Vice President, Financial Planning and Analysis\n\nMike Hsu -- Chairman and Chief Executive Officer\n\nNelson Urdaneta -- Chief Financial Officer\n\nLauren Lieberman -- Barclays -- Analyst\n\nKevin Grundy -- Jefferies -- Analyst\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nJason English -- Goldman Sachs -- Analyst\n\nAndrea Teixeira -- JPMorgan Chase and Company -- Analyst\n\nAnna Lizzul -- Bank of America Merrill Lynch -- Analyst\n\nJavier Escalante -- Evercore ISI -- Analyst\n\nJonathan Feeney -- Consumer Edge Research -- Analyst\n\nMore KMB analysis\n\nAll earnings call transcripts"
}