{
  "companyName": "Las Vegas Sands",
  "companyTicker": "LVS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/las-vegas-sands-lvs-q3-2022-earnings-call-transcri/",
  "content": "Las Vegas Sands (LVS 2.10%)\nQ3 2022 Earnings Call\nOct 19, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Sands' third quarter 2022 earnings conference call. [Operator instructions] It is now my pleasure to turn the floor over to Mr. Daniel Briggs, senior vice president of investor relations at Sands. Sir, the floor is yours.\n\nDaniel Briggs -- Senior Vice President, Investor Relations\n\nThanks, Paul. Joining the call today are Rob Goldstein, our chairman and CEO; Patrick Dumont, our president and COO; Dr. Wilfred Wong, president of Sands China; and Grant Chum, EVP of Asia operations and COO of Sands China. Today's conference call will contain forward-looking statements that we are making under the safe harbor provision of federal securities laws.\n\nThe company's actual results could differ materially from the results reflected in those forward-looking statements. In addition, we will discuss non-GAAP measures. A definition and a reconciliation to the most comparable GAAP financial measures are included in the press release. We have also posted an earnings presentation on our investor relations website.\n\nWe may refer to the presentation during the Q&A portion of the call. [Operator instructions] Please note that this presentation is being recorded. I'll now turn the call over to Rob.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nThank you, Dan, and thank you for joining our call today. A few brief comments and we'll move to Q&A. The recovery of Marina Bay Sands continued during the quarter with property EBITDA reaching $343 million. Relaxation of virus-related restrictions in Singapore and many of the source markets, coupled with the improvements in airlift have enabled this performance and financial -- this improvement in financial performance.\n\nWe expect a robust recovery over time as further relaxation measures in the region are implemented and additional airlift in Singapore comes online. Our $1 billion capital investment program currently underway at Marina Bay Sands has introduced exceptional new suite product in premium segment focused amenities of the resort. The response to these initial offerings has been strong. Additional offerings, including spacious new suite products, will be introduced throughout the remainder of this year in 2023.\n\nWe look forward to substantially increasing our investment in the Singapore market as we execute our expansion plans at MBS in the years ahead. Turning to Macau, the operating environment remains difficult. Importantly though, in areas where restrictions have been relaxed, customer demand and spending in Macau have proven resilient at the premium mass level from both gaming and retail perspective. We appreciate the opportunity to submit our tender proposal for one of the six gaming concessions in Macau in September.\n\nWe are now in the consultation phase of the tender program and as such, we won't be able to comment much further on the process at this time. We are big believers in Macau as a world center of tourism and leisure. We have been the biggest investor and operated non-gaming businesses over the past two decades in Macau. We absolutely welcome the opportunity to invest even more in nongaming products and offerings in Macau.\n\nWe have great confidence in Macau's tourism recovery as long-term growth prospects as we do most of our -- we'll do our utmost to support Macau's economic diversification and its evolution as Asia's leading destination for MICE and leisure visitors. We consider our existing portfolio of resorts in Asia to be an ideal platform for growth in the years ahead. In addition, we continue to pursue opportunities to develop new large-scale land-based destination resorts in both the U.S. and Asia.\n\nWe thank you for listening today, and I'll turn to your questions.\n\nOperator\n\nThank you. [Operator instructions] And the first question today is coming from Joe Greff from J.P. Morgan. Joe, your line is live.\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nThank you. Good afternoon, everybody. Rob, Marina Bay Sands, you're run rating close to $1.4 billion in annualized EBITDA. And as you referenced in the investor slide presentation, without any contribution from a geography, namely China.\n\nGiven what you're seeing with improved easing regional visitation volume in, say, other non-China geographies, do you think you can get to 2019 EBITDA levels at some point in the next year or so without direct contribution from China?\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nJoe, we think Singapore is in a very unique place. I think we easily achieved 2019 levels. And as you referenced, we have three great impediments right now. We have -- obviously, tours into China is very limited.\n\nWe also are running about 55% visitation into Singapore from the rest of Asia, which means -- and that may seem odd to reference that because you think, well, we're running at the high levels of occupancy. But keep in mind that that residual tourist that comes in does not sleep at the MBS property, gambles there, shops there, eats there. So we're getting hurt, I think, on the table business by not having all the hotels in Singapore operating at full level. It's a big business for us because MBS is the first protocol from those visitors whether they're sleeping there or not, they go there.\n\nThat hurts our business. And despite that, we're achieving $700 win per units on the slots and huge retail numbers, but the upside is material. Third impediment is our sleeping rooms. We had about 400 or 500 units down right now.\n\nI think Singapore, it's just beginning. I always joke with the guys here, the party is just starting in Singapore. The truth is that Singapore is going to grow, and for a couple of reasons. One is the destination is getting more powerful than ever.\n\nOur building is getting better than ever. And I think when you see a rebound from China and the rest of Asia, $1.6 billion was very small in terms of our ability to grow with much larger than that. I think we can keep going to $2 billion the next couple of years if we get it right and the market fully recovers. So as much as we like the numbers currently, we think there's much better days ahead for Singapore.\n\nThat market and that destination has grown quite a bit in terms of the Asian tourism world. And I think our numbers will reflect that in years ahead.\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nGreat. And then switching over to Macau, I'm not going to sort of waste, I guess, my bullet of the question on the concessionaire terms and other things I'd love to ask about. But maybe can you just remind us what your expectation or what your conversations during the consultation process, what the timetable is for the license renewables to be finalized? When would you expect to hear from the government and then the government's end result to be publicly communicated? And that's all for me. Thanks.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nWe woke our colleagues up in Asia in a deep sleep to participate. I'll let them answer that question. Gentleman, Grant and Wilfred, both online. Correct?\n\nDaniel Briggs -- Senior Vice President, Investor Relations\n\nCorrect.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nAre you awake, guys?\n\nWilfred Wong -- President, Sands China\n\nYup.\n\nGrant Chum -- Senior Vice President, Global Gaming Strategy\n\nYup.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nAnswer away. Do you need the question?\n\nWilfred Wong -- President, Sands China\n\nWell, we've been working with the government closely. And a couple of rounds of discussion has been held. We are waiting for the government notification, whether there will be another next round of discussion. And the timetable remains the same.\n\nEverything is in good progress, and we expect some notification toward the end of the month for us to know what's the next step.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nGreat. Grant, do you have anything to add? Any additional commentary, Grant?\n\nGrant Chum -- Senior Vice President, Global Gaming Strategy\n\nNo, I think that's right. And we obviously welcome the smooth progress in the process. And we still do expect the entire process to complete by the end of the year, as obviously stated by the government.\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nThanks guys.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nThank you. I appreciate it.\n\nOperator\n\nThank you. The next question is coming from Carlo Santarelli from Deutsche Bank. Carlo, your line is live.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nHey guys, thank you. Obviously, Rob or whoever wants to take this, you guys had a significant boost in kind of hotel revenue out of Singapore and namely in ADR. Any color you guys could provide? I mean, I know strategically, you're looking to put the best customers in that building right now from a gaming perspective. And obviously, that's showing up in the numbers, both on the VIP segment role and mass segment role.\n\nAnything you could provide as to kind of how the mix has changed at that property? I assume some of that ADR is just kind of casino comp room and that's kind of what's making that sound so significant?\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nI think, Carlo, one of the most significant things is what's not there. We're running like 96%. You see on Page 14, the reference page, ADR $515. I think, again, we're just beginning.\n\nWe only have half the recovery in terms of -- China is not there, most of Asia is not there. Our point is the mix gets better and better because demand gets higher and higher. Our problem there's going to be to have enough rooms to service all the demand FIT casino. And I think we pointed two great variables: one being retail, which is that mall just keeps getting better and will keep getting better.\n\nAnd then our win per unit on the slot side looks strong. But I think the refocus on Singapore as a destination market, as a market in great ascent illustrates what the upside could be in the -- on the tables, and non-rolling tables. Rolling tables will probably get to whole new level, but demand for the non-rolling tables is what I'm waiting for recovery. And that's where you see China and the rest of Asia full lift comes back.\n\nSo right now, we're just faced with -- the sad reality is we like to have a lot more rooms in Singapore because that $515 is a real number, it could be a lot higher as demand gets lifting. We can sell hotels rooms all day long at top dollar rates from the FIT side. We have great demand, much better than prepandemic demand from the rolling side. So again, the $343 million is a very nice number, a good print in lieu of what's happening in that market.\n\nBut I think the best phase of Singapore next couple of years as we keep growing -- and you're going to see our refocus on our mix in the retail segment. Our room mix, we're going to continue to focus on the right room mix, top-tier rooms, the right food and beverage product. We've got to work harder because Singapore as a destination is growing measurably. We want to be a part of that.\n\nSo we're just in a very good place in Singapore. I think looking back, we always thought [Inaudible] was a very nice number, but hopefully that looks like a small number in the future.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nGreat. Thank you, Rob. That's helpful. And then if I could, as you guys have talked about in the past kind of the thoughts on development.\n\nClearly, the New York process is kind of underway. Could you perhaps maybe share a little bit of your thinking around your approach and perhaps how you're thinking about the broader process time line in general for New York?\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nWaiting for a Governor Hochul's advice to how that's going to process will begin. As you know, we've always been focused on that market for many years. We have a big we're putting together right now. We have property we're put together right now.\n\nVery bullish on New York as a market. Tough because really, I think, one available license at the end of the day, I think it's been a very -- a dog fight. And hopefully, we have a bid that gets attention. But other than that, timetable looks like January for the RFP.\n\nI think sometime in '23, maybe you see a decision. And we'll put our best foot forward, that's for sure. It would be a perfect market to be in with the density of population and ethnicity.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nAwesome. Thank you, Rob. Appreciate it.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nThank you, Carlo.\n\nOperator\n\nThank you. The next question is coming from Robin Farley from UBS. Robin, your line is live.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thanks. Can you give us a sense on when -- what your expectation is for a more open border and whether there's still an expectation that November would see the package tour visas and electronic visas. Is that something that you feel like is still moving forward and will still allow for increased visitation to start?\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nI'm going to ask your former colleague, Mr. Chum, to answer that question, Robin.\n\nGrant Chum -- Senior Vice President, Global Gaming Strategy\n\nSorry, Robin, I couldn't quite hear the question. Can you repeat that?\n\nRobin Farley -- UBS -- Analyst\n\nIt was just about your expectations around timing for the border to be a little more open in Macau and specifically anything on the changes that were planned by early November for visa applications to be electronic and package tour visa to restart.\n\nGrant Chum -- Senior Vice President, Global Gaming Strategy\n\nYeah, sure. I mean I think, Robin, there has been a positive announcement on the relaxation with regards to two groups, as well as the electronic visa application in four provinces and also in Shanghai expected to commence end of the month or early November. And so that's obviously going to be a very positive signal for a gradual recovery in the visitation especially from these key provinces and municipality. And obviously, we welcome the development.\n\nClearly, in the past few weeks and also months, is still being relatively impacted by the COVID cases in different provinces as far as the non-Guangdong visitation is concerned. So what we're seeing right now in Macau is predominantly coming from the Guangdong province. But hopefully, as we get out further into the fourth quarter with these recent measures, we're going to start to see a more well-rounded mix of visitation building up toward the end of the year.\n\nRobin Farley -- UBS -- Analyst\n\nOK. And then also for my other question on Singapore. I know you said that the deadline to start construction was extended till April 2023, and that's -- you had said that before this quarter. Just wondering if you have anything more definitive about when that would happen.\n\nThanks.\n\nPatrick Dumont -- President and Chief Operating Officer\n\nI think -- Hi, it's Patrick. I think the great news is, as Rob said in his opening remarks and the questions, our performance in Singapore is very strong. It's a privileged market and now tourism there is really remarkable given some of the constraints. The spending power of the consumer there is tremendous.\n\nWe're really focused on high-value tourism and you're seeing the results of that in our results. And I think the Tower 2 and our IR 2, in our mind, has just tremendous potential. We're very excited about it. But unfortunately, we don't have any update right now about the timing.\n\nSo we're working on it. We're in process. And as we make a little bit more progress on our work there, we'll be able to disclose further about where we're headed. But as of right now, we're very optimistic about it.\n\nWe're excited about the project. We think it really will speak to a very powerful part of the market. Now we don't have an update on timing.\n\nRobin Farley -- UBS -- Analyst\n\nCan I just ask one clarifying question on that? It had sounded previously like the timing of the budget and all of that was because of the pandemic and the disruption from that. If your business level is sort of fairly recovered, is that still the kind of uncertainty in the commencing construction? Or are there other factors that are more of a gating issue at this point?\n\nPatrick Dumont -- President and Chief Operating Officer\n\nIt's really just process. I think there's a certain number of steps that we have to go through to be able to build. And so those processes were delayed because of the pandemic and because of some of the government agencies that we have to deal with being focused on very pressing matters. So now that they're able to reengage, we'll start that process again and begin on the path.\n\nAnd as we follow sort of the steps necessary, we'll be able to provide an update. But it's really just timing related to things necessary to begin. There's a lot of things that have to happen to make a building of this scale and complexity in the location that it's in, get all the approvals, go with the steps necessary to begin.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nAnd Robin, I would say, the process for us is a learning -- is an evolutionary process. We keep thinking how about this market differently as we learn more and see more. And so our thinking has changed on size of room, gaming capacity, who the customer is. Singapore is morphed from what it was five years ago and hold it in place now.\n\nAnd I think it's affected our thoughts on what we build in Singapore and how good should it be and how powerful should it be. And I think it's slower we want to be, but it's going to be at the end of the day a very, very important product.\n\nRobin Farley -- UBS -- Analyst\n\nOK, great. Thank you very much.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nThanks, Robin.\n\nOperator\n\nThank you. The next question is coming from Dan Politzer from Wells Fargo. Dan, your line is live.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nHey, good afternoon everyone, and thanks for taking my question. So just -- you guys are seeing a lot of strength in terms of the room product right now. You're doing the $1 billion project renovation on your room product and MBS. I mean how do we think about the return of that given this should be fully online next year? And do you think you can get to that typical kind of 20% return historically or maybe higher even in the absence of the Chinese consumer coming back?\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nI think we need the Chinese consumer. We need couple of things to happen, let's be clear, we need to see China return at some point to achieve our goals. We also need to see the balance of Asia open up and come back at, again, as I referenced earlier, the 55-or-so percent number, which is compared to 2019 isn't good. We need Singapore to be full on because our building, if you walk through there, when there's tens of thousands, hundreds of thousand people there, they're all staying there.\n\nThere's the other hotels from the business. So these other hotels are very important to us. So we need two things happen. Our renovation will complete in late '23.\n\nThe balance of Singapore -- of Asian tourism into Singapore should be hopefully by Q2 complete. And that leaves the one barrier we can't answer that: the China return. But when all that happens, do we think we can get to a very fat return? Yes. I'd like to believe we can -- our goal is to get to $2 billion in Singapore.\n\nAnd we believe that's not difficult if the market returns in full. So keep in mind that we went into Singapore with a very different mentality a decade plus ago. The evolution of Macau into a really being the premier FIT gaming market probably right now in that region is MBS. And I think we're experiencing the beginning to return, but it's not nearly where it needs to get to for us to get to $500 million a quarter.\n\nBut I think that -- we'll hopefully see that in the years ahead. So we feel very bullish. And I can't think of a better place to invest our capital than Singapore and Macau. And Singapore has proven to be terrific opportunity.\n\nWe put a lot of money in Macau. That will open up [Inaudible] and be a good opportunity. But right now, Singapore is very, very exciting for us. And yes, we're very confident the returns will be there.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nGot it, thanks. And then just pivoting to Macau. Another one on the group tours and the e-visas being resumed. I mean can you maybe frame how big these components worked for your business in 2019? And then secondarily, if we think about these parts of the business returning and coming back online, is there a path to Macau getting to positive EBITDA in the fourth quarter, assuming no major outbreaks?\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nI'll ask Grant to reference that. But I think we should be careful. We don't -- it's very hard, as you know, right now, predictions on Macau have been erroneous for the last couple of years because we don't know who's going to come and we don't know when they'll close the market. It's been a stop-and-start for so long.\n\nIt's kind of silly for us to pontificate on exact gains in EBITDA. Could be EBITDA positive? Sure, these are positive tomorrow if things open up and visitation return. And that's going to happen at some point. But I think it's not -- it's difficult for us to tell you fourth quarter could be EBITDA positive without knowing what effect the business team will have in November and then also not knowing how zero COVID enforcement will happen.\n\nSo there's certainly unknowns in Macau. It's very difficult to guess. Grant, Wilfred, any commentary?\n\nGrant Chum -- Senior Vice President, Global Gaming Strategy\n\nYeah, Rob, I think Rob is right. I mean, the prediction of the future is tough. I think what we can say about the past is that group package tours represented roughly a quarter of the visitation before the pandemic. With respect to electronic visas, we don't have those numbers.\n\nObviously, it varied significantly from province to province. But clearly, the provision or availability of that mode of application absolutely is helpful to facilitate the visa application for those relevant provinces.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nGot it. Thanks for all the commentary.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nThanks, Dan.\n\nOperator\n\nThank you. And the next question will be from Shaun Kelley from Bank of America. Shaun, your line is live.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nHey, good afternoon everyone. Maybe just to stay on Singapore, my first question is just to ask a little bit about trying to triangulate a little bit more on sort of what you're seeing behaviorally. When we look at RevPAR, for instance, I think it's about 6% versus 2019. Is that a decent gauge of, let's call it, the consumer and, let's call it, the spend per person or per head.\n\nIs it better than that? I'm just trying to kind of think about pent-up demand or what you're seeing on kind of a core visit-to-visit basis versus what we've seen in some of the Western markets because we don't have a great proxy in Asia yet about sort of how pent-up demand is going to play out and just trying to kind of see what you're seeing a little bit more.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nI'm going to ask Patrick to take that, but I want to say one thing, Shaun, is critical to understand is that Singapore is much different. I think this is the obvious response to that. Singapore is much different than Las Vegas or U.S. regional because of the obvious that you got to fly to get there, so you had to take other countries opening up and it's like buying wine in Burgundy, a lot of different regions in Burgundy.\n\nWell, there's a lot of different regions in Asia that don't open, haven't opened. Airlift is a problem. So we're really hampered. As nice as what $3.40 billion is for the quarter, I think you're not getting the full power.\n\nIt's hard to differentiate versus other places. The truth is that Singapore remains really held back by no China or little China and the regional market there, depending on airlift. The difference in Macau will be when Macau opens up, it's like Las Vegas or regionals. You can come right in without airlift.\n\nYou're not airlift-dependent. So I do think Singapore right now is in kind of unclear, uncertain environment. It's nicely making $1.4 billion, whatever the number annualizes. But we won't know the full power of this market.\n\nWe see it in retail. We see it in local slot play is still strong. We see it in rolling volumes are strong because everyone is coming to Singapore, especially the F1. But I think what you're not seeing yet is unleash the full power of this destination and what's happening.\n\nPatrick?\n\nPatrick Dumont -- President and Chief Operating Officer\n\nIt's a very interesting question. I think the key thing to note is that it's a data point for the quality of tourism coming into Singapore. And the high amount of consumption that's there when tourists visit, there are constraints and there were constraints for Marina Bays Sands during the quarter. So as Rob mentioned at the beginning, you see from the deck, we had approximately 500 rooms out of inventory during the renovation, the rooms that are coming online are probably the best products we've ever had.\n\nWe're very proud about that. We think we'll be able to trade up in terms of the quality of the tourism that we get out of those rooms once the completion is there. One thing to note is that we'll be done at the end of '23. So we're going to have a few more quarters of disruption as we take rooms out of inventory to complete the renovation process in Marina Bay Sands.\n\nThe other thing to note is that the airlift is not there. And some of the other hotels around the Singapore market do not have the full capacity because of labor constraints. So once these things are removed from the market that act as limiters, then you can get an idea of what the true potential would be in a run rate environment. But I would still call this a little bit of a recovery quarter.\n\nSo we think there's more potential to run as we fix some of these things that are sort of limiting the way that we can earn. And to be fair, the market can earn.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nIf you look at our sales in the retail mall on Page 31, it gives you some indication that we're running at $2,300, $2,400 a foot at Marina Bay Sands from the third quarter. I also think if you look at the rolling volumes as they start to kick in, I think those are great data points to see the quality coming. But again, it's early days. I think the recovery quarter is the right way of approaching it.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nSuper helpful. And sort of want to go down the same path, transitioning over to Macau. And I'm not sure it's the exact right way to look at it. But here, you do this slide on Slide 12 where you kind of break down the mass win per visit, which I find to be very, very valuable.\n\nJust as we think about that level, and we saw the sort of pullback from what was probably a very premium mass-driven business back over the -- like last eight quarters or so. The last two quarters, have looked a lot like where you were back in kind of 2018, 2019. Is this the right -- which one of those two, either the sort of pent-up demand we saw over the last eight quarters or kind of these more recent numbers is a better guide for what we think normal activity might look like in Macau?\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nGrant, do you want to take that?\n\nGrant Chum -- Senior Vice President, Global Gaming Strategy\n\nYup, I'll take that, Rob. Yeah, thanks for the question. I think it's interesting looking at that trend as you highlight for the past several quarters. I would say the difference that you highlighted with the previous two quarters versus the prior eight, it's really just a function of the regional mix.\n\nSo into 2022, we've had a much more Guangdong bias mix, if you look at the visitation data, and that's mainly a result of the various COVID outbreak impact on the non-Guangdong source of visitation. So if you're looking at the period post pandemic, that's clearly the differentiator. And then if you compare with pre pandemic, then it's, of course, still very much premium mass coming back faster. And I think that broadly stands notwithstanding or adjusted for the regional provincial mix.\n\nI think that's still a valid point, and it's borne out by the data series. So obviously, premium mass comes back first and then the mass comes back later. But this year, definitely, there's an impact from the regional mix as well.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nVery helpful. Thank you.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nI think we all agree to underlying demand in Macao's going to be there once COVID resolved. And no difference happened probably in the U.S. And again, with our footprint there, our size, our scale, we know the base mass, premium mass is going to drive this thing. The only variable we don't know is the missing junket segment, how impactful it will be.\n\nBut we believe -- again, when that door does open, I think the pent-up demand is going to be extraordinary.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nThank you again.\n\nOperator\n\nThank you. And the next question is coming from Brandt Montour from Barclays. Brandt, your line is live.\n\nBrandt Montour -- Barclays -- Analyst\n\nHey, good afternoon everyone. Thanks for taking my questions. On Singapore, can you guys give us the room rate differential between the finished room product and the legacy room product at run rate?\n\nPatrick Dumont -- President and Chief Operating Officer\n\nI think the problem is the -- it's Patrick. I think the problem is there's so much noise in the comparison because what we would be giving you is 2019, and this is not a fully open market yet. What we'd like to believe is after the quality of the renovation to be fair, we were taking keys out of inventory to create larger suite product. The level of design, we have a new service model.\n\nWe've changed out a lot of the team there in order to improve our service delivery. There's a lot of things that are going to be different. So I don't want to quote you a number until we get to the run rate. But the key takeaway is that we're very focused on high-value tourism.\n\nWe're investing in room product, we're investing in personnel and training and in service delivery and in food and beverage and other amenities in the property to ensure that we can sort of capture that high-value tourist. And that's really what you'll see over time.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nI think one thing you just have to do if you want to understand this thing is you will have pictures and listen to us, but jump on a plane somebody and go see it. The product we're building there is unlike any haven't been done in Singapore is our spirit to what we've done the best in our competitors. And so I think when people -- our response has been across the board, perfect in terms of how people view this product. I think the impact is going to be much higher than we understand because if you build something that good, people respond to it.\n\nI would encourage anybody who's in that part of the world to spend a day at Marina Bay Sands and we'll show you what we're building is pretty impressive.\n\nBrandt Montour -- Barclays -- Analyst\n\nGreat. Thanks for that. That's helpful. And then as you -- again, on Singapore, one of the narratives on the early days of the reopening in that market was that Singapore was gaining share of groups and convention business from Hong Kong.\n\nAs you talk to your meeting planners and bookers and they're looking out six, 12 months, 18 months, is there a sense that with Hong Kong starting to reopen that that market is sort of trying to regain some of that share? Or is that market too uncertain? And the momentum is being maintained for Singapore in that business?\n\nPatrick Dumont -- President and Chief Operating Officer\n\nSo Singapore is open for business. And so that means a return of leisure tourism, which we're benefiting from directly and the return of business tourism, which we're seeing in a strong way. I don't think we can draw a comparison with Hong Kong because access is different. So I think the way to look at it now is Singapore has always been a very strong MICE market.\n\nAnd I think it will continue to be so because of the investment, the high-quality tourism assets, it's important as a financial center. We intend to invest behind this thesis. And so we think it's generally a very strong place to do business tourism. In terms of Hong Kong, I don't think we're at run rate yet to really understand sort of what that means.\n\nThere's still COVID restrictions. There's still other restrictions in operation. So until those return to a more normal time, I think it's going to be hard to have any view at all.\n\nBrandt Montour -- Barclays -- Analyst\n\nGreat. Thanks for the thoughts.\n\nOperator\n\nThank you. And the next question is coming from Stephen Grambling from Morgan Stanley. Stephen, your line is live.\n\nStephen Grambling -- Morgan Stanley -- Analyst\n\nHey, thanks for taking my questions. You mentioned the trade-up and quality of the new rooms in Singapore. Can you just remind us of the cadence of rooms coming out and coming in over the next couple of quarters? And also talk to the net impact from these actions split across any uplift from renovated rooms versus the older rooms and maybe even tying in headwinds from those closed? Thanks.\n\nPatrick Dumont -- President and Chief Operating Officer\n\nSo we're going to have, let's call it, anywhere from 300 to 500 keys out of circulation across the next five quarters. And then the room renovation will wrap up and the tower will be fully -- the two towers will be fully ready by Chinese New Year '24. And actually by the end of '23. So that's sort of the cycle.\n\nSo we're going to have we're going to have not our full potential of room delivery during the next five quarters.\n\nStephen Grambling -- Morgan Stanley -- Analyst\n\nAre you currently delineating between the new rooms in terms of pricing in the old rooms?\n\nPatrick Dumont -- President and Chief Operating Officer\n\nThere is some variability there, yeah, but it also depends on which room within the segment so that we have certain suites that are out, certain rooms that are in, depends on the time. Yes, there is some differentiation. So there is a blend there.\n\nStephen Grambling -- Morgan Stanley -- Analyst\n\nGot it. And then maybe turning to Macau. The market share there in mass has been quite volatile. How would you frame how your market share may evolve in a market recovery as different segments return, as you've described in a bit of a cadence premium mass and then mass?\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nGrant, do you want to have that?\n\nGrant Chum -- Senior Vice President, Global Gaming Strategy\n\nSure. Yeah, thanks for the question. Yeah, I think it is volatile right now because the volumes are so thin. So I'm not sure looking at this quarter or even the prior quarters is particularly meaningful at this point.\n\nBut I think going forward, I think as Rob referenced, we expect a strong comeback of both premium mass and mass. And I think in those segments, we're going to perform very well. Obviously, there's a past history there, but also, I think looking forward, we are coming off these fantastic product investments that we've made during the pandemic with the $2.2 billion investment program that we've implemented and now coming out on the other side, pretty much completing with the London arena being the last component. So with the London arena and the Grand Suites at Four Seasons, we feel very strongly that we're going to perform very well in the market share front.\n\nAcross all of these segments, not just because of the suites, speaking to the premium mass segment, but also for the mass segment, I think we'll end up with these three wonderful iconic destinations to follow on from Venetian and Parisian and now with the London and Macau, which is already starting to gain so much traction with the people who have been able to visit and also locally as well.\n\nStephen Grambling -- Morgan Stanley -- Analyst\n\nGot it. Helpful. Thanks so much.\n\nOperator\n\nThank you. And the last question is coming in from David Katz from Jefferies. David, your line is live.\n\nDavid Katz -- Jefferies -- Analyst\n\nHi, good evening everyone. If you could just talk a little bit about what you may have learned past quarter or so about the mix of revenue and recovery in Macau, what should we expect? And what role does sort of VIP play in all of this? And I know obviously, premium mass is the focus. But help us break down the different streams, if you can.\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nMr. Chum, are you still awake?\n\nGrant Chum -- Senior Vice President, Global Gaming Strategy\n\nYup, still going. Yeah. I think as I referenced earlier, I think there is a mix between the business segment -- the matrix between the business segment as well as the regional breakdown. So I think if you're just looking at the business segment, then clearly, VIP right now is -- has very low levels of volume, especially versus premium mass and even mass.\n\nBut part of this impact in 2022 is also the regional composition of the business where we're obviously very Guangdong-dependent right now and have been for most part of this year. But I think going forward, it should be like how we've been seeing, which is the premium mass will come back first and more strongly and then followed by the mass. And this is also true if you look at the retail numbers, what we've seen is 2021 very, very significant performance in the luxury retail segment. And of course, 2022, less so.\n\nBut again, it's really impacted by that regional difference. And then going forward, yes, similar trends, we expect the luxury retail to come back first and the fastest and then you follow through with the mass retail.\n\nOperator\n\nLooks like we lost David. We did have another question come in, from Ben Chaiken from Credit Suisse. Ben, your line is live.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey, how is it going? Thanks for squeezing me in. Just kind of want to level set as we close the year. I think we mentioned tour groups and e-visas for a few provinces in Shanghai, either at the end of this month or early November. Is it possible that Macau could have breakeven or positive EBITDA as we go into the -- in the fourth quarter? Or do you think that's out of the realm of expectations? Thanks.\n\nPatrick Dumont -- President and Chief Operating Officer\n\nYeah. I think the difficulty is, we don't know. We've been in these conditions for two and a half years. We're very hopeful.\n\nWe're going to continue to invest in Macau. We feel very strongly about Macau's future and the opportunities that exist there for leisure and business tourism but we just don't know. So as of right now, we're just waiting patiently, and we're going through the process, and we're looking forward to the opportunity for the upcoming concession.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nGot it. I appreciate it. Thanks.\n\nOperator\n\nThank you. [Operator signoff]\n\nDuration: 0 minutes\n\nDaniel Briggs -- Senior Vice President, Investor Relations\n\nRob Goldstein -- Chairman and Chief Executive Officer\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nWilfred Wong -- President, Sands China\n\nGrant Chum -- Senior Vice President, Global Gaming Strategy\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nRobin Farley -- UBS -- Analyst\n\nPatrick Dumont -- President and Chief Operating Officer\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nBrandt Montour -- Barclays -- Analyst\n\nStephen Grambling -- Morgan Stanley -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nMore LVS analysis\n\nAll earnings call transcripts"
}