{
  "companyName": "Similarweb Ltd.",
  "companyTicker": "SMWB",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/similarweb-ltd-smwb-q2-2022-earnings-call-transcri/",
  "content": "Similarweb Ltd. (SMWB 16.91%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGreetings and welcome to Similarweb Q2 fiscal 2022 earnings conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nI would now like to turn the conference over to your host, Mr. RJ Jones, vice president, investor relations. Please go ahead, sir.\n\nRJ Jones -- Vice President, Investor Relations\n\nThank you, operator. Welcome, everyone, to our second quarter 2022 earnings conference call. During this call, we will make forward-looking statements related to our business. These statements may include the expected performance of our business and our future financial results, our strategy, the potential impact of the COVID-19 pandemic, and its associated global economic uncertainty, our anticipated long-term growth, and overall future prospects.\n\nThese statements are subject to known and unknown risks, uncertainties, and assumptions that could cause actual results to differ materially from those projected or implied during the call. Again, actual results and the timing of certain events may differ materially from the projected results or the timing predicted or implied by such forward-looking statements. Further reported results should not be considered as an indication of future performance. Please review our Form 20-F filed with the SEC on March 25, 2022, in particular the section entitled Risk Factors therein for a discussion of the factors that could cause our actual results to differ from the forward-looking statements.\n\nAlso note that the forward-looking statements made on this call are based on available information as of today's date, August 10, 2022. We undertake no obligation to update any forward-looking statements we make today except as required by law. As a reminder, certain financial measures we use in presentation of results and on our call today are expressed on a non-GAAP basis. In particular, we reference non-GAAP operating loss, which represents GAAP operating loss, less share-based compensation, adjustments, and payments related to business combinations, amortization of intangible assets, and certain other non-recurring items.\n\nWe use this and other non-GAAP financial measures internally to facilitate analysis of our financial and business trends and for internal planning and forecasting purposes. We believe these non-GAAP financial measures, when taken collectively, may be helpful to investors because they provide consistency and comparability with past financial performance by excluding certain items that may not be indicative of our business, results of operations, or outlook. However, non-GAAP financial measures have limitations as an analytical tool and are presented for supplemental informational purposes only. They should not be considered in isolation from or as a substitute for financial information prepared in accordance with GAAP.\n\nA reconciliation between this GAAP and non-GAAP financial measures is included in our earnings release, which can be found on our Investor Relations website at ir.similarweb.com. Today, we will begin with brief prepared remarks from our CEO, Or Offer; and CFO, Jason Schwartz. Then we will open up the call to questions from sell-side analysts in attendance. Please note that we published a detailed discussion of our second quarter 2022 results in a Letter to Shareholders for investors to reference, as well as an updated investor presentation with a strategic overview of the business, both of which are available on our Investor Relations website.\n\nWith that, I will turn the call over to Or Offer, CEO of Similarweb.\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nThank you, RJ, and also thank you to everyone joining the call today. We post an excellent result in our second quarter as we focused on more efficient growth for our company. Revenue grew 46% over Q2 last year to $47.6 million in the second quarter. The expansion of our global customer base consisting of SMB, enterprise, and strategic accounts remaining strong.\n\nOur customer base grew 25% year over year to over 3,800, and our average accounts spend about $51,000 with us annually, up 16% in just a year since our IPO. Furthermore, over 53% of our annual recurring revenue come from customers who spend more than $100,000 per year with us. Today, 36% of our relationships consistent of multiyear contracts, a metric that has continued to expand year over year since 2020. As the global macro economic environment has become more uncertain Similarweb offering and solution have become even more important to our customers.\n\nThe visibility into the digital ecosystem and how to behave and change is critical information to -- in those times that help our customers make the right for digital decision to navigate through economic stormy weather and be successful. As a reminder, we collect extensive online data, then we refine it and package it into solution of actionable insights for our customer, which enables them to make better decision in their competitive market. The solution we build on top of our data impact the revenue-driven teams of our customers, including sales, marketing, analytics and eCommerce, and are designed to help a wide range of users from the C-suite to the operational teams. Every quarter, we seek to innovate and improve upon our solution and add to our underlying data.\n\nOur customer look forward to regular feature additions. This quarter, we took a major step forward that enable us to provide more value to our customer. First, we acquired Rank Ranger, which immediately enhanced our SEO capabilities with the complementary technology and data. This acquisition represent a great example of our M&A as a strategy, which we aspire to continue.\n\nSecond, we launched our App Intelligence product that incorporate data from our data AI, formerly App Annie partnership, which give our customer an expanded view of activity across the digital world. The initial customer responses are positive and we plan to add more feature over time. Lastly, we are in the middle of an exciting build cycle for our Investor Intelligence solution, which will which will deliver timely insights for a new experience to our investor customers. We anticipate we will bring in the new experience to market in the back half of the year.\n\nAgain, our customers will greatly appreciate the value we deliver, especially in times of uncertainty. We are adopting to the microeconomic environment with our customer. As we continue to innovate and grow, we are also focusing more on operational efficiency that will lead us to becoming profitable. We are only just beginning to unlock our potential within a multibillion dollar market opportunity.\n\nJason, I will turn the call over to you.\n\nJason Schwartz -- Chief Financial Officer\n\nThank you, Or, and thank you to everyone joining us on the call today to discuss our second quarter results. I will briefly address our financial performance and then we will open up the call to questions. Our results in the second quarter continue to show our commitment to disciplined execution. Revenue reached $47.6 million for the quarter and exceeded our outlook of $45.9 million on the high end of our range.\n\nImportantly, our overall dollar base net retention rate for NRR increased to 115% as compared to 106% in the second quarter of 2021. And for our $100,000 ARR customer segment, NRR increased to 127% as compared to 118% in Q2 last year. Our remaining performance obligations, or RPOs, increased 53% year over year to $160 million, 87% of which will be realized over the next 12 months. As we exceeded our plans in revenue, we also exceeded expectations on our bottom line.\n\nOur non-GAAP operating loss was $19.8 million, which was less than the $23 million loss on the low end of our guidance range. The two factors driving this result were sales above expectations and operating efficiency across the business. As a reminder, this result includes non-comparable expense impacts from our acquisitions as compared to the prior year. Turning now to Q3 2022, we expect total revenue in the range of $48.8 million to $49.2 million.\n\nFor the full year, we continue to expect total revenue in the range of $196 million to $197 million, representing 43% growth year over year at the midpoint of the range. Non-GAAP operating loss for the third quarter is expected to be in the range of $20.9 million to $21.5 million. And for the full year, between $80 million and $81 million. Compared to last year, our outlook includes impacts to cost of goods sold relating to our data AI partnership and to the acquisition of Embee Mobile.\n\nWe anticipate non-GAAP gross margin will be approximately 74% to 75% in Q3 2022 and between 75% to 76% for full year 2022 as a result of these impacts. Our second quarter 2022 results indicate we are running our business very efficiently during a time of increasing challenges globally. The decisions we are making reflect our focus on maintaining strategic flexibility and balance sheet resilience and pursuing profitable growth. With that.\n\nOr and I are happy to take your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Ryan MacWilliams with Barclays. Please go ahead.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nThanks for taking the question, guys. As we enter a more difficult macroenvironment, appreciate you calling out in prepared remarks that you're starting to see maybe a little more softness from customers in the EU and maybe those that are more focused in the SMB as well. Can you just highlight some of the things you're seeing on the ground and how that maybe impact your strategy over the next six to 12 months?\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nHey, it's Or speaking. Thank you for the question. So I think that we do see a softness in the market. I think it's -- you feel it's more just a little bit harder to do business.\n\nJust the life cycle of closing a deal takes longer. I think there's a lot of tactics and the custom of of people with jobs over there and allocating the budgets and etc. So we're seeing the slowness, I think, a lot in Europe but also in other regions.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nSimilar to what we're seeing with basically across the software universe. That makes sense. And for Jason, just for -- on free cash flow in the quarter. Can you provide some puts and takes there? Any changes that are worth calling out? And then how can we think about the path forward from here for the rest of this year? Just on the free cash flow line?\n\nJason Schwartz -- Chief Financial Officer\n\nYeah. Sure, Ryan. So I think that you see that -- that's been kind of disciplined execution. We've given some guidance on -- that we think that the free cash flow -- the normalized free cash flow should not exceed $50 million for the year.\n\nAnd so we're here at the halfway point. I think we've been managing that. Well, just as a reminder, from a from a cash flow perspective, a significant amount of our renewals happen in Q4 and Q1. And so a lot of that cash flow comes in the end of Q4, beginning -- in the Q1 to April of the year.\n\nSo we're getting into the trough from a billings standpoint of the seasonal weaker part of our cash flow cycle. And so technically, what we always do is look at it on a rolling 12-month basis. The one other thing to call out is that you saw in the release is that we did move into our new headquarters here in Israel. So we had cash -- capital expenditures that related to that -- to the buildout in the new the new headquarters here that we had talked about a few quarters ago.\n\nAnd you see that coming through on the cash flow line this quarter. We break that out and show you both total free cash flow and a normalized free cash flow in the release.\n\nRyan MacWilliams -- Barclays -- Analyst\n\nAppreciate the color. Thanks, guys.\n\nJason Schwartz -- Chief Financial Officer\n\nThanks, Ryan.\n\nOperator\n\nThank you. Our next question comes from the line of Jason Helfstein Oppenheimer. Please go ahead.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nThanks, guys. Just want to ask, one, just about how you're thinking about gross margins into next year. So there's, obviously, been investments that depressed the gross margin first half of this year. Do you feel like next year with what you have and kind of the product pipeline, we should be able to see meaningful growth in the gross margins.\n\nI mean, I don't know if it'll get back to 78, 79, but something call it more like high 70s, more something like we saw in '22, 2020, '21? And then separately, how you're thinking about sales and marketing, investment to the extent that the world is a little bit slower and if you let more flow to the bottom line? Thank you.\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nSo thank you. Jason, good to hear from you. So let's talk about the gross margin. So the short answer is, yes, we are hoping to improve the numbers, not seeing that we're going to get to the 80 and we like the long term, but definitely improving most of the results coming from the operational and thus acquisition.\n\nThis is the biggest chunk around that -- about our cost there. And I think looking into the future, I think it's definitely not going to increase. We are in a very good place and -- currently. So the answer is yes and probably will increase nicely.\n\nRegarding SMM, again we we make a lot of decision to be more efficient. It's very important in this time. So we are optimizing and hopefully with improvement around ad spend and sales and marketing going forward. Jason -- our Jason, you have anything to add on that?\n\nJason Schwartz -- Chief Financial Officer\n\nYeah, I agree with you, Or, on that. And I think that one of the things is you're already start seeing that efficiency flow through this quarter. We have a 200-basis-point improvement on the sales and marketing line and a lot of that revenue growth down to the bottom line in this quarter. We're making decisions actively to be more efficient.\n\nIt's part of the strategy, and I think you're starting to see that come through in the numbers already in Q2.\n\nOperator\n\nJason, do you have any more questions? Our next question comes from the line of Brent Thill with Jefferies. Please go ahead.\n\nUnknown speaker\n\nHi, this is John again for Brent Thill. Thanks for taking the question. So looking through the guidance for the rest of the year, looks like Q4 implies similar growth to Q3. So wondering how you're thinking about how much macro is embedded.\n\nAnd also how -- wonder how the trends are going so far in the quarter in July, August, whether there's notable changes from, let's say, June. And then second-quarter question, wanted to ask about just in terms of the broader operational efficiency, how are thinking about the cost structure rest of the year and into next year? Any change in headcount plans and so on? Thank you.\n\nJason Schwartz -- Chief Financial Officer\n\nHey, John, thanks for the question. So I may, first of all, talk about the growth trend and then and then talk about how we think about the operating efficiency. So as Or mentioned, we're not immune to the macroeconomic trends that we see happening where we talk about the deal cycles that are getting done. They're just taking longer or requiring additional levels of reviews within the organization.\n\nAnd that's stuff that we take into account as we prepare our guidance. You've heard me say before that we like to give guidance that we know we can meet. And so that is -- those assumptions that we have are baked into the guidance. And from an efficiency standpoint, like I said, we are proactively making decisions to balance that growth and cashflow and to be more efficient.\n\nAnd you see that coming through on the on the lines already. And we do, as we mentioned in the in the shareholder letter that we released last night, this is something that we are focused on to work diligently as we have with that kind of disciplined execution and focus on our unit economics to drive those operational efficiencies to get to sustained cash flow. So that is baked into our assumptions as we start thinking about planning and guiding for 2023.\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nI will add that on top of that, that we did -- looking into our headcount plan for 2023, that Q3 and Q4 now is the time that we have hiring and planning to hiring the people for next year for 2023. And of course, we're taking into account because of the decision we made, to be more efficient. It'll probably impact the future hiring plan.\n\nUnknown speaker\n\nThank you for the color.\n\nOperator\n\nThank you. Our next question comes from the line of Tyler Radke with Citi. Please go ahead.\n\nTyler Radke -- Citi -- Analyst\n\nGood morning. I was wondering if you can talk about your performance in other geographies relative to plan? We've heard mostly from companies that they're seeing some issues in Europe. But just wondering if you're assuming that those conditions that you saw in Europe spread to the rest of the geographies and kind of what you're baking in from a geo perspective for the rest of the year. Thank you.\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nSo interesting question. We did, hopefully, internal look around that. Interestingly enough, we have some region that -- the good quarter, like our Japan operation that was doing well and our U.S. also, I think, was doing very well.\n\nIt represent now almost 55% overall revenue. And I think it was up, so it was 50% to U.S. and it was up 55%. So U.S.\n\nwas good performing. Europe was interesting. They may make -- for example, we had a very good scaling operation in Germany and but U.K. and France, we were more self-targeting and trying to think any more information out of this and media run.\n\nI think this is a good overview of both the global impact.\n\nTyler Radke -- Citi -- Analyst\n\nYeah. And so, Jason, maybe just what you're assuming on the guidance from a geographic perspective, if you're assuming things get worse or kind of stay the same.\n\nJason Schwartz -- Chief Financial Officer\n\nSo we've taken some assumptions over there based on regions and some of the things that we've seen in the pipeline already. Even in Europe, we've got still a good solid pipeline that's there. And so we look at all of those factors as we put together our guidance. So there's some things that will be -- we assume will be similar, some things that we'll assume -- who knows? And we want to make sure that we're always giving guidance that we can meet.\n\nTyler Radke -- Citi -- Analyst\n\nRight. And from a hiring perspective, could you just give us a sense what are the areas that you're maybe slowing down or pulling back on the most? Is it primarily kind of marketing related or is it on the direct sales side? Just give us a sense where you're spending less on from a headcount perspective. Thank you.\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nHi. So let me try to think about how -- so I think on the marketing side, we did a lot of changes lately, I think. And we were -- in the -- and to optimize our marketing organization as it was a little bit bigger than what we were planning. And so we did say comfortable in the marketing organization, maybe a little bit around client services and maybe a little bit about in R&D areas.\n\nI think those are the major and also on the channel in recruiting. If we have planned to recruit X amount of people and maybe X amount to recruiter, well, now we bring in adoption to -- hire internal so you can -- we need less workforce to execute on that.\n\nTyler Radke -- Citi -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Arjun Bhatia with William Blair. Please go ahead.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nPerfect. Thank you, guys, for taking the question. I think you mentioned a couple of times in your prepared remarks and in the shareholder letter that demand could increase in uncertain times. Certainly makes sense as customers, I think, rely on the data to drive their business a little bit more.\n\nCould you just maybe dig a little bit deeper into how that's actually coming through? Is that -- are there certain products that you expect will benefit more than others in a more uncertain environment within your portfolio? Do you think it's going to be more concentrated in new customers versus existing customers? I'm just curious how you're thinking that might play out.\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nYeah. Yeah, of course. And so we see this, we see in the past similar sentiment when COVID hit, when the world was going on one distress and many sectors were struggling. And the travel was a great example.\n\nWhen we saw them, they all came back and looked more due to adaptive strategy. So we do think that's going to get into a similar motion now as the market gets more hectic. One area we do see now that there is a little bit increasing demand, for example, is in the investor vertical. When we're seeing that lots of public investors now try to realize when is the right time to market to bounce back? So the more signals they can get about when things start to look better, they can start planning when to start investing again.\n\nSo -- and Similarweb is the best there so -- visible indication of digital world performance. So we start seeing them, I think, more interest to get more data, more services from us. And I think those are the first vertical that start thinking about now -- with this situation, so we'll probably going to see more of those verticals and start getting more demand for markets -- for digital market now, Arjun.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nGot it. That's very helpful. And then maybe one for Jason, just -- it seems your net retention rate is obviously doing very well in this environment. Can you just give us a sense for how you expect that might play out for the remainder of the year as the macro backdrop gets a little bit more challenging.\n\nAnd I'm wondering if you have any more granularity in that metric that you can share with us in terms of which customers are expanding and how the gross retention might be changing, if at all.\n\nJason Schwartz -- Chief Financial Officer\n\nSo, Arjan, it's great to hear from you. The gross retention numbers are actually, for the most part, pretty stable. The thing, I think, that we look at is really the rate of expansion and the buying powers that a lot of customers have. One of the things that gives us some confidence in our numbers and the durability of our ARR is that already 36% of the ARR is on -- signed up for multiple years.\n\nAnd so those are things even though we reported and think of our business as an annual recurring revenue business, and having already 36% of that signed up on multi-year deals means that that's all that's revenue that's not up for renewal, if you will, during that period of time. And so that gives us that confidence of there. We're seeing in a number of the large customers that they -- the things that they need or experience -- getting more detail, as Or mentioned, being able to get that intelligence in different regions. So people are expanding within products to to additional regions and also where they need some of the deeper product information like shopper, where we saw shopper intelligence pick up this quarter.\n\nI think that's something that we're starting to see. And more and more customers are actually integrating our solutions into their stuff. And we're seeing some great movement on our OEM strategy as more and more customers are integrating Similarweb into their products. So those kinds of things, to the extent that they continue during these kind of macroeconomic trends, we think are going to be upsides to the number and things that we continue to watch for.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nAwesome. That's very helpful. Thanks. Thanks again, guys, and nice job.\n\nJason Schwartz -- Chief Financial Officer\n\nThanks so much.\n\nOperator\n\nThank you. Our next question comes from the line of Noah Herman with J.P. Morgan. Please go ahead.\n\nNoah Herman -- JPMorgan Chase and Company -- Analyst\n\nHey, guys. Thanks for taking my questions and congrats on a solid quarter. Can you provide us any color on maybe customer usage on the platform? And what are your expectations for pricing going forward? Thanks.\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nPricing on the platform? Can you repeat the question?\n\nNoah Herman -- JPMorgan Chase and Company -- Analyst\n\nYeah. Just any change in maybe pricing or maybe you could touch on any any pricing power you have for the platform itself?\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nAnd the pricing and packaging, I think, is an area that we are still not optimized as well as they want us to be. And I think that the more our solution is more deep and more holistic that they're introducing better pricing and packaging to our customer to have a win win. And similarly in business, we have a strong belief about win win. The more our customers get more ROI from the platform, then we can -- able to increase the price.\n\nSo we are driving into an area where each one of the lines of business, we have five of them, we will have a very strong meta approach. On top of that, to have a good, better, best to each one of them. And an arsenal of add-ons and plug in you can add on top of that. So we are not in the perfect place but we're always optimizing them.\n\nAnd we just hired a director of pricing and packaging so I really hope that there's a lot of leverage to -- that we're more efficient there. I hope that answered the question.\n\nNoah Herman -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you. And just maybe any color on what you're seeing in terms of usage from customers maybe over the past few months and what you've been seeing heading into the most recent quarter as well?\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nUsage is going up and always we are putting a lot of effort in our product team to work on discoverability and easy to use of the platform. So we have ongoing team that's always working to improve usage and not only the day-to-day users. It's also to help customers to discover more and more feature. We have a very big platform with many functionalities.\n\nSo it's something that we are working on and we're having great success.\n\nNoah Herman -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Brett Knoblauch with Cantor Fitzgerald. Please go ahead.\n\nBrett Knoblauch -- Cantor Fitzgerald -- Analyst\n\nHi, Or and Jason. Thanks for taking my question. I'm just wondering if you could provide some incremental color on the demand you're seeing for your App Intelligence product? Is that exceeding your expectations? And then similarly, update on maybe adoption of your shopper intelligence product as well as that has much higher ACBs. How is the sales force thinking about selling those two? Are they prioritizing either of them? Are they still landing with your core digital research and digital marketing products?\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nAnd so, first of all, thank you for the question. And so regarding the the App Intelligence model, so the first initiative were great. So we have hundreds of requests from many, many customers to send demo, getting more information about this new offering, and we've a very good indication. And also, we already close numbers of deals.\n\nSo it's a good momentum. But also, as the market dynamics becoming tougher, we've seen that it's taking longer to grow this pipeline. So we thought of the market dynamic. We're also seeing there -- some of the first initiatives are great.\n\nRegarding shopper software intelligence, so indeed it was introduced to the market with very high APV. And mostly because we launched the product and we didn't put a lot of ways to have good, better, best offering there. Sell it with as much as you can for one big price because it was having good momentum in the beginning but down the road it was tougher to continue because every industry or sector on different part of the platform and it was all chosen for the price. So I think a few months ago, we changed and the ability for us to also slice and dice the so-called offering and introduce good, better, best offering.\n\nAnd this allows to scale the number of acquisitions for shop only school go, which was very good compared to the quarter before that. And regarding the couple, they're really doing well as always.\n\nBrett Knoblauch -- Cantor Fitzgerald -- Analyst\n\nThank you for that. And then maybe just on your full-year revenue guide, it kind of implies a 13.5% sequential growth between 3Q and 4Q. And you look at last year, you grew, call it, 12.5% or so in that time frame. Backdrop is obviously much more difficult in this macro environment.\n\nSo can you just help us understand what gives you confidence that you're going to see the kind of acceleration in 4Q faster than what maybe what you saw last year, given the relatively more uncertain macro environment?\n\nJason Schwartz -- Chief Financial Officer\n\nYeah. So we look at the backlog and the deals that we've got in place and as well as just the pipeline that we're looking at and the discussions we're having. We put all that together and that helps us form our guidance and confidence that we have to put that together. Our goal is to always aim to give you guys the guidance that we know we can meet, and we continue to do that through these times as well.\n\nBrett Knoblauch -- Cantor Fitzgerald -- Analyst\n\nAll right. Understood. Thanks very much. Thanks, guys.\n\nOperator\n\nOur next question comes from the line of Pat Walravens with JMP Securities. Please, go ahead.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you. And let me add my congratulations on the continued growth. All right, Jason, let's talk about cash.\n\nSo you have $94 million on the balance sheet. You burned $19 million on a normalized basis. I guess the collections will be better in the back half of the year. But even so, the operating losses you're guiding to are still in the $20 million per quarter.\n\nSo the bear case, which I just think we should we should address it, is that you have five quarters of cash, right? I know that's not the case, but let's address it. And you haven't guided yet for next year. So what can you tell us, where are you comfortable having that cash balance bottom? When do you expect to be free cash flow positive? When do you think you'll make these decisions?\n\nJason Schwartz -- Chief Financial Officer\n\nGreat. Pat, thanks so much for the question. Yeah, so you're right. We ended the quarter with just under $94 million of cash on the balance sheet.\n\nBut I'll remind you, we also have a $75 million undrawn credit facility. And so we view ourselves having over $160 million of liquidity and feel very comfortable with the cash and the liquidity resources that we have available for us in order to execute on our plan. That being said, one of the things that we continue to do is focus on that same disciplined execution that we've done throughout our history. I like to always go back to where we were pre IPO.\n\nPre IPO, we took this company from being a minus $26 million cash burning company in 2018 to the following year, cutting that burn by more than a half -- by more than 50% to $11.5 million. And then the following year for less than $5 million in Q1 2021, right, before going -- becoming public, we turned into a cash generating cash, positive free cash flow company. And then what we did as part of our execution was to accelerate that growth, use the proceeds of the IPO to drive that growth on very favorable unit economics and deliver the kind of growth and outstanding results in terms of net customer adds in terms of ARPU per customer, revenue per customer, and of course, the the net retention boost driving to an over 50% revenue growth. What we're doing now is continuing to balance growth and cash flow, and we're making those decisions proactively in order to be more efficient.\n\nYou're already starting to see that come through this quarter in terms of the margin improvement all across the P&L. And we think that those are the indications that you -- that hopefully the investment community will be following to show -- to see that operating efficiency come through. And as we've guided, this is something that we've been focused on to get to that sustainable free cash flow. Already talking about that earlier this year when we started our -- guiding our 2022 numbers and that we continue to be focused on that as we plan for 2023 and beyond.\n\nPat Walravens -- JMP Securities -- Analyst\n\nAll right. Great. Thanks for that perspective, Jason.\n\nJason Schwartz -- Chief Financial Officer\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nThank you, everyone. Jason?\n\nJason Schwartz -- Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nRJ Jones -- Vice President, Investor Relations\n\nOr Offer -- Co-Founder, Director, and Chief Executive Officer\n\nJason Schwartz -- Chief Financial Officer\n\nRyan MacWilliams -- Barclays -- Analyst\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nUnknown speaker\n\nTyler Radke -- Citi -- Analyst\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nNoah Herman -- JPMorgan Chase and Company -- Analyst\n\nBrett Knoblauch -- Cantor Fitzgerald -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nMore SMWB analysis\n\nAll earnings call transcripts"
}