{
  "companyName": "Brinker International",
  "companyTicker": "EAT",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/brinker-international-eat-q4-2022-earnings-call-tr/",
  "content": "Brinker International (EAT -4.80%)\nQ4 2022 Earnings Call\nAug 24, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Brinker International Q4 F'22 earnings conference call. At this time, all participants have been placed on a listen-only mode and the floor will be open for questions and comments after the presentation. It is now my pleasure to turn the floor over to your host, Mika Ware, VP of finance and investor relations at Brinker. Ma'am, the floor is yours.\n\nMika Ware -- Vice President of Finance and Investor Relations\n\nThank you, Paul. And good morning, everyone, and thank you for participating in today's call. With me are Kevin Hochman, our chief executive officer and president; and Joe Taylor, our chief financial officer. Results for the quarter were released earlier this morning and are available on our website at brinker.com.\n\nAs is our practice Kevin, and Joe will first make prepared comments related to our operating performance and strategic initiatives then we will open the call for your questions. Before beginning our comments, I would like to remind everyone of our safe harbor regarding forward-looking statements. During our call, management may discuss certain items which are not based entirely on historical facts. Any such items should be considered forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nAll such statements are subject to risks and uncertainties, which could cause actual results to differ from those anticipated. Such risks and uncertainties include factors more completely described in this morning's press release and the company's filings with the SEC. And of course, on the call, we may refer to certain non-GAAP financial measures that management uses in its review of the business and believes will provide insight into the company's ongoing operations. And with that said, I will now turn the call over to Kevin.\n\nKevin Hochman -- Chief Executive Officer and President\n\nThanks, Mika, and good morning, everyone. With this being our first call since Wyman's retirement, I wanted to take a moment to recognize him as the leader of our great company for the past nine years and to thank him for our many strategic accomplishments. In addition to being a coach and a friend to so many Brinker heads, Wyman led the growth of our brand's significant technology improvements and developed an industry-leading off-premise business. I know he's listening and cheering us on, so on behalf of our 62,000 team members, thank you, Wyman, for entrusting your legacy to us and preparing us for the future.\n\nThis organization has a solid foundation, well-known brands that have stood the test of time, and an ownership model that allows us to move quickly, a strong leadership team and the most dedicated operators in the industry. During my first two months on the job, I've spent a lot of time in the field with our restaurant teams and our above restaurant leaders to better understand their challenges and to exchange ideas on how we can accelerate the business together. I'm happy to share they are hungry for growth and they have great ideas on how we can make running restaurants easier, more profitable, and a better experience for both our team members and our guests. And while I'm forming our longer-term growth strategy with our senior executive team, in order to deliver better results over time, we must deliver meaningful improvement to the four-wall economics of owning a Chili's and owning a Maggiano's.\n\nSo we're working quickly to identify the things we can do to grow the business sustainably, improve the guest experience, reduce cost and complexity, and implement more strategic pricing, which will in turn expand restaurant margins, and grow profits. Our evolved pricing strategy will include providing focused, everyday value for guests who need it, but will move away from frequent and deep discounting. We will also right-size the mix of everyday menu items offered on deal, but we'll make sure there's something available for the cashed-up customer who needs a superior value to enjoy casual dining. We will also do a better job of recovering expenses for inflated commodities as well as the added costs for delivering Chili's, Maggiano's, and our virtual brands.\n\nI have chartered two teams of senior executives to make quick interventions that will build momentum in our business. One team is dedicated to near-term ideas to drive sustainable and profitable sales layers. They have been charged with identifying customer insight-driven sales opportunities, as well as bringing exciting new initiatives to our dining rooms to help accelerate traffic recovery. The other team is charged with simplifying operations so we can improve our guest experience.\n\nWe will take unnecessary cost and complexity out of the business, which will free up labor to reinvest in the things that will help us win with the guest. The team is looking at all aspects of operations from focusing on the menu, to streamlining back-of-house prep, to eliminating time-consuming processes that don't add value to our guest experience. We shared some of those early ideas with our operators at our annual Chili's General Manager Conference last week, and I have to say the team is very excited to get after it. I have also asked our Chili's executive team to refocus the portfolio, a project we are working on to prioritize the most important and stop the ones that won't have a meaningful impact on our core business.\n\nI'm very pleased with the progress we are making on the prioritization front. As for our longer-term strategy, our biggest opportunity is also to focus on the core Chili's business. We must identify how our brand can uniquely add value for guests in a modern and relevant way, strengthen our positioning within casual dining, leverage technology to remove friction for guests and team members, and continue to reduce unnecessary complexity. All of which should lead to a better guest experience, higher sales, and stronger four-wall economics.\n\nI am also very pleased to share that we brought on George Felix as our new Chili's chief marketing officer. George is known for taking well-known brands and reminding customers what makes their brand special in a contemporary, relevant way. He is currently working to define our Northstar positioning in the market, which will help us make strategic choices on marketing, as well as help, guide us on where to focus operations and improve our guest experience. I'm excited that George is already making an impact with several of our sales driving and simplification initiatives.\n\nAs for Maggiano's, it's on a good trajectory. The improvements we made to both off-premise business and removing costs from the middle of the P&L during COVID have allowed the brand to emerge much stronger. Maggiano's menu travel is off-premise exceptionally well, and now that dining rooms are coming back, we have lots of runway for growth. I couldn't be prouder of the work that Steve Provo and his team have led to getting Maggiano's through the pandemic, which I would expect will continue to be a source of growth for our business.\n\nWe find ourselves in interesting times with the inflationary environment, a dimmer economic outlook, and a worried consumer. I'm confident the interventions we're putting in place today to simplify operations, to win with the guests, to implement more strategic pricing, to launch sales-driving initiatives, and to take cost out of the business will help us fight through our near-term challenges. They will also build the momentum we need to put the business in a stronger position for longer-term, sustainable growth. Now, I'll hand the call over to Joe to walk you through the numbers.\n\nGo ahead, Joe.\n\nJoe Taylor -- Chief Financial Officer\n\nHey, thank you, Kevin, and welcome to the quarterly earnings calls. And good morning, everyone. As detailed in this morning's press release, Brinker reported total revenues of $1.22 million for the fourth quarter of fiscal year '22. Consolidated comp sales for the quarter rose 3.1% as pricing and mix increases offset negative traffic.\n\nFourth quarter adjusted EPS was reported at $1.15. Now, let me unpack several of the pieces from the top line through the bottom line results. As a reminder, we had the 53rd week in the fourth quarter of fiscal '21, which impacts the year-over-year comparison of revenues, margins, and EPS for the recently completed quarter and fiscal year. Our restaurant comp sales are stated as 52-week comparisons.\n\nAt the brand level, Chili's comp sales on a year-over-year basis were positive 0.3% lapping fourth quarter comp sales of 59.8% in the prior year. Looking at sales performance relative to the pre-COVID environment. Fourth quarter average weekly sales of 59,500 were up 4.5% when compared to the fourth quarter of fiscal '19. Traffic was negative at Chili's for the quarter and decelerated throughout as some guests appeared to react to the challenging inflationary environment, particularly during the weeks of very elevated gas prices.\n\nWe also experienced approximately a 1% negative sales impact to the quarter as some restaurants were not able to fully open dining rooms, particularly at peak times, or had to throttle back online orders giving limited staff availability. I would note that Chili's traffic trends since the end of the quarter saw sequential improvement into August, although they remain in the mid-single digit negative territory. We did see positive sales and traffic in Chili's dining rooms for the quarter as guests returned to more normal dine-in routines. At the same time, their off-premise channels remain strong, constituting approximately 34% of sales during the quarter.\n\nMaggiano's continued a solid recovery, posting positive restaurant comp sales of 30% for the quarter, driven by positive price, favorable mix, and strong traffic from the return of their dining room guests. When compared to the pre-COVID fourth quarter of fiscal '19, average weekly sales increased by 7.3%. Importantly, the post-COVID level of the brand's off-premise business remains intact at above 20% of sales, providing a meaningful avenue to improve guest frequency as the brand moves forward. Brinker's franchise and other revenue increased year over year, due to incremental gift card breakage and increased banquet revenue related to Maggiano's.\n\nMoving further down the P&L. Our fourth quarter restaurant operating margin was 10.3%, down from the prior year due to the magnitude of inflation we experienced throughout the major categories of restaurant margin. Restaurant margin was also negatively impacted by approximately 80 basis points from lapping the 53rd week of the prior year. Food and beverage costs as a percent of company sales were unfavorable by 310 basis points compared to the prior year.\n\nAs you might expect, this was driven by higher commodity costs, with inflation hitting close to 15% for the quarter, a high for the fiscal year. Every major commodity category was negatively impacted, with poultry being our largest year-over-year increase. Chicken mix is high across our menus, with approximately 52% of our overall protein mix exposed to the high-cost dynamics of the poultry market. Fortunately, we're now starting to see steady cost reductions for chicken working their way into our supply chain.\n\nA trend that has the potential to create favorable cost comparisons as we move further into the fiscal year. Labor for the quarter was in favorable 70 basis points, primarily driven by wage rate increases in the 6% to 7% range. Additional hours were utilized in the restaurants as we incrementally staffed our dining rooms and continued elevated levels of training expense for new team members as a result of higher turnover rates than we traditionally experience. Restaurant expense was unfavorable by 280 basis points as higher energy prices inflated our utility expense, and we experienced higher rent and increased repair and maintenance costs.\n\nWe also lapped a one-time advertising-related credit of approximately $6 million taken in the fourth quarter over the prior fiscal year. Operating cash flow for the fourth quarter and fiscal year remained strong with $41 million and $252 million recorded for those time frames, respectively. Adjusted EBITDA for the quarter totaled $100 million, bringing the fiscal year adjusted EBITDA to $355 million. Now turning to our outlook for fiscal year '23.\n\nThis morning's press release included several target ranges for our current fiscal year. Our cautious view of economic conditions, particularly for our value-oriented guests, reflects negative traffic expectations in the low single digits for Chili's. We believe the significant headwinds from commodity inflation will lessen as we move through the year, a trend that could continue for a period beyond the current fiscal year. Our year-over-year increase in food and beverage costs is forecasted to be at their highest point, almost 400 basis points in the current first quarter before narrowing mid-year and turning favorable year over year by the fourth quarter.\n\nFor the year, food and beverage costs are expected to be up in the neighborhood of 100 basis points. For the full year, we have the following expectations, revenues in the $3.9 billion to $4 billion range, capex in the $155 million to $165 million range, weighted average shares in the $44 million to $45 million range, and annual adjusted EPS in the range of $2.45 to $2.85 for the fiscal year '23. As it relates to pricing, we are planning near-term pricing actions for both brands. Chili's is expected to exit the first quarter at close to 8% price, a level the brand will maintain throughout the fiscal year.\n\nMaggiano's will exit the first quarter in the mid-5% range and is anticipated to average closer to 7% for the year. Regarding restaurant development, the schedule for our current fiscal year has slowed somewhat as several anticipated openings are pushed into fiscal 2024. We now anticipate opening 19 new locations during the fiscal '23 year. Let me provide some insights on quarter one.\n\nOur current first quarter is likely to be the low point of our operating results for the fiscal year, as we work through the cresting of inflationary pressures for our brands. With that in mind, let me provide some specific insights for the quarter that also help define the expected meaningful positive progression of operating performance, as we move into and through the remaining quarters of the year. As is typical, we expect the first quarter to be our lowest revenue quarter, generating between $920 million and $930 million of company sales for the period. The year-over-year impact of inflationary increases for the first quarter will increase costs in all the major categories of restaurant margin.\n\nFood and beverage expenses alone are expected to be up more than $50 million for the quarter. When combined with the lower revenue of this quarter, we expect restaurant operating margin to be between 4.5% and 5.5% for the first quarter. This restaurant margin will result in an overall operating loss for the quarter with a negative operating margin expected in the mid-3% range and first quarter adjusted EPS estimated in a range of negative $0.70 to negative $0.60. While we anticipate a disappointing start to the fiscal year, we maintain a clear line of sight to meaningfully improved operating performance throughout the year as incremental pricing, lower food, and beverage costs, and sales driving initiatives all kick in during subsequent quarters.\n\nOn behalf of the Brinker leadership team, we're pleased to have Kevin on board. He has quickly focused the team on simplifying operations, improving four-wall economics, and driving growth in the core business. I'm confident that this will not only move us through the current more difficult operating environment in better form but will provide the foundation for sustainable long-term growth and better profitability for Brinker and its brands. And with my comments now complete, let us turn it back over to Paul to moderate your questions.\n\nOperator\n\nThank you. Ladies and gentlemen, the floor is now open for questions. [Operator instructions] And the first question is coming from David Palmer from Evercore ISI. David, your line is live.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThanks. Good morning. Just a question on strategy. Kevin, you talked about some opportunities to improve the economics of the -- in the four walls with, perhaps pricing being a part of that.\n\nBut I'm wondering more about the investment areas that you see as an opportunity, is that labor, is that marketing? How are you thinking about ways that you can improve that guest experience that you were talking about in driving sales, in your highest margin business? Thanks.\n\nKevin Hochman -- Chief Executive Officer and President\n\nYeah. Thanks for the question, David. So we're thinking about it in two ways. One is there are some short-term interventions that we have to make that we just can't -- we cannot wait to make those interventions based on where the business environment is now.\n\nAnd so, what I had the team working on is the short-term wins and then we'll talk in a second about what we're doing from it on a longer-term basis. So, I've charged a team with how we improve restaurant margins quickly. And obviously, the number one thing is to grow comp store sales. So we've got a growth team that we spun up that is looking at what are different areas that we can quickly grow the business and kind of mute some of the headwinds of traffic that we've seen.\n\nObviously, strategic pricing, which we talked about in our prepared comments, there is a significant reduction in discounting that we're working on, that's in a couple of areas. One is we give away a lot of free food and our My Chili's Rewards. There's probably a better way to do that and still maintain the traffic that that drives without, constantly giving away free food every week. As well as redoing some of the value sections of our menu so that we don't have so much of our menu mix on the deal, but still have very attractive, exciting offers on whole meals for that guest that's cash trapped that otherwise couldn't enjoy casual dining.\n\nAnd then we're also working on some cost reductions that will also help with also labor would simplification in a restaurant. So specifically that's eliminating low mixing or redundant menu items, eliminating redundant pantry SKUs that are in the back of the restaurants, removing unneeded dishware which will help with both labor as well as some cost on small errors, and eliminating unneeded processes that happen that don't really help the guests but end up being literally years of labor hours annually that we're spending money on, and then, reducing administrative work in the back of the restaurants that's not helping the guest. We also are working on some new item innovations to drive traffic, which I'm excited that you'll see in the next couple of weeks of starting to roll out, which will also help drive some traffic in our bar. And then, the last thing that we're doing is updating our strategic loyalty program to drive more traffic by reducing some of those discounts, I was telling you.\n\nThat's the kind of short-term interventions that we're making. I'm meeting with my leadership team offsite in the next couple of weeks that we're going to talk about, what are the big things that we need to do over the next few years to unleash both restaurant margins and accelerated growth for our business. And I think those are the big discussions on labor, and equipment, and all the things that we need to make long-term improvements in the guest experience. And I hope, when we're ready to surface with those interventions are that we'll be able to share them with all of you.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThanks. I'll pass it on.\n\nOperator\n\nThank you. And the next question is coming from Nicole Miller from Piper Sandler. Nicole, your line is live.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nThank you so much. One for you, Joe, first and then I have one for you, Kevin, as well, if I can sneak it in. But Joe, you said something about dining rooms, 34%. Can you just -- can you walk us through, please, in the fourth quarter or even for the year, frankly, doesn't matter the construct of the revenues for the dining room off-premise? And I guess kind of the everything else bucket, but it would be nice to get at that It's Just Wings.\n\nJoe Taylor -- Chief Financial Officer\n\nYeah. Nicole, I think the comment you're referring to is 34% of the fourth quarter Chili's sales mix was off-premise, which is relatively --\n\nNicole Miller -- Piper Sandler -- Analyst\n\nThat was off-prem. OK.\n\nJoe Taylor -- Chief Financial Officer\n\nThat was off-prem. We did see, slight traffic improvement and positive comp in the dining rooms for the quarter. You're starting to see, I think, a little bit more of a normalization of that dine-in experience. So the relative mix dine-in into two off-premise has remained relatively consistent and that kind of two-thirds, one-third, mixing area over the course of the year.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nPerfect. Just want to match that up with what margins might be in those channels. And then, Kevin, can you talk about, the customer base you have today? And as you think through the strategy options, and totally understand your thinking through them, is it changing that mix? Is it changing the frequency, both like how are you thinking about that?\n\nKevin Hochman -- Chief Executive Officer and President\n\nWell, we have to start with just who our customer base is today. And it's pretty broadly spread out. So it's not like we're, overrepresented with low-income guests or high-income guests. It's pretty much representative of the casual dining population, and so we have to play a barbell on this, right? Number one, we have to make sure that low-income guests that is extremely cash trapped.\n\nHow do we make sure that we have offerings on the everyday menu, that they know they can get an affordable meal at Chili's and be excited about that and continue to come in? On the flip side, we've got to mitigate how much trade down that we get from our guests that can afford more, as well as start to innovate so that we can drive both check and traffic with that guest. So we think there are a lot of opportunities, both in terms of food innovation, as well as in drink innovation to drive a higher check, guest check, as well as drive more traffic with those guests.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is coming from Chris O'Cull from Stifel. Chris, your line is live.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nThank you. Good morning, guys.\n\nKevin Hochman -- Chief Executive Officer and President\n\nHi, Chris.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nI had a question for Joe and Kevin. First, Kevin, I'm interested in hearing your assessment of the virtual brands and maybe how important you believe those brands will be to the company's future growth.\n\nKevin Hochman -- Chief Executive Officer and President\n\nYeah. So let me just start with virtual brands will continue to play a meaningful role in our business. I mean, they're currently about 6% of the mix. So, they're a part of our business now.\n\nThat said, we do need to right-size the time and attention, and investment for a sales layer that is 6% of the business. So specifically we have to make sure that we're right-sizing the amount of incremental pantry SKU ingredients that we need to service these brands. For example, on Maggiano's virtual brand, it's currently 26 unique SKUs to service about 2% of the business, that is just too much, right? So we've got to make sure that we cut that number probably by more than half. We think we can retain most of the sales mix on that business, but make it a whole lot easier for our team members to run that part of the business, as well as mitigate a lot of the food waste that shows up in cost in our business.\n\nOn the opportunity on It's Just Wings, it's a lot less in terms of simplification because it was designed, I think exceptionally well to marry within our kitchen. There are really two things we're working on that brand. One is we have a smoked wing on that lineup that is extremely well mixing. It provides a lot of food waste.\n\nWe think that most of that volume will migrate back into It's Just Wings. So we think that we can improve the P&L on It's Just Wing by eliminating that item. The other thing that we're working on It's Just Wings is because a lot of those orders come in a very tight window and typically it's during that kind of busy dinner service, we get kind of stopped up sometimes on zone one, which is our fry zone. And so we've got to make sure that we figure out ways to build capacity in that area because I think both It's Just Wings as well as in the Chili's business that zone one will be a source of growth going forward.\n\nSo we're working very closely with our operations team and understanding how we can free up some capacity in zone one. The other things that we're doing to grow the business, we're going to take pricing and virtual brands as the vast majority of businesses go out to delivery customers who are much more focused on convenience and are willing to pay for that convenience, I know that from my pizza days. And then, we are going to be taking some of the virtual brand investment and putting it back on core Chili's. And we just look at the numbers even in just off-premise core Chili's does roughly 5 to 6 times the business in our virtual brands.\n\nAnd so we think there's also an opportunity not just in the virtual brands, but growing off-premise on the core Chili's business. We also have some growth ideas for virtual brands. So one of the big ideas that I'm really bullish about that we're going to be rolling out next week is taking all of the It's Just Wings, wing flavors, and curly fries, and putting them on core Chili's. And if you think about that, the core Chili's does about 24 times the sales of It's Just Wings.\n\nSo why not take these amazing flavors, and these amazing curly fries, and put them into Chili's business, as a premium at the bar? We are very bullish on what that could mean for the business. And likewise, we have an amazing -- we call it the Crispy Chicken Crispers, it's a chicken tender. Why not take that product on Chili's, and put it in It's Just Wings to create a meaningful business in that business? Chicken tenders in the chicken segment are a lot bigger than chicken wings. So we think, we'll probably never sell more chicken tenders than chicken wings on It's Just Wings.\n\nBut we think it could be a meaningful source of growth without any new incremental SKUs, or incremental training, or incremental process for the back of the house. So we're very bullish on being able to leverage some of the great items on It's Just Wings on core Chili's, as well as doing it vice versa to grow both businesses.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nThat's helpful. Thank you. I just had another quick one for you, Joe. It looks like the company expects earnings to increase by about 18% and 19% for the last three quarters of the year.\n\nAssuming the midpoint of your guidance for the first quarter in the full year. Is that about right? And are there any unique things that are going to drive that growth?\n\nJoe Taylor -- Chief Financial Officer\n\nYeah, it definitely is a forecast that obviously starts off in a negative position and ramps up quickly as we move to the last three quarters. A number of things, and obviously, the pricing initiatives we've talked about is the elimination of discounting has an incremental impact as we move through the fiscal year. The commodity, the inflation cycle and cycle and total, but specifically the commodity cycle we see materially improving as we get through the year and actually turn to a year-over-year favorable dynamic as we move into that fourth quarter. So yeah, that hockey stick is in place, and we have a pretty good line of sight to it too.\n\nI think you kind of hitting the dynamics based on the points and the guidance that you're referencing. So, yes.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks, guys.\n\nOperator\n\nThank you. The next question is coming from Jeffrey Bernstein from Barclays. Jeffrey, your line is live.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nGreat. Thank you very much. Two questions, first, Kevin, excited to obviously have someone from the industry leading the team. Just wondering if you can maybe talk about the differences you see between running a QSR versus a casual brand and seemingly a franchise system that is primarily a company-operated system.\n\nIf you could talk about maybe the collateral implications or the potential synergies that you see and maybe what your greatest strengths are as you make that transition from one type of business to the other?\n\nKevin Hochman -- Chief Executive Officer and President\n\nWell, it's a great question. I'd start with some of the real positives that I see, the fact that we own, most of our own of our restaurants has allowed us to move a whole lot faster, I think than we would be able to do in a franchise system, and we need to make some quick interventions. And so, the teams have really responded well and it's allowed us to move very fast. I think as we get further down the road in terms of technology improvements, one of the things that I'm talking about, with our leadership team is what can we use technology to do, to make it both a better experience for the guests as well as, take some of the work out of the team members hands.\n\nAnd, in a world where we own most of our own restaurants, it gets a whole lot easier to test and roll out a whole lot faster. So technology, as and everybody that covers the industry is where everything is going, right? So I think that's going to be a huge advantage for us. I think there are some things I can bring from kind of my QSR days that I think can help the business. I think more strategic pricing, I think QSR does an exceptional job of understanding, how do we make sure that the great values that we offer in advertising drive traffic.\n\nAnd so we need to make sure that we have industry-leading value with our 3 for Me program that starts at $10.99. And yet, in my experience, because we haven't spent a whole lot of dollars on it, a lot of customers don't know about it, right? So, one of the lessons in QSR is, if you're going to have a great value, going to make sure that you talk about it and quite frankly, have been a little bit invisible, in our business the last few years. And we need to get back on air once we're ready to do that. So that's one example.\n\nAnother thing I think that we can bring is, how do we manage the merchandizing of value and the merchandizing of items at the restaurant level to make sure that we're driving as much check and trade up as we can, as well as minimizing trade down. I think these are very obvious opportunities that I've seen early on and that we're working on, and I think you're going to see improvements in our restaurant margins because of some of those learnings I'm bringing from QSR.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nUnderstood. And the follow-up, just because of the fact that you come from a portfolio of brands and I was wondering whether you could offer some thoughts on how you see Brinker best positioned. And you look back a decade or so, and Brinker had eight or nine brands now running two, along with a couple of virtual brands. And I was wondering how you think about a portfolio versus a single brand approach, whether you have any views on that as you look forward?\n\nKevin Hochman -- Chief Executive Officer and President\n\nYeah. I don't have a perspective on that now. I know that's probably not the answer that you want to hear. I'm really focused on improving the four-wall economics of both Chili's and Maggiano's, and that's really what I've kept the team focused on right now.\n\nObviously, if we can do that successfully, that opens up a whole lot more opportunities in the future for whatever we want to do in terms of a long-term strategy. But it starts with making sure that we have very strong restaurant margins and four-wall economics because we own all these Chili's and Maggiano's, and that's what I'm committed to doing with the team.\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nUnderstood. Thank you. Best of luck.\n\nOperator\n\nThank you. And the next question is coming from Andrew Strelzik from BMO. Andrew, your line is live.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nHey, good morning. Thanks for taking the question. I just had two for me, one first. As a follow-up, do you have a sense based on, obviously, the cost environment pricing that you're talking about some channel shifts that have occurred over the last couple of years? Do you have a sense for what restaurant margin this business should be able to achieve, kind of as you are a goal may be in mind, as you kind of work toward implementing the strategies that you've talked about? And then, my other question is just on capital allocation priorities.\n\nObviously, no buyback in the guidance, which is not unusual, and lower capex, it sounds like some delays in the unit growth. I'm just curious, should we expect any changes in their kind of overtime? And does accelerating unit growth, which I know had been in the plan. Does that make sense now? Thanks.\n\nKevin Hochman -- Chief Executive Officer and President\n\nYes. Let me take the restaurant margin question, and then, I'll kick it over to Joe on the new build question. So we're in the -- we're kind of in the low double digits right now. I think, between 10% and 11% restaurant margins.\n\nWe think that we can probably get to the mid-teens. Now, I don't know -- I don't have a specific timetable exactly on when. So -- but when we look at, I think we can get we can get a couple of points when we think about strategic pricing and reducing discounting, and then we think about operational improvements and leverage if we can get the business growing. Now, I think mid-teens are achievable and that's where I'm going to have the team focused on.\n\nI think if we can get to those numbers, certainly it's going to unlock a lot of value for our business. And that's what I have the team is laser-focused on.\n\nJoe Taylor -- Chief Financial Officer\n\nAnd I think that goes right into the capital allocation nicely because obviously, that will feed future capital allocation discussions as we go forward. Andrew, you're right, this year, cap allocation is pretty straightforward. We're focused on the capex dynamics that $155 million to $165 million, which is the same buckets we've typically seen in there from development to reimage to obviously a big chunk of that are return maintenance expenses within the current fleet and IT. And so it's a fairly straightforward and typical construct on the capex side of the equation, the new build construction has slowed somewhat, the markets a little bit longer date timelines on some of the construction, you have seen some increased costs which have caused us to pull back in different places to make sure that we are -- if we are constructing, we're constructing within a dynamic that we think we can get a good return.\n\nAnd we've been pleased with the restaurant development we've done the last couple of years and the operational performance of that cohort. So, yes, I'm comfortable as we kind of move forward, continuing the restaurant development, we think it's a great opportunity to provide some incremental growth into the equation as we go forward. Obviously, improving the four-wall economics is one of the best things we can do to continue to bolster the performance return of not only the existing fleet but these new builds as we move them forward. So we'll continue with a new piece of the equation.\n\nOther pieces of capital allocation down the road, obviously, we'll look at those opportunities based on the performance of the overall company and the cash flow generation. So that's kind of where the near-term is with the opportunity down the road.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. And the next question is coming from Brian Mullan from Deutsche Bank. Brian, your line is live.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nHey, thank you. Just a little bit of a follow-up on development. The 19 that you are going to open this year, are these the ones that are simply under some form of construction now? And then, pausing a bit for the rest of the time all the operations get tightened up. Or is that not the case? Just a little clarity there.\n\nAnd then Kevin, it would be great to hear your longer-term thoughts on Chili's development opportunity. How do you think about it over the long term? And do you need to see those mid-teens restaurant-level margins restored before you'd really want to lean in there aggressively? Just any thoughts on, how you're thinking about it?\n\nJoe Taylor -- Chief Financial Officer\n\nBrian Yeah, I think it's not a bad way to think about it. It's not universal to where we've gone from the higher 20s that we talked about down to 19, but we have pushed back, some have pushed back just under the timelines that it's taking to develop and open a new restaurant. But we've also pushed back starting times for development and things of that nature. All those 19 are in the process.\n\nYeah, so you're talking about committed leases and in most cases, some level of construction starting with that. So it's most of those openings will take place in the first half of the fiscal year. Couple as you kind of move into the early part of the second half and we'll continue to then develop what that pipeline looks as we move more into the F'24 timeframe. And we could communicate that as we kind of go through the rest of this fiscal year.\n\nKevin Hochman -- Chief Executive Officer and President\n\nYeah. And to answer your question, how I think about development, I think it's kind of twofold. One is, as we complete our Northstar work about, what is -- where Chili's positioning in the marketplace, I think that will help us think about what is the next-gen Chili's looked like. So obviously, it's maybe it's not as big a dining room space and it's optimized for off-premise.\n\nWe certainly can optimize the kitchen if we understand the Northstar better. That will create, obviously lower build costs. And then, concurrently we can improve restaurant margins that will obviously, accelerate paybacks, right? So, in order to answer your specific question of like, are we waiting to get to, mid-double-digit margins to start accelerating builds again, it's hard to answer that question until we get into the details of how much cost can we take out of the building based on a next-gen Chili's as well as, how fast we accelerate margin improvement. But I do think the fact that we can get to better margins, the faster we can return to building again.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is coming from John Glass from Morgan Stanley. John, your line is live.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThanks. Good morning. Congratulations, Kevin. Great to hear your voice.\n\nFirst, Kevin, I just want to maybe sort of put together the pieces, as you drive through or endeavor to restore traffic, you're talking about strategic pricing, you're talking about reducing a decent amount of discount. Those generally don't coincide with better traffic. Was it your analysis that the discounting, and the promotions that My Chili's awards just did not drive traffic, so we're moving them? Isn't it an impediment to restoring traffic? How do you make that decision? And why do you think there is a risk of further degradation in traffic if you remove some of those promotions?\n\nKevin Hochman -- Chief Executive Officer and President\n\nYeah. Well, as John, there are lots of different ways to drive traffic, right? And, one of the things I think we need to evolve over time is driving the right traffic that is sustainable growth versus the traffic for traffic's sake. So so let me give you a couple of thoughts on how I'm thinking about driving traffic, which I think is kind of at the heart of your question. We have seen low-income customers start to visit less often, which is why we've seen those traffic trends turn negative.\n\nWe are implementing several initiatives to call back as much of that traffic back. So the first thing is on that low-income customer that I think you're kind of referring to when you're talking about, the ability for those discounts to drive traffic, and we simply need to do a better job of talking about the unbeatable value that we have on a 3 for Me menu. And so, specifically, you can get chips and salsa, a burger, fries, and unlimited soft drink refills and it's just $10.99. And we have a few other entrees that start at that price point, too.\n\nAnd I will tell you, we had a -- it was like a famous broadcaster, Jeff Lewis, on his radio show. We didn't pay for that. He just kind of went to a Chili's in Encino and just raved about how much food he got from -- at an $11 price point from Chili's. And there are two observations from that, and then, he talked about it for the next couple of days and brought another celebrity in with them.\n\nThe first one is we have an unbeatable value at a time that customers needed the most. And that was clear from just hearing him rave about the amount of value that he got from that 3 for Me deal. But the second thing that it tells me is we have to do a much better job of talking about it. So our guests are aware of that value, right? So we have a great value in the restaurant today.\n\nWe don't plan on getting rid of it any time soon. And so what are the things that we can do with our limited marketing dollars to make sure that we're driving awareness of that? Right now, we're spending our limited marketing dollars primarily either on talking about, free things that are available with My Chili's awards, or focused on digital off-premise and the virtual brand. So I think there's an opportunity right there. The second thing that we're doing is we're launching we're calling the Raise The Bar initiative to reignite traffic at the bar, which we think will spill over into the dining room, too.\n\nSo the Raise The Bar initiative includes a completely new drink lineup, a new bar food lineup, happy hour that's available every day, and the launch of NFL Sunday tickets into our restaurants, which will drive traffic via sports viewership. Beyond NFL Sunday tickets, we're looking at other things that we can use outside of football season to help drive traffic. Obviously, those are more full revenue guests that we can get in to enjoy food and drink. And then, we're going to reboot the My Chili's Rewards program.\n\nWe probably will still give some things away, but it will be focused more on compressing the time between visits for our loyal guests. And we think we can make that loyalty program more traffic driving, but less costly with a better strategy and execution based on key customer insights. So I do think that My Chili's Rewards will still play a big role in driving traffic, but I think there's probably a better way that we can utilize it going forward.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nIt's super helpful. Thank you. And Joe or Kevin, the most recent trends you called out are the traffic declines. How much of that is the industry? In other words, you've talked about your share gains in the past.\n\nIs this idiosyncratic or more severe at Chili's than the industry or what you're experiencing? Your view is just the industry slowdown in general.\n\nJoe Taylor -- Chief Financial Officer\n\nI think that the bulk of it is similar to what you've seen in the industry and heard other folks talk about. When you look at the fourth quarter, for instance, you saw that traffic deceleration with June being the worst traffic positioning for the quarter, which again coincided with a lot of the very excessive inflationary factors like $5 gas, average gas prices, things of that nature. I will say that we have not performed as well relative to the industry as I'd like to see us do. So I think there's work for us to do in our house, too, that is beyond, the macro environment.\n\nAnd that's when we focus on retaining team members, that's a big piece of the equation. We need to bring turnover down to make sure we can get dining rooms fully open, particularly on peak times and on the weekends, we will not have the throttling of the off-premise online ordering system, so that -- which is really their dining room. So we don't want to want to constrain that piece of the equation, too. So simplification is geared at helping to move the needle in that space.\n\nBut we're very focused on the retention side to try and get back into that, better than industry positioning on traffic. So some work to do there, but I think, most of it was similar trends to what you saw from the industry side of the equation.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is coming from John Ivankoe from JPMorgan. John, your line is live.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nYes, hi. Thank you. In listening to the call and talking about things like changes in loyalty, reduction of discounting, and pricing, all also seem to be very data-driven decisions. So, I guess the question is, did that data exist before? But, whether it was a feel or an experience, just different decisions were made in the past.\n\ndo you have new data that's suggesting, that some of these changes, I guess can be made in a positive manner? Or is this still kind of a feel and experience in the type of decision where we're making maybe some of these decisions without necessarily the support of data today? And I have a follow-up.\n\nKevin Hochman -- Chief Executive Officer and President\n\nWell, to answer your question, a lot of it is supported with data and or testing. Some of it is moving faster than I think we would normally do just given the circumstances. And then some of it is just based on my experience with pricing and discounts on two other brands that I kind of led we're in a similar place of having a huge percentage of their mix on discount. So, in our example on Chili's, 37% of our checks are moving to some type of discount.\n\nAnd that's just simply too high for our brand and we just need that -- we need to figure out ways to get that lower. So it's not a question of like if we should do it, it's how we should do it. And, we're probably moving a little faster than we normally would. But, we're going to, of course, correct the things that we think we go too hard on.\n\nBut we do think that there we do have some pricing power in different areas in the business between being a little bit slower than the industry last year on taking everyday pricing, making sure that we have really sharp pricing for that guest that's cash trapped that's available in the restaurant every day, which we're going to maintain. And then, the reduction of discounts over time that we think will help us, earn better pricing on the business. So to answer your question, it's a combination of both. And but the most important thing is that over time, we get to a more sustainable business with better four-wall economics and better restaurant margins.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nThat's very helpful. Thank you. And secondly, the KFC brand in the US really became a much stronger brand after it actually significantly shrank its footprint in the US it really, decided, where it wanted to be with what type of customer, where they felt that, the operations could be solid. Are there other opportunities, specifically to Chili's for you to really rethink the portfolio, and maybe you kind of get better and stronger by being, at least in the short term smaller? How do you kind of see if there's a way to compare and contrast, the turnover opportunity at Chili's relative to what was successfully achieved at KFC in the US if that's appropriate?\n\nJoe Taylor -- Chief Financial Officer\n\nJohn, I think we're always going to be taking a hard look at the performance dynamics of the fleet, and frankly, may take an even harder look at that spectrum of restaurants, which are always going to have some that are at the lower end of the spectrum, you might -- could we be a touch more aggressive on closing and relocating? I think as we kind of go forward, possibly it's something we'll look a little, little deeper at and maybe not carry as many along. I think we've talked in the past about our ability to carry restaurants, again, since we own all of our restaurants and we can kind of bring the fleet along in mass. We probably don't have to be bringing some of that level along as we have in the past. I don't see that as a radical change, though.\n\nI don't want to take you down a path that there's going to be a significant initiative any time in the near term on meaningful closures. But we won't be afraid to close a restaurant, or not renew a lease in a lot of cases of some of these getting to expire if we don't see an ability to improve the operations and performance of an individual restaurant. So maybe a tick more than you've seen in the past, but nothing planned dramatically in the near term.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And the next question is coming from Jared Garber from Goldman Sachs. Jared, your line is live.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nGreat. Thank you for the question. Over the last maybe year or so, we've heard a lot about technology initiatives in the restaurant to help the operations. And I think Kevin talked a lot about simplification initiatives moving forward.\n\nSo I just wanted to get a sense of maybe what some of the initiatives that were in place in terms of AI and robotics that were being tested, and some other initiatives in the back of house and front of house and how you think about those things going forward.\n\nKevin Hochman -- Chief Executive Officer and President\n\nYeah. So we have a lot of opportunities in technology. One of the things that the leadership team did when I first got here was we literally laid out all of the projects that we were working on kind of a two-by-two. One was its ability to impact, sales and profits in the next few years.\n\nAnd then, the other access is like the probability of success, how much investment in time we need to put into this. And we made some strategic decisions to accelerate some projects and to stop other projects so the robotics project, I think you're probably referring to, we're going to we're pausing right now, but we are going to try to accelerate what we call Kitchen of the Future 3, which is equipment that will make it a lot easier, faster, and more consistent, and dramatically reduce cook times on the majority of the items on our menu. We believe that getting the speed of service up through that equipment will lead to turning tables faster and higher sales. So we are aggressively looking at technology as a way to improve restaurant margins and productivity.\n\nThere are a couple of other areas that we are looking at that we'll be talking about in terms of our long-term strategy. There's clearly an opportunity to remove friction for both our team members and guests with this with better use of technology. For team members, there's a clear opportunity in our heart of house, or our back of house with our kitchen display systems improving the order flow and in the to-go area, which is now 35% of our business. There are also several tasks that we think that guests might want to do for themselves with the right technology, if we can deploy it properly in the restaurants like seating, ordering, and payment, this will make it easier for the guests and reduce how much time our team members have to do those tasks for our guests today.\n\nAnd then, we also have -- we think, a pretty big opportunity in our mobile site interface. The vast majority of our off-premise guests are using that mobile site to order, and we think we can make that easier and faster to help build stickier online customers. So to directly answer your question, we're going to stop some of those projects that we just didn't have a line of sight to a return on the business, but we're going to double down and accelerate the ones that we think will have a more meaningful impact on restaurant margins and a quicker impact on our business.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nThanks. That's a really helpful color. And then, Joe, if I could just follow up on our question around pricing, I think you said the expectation is to run about 8% price to the full year at Chili's, so does that suggest that you'll be taking incremental price increases throughout the year to maintain that 8% level? Because presumably, you'll have some price actions from 2020 to fiscal year '22 rolling off at various points around the year. So just wanted to make sure I understood that commentary properly.\n\nJoe Taylor -- Chief Financial Officer\n\nYeah. You're understanding it correctly. We'll take, a series of different price increases, not necessarily just menu price increases. Obviously, looking at a lot of different dynamics of where you can take actionable price.\n\nYou'll probably actually see it on a quarterly sequencing Chili's tick up a little bit above that average level, as you kind of move through the middle of the fiscal year. And then, depending on any incremental decisions we may make down the road, we've left ourselves the optionality on how we think about price in the second half of the fiscal year, you would then gravitate back into that kind of 8% range. So that's kind of the flow of pricing for them.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nOK. Great. Thanks so much.\n\nOperator\n\nThank you. And the next question is coming from Dennis Geiger from UBS. Dennis, your line is live.\n\nDennis Geiger -- UBS -- Analyst\n\nGreat. Thank you. Just first wanted to ask another on the pricing levels and really anything that you've seen with respect to pushback, or resistance from the customer to date. Kevin, I know you spoke to having pricing power in pricing below peers in past years.\n\nJust curious about what you've seen most recently from a feedback standpoint from customers?\n\nKevin Hochman -- Chief Executive Officer and President\n\nWell, we continue to see mix be fine. So we haven't seen really any trade-down. What we have seen is the traffic with that low-income guest tail off a bit. And so one of the things that we need to do is superior that -- we have to really superior values in our restaurants today.\n\nWe have a $9 lunch combo, which if you look at the fast food index of combos, it's beneath the head so and that's casual dining, right? And then, we have our 3 for Me program, which is essentially an appetizer, an entree, and unlimited drinks starting at $10.99. These are both unbeatable values in the market. And so we have to do a better job of taking the limited marketing dollars that we have and making sure that we're shouting those things for the guests, so that the low-income guests that literally wouldn't be able to choose casual dining unless they had those price points available to them, are aware of them, right? So that's why we're pivoting some of the dollars that we're spending on comps for My Chili's Rewards and trying to figure out, how do we reinvest that back into advertising the everyday value that we have today that we think is unbeatable in the market. The other things that we're doing in terms of pricing when we think about like reducing the number of items that are offered on that 3 for Me menu to just make sure we have a couple of things that are really good for that guess but not discount large swaps of the menu.\n\nWe think that will have a positive impact on pricing, reducing the number of free offers, which we talked about on My Chili's Rewards. And then, the other thing I don't think we've talked about is just accelerating pricing and recovering the costs of delivering our food, both on Maggiano's, Chili's, and the virtual brands. Historically, we just haven't recovered all those costs. And we know that guest is very price inelastic and really value convenience over menu price.\n\nSo it may not be in the context of like how you think about pricing power, but there clearly is opportunity and upside on being -- I'm pushing a little harder on those things in a smart way while protecting those opening price points for that guest that just desperately need that price point.\n\nDennis Geiger -- UBS -- Analyst\n\nVery helpful. And then just one more, if I could, just on the food and beverage inflation side of things of the expectations there, what are the biggest drivers maybe for the fiscal 1Q Target, as far as poultry, how much of pressure is that based on the latest contract and maybe just kind of what you're seeing for the full year, how contracted you are for the full fiscal '23? Joe, if you could kind of speak to that a little bit. Thank you.\n\nMika Ware -- Vice President of Finance and Investor Relations\n\nHi, Dennis, it's Mika. So actually, poultry and oils are probably the two biggest drivers of our Q1 inflation. And for the first quarter, we are actually we're probably 99% contracted. We're more contracted as well into the second quarter and open in the back half of the year where we do think the markets are going to come down.\n\nBut that's where we stand today.\n\nDennis Geiger -- UBS -- Analyst\n\nVery helpful. Thanks, Mika.\n\nMika Ware -- Vice President of Finance and Investor Relations\n\nThanks, Dennis.\n\nOperator\n\nThank you. And the next question is coming from Chris Carril from RBC Capital Markets. Chris, your line is live.\n\nChris Carril -- RBC Capital Markets -- Analyst\n\nThanks. Good morning and thanks for the question here. So can you talk about the staffing environment today? Maybe focusing on turnover relative to pre-COVID levels? Joe, I think you had alluded to elevated turnover in the 4Q versus historical levels. And then I guess a high level.\n\nHow are you thinking about balancing all of the strategic initiatives that you're anticipating with what you're seeing in staffing today?\n\nJoe Taylor -- Chief Financial Officer\n\nLet me jump in on the first part, and then, Kevin if you want to jump in on the back half of where we can see that heading. Yeah, we're running within the hourly population. We're running much higher turnover rates than we did pre-COVID, retention is the area that we're really focusing on there, we're not having difficulty from a hiring standpoint. The number of people staffed in the restaurants is fairly similar to pre-COVID, but it's the turnover rate that is generating higher than normal training expenses, utilization of overtime, and some of those dynamics that keep that overall labor cost more elevated than we'd like to be.\n\nSo we're really focusing a lot of attention on how to approve the retention rates. And that starts with, making sure we have the right dynamics of hiring practices in place and the right training programs. Our initiative around virtual training and onboarding, I think is going to be effective as we just start to deploy that into the restaurants. But that is clearly a hyper-focus, on how we improve the labor situation and we need to bring those levels, particularly for the hourly.\n\nGM turnover is very stable where it needs to be improvements in the overall manager and then it and then a lot of attention on the hourly side of the equation.\n\nKevin Hochman -- Chief Executive Officer and President\n\nYeah. And I think this is going to be a work in progress. We do continue to have a higher level of turnover versus pre-pandemic at the team member restaurant level that Joe referred to. During my listening tour and restaurants, what I've learned is we don't have a problem attracting enough folks to work in our restaurants.\n\nWe have a challenge in retaining them. And in talking with the operators, what I heard is it's more difficult to work in a Chili's, and it's not as fun to work in a Chili's than it was pre-pandemic. I think we're competitive in terms of wage rates, it's more about the actual work. And so there are two big things that we're working on.\n\nOne is the simplification initiative where we've got this team of senior executives working on things that are going to make it easier to work in a Chili's. And then, we're going to we're also having spending up some ideas on how to make it fun again to work in a Chili's. So the simplification one is kind of more obvious in the near end. There are just a lot of tasks that we do in the back of the restaurant that doesn't necessarily help the guest experience and can be frustrating for team members.\n\nI'll give you one example of the view and idea of the stuff we're working on. So we have this thing called portioning that we do for a lot of our proteins, which is before service, we'll literally like count the number of shrimp or measure the amount of brisket, and we'll put that into a, into a plastic bag, and then, we'll, we'll stage that, in a cooling area. And, in my restaurant tours, I saw pretty much every morning. I've just seen people just counting shrimp, or measuring brisket.\n\nAnd just to give you a sense of like how much time that could be and how much money that could be for our business. Just one hour of prep per day per restaurant is roughly 46 years of labor that we're paying for annually when you add that all up, right? And when the team member said, well, I don't know why we, count shrimp counting shrimp, I put them in a bag. I said, well, how would you do it? They said, When the customer orders a shrimp dish, I would count eight shrimp and I do it before service, right? And, that seems pretty logical and something that we could immediately do. And probably there was a time that when we put that in that proteins, we were really worried about the waste on them, and labor rates weren't where they were.\n\nAnd so it might have been good decisions when we made those decisions 15 years ago. But today, in a world where, wage rates are where they are and, turnover rates are where they are. And that's not, the most fun task to do. Like, why don't we get rid of that and save millions of dollars in terms of labor that can either be redeployed back into the restaurant or potentially to the bottom line, if we can change the amount of hours that we deploy to the business? So that -- so many examples in our business that we can remove some of the cost and complexity out of our business, but don't really meaningfully impact the guest experience.\n\nAnd then from a fun standpoint, there are plenty of ideas that we've heard from the restaurant teams that we think actually could not just make the business more fun to work in, but actually drive some traffic. So, one of the things that we're bringing back that we had pre-pandemic that I heard from the restaurant teams that we announced at our conference last week give back night. So it's literally any of your guests in your local Chili's can ask to use the restaurant for a night and they will attract the guests and 10% of the proceeds that night go to that guest's nonprofit charity, and they will do, the recruiting to bring guests into the restaurant because it's for a cause that they all care about. And obviously, the team members love it because it's something they can give back to their communities.\n\nIt's a form of driving traffic and it's a whole lot of fun for everybody. So there are so many different ideas that we can do both to simplify the restaurant and make it fun to work at Chili's again. I think we do those things, I think you'll see those turnover rates for our team members start to go down.\n\nMika Ware -- Vice President of Finance and Investor Relations\n\nAll right. Thank you, Kevin --\n\nChris Carril -- RBC Capital Markets -- Analyst\n\nGreat. Thanks, Kevin.\n\nMika Ware -- Vice President of Finance and Investor Relations\n\nAll right. Thank you, Kevin. And thank you, Joe. And thank you, everyone, for joining us on the call today.\n\nThat concludes our call, and we look forward to updating you on our first quarter results in November. Everyone, have a wonderful day.\n\nKevin Hochman -- Chief Executive Officer and President\n\nThank you, everybody.\n\nMika Ware -- Vice President of Finance and Investor Relations\n\nBye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMika Ware -- Vice President of Finance and Investor Relations\n\nKevin Hochman -- Chief Executive Officer and President\n\nJoe Taylor -- Chief Financial Officer\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nNicole Miller -- Piper Sandler -- Analyst\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nJeffrey Bernstein -- Barclays -- Analyst\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nJared Garber -- Goldman Sachs -- Analyst\n\nDennis Geiger -- UBS -- Analyst\n\nChris Carril -- RBC Capital Markets -- Analyst\n\nMore EAT analysis\n\nAll earnings call transcripts"
}