{
  "companyName": "Seagate Technology Holdings plc",
  "companyTicker": "STX",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/seagate-technology-holdings-plc-stx-q1-2023-earnin/",
  "content": "Seagate Technology Holdings plc (STX -0.77%)\nQ1 2023 Earnings Call\nOct 26, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Seagate Technology fiscal first quarter 2023 earnings conference call. [Operator instructions] Please note that this event is being recorded. I would now like to turn the conference over to Shanye Hudson, senior vice president, investor relations, and treasury. Please go ahead.\n\nShanye Hudson -- Senior Vice President, Investor Relations, and Treasury\n\nThank you. Good afternoon, everyone, and welcome to today's call. Joining me are Dave Mosley, Seagate's chief executive officer; and Gianluca Romano, our chief financial officer. We've posted our earnings press release and detailed supplemental information for our fiscal first quarter 2023 results on the Investors section of our website.\n\nDuring today's call, we'll refer to GAAP and non-GAAP measures. Non-GAAP figures are reconciled to GAAP figures in the earnings press release posted on our website and included in our Form 8-K that was filed with the SEC. We've not reconciled certain non-GAAP outlook measures because material items that may impact these measures are out of our control and/or cannot be reasonably predicted. Therefore, a reconciliation to the corresponding GAAP measures is not available without unreasonable efforts.\n\nI'd like to remind you that today's call contains forward-looking statements that reflect management's current views and assumptions based on information available to us as of today, should not be relied upon as of any subsequent date. Actual results may differ materially from those contained in or implied by these forward-looking statements, as are subject to risks and uncertainties associated with our business. To learn more about the risks and uncertainties and other factors that may affect our future business results, including expectations regarding any regulatory, legal, logistical, or other factors, please refer to the press release issued today and our SEC filings, including our most recent annual report on Form 10-K and quarterly report on Form 10-Q, as well as the supplemental information, all of which may be found on the Investors section of our website. Seagate also filed an 8-K today disclosing that, on August 29, we received a proposed charging letter from the U.S.\n\nDepartment of Commerce's Bureau of Industry and Security, or BIS, alleging violations of the U.S. export administration regulations. We have responded to the letter and believe that we've complied with all relevant export control laws and regulations. We've been cooperating with BIS, and we intend to continue engaging with them to seek a resolution.\n\nDuring the Q&A portion of this call, we won't be commenting further on this matter, and we'll provide additional updates, as appropriate, moving forward. With that, I'll now turn the call over to you, Dave.\n\nDave Mosley -- Chief Executive Officer\n\nThanks, Shanye, and hello, everyone. In our remarks today, we will discuss the September quarter performance in the context of an intensely challenging macro environment, and outline the aggressive actions we are taking to manage the company during this tough period. Despite these near-term challenges, the underlying data demand drivers remain strong as does the opportunity for mass capacity storage solutions. And I will outline why we're confident that as current conditions improve, Seagate is in an outstanding longer-term position.\n\nFor the September quarter, revenue came in at $2.04 billion, which was inside the revised guidance range that we provided at the end of August. Non-GAAP EPS of $0.48 was well below our expectations, impacted by multiple gross margin headwinds that I'll touch upon shortly. As we shared in late August, three main factors were influencing our outlook: the impact of COVID lockdowns and the related economic slowdown in China, broad-based customer inventory adjustments, and weakening global consumer spending. Since the August time frame, macro sentiment has further deteriorated, which has led to a more cautious spending environment and more significant inventory adjustments as we move through the final weeks of the September quarter.\n\nThese factors incrementally impacted sales volumes in the economically sensitive consumer markets, as well as certain U.S. cloud customers. We currently expect customer inventory drawdowns will remain a factor through at least the December quarter. We reacted quickly to adjust our production levels to the current demand environment and our gross margin performance reflects the resulting factory underutilization costs that increased markedly through the month of September.\n\nIt's important to note that consistent with some of the U.S. CSP comments, end-user demand for core data and analytics applications remain solid, which supports our view that the business will improve as elevated inventory levels are consumed. In the meantime, we continued to respond to the changing market conditions and further reduced production output across all product lines with the exception of our 20-plus terabyte products, where demand has held firm and pricing relatively stable. Our actions underscore our focus on maintaining strong supply discipline, and we believe this will enable us to quickly return to a more favorable pricing environment across mid- to lower-capacity products as conditions normalize.\n\nStepping back, today's highly uncertain macro environment stems from multiple factors outside of our control, such as rising interest rates, inflationary pressures, and geopolitical dynamics. With that in mind, we are focused on managing what we can control and taking aggressive actions to appropriately respond to the near-term market environment and enhance profitability over the long term. In addition to adjusting our production output to drive supply discipline and pricing stability, we are implementing a restructuring plan to sustainably lower costs, including a reduction in our global workforce. These are very difficult decisions to make and ones that we do not take lightly.\n\nHowever, we believe they are necessary to align our cost structures with the realities of the near-term market, while still enabling us to support future mass capacity storage opportunities as demand recovers over the longer term. We are improving working capital by reducing our inventory levels over the next couple of quarters, and we are significantly lowering our fiscal '23 capital expenditures while maintaining investments that support the launch and ramp of the 30-plus terabyte product family based on HAMR technology. These cost-saving actions, together with our supply discipline enable us to drive increased leverage to earnings as conditions improve over the near term. Longer term, we remain confident in the secular growth of mass capacity storage and believe our technology leadership positions us to capture the significant future growth opportunities.\n\nConsistent with our focus on enhancing longer-term shareholder value, we are maintaining our quarterly dividend; however, we are temporarily pausing our share repurchase program to ensure we can continue to make necessary investments to support our current business and underpin our longer-term strategic plans. Let me now share some perspectives on the end markets, starting with VIA. The global economic slowdown has continued to impact VIA-related project budgets and installation time lines, which has led to a buildup of customer inventory. These trends have dampened the typically strong seasonality in the back half of the calendar year, particularly in the China market.\n\nStimulus programs to help boost the local economy have been announced; however, timing for economic recovery is not yet apparent, while COVID lockdown restrictions remain in place. Our long-term expectations for VIA demand have not changed. While we have significant direct customer exposure in China, end market demand is global and continues to expand, as smart video applications are adopted to address real-world challenges. For example, reducing traffic congestion is one area of focus for smart cities which cost U.S.\n\ndrivers alone an estimated $53 billion in 2021. These savings can only be realized after capturing and storing large volumes of data and application best served by HDDs. In the nearline markets, we saw a double-digit percentage sequential revenue declines across both cloud and enterprise OEM customers, reflecting the broad-based inventory adjustments that I described earlier. Recall, we had been anticipating the customer inventory correction to be largely complete in the December quarter.\n\nHowever, amid intensifying macro uncertainties, customers have grown more cautious with their spending plans, which we believe will extend the recovery in the calendar year '23. U.S. cloud customers are still reporting healthy demand tied to digital transformation, artificial intelligence, and other applications that unlock data value and continue to rank among CIO's highest investment priorities. While enterprise CIOs continue to move workloads to the public cloud, according to a recent study, 80% of cloud users also have a hybrid cloud strategy, illustrating the desire to operate seamlessly across the network of public and private clouds.\n\nWe believe these trends support our view for mass capacity exabyte growth to return to the upper 20% range as the broader markets recover. These same trends underscore the positive market momentum we are seeing in our enterprise systems business, which recorded revenue growth of over 45% sequentially. While we expect sequential sales levels to reflect some lingering supply challenges in the December quarter, our systems results illustrate how customers are still allocating budget dollars toward areas that drive business value. The data trends that rely on cost-efficient, higher-capacity storage solutions remain intact.\n\nAs a leader in HDD technology, Seagate is well-equipped to address demand by continuing to execute our strong product road map. We are leveraging the current production slowdown to double down on our development actions and accelerate cycles of learning to continue delivering TCO value to customers. Sales of our 20-plus terabyte product family grew meaningfully quarter over quarter, supported by strong demand from cloud customers. 20-plus terabyte drives now rank as our highest volume and revenue platform, surpassing 18 terabytes as expected.\n\nWe are extending this product family using conventional CMR technology into the mid-20 terabyte range, which also offers SMR capabilities into the upper 20-terabyte range. Development of our 30-plus terabyte platform based on HAMR technology remains firmly on track. In addition to HAMR, these drives incorporate many new technology innovations to reflect years of development, design, and integration know-how to form the backbone of our future product portfolio. We continue to execute our development plans meeting key milestones, including reliability metrics and aerial density gains that also position us to extend drive capacities well beyond 30 terabytes.\n\nAs I shared in our July earnings call, customer revenue shipments are expected to begin around mid-calendar 2023. And I could not be more pleased with our great progress this quarter. In closing, we are navigating through the macro challenges that are impacting our business over the near term. However, the long-term growth trajectory for mass capacity storage remains solid, driven by the fundamental demand for data and the need for businesses to harness its value.\n\nWe believe that the actions we have undertaken will ultimately strengthen our position over the long term. Looking ahead, as we incessantly push the technology innovation road map, we believe our customers will continue to value Seagate as their primary storage solutions provider. Gianluca will now cover the financial results in more detail.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nThank you, Dave. Revenue came in at $2.04 billion, reflecting the evolving macro landscape that Dave described in his remarks. Non-GAAP operating margin for the quarter was 9%, below our expectation at the end of August due to lower revenue, a less favorable market mix, and higher underutilization charges, as we continue to lower our production output as we gain visibility into December quarter demand. We are taking decisive actions to reduce expenses, reserve cash, and improve long-term profitability, which include reducing production output to enable rapid inventory correction at our customers and on our own balance sheet, significantly lowering capital expenditures for the rest of the fiscal year, resulting in capex as a percentage of revenue to be below the long-term target range of 4% to 6% of revenue.\n\nAnd executing a restructuring plan to sustainably reduce our cost by approximately $110 million annualized. We believe this action will put the company in a strong financial position when the global macro business environment begins to recover and expand operating profit faster than revenue growth. Moving to our end markets. As we have mentioned, intensifying macroeconomic pressure and more reserved customer buying behavior impacted our results across both mass capacity and legacy markets.\n\nIn the September quarter, total hard disk drives capacity shipments were 118 exabytes, down 24% sequentially and 26% year on year. Mass capacity market made up 88% of the total, with shipments of 104 exabyte, down 25% sequentially and 21% year over year. Average capacity per drive increased 3 percentage points sequentially to 11.8 terabytes, reflecting continued growth demand for our 20-plus terabyte product family, which represents over 40% of total mass capacity exabytes shipped in the September quarter. Nearline shipments totaled 85 exabytes, down 28% sequentially, reflecting the ongoing inventory adjustment at both cloud and enterprise OEM customers, which are expected to last through the calendar year end.\n\nOn a revenue basis, mass capacity represented 78% of total HDD revenue at $1.4 billion in the September quarter. As a percentage of HDD revenue, mass capacity was down 2 percentage points sequentially and up 7 percentage points year on year. Consistent with our view at the end of August, VIA revenue was down quarter over quarter due mainly to the prolonged economic slowdown in China. Specific to our mass capacity market, we expect the prevailing macroeconomic challenges will extend through the December quarter, negating the traditional seasonal uptick usually seen in the VIA market.\n\nAs said, we remain confident in the long-term growth of the mass capacity markets in both the cloud and at the edge. Within the legacy markets, revenue was $391 million, down 20% sequentially. Quarter-over-quarter, the pace of decline was more pronounced in the mission-critical market due to soft enterprise spending, particularly in China, and deteriorating consumer spending. Similar to the VIA market, we do not expect to see a typical seasonal uptick in overall demand for legacy markets in the December quarter.\n\nFinally, revenue for our non-HDD business was $263 million, up 21% sequentially. The increase quarter over quarter reflect the improving component supply for our petabyte scale solution in our enterprise system business. Moving to our operational performance. Non-GAAP gross profit in the September quarter was $498 million, corresponding to non-GAAP gross margin of 24.5%, down more than expected quarter over quarter.\n\nUnderutilization cost represented a 250-basis-point headwind to gross margin impacted by the adjustment we made to lower production output throughout the quarter in response to market conditions. These impacts were compounded by a less favorable market mix, driven by a lower percentage of revenue derived from margin reach mass capacity markets and an increase in the non-hard disk drives business. Non-GAAP operating expenses were at $314 million, down $35 million quarter over quarter due to lower variable compensation and proactive expense management, which included strong control over discretionary spending and the pause in hiring. In the December quarter, we expect opex to further decline by about $10 million, including savings associated with our restructuring plans starting later in the quarter.\n\nBased on diluted share count of approximately 210 million shares, non-GAAP EPS for the September quarter was $0.48. Moving on to balance sheet and cash flow. We ended the September quarter with a total liquidity position of approximately $2.5 billion, including our revolving credit facilities, which is sufficient to support our strategic plans and meet customer demand. Despite lower-than-expected revenue for the September quarter, inventory ended fairly flat at just over $1.6 billion.\n\nWe expect inventory to decline significantly over the course of fiscal 2023 as we align our supply chain and finished good levels to the prevailing demand environment. Reflecting the payment of previously committed amount, capital expenditures were $133 million for the September quarter. Free cash flow generation was $112 million, essentially flat with the prior quarter, as the improvement in cash from operations was offset by higher capital expenditures. We used $147 million for the quarterly dividend, and $408 million, we reported 5.4 million ordinary shares, exiting the quarter with 206 million shares outstanding and approximately $1.9 billion remaining in our authorization.\n\nIn light of current near-term priorities, we are temporarily pausing our share repurchase program, but we remain flexible and opportunistic as conditions develop. In August, we raised $600 million in capital through a new term loan during fiscal 2028, resulting in total debt balance of $6.2 billion at the end of the quarter. Adjusted EBITDA was $2.1 billion for the last 12 months with total debt leverage ratio just below three times. We expect interest expense for the December quarter to be approximately $74 million.\n\nLooking ahead, we continue to face a challenging business environment, shared by macroeconomic and geopolitical teams. Seagate, like our customers, is diligently managing cash and investment amid the disrupted demand environment. We expect these factors and ongoing customer inventory corrections to weight on revenue in the December quarter. Please bear in mind our financial outlook for the December quarter is as follows: We expect revenue to be in a range of $1.85 billion, plus or minus $150 million.\n\nAt the midpoint of our revenue guidance, non-GAAP operating margin is expected to be in the mid-single-digit range, reflecting the impact from higher underutilization cost, and we expect non-GAAP EPS to be in the range of $0.15 less from minus $0.20. I will now turn the call back to Dave for final comments.\n\nDave Mosley -- Chief Executive Officer\n\nThanks, Gianluca. Seagate's team is acting with determination and agility to rapidly adjust to a highly uncertain environment. I'm incredibly proud of their unwavering focus. Throughout our 40-plus year history, Seagate has successfully operated through many adverse conditions, and we are putting that experience to work.\n\nWe're taking the right actions to strengthen our near-term financial position and optimize liquidity through this period. We're driving forward on our technology road map which makes us poised to quickly recover, as market conditions improve, as well as capture the significant future opportunities ahead. Finally, we continue to operate with a deep sense of commitment to all of our stakeholders, our people, our customers, the communities in which we operate, and, of course, to our shareholders. Gianluca and I would like to now take your questions.\n\nOperator\n\n[Operator instructions] And our first question today will come from Wamsi Mohan with Bank of America. Please go ahead.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nYes. Thank you. Good morning. As you look into the December quarter, you've not reported a sub-$2 billion revenue quarter.\n\nI went back and checked all the way since back in 2005. What is your view on the inventory levels? And how much below-demand levels are you currently shipping? And do you expect to exit the December quarter with a lower inventory level? And if I could also ask just are you expecting higher underutilization charges in December? Or should we expect the same magnitude? Thanks.\n\nDave Mosley -- Chief Executive Officer\n\nThanks, Wamsi. I'll let Gianluca quantify the underutilization charges. I think the blunt answer to your question is, yes, we're expecting to get the inventory levels of our own -- owned inventory and then of the customer inventories down this quarter. We'll watch the customers what they have at the builders, what's that flow through, hopefully, would have hoped that it would have happened by now, but I think macroeconomic conditions are weighing on everybody a little bit that way.\n\nAnd we believe that by controlling our own build plan, which results in higher underutilization charges that we can actually get our owned inventory down as well.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nYes. During the September quarter, we reduced production twice at the beginning of the quarter and then again during September. And we actually increased even more through the end of September, so we had more than $50 million of underutilization charges in the September quarter. December will be higher.\n\nSo we start already with a lower production than the beginning of the prior quarter in October, in November. And then as the month of December, we will, of course, look at the demand for the March quarter and see if we can start to ramp back production or all we need to keep it lower. And I think Dave wants to add something.\n\nDave Mosley -- Chief Executive Officer\n\nYeah. I think also just to your other point about this is pretty low historically, it certainly is. There's still macro challenges ahead of all of us. I think in FQ2, the consumer is pretty weak.\n\nChannel inventory is still fairly high, not on an absolute unit basis but on a run-rate basis, certainly. And there's kind of muted to no seasonality at all this year in FQ1 or FQ2 for us. And we're not expecting the cloud recovery in FQ2, we just are watching the inventory levels. In China will also -- the recovery will be slow there.\n\nWe've been predicting some sort of recovery for about three quarters. And there is a little bit of sentiment that things will start to get better, but we want to see that in hard purchase orders just to be really frank. So the recovery is all dependent on the pace of the customers working through these inventory levels.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nThanks for the color, Dave. And if I could -- I mean, this is I know you guys said you really can't talk a lot about this export regulation area. But could you just give investors some sense on why you believe the shipments are not subject to export regulations? Does it have to do with the IP for the products and where it resides or any color you can share about why you have confidence in your position, clearly, you articulated that you do? So it's the why is, I guess, important from an investor standpoint. Thank you.\n\nDave Mosley -- Chief Executive Officer\n\nYeah, Wamsi, I think like Shanye said, we don't really think it's appropriate for us to be commenting on it at all at this time. I mean, we'll cooperate transparently, and we believe we have a really good compliance program in place with all the policies and procedures. So that's what builds our confidence. But like I said, we'll communicate transparently.\n\nI just don't think it's appropriate for us to be commenting.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nThank you so much.\n\nOperator\n\nAnd our next question will come from Krish Sankar with Cowen and Company. Please go ahead.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nYeah, hi. Thanks for taking my question. The first one for Dave. I'm just kind of curious heading into 2023, how should we think about the pricing environment? Is there a way to quantify it or quality do we see relative to the last downturn in 2019? And if we extrapolate how to think about revenue growth for FY '23 or calendar '23? And then I had a follow-up.\n\nDave Mosley -- Chief Executive Officer\n\nIt's still a little too hard to call revenue growth. I'll let Gianluca quantify some of the pricing environment discussions. But I would say at the high cap, the 20-plus terabyte family, pricing was relatively benign. I think there was really competitive space, especially in legacy and the low cap nearline because those markets are so depressed right now.\n\nSo it was fairly competitive. And I think this is just a sign of the times in the industry when factories aren't full. People want to get as much demand as they can to keep running their factories and we're all mindful of that right now. So I think we need to see supply and demand come back in the balance to see a better environment.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nIn the legacy market, we saw some pricing pressure, so the low capacity drives, maybe also coming from the very low price of the NAND right now. On the high-capacity drive, as Dave said, the price environment is still very favorable and say fairly stable. So I would say different from what we have seen in prior down cycles.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Got it. Very helpful. And then just as a follow-up, clearly, your cloud customers, there's obviously very high levels of inventory digestion.\n\nThere's pricing pressure. Have you seen any market share shifts in this environment, either in your favor or against you, especially among the U.S. hyperscalers?\n\nDave Mosley -- Chief Executive Officer\n\nWe're not really trying for market share, I'd say at this point in time. We're watching all these inventories levels. And we're saying, let's make sure we build the right absolute right stuff. So I think there various challenges that I can articulate at various hyperscalers.\n\nAnd they have different business models, different dynamics within them. Some have multiple business models. So there's macro implications as you're hearing from some of their comments. And there are also architectural transitions and there's still supply chain shortages.\n\nIn some cases, some of the supply chain shortages led to situations where people bought too much of the wrong stuff, and then there's even overages in the supply chain. So I think it's really complicated as to how this inventory built. Fundamentally, the creation vectors for data and the consumption of mass capacity drives have not changed. There is an aging of the fleet going on.\n\nThere's replacement of old mass capacity drives with the new ones [inaudible] TCO proposition, higher capacity drives are just better that way. And so all of the relevant trends still exist. We believe that the drives that are in the data centers today are being used. They're more full than ever.\n\nThe data keeps coming at them because of all the hyperscaler product offerings that are incentivizing people to move to the cloud. So we think this is just a temporary environment.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nDown cycle for me -- in a down cycle, market share is not -- should not be the priority or -- the important is to focus on free cash flow. And keeping the free cash flow positive and also to keep the pricing environment as stable as possible, and this means reduced production, try to keep supply and demand in a good balance. And of course, preparing for the long-term demand that we -- for sure, we still see very, very solid.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nThanks. Thanks, Dave.\n\nOperator\n\nAnd our next question will come from Karl Ackerman with BNP Paribas. Please go ahead.\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nYes. Good morning, Dave and Gianluca. Two questions for me as well, please. The first one is on HAMR.\n\nAnd so I guess as you think about ways to reach demand equilibrium, how are you thinking about transitioning capacity to HAMR during this softer period? I guess, does the transition to HAMR create the need for retooling head and possibly media production? And I guess as you address that question, could you also discuss the buy-in on HAMR from your cloud customers and some of the progress you referenced in your prepared remarks. Thanks.\n\nDave Mosley -- Chief Executive Officer\n\nYeah. Thanks, Karl. What I would say is that in the current environment where you have free capacity in your fabs, you use that to run more and more experiments to accelerate things. I mean, that's one lesson from numerous downturns in the past that I have.\n\nSo we're definitely taking advantage of that to do all we can to accelerate not only HAMR, but get the yields up and the scrap down and get to better cost platforms and things like that. We're gaining so much confidence on HAMR that not only talking about the dates, but we're also talking about the ability to move capacity up beyond just introductory, say, 30-terabyte platform up to higher capacity points. That also allows us then to take componentry out of 20-terabyte drives, for example, so that we can address the market that way. So all of that is going on right now inside Seagate.\n\nAnd I would say it's not just about one small piece of technology HAMR. It's also about readers and certain mechanical subsystems and electronics and everything else is really being brought together. We're in full-stage product development right now and like I said in the prepared remarks, very happy with the progress. Relative to capex, we've been planning for these transitions for a long, long time.\n\nSo there's only a few tools that are tremendously complicated. The tools that we use that are making average recording heads and recording media, those tools can be repurposed and they're pretty sophisticated. We know how to run them. So a lot of confidence on being able to hit the ramp that way.\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nThat's very helpful. If I may squeeze one more in. Given the strength of your systems business this quarter, are there still match set challenges for you in that business? And are you still facing long lead times for other hard drive input components or have those challenges loosened and I guess, maybe back to what you would consider normal?\n\nDave Mosley -- Chief Executive Officer\n\nYeah. I think from a hard drive perspective, it's an easy answer. We have plenty of inventory right now. So we need to bleed that off.\n\nRelative to the drive side, or sorry, to the system side, we have had shortages, and I think the broader industry has had shortages. And sometimes just individual $1 component, sometimes assemblies like power supplies or nicks or things like that. What I would say is that most of that is breaking free, it's not completely done yet. One of the reasons for the success of our systems business is the complexity is not very high.\n\nAnd so people are used to very bespoke solutions in that world, but they'll take what they can get and they're aggregating on less complex, simpler to achieve from a supply chain perspective designs. We see some smaller competitors really struggling for that, and that may even mean they have to exit the market. So I think we've had quite a bit of success in our channel business as well. So I think all of these trends are really supply chain trends.\n\nWe believe by building very, very few SKUs and building them well, that we'll have a market advantage.\n\nOperator\n\nAnd our next question will come from Timothy Arcuri with UBS. Please go ahead.\n\nTimothy Arcuri -- UBS -- Analyst\n\nHi. Thanks. I seem to recall that the term loan, I think, has some covenants, maybe four times is the covenant on the term loan. And it seems like you might be breaching this over the next few quarters.\n\nSo I guess the question is sort of how comfortable can we be with the dividend. Can you sort of talk through that?\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nYeah. No, we are happy with the liquidity that we have. Actually, no, our cash balance is higher than prior quarter. As you have seen, we have increased our debt during the September quarter.\n\nWe are, of course, looking at covenants, looking at debt structure. And if we have to take actions there, we will, for sure, do it. But we are -- as we said in our prepared remarks, we are comfortable with the level of our dividend, but we are posing on our share buyback for a while.\n\nTimothy Arcuri -- UBS -- Analyst\n\nSo I guess just following up on that. So is the commitment -- I'm just trying to figure out in the continuum of the commitments for capital, is the dividend right at the top of the list? In other words, you would do what you would have to not cut the dividend. Is that a fair statement?\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nYes. We want to protect the dividend. As you know, we -- one of our priority is shareholder return. And dividend is an important part of that.\n\nAnd we know that and we want to protect the dividend.\n\nDave Mosley -- Chief Executive Officer\n\nAnd we'll continue to invest in ourselves and all the other things that make us Seagate through these periods of time, we have to come up with a plan and execute the plan relative to all those things, and that's what we're out to do. It's one of the reasons why we're dipping into our inventory, working -- getting working capital flowing a little bit more right now, not just the pause on the share buybacks, but we definitely want to execute this plan as aggressively as we can, as early as we can to make sure that we're safe.\n\nTimothy Arcuri -- UBS -- Analyst\n\nGreat. Maybe as my follow-up, I had a question on this letter from BIS. And maybe can you help us -- I'm sort of trying to handicap the revenue, what the right normalized revenue would be if something were to come from this letter. I'm trying to handicap what the right normalized revenue is so --\n\nShanye Hudson -- Senior Vice President, Investor Relations, and Treasury\n\nI'm sorry. This is Shanye. Sorry. We actually -- as I mentioned earlier, just sort of two things.\n\nAgain, we believe that we've actually complied with all relevant export control laws and we continue to cooperate with BIS, as it relates to this matter, but we're not going to comment any further on this call.\n\nTimothy Arcuri -- UBS -- Analyst\n\nOK, OK. Shanye, thank you so much.\n\nOperator\n\nOur next question will come from Erik Woodring with Morgan Stanley. Please go ahead.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nHey, good morning, guys. Thanks for taking my questions. I have two, if I may. Maybe, Dave, just first for you.\n\nCan you maybe marry the comments you had in your preannounced -- the preannounced text today, with what you talked about at the beginning of September, meaning at the beginning of September, you mentioned for the first time that certain U.S. hyperscaler terminology -- the cautious buying terminology. And then today talked about uncertainty worsening in the latter part of September. Does that imply that demand or purchasing habits from U.S.\n\nhyperscalers has incrementally deteriorated since the preannouncement or over the trends that you saw in September, still relatively in line with what you spoke about back in early September? And then I have a follow-up.\n\nDave Mosley -- Chief Executive Officer\n\nI do think things have been changing through the course of the summer. So yes, let me give you a little bit of color in. And in some cases -- in many cases, we have LTAs that we're constantly negotiating to give us predictability. We need that predictability to kind of run our factories and communicate with our supply chain partners so that we can get efficiency and lower cost and so on.\n\nTypically, the customers had been in the past pulling above the LTAs. What you saw through the course of the summer was a market change. And I think -- I won't say exactly when it happened because we have lots of LTAs that some are longer than others. They time out at different times.\n\nThey're subject to changes things come up for renewal. So it's fairly complex. But as we get close to some of them ending within a quarter at the end of the LTA, for example, we're negotiating the next one, we get a sense of the inventory, the data center build-outs that have happened or that are going to continue to happen, and that's what really changed this summer, if that helps for the color.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nOK. That's helpful. Thanks, Dave. And then maybe, Gianluca, just one for you.\n\nKind of, to think about the impact of your restructuring plan, is the view that kind of your quarterly run-rate opex can be closer to, let's call it, $290 million starting in the March 2023 quarters after you go through this restructuring? Or is your current opex base incorporate some -- not just September, but then December incorporates some of the early parts of your restructuring efforts?\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nThanks. Yeah. We are executing the restructuring plan in November so you will see already some impact in the December quarter. I would say $290 million is very aggressive.\n\nIt's probably in the $300 million range for the next few quarters.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nOK. Thanks so much.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nAnd our next question will come from Aaron Rakers with Wells Fargo. Please go ahead.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYeah. Thanks for taking the questions. I've got two as well, if I can. With regard to going back to the LTAs and kind of just trying to establish better predictability in the overall business, I'm curious of how your discussions have gone over the past couple of months or how they've changed with the cloud vendors.\n\nAnd what you hear from them as far as assessing the level of inventory that they have relative to -- I think the comments in the call was that you've not seen any change as far as the demand drivers for the business. I'm just -- that degree of visibility that you're actually able to get at these cloud vendors of what they're holding, appreciating that each one is probably a little bit different.\n\nDave Mosley -- Chief Executive Officer\n\nRight, Aaron, they are, and it's a fairly complex space. But I will say that -- if you look at what's aging off, the exabytes that are aging off is actually pretty small. The exabytes that they're putting on is relatively large. So the -- we believe the growth in usage of exabytes is large, but we also believe there's a little too much inventory.\n\nI'm not going to say it's -- I'm not going to try to quantify how much that is. I think there's other reasons why some of the pauses and data center build-outs have happened. And depending on which customer you're specifically talking to, it's -- can be complexities in their supply chain. It's not necessarily their business models that are driving the problem there.\n\nSo -- and it's a complex space globally. There's lots of different kinds of LTAs. We would just -- I would say that as they -- what I said before is as they've timed out, people have given us visibility to the next one and the next one is significantly lower. And so then therefore, we're in a period of coming to reality on that relative to what we're building and making sure we're disciplined through it.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nAnd then I believe in the comments in the call, you had suggested that the expectation was we returned to kind of a high 20% growth rate in nearline capacity shipments at some point as we work through this and we see recovery start to materialize. Correct me if I'm wrong, I think in the past, we've talked about north of 30% or even mid-30% growth. Is there something that's changed in your mind structurally as far as the growth underpinning the nearline business going forward?\n\nDave Mosley -- Chief Executive Officer\n\nSo there's a difference between mass cap and nearline. So mass capacity typically would run a little bit higher -- or sorry, lower and then nearline would grow a little bit higher. So that's the reason for the difference. But I think our fiscal '23 will be an anomalous year for sure.\n\nAnd what kind of new trajectory we get into is, obviously, as we continue to build exabytes in the cloud, the growth rate will probably come down over the next 10 years. But I do think that we believe the fundamental drivers are still there for data. We're pretty excited about answering that with more and more efficient drives as well, so which is why we're using this period to kind of get those drives into the factories to come out as aggressively as we can afterwards.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question will come from C.J. Muse with Evercore. Please go ahead.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYeah. Good morning. Thank you for taking the question. I guess first question, I was hoping to dig a little bit deeper into gross margins.\n\nYou talked about further utilization cuts. Is there any math you could kind of provide how to think about kind of fixed versus variable COGS? And also as part of the restructuring, what kind of impact will that have on gross margins and on what time frame?\n\nDave Mosley -- Chief Executive Officer\n\nI'll let Gianluca answer quantitatively for you. I would just say that a lot of it comes down to this fundamental premise, just don't build anything speculatively when you're trying to manage cash. So we're not managing a gross margin outcome as much as we are just watching and making sure that any start that we have that we pull from stores and we use our cash that we're going to ultimately get paid for. We don't want our cash tied up at this point.\n\nWe are going to make -- because of that, we're going to make a big dent in inventory, and we're very mindful of the impact of the factory workers in the supply chain and so on. But we just believe it's critical to resize the business for the future right now. So Gianluca, do you want to answer?\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nWell, on the utilization charges, as I said before, we had a little bit more than $50 million in the September quarter. When we go into the December quarter, we expect that to be higher and the revenue actually you expect to be a little bit lower. So the impact to gross margin percentage is, of course, higher. On top of that, you need to look at the mix.\n\nIn the September quarter, we had a lower mass capacity percentage compared to the total HDD revenue compared to the prior quarter. And we also had higher system and system actually have a little bit lower gross margin than hard disk in general. So it depends also how the mix will be exactly in December. But probably have you seen from the guidance, we expect a further decrease in gross margin in the short term, but we are very comfortable with the long term as soon as the microeconomic situation will improve, especially in Asia and then in China.\n\nAnd this inventory correction will be over, and we go back to our more normalized revenue level. We actually expect to have a strong gross margin, as we were doing just three quarters ago. And there is no reason why we should not be in that range again.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nVery helpful. As a follow-up question, I guess, specific to the VIA market and thinking around surveillance in China, and totally separate question from kind of the BIS issues you referred to earlier. But curious if you're worried at all about increased regulations coming out of the BOC and BIS as it relates to further entities in China being placed on the entity list or unverified list. Is that something that you're contemplating as a potential risk to that part of your business?\n\nDave Mosley -- Chief Executive Officer\n\nWell, we still watch all the regulations that come out and process them, not only for how it might impact our products, but how it might impact the broader market as well, right? It's not just its demand in other parts of the market. And we've seen some impacts there over time for all markets. I think broadly speaking, there is a healthy diversity of different customers satisfying in demand. And I do think that ultimately, the demand is going to shift somewhere else because the demand for smart city applications, as we said in our script, is still there.\n\nPeople want efficiency, whether it's in traffic control like we talked about or healthcare or video surveillance around the world make people safer. So we think that the -- that market has been underserved probably for the last year, and we think ultimately, it's going to come back. So it's just -- we're not building or packing into the products right now because we want to make sure that we see the purchase orders.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question will come from Shannon Cross with Credit Suisse. Please go ahead.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you very much. Gianluca, maybe could you talk a bit about beyond inventory and lower capex? Any other levers you see that you could pull within working capital or other areas to drive incremental cash flow? And then I have a follow-up. Thank you.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nWell, we focus on all we can manage in the working capital. But for sure, the inventory level is the main driver that we can use right now. Our inventory has grown from $1.1 billion before the start of the COVID to almost $1.6 billion in the September quarter. So we have opportunity trying now to reduce our inventory.\n\nIt, of course, will not happen all in one quarter, but we will diligently reduce our inventory in the next couple of quarters.\n\nDave Mosley -- Chief Executive Officer\n\nIt's not as big, Shannon, but we can go with yields and scrap and these are still material numbers that the team can use the time, the excess capacity, and so on to do the right experiments to drive those on the right products.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nOK. Thank you. And then, Dave, I don't know if you can talk a little bit about this, but it seems like this restructuring is very obviously headcount focused, but are there other areas where you're reducing costs? Because it seems like this is kind of a flex down given the macro environment and obviously, the challenges with inventory on that, more than maybe a structural restructuring, if I can say that? Or am I off on that? And there's some actual big structural changes you're making to the business?\n\nDave Mosley -- Chief Executive Officer\n\nYeah. I would say we'll still have the ability to flex up. Obviously, people impacts are the toughest parts of the job, and we're really sensitive to not only the people but the communities and the supply chain. There are big impacts happening right now.\n\nWe are lowering output of some of the legacy products and completing product transitions to future products, which are more efficient products as well, just from a support perspective, so the complexity of the product line is coming down and resetting the factory footprint a little bit. We haven't talked about that very much. But there are demand realities out there [inaudible] where may actually impact the factory footprint. So there's opex support around that as well.\n\nThat will all help as we restructure and then come out. We're very mindful of the fact that we do need to accelerate into the future with the right products as well because that's been the nature of this business. I don't think there's a massive structural change in mass capacity data that we're planning at this point in time. We're just dealing with the reality of the current environment.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question will come from Jim Suva with Citigroup. Please go ahead.\n\nJim Suva -- Citi -- Analyst\n\nThank you very much. You've been very clear about the restructuring that's going on in the December quarter. And given the September quarter, which just ended, and in your December outlook, do you think that's actually sufficient to rightsize equilibrium supply and demand? Or do you think it's going to be like a more prolonged as you look at these ELAs and all the demand characteristics inputs from your customers? Do you think it would be a bit little bit longer prolonged recovery? Or do you think after the December quarter, we're going to be pretty free and clear then?\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nWell, it's a bit difficult to say right now. So what we are doing is keeping the level of production down for the month of October and November for sure. And then at the end of November, we will look at more tangible demand for the quarter of March and also June and see if it's the right time to ramp it back or if we need to keep it down for a few more weeks.\n\nDave Mosley -- Chief Executive Officer\n\nYeah. I think, Jim, maybe this ties back to Shannon's question as well. Mass capacity was up almost 60% in fiscal calendar '20, mid-30s in '21. FY '23 is likely going to be negative.\n\nThat's the -- first time that's ever happened before. So it's not that data is not growing. It's certainly growing in all the application space. I just think that we've got to make sure we reduce our manufacturing build plans to maintain this healthy supply discipline.\n\nAnd we may see a pop back to some of those big spikes again. It may be a more muted growth. We don't know, but we're really confident in the long-term drivers. And so we'll take this reset right now and then deal with the future as it comes.\n\nJim Suva -- Citi -- Analyst\n\nThank you so much.\n\nOperator\n\nAnd our next question will come from Sidney Ho with Deutsche Bank. Please go ahead.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nGreat. Thanks for taking my question. My first question is on gross margin. So it sounds like your gross margin will be down quarter over quarter in December based on your answer to a previous question.\n\nBut more importantly, how much are you under-earning your gross margin versus normalized level? Maybe help us break down by the various components between underutilization charges, COVID costs, logistics costs, maybe revenue mix? Anything there would be helpful. And I've a follow-up question.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nWell, based on the level of production that we have today, underutilization charges will be substantially higher than the September quarter because the period of time where we keep the production level, low, will be at least two months. We still don't know exactly if we need even to go a little bit longer. But that is the main reason why the gross margin is declining. And of course, with the top line being lower or the percentage is impacted even more.\n\nSo that is, I would say, the majority. In terms of the COVID cost, there's been fairly flat quarter over quarter. We don't think that part will deteriorate. Actually now on the freight, we know we are spending a little bit less because we ship less unit.\n\nSo those are the main drivers. And then with the restructuring, when we go in the next -- in the March quarter, the restructuring will start to have some positive impact to our P&L, of course.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nOK. That's helpful. My follow-up question is, you talked about customers' inventory drawdown through at least the December quarter. Are you suggesting that revenue will grow in the March quarter? And then to the -- follow-up to that, how do you see this cycle playing out for the nearline market compared to the previous cycles in 2020, 2018, 2016.\n\nThose cycles usually fixed by dropping two to three quarters, and then it comes back on maybe a quarter or two quarters later. Do you think that will be comparable this time?\n\nDave Mosley -- Chief Executive Officer\n\nI think 2016 was kind of a double dip. So it was a real odd ball. I don't expect that's going to happen here. I think what we have is a phasing up of a confluence of factors between macroeconomics and architectural transitions like we talked about, some supply chain issues that people still have.\n\nI do think we'll see some people start to come out of it sooner rather than later and other people may be more conservative. So -- it's too early to call exactly when it's going to happen, but we're going to be watching it very carefully and then making sure that we use our cash to only build what's absolutely necessary for the market through that period.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question will come from Ananda Baruah with Loop Capital. Please go ahead.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nHey, thanks, guys. Good morning. Thanks for taking the question. Yes, I ask two, real quick.\n\nOne on gross margin and then one on the restructuring plan. On the gross margin, so is it -- are you guys -- I guess the question is are you guys adjusting your production capacity at all? Or are you holding pat and just absorbing the restructuring charges right now? And I guess, sort of the follow-on to that is sort of that would -- sort of suggesting that any pickup in gross margin is all production-related going forward? And then I have a quick follow-up.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nWell, I said this before, of course, the level of production will have the majority of the impact on our gross margin in the future, but also the restructuring, we are restructuring the company. This will give us some benefit and some financial benefit in the future. A part of this restructuring, a significant part of the restructuring is actually in manufacturing. So when production level goes back up to where it was before, and our top line will start to improve.\n\nAs I said before, we expect gross margin to go back to where it was and even better.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nGot it. So the restructuring is it also involves production? Is it production capacity as well, Gianluca? I guess, could you give us any sense of what -- how to think about the split of the restructuring program between.\n\nDave Mosley -- Chief Executive Officer\n\nI think, Ananda, as you know, there's many different types of factories that we have. And so some are dramatically underutilized. Others will keep running relatively heavy because we're doing experiments to make sure that we can do product transitions and get the yields up on the products that are going to bring us out of this period. And some of those products are way more efficient as well, so we can use that not only the investments that we're making from an opex perspective but to guide ourselves toward what restructuring we need to do of our manufacturing footprint through this period.\n\nSo I think they go hand in glove.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nBut longer term -- Ananda, longer term, we will also have the benefit of our new technology. So with a 30-terabyte HAMR and future products based on that technology, we also expect that to be accretive to our gross margin. So there are many things that you need to consider when you start to model longer term.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nAnd Gianluca, when do you think you're at run rate for the opex portion of the restructuring program? [inaudible] run rate?\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nYes. So if we execute the restructuring, as we are planned in November, I would say the March quarter will include the full benefit.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nGot it. All right. Thanks, guys. Appreciate it.\n\nOperator\n\nAnd our next question will come from Thomas O'Malley with Barclays. Please go ahead.\n\nThomas O'Malley -- Barclays -- Analyst\n\nHey, guys. I just wanted to ask kind of an overarching question on the recovery here. Obviously, there's pretty limited visibility right now. Clearly, you're working through new negotiations with your customers, but could you just help give us a picture of how long and how deep this recovery may last.\n\nObviously, you're guiding substantially down for December. As you look into the March quarter, obviously, customers are acting differently, but would you expect the total company revenue to be down again? Or do you think that you could see a recovery starting at the beginning of the calendar year?\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nWell, of course, it's difficult to predict the future, and we have been a little bit surprised recently, but I can tell you in our internal plan, we see an improvement in the March quarter compared to what we are carrying in December.\n\nDave Mosley -- Chief Executive Officer\n\nAnd, Tom, certainly on what we're planning on building and then moving, we intend to reduce our bills right now to make sure that the inventory gets properly adjusted. We said in our last quarter as well. I mean -- so we're watching the inventory that the entire market has. But we also do think that at some point, mass capacity is going to start climbing again.\n\nSo we just want to get their with the right products and to make sure we control the bills.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nEspecially if the situation in China will start to improve compared to what has been in the last six months, that will be a major benefit to our business.\n\nThomas O'Malley -- Barclays -- Analyst\n\nGot it. And then my second one is just on the right mass capacity exabyte growth rate for the long term. So I think, Dave, you talked about conversations with U.S. hyperscalers right now, most of them are coming in kind of below or the long-term agreement, was they were pulling above that previously.\n\nBut you're really only taking the mass capacity growth rate down from like 30 to like the upper 20s range. Obviously, nearline has been running above that. But with all these LTAs or these conversations that you have with these cloud guys coming in below, like how do you get comfortable with the fact that that mass capacity is still at that high 20s rate? Like shouldn't it be normalized a little bit lower than that, given that these guys look to be ordering at a slower rate coming out of this higher growth period of time?\n\nDave Mosley -- Chief Executive Officer\n\nYeah, that's good. So this year it will be so far down. The question is, does it snap back or -- I made reference earlier in the call here to I think calendar '20, where it was 60%. So I don't expect that just to be blunt, but this is exactly why we go work those LTAs, give people predictability, our sales predictability on what exactly the demands are for our factories, and then give the customers the predictability so that they can understand the pricing environment and so on and the number of exabytes we are going to need to pull.\n\nAnd so we are still having those conversations very seriously with everyone. I think what changed through the course of the summer was the fact that they were telling us about what's going on this fall, and we got this phase-up of all these different macroeconomic business, architectural transitions that were happening that are affecting us.\n\nOperator\n\nOur next question will come from Toshiya Hari with Goldman Sachs. Please go ahead.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nHi. Thanks so much for taking the question. I joined late, so apologies if you've already addressed these questions. First one on pricing on a per-exabyte basis for your mass capacity business.\n\nI think in the quarter, that number was down kind of mid-single digits on a sequential basis, down kind of low teens year over year. I think there was a 12-month stretch from mid-'21 through early '22, where pricing per exabyte was down in the single digits. Pre-COVID, it was down 15%, plus or minus. Should we expect pricing in your mass capacity business on an exabyte basis to be down low to mid-teens going forward? And kind of the benign conditions last year were kind of one time, if you will? Or should we expect pricing to improve as you come out of this inventory digestion phase?\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nNo, I think the price will improve. Of course, in the September quarter, the mix is also very important. We shifted a lot of our 20 terabyte. So it's difficult to just look at the price in total.\n\nYou really need to look at the price or the like-for-like was the same product. What I said before that maybe no, you didn't get because you were not here. On the legacy part of the business, we have some pricing pressure. On the mass capacity, the mid capacity, there is some reduction, but on the high capacity drives, the pricing is very stable.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nGot it. That's helpful. And then, Gianluca, on free cash flow, as you go through this inventory digestion phase and lower levels of revenue, should we brace for a quarter or two of negative free cash flow? I don't think that's happened with you guys in a very, very long time. Or do you think you have enough levers on the working capital side to stay positive free cash flow for the next couple of quarters? Thank you.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nWe think we'll stay positive. I said before, we also have a fairly high level of inventory that we are reducing. So this will help also with our free cash flow. So we don't expect so far any negative quarter on free cash flow.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nThanks so much.\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nAnd this will conclude our question-and-answer session. I'd like to turn the conference back over to management for any closing remarks.\n\nDave Mosley -- Chief Executive Officer\n\nThanks, Cole. As always, I'd like to thank all of our stakeholders for their ongoing support. I'm confident Seagate will navigate through these near-term difficult conditions and be in a stronger position to meet our customers' needs for innovation and for cost-effective storage solutions well into the future. Thanks for joining us today, and we look forward to further engaging with our shareholders over the next few months.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nShanye Hudson -- Senior Vice President, Investor Relations, and Treasury\n\nDave Mosley -- Chief Executive Officer\n\nGianluca Romano -- Executive Vice President and Chief Financial Officer\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nShannon Cross -- Credit Suisse -- Analyst\n\nJim Suva -- Citi -- Analyst\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nThomas O'Malley -- Barclays -- Analyst\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nMore STX analysis\n\nAll earnings call transcripts"
}