{
  "companyName": "Glatfelter",
  "companyTicker": "GLT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/glatfelter-glt-q3-2022-earnings-call-transcript/",
  "content": "Glatfelter (GLT -0.71%)\nQ3 2022 Earnings Call\nNov 03, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the Q3 2022 Glatfelter earnings conference call. Today's conference is being recorded. At this time, I would like to turn the conference over to Ramesh Shettigar from Glatfelter. Please go ahead, sir.\n\nRamesh Shettigar -- Senior Vice President, Chief Financial Officer, and Corporate Treasurer\n\nThank you, Sarah. Good morning, and welcome to Glatfelter's 2022 third-quarter earnings conference call. This is Ramesh Shettigar, senior vice president, chief financial officer, and treasurer. On the call to present our third quarter results with me today is Thomas Fahnemann, our new president and chief executive officer.\n\nBefore we begin our presentation, I have a few standard reminders. During our call this morning, we will use the term adjusted earnings as well as other non-GAAP financial measures. A reconciliation of these financial measures to our GAAP-based results is included in today's earnings release and in the investor slides. We will also make forward-looking statements today that are subject to risks and uncertainties.\n\nOur 2021 Form 10-K and our periodic quarterly reports filed with the SEC and today's release, which are all available on our website, disclose factors that could cause our actual results to differ materially from these forward-looking statements. These statements speak only as of today, and we undertake no obligation to update them. I will now turn the call over to Thomas.\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nHello, everyone, and welcome to our third-quarter conference call. This is my first conference call as Glatfelter CEO, and it is a pleasure to be with you today. With the benefit of having worked at Glatfelter for two months, it's an opportune time for me to share my assessment of the business and the steps we are taking to return to profitability. Since joining the company, I've been spending time meeting with customers and investors, visiting our manufacturing sites and engaging with our extended leadership team.\n\nThe insights I have gained in my early tenure will be the focus of my remarks today, and Ramesh will report on our third-quarter performance. There are three key takeaways from today's call. First, rising inflation and energy prices have had a severely negative impact on our business. The challenge persists and our operating environment remains difficult, especially in Europe.\n\nDespite all these challenges, the ALA segment continued to perform well and composite fibers is showing encouraging signs of improvement. Second, the underlying fundamentals of our business are strong. The strategy is sound and Glatfelter remains competitively positioned to serve our global customers in attractive growth markets despite current challenges. And third, our turnaround plan is simple, achievable and already well underway.\n\nOur goal is to return Glatfelter to profitability, strengthen our ability to navigate economic headwinds and position the company for profitable long-term growth. The plan is comprised of six initiatives aimed at optimizing our portfolio, our operations and our capital structure, which we are seeing early signs of progress that have already helped to contribute to our Q3 performance. The bottom line, Glatfelter is capable of far more than it's delivering today. And this is precisely the opportunity that attracted me to Glatfelter.\n\nI've spent the best part of 20 years leading various companies in different industries through major change, and I'm applying that experience to lead our turnaround efforts. I bring a familiarity with the industry, having spent many years leading similar consumer-driven industrial business focused on engineered materials and manufacturing. And of course, I also bring a deep understanding of the international markets, which is particularly helpful given Glatfelter's operating footprint and global reach. I'm spending time individually and collectively with our leaders traveling to our facilities and walking the shop floor.\n\nI've seen firsthand that our people continue to be guided by shared values despite the many challenges facing the business. There is a strong degree of integrity and respect and the desire to contribute to a customer-focused, socially and environmentally responsible organization. Our culture is strong, the executive team is both capable and committed. And together, this is an excellent foundation from which to drive change.\n\nThe day I walked in the door, I knew this business had been hit hard by inflation and rising energy prices, plus the ongoing conflict between Russia and the Ukraine. Today, with the benefit of seeing the company from the inside, I have a much deeper appreciation for how challenging market and macro conditions have been and, frankly, will continue to be for some time. and most importantly, immediate actions need to be implemented. While there may be some optimism around energy pricing relief the macroeconomic environment, especially in Europe, will undoubtedly continue to create near-term volatility and headwinds for our business.\n\nI see a compelling investment thesis for this company. The past two months have served to reinforce this view. It is clear the company has a solid strategy built on competitive positioning, innovative and quality products and a strong customer relationship of all, which contributes to its market position as a leading global supplier of engineered materials. I have met with our top customers, and I'm impressed by the spirit of collaboration and partnership Glatfelter has established with them.\n\nI witnessed the specialized manufacturing technologies and techniques we are employing throughout our three segments to serve our customers. And it's evident that our products are essential to everyday life regardless of where we are in the economic cycle. The issue we now need to address to improve our performance is not our market positioning and it's not our overall company strategy. The problem is rooted in aspects of execution, which our turnaround plan will address.\n\nAfter you hear from Ramesh, I will provide additional details on the turnaround strategy. Ramesh?\n\nRamesh Shettigar -- Senior Vice President, Chief Financial Officer, and Corporate Treasurer\n\nThank you, Thomas. Slide 3 of the investor presentation provides the highlights of our third-quarter performance. The GAAP EPS loss of $1.10 was driven primarily by the impairment charge we took in the spunlace segment. Despite continued inflation and challenging economic backdrop, adjusted EBITDA was $26.3 million and close to our previous guidance of $27 million.\n\nSupporting this performance was a record quarter for our Airlaid Materials segment on operating profit and EBITDA. Composite fibers also delivered results slightly above expectations. However, spunlace was significantly below expectations driven by the widening price cost gap and lower shipments. Slide 4 shows a bridge from adjusted EPS of $0.21 in the third quarter of last year to a loss of $0.10 in the third quarter of this year.\n\nComposite fibers results improved earnings by $0.01 as higher selling prices, lower depreciation from the Dresden impairment and favorable currency and related hedging more than offset the inflationary pressures and volume decline from EU sanctions. Airlaid Materials results increased earnings by $0.03, primarily due to the segment's ability to effectively pass through inflation to customers, coupled with favorable mix and strong operations supported by the higher demand in North America. Spunlace results lowered earnings by $0.07 as a result of input cost inflation that outpaced price increases, lower-than-expected volume and the high cost of production due to elevated waste rates, inefficiencies and labor shortages in the U.S. To note, spunlace was not in our results for Q3 2021 as the acquisition had closed at the end of October last year.\n\nCorporate costs were $0.02 unfavorable, driven by relatively higher spending and travel versus last year, but in line with guidance and pre-COVID levels. Interest expense lowered earnings by $0.09 with the issuance of a new bond to finance two acquisitions, and taxes and other items were $0.17 unfavorable mainly due to a valuation allowance of $5.2 million related to our spunlace operations in Soultz, France. Slide 5 shows a summary of third-quarter results for Airlaid Materials. Revenues were up 18% on a constant currency basis versus the same prior year period, mainly driven by higher selling prices of approximately $23 million stemming from contractual cost pass-throughs as well as price increases initiated for customers without such arrangements.\n\nVolume was lower by 4% year over year, mainly driven by weaker tabletop and home care shipments, although sequential volume was up 3%. Operations were favorable by $1.4 million, driven by higher production in our North American sites to meet strong customer demand. Foreign exchange was unfavorable by $2.6 million, resulting from the weakening of the euro. For the fourth quarter of 2022, we expect a continuation of higher selling prices to offset inflation, given the effective cost pass-through mechanisms we have in place.\n\nVolume is expected to be 2% to 3% lower, reflecting normal seasonality in the fourth quarter and unfavorably impacting results by $1 million to $2 million -- by $1 million. Operations is expected to be in line with the third quarter. Slide 6 shows a summary of third-quarter results for the composite fibers segment. Total revenues were up 5% on a constant currency basis despite volume being lower by 24% versus the same quarter last year.\n\nThe revenue increase was mainly due to higher selling prices of approximately $23 million as we have successfully converted approximately 55% of the revenue base to a floating price mechanism, coupled with multiple pricing actions and energy surcharges taken in 2022 to offset inflation. Lower wallcover shipments of 54% accounted for over 80% of the revenue decline year over year as this product category was the most impacted by EU sanctions. Lower volume overall unfavorably impacted results by $2.7 million. Continued escalation in the price of energy, key raw materials and freight, lowered earnings by $24.3 million versus the same quarter last year.\n\nOperations and other were favorable $1.8 million, driven by reduced overall spending and lower depreciation following the Dresden impairment taken in the second quarter. Foreign exchange was favorable $3.3 million from the weakening of the British pound, creating a benefit in our U.K. manufacturing cost footprint and currency hedging gains. Overall, the pricing and cost mitigation actions taken in the composite fibers segment are aiding its turnaround in our goal to bring the segment's profit margins back to pre-pandemic levels.\n\nLooking ahead to the fourth quarter of 2022, we expect selling prices to fully offset higher raw material and energy prices. Volume is projected to be about 3% higher. And when combined with better mix, is expected to favorably impact results by approximately $1 million. Slide 7 shows a summary of third-quarter results for the spunlace segment.\n\nRevenues were approximately $89 million, while shipments were 9% lower than prior quarter and below our expectations. The decline in volume was mainly driven by labor shortages in our U.S. sites impacting production combined with lower shipments from our European sites related to weaker demand. This, together, unfavorably impacted results by $2.7 million when compared to Q2.\n\nSelling prices and energy surcharges favorably impacted results by $2.9 million but were more than offset by continued raw material inflation and higher energy costs at our European sites combined totaling $7 million. Operations, FX and other items were a net $4 million favorable, mainly driven by integration cost reduction efforts, lower energy consumption and overall lower spending. For the fourth quarter of 2022, we expect higher selling prices to offset raw material and energy inflation. Volume is expected to be 10% to 15% lower, driven by a reaction from price-sensitive customers to our recent price increases, unfavorably impacting operating profit by approximately $1 million to $2 million.\n\nAs a result, we expect an operating loss of approximately $6 million for the quarter. Slide 8 shows corporate costs and other financial items. For the quarter, corporate costs were higher by $1.5 million versus the same period last year, mainly due to relatively lower legal, travel and corporate spend. For the full year, corporate costs are estimated to be approximately $24 million in line with our previous guidance.\n\nWe expect full-year interest and other financing costs to be approximately $39 million, $4 million higher than our previous guidance. This increase is driven by higher vendor financing costs that are tied to interest rates in the U.S. and Europe and also due to foreign exchange devaluation in the euro and the ruble. Slide 9 shows our cash flow summary.\n\nOn a year-to-date basis, our 2022 adjusted free cash flow was lower by approximately $119 million versus the same period last year, primarily driven by higher working capital usage of $62 million. Working capital usage was driven by multiple factors, including the termination of our U.S. spunlace factoring program, elevated accounts receivable due to price increases and higher inventory values due to inflation in raw materials and energy. Lower earnings negatively impacted cash by $17 million and higher capital expenditures added $12 million to the cash usage.\n\nOther contributing factors were higher taxes and interest paid. We expect capital expenditures for 2022, including spunlace and Mount Holly to be between $35 million and $40 million. This is $10 million lower than our previous guidance and further highlights our continued discipline around capital allocation. Depreciation and amortization expense is projected to be approximately $66 million or $2 million below our previous guidance, driven by lower capital spending and a weaker euro.\n\nAnd finally, we expect enterprise EBITDA for the fourth quarter to be between $23 million and $26 million. Slide 10 shows some balance sheet and liquidity metrics. Our bank covenant leverage ratio increased to 5.7 times as of September 30 versus 5.3 times as of June 30 due to weak spunlace earnings. Our available liquidity at the end of Q3 was approximately $127 million, and our near-term focus continues to be on earnings growth, cash flow generation and delevering of the balance sheet.\n\nThis concludes my prepared remarks. I will now turn the call back to Thomas.\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nThank you, Ramesh. Now for an overview of our turnaround strategy. On Slide 11, you can see our six areas of focus. First, portfolio optimization; second, margin improvement; third, fixed cost reduction; fourth, cash liberation; fifth, operational effectiveness; and sixth, returning spunlace to profitability.\n\nStarting with portfolio optimization, we are looking at every part of our portfolio and considering the strategic and financial value of each asset for the near and long term. I have the benefit of looking at everything with fresh eyes and together with the team, we are assessing how to optimize the assets we own currently to ensure we move forward with only those assets that align with Glatfelter's strength. We intend to invest our time and resources in the areas of our portfolio that have scale or the potential for scale, a strong market-leading position and where we have a core competency in the manufacturing technology. Our Airlaid business is a great example of how we have used these elements to drive improved performance and EBITDA contributions.\n\nThe Airlaid segment serves as an indication of what is possible as we apply this same focus to other areas of our portfolio. Also, we will be looking at the best way to address the assets that are non-core. We will focus on those that like either a significant share of market and scalability or those that do not have a unique differentiator that will allow us to compete profitably in a particular product category. Size is an important consideration in this assessment.\n\nIf we are too small, it is not going to be -- it's going to be very hard for us to compete profitably on a global scale. And of course, we will consider the potential for future EBITDA contribution but this is just one of many important factors. We are continuously assessing our portfolio, and we believe there are opportunities to divest noncore assets that may enable us to pay down debt, reduce leverage and reset our focus on our core business. Turning to margin improvement.\n\nThis is a fundamental part of our turnaround strategy. We will place greater focus on profitability rather than simply top-line growth. As we make this shift, we can expect that volumes will soften in the short term. There is no way around this, and its critical first step on the path to improved EBITDA.\n\nOur margin improvement efforts will focus on closing the gap between price and cost. The team has communicated to every customer and is making good progress addressing input cost inflation. Everywhere we have had the opportunity to increase our prices, we have done it. and it has largely been accepted by our customers who value our products and recognize the economic constraints in which we are operating.\n\nAs inflationary pressure continues, we are confident that we will be able to price competitively at a productive rates and drive our profitability back to pre-COVID levels. While rising input prices were the main driver for compressed margins, our fixed cost base also presents opportunities to improve margins. Like all businesses in the current economic environment, we are evaluating the potential for cost savings across the business, which is the third initiative of our turnaround plan. As we move to a leaner cost base, we will not risk jeopardizing safety, product quality or investments in our people.\n\nWith that said, we conducted a bottom-up review of our sales and general administrative resources. And based on our analysis, we are implementing changes that will generate full year run rate savings in the range of $9 million to $10 million by 2024. Now for our fourth initiative, cash liberation. Clearly, we need to pay down debt, decrease our leverage and increase EBITDA.\n\nThis will require prudent decision-making with respect to capital allocation and a disciplined approach to managing our accounts receivables, finished goods inventory and raw material pricing. To that end, we are also tightly controlling our capital spending, which we expect to be $35 million to $40 million, a significant reduction from where we operated previously. In addition, the board has already acted to suspend the dividend, which will free up approximately $25 million of cash annually. We are supporting this by actions to improve cash flow across the business and through the portfolio optimization initiatives, I referred to earlier.\n\nTurning to initiative number five, operational effectiveness. Here, our approach will be largely informed by Six Sigma principles. We do not have the luxury of time to adopt the full Six Sigma overhaul of the business, but we can still benefit from the approach and discipline that comes with the Six Sigma culture, which I have implemented successfully in the past. We have already started to identify where processes are falling short, where excess waste can be eliminated and ways that we can further drive continuous quality improvement and customer focus.\n\nI'm confident that in doing so, we can bring all areas of the business up to the operational standards that are in place in our legacy Airlaid business. Airlaid is a great example because it demonstrates what Glatfelter can do in terms of operational improvements and implementation of best practices. We need to leverage these capabilities by benchmarking KPIs to achieve operational excellence throughout our organization. The area that is most pronounced for needing to drive efficiency, excellence and customer focus is our spunlace business, the sixth initiative in our turnaround plan.\n\nWhile each of the other five elements of our turnaround plan also apply to spunlace, we are highlighting a separate initiative given the intensity and urgency with which we are tackling the segments underperformance and overall challenges. As an investor, I'm sure you are likely looking for me to provide my perspective on the value of the spunlace acquisition and whether it was a good decision to acquire this business. From a strategic perspective, the spunlace business is a logical addition to our business portfolio. Among other things, spunlace adds a branded business to the portfolio and gives us access to a very good manufacturing technology in nonwovens that nicely complements our Airlaid and composite fibers businesses.\n\nOperationally, there are a lot of challenges. Spunlace is not cost-competitive currently, and we are not able to pass through raw material and energy input costs as effectively as we can with Airlaid and composite fibers. Overall, the work ahead of us in spunlace is more than was originally anticipated. The segment's performance to date, along with the impairment charge we have taken on this asset is a clear indication that this acquisition is not what the company first thought it could be.\n\nI believe the team has a good understanding of what is needed to stabilize the spunlace business to return to profitability. We will address the cost base and optimize output so we can meet customer demand. This isn't a new message for you, but is changing under my leadership is the speed of execution and the level of accountability. We have changed the reporting structure through the leadership of our spunlace business reports directly into me.\n\nThe team is supported with the resources needed to execute the turnaround and to make informed decisions quickly. By ensuring clear accountability and instilling the need for action, we will be better equipped to deliver on the work required to bring the operations up to our standards by using the same methodology and rigor as in our Airlaid business. I'm confident we can return the segment to profitability, which is an immediate priority. It will not be an easy 6, but we will absolutely get there.\n\nThe potential for longer-term EBITDA growth remains an open issue, and I will give you an update on our progress when we report our Q4 results. Now the related questions. How long will it take to deliver the overall turnaround plan? And what will the impact be? On timing, I'm optimistic we will start to see an improvement in our performance within the first half of 2023. And we will generate quarter-to-quarter improvement throughout next year.\n\nOf course, our success in the coming months is also determined in part by the ongoing volatility of market conditions, including the looming recession in Europe and whether there will be any lasting relief from energy pricing. As I said at the start of the call, we remain focused on the factors within our control. In terms of the time line to execute our turnaround, this will be our focus from now to all of 2023. Regarding potential impact and upside, the entire management team and I are confident that Glatfelter can deliver significant value creation upside and annual EBITDA at levels much higher than where they are today.\n\nAt this early stage of the turnaround and considering the market uncertainty, it is premature to speculate beyond that. We are confident we will perform within the guidance range of $23 million to $26 million for the fourth quarter of 2022. And that will be -- and that we will be able to deliver ongoing improvements from this point forward. To conclude today's call, I'm encouraged by the prospects of this business and that we have the right talent and resources in place to execute against our turnaround strategy.\n\nI'm committed to lead Glatfelter to the next level of performance, and I'm confident it is well within our reach. I look forward to reporting back to you on our progress. And with that, I will turn the call over for questions.\n\nOperator\n\n[Operator instructions] And we'll take our question from Mitra Ramgopal with Sidoti.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nThomas, thanks for the color and detail around the initiatives for the turnaround strategy. First, I just want to get a sense, you sound very confident that starting next year, we should start to see results and we're heading into a potential recession. And again, given the existing issues already out there in terms of labor shortages, raw material costs, energy pressures, etc., and now compounding that the potential slowdown in consumer demand. Just wondering what gives you the confidence that you will be able to start showing improvement.\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nYes, Mitra, thank you for the question. Number one, I mean, we are focusing on the issues we can control. And we are very confident that this will be implemented as soon as possible. What we are seeing in the marketplace, and you're right, Europe is probably heading into a recession.\n\nBut on the other hand, our product portfolio is pretty strong. If I look at our Airlaid business and our composite fibers business, we feel pretty good about that consumers will need these products. And if I look at our turnaround plan and the improvements we will implement over the next three to six months will show significant improvement in our cost base. And again, as I mentioned before, we are looking at the overall economic situation, and we are hoping that we might get a little bit of tailwind.\n\nBut we are still very, very confident that we can really based on the things we can control, that we can improve our performance. Early signs and what we're hearing right now from the European side is that the energy situation will be hopefully improved next year. As Germany, for example, has now really implemented a gas price cap for power and gas. So that will tremendously help us.\n\nAnd so overall, we are very optimistic that we can actually get, number one, the things we can control ourselves under control. And then with the energy price situation, which is still very difficult, but now that we really have a little bit more certainty on how energy prices will shake out next year that we will be able to deliver improvement quarter by quarter.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nAnd I think you mentioned one of the things you feel you can control, obviously, is the execution internally. And I was just wondering if -- I know it's only been a couple of months, but do you feel you have the team in place to execute the strategy?\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nMitra, absolutely. I think we -- and again, it's now nine weeks, and we have, as you might imagine, spend a lot of time together. And I'm really very, very pleased with the management team. I think everybody is committed.\n\nI think we have the right skill set in place. And I have no doubt that this is the right team to kind of face the challenges which are ahead of us. And there's a lot of work we have to do, but I think everybody is 100% committed, and I'm very, very optimistic that we get this done. And one of the things I just want to reiterate here is that we don't have a strategic problem with Glatfelter.\n\nI think we have the right product portfolio. We are in the right businesses. We need to really focus on execution. And this is our main focus.\n\nWe need to execute, and I think we have created a sense of urgency within the company. I think everybody in the whole company knows what we need to do. We have established accountability. And I think -- so I'm extremely optimistic that we are getting things done now.\n\nAnd hopefully, you will see this in our quarter-by-quarter improvement.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nOK. And I think you've had success in terms of implementing higher selling prices to deal with the higher raw material costs and energy, etc. Just curious if you're seeing any slowdown on the demand -- end market demand as a result of the more -- of the inflationary environment.\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nYes. I mean I think we have to differentiate a little bit. If I look at the Airlaid business, I mean, we feel very confident. I mean, we have implemented -- and the business is for, again, like I mentioned in my remarks, Airlaid is really the example we are looking at and that we need to really -- everything we are doing in Airlaid, we need to kind of benchmark the other businesses and drive improvement in the other business.\n\nI mean, like I said, we know how to do it. It's not that we have to reinvent the wheel. We know how to do it. So our Airlaid business is extremely strong.\n\nWe implemented further price increases, which were necessary based on inflation, and we haven't seen any big volume problems there. So this is a pretty solid business. And so as far as composite fibers is concerned, we also already in September, pushed a lot of price increases through. We have seen a little bit of weakness in volume here and there, but nothing significant.\n\nOur biggest problem, as I mentioned before, was our spunlace business, but it's not just a problem of pricing. It's also a problem of operational excellence, which we are lacking in certain areas and where we have to get our cost structure in spunlace under control. And this is what we are focused on right now.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nOK. Well, just following up on that. Obviously, margin improvement is certainly one of the big goals. Pricing is certainly helping, and I think you identified about $9 million to $10 million of SG&A reduction by 2024.\n\nI'm assuming that's probably low-hanging fruit and as you evaluate additional cuts, this is just sort of a first take, so to speak. Is that fair?\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nThat's fair. Yes. Again, what we did is we did an in-depth analysis on our SG&A. And I also want to kind of emphasize here, this is -- the $9 million to $10 million I was mentioning is on top of what the team already implemented before, OK, after the acquisition of spunlace.\n\nSo that's on top of it. And this is actually -- we are already implementing this. This is on the way. And again, the full run rate will achieve in 2024.\n\nSo we will see a little bit of that already in 2022. We will see, I would say, 50% of this in 2023, but then the full run rate will be in 2024. And -- so we are doing this. And then also all the other improvements which we are implementing right now, you will see quarter-by-quarter improvement.\n\nAnd there's something which might take a little bit longer, but we are very confident that based on our performance in Q3, if you look at this with 26 and now Q4, this is the base. And from there on, we should actually be able to improve our EBITDA quarter by quarter.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nOK. And as it relates to the cash liberation. Obviously, suspending the dividend frees up a lot of cash. And potentially sales of noncore assets could be another source of cash infusion.\n\nBut my sense is looking at the improvement you expect for 2023, you should be able to generate sufficient cash flow for improved working capital and potentially even debt reduction. Is that --\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nYes, that's fair.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nAnd as we look at the balance sheet, I think net leverage went up to about 57% at the end of the quarter. could we sort of see that now as a peak heading into 2023?\n\nRamesh Shettigar -- Senior Vice President, Chief Financial Officer, and Corporate Treasurer\n\nMitra, we don't -- we're not providing guidance anything past 2022 at this point, but I think it's a fair assumption that we expect the leverage for Q4 to be in the same range as where we are right now for Q3. But what I want to come back to is the point you brought up earlier, which is regarding cash liberation. I think that is a significant lever that we have at our disposal right now. Thomas talked about the suspension of the dividend.\n\nI talked about the $10 million reduction in our capital spending relative to our previous guidance. Working capital initiatives, absolutely going after past dues, tightening up inventory, tightening up payment terms. These are all the initiatives that we're going to be going after, which will not only kind of allow us to generate more free cash flow, but will also be put toward paying down debt. So that should also be a direct improvement to our leverage.\n\nSo we're going to approach this from both sides, right? Thomas talked about the kind of the EBITDA side of the house, which is the initiatives around pricing, cost reduction, portfolio review of noncore assets and so on, and then we're going to hit it from the other side on capital allocation, on working capital and any other uses of cash that will allow us to pay down debt.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nOK. Great. And I know there was a goodwill impairment charge in the quarter. Just curious, obviously, with the turnaround, a lot of moving parts right now, what should we anticipate any more sort of onetime items once we get into '23?\n\nRamesh Shettigar -- Senior Vice President, Chief Financial Officer, and Corporate Treasurer\n\nNo, Mitra. We took a pretty holistic view as we assessed the spunlace business. We do this every year from an impairment standpoint anyway. This was even inside of the 12-month period of the acquisition.\n\nWe felt that as we looked at the forward-looking picture for spunlace and where the performance has been, this was the appropriate thing to do. And when we ran that valuation, it basically cleared out all the goodwill, which is what we took a charge on for this quarter. But we don't expect -- unless there is any kind of portfolio rebalancing or capacity rebalancing that may be necessitated out of the operational reviews that Thomas was talking about, we don't expect any additional impairment coming out of the spunlace business for the near future.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nOK. And then just some final questions on the segments. If you look at Airlaid materials, I think you mentioned you're still seeing strong customer demand, but you had some weakness in some of the lines. I think that's more just a difficult year-ago comps versus anything else.\n\nRamesh Shettigar -- Senior Vice President, Chief Financial Officer, and Corporate Treasurer\n\nYes, I would agree with that. Mitra, correct.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nAnd on the composite fibers, I know the -- yes?\n\nRamesh Shettigar -- Senior Vice President, Chief Financial Officer, and Corporate Treasurer\n\nNo. You're right because 2021 was a very different time frame as it relates to energy, inflation, and so on. So some of that year-over-year comp that you see in the slides related to product categories and financial performance also has to do with the comparison point being in a very different economic backdrop than where we are today in 2022.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nRight. And then on the composite fibers segment, with wallcover being down definitely sanctions driven or impact by the Russia-Ukraine conflict. But in terms of the softness you saw in some of the other lines, is it a question where the price increases, maybe start to have an impact on demand or not the case really? Again, just a difficult year-ago comp.\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nYes. No, I mean yes, you're right, Mitra. I mean, we were pretty -- I mean, there was a lot of we had a lot of pricing increases implemented in September, and this is going on in our inflationary environment. And there are certain pockets of the businesses where it was easier to pass this on and other areas where it's a little bit more complicated where we also have competition.\n\nBut overall, if we look at the price increases, we were able to pass on to our customers versus the little softness we had on volumes. The softness was really -- I mean, there was not much volume loss. Now overall, I would say, certain areas of our composite fibers businesses is more vulnerable to overall economic -- the overall economic situation. There's no doubt about this, and we might see some weaknesses there in the future.\n\nBut again, and I would like to reemphasize, we are focusing on the things we can control, and we are executing this rigorously on time with the sense of urgency. We can control the overall market, but I'm confident that if -- even in the existing environment we are in, we are seeing -- we will see improvements. If things happen in the market, we have a huge recession in Europe or problems in the U.S., yes, this will impact our business, but we will be much better off than we are right -- where we have been, and we are actually ready for that, OK? The question is always for us, I mean, how much will the improvement be and this depends a lot on the overall market. There's no doubt about that.\n\nBut I think we need to get ready for that. And as far as Airlaid is concerned and composite fibers is concerned, I think we're in a pretty good spot, and we can actually move on from here. And spunlace we need a little bit of time to really also get our cost situation in order and all this. And this will take a little bit more time.\n\nThe good part is, and I just want to kind of -- the news we are hearing out of the European energy side are actually promising that they will cap especially in Germany, and we are very actually exposed in Germany with a lot of factories over there that there will be a price cap for gas and power. I mean this will help tremendously for us. And this will be in place for all of 2023 and the first quarter of 2024. So that will help a lot.\n\nAnd I think it takes out a certain volatility and it also helps us with our overall cost structure. So that's actually positive news. Despite the fact that there is a looming recession, I mean, yes.\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nRight. OK. No, that's great. Certainly look forward to getting an update on the next earnings call.\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nOK. Yes. Thank you, Mitra.\n\nRamesh Shettigar -- Senior Vice President, Chief Financial Officer, and Corporate Treasurer\n\nThank you, Mitra.\n\nOperator\n\nAnd that does conclude our question-and-answer session today. I would now like to turn the conference back over to Thomas for any additional or closing remarks.\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nOK. Yes. Thank you, everyone, for spending time with us. And I'm looking forward to being back and reporting about our Q4 earnings end of February of 2023.\n\nAnd then that would then conclude our call today. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRamesh Shettigar -- Senior Vice President, Chief Financial Officer, and Corporate Treasurer\n\nThomas Fahnemann -- President and Chief Executive Officer\n\nMitra Ramgopal -- Sidoti and Company -- Analyst\n\nMore GLT analysis\n\nAll earnings call transcripts"
}