{
  "companyName": "American Public Education",
  "companyTicker": "APEI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/american-public-education-apei-q2-2022-earnings-ca/",
  "content": "American Public Education (APEI -3.23%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to today's American Public Education, Inc.'s second quarter 2022 results call. Today's call is being recorded. All lines have been placed on mute to prevent any background noise. And after the speakers' remarks, there will be a question-and-answer session.\n\nI would now like to turn the call over to Ryan Koren, head of investor relations. Please go ahead.\n\nRyan Koren -- Head of Investor Relations\n\nThank you, and good afternoon, everyone. Welcome to American Public Education's conference call to discuss second quarter 2022 financial and operating results. Joining me on the call today are Angela Selden, president and chief executive officer; Rick Sunderland, executive vice president and chief financial officer; and Steve Somers, senior vice president and chief strategy and corporate development officer. Materials for the conference call today are available under the events and presentations section of the APEI website.\n\nPlease note that statements made during this conference call and any accompanying presentation materials regarding APEI and its subsidiaries that are not historical facts may be forward-looking statements based on the current expectations, assumptions, estimates, and projections about APEI and the industry. In some cases, forward-looking statements may be identified by words such as anticipate, believe, seek, could, estimate, expect, can, may, plan, should, will, would, and similar words, or their opposites. Forward-looking statements include, without limitation, statements regarding expected growth, registrations and enrollments, revenue, net income, earnings per share, and adjusted EBITDA, as well as other earnings guidance. Expected benefits of the acquisition of Rasmussen University; plans with respect to recent, current, and future initiatives, including with respect to synergies and headcount; and future demand or expectations for online enrollment and nursing education.\n\nForward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those expressed or implied by such statements. These risks and uncertainties include, among others, risks related to the effects of and the company's response to the COVID-19 pandemic; changing market demands; actions taken by the Department of Defense or branches of the U.S. Armed Forces, including actions related to the disruption and suspension of tuition assistance; challenges with integrating acquisitions, regulatory matters, competitive pressures, and those described in our presentation and today's press release, the company's Form 10-Q filed with the SEC today and other SEC filings. The company undertakes no obligation to update publicly any forward-looking statements for any reason unless required by law, even if new information becomes available or other events occur in the future.\n\nThis presentation contains references to non-GAAP financial information. A reconciliation between the non-GAAP financial measures we use and the most directly comparable GAAP measures is located in the appendix to our presentation and in our earnings release. Management believes that our presentation of non-GAAP financial information provides useful supplemental information to investors regarding our results of operations and should only be considered in addition to and not as a substitute for or superior to any financial -- measure of financial performance prepared in accordance with GAAP. I would now like to turn the call over to our CEO, Angela Selden.\n\nAngie, please go ahead.\n\nAngie Selden -- Chief Executive Officer\n\nThank you, Ryan. And thank you all for joining us today and for your interest in American Public Education. Today, I will begin my remarks about important initiatives and actions to build the next chapter in APEI's history while continuing to provide an exceptional return on educational investment for our service-minded students. Several important developments have occurred since our last earnings call.\n\nWe will share more details throughout our remarks today. However, in summary, we have welcomed new leadership to APEI. Yesterday, we announced the new president of American Public University System, Nuno Fernandes, who is currently president and CEO of Latin America's largest OPM, Ilumno, which, at its peak, has served 300,000 students. During his tenure at Ilumno, Nuno has also served as COO, CMO, and SVP of enrollment.\n\nOn Friday, we announced the appointment of Craig MacGibbon, APEI's new chief information officer. Craig has deep familiarity with APEI, having been engaged as consultant for the CTO for the last 18 months. Last week, we publicly launched the search for Rasmussen University's next president after Tom Slagle departed and while Javier Miyares, formerly president of the University of Maryland Global Campus, continues as acting president. We are also continuing our focus on expansion.\n\nOur Hondros Michigan campus is in its final stages of approval. With over 500 people planning to attend our open house and sufficient inbound interest without marketing to fill our initial cohort without having watched any additional spend. Rasmussen's accreditation visit for its Doctor of Physical Therapy, or DPT, program has successfully completed, and we expect the candidacy report from its programmatic accreditor later this month with final approval meeting scheduled in late October 2022. And nursing leads since July 1st have increased over 40% over the prior-year period at Rasmussen.\n\nThis is a result of both our terminating the portion of Rasmussen's contract with Collegiate, the third-party outsourcer regarding media buying and channel execution, and transferring those duties to APEI. We have also invested an additional $3.8 million in marketing behind this early success. And finally, we are executing against new business model innovation. We are pleased to announce the first phase of a partnership with a large national health provider who aims to find nursing education for Hondros AND-RN students.\n\nCertainly, our business also faces some headwinds, which we had already begun to tackle, namely: enrollment momentum and faculty availability in the Rasmussen Pre-Licensure Nursing program. Rasmussen's enrollment momentum in Bloomington, Minnesota, has been limited by self-imposed enrollment caps. As we discussed in our last earnings call, primarily due to lack of faculty availability for clinical. About 3% of Rasmussen's Q3 2022 enrollment decline can be attributed to the self-imposed cap.\n\nRasmussen increased NCLEX clinical wage rates to ensure adequate coverage for faculty and as a result of the prior year-end NCLEX scores for Rasmussen's Bloomington AND program. Rasmussen entered into a consent with the Minnesota Board of Nursing that, among things, establishes the same faculty-to-student ratios for that program, that Rasmussen had previously implemented in order to bring NCLEX scores back to the Minnesota threshold of 75%. Rasmussen's 2022 decline in EBITDA is primarily a consequence of three factors: the year-over-year revenue decline; an increase in the marketing spend, as I noted previously; and an increase in talent cost, which includes the increase in faculty costs, along with aligning Rasmussen's executive compensation and workforce benefits with the APEI plan. As a result, we intend to take $12 million to $15 million out of our nonvariable costs across the entire APEI enterprise in the next 90 days, nearly three times the original incremental year 2 synergy estimate that we stated prior from the Rasmussen acquisition.\n\nOur synergy expectations were initially $5 million in year 1, recurring, and an additional $5 million recurring in year 2. These actions are outside of direct academic delivery costs and outside revenue-generating parts of the business, and instead are focused on realigning the organizational structure, eliminating redundancies, and optimizing certain functions. We are working to complete our realignment changes by the end of 2022 so that the results can fully benefit our 2023 operating and financial results. The limited implementation of the Deloitte version of the ArmyIgnitED platform at APUS has prompted the Army to choose to move to a new portal with a provider currently serving the Air Force called BAM Tech.\n\nThis cut-over is currently scheduled for late August. APUS has been identified as an acceptance test partner and is working collaboratively with the new platform provider on automating some data transfer to minimize manual input required from soldiers or bases. For the second quarter of 2022, APEI's revenue was roughly $150 million, up 92% compared to the prior-year period as we added Rasmussen during the third quarter of 2021. We remain focused on educating the service-minded students and believe we are still well-positioned to take advantage of the sizable nursing education shortage in the United States as the No.\n\n1 educator of prelicensure nurses, as well as building upon our No. 1 position with the active-duty military and veterans. Turning to Page 4, let's discuss APUS' results in further detail. APUS has a strong net cause registrations from active-duty military, particularly from the Army, which was up 38% in the current quarter as compared to the prior-year period and is our largest active-duty military branch.\n\nActive-duty military overall was up 9% in the second quarter of 2022 compared to last year. Registrations for most of the other military branches were negatively impacted in Q2 by the rapid pivot of those services to training and combat-ready status due to the outbreak of the conflict in the Ukraine. Overall, APUS experienced increased net course registrations of 1% in Q2 '22 compared to 2Q '21 as our veterans and nonmilitary saw a pullback consistent with softness in the broader higher end market in the first half of this year. Our status as the No.\n\n1 provider of higher education to active-duty military has effectively provided an offset to the broader market conditions and allowed for an overall net registration increase year over year. To help us enhance our focus on continued growth and execution, as I mentioned before, I'm very pleased to announce the hiring of our new president at APUS, Nuno Fernandes. Nuno comes to us from Ilumno, where he was president and CEO of the largest OPM in Latin America and among the top three globally in a number of managed students. During his almost 10 years at Ilumno, the last three of which he was president and CEO, he was instrumental in driving growth from approximately 100,000 students in 2012 to almost 300,000 students in 2020.\n\nHis simultaneous focus on student success significantly improved student retention and graduation rates to some of the best in the region. We believe Nuno's strong background and experience make him a perfect fit for APUS, and we are excited about the growth trajectory APUS can accomplish under his leadership. We would also like to thank Dr. Kate Zatz for her 18-year commitment to APUS and her service during the last 10 months as acting president of APUS while we completed the search.\n\nSeparately at the end of August, the ArmyIgnitED portal, the system soldiers [Inaudible] to request tuition assistance will be transitioned to a new provider while simultaneously receiving an upgrade to the system. Even as the ArmyIgnitED portal has improved throughout 2022, Army recently announced it will again make a change and transition to an upgraded ArmyIgnitED 2.0 portal for courses beginning on or after October 1, 2022. BAM Technologies will be the new service provider of AIE 2.0 and the expected go live to the upgraded system is August 23rd. While this represents the second transition in 18 months, we believe that there are several important and significant differences between the upcoming transition versus the complications experienced during the 2021 transition from IBM's platform to the current Deloitte-hosted platform that we'd like to point out here.\n\nFirst, BAM Technologies is a proven service provider with significant experience working with the military. It has been operating a similar system for the U.S. Air Force, which it has been servicing for over 15 years. Unlike during the transition in 2021, where there is zero overlap between IBM and Deloitte, during this process, Deloitte will remain on contract through March 2023 to facilitate the transition and could continue as a service provider to any unforeseen issues that arise.\n\nUnlike the 1.0 Deloitte system, which required quite a bit of manual intervention on the part of the Army education service officers on bases, we have been informed that those manual interventions have been eliminated in the 2.0 systems and we welcome this clear upgrade. We can tell you that these manual interventions accounted for roughly 30% of all issues encountered in the 1.0 system. Lastly, in conjunction with the transition to 2.0, APUS has been designated as a user acceptance test or UAC partner. This affords us the ability to see the system prior to rollout and work closely with BAM Technologies to help contribute to ensuring the system operates as intended and the transition is smooth.\n\nOverall, we are cautiously optimistic about Army and BAM Technologies' ability to implement the 2.0 system in a timely manner with as little disruption as possible and see the move away from the previous provider as a positive for Army soldiers and APUS alike over the longer term. Looking ahead, we still expect to be impacted by the tight labor market on the nonmilitary registrations, although we anticipate the impact will be offset or mostly offset by strong continued military growth. Thus far, all branches of the military, except for Coast Guard, are up year over year through the first two months of the third quarter. Overall, we anticipate net course registrations at APUS are between zero to plus 5% in the third quarter of 2022 versus a difficult third quarter '21 comparable period when the Army portal resumed functionality at that time last year.\n\nThis translates to a range of 83,100 to 87,200 net course registrations in the third quarter of 2022. It is important to note that this forecast does not take into account any potential impact related to the transition to the new service provider and upgraded technology of ArmyIgnitED 2.0. Now, let's turn our attention to Rasmussen on Page 5. Performance at Rasmussen in 2Q was not where we expected it to be and was impacted by a few factors and reflects some challenges in specific markets.\n\nIn particular, our Northern region and more specifically, our metro Minneapolis market experienced sharply lower nursing starts. As we discussed earlier in my remarks during the last quarterly earnings call, our nursing enrollment momentum in the Northern region was affected by the lack of available adjunct faculty to support in-person clinical. As a result, we implemented self-imposed enrollment caps to ensure we had the appropriate faculty-to-student ratios, which resulted in lower nursing starts and caused nursing enrollment to contract to 8,200 in the second quarter of 2022, as compared to 8,300 in the prior-year period, or down 2%. If we were to exclude the impact of our self-imposed enrollment cap, we would have generated positive overall nursing starts year over year.\n\nWe are working diligently to solve the adjunct faculty shortage, including by introducing variable wages for challenging clinical time plus, and have seen increased interest from adjunct faculty. Rasmussen will work to continue optimizing the dynamic waste model and ensure faculty shortages don't arise in the future. In addition to the faculty challenge, a few of Rasmussen's ADN program locations continue to experience first-time NCLEX pass rates below applicable state thresholds, which we believe was in large part a symptom of instruction having moved online for a number of months due to COVID. We'd also note that this was not a phenomenon unique to Rasmussen as NCLEX first-time pass rates across the country dipped in recent quarters.\n\nThis is also a key reason why we are metering enrollment in Minnesota so we can deliver on-state NCLEX outcomes. Spending a moment on Rasmussen non-nursing, enrollment saw an 11% decline in the second quarter compared to the prior year. This decline was less than what we experienced in the first quarter, but still down compared to our prelicensure nursing and active-duty military registrations, which remain fairly well insulated from the broader higher education trends. Despite this, there are a few bright spots to report on the non-nursing side, such as increase year-over-year starts in our school of design, up 15%; our school of education, up 12%; and our school of technology, up 9%, albeit each from a small base.\n\nOverall, however, the continued tight labor market and higher wages impacted prospective student interest levels during the first half of the year, leading to Rasmussen non-nursing enrollment performance that we believe is generally in line with the broader private for-profit education sector. Shifting to changes in the business. And as indicated during last quarter's call, we made a strategic decision shortly after the acquisition of Rasmussen to further our strategy by centralizing our marketing and enrollment services at Rasmussen. Part of this shift was migrating the work managed by the third-party provider Collegiate to our in-house marketing operation, which began to take effect July 1st.\n\nWe began the migration earlier than expected, and we are already seeing some early signs of positive results, along with increased efficiency. With these early results, we have increased our marketing investments by $3.8 million at Rasmussen, predominantly focused on prelicensure nursing in our growth markets. While this transition will benefit us with lower marketing costs, it was done so that we have full control of our marketing and enrollment operations. Results through the end of July are showing good momentum and these efforts have begun driving higher lead volume overall, with nursing leads up 40% quarter to date versus the same period last year.\n\nWith the use of more advanced capabilities, we have greater control over optimizing our media across geographies, programs, channels, and audiences. Early signals show an increase in capturing more demand from our primary markets, and we are purposefully optimizing for our highest LTV programs on campus nursing. Additionally, our campuses are showing increased interest in nursing since these activities were brought in-house. We set an ambitious internal goal for new starts in the fourth quarter and are tracking toward meeting these targets.\n\nBased on our current plans, we anticipate that Rasmussen's nursing enrollment will turn positive by the second half of 2023. In addition to the marketing change since our last earnings call, longtime CEO Tom Slagle has departed. We thank Tom for his service to Rasmussen and APEI. As we have officially launched the search for the new president of Rasmussen, early views of prospective candidates are encouraging, and we are particularly focusing on finding a growth-minded leader to help Rasmussen prioritize its core programs and reestablish enrollment momentum, especially in our highest LTV nursing programs.\n\nIn the meantime, the Rasmussen business is in good hands with Javier Miyares as its acting president until the permanent position is filled. Javier has extensive experience in higher education, with over 45 years driving innovation and change in campus-based and online modalities, including eight years, most recently as president of the University of Maryland Global Campus. For the third quarter, our guidance is for Rasmussen's nursing enrollment to be down approximately 8%, and non-nursing enrollment is expected to decrease by about 8% in the third quarter as well, compared to the prior-year period due to general student behavioral trends in the United States. Let's turn our attention to Hondros on Page 6.\n\nAt Hondros, we are seeing positive enrollment momentum. Enrollment is up roughly 3% to 2,440 in 2Q '22 versus the prior-year period. And we are expecting a 4% increase in the third quarter of 2022. While we have seen some slowing down in the growth trajectory, this is partly caused by COVID, as we saw almost 2% of students delayed their resumption of classes after the July 4th holiday because of contracting COVID.\n\nThe cost of tuition remains the No. 1 reason prospective students don't enroll in our Hondros programs. And this is why we are very pleased that we have signed a phase 1 agreement with a large national healthcare provider to facilitate providing access and education to more students through an arrangement of tuition sponsorship in exchange for a multiyear work commitment. As we begin to operationalize this program, we expect normal course challenges but are excited about this inaugural partnership and are encouraged by conversations we are having with other prospective partners.\n\nThese partnerships will be beneficial to all parties as they enhance enrollment growth at our nursing programs, help build a workforce shortage in the healthcare system, and provide reduced education costs plus an entry into a career with a specified employer for our students. Hondros is also seeing early interest from prospective students in the Detroit location despite no marketing effort other than the Michigan Board of Nursing unexpectedly publishing our new location on their website. We have submitted all approval requests and are awaiting responses from the state's nursing board to get our first cohort signed up at the brand-new campus. The strong, continued interest at the Indianapolis campus and now the strong early interest in Michigan shows that demand is present for our high-quality pre-licensure offerings and measured expansion should lead to the scale necessary for Hondros to return to strong profitability.\n\nFor the third quarter, we expect Hondros' enrollment to be 2,410 students, up 4% from the prior-year period. Finally, I would like to briefly mention that at graduate school, we continue to make progress in our effort to reposition and turn around that business and position it to be APEI's platform for career learning and workforce training. I would now like to turn our call over to Rick Sunderland to review our second quarter results and third quarter outlook in further detail.\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nThank you, Angie. Going on to Slide 8, second quarter 2022 financial results. On Slide 8, we present a summary of our financial results for the second quarter of 2022. Total revenue was approximately 150 million, up approximately 72 million, or 92% from the comparable prior-year period, due primarily to the addition of Rasmussen and graduate school revenue of 64 million and 4 million respectively in the 2022 period.\n\nAt APUS, revenue was approximately 70 million, an increase of approximately 3 million, or 4%, as compared to the prior-year period. The revenue increase was due to a 1% increase in total net course registrations in the second quarter of 2022 compared to 2021 and the timing of registrations in the quarter. Hondros revenue was 12 million, an increase of 400,000, or 3%, as compared to the prior-year period. This increase is in line with the year-over-year enrollment growth that Angie touched on earlier.\n\nSecond quarter cost of expenses included noncash impairment charge of 144.9 million to reduce the carrying value of RU segment goodwill and intangible assets, and to reflect the corresponding tax impact. The impairment charge was the result of our evaluation of Rasmussen's financial performance compared to plan and overall financial performance during the period, and also included recent enrollment trends, as well as industry and market conditions. To complete the fair value analysis, we engaged a third-party valuation firm to determine the fair value of Rasmussen. The independent valuation firm used two methods when determining the fair value of Rasmussen, equally weighted 50-50, the discounted cash flow method, and the guideline public company method.\n\nTherefore, the final valuation was impacted by both the financial performance of the business, as well as public company pricing multiples in the higher education space. Excluding the tax impact of $36 million, we estimate that roughly two-thirds of the impairment, or approximately $70 million is attributable to the discounted cash flow analysis, and the remaining one-third or approximately $36 million is attributable to market metrics. Excluding the noncash impairment charge for the quarter, total costs and expenses were approximately $146 million, an increase of approximately $70 million or 92% compared to the prior year. The year-over-year increase in expenses was due primarily to the inclusion of Rasmussen and graduate school results in the current year period.\n\nAdditionally, we estimate the impact of inflation to be approximately 5% of nursing faculty wages and student supplies or approximately $15 million during the quarter. Expenses for the quarter include approximately $2 million of noncash stock compensation expense, $400,000 of professional fees and integration costs primarily related to the integration of Rasmussen and graduate school, and approximately $8 million of depreciation and amortization, all on a pre-tax basis. On a consolidated basis, APEI adjusted EBITDA was $14.5 million for the current year quarter compared to approximately $9.9 million in the prior-year period. Net income per diluted share for the current quarter was a loss of $5.82, including the impairment charge, and a loss of $0.06, excluding the impairment charge, versus income of $0.03 in the prior-year period.\n\nTotal cash and cash equivalents at the end of the second quarter were approximately $185 million, an increase of approximately $35 million from year-end 2021. Restricted cash at June 30 was approximately $27 million and continues to be almost entirely comprised of a restricted certificate of deposit, that secures a letter of credit for Rasmussen with the Department of Education. Cash provided by operating activities was approximately $45 million in the first half of 2022 quarter -- first half of 2022 compared to approximately $9 million in the prior year period. The increase in cash flow from operations was primarily due to payments received from Army that totaled approximately $39 million in the first 2 quarters of 2022.\n\nAccounts receivable from Army were approximately $13 million at June 30 and approximately $7 million was older than 60 days from course start date. We have continued to work with Army to address the past due accounts receivable and have made significant progress. However, with the transition to the new ArmyIgnitED portal provider and related upgrade, we could see an increase in the accounts receivable due from Army and a decrease in cash flow in the second half of 2022. With the increased unrestricted cash at the end of the second quarter, APEI's net debt was just $11 million at the end of June.\n\nAdditionally, there were no borrowings under APEI's $20 million revolving credit facility, which remains fully available at this time. Looking ahead, we continue to evaluate uses of our increasing unrestricted cash balance, including the possible prepayment of debt. Going on to Slide 9, the third quarter 2022 outlook. APEI's outlook for the third quarter of 2022 is as follows: APUS total net course registrations are expected to be in the range of 0% to plus 5% year over year.\n\nAs a reminder, year-to-date net course registration growth has been driven by an increase in active-duty military registration growth, partly offset by declines in our veteran and other service-minded students. At Rasmussen and Hondros third quarter student enrollments are actual because of the quarterly starts at these schools. At Rasmussen, third quarter total nursing student enrollment decreased 8% year over year to approximately 7,700 students. Total nursing -- non-nursing total enrollment also declined 8% for an aggregate Rasmussen enrollment decline of approximately 8% year over year to approximately 15,000 students.\n\nAt Hondros, third quarter total student enrollment increased by 4% year over year to 2,410 students. In the third quarter of 2022, consolidated revenue is expected to increase between 48% to 51% year over year given the addition of Rasmussen and graduate school. As a reminder, there was one month of Rasmussen results included in the comparable third quarter of 2021. The company expects net income to be between a loss of $5.8 million and a loss of $4.5 million and earnings per diluted share of a loss between $0.31 and a loss of $0.24 per diluted share.\n\nAdjusted EBITDA is expected to be between $5.8 million and $7.7 million for the third quarter of 2022. Third quarter adjusted EBITDA is negatively impacted by nursing faculty wage inflation and separately the impact of the enrollment reduction at the Rasmussen Bloomington campus, the latter estimated to be approximately $1 million. With that, I'd like to turn the call back to Angie for final comments.\n\nAngie Selden -- Chief Executive Officer\n\nThank you, Rick. In summary, each of our leaders remain confident in APEI's strategic positioning as #1 serving active-duty military and veterans and No. 1 educating prelicensed nurses. While we also continue to transform and diversify APEI's portfolio of career learning assets and expand our mission of educating the service minded.\n\nIn the near term, the factors adversely impacting Rasmussen enrollments will subside. Nursing enrollments will continue to be impacted by the smaller prior quarter cohort enrollments for the next few quarters. However, as we continue to bring marketing back in-house at Rasmussen, we are seeing early indicators of success that we believe will translate to increased starts and ultimately increase enrollment, especially as we believe demand for nursing graduates is expected to remain strong for the foreseeable future, as employers are clamoring for new nurses to supply the national shortage. We believe we continue to be well positioned to fulfill these needs.\n\nKey leadership changes at APUS, APEI, and Rasmussen will help reinforce and accelerate the business on enrollment growth and momentum. And overall, APEI continues to be focused on higher education return on investments for our service-minded students, by keeping tuition rates in check and being one of the most transfer-credit friendly institutions. We now ask the operator to open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] We'll take our first question from Tobey Sommer with Truist Securities.\n\nJasper Bibb -- Truist Securities -- Analyst\n\nHey, good afternoon. This is Jasper Bibb on for Tobey. Just on the Rasmussen performance. I know you mentioned the ability to hire staffing enrollment, but how recently would you say the deterioration in performance has been there, and how much would you say is market factors versus, I guess, just Rasmussen's operations?\n\nAngie Selden -- Chief Executive Officer\n\nHi, it's Angie. I will be happy to answer that question. There have been episodic incidents over the last several quarters where Rasmussen began to cap enrollments in the Bloomington campus. It's the most -- I think, over was in this recent quarter, and consequently, that is the reason for what we're forecasting in terms of declines.\n\nI think that while we saw our own cap being imposed because of these faculty shortages, what we had been experiencing from the time of the close of the acquisition, was a degradation in the effectiveness of marketing from the third-party provider. And so, we remain very steadfast in our belief that moving that mission-critical revenue-generating function in-house, rather than adding that outsourced to a third-party provider, was absolutely necessary for us to build momentum and regain enrollment momentum at Rasmussen.\n\nJasper Bibb -- Truist Securities -- Analyst\n\nAnd then I guess looking at the third quarter guidance, does that assume negative adjusted EBITDA from both Hondros and Rasmussen, or how should we think about the profitability there at the segment level?\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nIt does, Jasper in both those BUs -- both those business units. But we're laying the foundation to reverse that enrollment trend, and it's the growth engine that will drive profitability in those units. The other thing to note is, we are in the midst of the start-up of the Michigan campus, which does have a negative impact on the Hondros' EBITDA for the period.\n\nJasper Bibb -- Truist Securities -- Analyst\n\nRight. So how should we think about, I guess, the timeline to get Rasmussen back to, I guess, breakeven or adjusted EBITDA profitability going forward?\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nRight. So as Angie indicated in her remarks, given the current plans in place, we're targeting to return to enrollment growth at Rasmussen in the second half of 2023. I think broadly speaking, the earnings of those units will track with the enrollment term, and then also, growth in enrollment there.\n\nAngie Selden -- Chief Executive Officer\n\nAnd just to put a finer point on that, Jasper, unlike APUS, I think we've tried to share this difference before. APUS has monthly starts and students buy courses [Inaudible]. So blips in consumption can be rectified more quickly than in either Hondros or Rasmussen, because Rasmussen has quarterly starts, as of Hondros. And in the case of the nursing programs, in particular, because there is a defined curriculum and students move through that curriculum in a cohort, if you impose a cap on a cohort at the beginning of an academic journey, you are basically living with that reduced enrollment in that cohort through the entire educational journey of those students until they graduate and complete.\n\nSo, when Rick is talking about returning to enrollment growth, he's not talking about nursing starts, he's talking about nursing -- are you talking about enrollment total? Because we now have imposed limits and now, we will live with that reduced cohort through the entire journey for those students to graduate. So hence, the reason why we are very pleased with the early results from bringing marketing in-house, because we can't -- the way for us to offset that is not -- we don't -- we can't insert students into those cohorts. That's not how that educational journey works. So what we need to do, is offset those imposed limits by accelerating the addition of new students in the quarter where those students are still -- those cohort students are still being educated.\n\nSo it is essential and critical that we control our destiny on marketing and enrollment momentum, by bringing that capability from the third-party back in-house.\n\nJasper Bibb -- Truist Securities -- Analyst\n\nOK. And as part of, I guess, the response to some of the inflationary pressures you've been seeing at Rasmussen and Hondros, are you evaluating tuition price increases for the nursing programs, or how are you thinking about that?\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nYeah, Jasper, it's Rick. Obviously, we look at all the levers we can pull and pricing is one of them. And that's a program-by-program and market-by-market analysis, but we do see that as an opportunity or maybe a necessity in a world where we're seeing wage inflation at the levels that we're seeing it.\n\nAngie Selden -- Chief Executive Officer\n\nAnd Rasmussen at the beginning of '22 did, in fact, selectively increase program pricing among several of its programs. So that was put into place earlier in the year, and we need to look at the programs that had not experienced an increase and evaluate that at this time.\n\nJasper Bibb -- Truist Securities -- Analyst\n\nLast question for me and then I'll get back in the queue. Can you just update us on where you think you would stand for the new 9010 regulations that were announced a couple of weeks ago?\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nYeah. Jasper, we've looked at that continuously since they've been talking about it. Across the EUs, there's really no challenge at RAS, it's in the kind of 77% range. Hondros is about 80%.\n\nIt would be APUS, which we've talked about when you add in the tuition assistance, which is active duty, and then VA. You can look at our concentration note in our financials. It's not an exact proxy because, as you know, 9010 is on a cash basis, and that's an accrual basis based upon primary care. But I think we've said in prior calls, we're about 87%, and we still track toward that number.\n\nSo, we would be under the 90% under the new rule, and we do look at that as being implemented with a measurement date starting in January of '23. So, we're very cognizant and focused on maintaining that 87% and reducing it through other activities and students that are not federally funded.\n\nJasper Bibb -- Truist Securities -- Analyst\n\nOK. Got it. Thanks for taking the question.\n\nOperator\n\nWe'll take our next question from Raj Sharma with B. Riley.\n\nRaj Sharma -- B. Riley Financial -- Analyst\n\nHello. Thank you for taking my questions. I wanted to touch upon Rasmussen. I think there's been a significant degradation since the acquisition wanted to understand and now, you have an impairment.\n\nI understand the impairment is a noncash charge and it's an accounting exercise, but it is a big piece of the original purchase price of $330 million. So I just wanted to understand, does it inherently accurately inflect the true intrinsic value Rasmussen? I mean, obviously, you've made statements that employers are clamoring for nurses and they will need nurses and you are going to fix the enrollment issue. I just wanted to thematically kind of understand do you see the impairment of accounting as a reflective of the intrinsic value of Rasmussen, or it will be overpaid?\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nSo Raj, it's Rick. We broke down the impairment between, let's call it, business performance elements and then market-based elements. It's a snapshot, but we remain very enthusiastic about the long-term elements of the business, right, the nursing and the supply demand and balance for nurses, that's unchanged. Obviously, it's impacted by things like our ability to hire faculty and the enrollment caps that we put in place in Bloomington.\n\nAnd obviously, we have to do those types of things. So that does impact the number. When you look at the business and you look at what's been going on since we bought it last fall, there are things that are happening. The delivery model is altered.\n\nI believe we've talked about this. There was a time during COVID, when much of the delivery was online, and then it went back on campus. We are experiencing higher costs. We talked about inflation and particularly nursing faculty wage inflation.\n\nAnd then the declining enrollment. That's a post-COVID phenomenon, and it's also a business-specific matter related to Bloomington, as the example. So it is a current snapshot, but I think long term, we all remain enthusiastic to -- that it's going to deliver on the promise of growth. We did talk about, Raj, in the call about how we're going to optimize our cost structure and address the cost side of the equation, right? So we are focused on enrollment and enrollment growth, and we're also focused on addressing some short-term cost needs.\n\nSo with that, I'll turn it to Angie, if she has any additional comments. Or Steve?\n\nSteve Somers -- Senior Vice President, and Chief Strategy and Corporate Development Officer\n\nHey, Raj, it's Steve. Just a couple more comments on that. Really to piggyback to Rick's point of view, we're playing a long game here with the Rasmussen acquisition, right? It was a unique asset with 20-plus campuses in a lot of important markets. Right now, there are some internal, but also market-driven challenges, and we'll be able to fix the internal ones.\n\nWe think there's a long-term positive secular trend, even if there are some minor cyclicality, whether it's due to COVID or other unemployment-related matters, as well as unemployment rates. So we're still very positive on kind of how that positions us as a business, and we also have opportunities as we think about aligning our business and providing a great service to students. We're in what we think is an enviable position, even though there are some short-term challenges.\n\nAngie Selden -- Chief Executive Officer\n\nAnd last point I would add, Raj, is we really look forward to bringing new leadership into Rasmussen, that will both focus on the important enrollment momentum for -- predominantly our pre-licensure nursing program, but also to make sure that we continue to anticipate our staffing needs so that we can operate with excellence. And so, we're looking for a leader who can balance both of those qualifications equally well, and we're really pleased with some of the early candidates that we've seen.\n\nRaj Sharma -- B. Riley Financial -- Analyst\n\nGot it. Got it. Thank you. Thank you for that answer.\n\nSo, would you say that while in the short term, there might be this impairment -- 40% impairment to the value that necessarily doesn't reflect the longer -- the medium term or the longer-term value of Rasmussen?\n\nAngie Selden -- Chief Executive Officer\n\nI certainly don't. I'll start, and Rick and Steve can weigh in. I think we ended up in a circumstance, which is what we call a perfect storm, where we've got the market comps of our sector trading at almost all-time lows. We had imposed, we thought, doing the right thing, imposing enrollment caps in order to make sure that we have the right faculty to student ratios in Bloomington to ensure that our students are getting great educational experiences.\n\nAnd at the same time, we had returned to an operating model of fully on campus-based operations, where we had enjoyed last year, much more of a blended online and on-ground operational experience, which changed the EBITDA profile. And so I think it's that perfect storm that all certainly happened in this period of time, basically prompted an accounting exercise, to evaluate the value of the acquisition we made. We don't, in any way, believe that this represents the long-term value of Rasmussen, and we will continue to remain enthusiastic about the supply demand gap that exists for prelicensure nursing in the United States, which is quoted between 200,000 and 400,000 each year on an annual basis for the next 10 years. And our ability to continue to grow and supply those pre-licensure nursing student graduates.\n\nSo, I think we, unfortunately, face this timing issue, and we are certainly seeing, as I mentioned, incredible momentum from a lead generation perspective. Now we've taken marketing and lead generation in-house and for the first time in, I believe, 10 years for Rasmussen.\n\nRaj Sharma -- B. Riley Financial -- Analyst\n\nGot it. Got it. Thank you. Thank you for that answer.\n\nSo that leads me to my second question, which is that when you're seeing these really good leads on the nursing side, when do they translate into starts and how soon will we find out that the up 40% leads are really generating good starts? Quarter out --\n\nAngie Selden -- Chief Executive Officer\n\nYeah. I think about 40% of the leads that we get in this period of time will translate into next quarter starts, and then the remainder will be in the next two quarters after that, predominantly. We still are working on all leads that we have, that are even more than a year old and always are building momentum from those leads as well. So this will be something that will benefit us over the next several quarters, [Inaudible] the upcoming quarter itself.\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nRaj, it's Rick. It's what Angie described earlier about the cohort-based system, which I know you understand and you've got to teach through those cohorts that were smaller. So the way to upend that, the way to reverse that is to have a large start. And so we're very focused, I think Angie's comments centered on.\n\nWe're very focused on a very large October start at Rasmussen. The incremental $3.8 million investment in marketing. We're investing in what we've done, what Jeff and his team did, to in-source those execution services. It's generating good lead flow, and then the teams at Rasmussen have to -- to your point, have to convert those leads into starts.\n\nAnd everyone is aware of the priority and the mission to get that done. So we're very focused on an October start that's going to set the path for ultimately total enrollment growth.\n\nRaj Sharma -- B. Riley Financial -- Analyst\n\nGot it. Thank you. And then on the new upcoming switch for the Army portal. You don't foresee -- I mean, you see this process as having been done a lot more -- in an organized way with the existing providers still in service.\n\nSo you don't foresee delays that you had experienced the last time? Do you see -- do you foresee this to be more a smoother process?\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nWe think the elements are in place, Raj, to make that happen, right? We don't know, but we are planning and working hard, to not experience the same challenges that we did last time. The points were made -- a known provider with a known system, an organization we have a relationship with, we're doing UAT testing. They're not going to drop the system on a day, they're going to run it in parallel. I'm concerned about the data transfer from 1.0 to 2.0, particularly as it relates to unprocessed tuition assistance requests, which translates into transactions that we invoice.\n\nBut those will be -- if there is a disruption there, that will be transitory, just like it was. Think about what we experienced with 1.0, our AR increased to $30 million, working with Army, working with the bases, we've been able to work that down to 12.5%. I think we said 13% in the call. So we'll work through that -- those challenges, but I think we will do so in a much better place than we were with the transition from GoArmyEd to ArmyIgnitED 1.\n\nSo --\n\nAngie Selden -- Chief Executive Officer\n\nIf I could just add one additional observation, Raj, which is in the 1.0 transition, we had no information. We received emails. We had no opportunity to communicate with the Army. We have worked very hard to build an open dialogue as an active partner and supporter of what the army is attempting to accomplish, and as a result, we have much more awareness, and we are grateful for the opportunity to be part of the UAT process, user acceptance test process, which is completely different than what we experienced last time.\n\nSo we believe we will be able to know early on what challenges we might face, but we are very, very grateful for the Army's willingness to partner with us this time around.\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nAnd it speaks to the Army's confidence in us as a partner to have us be part of the UAT process.\n\nRaj Sharma -- B. Riley Financial -- Analyst\n\nGreat. Great. Thank you for answering the questions. I'll take it offline.\n\nThanks.\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nThanks, Raj.\n\nOperator\n\nWe'll take our next question from Stephen Sheldon with William Blair.\n\nMatt Filek -- William Blair and Company -- Analyst\n\nHey, Angie and Rick, this is actually Matt Filek on for Stephen. Thank you for taking my questions. Seems like faculty shortages are the biggest headwind on the nursing side. And I was wondering if you are finding that it's starting to get somewhat easier to source nursing faculty to meet program demand.\n\nOr do you think that it will start to improve in the second half of the year? Any commentary there would be helpful.\n\nAngie Selden -- Chief Executive Officer\n\nSure, I'll start. Certainly, what we see is different levels of availability, specific to certain markets. You can see our most acute challenge has been in the Twin Cities market. The -- what we have instituted, as I mentioned, among the many remarks I made today, a model whereby we offer the schedule of available clinical -- these are primarily part-time faculty problems that we're having now full time.\n\nWe offer a schedule of available clinical position at a certain rate and people have the opportunity to get the kind of their first choice as their best choice. And then as the remaining positions remain unfilled, we start creating a more competitive price for those open positions, and we've seen really great success in getting all of our clinical positions filled. We were able to fill 100% of our clinical positions for this upcoming cohort. And so, we think that, that model of variablizing the rate for these different clinicals, creates a way for us to fill the schedule completely and also kind of maintain a cost structure to the best of our ability.\n\nMatt Filek -- William Blair and Company -- Analyst\n\nOK. That's helpful. And then just as a follow-up to that, given that the capacity for faculty is still somewhat constrained, how are you thinking about marketing spend for the nursing programs over the very near term?\n\nAngie Selden -- Chief Executive Officer\n\nMark, that's a great question. Marketing spend really is determined -- for the first time, what I would call bottoms up, right? When we had the -- this is Rasmussen specifically, when we were engaged with a third-party provider, the marketing spend was identified at a macro level top-down, and then the leads fell wherever the next best dollar spent could generate a lead, which was not all aligned with faculty availability, campus capacity, etc., clinical placement availability, etc. We have turned that upside down and are doing market-specific forecasting and capacity planning at each campus for each program so that we know that the constraints include what is the capacity at campus, what is the available clinical spots, and what is the faculty we have filling those clinical spots. And so now for the first time, we are being very directive about the way in which we're investing in marketing in the markets, where we have the ability to continue to enroll students and grow because we aren't facing those constraints.\n\nAnd that is what's driving our 40% increase in lead generation, because we've taken that function in-house under Jeff Tognola's leadership who joined us in January, and we have completely transformed the way we think about marketing. So we're very pleased with the complete transformation of what's going on, in terms of how we're doing our media spend and our marketing.\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nYeah. I would just add, Matt, we're investing, right? That's what Angie said. If you look at Rasmussen, it's not in the prior number, but if you look at marketing year over year, I believe through June, it's up about $2 million, and we're going to spend an incremental $3.8 million in the third quarter. We're investing for the reasons we said.\n\nHondros is a small company, but year over year, their advertising year to date is up about $400,000. So two different businesses, two different investment amounts, but consistently, we're investing in the nursing element of the business for all the reasons we've described.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRyan Koren -- Head of Investor Relations\n\nAngie Selden -- Chief Executive Officer\n\nRick Sunderland -- Executive Vice President and Chief Financial Officer\n\nJasper Bibb -- Truist Securities -- Analyst\n\nRaj Sharma -- B. Riley Financial -- Analyst\n\nSteve Somers -- Senior Vice President, and Chief Strategy and Corporate Development Officer\n\nMatt Filek -- William Blair and Company -- Analyst\n\nMore APEI analysis\n\nAll earnings call transcripts"
}