{
  "companyName": "Consolidated Water",
  "companyTicker": "CWCO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/consolidated-water-cwco-q2-2022-earnings-call-tran/",
  "content": "Consolidated Water (CWCO -2.47%)\nQ2 2022 Earnings Call\nAug 12, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning. Thank you for joining us today to discuss Consolidated Water Company's second quarter 2022 results. Hosting the call today is chief executive officer of Consolidated Water Company, Rick McTaggart; and the company's chief financial officer, David Sasnett. [Operator instructions] Before the call concludes today, I'll provide some important cautions regarding the forward-looking statements made by management during the call.\n\nI'd like to remind everyone today's call is being recorded and will be made available for telecom replay per the instructions in yesterday's press release, which is available in the Investor Relations section of the company's website. Now I'd like to turn the call over to Consolidated Water Company's CEO, Rick McTaggart. Sir, please go ahead.\n\nRick McTaggart -- Chief Financial Officer\n\nThank you, Nick, and good morning, everyone. Thanks for joining us today. As noted in our earnings release issued yesterday afternoon, we reported dramatically improved results for the second quarter of 2022 compared to last year. Our total revenue for the quarter increased by 26% to $21.1 million.\n\nThis contributed to the increase in our net income from continuing operations of -- to $2.7 million or $0.18 per share. Our retail segment revenue grew by 15% to $6.5 million, and this increase resulted from the significant easing of travel restrictions to the Cayman Islands for tourists and the reopening of large hotels and other vacation properties on the island earlier this year. And this drove increased water consumption by tourism industry-related businesses. Our bulk segment revenue increased by $1.7 million to $8.4 million and contributed operating income of $2.4 million.\n\nOur services segment revenue increased by $1.3 million to $5.1 million with this contributing operating income of $356,000. We are very encouraged by the trends that drove these results. Our manufacturing segment, however, continues to struggle with supply chain issues and the currently weak economic environment. But we are optimistic that this segment will report improved results in the latter half of this year based on our current contracted backlog.\n\nSo also during the quarter, we announced two major contract wins. In May, pursuant to a competitive bid process, we were awarded a contract by the Water Authority of the Cayman Islands to design and build a new 2.64 million gallon per day seawater desalination plant on Grand Cayman. Following the construction and sale of this plant to Water Authority, we will operate the plant and deliver the water produced to the Water Authority for 10 years. This contract is expected to generate more than $20 million in revenue over the life of the contract, with the majority of the revenue being recognized on the construction and sale of the plant, which is -- the plant is scheduled to be completed in the fourth quarter of 2023.\n\nWe commenced the permitting and design phase for this project during this past quarter. So things are moving along. In May -- also in May, our majority owned subsidiary, PERC Water Corporation, signed a contract with Liberty Utilities to construct and commission a 4 million gallon per day wastewater treatment facility in Goodyear, Arizona. The construction and commissioning revenue under this contract is expected to total approximately $82 million, with the facility expected to be operational by December 2023 and fully completed by the end of the second quarter of 2024.\n\nConstruction of this important project is already underway, and we will begin to generate significant revenue beginning next quarter. Now before I talk about our progress further and our outlook for the rest of the year, I'd like to turn the call over to David Sasnett, our CFO, who will take us through the financial details for the quarter.\n\nDavid Sasnett -- Chief Financial Officer\n\nThanks, Rick, and good morning, everyone. Thanks for joining us today. Yesterday, we issued our earnings release for the second quarter of 2022, which is available in the Investors section of our website. We reported that revenue totaled $21.1 million in the second quarter, which is an increase of 26% from the second quarter of 2021.\n\nThe growth reflects -- this growth reflects increases of $852,000 in our retail segment revenue, $1.7 million in our bulk segment revenue, $1.3 million for our services segment, and $510,000 in additional manufacturing segment revenue. As Rick mentioned, the increase in our retail revenue was due to the improvement in tourist activity in the Cayman Islands last quarter. This generated an 8% increase in the volume of water sold by our Cayman Water subsidiary. Our retail revenue also increased as a result of higher energy costs that increased the energy pass-through component of our water rates, as well as a more favorable rate mix.\n\nMuch of the increase in volume sales was to tourist-related properties and they pay a higher per gallon rate than our residential customers. The increase in bulk segment revenue is primarily attributable to an increase in energy costs for CW-Bahamas which -- and these energy costs increased the energy pass-through component of CW-Bahamas rates. The increase in our services segment revenue is attributable to increases in both plant design and construction revenue, as well as operating and maintenance revenue increase. I want to make it clear and point out to investors that our services segment revenue does not reflect any revenue from the two contracts we recently won, both on Grand Cayman and in Arizona, and investors should expect to see revenue from those two contracts begin to increase our services segment revenue next quarter.\n\nGross profit for the second quarter of 2022 was $7.5 million or approximately 36% of revenues. This compares to $6.1 million in gross profit in the same quarter of last year, which was also about 36% of revenues. Our net income from continuing operations attributable to Consolidated Water stockholders for the second quarter was $2.7 million, or $0.18 per basic and diluted share, and this compares to a net loss of $1.5 million, or $0.10 per share, for the second quarter of last year. Net income attributable to Consolidated Water stockholders for the period which includes the results of our discontinued operations, was $2.1 -- excuse me, $2.3 million or $0.15 per share.\n\nIn comparison, we reported a net loss of $1.7 million, or $0.11 per share, in the second quarter of last year. Now turning to our balance sheet. As we have previously disclosed, the liquidity of our Bahamas subsidiary has been adversely affected in prior months, really for an extended period of time by delinquent accounts receivables due from its sole customer, the Water & Sewage Corporation of the Bahamas. In February of this year, we received a payment schedule from the Bahamas government, according to which the government plans to reduce our CW-Bahamas delinquent accounts receivables over the course of 2022, with the intention of eventually bringing all of CW-Bahamas' receivables from the Water & Sewage Corporation to current status.\n\nUnder this plan, during the second quarter of this year, CW-Bahamas received approximately $16.4 million in payments toward its accounts receivable from the Water & Sewage Corporation of the Bahamas. These payments reduced CW-Bahamas' accounts receivables to $13.5 million as of June 30 of this year. We are pleased to report this dramatic improvement in our liquidity, and we greatly appreciate the Bahamas government's commitment to paying down these receivables well ahead of the dates they provided in their February payment schedule. This comes especially -- we're especially appreciative of their ability to do this given the adverse economic impact the pandemic has had on the Bahamas economy.\n\nAs of June 30 this year, our cash and cash equivalents totaled $49.1 million, our working capital was $71.6 million, our debt was less than $300,000 and our stockholders' equity totaled $159.4 million. Our projected liquidity requirements as of June 30 for the balance of this year include capital expenditures for our existing operations and plant construction of approximately $10.1 million. This $10.1 million includes $3.3 million to be incurred for the replacement of our West Bay seawater desalination plant on Grand Cayman and approximately $3.5 million for the construction of the Water Authority's new desalination plant under our recently awarded contract. In addition, about $1.3 million in dividends were paid in July 2022.\n\nAnd based upon our dividend history, we anticipate similar dividend payments in the fourth quarter this year. This completes our financial summary for the quarter. And I'd like to turn the call back over to Rick.\n\nRick McTaggart -- Chief Financial Officer\n\nThanks, David. Before I get into our outlook for the remainder of the year, I'd like to talk a little bit more about the progress we made across our business segments during the quarter. Our retail segment, which operates the water utility for the Seven Mile Beach and West Bay areas of Grand Cayman, under an exclusive license granted by the Cayman Islands government. While the license was not expressly extended after January 2018, we continue to supply water under the terms of this license.\n\nWe have continued our discussions with the regulator this year regarding the license and these negotiations are ongoing. We're very encouraged by the return of tourism to the Cayman Islands as the country's reopening plan continues. Air travel to the island has been steadily increasing since late last year when the government began welcoming back major U.S. airlines.\n\nCruise arrivals have also reportedly reached just over 60,000 passenger arrivals in May or about 60% of pre-pandemic numbers. A recent news article reported that the six months since the reopening of the country to tourists -- during the six months since the reopening of the country to tourists, the Cayman Islands attracted about 50% of the number of stay-over tourists that were visiting prior to the pandemic. And this aligns with the Cayman Islands Tourism Association's recent report that most big hotels are currently running around half capacity. This is, of course, a vast improvement over last year when the island had no business at all from tourists due to travel restrictions.\n\nAnd despite tourist arrivals to the islands being about half of -- half that of the pre-pandemic levels, we still saw our retail revenue increase 15% in the quarter. And as David mentioned, this was primarily due to an 8% increase in the volume of water sold. We believe we still have a long way to go before tourism returns fully to pre-pandemic levels in the Cayman Islands, but we have every reason to believe that this will just be a matter of time. Now looking at the Bahamas.\n\nObviously, we're very pleased to receive the $16.4 million in payments on our accounts receivable from the Water & Sewerage Corporation, and we remain very encouraged that the country will continue to return to pre-pandemic levels of economic activity. Looking at our U.S. businesses. As we've discussed for some time, we believe immediate action is needed to secure new drought-proof sources of fresh water in the water stressed areas of the United States, in particular, the Southwest U.S.\n\nand desalination and water recycling are increasingly being recognized as the best solutions to meet this need. We're currently pursuing some major wastewater recycling projects and in June, our bid for a multi-decade design-build-operate seawater desalination project in Hawaii was submitted, and we're currently awaiting the resolution of the Hawaii bidding process. This project in Hawaii is very comparable to the types of projects that we've been successfully completing in the Caribbean for many years. We believe our extensive experience in designing, building and operating these seawater desalination plants allowed us to be shortlisted to bid for this major project.\n\nWith the record high temperatures and record drought levels in the Western U.S., we anticipate a growing number of opportunities here in the United States. Just last week, it was reported that the United Nations warned that millions are at risk of major power and water shortages in the U.S., as two of our nation's largest reservoirs, Lake Mead and Lake Powell on the Colorado River are on the brink of dead pool status. Lake Mead, which stretches across Nevada and Arizona, has been known as the country's largest artificial body of water, however levels have gotten so low that NASA, which has been monitoring the lake from space, said this could be a sign of the worst drought in the region in more than 12 centuries. We believe desalination is key to alleviating global water scarcity and particularly in the arid Southwest United States.\n\nThese regions need to take immediate steps to diversify their shrinking water supplies by implementing drought-proof resources like desalination and not just seawater desalination, but brackish groundwater desalination. There's plenty of opportunities in Arizona for those types of projects. They also need to do more to recycle existing water supplies, which aligns perfectly with the capabilities and experience of our PERC Water subsidiary. Based in Southern California, PERC builds, operates and maintains advanced water treatment and reuse facilities across the Southwest, facilities which have received awards for their innovative designs.\n\nAs mentioned earlier, in May, PERC was contracted to design, construct and commission a 4 million gallon per day wastewater treatment facility with Liberty Utilities. We believe that we are able to obtain this project from Liberty because of our unique project delivery model, which enables us to design, construct and commission this type of project on an accelerated schedule and at a lower overall cost than traditional project delivery models. Additionally, our clients only have to deal with one responsible party for all aspects of the project including cost, schedule and plant performance. Based on PERC's overall increased activity that reflects strengthening market demand, we believe PERC is well-positioned for further growth in the coming months and years.\n\nOur -- as we mentioned, our manufacturing segment continue to deal with the challenges of current economic conditions and several projects originally scheduled for completion by the end of the second quarter have been further delayed either at the customer's request or because of difficulties obtaining materials and equipment. However, based on current contracted backlog, we expect to complete several projects in the second half of this year and expect our manufacturing results to improve over the course of the rest of 2022 and into 2023. Additionally, our integrated sales team is generating leads and potential sales orders for our manufacturing segment with new clients and new markets such as industrial and mining projects. Now I'd like to update you briefly on developments regarding the canceled Playas de Rosarito desalination plant in Mexico.\n\nSo further to recent public statements by representatives of the Baja, California government, I can confirm that we are in discussions with the state to potentially resolve the issues related to their cancelation of the Rosarito plant contract in June of 2020, as well as potentially addressing the state's acute water shortage issues. I'd also like to clarify that we have agreed to delay the appointment of arbitrators while these discussions are in process, but the arbitration has not been suspended. Consolidated Water has been designing, building and operating seawater desalination plants for over 50 years. We believe our commitment to delivering safe, reliable and affordable desalinated water to cities and countries in need is unmatched in the industry.\n\nWe hope that our ongoing discussions with Mexico will result in a positive solution for both parties. So looking ahead, we see many positive factors driving continued growth in 2022. In addition to the anticipated diminishing impact of the pandemic and the increased return of tourism in Grand Cayman, we're also seeing increased project bidding activity in the United States and in the Caribbean. We see these trends representing potential major catalysts for growth in the remainder of this year and beyond.\n\nSo Nick, I'd like to open the call up for questions now.\n\nOperator\n\nThank you. [Operator instructions] First question will come from John Bair, Ascend Wealth Advisors. Please go ahead.\n\nJohn Bair -- Ascend Wealth Advisors -- Analyst\n\nGood morning, gentlemen. Congratulations on the wins this quarter. David mentioned about maintaining the dividend rate, but given that you've had a significant drop in accounts receivable from the Bahamas and balance sheet is really in great shape, just wondering what your thought process in that, capital perhaps being applied toward M&A? Just curious about that.\n\nDavid Sasnett -- Chief Financial Officer\n\nWell, John, let me caution you. I didn't guarantee that we're going to pay a dividend going forward. But our board has always approved the dividend. So I'm not aware of any reason why they wouldn't approve going forward, but always it's their decision, not management's.\n\nLook, when you look at our balance sheet, we have $49 million in cash at the moment. But if you look at our dividend payout ratio relative to earnings, I think it's relatively high. We have, what we believe to be, an increasing demand for our capital. Some of these larger projects on which we're bidding, they require a certain amount of bonding capacity for us, which goes back to our borrowing capacity.\n\nSo I don't think -- given that our business is, I think, poised for a lot of growth, we're not in a position really to have excess cash to pay dividends. Me personally, I don't believe that any time soon. However, if we were to see the substantial windfall, let's say, if something happened positively for Mexico, we'd certainly look at and maybe paying a special dividend or increasing the dividend. But I think right now, we have enough in potential new business and enough capital required for that new business that we really need to focus on allocating capital for that purpose and not increasing our dividend.\n\nThat's just my personal opinion.\n\nJohn Bair -- Ascend Wealth Advisors -- Analyst\n\nSure. Fair enough. Just curious what the thought process was there. Thanks very much, and congrats, again, and look forward to the next quarter.\n\nRick McTaggart -- Chief Financial Officer\n\nThanks, John.\n\nOperator\n\n[Operator instructions] Next up for the question will be from Steve Percoco, Lark Research. Please go ahead.\n\nSteve Percoco -- Lark Research -- Analyst\n\nThank you. First of all, on the two projects, the Cayman's water plant and the Liberty Utilities Arizona wastewater project. I presume you're going to account for those as on a percentage of completion basis, so you'll be accruing the cost of that over time until completion. Is that correct?\n\nDavid Sasnett -- Chief Financial Officer\n\nWell, it's actually not called percentage of completion anymore, but you're right. Under the inputs method, as we incur costs on the project, we'll be recognizing revenue. And based upon estimated profit for the project, we'll be recognizing a portion of that profit as we incur the cost on both of these projects. So yes, you should see -- go ahead.\n\nSteve Percoco -- Lark Research -- Analyst\n\nAnd will you be receiving progress payments from the entities? Or are you -- do you -- is payment delayed until the project is complete?\n\nDavid Sasnett -- Chief Financial Officer\n\nSo with respect to the Arizona project, we do receive project progress payments and we bill as the work proceeds. 10% of our -- of the actual billing is retained. The contract has a 10% retaining factor. So at the end, if all goes according to schedule, at the end of the project, we would have billed all but about $8 million -- we would have billed all of the project and collected all, but about $8 million.\n\nAnd I think the retainage stays in place for six months just to ensure proper operation of the plant. With respect to the Cayman Islands project, we will not be paid until the project is complete. So we will end up carrying a pretty large asset on our books as construction proceeds. And then I think, Rick, you can correct me if I'm wrong, but I think we're due payment within a few months.\n\nRick McTaggart -- Chief Financial Officer\n\nWe get 90% on completion, and then we get another 10%. I think it's after six months or a year, but I'll have to check back.\n\nDavid Sasnett -- Chief Financial Officer\n\nYeah. But you will see a significant -- you'll see significant assets -- contract assets and contract liabilities on our balance sheet for both of these projects as we proceed. But the billings for the Arizona project are pretty much consistent with the incurrence of cost. So that shouldn't be a huge drain on our working capital.\n\nSteve Percoco -- Lark Research -- Analyst\n\nOK. And then on the Mexico project, I've been reading, I'm sure, with other people about the drought conditions in Mexico that have gotten really dire. And so when you say you're talking to them about resolving their water problems, it sounds like they've decided that they've got to move forward with some kind of desalination solution. I guess the question is, and I know you can't give away your negotiation -- your negotiating position or whatever.\n\nBut if they -- could they conceivably resurrect the project in a way that brings you back in? Or is that -- if you can say it, is that something that you would entertain at this point? And maybe you should remind us why they canceled the project originally in 2020.\n\nRick McTaggart -- Chief Financial Officer\n\nYeah. I mean it's very early in the negotiations to make any sort of statements along those lines. I think the key points are that they do need water desperately there, and we'd like to get our money back from this canceled project. So we're in the process of talking to the state.\n\nThat's pretty much all I can say at this point. I mean there's no particular direction that this is going from the standpoint of where we build another plant or they're going to reinstate the contract. I mean we haven't gotten to those points yet in the discussions. So we're just looking at a way to -- we're both trying to amicably resolve the dispute besides going to a lengthy arbitration process.\n\nSo that's where we're at.\n\nSteve Percoco -- Lark Research -- Analyst\n\nOK. And I know -- I mean your disclosure suggests it's a little hard for me to figure out. I haven't read it clearly, that you transferred some of the equity in the project at one point, but then maybe you got it back. I'm not sure.\n\nDo you own the project or the entities that have the rights to the project at this point in time?\n\nDavid Sasnett -- Chief Financial Officer\n\nSo very early on, we had a partner, a 50% partner. This is many years ago when we first started the project. Eventually, we bought out all but about 1% of the equity interest in that project. So we own all rights to the project and all rights to the permits and the land and all the other expenditures that were made for the project.\n\nRick McTaggart -- Chief Financial Officer\n\nThere's no other equity partner. And in fact, there's an outside interest. It's just a fraction of a percent in one of the companies.\n\nSteve Percoco -- Lark Research -- Analyst\n\nOK. That's all I have. Thank you very much.\n\nRick McTaggart -- Chief Financial Officer\n\nSure.\n\nOperator\n\n[Operator instructions] Next question will be from Philippe Auclaire, P.J. Auclaire & Associates. Please go ahead.\n\nPhilippe Auclaire -- Auclaire and Associates -- Analyst\n\nYeah. Hello. Thanks for taking my call. I just wanted to -- I didn't hear anybody mention -- it seems to me I heard yesterday or saw yesterday a news release that the Governor of California was proposing a significant initiative to try to resolve the water problems in that state.\n\nAnd of course, with PERC's presence in California and I know I heard the word desalination mentioned in his press release. Do you -- does anybody -- are you guys aware of that? Or you're pretty excited about the possibility that there might be some significant opportunities on the table?\n\nRick McTaggart -- Chief Financial Officer\n\nYeah. I mean, honestly, there's a lot of mixed signals coming from California on seawater desalination. I mean I heard the same sort of thing, and I heard that they blocked some funds from the state budget to support desalination initiative. On the other hand, I mean, if you look at the industry reports, I mean there was a big project in California that recently just got canned.\n\nSo the developer had been assigned and they've been working on that for, I mean, 10-plus years. So I don't really know what they want to do with desalination there. However, we see the potential on the waste recycling side, and that's why we invested in PERC a couple of years ago. That's not a very controversial process and a lot of municipalities are now designing and going to bid for advanced wastewater treatment plants that would produce recycled water.\n\nSo if you want the easier path for business, I mean you want to follow that one. The desalination opportunities in California, to me, are still a bit unclear.\n\nPhilippe Auclaire -- Auclaire and Associates -- Analyst\n\nThanks.\n\nOperator\n\nThank you. This concludes our question-and-answer session. I'd like to turn the call back over to Mr. McTaggart.\n\nSir, please go ahead.\n\nRick McTaggart -- Chief Financial Officer\n\nThanks, Nick, and I appreciate everybody calling in today. Great questions, and we look forward to speaking with you again in November, I guess, for the third quarter results. Take care. Bye-bye.\n\nOperator\n\nThank you. Ladies and gentlemen, before we conclude today's call, I'd like to provide the company's safe harbor statement includes cautions regarding forward-looking statements made during the call. The information that we have provided in this conference call includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, but not limited to, statements regarding the company's future revenues, future plans, objectives, expectations and events, assumptions and estimates. Forward-looking statements can be identified by the use of words or phrases usually containing the words believe, estimate, project, intend, expect, should, will or similar expressions.\n\nStatements that are not historical facts are based on the company's current expectations, beliefs, assumptions, estimates, forecasts and projections for its business and industries and markets related to its business. Any forward-looking statement made during this conference call are not guarantees of future performance, involve certain risks, uncertainties and assumptions, which are difficult to project. Actual outcomes and results may differ materially from what is expressed in such forward-looking statements. Factors that would cause or contribute to such difference include, but are not limited to, tourism and weather conditions in areas we serve; the impacts of COVID-19 pandemic, particularly on our retail and manufacturing segments; the economic, political and social conditions of each country in which we conduct or plan to conduct business; our relationship with the government entities and other customers we serve; regulatory matters, including resolution of negotiations for the renewal of our retail license in Grand Canyon -- excuse me, Grand Cayman; our ability to successfully enter new markets and other various risks, as detailed in the company's periodic report filings with the Securities and Exchange system.\n\nFor more information about risks and uncertainties associated with the company's business, please refer to the management's discussions of analysts or financial divisions or results of operations in Risk Factors sections of the company's SEC filings, including, but not limited to, its annual report on the Form 10-K and quarterly reports for Form 10-Q. Any forward-looking statements made during the conference call speak as of today's date. The company expressly disclaims any obligations or undertaking to update or revise any forward-looking statements made during the conference call to reflect any changes in its expectations with regard thereto or any changes in its events, conditions or circumstances of which any forward-looking statement is based, except upon required by law. Before today's conference call ends, I now would like to remind everyone that this call will be available for replay starting later this evening.\n\nPlease refer to yesterday's earnings release for dial-in replay instructions available via the company's website at www.cwco.com.[Operator signoff]\n\nDuration: 0 minutes\n\nRick McTaggart -- Chief Financial Officer\n\nDavid Sasnett -- Chief Financial Officer\n\nJohn Bair -- Ascend Wealth Advisors -- Analyst\n\nSteve Percoco -- Lark Research -- Analyst\n\nPhilippe Auclaire -- Auclaire and Associates -- Analyst\n\nMore CWCO analysis\n\nAll earnings call transcripts"
}