{
  "companyName": "Yatsen Holding Limited",
  "companyTicker": "YSG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/yatsen-holding-limited-ysg-q2-2022-earnings-call-t/",
  "content": "Yatsen Holding Limited (YSG 6.57%)\nQ2 2022 Earnings Call\nAug 25, 2022, 7:30 a.m. ET\n\nOperator\n\nLadies and gentlemen, good day, and welcome to the Yatsen second quarter 2022 earnings conference call. [Operator instructions] At this time, I would like to turn the conference over to Irene Lyu, head of strategic investments and capital markets. Please go ahead.\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nThank you, operator. Please note that the discussion today will contain forward-looking statements relating to the company's future performance and are intended to qualify for the safe harbor from liability as established by the U.S. Private Securities Litigation Reform Act. Such statements are not guarantees of future performance and are subject to certain risks and uncertainties, assumptions, and other factors.\n\nSome of these risks are beyond the company's control and could cost actual results to differ materially from those mentioned in today's press release and this discussion. A general discussion of the risk factors that could affect Yatsen's business and financial results is included in certain filing of the company with the Securities and Exchange Commission. The company does not undertake any obligation to update this forward-looking information, except as required by law. Today's call management will also discuss certain non-GAAP financial measures for comparison purposes only.\n\nPlease see the earnings release issued earlier today for a definition of non-GAAP financial measures and a reconciliation of GAAP to non-GAAP financial results. Joining us today on the call from Yatsen's senior management team are Mr. Jinfeng Huang, our founder, chairman, and CEO; and Mr. Donghao Yang, our CFO and director.\n\nManagement will begin with prepared remarks, and the call will continue with a Q&A session. As a reminder, this conference is being recorded. In addition, a webcast replay of this conference call will be available on Yatsen's investor relations website at ir.yatsenglobal.com. I'll now turn the call over to Mr.\n\nJingfeng Huang. Please go ahead, David.\n\nJingfeng Huang -- Founder, Chairman, and Chief Executive Officer\n\nThank you, Irene. And thank you, everyone, for participating in Yatsen's second quarter 2022 earnings conference call today. At the start of the year, we embark our next five years development journey with a simple focus on building strong brands and world-class R&D capabilities while achieving sustainable growth. In the second quarter, we entered into a turbulent stretch of this journey where a confluence of challenges has put our strategies and execution to the test.\n\nThe main challenge was widespread COVID-19 recurrences, which shut down numerous cities in China between April and June. According to the latest data from the China National Bureau of Statistics, beauty retail spending was down by 22.3% and 11% in April and May, respectively, before slightly recovering in June. This is proportionate to the impact of offline retail spending nationwide, including our offline stores. In the online arena, competition intensified as our competitors engaged in aggressive promotions to drive sales amid a sluggish market demand for color cosmetics.\n\nThe premium skincare category, on the other hand, proved to be highly resilient and, in fact, grew during the second quarter. Against this backdrop, our total net revenue increased by 37.6% year over year to RMB 951.8 million, beating the high end of our revenue guidance. The year-over-year decline in revenues was mainly due to softer performance of our color cosmetics brands, partially offset by stellar growth across our skincare brands. Our non-GAAP net loss margin reached 20.8% in the second quarter, an increase of nine percentage points compared with the prior year-period, attributable to the higher operating cost to ratios of our offline stores into weak offline store sales, as well as inventory loss and the provisions for store closures.\n\nEncouragingly, our quarterly net cash generated from operating activities turned positive for the first time since Yatsen's IPO at RMB 111.9 million compared to an outflow of RMB 79 million for the prior-year period due to our disciplined working capital management practices. While our overall strategy goals remain unchanged, these results demonstrated our ability to accelerate the optimization of our revenue mix and cut cost in response to the evolving market environment in the second quarter. Let's look at our revenue mix in greater detail. Net revenues from our skincare brands grew by 49.2% year over year, representing 33.4% of total net revenues for the second quarter compared with 14% for the prior-year period.\n\nTotal net revenues from DR. WU, Eve Lom, and Galenic, collectively achieved year-over-year growth of 112%, supported by growing brand recognition, strong hero product, and a successful ramp-up across multiple e-commerce channels. Our skincare brands also exhibited superior gross margin and net profitability levels compared to our color cosmetic brand and proved highly resilient during this period of economy uncertainty in China. Notably, DR.\n\nWU became the largest and most profitable skincare brand in our portfolio driven by stellar performance of the classic Mandelic acid series, which topped the anti-acne serum chart on Tmall during the June 18th shopping festival. Furthermore, DR. WU sales, through Douyin livestreaming, grew by more than eight times compared to the prior-year period. And the new Triple Action Repair Serum became the top-selling skin repair serum on Douyin during the June 18th shopping festival.\n\nEve Lom ranked No. 1 on Tmall during the June 18th shopping festival in the premium makeup remover category. On the branding side, following a well-received brand relaunch media campaign in late April, Eve Lom hosted a number of live events in London's Covent Garden and in New York's SoHo district to provide an immersive offline experiential touch point for our customers. In May, Eve Lom launched a new foaming cream cleanser, which improves upon traditional cleansers with an enzyme-infused surface active formula, representing our latest effort to expand Eve Lom into mainstream skincare categories beyond its roots in makeup removal.\n\nLast but not least, Galenic continued to demonstrate to robust growth on the strength of its core Vitamin C serum series. During the second quarter, Galenic launched the Secret D'Excellence Snow Algae anti-aging serum and a summer limited addition gift set for the vitamin C series, accompanied by branding campaigns featuring the Chinese women's cohort of short-distance speed skating gold medalist, Gao Tingyu; award-winning female surfer, Monica Guo; and female freediving champion, [Inaudible]. As you can see, our skincare business is growing from strength to strength, a testament to our ability to translate our accumulated experience and know-how from color cosmetics into success in the field of luxury and premium skincare. We have fostered a truly global team to organically develop and grow our skincare brands.\n\nOur open lab system and our R&D teams are also building the capability to develop a strong pipeline of new products to support the growth of our clinical and skincare brands. Notable R&D breakthroughs during the quarter included the successful launch of the triple-action serum for DR. WU and the anti-aging snow algae serum for Galenic, which featured active ingredients and the formulations developed with significant contribution from our R&D lab. The triple-action serum, for example, was developed in partnership with the Huazhong University of Science and Technology and both nano-targeting technology enabling the precise release of active ingredients directed to anti-acne inflammation spots deep under the skin layers for an increase in efficacy compared with higher product series.\n\nThe anti-aging snow algae serum featured our work with botanicals, combining a high concentration of exclusive snow algae originating from Swedish permafrost regions with Yatsen's blend of hexapeptide to achieve higher efficacy in anti-wrinkle and anti-aging applications. The successful launch and commercialization of these products shows that our R&D teams can develop a new product that suit the need of our growing brand portfolio in the expenditures in effective manner. Our color cosmetic brands, on the other hand, saw a 50.5% decline in total net revenues, led by a slowdown in our Perfect Diary and Little Ondine brands. Perfect Diary launched several new products in the second quarter, such as the Raw Gemstone eyeshadow, lipstick and blush services, as well as the newly released CRUSH collection and the Love Confession lipstick gift set collection for the May 20 Chinese Valentine's Day campaign.\n\nThis new product launch were impacted by the clinical downturn in consumer color cosmetics spendings, as well as intense market competition among the mass segment. The resurgency of COVID-19 also adversely impacted Perfect Diary offline store sales and profitability, levitating an acceleration of our store optimization plans. As of June 30, 2022, we operated a total of 228 Perfect Diary stores, a net reduction of 58 stores since the beginning of this year. Given the worsening retail environment in China, we plan to close additional underperforming stores in the second half of 2022.\n\nWe will continue to monitor the offline retail environment on an ongoing basis to determine if further store closures are needed. We are also exploring other ways to serve our offline stores customers' profitability. Both Pink Bear and the Little Ondine, for example, expanded their distribution with [Inaudible] Group to more than 300 [Inaudible] and colorist stores across the nation in the second quarter, which generated additional incremental revenue and the profits for the two brands. Going forward, we will look to replicate this success and further expand collaboration with other distribution partners.\n\nDue largely to the elevated levels of promotions during the June 18 period, particularly for the color cosmetics, our overall gross margin declined to 62.9%, a decrease of 2.9 percentage points compared with the prior-year period. Our gross margin was also impacted by an inventory loss of RMB 43.9 million, representing 4.6% of total net revenue. Now, let's have a look at our costs. By far, the largest piece of our operating expenses was our selling and marketing expenses, totaling RMB 602.5 million for the second quarter on a non-GAAP basis, which decreased by 35.7% year over year, the same rate as our revenue reduction.\n\nHowever, as a percentage of total net revenue, our non-GAAP selling and marketing expenses remain elevated at 53.3% for the second quarter compared with 51.4% for the prior-year period, attributable to higher operating cost ratios of our offline stores, certain store closure-related expenses, and the provision of RMB 28.7 million for further store closures in the second half of 2022. This store closure provision represents 3% of our total net revenues. Our elevated store-related expenses offset the effect from the reduction of our performance-based marketing expenses, which declined substantially as a percentage of total net revenue in the second quarter. Our non-GAAP general and administrative expenses recorded a net reduction of RMB 18.7 million compared with the prior-year period.\n\nThough as a percentage of total net revenues, they increased by 3.5 percentage points to 12.6% due to the deleveraging effect from the reduction in our revenues. In addition to optimizing our fixed expenses, we have further changed our total head count in the second quarter. Our fulfillment expenses remained flat as a percentage of total net revenues, despite operational disruptions stemming from COVID-19. Overall, our non-GAAP net loss margin of 21.8% reflects exceptionally challenging external environment in the second quarter, as well as the numerous initiatives we took to adjust our business, with inventory loss and the store closure provisions totaling 7.6% of total net revenues.\n\nAs we look back at our second quarter, we see it as another chapter in our five-year development journey, attributable from which a stronger and more resilient Yatsen will emerge. We generated a net cash inflow from operations of RMB 111.9 million, the first positive quarterly net cash flow recorded since our IPO, and ended the second quarter with RMB 3.06 billion of cash and short-term investments. While we expect the external environment to remain challenging in the near-term, we have ample financial flexibility to meet our strategic objectives and continue our journey of evolution. With that, I will now turn the call over to our CFO, Donghao Yang, to discuss our financial performance.\n\nThank you, everyone.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nThank you, David, and hello, everyone. Before I get started, I would like to clarify that all financial numbers presented today are in renminbi amounts, and all percentage changes refer to year-over-year changes unless otherwise noted. Total net revenues for the second quarter of 2022 decreased by 37.6% to RMB 951.8 million from RMB 1.53 billion in the prior-year period. The decrease was primarily attributable to 50.5% decline in net revenues from our color cosmetics brands, partially offset by a 49.2% increase in net revenues from our skincare brands.\n\nGross profit for the second quarter of 2022 decreased by 40.3% to RMB 598.3 million from RMB 1 billion in the prior year period. Gross margin for the second quarter of 2022 decreased to 62.9% from 65.7% in the prior-year period. The decrease was primarily attributable to elevated levels of promotions during the June 18 shopping festival and an inventory loss of RMB 43.9 million. Total operating expenses for the second quarter of 2022 decreased by 38% to RMB 875.3 million from RMB 1.41 billion in the prior-year period.\n\nAs a percentage of total net revenues, total operating expenses for the second quarter of 2022 were 92% as compared with 92.6% in the prior-year period. Fulfillment expenses for the second quarter of 2022 were RMB 69.7 million as compared with RMB 118.1 million in the prior-year period. As a percentage of total net revenue, fulfillment expenses for the second quarter of 2022 decreased to 7.3% from 7.7% in the prior-year period. The decrease was primarily attributable to a reduction in share-based compensation corresponding to a decrease in fulfillment headcount.\n\nSelling and marketing expenses for the second quarter of 2022 were RMB 625.7 million as compared with RMB 972.5 million in the prior-year period. As a percentage of total net revenues, selling and marketing expenses for the second quarter of 2022 increased to 65.7% from 63.8% in the prior-year period. The increase was primarily attributable to higher operating cost ratios of our offline stores corresponding to our depressed offline store sales, as well as store closure-related expenses and the provision of RMB 28.7 million for further store closure in the second half of 2022, partially offset by a reduction of our performance-based and brand marketing spending. General and administrative expenses for the second quarter of 2022 were RMB 147.8 million as compared with RMB 286.4 million in the prior-year period.\n\nAs a percentage of total net revenue, general and administrative expenses for the second quarter of 2022 decreased to 15.5% from 18.8% in the prior-year period. The decrease was primarily attributable to a reduction in share-based compensation corresponding to a decrease in general and administrative headcount. Research and development expenses for the second quarter of 2022 were RMB 32 million as compared with RMB 35.2 million in the prior-year period. As a percentage of total net revenues, research and development expenses for the second quarter of 2022 increased to 3.4% from 2.3% in the prior-year period.\n\nThe increase was primarily attributable to the deleveraging effect of lower total net revenues. Loss from operations for the second quarter of 2022 decreased by 32.4% to RMB 277 million from RMB 409.9 million in the prior-year period. Operating loss margin was 29.1% as compared with 26.9% in the prior-year period. Non-GAAP loss from operations for the second quarter of 2022 increased by 3.2% to RMB 218.2 million, from RMB 211.4 million in the prior-year period.\n\nNon-GAAP operating loss margin was 22.9% as compared with 13.9% in the prior-year period. Net loss for the second quarter of 2022 decreased by 32.4% to RMB 264.3 million from RMB 391.2 million in the prior-year period. Net loss margin was 27.8% as compared with 25.7% in the prior-year period. Net loss attributable to Yatsen's ordinary shareholders per diluted ADS for the second quarter of 2022 was RMB 0.43 as compared with RMB 0.62 in the prior-year period.\n\nNon-GAAP net loss for the second quarter of 2022 increased by 6.5% to RMB 207.5 million from RMB 194.9 million in the prior-year period. Non-GAAP net loss margin was 21.8% as compared with 12.8% in the prior-year period. Non-GAAP net loss attributable to Yatsen's ordinary shareholders per diluted ADS for the second quarter of 2022 was RMB 0.34 as compared with RMB 0.31 in the prior-year period. As of June 30, 2022, the company had cash, restricted cash and the short-term investments of RMB 3.06 billion as compared with RMB 3.14 billion as of December 31, 2021.\n\nNet cash generated from operating activities for the second quarter of 2022 increased by 241.6% to RMB 111.9 million from net cash used in operating activities of RMB 79 million in the prior-year period. For the third quarter of 2022, the company expects its total net revenues to be deploying RMB 738.4 million and RMB 872.7 million, representing a year-over-year decline of approximately 35% to 45%, primarily due to the continued softness in market demand for our color cosmetics. These forecasts reflect the company's current and preliminary views on the market and operational conditions, which are subject to change. With that, I would now like to open the call to Q&A.\n\nOperator?\n\nOperator\n\n[Operator instructions] Today's first question comes from Dustin Wei of Morgan Stanley. Please go ahead.\n\nDustin Wei -- Morgan Stanley -- Analyst\n\nThanks a lot for taking my questions. The first question, I want to start with the guidance. The third quarter guidance in terms of the revenue, the decline magnitude, is quite similar to the second quarter. But considering, I think, the COVID situation probably is, you know, worse is over, and I think the base will be also lower into the second half and the third quarter.\n\nSo, you know, I understand that, Donghao talk about the softness in color cosmetics, was just wondering if there's more information behind this guidance? And maybe, you know, management could share some of the near-term trend in the quarter today, and, you know, maybe by channel or by products or by category. You know, what kind of softness, you know, that we are talking about? And second question regarding the GP margin. So, I think this is probably the second quarter that we have this inventory loss or the inventory provision, so I'm not sure if we have this number to share regarding the inventory age structure. Like, how much sort of a little bit aging inventory that we're still seeing that can potentially still be written off in the coming quarters? And also regarding GP margin, I think it's encouraging to see the revenue contribution from the skincare is increasing.\n\nAnd so, I think it's probably on the direction to reach to almost like half of the business coming from skincare. So, how should we in longer term or maybe next year or so, think about the GP margin for the company? Thank you.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nAll right. Thanks for the question. First on guidance. Wei, the overall cosmetics market in China has experienced a very sharp decline starting from the -- at beginning of this year.\n\nWell, some of that actually was related to macro economy, the global situation, and some of that also, you know, was due to the COVID-19 situation, especially, you know, in Shanghai and areas around Shanghai. Even today, you may also know that, you know, in a lot of the areas, regions in China, the COVID-19 situation is still very serious. For example, today, I think in some of the Northwest and Southwest provinces in China, you know, people are still restricted from traveling due to the, you know, resurgence of the COVID-19, you know, pandemic. So, that's about the overall market softness that we have experienced this year.\n\nAnd if you compare our Q3 guidance versus Q2, and you have mentioned, our Q3 guidance is very similar to the level of Q2. Actually, to us, we view that as a very positive signal. That means the business has stabilized from the trend of a sharp decline starting from, you know, the beginning of this year. And so that's one thing.\n\nOur overall business is stabilizing. And also, the softness of our color cosmetics business, you know, is, to some extent, offset by our strong growth in skincare. So, that's why we are giving this guidance level similar to that of Q2. And you talked about our GP margin and aging of the inventory.\n\nWe are not providing that kind of the details for our inventory, but we can tell you -- what we can tell you is we made a provision of RMB 44 million for obsolete inventory in Q2, which is quite a substantial number. And, you know, we do have a provision policy as part of our overall accounting policy. And going forward, we will continue to make provisions as required by our policy. David, Irene, do you have anything else to add?\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nYeah. Sure. So, yes, on the guidance, basically, I think it's -- we are providing this based on our estimation on both the external and internal factors. And then we have to look at it by different product category, right? For example, on the color cosmetics side, Donghao has mentioned external environment with the resurgence of the COVID, which continues to impact consumer confidence, and also the unemployment rate among the young generation these days are also impacted by the COVID situation, which those people are our core customers.\n\nSo, that continues to impact the color cosmetic market, which we could also see in the July beauty -- overall, China beauty retail spending is still negative growth year over year. That's on the external side for color. And internally, as we are still going through our strategic evolution, we are still really focusing on high-quality revenue for those color cosmetics brands. So, right now, because of this refining of our business model, we could still see a decline in the color cosmetics segment of our business.\n\nAnd on the skincare side, we had a very strong growth in Q2. And for skincare, because it's highly seasonal, right. Normally, Q2 and Q4 are the major season for skincare because consumers tend to stock up during large promotions. So, for Q3, we think we continue, we will see growth in skincare.\n\nBut given it's kind of a quiet period for the e-commerce sale, that's why we are also providing this guidance. That's kind of just some additional points on the guidance side.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nYeah. One other thing to add, you just asked about the impact of our -- the growth of our skincare business on the gross margin trend. And obviously, you know, our skincare business, has much higher gross margin level than our color cosmetics, so the difference could be as big as like 10 percentage points. So, as we continue to grow our skincare business -- as the skincare business continues to take more shares in our total product mix, we believe that, you know, we will continue to see improvement on our gross margin.\n\nDustin Wei -- Morgan Stanley -- Analyst\n\nAll right. Got it. Thanks a lot.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nThank you.\n\nOperator\n\nAnd, ladies and gentlemen, our next question comes from [Inaudible] with CICC.\n\nUnknown speaker\n\nThanks for taking my questions. I have two questions. The first one regarding selling and marketing expenses, as industry competition intensify and some international brands also lower their price, which exerts great pressure to color cosmetic brands, so could the management give some color on your plans for marketing and promotion in the second half of 2022? And how do you see the channel of Yatsen selling in the marketing sense as a percentage of total revenue in the second half of the year? And the second question regarding organizational structure as the growth offsets brand portfolio, could you give some color on how you allocate resources and talent among different brands?\n\nDonghao Yang -- Chief Financial Officer and Director\n\nWell, thank you very much for your question. First, on the selling and marketing, we compete, of course, with other overseas brands and as well as our domestic -- those domestic brands. Not only on selling and marketing, but also we are making very big investments in our R&D capabilities. You know, we wanted to improve the efficacy of our products to make it one of our biggest competitive advantages going forward.\n\nSo, for the second half of this year, I believe the selling and marketing expenses as a percent of revenue will most likely stay at a relatively stable level, meaning you won't be seeing a sharp increase in our selling and marketing expenses to drive sales growth because, you know, for the long term, we do believe that the product efficacy and our investment in R&D will be, you know, the most important drivers of our future business growth. And organization structure, you know, how do we allocate our talent? Well, it depends. You know, for our skincare brand, I thinks, you know, we will allocate or we will assign our talent in marketing and branding most likely to those brands. And R&D, we are going to allocate more, you know, R&D dollars for talents for our, you know, skincare brands.\n\nAnd for color cosmetics, maybe more operational. And also branding is also very important. So, it really depends on the specific brand and market segments and product categories, and etc.\n\nUnknown speaker\n\nGot it. Thank you very much. I have no other questions.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nThank you.\n\nOperator\n\n[Operator instructions] Today's next question comes from Olivia Tong with Raymond James. Please go ahead.\n\nDevin Weinstein -- Raymond James -- Analyst\n\nHi. This is Devin Weinstein on for Olivia. I appreciate you taking our questions. First, I just wanted to ask a little bit more about the competition that you are experiencing.\n\nOne, how would you compare it to prior quarters and perhaps how are you looking at it going ahead? And then I want to specifically ask about the level of promotional activity that you experienced during the 6/18 event, and how you are expecting it to evolve for 11/11? And any preparations that you are making for that?\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nYeah, sure. So, most of the competitors -- publicly listed companies have reported their Q2 as well. We're seeing, you know, a soft season for most of the competitors, so which is kind of demonstrating our thesis on the overall demand. But the beauty industry in China has been impacted by the ongoing COVID and also consumer confidence issue.\n\nThe competition is still quite enhanced. Ever since last year, we are actually at the beginning of the COVID, where as there is more pressure for the international players there to meet their targets. So, their sales and promotions have been strong, which is still the case. Going forward, we think as COVID, if, you know, after this year could become more of we will pass COVID, then such level of promotions we think would ease in the future.\n\nSo, that's angle number one. And then secondly, nowadays, it's not only competition based on promotions, right, and also not only on branding, but more, as Donghao mentioned, on efficacy of the product. We are seeing, for example, recently, some of international companies reported their financials, some strong, some not strong. And you can see because of the difference of efficacy of its products, right, especially for skincare, if the brand portfolio has brands which more focusing on efficacy-based products, then the performance tends to be stronger in the Chinese market because these days, consumers and KOLs are more sophisticated in terms of formulation ingredients.\n\nSo, we think, as we mentioned, the three of the recently acquired skincare brands, right, in the efficacious and also premium category, the Eve Lom, Galenic, and DR. WU, are -- the growth is over 100% for Q2, which, we think, because of the position of varying trend in China, we will continue to see a strong growth of those brands.\n\nDevin Weinstein -- Raymond James -- Analyst\n\nThank you. Appreciate that. And if I could just sneak in one more. I just wanted to ask, I realized the shutdowns and the lockdowns from COVID impacted you.\n\nWas there any material impact from Hainan on your business?\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nSo, just wanted to clarify, you mean the duty-free of the Hainan sales, right, given the recent closure of Hainan shops?\n\nDevin Weinstein -- Raymond James -- Analyst\n\nYes. Correct. I was curious what impact that is having on your business, that area specifically.\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nYeah. It's relatively small for us because only premium and luxury skincare only have large distribution in Hainan. We do have distribution of Eve Lom in Hainan right now, but still a relatively small contribution to the overall revenue as most of our businesses are still in the mass and mid-end segment.\n\nDevin Weinstein -- Raymond James -- Analyst\n\nOK. Very helpful. Thank you so much for the answers.\n\nDonghao Yang -- Chief Financial Officer and Director\n\nThank you.\n\nOperator\n\n[Operator instructions] And, everyone, this concludes our question-and-answer session. I would like to turn the conference back over to management for any additional or closing remarks.\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nGreat. Thank you once again for joining us today. If you have any further questions, please feel free to contact us at Yatsen directly or TPG investor relations. Our contact information for IR in both China and the U.S.\n\ncan be found in today's press release. Thank you. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nIrene Lyu -- Head of Strategic Investments and Capital Markets\n\nJingfeng Huang -- Founder, Chairman, and Chief Executive Officer\n\nDonghao Yang -- Chief Financial Officer and Director\n\nDustin Wei -- Morgan Stanley -- Analyst\n\nUnknown speaker\n\nDevin Weinstein -- Raymond James -- Analyst\n\nMore YSG analysis\n\nAll earnings call transcripts"
}