{
  "companyName": "Certara, Inc.",
  "companyTicker": "CERT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/certara-inc-cert-q2-2022-earnings-call-transcript/",
  "content": "Certara, Inc. (CERT -0.56%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Certara second quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today David Deuchler.\n\nPlease go ahead.\n\nDavid Deuchler -- Investor Relations\n\nGood afternoon, everyone. Thank you all for participating in today's conference call. On the call from Certara, we have William Feehery, chief executive officer; and Andy Schemick, chief financial officer. Earlier today Certara released financial results for the quarter ended June 30th, 2022.\n\nA copy of the press release is available on the company's website. Before we begin, I'd like to remind you that management will make statements during this call that include forward-looking statements within the meaning of federal securities laws, which are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Any statements contained in this call that relate to expectations or predictions of future events, results or performance are forward-looking statements. Actual results may differ materially from those expressed or implied in the forward-looking statements due to a variety of factors.\n\nFor a list and description of risks and uncertainties associated with Certara's business, please refer to the Risk Factors section of our Form 10-K filed with the Securities and Exchange Commission on March 1st, 2022. We urge you to consider these factors, and you should be aware that these statements should be considered estimates only and are not a guarantee of future performance. Also, in our remarks through responses to questions, management may mention some non-GAAP financial measures. Reconciliations of adjusted EBITDA, adjusted net income, adjusted EPS and constant currency revenue to most directly comparable GAAP measures are available in the recent earnings release, which is available on the company's website.\n\nThis conference call contains time-sensitive information and is accurate only as of the live broadcast today, August 9 2022. Certara disclaims any intention or obligation, except as required by law, to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. And with that I will turn the call over to William.\n\nWilliam Feehery -- Chief Executive Officer\n\nThank you, David. Good afternoon, everyone. Thank you for joining Certara's second quarter earnings call. Andrew and I will start with prepared remarks and then we will take questions.\n\nIn the second quarter, Certara delivered significant growth in bookings and the biosimulation software and services business achieved mid-teens growth in revenue, despite headwinds from foreign exchange rates. Our performance in regulatory services, which comprises less than 25% of our business did not meet expectations due to ongoing delays and recent regulatory decisions regarding China-only clinical trial data. Our operating cash flow growth which was not impacted significantly by foreign exchange rates continues to be strong. We reported second quarter revenue of $82.8 million growing 18% year over year on a reported basis and 21% on a constant currency basis including Pinnacle 21.\n\nAs you know Certara operates a global business with employees and customers located in many different countries around the world. This global footprint has many advantages. However during periods of foreign currency volatility, our reported revenue growth figures may be impacted. As a result, we have decided to disclose our second quarter financial results on both a reported basis and a constant currency basis to help you better understand the underlying trends in the business, which remain healthy.\n\nReported software revenue was $28.7 million, growing 48% year over year on a constant currency basis, with a 92% aggregate renewal rate. These results were in line with our expectations and driven by mid-teens growth in our core Simcyp and Phoenix biosimulation software businesses as well as the contribution from Pinnacle 21. Demand for biosimulation continues to be strong with customer interest and new applications growing at a very healthy rate. We are committed to expanding the role of biosimulation to meet the needs of researchers with innovation and expansion of our software offerings.\n\nIn June, we launched our new Simcyp Discovery Simulator, which applies biosimulation earlier in discovery and development. Simcyp Discovery advances lead optimization, first-in-human dose prediction and early formulation development. We are excited to help identify and progress the most promising new drug candidates for further investigation. In addition, we released new versions of our immunogenicity, immuno-oncology and Vaccine Simulators to help predict how drugs work and to address key questions in the development of novel biologic therapies.\n\nThe latest versions of these simulators help our customers tackle the toughest challenges in drug discovery and development. We also recently announced an initiative to develop a biosimulation platform for CAR T-cell therapies with Memorial Sloan Kettering. We are excited to be collaborating in the MSK innovation hub and look forward to developing a biosimulation model that will help researchers, practitioners and ultimately patients with personalized therapies. Pinnacle 21 continues to meet our expectations.\n\nLast week, we introduced an updated version of Pinnacle 21 enterprise with a new data exchange module. The majority of pharmaceutical companies are grappling with four or more primary data sources in clinical trials. Data Exchange is a data management solution that streamlines the process of ingesting clinical trial data from external sources. This solution ensures data integrity and regulatory compliance, while empowering sponsors to maintain executive oversight to drive objective decisions.\n\nTurning to technology-driven services. We delivered revenue of $54 million, representing a 10% growth on a constant currency basis compared with the second quarter of last year. Within technology-driven services, biosimulation services revenue continues to show robust growth in the high teens on a constant currency basis. We expect continued strength in biosimulation services in the second half of 2022 and into 2023.\n\nThe industry has clearly shown an interest in expanding the use of biosimulation with strong growth in bookings and new customers. As demand for biosimulation services continue to grow, we are investing in our team to expand existing customer relationships as well as establish new relationships. In our regulatory services business, we have experienced more volatility this year than planned. Our customers continue to experience delays in projects and our business in China has been impacted by recent regulatory decisions causing Chinese customers to reassess their U.S.\n\nstrategy. As a result, performance in the regulatory business was below plan in the second quarter and we are taking a more conservative outlook on this business for the remainder of the year. We believe in the strategic value of the regulatory business, which generates very healthy cash flow and remain committed to supporting our clients. With our revised outlook, regulatory services and the negative impact from foreign exchange rates, we are adjusting our revenue guidance for the full year to $325 million to $335 million, reflecting an approximate $10 million reduction due to foreign exchange and $15 million related to the performance in regulatory services.\n\nAndrew will provide more details to the guidance shortly. Overall, we continue to see industry trends moving in the right direction to drive growth in the adoption of biosimulation and Pinnacle 21. We see opportunities to expand our software and services offerings throughout the entire drug development cycle as well as into new modalities and disease areas. I am confident our Certara team will capitalize on these opportunities, as we continue to deliver on our mission.\n\nI'll now turn it over to our CFO, Andrew Schemick to discuss second quarter financial results in more detail.\n\nAndrew Schemick -- Chief Financial Officer\n\nThank you, William. Hello everyone. Total reported revenue for the three months ended June 30th, 2022 was $82.8 million, representing year-over-year growth of 21% on a constant currency basis and 18% on a reported basis. Excluding Pinnacle 21 constant currency second quarter revenue growth was 11%.\n\nAs a reminder, the largest non-U.S. dollar currency exposures are the British pound, euro and yen and the majority of the foreign currency translation impacts biosimulation software and services. We remain well-positioned with trailing 12 months bookings coming in at $393.5 million, up approximately 25% year over year on a reported basis and excluding Pinnacle 21 up 17%. We continue to look at trailing 12 months bookings as a basis for forward 12-month revenue.\n\nReported software revenue was $28.7 million in the second quarter, which increased 48% over the prior year period on a constant currency basis and 43% on a reported basis. Excluding $6.5 million in Pinnacle 21 software revenue contribution year-over-year growth was 16% on a constant currency basis. The growth in this quarter excluding Pinnacle 21 was driven by our biosimulation software Simcyp and Phoenix, which grew approximately 15% compared to the same period a year ago despite the foreign exchange headwinds. Software bookings were $30.5 million in the second quarter, which increased 57% from the prior year period.\n\nPinnacle 21 contributed $8.6 million to software bookings in the second quarter. So the 2Q year-over-year software bookings growth excluding Pinnacle 21 was 13%. Trailing 12-month software bookings were $113.1 million, up 44% year over year and up 14% excluding Pinnacle 21. Software aggregate renewal rate was 92% in the second quarter and net retention rate was 139% or 107% excluding Pinnacle 21.\n\nReported services revenue was $54 million in the second quarter, which increased 10% over the prior-year period on a constant currency basis and 8% on a reported basis. As William mentioned biosimulation services revenue growth was in the high teens on a constant currency basis. Regulatory services growth was flat and we're no longer forecasting it to grow at historical rates for the remainder of this year. Technology driven services bookings in the second quarter were $69.7 million, which increased 25% from the prior-year period.\n\nTTM services bookings were $280.4 million, which increased 19% as compared to the prior year. Regulatory services booking growth is trending in the low single digits and we're forecasting a longer conversion of bookings to revenue in this business due to elongated customer cycles. Total cost of revenue for the second quarter of 2022 was $35.2 million, an increase from $27.5 million in the second quarter of 2021, primarily due to a $4.2 million increase in employee-related costs due to billable headcount growth, $1.7 million increase in intangible asset amortization, a $1.2 million increase in stock-based compensation expense and a $0.5 million increase in cost of licenses. Total operating expenses for the second quarter of 2022 were $43.4 million, an increase from $37.3 million in the second quarter of 2021.\n\nThe components of operating expenses are as follows; sales and marketing expenses were $7.1 million, compared to $4.6 million for the second quarter of 2021. This increase is primarily due to $1.6 million in employee expenses due to the expansion of the sales force, $0.5 billion increase in marketing and travel costs and miscellaneous sales and marketing operations costs. R&D expenses were $7.7 million, compared to $4.6 million for the second quarter of 2021. The increase in R&D expenses was primarily due to R&D expense from acquisitions and software R&D headcount investments.\n\nG&A expenses were $17.8 million, compared to $18 million for the second quarter of 2021. The decrease was primarily due to a $1.1 million decrease in transaction and M&A costs, $0.6 million decrease in stock-based compensation, offset by $1 million of investment in headcount and $0.6 million in higher professional services costs primarily related to accounting and stock implementation. Intangible asset amortization was $10.4 million, compared to $9.5 million in the second quarter of 2021, increasing due to amortization costs from acquired intangible assets. Depreciation expense was $0.4 million, compared to $0.6 million last year due to a decrease in depreciation for furniture and equipment.\n\nContinuing down the P&L. Interest expense was $3.9 million, compared to $6.3 million for the second quarter of 2021 due to slightly higher interest expense offset by the reclassification of our interest rate swap to an effective hedge. Miscellaneous income was $2.5 million, compared to a loss of $0.3 million in the second quarter of 2021 due to foreign currency gains of $2.7 million. Income tax expense was $3.4 million, as compared to $1.5 million in the prior year due to the relative mix of domestic and international earnings and the impact of pre-IPO stock compensation expense, which is not deductible for corporate income tax purposes.\n\nWe expect the rate to come down in the back half of the year. Net loss for the second quarter of 2022 was $0.6 million, compared to a net loss of $2.9 million in the second quarter of 2021. Diluted earnings per share for the second quarter of 2022 was $0.00, as compared to a loss of $0.02 in the second quarter of 2021. Reported adjusted EBITDA for the second quarter of 2022 was $28 million, compared to $25.5 million for the second quarter of 2021, representing 9% growth.\n\nReported adjusted net income for the second quarter of 2022 was $14.6 million, compared to $11.8 million for the second quarter of 2021. Adjusted diluted earnings per share for the second quarter of 2022 was $0.09, compared to $0.07 for the second quarter of 2021. Now, moving to the balance sheet. We ended the quarter with $194.8 million of cash and cash equivalents.\n\nAs of June 30th, 2022, we had $299 million of outstanding borrowings under our term loan and full availability under our revolving credit facility. Turning to guidance. We are adjusting our full year guidance, due to foreign exchange rates and slow recovery in the regulatory services market. We are lowering our revenue forecast by approximately $10 million, due to foreign exchange headwinds and $15 million, due to the performance and outlook of the regulatory services business.\n\nOur updated forecast for the full year of 2022 is as follows. Revenue in the range of $325 million to $335 million, adjusted EBITDA in the range of $112 million to $117 million, adjusted EPS in the range of $0.43 to $0.48 per share, fully diluted shares in the range of $159 million to $161 million, a GAAP tax rate in the range of 40% to 45% and cash tax rate in the range of 20% to 25%. I would like to point out that, due to capital planning the approximate $10 million of foreign exchange headwind we have forecasted flows through to a minor impact on reported adjusted EBITDA and virtually no impact to reported adjusted EPS. Lastly, as we look toward the second half of the year, it's worth highlighting that we have a particularly challenging third quarter comparison in reported technology-driven services revenue, due to the change in outlook in regulatory services.\n\nAs a result, we anticipate reported revenue growth in technology-driven services to be in the low single digits for the third quarter before returning to mid-teens growth in the fourth quarter. I will now turn the call back to our CEO, William Feehery for closing remarks.\n\nWilliam Feehery -- Chief Executive Officer\n\nThank you, Andrew. In summary, we remain focused on our commitments to customers and delivering strong results for our shareholders as we continue to grow as a global leader in biosimulation. We will now open the line for questions. Operator, can you please open up the line.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Dave Windley from Jefferies.\n\nDave Windley -- Jefferies -- Analyst\n\nI wanted to understand a little bit more on the regulatory services. It's been a little bit choppy for you at different times in the last year plus. I guess, first question there would be what visibility -- what communication level and visibility do you have with your clients to kind of understand in real time what the anticipated project end dates and delivery of databases to you for your start of these projects? If you could just kind of help us understand how tight is your visibility there?\n\nWilliam Feehery -- Chief Executive Officer\n\nYeah. Thanks, David. It varies by client. A number -- many times, what we find is that, the clients are still working that out themselves sometimes when they book with us.\n\nSo there can be some discrepancies. But generally, we have been in touch with all of our clients in our backlog talking with them about when they expect to start the projects we currently have booked. And we have seen a slowdown in the number of -- sorry, we've just sort of seen a slowdown in some of the projects starting. That started last year which I think is what you referred to during the pandemic and it's continued a little bit.\n\nI would say generally, we have about 60% visibility at any given time. We said that in the past. Anything, you'll add?\n\nAndrew Schemick -- Chief Financial Officer\n\nThat just relates specifically to the reg services, projects on hand. We would have firm visibility into start dates about 60% the other 40%, were in dialogue with the customers, today.\n\nDave Windley -- Jefferies -- Analyst\n\nGot it. And that 60% visibility on forward quarter -- forward four quarters. And you said, that's regulatory specifically?\n\nAndrew Schemick -- Chief Financial Officer\n\nThat's regulatory specifically, that relates only to the total work available to work on and that gives us 60% visibility, if it gives us basically 100% coverage to what's in the guidance here?\n\nDave Windley -- Jefferies -- Analyst\n\nOK. OK. Maybe on the product side, you mentioned Discovery Simulator new versions of Simcyp Phoenix, enterprise version of Pinnacle 21? And then I'd also throw in, you had carved out biologics simulator and we're beginning to sell that on more of a stand-alone basis. I guess I'd be interested in, how that biologic simulator is taking hold in the market? What kind of receptivity you're getting there? And then Pinnacle 21 being a late last year acquisition, looks like it's tracking pretty well.\n\nWhat opportunities do you see for that to inflect a little bit? Thanks.\n\nWilliam Feehery -- Chief Executive Officer\n\nYes. So what you're referring to is we launched in the quarter two new products. One of them is the -- Simcyp Discovery Simulator. So this is targeted more toward the earlier in discovery and preclinical.\n\nSimcyp as we said, has drive more of its revenues in the past in the clinical phase and beyond. So it's been a successful launch. We already have paying customers for that product and it's growing nicely. To answer your question about the biologics, it's been growing over time.\n\nThe simulator -- I would say, that the percentage of our customers focused on biologics has been growing pretty nicely. I don't think we've given the exact numbers on that particular product. Pinnacle 21, I'll let Andy talk in a minute, but the product we launched recently was Pinnacle 21 Data Exchange, obviously was in the pipeline, before we bought the company. But has also reached early sales already this year and we expect it to continue.\n\nAnd then as people put it in their budgets, for next year to continue to grow next year. Andy, do you want to comment on the growth of Pinnacle 21 versus their expectations?\n\nAndrew Schemick -- Chief Financial Officer\n\nPinnacle 21 is, pleased to say tracking in line with our guidance, from the beginning of the year. So we did about $13 million year to date, $7 million in the second quarter, 95% SaaS and we've seen some uptake on the new product launch there. So we're feeling that that's performing well relative to our expectations.\n\nDave Windley -- Jefferies -- Analyst\n\nExcellent. I'll leave it there. Thank you.\n\nWilliam Feehery -- Chief Executive Officer\n\nThank you, Dave.\n\nOperator\n\nThank you [Operator instructions] Our next question comes from the line of Joy Zhang from SVB Securities.\n\nJoy Zhang -- SVB Securities -- Analyst\n\nThanks for taking the question. I want to revisit one of your comments in the prepared remarks about Chinese customers, reassessing their strategy. Is that a headwind only for the regulatory business, or could that eventually become a bigger headwind in other parts of your business as well?\n\nAndrew Schemick -- Chief Financial Officer\n\nI could start Bill. That's specifically addressing a headwind in our regulatory business. We started to see some, we call export work helping Chinese companies with global submissions last year. And based on some FDA feedback in the current pipeline, that works not materializing this year but we're continuing to add resources on the biosimulation front.\n\nAnd believe that the opportunity to use biosimulation with regards to, some of the concerns about the lack of diversity in the population of the submissions, could create some new entry points for us in discussions with clients.\n\nJoy Zhang -- SVB Securities -- Analyst\n\nGot it. That's, helpful. Maybe a question on the QSP side, I know you touched on this a little bit. But I just wanted to get an update on in terms of large molecule modeling, what is possible to do now? And what are some of the areas for future innovation?\n\nWilliam Feehery -- Chief Executive Officer\n\nOn QSP we're building models of the action of a drug on whatever system it's targeted to do to interact with. And so some of the work that we've been investing in QSP and that we've been bringing in from our clients has been on things like cell and gene therapy. We recently announced the collaboration Memorial Sloan Kettering that will -- that is designed to let us build up our models for CAR-T therapies. And in addition, we've done a lot of work on modeling the immune system in general.\n\nAnd specifically that's led to our -- for example our Vaccine Simulator which was used by some of the companies who launched vaccines during the pandemic. So that's a little bit of a flavor for what we're doing there, I hope it helps.\n\nJoy Zhang -- SVB Securities -- Analyst\n\nYeah. No. That's super helpful. Thank you.\n\nWilliam Feehery -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Jeff Garro from Piper Sandler.\n\nJeff Garro -- Piper Sandler -- Analyst\n\nHi. Good afternoon. Thanks for taking my questions. I want to follow-up on the regulatory services outlook.\n\nAnd just was hoping you could comment more on whether any headwinds there are being caused by capacity with the regulatory agencies themselves or just various reasons causing delays from clients?\n\nWilliam Feehery -- Chief Executive Officer\n\nNo. We're not seeing this as an issue specifically that we believe is because of regulatory agencies. Our -- what we're seeing with the regulatory business, I think is a combination of several factors in our case. So one is, what we've talked about around -- we had some Chinese clients where we were developing a business as they came to the U.S.\n\nand that's with to the FDA and that's paused a bit this year. Second one is we believe that some of the Tier 2 and Tier 3 clients have slowed down just to conserve cash and so there's a slowing. And then the third effect, which really isn't -- which we did talk about in past quarters has been that there's been during the pandemic a slowdown in completing studies. And so generally our work doesn't begin until there's a 100% database lock.\n\nAnd we've seen just sort of a slowdown in study completion which has kind of made a lot of those -- a lot of the backlog stretch out much longer than it had historically.\n\nJeff Garro -- Piper Sandler -- Analyst\n\nGot it. Very helpful there and then maybe to follow up a little bit on the funding environment, we saw the strong bookings number in the quarter. But wanted to ask more about your business given some of the discussion from the CROs around kind of the pros and cons of a long sales cycle and the various steps before a project gets into their backlog and is marked as a net new win. I was hoping you could discuss the typical length of your sales cycle and whether any elements of that have changed over the last six months?\n\nWilliam Feehery -- Chief Executive Officer\n\nYeah. I mean our sales cycle tends to run a couple of quarters for most of the company. I'm not sure it's really radically different on biosimulation versus regulatory. There's some differences in software sales is that we tend to get more -- since we tend to get a lot of renewals for example in that business which happened disproportionately in the first quarter, which we've disclosed in the past.\n\nI think relative to what CROs, I think my impression is what we're seeing in regulatory -- in our regulatory business is not too dissimilar from what looks like some of the CROs are seeing. The difference there is we don't get started until the study is completely finished and there's a database lock, whereas the CRO tends to get paid throughout the entire study. But I don't think that what we're reporting is radically different than some of what I've seen people talking about in the market. I will say, in general, though that, one thing we are seeing with our bookings is that we are seeing very strong bookings on the biosimulation side.\n\nSo the effects that are happening in regulatory with Chinese customers in Tier 2 and Tier 3 and Tier 1 and everybody else just doesn't seem to be happening in biosimulation. We're seeing pretty good customer interest and bookings across the board for both software and services and biosimulation.\n\nAndrew Schemick -- Chief Financial Officer\n\nYes. I would just add specifically in Q2 in terms of the bookings mix ex-Pinnacle 21, we saw 2% growth on the regulatory side and 42% growth on the biosim side, and similar trend when I look at it on a TTM basis as well.\n\nJeff Garro -- Piper Sandler -- Analyst\n\nGreat. Then one last follow-up there. It sounds very positive in terms of the client activity the overall end market, but specifically ask is the pipeline growing roughly in line with the bookings growth that you've printed year to date?\n\nAndrew Schemick -- Chief Financial Officer\n\nThe pipeline remains healthy particularly, around -- on the biosim side. On the regulatory side one of the factors incorporated in the guidance is just a lack of a major submission project, which we typically have one year or two year which are in the several million dollar price range. So I would say that the biosim pipeline remains healthy and we expect continuation of strong bookings performance. But with that being said, we did have two large deals that occurred last year -- that were scheduled to book last year that booked in the first half of this year.\n\nSo I do anticipate pretty consistent with historical trends a step-down in the bookings in Q3 and then a return back up to Q4 which is typically our largest quarter.\n\nJeff Garro -- Piper Sandler -- Analyst\n\nGreat. Helpful color. Thanks again.\n\nOperator\n\nThank you. [Operator instructions] Thank you. Our next question comes from the line of Dave Windley from Jefferies.\n\nDave Windley -- Jefferies -- Analyst\n\nMany questions in the queue. I'd come back in on margin. Your margin -- your adjusted EBITDA margin was lower in 2Q. I'm going to guess that that's at least partly a function of the revenue coming in lower than you expected.\n\nSo perhaps you could explain or add some color to the impacts on your adjusted EBITDA margin. In the quarter is your regulatory services business appropriately sized to what you now view as the outlook for that business, or are there some cost changes in that cost structure that need to happen as a result?\n\nWilliam Feehery -- Chief Executive Officer\n\nAll right. Andy do you want to take the first part?\n\nAndrew Schemick -- Chief Financial Officer\n\nThere are some -- I would say that generally speaking, the business is size. There are some opportunities and we're looking at those opportunities for the back half of the year. But the biggest opportunity is the rate of hiring. They do have a pretty healthy backlog, but the rate of hiring will be slower than historically given the revenue growth projections for regulatory.\n\nThe way that I look at the margins is on a product basis kind of the contribution from the software and the services. We're still basically flat year over year on contribution there. So we did see a dip in regulatory but was offset by higher margin elsewhere. So no change.\n\nWe had to mix benefit from stronger software. And the margin impact is really the lower revenues impacted by some investments at corporate. It's about a third, a third, a third. It's audit and SOX costs going up.\n\nIt is the build-out of the commercial office and it's the build-out of the recruiting and talent and HR team.\n\nDave Windley -- Jefferies -- Analyst\n\nOK. And in the second half, so it looks like you're at midpoint, your full year adjusted EBITDA margin -- is it just a little bit lower not much but a little bit lower than what you've posted year to date? Should we expect kind of third -- given your comments on revenue should we expect third quarter to look more like second quarter and then fourth quarter jumps up, or is it a little bit more even through the back half? Maybe you could help us with cadence there please?\n\nAndrew Schemick -- Chief Financial Officer\n\nYes. So it's a little bit more even through the back half. I'm not quite sure what you're looking at. We can talk offline, but I think I've got about 35.5% for Q3 and Q4.\n\nDave Windley -- Jefferies -- Analyst\n\nGot it. OK.\n\nAndrew Schemick -- Chief Financial Officer\n\nCould be a little just toward Q4, yes.\n\nDave Windley -- Jefferies -- Analyst\n\nOK. That's very helpful. Thank you.\n\nOperator\n\nThank you. I would now like to turn the conference back over to William Feehery for closing remarks.\n\nWilliam Feehery -- Chief Executive Officer\n\nAll right. Well, thank you everybody for joining. I would say that to summarize, what I'd see for the quarter is, we've seen -- we have a very healthy biosimulation business well in the quarter. Our bookings are strong.\n\nWe're making investments as evidenced by our new products, and we're very bullish about that. Our regulatory business has grown less than we had anticipated for the factors that we talked about. We're still very supportive of that business. It is a -- has a very nice margin.\n\nIt generates a significant amount of cash flow for us, and we view it as an important part of the business. But we're a small -- we have a small regulatory business in a big market and it can grow by simulation can. But overall I think we're excited for the future. We have a lot of good things coming for the company, and we look forward to talking to you all next quarter.\n\nThank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid Deuchler -- Investor Relations\n\nWilliam Feehery -- Chief Executive Officer\n\nAndrew Schemick -- Chief Financial Officer\n\nDave Windley -- Jefferies -- Analyst\n\nJoy Zhang -- SVB Securities -- Analyst\n\nJeff Garro -- Piper Sandler -- Analyst\n\nMore CERT analysis\n\nAll earnings call transcripts"
}