{
  "companyName": "Casey's General Stores",
  "companyTicker": "CASY",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/caseys-general-stores-casy-q1-2023-earnings-call-t/",
  "content": "Casey's General Stores (CASY -1.04%)\nQ1 2023 Earnings Call\nSep 08, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the first quarter 2023 Casey's General Stores earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Brian Johnson.\n\nPlease go ahead, sir.\n\nBrian Johnson -- Senior Vice President, Investor Relations and Business Development\n\nThank you. Good morning and thank you for joining us to discuss the results from our first quarter ended July 31, 2022. I'm Brian Johnson, senior vice president, investor relations and business development. With me today are Darren Rebelez, president and chief executive officer, and Steve Bramlage, chief financial officer.\n\nBefore we begin, I'll remind you that certain statements made by us during this investor call may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include any statements relating to expectations for future periods, possible or assumed future results of operations, financial conditions, liquidity and related sources or needs, the company's supply chain, business and integration strategies, plans and synergies, growth opportunities, performance at our stores and the potential effects of COVID-19. There are a number of known and unknown risks, uncertainties and other factors that may cause our actual results to differ materially from any future results expressed or implied by those forward-looking statements, including, but not limited to, the integration of the recent acquisitions, our ability to execute on our strategic plan or to realize benefits from the strategic plan, the impact and duration of the conflict in Ukraine and related governmental actions, as well as other risks, uncertainties and factors, which are described in our most recent annual report on Form 10-K and quarterly reports on Form 10-Q as filed with the SEC and made available on our website. Any forward-looking statements made during this call reflect our current views as of today with respect to future events, and Casey's disclaims any intention or obligation to update or revise forward-looking statements, whether as a result of new information, future events or otherwise.\n\nA reconciliation of non-GAAP and GAAP financial measures referenced on this call, as well as the detailed breakdown of the operating expense increase for the quarter can be found on our website at www.caseys.com under the investor relations link. With that said, I would now like to turn the call over to Darren to discuss our first quarter results. Darren?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nThanks, Brian, and good morning, everyone. We're looking forward to sharing our results in a moment, but I'd like to start by thanking our 43,000 team members for their commitment to our guests and our communities throughout the busy summer season. Our team is performing exceptionally well. And we certainly would not have delivered another strong quarter without their unwavering efforts.\n\nFood innovation remains a top priority at Casey's. This summer, we launched our newest specialty pizza, the delicious BBQ Brisket Pizza. Although we have planned to make it a limited time offering, we're now keeping it on the menu because of positive guest feedback and strong demand that far exceeded our expectations. This fall, our team is celebrating the 21st birthday of Casey's legendary breakfast pizza by rolling out a new Beer Cheese Breakfast Pizza made with the Midwest staple, Busch Light.\n\nThe new product will be a lot of fun for our guests. It will be available just in time for tailgating parties this football season. As our guests shift into their fall routines and head back to work or school, Casey's will be here ready to serve them. Casey's is proud to support the communities we call home, and we aim to have a positive local impact by supporting fundamental needs.\n\nIn August, Casey's Cash for Classrooms giving campaign raised over $700,000, thanks to our generous guests and passionate team members. These funds will support grants to local schools and our footprint. The grant application process opens in October, and we encourage schools, teachers and parent-led organizations to apply. In July, we published our second annual environmental, social and governance or ESG report.\n\nYou'll see our other community-giving initiatives beyond our Cash for Classrooms Program highlighted in this report. We're proud of the progress we've made, not only in supporting our communities through charitable giving, but also through environmental initiatives. We are confident that our ESG efforts are the right thing to do for Casey's business, as well as for our team members, guests, communities and stakeholders. Please visit our website under the investor relations section to read the report.\n\nWith respect to our board of directors, we're pleased to welcome two new members to the Casey's board. Sri Donthi currently serves as executive vice president and chief technology officer at Advance Auto Parts and has deep experience leading teams to advance technology integration and evolution at consumer-focused businesses like Casey's. We're confident that he will bring a valuable perspective to help Casey's continue to accelerate our information technology and digital transformations. Mike Spanos brings significant leadership experience to the board, most recently serving as the president and CEO of Six Flags Entertainment.\n\nPrior to Six Flags, he served approximately 25 years at PepsiCo in a variety of senior executive roles. Mike's expertise in both the entertainment and the consumer packaged goods industries make him a tremendous fit with Casey's. We're excited to welcome both Sri and Mike to the board. Now, let's discuss the results from the quarter.\n\nAs you've seen in the press release, we had an outstanding first quarter for diluted EPS, finishing at $4.09 a share, a 28% increase from the prior year and a record high for the first quarter. The company generated $153 million in net income and $293 million in EBITDA, an increase of 20% from the prior year. Inside sales remained strong despite the challenging economic environment, driving inside gross profit up 9% to $504 million. Our differentiated business model allows Casey's to succeed in a variety of economic conditions through strong execution across grocery and general merchandise, prepared food, and dispensed beverage and fuel the support from store operations.\n\nI would now like to go over our results and share some of the details in each of the categories. Inside same-store sales were up 6.3% for the first quarter or 14.9% on a two-year stack basis with an average margin of 39.8%, down 70 basis points from the prior year. We saw strong performance in grab-and-go items like pizza slices and breakfast burritos, as well as alcoholic and nonalcoholic beverages. We were able to offset some inside margin pressure in the prepared food and dispensed beverage category through strategic sourcing initiatives and the private label program within the grocery and general merchandise category.\n\nSame-store grocery and general merchandise sales were up 5.5%, with an average margin of 33.9% compared to 33% for the same period a year ago. This is a great start to the fiscal year as our guests navigated through accelerating inflation and high fuel prices. Our procurement team and self-distribution network have allowed us to have better product availability than the prior year. We continue to see great results by leveraging our approximately 1,500 stores with a liquor license, which is a unique competitive advantage within the convenience store space.\n\nSame-store prepared food and dispensed beverage inside sales were up 8.4% or 20.1% on a two-year stack basis, with an average margin of 55.6% versus 61% a year ago. Sales were up due to strong performance in pizza slices and cold dispensed beverages. The breakfast relaunch for the fall of 2021 has proven to be a success as we have taken market share in the breakfast daypart within our geography. Prepared food and dispensed beverage margins were negatively impacted by higher ingredient costs, especially cheese.\n\nFor fuel, same-store gallons sold decreased 2.3%, with a fuel margin of $0.447 per gallon. We did see fuel volumes and margins tighten when wholesale costs and retail prices hit record highs, and our margin benefited from the steady fall in wholesale costs in the back half of the quarter. Our fuel team did a great job optimizing fuel margin during this favorable environment. Fuel margin was also positively impacted by the sale of $17.7 million worth of RINs during the quarter.\n\nI'd now like to turn the call over to Steve to discuss the financial results from the first quarter. Steve?\n\nSteve Bramlage -- Chief Financial Officer\n\nThank you, Darren, and good morning. Before I jump into the financials, I'd also like to take a minute to acknowledge the team for the incredibly strong performance throughout the entire business. The company executed really well during the quarter from operating the stores, rolling out our new summer items, managing fuel and serving guests, all the while continuing to collaborate with our business partners to manage the inflationary and the supply chain-challenged environment. Total revenue for the quarter was $4.5 billion, an increase of $1.3 billion or 40% from the prior year.\n\nTotal inside sales for the quarter were $1.3 billion, an increase of $123 million or 11% from the prior year. For the quarter, grocery and general merchandise sales increased by $88 million to $923 million, an increase of 10.5%, and prepared food and dispensed beverage sales rose by $35 million to $344 million, an increase of 11%. Reported figures were favorably impacted by operating 3% more stores on a year-over-year basis, primarily due to the acquisitions, which closed over the course of the prior year first quarter. Generally speaking, our in-stock levels improved during the quarter versus prior year, and that also helped reported revenue.\n\nRetail fuel sales were up $1.1 billion in the first quarter due to a 3.3% increase in total gallons sold to $689 million, as well as a 52% increase in the average retail price per gallon. The average retail price of fuel during this period was $4.49 a gallon, and it peaked on June 15 at $4.94 per gallon compared to $2.95 a year ago. We define gross profit as revenue less cost of goods sold but excluding depreciation and amortization. Casey's had gross profit of $836 million in the first quarter.\n\nThat's an increase of $112 million or 16% from the prior year. This marked a record high quarter in gross profit for the company. This was driven by higher inside gross profit of $40.7 million or nearly 9%, as well as an increase of $73.7 million or 31% in fuel gross profit. Inside gross profit margin was 39.8%, down 70 basis points from a year ago.\n\nThe grocery and general merchandise margin was up 90 basis points to 33.9% from a year ago, which is an impressive feat given the inflationary environment, and it's a testament to the merchandising team, their ability to manage margin through procurement, product mix and retail adjustments. Our growing private label program also offers our guests a lower retail price option that is margin accretive to the company, and it's especially attractive to guests in the current economic environment. Prepared food and dispensed beverage margin was 55.6%, that's down 540 basis points from prior year. The decrease in margin was negatively impacted by commodity costs, specifically cheese, which were $2.49 per pound for the quarter compared to $1.90 per pound last year.\n\nThis negatively impacted the PF&DB margin by approximately 190 basis points. The category was also impacted by a LIFO charge, which had an adverse impact of approximately 80 basis points. Finally, similar to the fourth quarter of the prior year, the company did incur an uptick in sales as our operations team made a concerted effort to keep the food warmers full of product to take advantage of the trends of higher grab-and-go sales. Fuel margin for the quarter was $0.447 per gallon.\n\nThat's up $0.096 per gallon from the prior year. RINs were not a significant incremental impact versus the prior year. Other gross profit was down $2.1 million, primarily due to a reduction in lottery and carwash sales, while other revenue was up from the prior year due to the higher price of fuel delivered into the dealer network. Margins from that business are fairly static, regardless of the price of fuel or the direction wholesale fuel prices are going.\n\nFor the year, we expect other gross profit to finish flat to slightly positive. Total operating expenses were up 13.4% or $64 million, which is consistent with our expectations. Total operating expenses, excluding credit card fees, were up 10.8% to $475 million in the first quarter. Approximately 4% of the operating expense increase is due to unit growth as we operated 74 more stores than the prior year.\n\nSame-store credit card fees rose due to the higher retail fuel prices I mentioned earlier, accounting for 3% of the operating expense increase in the quarter. 2% of the increase is due to higher performance-based incentive compensation expense due to strong financial performance. Increases in same-store employee expenses have been partially offset by a reduction in store labor hours. Our store operations team has done a great job rising to the challenge to operate our stores more efficiently without negatively impacting the guest experience, resulting in 2.6% growth in same-store operating expense, excluding credit card fees.\n\nAgain, in the face of inflationary pressure, this is a remarkable accomplishment by the team. As a reminder, same-store operating expenses do not include the new units that were acquired in the Buchanan Energy or Circle K transactions because those acquisitions closed during the first quarter of fiscal '22. These will be included in the second quarter same-store results. Depreciation in the quarter was up modestly as we're now lapping the new distribution center placed in service in fiscal '21.\n\nNet interest expense was $13.8 million in the quarter compared to $13.7 million in the prior year. Please recall that only 16% of our debt is floating rate. The effective tax rate for the quarter was 24.6% compared to 23.3% in the prior year, and that's up a bit due to the non-repeat of some state tax rate benefits we recognized in the prior year. Net income was up versus the prior year to $152.9 million, which is an increase of 28%.\n\nEBITDA for the quarter was $293 million compared to $245 million a year ago, an increase of 20%. Our balance sheet remains strong. At July 31, cash and cash equivalents were $312 million. And we have a remaining capacity of $469 million in lines of credit, giving us ample available liquidity of $781 million.\n\nFurthermore, we have no significant maturities coming due until fiscal '26. Our leverage ratio is now two times, down 0.4 turns from the prior year and in line with our preferred long-term target. And our balance sheet has plenty of capacity to make sound strategic investments as they present themselves. For the quarter, net cash generated by operating activities of $276 million, less purchases of property and equipment of $82 million, resulted in the company generating $194 million in free cash flow.\n\nThis compares to generating $197 million in the prior year. At the August meeting, the board of directors voted to maintain a dividend of $0.38 per share per quarter. We will continue to remain balanced in our capital allocation going forward, leading into the many EBITDA and ROIC-accretive investment opportunities in front of us. And we remain opportunistic related to our $400 million share repurchase authorization, but we did not purchase any shares this quarter.\n\nAs for our second quarter experience to date and expectations, we expect same -- we expect second quarter same-store inside volumes to be within our annual guidance of 4% to 6%. Inside margins should improve modestly from the first quarter as cheese is currently less of a headwind than it was previously. Same-store fuel gallons currently are trending between our first quarter experience and the low end of our annual guidance. Quarter-to-date, CPG is in the mid-40s, but it's declining as it benefited from higher margins in the first two weeks of August.\n\nMore recently, we've experienced CPGs back in the mid-30s. Finally, total operating expense should improve sequentially versus the first quarter, as expected, and will likely be up approximately 10% versus the prior year. I'd now like to turn the call back over to Darren.\n\nDarren Rebelez -- President and Chief Executive Officer\n\nAll right. Thanks, Steve. I'd like to again say thank you and congratulations to the entire Casey's team for delivering an outstanding quarter. Our three-pronged business model gives us the unique ability to navigate the current inflationary environment affecting both food and labor while also managing fuel volatility, allowing us to thrive in various economic climates.\n\nWe're committed to executing the strategic plan we laid out in January of 2020. As a reminder, the three pillars of our strategic plan are to reinvent the guest experience, create capacities through efficiencies, and be where the guest is via disciplined store growth. All three pillars are supported by investing in and growing our talented team and supported by technology. Inside the store, we've made great strides in joint business planning with our vendor partners, allowing us to manage product mix and strategically adjust retail prices while maintaining a relative value position in the marketplace.\n\nThis is reflected in the grocery and general merchandise results with mid-single-digit same-store sales and expanded margins. Our private label program has great momentum, exceeding 5% of the grocery and general merchandise penetration by the end of the first quarter, providing our guests a high-quality and cost-effective product. Prepared food and dispensed beverage continues to be an excellent value proposition alternative to QSRs. Each of our dayparts have items for our guests to get a great meal at a reasonable price, especially important in these inflationary times.\n\nSpecifically, in the breakfast daypart, we've rolled out a $4 breakfast value offering. Additionally, our whole pies and line pricing represent a great value for families versus other dining-out alternatives. On the digital side, our mobile app now represents 65% of all digital revenue which is primarily driven by whole pies. We've added more grocery and general merchandise items to the app as well.\n\nWe have also made great strides in delivery for beer and hard seltzers, which are a great complement to our pizza orders. Our Summer of Freedom campaign wrapped up around Casey's Rewards was successful at engaging our members in driving new guests to join, adding approximately 125,000 more members than the same period last year, and we sit at over 5.5 million members today. The field team did a great job this quarter managing a volatile environment. Rising fuel prices in May put pressure on margin.\n\nAnd in July, the opposite took place. Our centralized fuel team has allowed us to be able to react to market conditions quickly and effectively. We do note, however, that fuel margins north of $0.40 per gallon are not likely to continue. We expect margins to normalize in the second quarter.\n\nWe will remain prudent with operating expenses. Our continuous improvement initiative is top of mind for operations, as evidenced by the reduction in same-store hours. We've also taken a cautious approach to hiring outside of the stores to stay nimble with the economic environment. Labor availability at the store level is improving, and wage rate increases are becoming more manageable.\n\nAs we look ahead to the remainder of fiscal '23 and beyond, I remain confident in Casey's business model in the face of uncertain times. In a difficult economic environment, we provide our guests with basic needs conveniently at a competitive price point. With our centralized fuel and procurement teams, we're able to adapt and thrive in any economic environment. And with our digital rewards, we're able to understand the needs of our guests better than ever before.\n\nI can assure you, our entire team is excited to finish our three-year strategic plan on a high note and deliver on our commitments. We will now take your questions.\n\nOperator\n\nAnd our first question comes from the line of Bonnie Herzog with Goldman Sachs. Your line is open. Please go ahead.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nAll right. Thank you. Good morning, everyone. I just had a couple of questions on prepared foods.\n\nFirst, I think it's great to hear how the pricing you've implemented has been holding up. And could you give us a sense of how much -- or the rate of pricing you've implemented so far this year? And then second, you mentioned that cheese costs have moderated a bit. So prepared food margins may be -- won't be as pressured going forward. But curious what your thoughts are about taking further price increases maybe to mitigate the margin pressures going forward? Thanks.\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYeah, Bonnie, this is Darren. I'll go ahead and start. With respect to the price increases, really, over the last year, we've had three different rounds of price increases in prepared foods in an attempt to kind of keep up with inflation. The reality of it is, right now, we're facing about 14% ingredient cost inflation in that category, and that's a difficult one to keep up with.\n\nAnd we're not inclined to chase cheese costs because that's a commodity that has its ebbs and flows. And what we don't want to do is get out of bed versus the marketplace, so we really try to manage that point. But we have taken pricing. We're going to continue to monitor the situation.\n\nBut obviously, as you've seen in the results, we've got good velocity as well. So our units are hanging in there, flat to slightly up, and the pricing has been incremental. So it has put a little bit of pressure on the margin in the short term, but we are growing the business. We are taking share in important dayparts like the breakfast daypart.\n\nSo we feel good about where we sit right now. And then, we'll continue to monitor the situation for additional opportunities to take price, if we need to. And Steve, do you want to comment on the cheese itself?\n\nSteve Bramlage -- Chief Financial Officer\n\nYes. I think, Bonnie, on cheese, specifically, cheese was about a 30% headwind for us in the first quarter based on current trends right now. I think it will be kind of -- it's low double digits percent increase. So it's a significantly less of a headwind than it was in the first quarter.\n\nWe've also been able to lock in about a third of our cheese purchases for the rest of this fiscal year rates that are at least comparable to prior years. So I do think we'll have a little bit less of a headwind. And to Darren's point, on the pricing, we've taken -- we're low double-digit percentage terms in most of the prepared food line items from a pricing standpoint, which will continue to flow through. And the last point I would make around the margin is just -- and we have made some tweaks to our production schedules in the stores as we have a better sense of some of the new menu items.\n\nAnd so, I think we'll rightsize a little bit some of the stale levels that we've been absorbing in the past couple of quarters.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nOK. And just maybe a quick follow-up because that was helpful. So if I think about your comp growth in prepared food and low double-digit pricing, should we assume -- has there been some pull back in terms of volume? In terms of the business, how much is the pricing sticking? Just wondering how the consumer has been responding to the three price increases.\n\nDarren Rebelez -- President and Chief Executive Officer\n\nBonnie, it's been a little bit category by category. We've seen still strong unit movement in our breakfast daypart. That's gone really well. Pizza slices have been a great performer.\n\nCold dispensed beverages have performed well. And actually donuts have come back quite a bit, and that was more supply chain-related than anything else versus the prior year. So we are seeing good movement. Our whole pies, from a unit standpoint, have been a little bit soft, a little closer to flat, but the pricing has stuck.\n\nAnd so, we think we're in a good spot there, and again, we'll continue to monitor this. But it is absolutely a big priority of ours to continue to grow the prepared foods business in an accelerated rate, and we're seeing that happen right now.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nAnd our next question comes from the line of Ben Bienvenu with Stephens. Your line is open. Please go ahead.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nHey. Good morning, everybody. So I want to ask about the -- your guidance for full year same-store fuel gallons maintaining flat to up 2%. Obviously, prices ran up a lot to start the year.\n\nThey've since fallen off. The outlay by quarter or year-to-date, how would you describe what has happened relative to your initial expectations? And when we think about kind of what's remaining to get to that guidance, is it that, as gasoline prices have fallen, you've seen volumes recover so you continue to feel comfortable on the flat to up 2%? If you could just talk about those dynamics, that would be helpful.\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes, sure, Ben. In terms of what we experienced in the first quarter, clearly, in the first half of the quarter, wholesale costs ran up, retail prices ran up. And as we looked at our business, if we segment those price ranges by quartile, we certainly saw the largest volume erosion occur at the highest quartile of pricing. And then, at the lowest quartile, we actually saw some gallon growth.\n\nAnd when we compare ourselves versus the OPIS data, we see that we're outperforming the industry in our geography from a volume standpoint. So now that prices have come down to a little closer to normal, although they're still much higher than they were prior year, we're starting to see some of that volume recovery. And so, we think it's a little too early to call the ball on guidance for the full year when we're only a quarter of it -- a quarter into the game. And as we saw in this first quarter, a lot can happen in the quarter.\n\nWe can hit record highs, and we can come all the way back down in the span of a quarter. So we think we're just maintaining guidance for now, and then we'll update that after the second quarter when we have a little bit more visibility.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. That makes sense. Shifting gears a little bit to operating expenses. The quarter didn't really capture much of the fuel price decline that we've seen.\n\nBut for the balance of the year, that's a tailwind for you guys with respect to that guidance line item. What is the -- at what price level -- fuel price level, does the guidance reflect for the balance of the year? And just how should we be thinking about credit card fees as we move through the year?\n\nSteve Bramlage -- Chief Financial Officer\n\nYes, Ben, this is Steve. I'll answer that. Guidance reflects current pricing levels. So we're obviously off of where we were in the first quarter, for sure, quite a bit.\n\nAnd so, we're making a static assumption on what happens with retail prices. We don't try to follow that bouncing ball, but it implicitly -- if retail stay where they are, we would have less incremental credit card expense headwind, obviously, than we had in the first quarter.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. So if I could follow up on that, Steve, given that when you initially offered guidance for the year, fuel prices were quite a bit higher, and they've come off quite a bit. Are you seeing underlying inflation around wages still in your business in excess of what you originally thought? You noted taking some of the hours down. Could you just talk about kind of the underlying core opex growth, absent fuel prices, relative to how they looked at the start of the year?\n\nSteve Bramlage -- Chief Financial Officer\n\nYes. It's not -- I think it's generally consistent from kind of a rate pressure perspective. I think it's consistent with what we thought. It's still hard to find people, attract people and retain people, and we're working very hard to do that.\n\nIt's a little bit less acute than it was maybe six months ago, but we definitely are still continuing to need to pay people more this year than we were paying them last year. I think our average hourly rate, if you exclude our store manager population, is almost $14 an hour now across our footprint, which is up a couple percent from what it was last year. The thing that is helping us in that comparison is, last year, as we're kind of reopening from COVID, we had a lot of special retention-related initiatives in place on hiring and referral and summertime bonuses, etc. We have not had to keep those or reinstitute those.\n\nAnd so, the absence of the prior-year specials is flattening a little bit the amount of rate inflation that we're actually experiencing now. But it's still a couple of hundred basis points year over year of incremental rate inflation, which is consistent with what we thought it would be when we gave the guidance.\n\nOperator\n\nThank you. And our next question comes from the line of Anthony Bonadio with Wells Fargo. Your line is open. Please go ahead.\n\nAnthony Bonadio -- Wells Fargo Securities -- Analyst\n\nHey. Good morning, guys. Congrats on the beat. So I just want to ask about the grocery and general merch gross margin.\n\nPretty impressive performance there, and it looks like that 33.9% is the highest we've seen, at least going back to 2015. Can you just talk about the sustainability of that level? Is that the right way to think about modeling that segment going forward?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes, Anthony, this is Darren. Yes, there's a couple of things going on there. The first thing I do is give a lot of credit to our merchandising team, along with our supplier partners. They really engaged in joint business planning last year and came up with some great plans to execute this year.\n\nAnd I think, to a certain extent, you're seeing the benefit of that planning and the actions taken in those margin results. And so, that would be point number one. Point No. 2 is our private label performance has really been outstanding.\n\nAnd as you saw during the quarter, that mix shifted from about 5% at the end of the fourth quarter last year to about 5.4%, as we sit here today, in this quarter. And so, -- but what I'd point out in there is, while that's the sales penetration number on private label, if you look at units, our unit share is up over 9%, and our gross profit dollar contribution from private label is up over 9% as well. And so, the private label, as national brands get more expensive, more people shift over to those private brand products, and those are all margin-accretive for us. So we're seeing both of those things happen.\n\nSo from a sustainability standpoint, I would say, we should still be in good shape to be able to maintain those kind of margins. And the team has also done a really nice job of balancing, taking retail price where we've had cost increases, but also keeping a relative gap to competition, so we're able to take share at the same time.\n\nAnthony Bonadio -- Wells Fargo Securities -- Analyst\n\nGot it. That's super helpful. And then, just a follow-up on labor hours, I just wanted to ask about the decision to reduce. Darren, can you just walk us through what drove that? To what extent that was driven by efficiency gains in your operations? And just how we should think about the sustainability there, too?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes, Anthony, with respect to the labor hours, our operations team has really done a fantastic job, just being more effective at managing labor. And while we're talking about that, I just mentioned that we have stood up a continuous improvement team who is clearly focused on driving efficiencies in our store operations and removing nonvalue-added work from the operations team. So I think it was a two-pronged benefit. One was simply greater focus on managing the labor and being effective with it, reducing over time, reducing nonproductive hours.\n\nAnd then, the continuous improvement team identifying things that we don't need to do in stores and can be done more efficiently elsewhere or just eliminate it altogether, and that's reduced hours in the stores. And so, the combination of those two have really led to some efficiencies. And frankly, we're in the early stages of that. So we fully expect to find further opportunities to be more efficient in our stores.\n\nOperator\n\nAnd our next question comes from the line of Irene Nattel with RBC Capital Markets. Your line is open. Please go ahead.\n\nIrene Nattel -- RBC Capital Markets -- Analyst\n\nThanks and good morning, everyone. Can you talk through a little bit around what you're seeing from a consumer behavior standpoint: traffic, basket. Last quarter, we were talking about trading down in package sizes. We're hearing a lot about trading down from premium to more value products.\n\nAny sort of detail y could provide would be great.\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes, Irene. Well, first, let me start off by telling you a little bit about our consumer overall and some of the demographics around our consumers because I think this is important to understand. The first thing I'd say is our geography is -- works to our advantage in this respect. In the 16 states we operate in, we -- our states are in the lower end of cost of living, if you rank all 50 states.\n\nSo the most expensive state we operate in is ranked 22nd from a cost of living perspective. And seven of our states are in the bottom 10 of cost of living. So we live in a very affordable geography, operating in a very affordable geography to begin with. Then if you look at our guest income, 72% of our guests make over $50,000 a year.\n\nSo the combination of our guests making over $50,000 a year and living in a very affordable geography really works to our benefit. And so, as that as a backdrop, from a consumer behavior standpoint, certainly, record-high fuel prices impacted consumer behavior. So on the fuel side of the business, what we saw was a reduction in average gallons purchased per fill-up. There's about 8% reduction in the average fill-up, but the average number of transactions went up about 8%.\n\nSo people were just buying less fuel, but coming more frequently to do that, which, in a lot of ways, works to our benefit because it gives us more opportunities to convert that guest to an inside guest as well. We also saw some shifting around among the fuel slate itself. So you saw people shifting down from premium and mid-grade into regular unleaded or into higher ethanol blends. And our higher ethanol blends, E15 and E85, were up high 20s, low 30% versus prior year.\n\nSo you definitely saw that behavior. On the inside of the store, like I was just talking about, we saw that shift from some of the more expensive national brands into our private brand product, which, again, is margin-accretive for us. We've also seen some trade-down in pack sizes, from larger pack sizes to smaller, particularly in the beer category, where people aren't switching out of super premium and imports into cheaper types of beer. They're just trading down from larger pack sizes into smaller pack sizes within the beer category, which is also margin-accretive for us.\n\nSo, so far, things have been working out pretty well from a consumer behavior standpoint.\n\nIrene Nattel -- RBC Capital Markets -- Analyst\n\nThat's great. Thank you. And just would like your updated thoughts on sort of sustainable or sustainable levels of gas margins because, of course, we've been having a lot of opex conversations. But those two elements work in tandem, and it's a really big input into what the outlook is for earnings.\n\nSo can you share your thoughts with us, please?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes, sure. As you know, predicting fuel margin is a little bit of a crystal ball-type exercise. But consistent with what we said in our prepared remarks, we don't expect fuel margins to remain in the $0.40 range. That was a unique situation.\n\nCosts ran up to an all-time high and then costs fell back down a little closer to normal. And when you get through a cycle like that, and you have a long way to fall, margins typically widen out on the backside of that cost curve. And so, we certainly experienced that. Our fuel team did a great job managing through that volatility, and it worked to our benefit.\n\nFrom a planning standpoint, for us, we're looking at margins more normalizing over the balance of the year, and we'll have to see how that goes. There's a lot of things going on in the world right now that could cause those costs to run up again. But consistent with what we've seen throughout history, when they run up like that, they eventually hit a peak and then they have to come back down again, and we'll manage it similar to the way we did this past time.\n\nOperator\n\nThank you. And our next question comes from the line of Kelly Bania with BMO Capital Markets. Your line is open. Please go ahead.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nGood morning. I wanted to follow up on the opex and just clarify, is there something that is coming in or has the potential to come in higher than your original expectations? Because it just seems like with where the gas prices are now and the math that you gave last quarter, it seems like it should translate into about $40 million in lower credit card fees on an annual basis. So maybe it's just within -- still within the range, but can you just clarify that for us?\n\nSteve Bramlage -- Chief Financial Officer\n\nSure, Kelly. This is Steve. I'll give that a shot. As Darren said, foremost -- first and foremost, we're trying to wait until the end of the second quarter to -- we will reassess all of the guidance here by the time we get to the second quarter because we'll have seven months of experience by the time we have that call.\n\nI think that's probably overarching thought on not changing anything. But we certainly incurred more credit card fees, to your point, in the first quarter than we had thought. Credit card fees will still be quite a bit higher than the prior year based on current pricing for sure. The other piece is we've definitely incurred higher incentive compensation expense on the long-term components of the comp program, those multiyear kind of performance share pieces, and we will continue to have higher expense associated with those for the next couple of quarters.\n\nThat would be higher than we had expected at the time. And so, I still feel like the annual guide is reasonable based on everything that we know right now. We were right -- we're kind of right where we thought we would be, albeit with a different combination of things to get us there. And so, we'll reassess here at the end of the second quarter.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nOK. That makes sense. And just wanted to follow up. You made a couple of comments on just the value that your inside prepared food options bring relative to QSR and maybe other options in the market.\n\nAnd just maybe if you could just give us an update on what are the ranges in terms of price gaps, how those have trended, what you're targeting? And what has been happening as gas prices have moderated in recent weeks here between traffic and ticket and these dynamics?\n\nDarren Rebelez -- President and Chief Executive Officer\n\n Yes. With respect to the prepared foods pricing and value proposition, when we look at what's going on in the marketplace, there's been a lot of inflation that's happened in the QSR and restaurant industry. And if you think about most restaurants in the U.S. are either independent operators or franchise operated.\n\nAnd so, they're really small businesses even if they fly a big flag. And so, they're taking price at a pretty aggressive rate. And when we look at our pricing, if you think about our whole pie business as an example, it's $15.99 is the most expensive specialty large pizza that we sell. And that, with an order of breadsticks for $5, could feed a family of four.\n\nIt's pretty tough to feed a family of four in's any QSR and certainly any casual dining environment for under $25. So that value proposition is really strong. Then on the single-serve side, we just rolled out our breakfast value offer at $4. That's a tough proposition.\n\nMost QSRs are at $5 now for any sort of breakfast value offering. So we think we've got a really good value proposition for consumers. And like I said, when we look at the share data, it looks like we're taking share. So I think that's resonating with the guests.\n\nFrom a traffic standpoint, traffic has certainly gotten better as fuel prices have dropped. In the first quarter, our traffic was only down about 0.5%. So we were almost flat even with record-high fuel prices. So we started to see a little bit of recovery there, and we think that only continues to get better as time goes on.\n\nOperator\n\nAnd our next question comes from the line of Chuck Cerankosky with Northcoast Research. Your line is open. Please go ahead.\n\nChuck Cerankosky -- Northcoast Research -- Analyst\n\nGood morning, everyone. Great quarter. Could you talk about, please, store openings the rest of the year? You got off to, looks like, a slow start in getting the stores open. Are you seeing permitting problems still and certain difficulty in the builders getting components, especially for refrigeration?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes, Chuck. We did have a little bit of a slow start. But historically, that's not all that unusual for us to have a slower start in the first quarter. And if you think about it, it kind of makes sense, given our geography in the Midwest typically don't start construction projects in January and February because of weather.\n\nAnd so, if you're going to open in May, June time frame, you got to start that project in kind of January, February to make that happen. And so, first quarter tends to be a slower quarter for us anyway. That's never gotten in the way of us getting our full year number. And we've got over 20 stores under construction as we speak.\n\nWe got another 30 that will start construction between now and the end of the calendar year. And then, our acquisition pipeline is looking really strong right now. So we have full confidence we're going to get our full year number. It's just a little bit of a timing issue.\n\nChuck Cerankosky -- Northcoast Research -- Analyst\n\nRegarding acquisitions, could you talk about the environment for acquisitions versus last year where you got quite a few closed, please?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes. Last year was a great year for acquisitions and, really, both on -- we had some of those larger acquisitions that got a lot of headlines, but we did a lot of smaller deals as well. And we're seeing that same dynamic play out right now. We have a really robust pipeline of smaller deals that you'll never hear about, other than on a call like this.\n\nBut that's looking really good. And then, we've had some more larger deals that have come our way, and we're actively engaged in those processes. And as you know, those are competitive. So we have to see how that all shakes out.\n\nBut we like what we're seeing right now from a deal flow perspective, and we think that's just a reflection of the more complex and difficult operating environment that the old industry is in right now and smaller players are looking to get out of the industry.\n\nOperator\n\nAnd our next question comes from the line of Greg Badishkanian with Wolfe Research. Your line is open. Please go ahead.\n\nSpencer Hanus -- Wolfe Research -- Analyst\n\nGood morning. This is Spencer Hanus on for Greg. So have you guys seen any acceleration in trade-down quarter-to-date? And then as private label penetration picks up, are you seeing national brands start to take a less aggressive stance on raising prices as their units could be impacted?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nNo, Spencer, we haven't really seen any acceleration in trade-down. Like I said before, with the private label, we've seen that shifting over to private label. A lot of that velocity in private label is coming from the national brands as people shift over to more affordable and high-quality options. We have not seen the national brands look at that data and make different decisions regarding their cost posture.\n\nAnd so, we still see national brands passing on cost increases, and we continue to flow most of that through to the consumer. And that just -- that's a bigger gap between the national brands and the private brands, which works to our benefit, so we continue to do that.\n\nSpencer Hanus -- Wolfe Research -- Analyst\n\nGot it. That's helpful. And then, just taking a step back, can you walk us through how your overall unit sales trended in 1Q versus 4Q? And then I don't know if you mentioned this, but have you talked about what the product inflation was during the first quarter?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes. Unit velocity, overall, was really about flat. And it's very different category to category, but let's call it flat overall. In terms of inflation, we saw about 6.5% inflation in the grocery and general merch category and like I said before about 14% in prepared foods.\n\nSpencer Hanus -- Wolfe Research -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nAnd our next question comes from the line of Bobby Griffin with Raymond James. Your line is open. Please go ahead.\n\nBobby Griffin -- Raymond James -- Analyst\n\nGood morning. Thanks for taking my question. Congrats on the beat. First is just a quick clarification question.\n\nSteve, on the gross margin headwind in prepared foods, I believe you referenced 190 bps was from cheese and then there was like 80 bps from LIFO. Is the remaining 270 all the higher waste from grab-and-go? Or were there other parts of that 270 basis points to get to the 540?\n\nSteve Bramlage -- Chief Financial Officer\n\nYes. No, it's more than just -- it's more than just waste. Waste is the single biggest remaining item in that delta, but we continue to have inflation pressure across other parts of that category. We got a lot of coffee inflation on a year-over-year basis, quite a bit of donut input cost inflation on a year-over-year basis.\n\nSo broad-based, it's inflation across everything, except cheese, plus higher waste levels would account for the difference.\n\nBobby Griffin -- Raymond James -- Analyst\n\nOK. That's helpful. I just want to clarify that. And then, I guess, lastly, more higher level.\n\nGood comments about the uptick in market share around the breakfast category. So can you maybe put in context where Casey's market share is today in that category versus historical levels? Is it at an all-time high? Or is there opportunities to get back to maybe where it was, I don't know, a few years ago or something like that?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes. We've actually grown market share about 200 basis points from our most recent analysis. And as best we can identify, that's coming largely from QSR in our geography. And so, I don't have a good historical reference point, Bobby, to know whether our breakfast market share is at an all-time high or not, but it has certainly grown over the last year.\n\nAnd I think, because we see that coming from QSR, we feel really good about the proposition that we're offering to our guests right now.\n\nBobby Griffin -- Raymond James -- Analyst\n\nOK. That's helpful. I appreciate the details. Best of luck going forward.\n\nThanks, Robert.\n\nOperator\n\nAnd our next question comes from the line of Krisztina Katai with Deutsche Bank. Your line is open. Please go ahead.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nGood morning, and congrats on a great quarter. I wanted to talk about customer acquisition and your loyalty program. I believe you referenced that it now consists of 5.5 million members. What do you see from repeat behavior from these customers? And what are some of the ways -- maybe you could give us examples of what you're working on to make sure that there's going to be continued stickiness at even higher repeat levels? So maybe just update us on where you are in your personalization efforts.\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes, Krisztina. With respect to our rewards members, we see that they visit our stores about 15% more frequently on an annual basis than our non-Rewards members, and they spend about $12 -- or 12% more per transaction. So they're a far more profitable guest than our non-Rewards members. And they're far more active as well.\n\nWhen we measure this, we measure activity from a Rewards member on a 30-day basis, where most of the industry does that on a 90-day basis. And we see about 52% active participation on a monthly basis, on 30 days. And so, that's really high, about 64% on a 90-day basis. And you can compare that to just about any rewards program in the QSR space, and that is far in excess of what you would see there.\n\nSo we have very active members. One of the things we do to try to engage them more frequently as we are shifting our emphasis to more individualized activation, so we have -- we started off with what we call curation, which was the majority of our messaging to Rewards guests was kind of a message to everybody on the platform or most of the people on the platform. Then we've migrated over to segmentation, where we look at cohorts of guests, and with like behavior. And then, we send the message specifically to them and then individualize where we send this specific message to an individual guest.\n\nRight now, between the segmented and the individualized guest, we're about 80% of our messaging is going to those two groups. So we're seeing much higher response rates from those groups as we target those messages more toward their individual behavior.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nThat's great. Thank you for that color. And maybe if I could just follow up on the fuel trends and the traffic that you're seeing, especially following the end of the first quarter. What are you seeing from a consumer behavior perspective? How has that been changing, if at all, since the first quarter? Because I think you said your fill rate was down 8%, but it was offset by increased trips.\n\nSo I'm just curious what is happening with trips and fill-up rate as we sit here sort of the middle of September.\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes. Just to be clear, the 8% was a reduction in the average fill-up per guest. That wasn't a number for overall volume going down. Because remember, on the flip side of that equation, you had an 8% increase in fuel trips.\n\nSo that was really kind of offsetting it. So what we're seeing is, overall, volumes are getting better. And they've gotten consistently better as we hit those peak retail prices, and we've come down. And we've seen pretty consistently, once we get down into the upper $3, low $4 range, in fuel pricing -- price points, the volume starts to recover and actually become a little bit positive.\n\nAnd so, it's just a matter of where we are on that evolution, back down to more normalized retail pricing that drives that volume activity.\n\nOperator\n\nThank you. And our next question comes from the line of John Lawrence with the Benchmark Company. Your line is open. Please go ahead.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nHi. Great. Thanks, guys. Good quarter, congrats.\n\nCould you comment just a little bit, have you seen any comment on performance in some of the newer markets, say Knoxville? Any difference in those markets? And secondly, remind us on the remodel schedule. And when will we see some of those units getting remodeled and getting in fully with the kitchens, etc.?\n\nDarren Rebelez -- President and Chief Executive Officer\n\nYes, John. So far, things are working according to plan. As you can imagine, it takes a while to permit for remodels, particularly where we're putting kitchens in stores. And so, in Knoxville, in particular, we've only got two stores that have been remodeled at this point.\n\nBut we've got a full plan to get those done and, most likely by the end of the fiscal year, to get a lot of those remodels done. So early results are really only a reflection of us sort of doing some basic remerchandising and cleaning up the stores and changing some signage. But really, the real benefit will come when we get the full remodels in the kitchens in. Oklahoma City, we're kind of in the middle of that process right now.\n\nWe've got about half of the stores we intended to remodel done, and we're starting to see the benefits of those remodels in those stores. The other half are in varying stages of either under construction or being started. So quite a bit of noise in those numbers overall when we have stores shut down for remodels. So I would say that we're pleased with what we're seeing so far when we come out post remodel.\n\nThe prepared food is accelerating as we expected. And so, we're confident that that trend will continue in those other markets. We just have to let the process play out and get through those remodels.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nThanks a lot. Good luck. Thank you.\n\nOperator\n\nThank you. And I'm showing no further questions. And I would like to turn the conference back over to Darren Rebelez for any further remarks.\n\nDarren Rebelez -- President and Chief Executive Officer\n\nAll right. Well, thanks for taking the time today and joining us on the call. And again, we're off to a strong start this year. And I'd also like to thank our team members, once again, for all their hard work and contributions.\n\nAnd everybody, have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Johnson -- Senior Vice President, Investor Relations and Business Development\n\nDarren Rebelez -- President and Chief Executive Officer\n\nSteve Bramlage -- Chief Financial Officer\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nAnthony Bonadio -- Wells Fargo Securities -- Analyst\n\nIrene Nattel -- RBC Capital Markets -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nChuck Cerankosky -- Northcoast Research -- Analyst\n\nSpencer Hanus -- Wolfe Research -- Analyst\n\nBobby Griffin -- Raymond James -- Analyst\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nMore CASY analysis\n\nAll earnings call transcripts"
}