{
  "companyName": "TPG Inc.",
  "companyTicker": "TPG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/tpg-inc-tpg-q2-2022-earnings-call-transcript/",
  "content": "TPG Inc. (TPG -1.45%)\nQ2 2022 Earnings Call\nAug 09, 2022, 11:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the TPG's second quarter 2022 earnings conference Call. [Operator instructions] Please be advised that today's call is being recorded. Please go to TPG's IR website to obtain the earnings materials. I will now turn the call over to Gary Stein, head of investor relations at TPG.\n\nThank you, and sir, you may begin.\n\nGary Stein -- Managing Director and Head of Investor Relations\n\nGreat. Thanks, operator. Welcome to our second quarter 2022 earnings call. Joining me this morning are Jon Winkelried, chief executive officer; and Jack Weingart, chief financial officer.\n\nIn addition, our executive chairman and co-founder, Jim Coulter; and our president, Todd Sisitsky, are also here with us and will be available for the Q&A portion of this morning's call. Before we begin, I'd like to remind you that this call may include forward-looking statements that do not guarantee future events or performance. Please refer to TPG's earnings release and SEC filings for factors that could cause actual results to differ materially from these statements. TPG undertakes no obligation to revise or update any forward-looking statements, except as required by law.\n\nWithin our discussion and earnings release, we are presenting GAAP measures, non-GAAP measures and pro forma GAAP and non-GAAP measures, reflecting the reorganization that was completed during 2021 and immediately prior to TPG's IPO. We believe it's helpful for investors and analysts to understand the historic results through the lens of our go- forward structure, and please refer to TPG's earnings release for details on the pro forma financial information. We'll also be discussing certain non-GAAP measures on this call that management believes are relevant in assessing the financial performance of the business. These non-GAAP measures are reconciled to the nearest GAAP figures in TPG's earnings release, which is available on the company's website.\n\nPlease note that nothing on this call constitutes an offer to sell or a solicitation of an offer to purchase an interest in any TPG fund. Looking briefly at our results for the second quarter. We reported a GAAP net loss of $10 million and after-tax distributable earnings of $162 million or $0.46 per common share. We also declared a dividend of $0.39 per share of Class A common stock, which will be paid on September 2 to holders of record as of August 19.\n\nWith that, I'd like to turn the call over to Jon Winkelried, chief executive officer.\n\nJon Winkelried -- Chief Executive Officer\n\nThanks, Gary, and good morning, everyone. During our prepared remarks today, I'll touch on our recent performance and discuss a few highlights across our business. I'll then turn the call over to Jack to provide more details on our financial results followed by Q&A. We delivered strong financial results for the second quarter despite a volatile global macroeconomic and geopolitical environment.\n\nThese results highlight the momentum of our franchise, the strength of our portfolio and the inherent growth in earnings power of our model. Our second quarter fee-related revenues of $256 million grew 43% compared to the pro forma year ago quarter, while our fee-related earnings, or FRE, more than doubled to $102 million over the same period. This FRE growth, combined with $60 million of performance-related revenues in the quarter led to after-tax distributable earnings of $162 million, which more than tripled compared to the pro forma year ago quarter. Driven by these strong results, we announced a quarterly cash dividend of $0.39 a share, representing 85% of TPG's after-tax distributable earnings.\n\nAs of June 30, we had $127 billion of total assets under management, an increase of 17% year over year. This growth was driven by significant fundraising activity across our business, led by first closings in the quarter for several of TPG's flagship funds, including TPG Capital Partners, healthcare partners and rise. In aggregate, we raised $13 billion during the second quarter, which is 120% increase versus the year ago quarter, and we raised a record $31 billion over the last 12 months. We're pleased with the strong support we have received from both our long-standing and newer limited partners.\n\nThe success of our recently completed and ongoing fundraising campaigns is a testament to our excellent track record strong LP relationships and best-in-class team. In addition to our robust fundraising over the last quarter and 12 months, we invested $4 billion and $21 billion, respectively. And we delivered realizations of more than $4 billion and $28 billion, respectively. In aggregate, our investment portfolio generated value creation of 12% for the last 12 months, despite a value decline in the second quarter.\n\nThe global macro environment remains highly uncertain due to a confluence of factors, including inflationary pressures, rising interest rates, the ongoing war in Ukraine, and supply chain constraints. As long-term patient investors, we have successfully navigated TPG through a number of cycles and bounce of volatility over the last three decades and despite the existing backdrop, our business is performing well. While we couldn't have predicted the specific timing or drivers of the current downturn, we have been preparing for the onset of a more challenging market for some time. We aggressively monetized our portfolio during an attractive valuation environment with aggregate realizations totaling 1.3 times the amount of capital we invested over the last 12 months.\n\nImportantly, at June 30, we had $39 billion of dry powder. The largest amount in the firm's history, representing 59% of our fee-generating AUM. With this large pool of dry powder, we believe we are well positioned to deploy capital in this increasingly favorable investment environment. We expect to see more attractive investment opportunities across our core sectors and beams as sellers adapt to reset valuations and markets stabilize in the coming quarters.\n\nOn the realization front, we recognized and mean into the frothy market valuations over the last 18 to 24 months. Now that the environment has changed we will still expect to selectively monetize investments in the coming quarters. Our pace will likely moderate. We have a strong relatively young portfolio of attractive companies, and we have a bias to remain patient and continue investing in these companies to build long-term value.\n\nI'd now like to walk you through some highlights across our business, starting with our largest platform, capital which had $62 billion of total AUM as of June 30. During the quarter, our capital funds completed or announced several investments in companies, including Doc Genrici, a leading European specialty pharmaceuticals company based in Milan, and the pending take private of Covetrus, a leading U.S. animal health technology and distribution services platform. Both of these transactions leverage our capabilities as one of the most active and experienced healthcare private equity investors while building on thematic areas we have studied in diligence for many years.\n\nDuring the quarter, we also completed the acquisition of an additional stake in Soft Labs, a leading provider of automated software testing solutions. This is a great example of the proprietary investment opportunities we create through the connectivity among our investment platforms. Our tech adjacencies fund, Todd first made a minority investment in saw slabs in 2019 and subsequently increased its position. This relationship enabled our capital team to engage Soft Labs and its shareholders on a proprietary basis, which led to a majority investment.\n\nIn the second quarter, we also helped on CAA's strategic acquisition of ICM, which enhanced its leadership position within the entertainment and sports industries. We first invested in CAA back in 2010. And last year, we moved it into a single asset continuation vehicle to maintain our majority ownership of this high-quality business. For the quarter, our capital funds generated total realizations of approximately $2 billion, including the partial sale and recapitalization of TPG Asia's investment in Green Cross, Australia's largest pet care company.\n\nNext, our growth platform at $21 billion of total AUM and at the end of the second quarter. As discussed, we have built our growth portfolio with a focus on sectors and teams like healthcare IT, digital transformation and security and infrastructure were secular rather than cyclical growth drives performance. We are investing in well-established companies with strong financial profiles, and our investments are often through structured securities that provide some form of downside protection. Growth Platform had an active deployment quarter including the completion of our investment in Mero Sodali, a leading global provider of shareholder engagement and corporate governance services.\n\nIn addition, consistent with our hands-on approach and focus on bending the curve to drive transformational growth we funded several strategic portfolio company acquisitions, including Casas Take Private Datu to further scale as a leading provider of back-office infrastructure software. The Knowles acquisition of Imperial Western products to bolster its leadership position in organic waste management, Asia Healthcare Holdings acquisition of Dr. Agarwal, Healthcare, India's largest provider of eye care services, and People 2.0's acquisition of Brookson, a leading compliance and services platform for freelancers in the U.K. During the quarter, we returned capital to our growth platform investors through several transactions, including partial monetizations for Freedom Pay and Asia Healthcare Holdings.\n\nWe also announced the strategic sale of implantable provider group to Evolent Health and completed the IPO of Campus Activewear in India. Campus is India's No. 1 sports and athleisure footwear brand and its public offering achieved the second highest subscription ever for an Indian consumer IPO at the time of pricing. Moving on, the Impact platform had total AUM of $15 billion as of June 30.\n\nDuring the quarter, our impact loans deployed capital in a number of transactions such as Intersect Power, a leading integrated renewable energy platform. Summit Carbon Solutions, which is developing one of the largest carbon capture and storage systems in North America. Beta Technologies, which is developing electric aircraft capable of vertical takeoff and landing, and International Medical University, which operates medical colleges in Malaysia. I'd also note the inflation Reduction Act is expected to stimulate substantial investment in climate-related technologies and solutions which should provide a tailwind to some of our existing rise and rise climate portfolio companies and also create attractive investment opportunities going forward.\n\nOur real estate platform, which ended the second quarter with $20 billion of total AUM and had a substantial realization in the quarter, the sale of the remaining assets in ICON, which was our warehouse and logistics development venture in the U.K. On the deployment side, the real estate platform continues to add new investments at a measured pace primarily across our student housing, rental housing and life science themes. Before I turn the call over to Jack, I'd like to touch on our talent strategy, which is an integral component of TPG's culture. We remain focused on recruiting and retaining best-in-class talent.\n\nWe recently announced midyear promotions from more junior members of our investment team across six offices and five business units, and nearly 50% of these promotes identify as diverse. We also held our annual partner promotions, and this year's process was is rigorous and engaging as ever. Our successful partner candidates represented four offices globally and five different business units. And since 2019, 40% of our new partners have identified as diverse.\n\nDuring the quarter, our most senior leaders and I hosted our annual diversity, equity and inclusion town hall. This firm wide event is an important time for us to come together as a global firm to provide updates on our DEI strategy and progress and keep ourselves accountable as we continue to build our firm. I'd also like to highlight that today, we published our annual environmental, social and governance review, which is available on our website. This report underscores TPG's commitment to advancing ESG performance within the firm and across our broader ecosystem and communities.\n\nLastly, I'm also pleased to note that we recently added Gunter Bright as a new independent director to our board. Gunther is a distinguished leader who has delivered exceptional results as an executive at American Express, a former board member of McAfee, a number of various nonprofit boards. The talent will enhance our board. I'd now like to turn the call over to Jack, so he can take you through our financial results.\n\nJack Weingart -- Chief Financial Officer\n\nI'm going to briefly walk through our financial results and highlight some of our second quarter performance. Our total assets under management in the second quarter of '21 is $127 billion as of June 30 of this year. The key drivers of the 17% increase were the $31 billion of capital raised that Jon mentioned, combined with $15 billion of value creation from our underlying fund investments, partially offset by $28 billion of realizations that were returned to our fund investments during the same period. June 30 '21 to $67 billion at June 30, '22.\n\nThis 28% increase was driven primarily by raising nearly $17 billion in fee earning capital across our platforms, most notably in real estate and impact for the recent activation of our next flagship Capital and Healthcare Partners funds, which I'll discuss momentarily, our fee earning AUM is now $73 billion increase compared to the second quarter of '21. At June 30, approximately 84% of our AUM and 77% of our fee earning AUM was in either perpetual or long-dated funds with a duration at inception of 10 years or longer. In addition, 80% of our fee earning AUM at a remaining duration of five or more. We had nearly $16 billion of AUM subject to fee earning growth, including more than $13 billion, not yet earning fees at the end of the second quarter.\n\nDespite the challenging macroeconomic environment, the fundamental performance of our portfolio companies remain strong, with aggregate revenue and EBITDA growth well above market which we believe is a result of our hands-on approach and thematic sector-based investing in areas with secular growth trends. This strong performance partially offset the declining multiple environment in the quarter, leading to a valuation decline of 2%. Looking at our income statement, we recorded a GAAP net loss for the second quarter of $10 million. Regarding our non-GAAP results, we reported fee-related revenues for the second quarter of $256 million, an FRE of $102 million.\n\nOur FRE more than doubled versus the pro forma year ago quarter driven by a combination of top line growth and management fees and the ongoing expansion of our FRE margin. Our FRE margin was 40% for the second quarter, up from 38% in the first quarter of this year. As we have indicated previously, we expect continued FRE margin expansion as we scale our business and drive operating leverage with an FRE margin target of 45% by the end of next year. Our after-tax distributable earnings were $162 million, which was more than three times the pro forma year ago quarter, driven by the growth in FRE and by realized performance allocations of $60 million in the second quarter.\n\nTurning to the non-GAAP balance sheet for TPG Operating Group as of June 30, which is reflective of our balance sheet like business model, we are well capitalized with $585 million of cash and $450 million of long-term debt. In July, we also upsized our undrawn credit facility from $300 million to $700 million to provide us with additional financial flexibility. We also had a net accrued performance allocation balance, which represents the 20% allocation to the TV operating group of $677 million. This decreased from $796 million at the end of the first quarter, driven by a $60 million of realizations and a $60 million unrealized noncash decline in mark-to-market valuations.\n\nA notable component of our performance allocation balance as of June 30 is related to the sale of Wind River, which we've discussed on previous calls. This transaction is currently under regulatory review, and we are now targeting a closing by year end. I'd also like to note that as of June 30, $114 billion or 90% of our total AUM was eligible for performance allocations. On fundraising, we delivered an exceptional quarter with $13 billion of capital raised and a record $31 billion raised over the last 12 months despite headwinds across the industry.\n\nI'd like to provide you with a bit more detail and an update regarding additional fundraising post quarter end. I mentioned on our last call that we expected to hold first closes for three funds around midyear, our flagship TPG Capital, Healthcare Partners and Rise funds. In all three cases, we held rolling first closes that began at the end of the second quarter and finished after quarter end. On TPG Capital and Healthcare Partners, where we've articulated a combined target of $18.5 billion, we closed on $8 billion during Q2, as you saw in the earnings release and another $2.7 billion in the past month bringing the combined first close to $10.6 billion.\n\nOn Rise, where we've articulated a target of $3 billion, we closed on $1.3 billion during Q2 and another $300 million in the past month, bringing the total first close to $1.6 billion. On the TPG Asia front, as I mentioned on our last call, we expect to complete our first close this quarter, Q3 and we'll have more to report on this during our next earnings call. Our real estate platform, we raised $2.3 billion for our fourth opportunistic real estate fund in the second quarter. We have reached the hard cap for this fund, and we expect to complete fundraising this quarter with our internal capital commitments at a total fund size of approximately $6.8 billion.\n\nFinally, a comment on the timing of activation of TPG 9 and Healthcare Partners. We had not activated these funds as of June 30, which is why the $8 billion does not show up in our fee earning AUM numbers at quarter end. Since then, we finished investing TPG and Healthcare Partners 1, so we have now activated the new flagship funds as of mid-July. While the remainder of our fundraising campaigns may be extended for reasons that have been well discussed across the industry.\n\nWe are very pleased with our strong start, and we look forward to updating you on our continued progress in future quarters. Taking a step back, we are proud of our strong second quarter results and the momentum we're generating across our business. We believe our investment portfolios are performing well amid the volatile market backdrop, and we're working closely with our portfolio of companies to build long-term value. In addition, we continue to expect strong growth in fee- generating assets under management, and fee-related earnings as a result of our ongoing broad-based fundraising campaigns.\n\nWith that, I'd now like to turn the call back over to the operator, so we can take your questions.\n\nOperator\n\n[Operator instructions] And our first question will come from Craig Siegenthaler with Bank of America.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nSo we wanted to start on fundraising and it was nice to see the $7 billion closure [Inaudible] and almost $2 billion for Healthcare 2 in the quarter, especially given some of the emerging challenges. But I want to circle back to Jack's prepared commentary on extension, I think was the word used. Do you think it'll be significantly more difficult to raise the second half of these funds? I think you have about $8 billion of the $18 billion remaining in the second half of this year, just given that some of your limited partners, they may have hit their full year fundraising targets a little earlier this year given the nominator effect?\n\nJack Weingart -- Chief Financial Officer\n\nYes. Thanks for the question, Craig. Look, we've been talking for a few quarters now about the fundraising market challenges and the fact that I think all fundraising campaigns across the industry will be more extended than usual. And that, I think, remains the case for the reasons you're articulating.\n\nAgainst that backdrop, we couldn't be happier or more proud of the progress we made as of the end of the quarter and the subsequent closures I just referred to. I do think as we look out toward the completion of those campaigns that I wouldn't expect them to be complete by the end of the year. I think all of them will extend into next year.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nThank you, Jack. And just for my follow-up, it's actually on the real estate business and marks. And I was curious behind the dynamics of your negative 2.3% mark in real estate. Within that portfolio, which segments were marked down the most, which ones are maybe flat to up? And I also wanted to see how cap rates generally trended which likely offset strong free cash flow growth.\n\nJon Winkelried -- Chief Executive Officer\n\nYes, Craig. It's Jon. First of all, I would say that our real estate portfolio, and I think we've talked about this before, is actually performing extremely well. And the places that we're exposed are places where, frankly, I think we feel good about being exposed.\n\nSo as you know, our focus from a sector perspective has been life sciences, industrial, rental, residential housing, student housing, data centers and studio content real estate. And we have very little, if any, significant exposure to office or retail, which obviously are down much more significantly. I think as a general matter, we've been reasonably conservative in terms of our marketing, even though our operating performance is actually exceptionally good. And one of the things that we do look at is we do look at across our entire business, public market comps and you look at REITs in the market, as an example, REITs have had a pretty tough ride in this market downdraft.\n\nJust a couple of benchmarks for you. Prologis, down 23%. EQR, down 19%. These are the largest industrial and apartment REITs.\n\nSo when you think about sort of how we think about marking our book, I think we're being reasonably conservative in doing so. And I think that the areas where we're marking in relation to that, obviously, industrial, rental residential housing are places where we're taking into account those benchmarks relative to the rest of the portfolio, which is marked slightly stronger. So I think it's fairly straightforward in terms of our approach to how we came through this quarter in our marks. Obviously, cap rates are up a bit with rates overall.\n\nThe real estate securitization markets are much slower than they were with loan to values that are down, spread slightly wider, etc.\n\nOperator\n\nOur next question will come from Alex Blostein with Goldman Sachs.\n\nAlex Blostein -- Goldman Sachs -- Analyst\n\nSo I was hoping maybe we could expand a little bit on the fundraising backdrop and just kind of look under the hood a little bit. One of the things, Jon, you mentioned, is the expansion of the LP basin. I'm curious kind of how that evolved another year through the first slug of the fundraising. How does it differ from the predecessor funds either in terms of the composition of LPs, the number of LPs geographically or by customer tab? We just get -- like to get a little bit more color as we kind of try to get confidence in the remaining piece of this fundraising cycle for you guys?\n\nJack Weingart -- Chief Financial Officer\n\nSure. Thanks, Alex, it's Jack. I would say consistent with, I think, my comments on the prior call, we're definitely seeing a bit of a mix shift in the LP base, first of all, given that the current dynamics in the fundraising market are affecting some segments of the market more than others. I would say that the composition of an LP base is much more international, this cycle than it was last cycle.\n\nIf you compare the TPG 9 and Healthcare Partners 2, for example, all the capital we've closed on to date, about 35% or so is domestic U.S. capital in the same funds last time, TPG Healthcare 1, it was about 47%. So a mix shift toward more international capital and a mix shift with pensions representing a bit lower percentage and areas like sovereign wealth increasing. And then I would also say we're definitely successfully expanding our LP base during this broad-based fundraising campaign.\n\nWe've added -- I don't have exactly the amount of capital we've added from new LPs, but it's a substantial portion of our fundraising process.\n\nOperator\n\n[Operator instructions] Our next question will come from Ken Worthington with J.P. Morgan.\n\nKen Worthington -- J.P. Morgan -- Analyst\n\nSo as we think about organic growth for TPG and filling in some of your product gaps, how do you see sort of the spreads between the bid and the ask adjusting for potential deals given the more challenging market conditions that we've seen? So public market valuations for all to have come down a bunch. To what extent, if at all, have private market valuations come down as well? And are they holding up? And then I guess, ultimately, what is your desire to kind of fill in one or two of the capability gaps that I think we talked about during the IPO process. as you look out over, I don't know, pick a time period, 12 to 18 months. So not immediately, but over the next, call it, year and a half or so.\n\nIs that something that's still sort of a priority for you, I guess, is the question.\n\nJon Winkelried -- Chief Executive Officer\n\nKen, just to clarify the first part of your question, I think on the bid-ask spread, you're referring to within the alt space, not just generally with respect to our portfolio company, right?\n\nKen Worthington -- J.P. Morgan -- Analyst\n\nYes. Correct. This is you as a buyer or an investor -- you as a buyer for your personal M&A.\n\nJon Winkelried -- Chief Executive Officer\n\nYes. Well, personally, [Inaudible]. Well, look, I think the first part of the question in terms of sort of the bid-ask spread, I think I would characterize as very kind of bespoke or situational. It's very hard to kind of generalize because I think that we have, naturally, as we said during the IPO process, we're interested in continuing to expand our business.\n\nAnd as you know, most of our growth historically has been through organic developed growth. We continue to believe that will be an important growth driver for us. On the nonorganic or the acquisition side, I think that you would expect that we would be very targeted and focus on what we're adding, what the characteristics of it are. And I think there, it's very specific to the potential strategy firm people.\n\nSo I really have a hard time generalizing when it comes to that in terms of the bid-ask spread. So people want to get paid a lot for the businesses they do, particularly where generally the asset class has had a tailwind over the last number of years. So I would say that would -- our judgment on it is it continues to be quite situational and sort of one-off and specific. And I would reiterate that we do have a desire to continue to be forward leaning on filling in gaps in our business.\n\nI think that in particular, I think we continue to have some dialogue with various strategies across the credit space. we feel that generally in our rise and impact business that broadening our capabilities there in a number of different categories is something where we might be able to accelerate that by either acquiring something or something like an aqua hire a team in a particular discipline. And so we'll continue to be engaged in the market.\n\nOperator\n\nOur next question will come from Brian Bedell with Deutsche Bank.\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nMaybe if you could just talk about the FRE margin that stepped up nicely to the close to the 40% level. Jack, just your view on given that we're activating these funds now in July, whether you think you're at a level where you can maintain that FRE margin at that 40% level in the second half here? Obviously, you mentioned getting to 45% at the end of '23.\n\nJon Winkelried -- Chief Executive Officer\n\nYes. Thanks for the question, Brian. Look, I think -- I mean, you guys all have models to understand how our business works. The fact that we accelerated the timing of our first closes on our large flagship funds is meaningful, and that should continue to drive good FRE margin expansion.\n\nYou can never time these things exactly in terms of how our continued investment in people to grow our business coincides relative to the growth of our capital base and the activation of new capital. But now that we've activated those funds that will provide a good bolus to additional management fee growth in the back half of the year. I think that will, to answer your question, allow us to maintain or grow the 40% FRE margin in the back half of the year, again, toward our target as we complete these fundraises.\n\nOperator\n\nOur next question will come from Glenn Schorr with Evercore.\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nSo I heard your comments, I'm clear on the moderate case of monetizations, maybe in the back half, makes complete sense in the market we're looking at. Just curious if you could talk about how much and how long? And I know that's always a weird question, but usually, you have some lag and lead time on when you ink deal. So of moderation in monetization? And I guess it's the same question on deployment, I've never seen so much dry powder as a percentage of AUM before. I don't know if that pace and timing is any different because you're dealing with the same bid- ask in the market, but maybe having a lot of cash on hand might make deployment quicker than monetization.\n\nSo two part, but it's the same question.\n\nJon Winkelried -- Chief Executive Officer\n\nGlenn, it's Jon. Maybe what we'll do is start with monetizations. And I think I'll ask Todd who's here to talk a little bit about pace of monetizations and what we're seeing there, then we'll flip it over to deployment.\n\nTodd Sisitsky -- President and Co-Managing Partner\n\nYes. First of all, thanks, Glenn for the question. we're very cycle aware. And so during this last period, as you know, we were very active on the monetization front.\n\nAnd I think our the relationship between monetizations and new investments for us over the past year or two was one of the highest in the industry. During that time period, a substantial majority of what we did on the monetization front, we're not IPOs, but were sales. And many of those were too strategic. And I think to your point, some of these strategic sales do continue to pay.\n\nSo the dialogues that you have during those periods, they may not be quite as active during this period on as many fronts, but there still is, I think, enacted dial some of our companies and several of our portfolios. And so during periods like this, we see a moderation. And I think it's quite possible to end up slipping to more of a net buyer and we'll talk about the deployment pace in a moment. But the opportunities are still there.\n\nThese companies that we've built over many years, we feel like we had the more strategic, more growth. And that's why we use a high number of companies that end up in strategic cans and those continue to be opportunities in different types of economic cycles. So moderation, yes, the dialogues are ongoing. And frankly, we continue to feel like there's going to be opportunities in the quarters and years ahead on the modernization front.\n\nJon Winkelried -- Chief Executive Officer\n\nAnd, Glenn, I think on deployment, look, I think where we're sitting, and I'm going to want to ask Jim, who is on the call as well to make a couple of comments here as well. But on the deployment pace, your observation about the level of dry powder and ours, in particular, is absolutely right. We've got a tremendous amount of dry powder, which we actually feel great about going into this cycle. We've talked about the sort of good ask spread dynamic in past calls.\n\nWe still see that playing out. We clearly see from -- if you go through my comments in terms of where we actually have deployed capital, we do see the adjustment process continuing. And there's actually, I think, overall, a fair amount of activity, and we really like the sectors and the themes where we've been focused for a while now. We really like what they're looking like and the opportunities that we're starting to see there.\n\nThere's a lot of focus in the market, as you already know, on take private, public to privates. And there's a lot of talk about that. I think that some of that is getting done and some of that will get done. They're not easy deals to get done, but I think they will get done because obviously, there's -- given the public market reset, there's a number of clear opportunities there.\n\nSo we're engaged in some dialogue on deals like that. I think that we do start -- we are starting to see some kind of resetting of expectations in kind of sponsor-to-sponsor related activity. And then given sort of our relative strengths here in terms of, for instance, our impact business. And when I mentioned about the new build, etc., Climate Technologies.\n\nI'm going to turn that over to Jim to just make a comment on that.\n\nJim Coulter -- Co-Founder and Executive Chairman\n\nThe pending bill -- this is Jim, by the way, the pending bill is probably should drive an interesting discussion on investment opportunities in the climate space. Those of you who have followed it know that it's unlike traditional attempts in climate mitigation. Traditional attempts have been adding cash taxes to admitters. This bill is almost 100% incentives.\n\nIt's a carat bill driven to drive investment. And obviously, that serves us well. To give you a sense, there's three things that we're focused on, first of all, in our existing portfolio, probably 60% to 70% of what we've deployed was deployed, assuming these incentives weren't in place and it has a very positive effect on that deployment. But more importantly, repeat, which is someone who scores the bill basically expects this bill to drive $3 trillion of investment in the climate space First one, I think of that is that, that investment is going to happen, you probably have to release double your money.\n\nSo that's a very substantial potential profit pool for investments, and that should open the aperture of deals that will make sense for us given our high hurdle. And lastly, the U.S. tends to drive technological advancement around the world. So driving changes in the U.S.\n\nmarket, I think, is going to increase our aperture globally. So I think not well talked about yet, but interesting is looking forward for deployment in the climate space that should have a very interesting effect.\n\nJack Weingart -- Chief Financial Officer\n\nYes. Just last piece, Jack, why don't you talk a little bit about numbers on real estate. Sure, Glenn, just to give you a little more color on the realization pipeline. I think I mentioned on the last call that we had $125 million or so of realizations that were contractually committed but had not yet closed.\n\nObviously, you saw in the second quarter that we delivered $60 million of actual realizations. And as we sit here today, we still have over $100 million of allocable performance allocations signed but not yet closed. I think Jon's comments were beyond that, our bias at this point is to be selective on monetizations. Given how aggressive we were at selling assets in the past 12 to 18 months.\n\nWe currently have a very young, very interesting portfolio. of companies, and our bias is to work with the management teams to build those build long-term value in that portfolio unless we see very attractive exit opportunities.\n\nOperator\n\nOur next question will come from Michael Cyprys with Morgan Stanley.\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nMaybe just following up on the pending climate bill and the opportunity set that you mentioned. I guess is there anything that you guys need to do in terms of expanding the team or the platform to capitalize on the opportunity set that you see from the pending bill? And maybe you could just elaborate a bit more on that.\n\nJim Coulter -- Co-Founder and Executive Chairman\n\nYes. Michael, it's Jim. We feel good about the progress of building the existing team. As Jon pointed out, deployment in the impact space has been strong this year.\n\nSo I'm not in any way concerned about team over time, I think there are opportunities for either organic or inorganic growth to allow us to expand the types of pools of capital we're deploying in the space. So obviously, our focus right now is on Climate PE, but there are clear adjacencies around that, that we could either organically or inorganically grow into. And I think the climate bill will accelerate LP's views of the exposure they want to build in this area.\n\nOperator\n\nOur next question will come from Robert Lee with KBW.\n\nRobert Lee -- Keefe, Bruyette and Woods -- Analyst\n\nAt the first question would be on kind of your business footprint. Obviously, you have a large growing Asian platform, but you don't talk as much about your EMEA platform. I know it's something you've talked about investing in. Can you maybe just first update us on where that stands and your list of priorities to expand your footprint through Europe and the EMEA region.\n\nAnd then maybe secondly, and I apologize if you went through this earlier, can you update us or just some expense guidance for the year. I mean it came in comp in particular, seemed like really well controlled. But should we still expect that to accelerate at a meaningful pace over the back half of the year?\n\nTodd Sisitsky -- President and Co-Managing Partner\n\nSure. It's Todd. Let me start just on the European front. This is a geography we've been in really since the beginning of the firm.\n\nSo it is important to us. And we've made a lot of progress, I think, in recent years. I think, as Jon mentioned, we just announced a large healthcare deal, [Inaudible]. We have one of the co-heads of the TPG Capital Healthcare platform who works out London with a great team.\n\nAnd so we're really building our pipeline and our presence there. in real estate, which is another of our global strengths. We have a strong presence with a number of partners and senior team members who have had a lot of success both on the investment and then the liquidity front. And so Europe for us, we're continuing to grow.\n\nWe have sort of leaned in, particularly in our strengths. And it also has become an increasingly important place for us from a fundraising perspective. So I can't remember how much trips and weekends and we spent over in Europe personally. We had a dozen team members over for the Supercars conference.\n\nWe have a number of new relationships we've been building across the platforms from a fund reason standpoint in Europe. So it's an important area for us. We are putting a lot of energy against it. We're spending a lot of time as a senior leadership team in Europe trying to continue to grow the business.\n\nAnd fundamentally, we're leading our strengths as a global platform to keep on our European presence.\n\nJack Weingart -- Chief Financial Officer\n\nSure. On the expense front, we're definitely continuing to invest in talent to support the growth of our business. So far this year, we've added over 125 new employees to the firm, and that's been pretty broad-based across investment and services platforms. And to answer your question, we do continue to expect an increase in the comp and benefits expense line through next year.\n\nThe timing of that is always hard to predict based on where we find the right people for the right roles. But through next year, I'd expect continued growth in the comp and benefits line. Opex is up in the high 50s as our business rebounds as we have people back in the office as we're all traveling more. And that's -- I would expect continued growth in that line, but it is at a more moderate pace than the comp and benefits line.\n\nOperator\n\nOur next question will come from Arnaud Giblat with BNP.\n\nArnaud Giblat -- Exane BNP Paribas -- Analyst\n\nCan I ask the question on the change in valuations. I think you took capital down 2.4% over the quarter. If you could split that up for me in terms of the different moving parts of change in valuation multiples, growth in EBITDA and any uplift you had upon exit?\n\nJon Winkelried -- Chief Executive Officer\n\nSure. I would -- I addressed this a little bit in my prepared remarks. But generally, the way I would characterize the way valuations came out on the private equity side is we definitely have aggregate revenue and earnings growth across our portfolio that is exceeding the comparable companies as we look at that metric. So as we look -- we, on average, took our valuation multiples down for the quarter, but that was almost offset by the growth in earnings.\n\nOperator\n\nOur next question comes from Finian O'Shea with Wells Fargo.\n\nFinian OShea -- Wells Fargo Securities -- Analyst\n\nA question on private credit. Do you still have the similar playbook from the onset? Or do you consider starting internally, maybe bringing in a team, for example, and building it out from there?\n\nJack Weingart -- Chief Financial Officer\n\nAlluded to this before in my comments, but we still do have a focus on expanding the platform and unclear. At this point, we are looking -- we are evaluating a couple of different options, including, as I said, acquisitions Aqua Hire, which I think would be sort of consistent with what you're talking about in terms of bringing in a team. So we're -- we remain focused on it and at some point, hopefully, we'll have more to say on it.\n\nOperator\n\nOur next question will come from Rufus Hone on with BMO Capital.\n\nRufus Hone -- BMO Capital Markets -- Analyst\n\nI was hoping to get a little more detail around your fundraising pipeline for 2023. And you had the accelerated closings of some of the larger funds starting to come through this quarter. And you mentioned that, that spills over a little into next year and you have the Asia fund coming up as well. But if you could give us a sense of what new funds you expect to bring to market in 2023, that would be helpful.\n\nJon Winkelried -- Chief Executive Officer\n\nSure. First of all, the current focus continues to be on completing the fundraising campaigns that we've talked about and scaling our existing businesses. In addition to that, and as I mentioned, those campaigns, TPG 9, Healthcare Partners 1, the live fund, the Asia Fund, which we'll talk about our first close this quarter. we'll probably continue to play out over the next 9 to 12 months as we complete those campaigns.\n\nIn addition to that, as we've talked about in prior calls, we are continuing to focus on organic growth through new business creation. And the two areas I'd point to that we're most focused on are secondaries and life sciences. And as we play out the back half of this year, we'll update you on probably initial closes across both of those platforms, which will also by the way, which will also extend into '23.\n\nOperator\n\n[Operator instructions] The next question will come from Brian McKenna with JMP Securities.\n\nBrian McKenna -- JMP Securities -- Analyst\n\nSo I had a question on your Asia business. I know you're in the market for your next flagship fund. But could you talk about some of the longer-term growth opportunities in the region how you see your lineup of products and strategies evolving here over time? And then how should we think about resource allocation as part of the business moving forward?\n\nJack Weingart -- Chief Financial Officer\n\nI mean just important to reemphasize that the flagship fund, obviously, is the base of our business, the core of our business and getting that fund raised and getting that fund raised and completed is our frankly, right now is our real focus. I think that going forward, there are a couple of other areas that we have thought about before that could be interesting I guess I would characterize those as real estate is one of them, which is an area that might be interesting for us going forward, big asset class in the region, obviously, credit is another area that could also be interesting. And I would say, a strategy perhaps that mirrors what we do here in our tech adjacencies fund but perhaps in a slightly broader context of industries and verticals. And what I mean by that is essentially hybrid return type structures that might be at a slightly different return in slightly different return category than our private equity focus in the region might also be a place that we see opportunities.\n\nSo once we get through our fund raise for our core Asia fund, we're going to be thinking about other potential opportunities.\n\nJon Winkelried -- Chief Executive Officer\n\nAnd then your team point, I think we have a very strong and stable team in the region in the capital business and technician business elsewhere. And so we feel like we're building from a really good base. And it's more steady as she goes with some incremental hiring and selective additions, but starting from a really good place.\n\nJim Coulter -- Co-Founder and Executive Chairman\n\nYes. Jon, I would add in that the people tend to focus on our flagship fund and perhaps miss some of the strength of our Asia franchise, given the impact and growth investing is done through our global funds I would note that we probably had the highest profile climate investment in Asia last year with our investment in billion investment in top town motors. Jon mentioned the IPO in India out of our growth platform and the most recent is investment was a Malaysian medical school. So we have a substantial footprint across several of our platforms to grow our products out there.\n\nOperator\n\nOur last question will come from Brian Bedell with Deutsche Bank.\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nGreat. Just wanted to follow up on a question earlier about the potential inorganic expansion on the Impact platform. Just maybe a little bit more color on that in terms of what types of areas? Is it mostly infrastructure that you're thinking? Or some other types of areas that would accelerate that platform? And then also if you can comment just on retail in terms of their take-up of some of the new funds, but both an impact in the Rise 3 also just across the franchise capital and healthcare burners.\n\nJon Winkelried -- Chief Executive Officer\n\nJim, why don't you start with the platform?\n\nJim Coulter -- Co-Founder and Executive Chairman\n\nYes. For impact and particularly, I'll focus on climate for a moment. It's very clear to me that the $150 trillion expected global investing in climate transition is going to spread across traditional asset classes. And just as we saw in technology that assets that started in private equity like data center and tower has eventually move into infrastructure at an accelerated pace.\n\nThe same is going to happen here. It's already happening in renewables and it will happen in a number of other of the themes that we're playing. So from our thematic approach, there's clear opportunities in infrastructure. And as the companies we create in private equity mature, there will be clear opportunities in crossover investing between the public and private market.\n\nAnd finally, if you look at the capital that's been set up for this transition. A lot of it will be in the private credit markets. And I think there's an opportunity to address that entering on a thematic basis as well as entering from a credit perspective. So this is early days in a very large area, and we're making sure that we're considering all of the adjacencies while also being prudent in capital deployment pace.\n\nJack Weingart -- Chief Financial Officer\n\nAnd, Brian, it's Jack. On retail, high net worth, we definitely continue to see longer-term high net worth, a big area of expansion for us. As you know, it's relatively low as a percentage of our investor base today compared to some of our peers because our product set is really self-focused on long-term lockup funds that are really applicable to the highest end of the high net worth segment. We do have active campaigns planned or already underway for all of our products in market today with different channel partners to access high net worth capital.\n\nThat would be true in TPG 9, Healthcare Partners 2, Rise 3, the Asia business, the secondaries business, life sciences, all of those, we have planned multiple engagements with high net worth channel partners. Typically, in a campaign like that, you don't lead with retail, you end up -- you have your initial closes with institutions. So the success we've had in raising capital across all these funds has actually been without much high net worth to date because we're planning those high net worth campaigns to follow the successful institutional closures that we already had. So that's kind of upside from today forward.\n\nIt's definitely the case. There's been a lot of written about this, that more weighted toward the lower end of the high net worth market, that some of the capital has been raised in more in more liquid vehicles with redemption rights. I think you're starting to see that the lower you go down the high net worth market, the more risk off mentality, we're starting to see kick in and high net worth market overall has definitely backed off of their growth at this point. We see that as a near- term issue.\n\nLonger term for us, we still see a lot of opportunity to expand our capital base in the channel.\n\nOperator\n\nThank you. This does conclude the Q&A portion of today's call. And I would like to turn it back over to Mr. Gary Stein for additional or closing remarks.\n\nGary Stein -- Managing Director and Head of Investor Relations\n\nGreat. Thanks, operator. Thanks, everyone, for joining us today. If you have any additional questions, please follow up with me or Ebony.\n\nOtherwise, we'll look forward to speaking with you again next quarter.\n\nJon Winkelried -- Chief Executive Officer\n\nThanks, everyone.\n\nJack Weingart -- Chief Financial Officer\n\nThank you.\n\nJim Coulter -- Co-Founder and Executive Chairman\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGary Stein -- Managing Director and Head of Investor Relations\n\nJon Winkelried -- Chief Executive Officer\n\nJack Weingart -- Chief Financial Officer\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nAlex Blostein -- Goldman Sachs -- Analyst\n\nKen Worthington -- J.P. Morgan -- Analyst\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nGlenn Schorr -- Evercore ISI -- Analyst\n\nTodd Sisitsky -- President and Co-Managing Partner\n\nJim Coulter -- Co-Founder and Executive Chairman\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nRobert Lee -- Keefe, Bruyette and Woods -- Analyst\n\nArnaud Giblat -- Exane BNP Paribas -- Analyst\n\nFinian OShea -- Wells Fargo Securities -- Analyst\n\nRufus Hone -- BMO Capital Markets -- Analyst\n\nBrian McKenna -- JMP Securities -- Analyst\n\nMore TPG analysis\n\nAll earnings call transcripts"
}