{
  "companyName": "McKesson",
  "companyTicker": "MCK",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/mckesson-mck-q2-2023-earnings-call-transcript/",
  "content": "McKesson (MCK)\nQ2 2023 Earnings Call\nNov 01, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to McKesson's second quarter fiscal 2023 earnings conference call. Please be advised that today's conference is being recorded. At this time, I would like to turn the call over to Rachel Rodriguez, VP of investor relations. Please go ahead.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nThank you, operator. Good afternoon and welcome, everyone, to McKesson's second quarter fiscal 2023 earnings call. Today, I'm joined by Brian Tyler, our chief executive officer; and Britt Vitalone, our chief financial officer. Brian will lead off, followed by Britt, and then we will move to a question-and-answer session.\n\nToday's discussion will include forward-looking statements, such as forecasts about McKesson's operations and future results. Please refer to the cautionary statements in today's earnings release and presentation slides available on our website at investor.mckesson.com and to the Risk Factors section of our periodic SEC filings for additional information concerning risk factors that could cause our actual results to materially differ from those in our forward-looking statements. Information about non-GAAP financial measures that we will discuss during this webcast, including a reconciliation of those measures to GAAP results, can be found in today's earnings release and presentation slides. The presentation slides also includes a summary of our results for the quarter and updated guidance assumptions.\n\nWith that, let me turn it over to Brian.\n\nBrian Tyler -- Chief Executive Officer\n\nThanks, Rachel, and thanks to everyone for joining us on the call. Today, McKesson reported another good quarter with total company revenues of $70.2 billion and adjusted earnings per diluted share of $6.06. When excluding the contributions from COVID-19-related items and McKesson Ventures, our adjusted earnings per diluted share increased 11% from the prior year. As a result of our second quarter performance and business outlook, we are raising our guidance range for fiscal 2023 adjusted earnings per diluted share from $23.95 to $24.65 to an updated range of $24.45 to $24.95.\n\nWe're pleased with the financial performance through the first half of our fiscal 2023, driven by continued execution and momentum across the enterprise. Our core distribution businesses have performed well and shown great resilience in navigating the dynamic macro environment we're all operating in. We continue to strengthen our competitive advantage in oncology and biopharma services through both internal investment and acquisition as evidenced by the recent Rx Savings Solutions acquisition and the Sarah Cannon joint venture with HCA. We have established a differentiated position to win in both oncology and biopharma services.\n\nAnd our defined growth strategy, combined with our company vision, is a powerful reflection of how McKesson has transformed into a diversified healthcare services company. Today, I'm going to focus my remarks on our strategy and highlight the significant progress we've been making across our four company priorities. Then I'm going to turn it over to Britt, who's going to go into more detail on the business performance in our second quarter. Let me start where I always start, and that's with our focus on people and culture.\n\nWe firmly believe that having the best talent is essential to our ability to consistently execute and deliver strong operating results. We continue to invest in our people, which allows us to attract and retain talent in a tight labor market. It's important to us that our employees are provided with the support and flexibility they need to thrive both in work and in their personal lives. Around this time last year, we were really excited to announce a new wellness program at McKesson.\n\nWe called it Your Day, Your Way. And we celebrated the second anniversary this past Friday. It was a great pleasure to give our employees a company-sponsored day off to promote their mental, physical, and emotional well-being. We're also committed to diversity, equity, and inclusion in the workplace.\n\nWe have a culture where everyone can bring their true authentic selves to work. In October, I signed the CEO Letter on Disability Inclusion, joining a group of inspiring leaders on creating a more inclusive world. This is an important opportunity for McKesson to demonstrate our values and take actions that support our employees and our communities. Our commitment to diversity is also reflected in our board.\n\nNearly half of our board of directors are women and/or people of color. Recently, Kathleen Wilson-Thompson, one of McKesson's independent directors, was presented with the Distinguished Alumna Award by the DirectWomen Organization, recognizing her contribution to diversity in the boardroom and excellence in board service. We're grateful for Kathleen's leadership and her inspiration. Our second company priority is to drive sustainable growth in our core.\n\nOur business is built on a strong foundation of pharmaceutical and medical distribution assets and capabilities across North America. In the U.S., the steady performance of pharmaceutical distribution underpins the operating results of the U.S. pharmaceutical segment. In the second quarter, segment revenues increased by 12% year over year with growth across multiple customer channels.\n\nWe continue to expand our reach and deliver unique value propositions to all customers. In July, we hosted our annual ideaShare conference that brought together more than 2,100 independent pharmacies. It was a great forum that encouraged knowledge sharing, collaboration, and really deeper connections across our Health Mart pharmacies. McKesson has a long history of supporting and investing in independent pharmacies who have and continue to play such an important role in the health of our communities.\n\nWe're also proud of the work our retail pharmacy chain partners play in improving access to care. In September, we announced an agreement in principle to extend our relationship with CVS Health to distribute pharmaceuticals to mail-order specialty pharmacies, retail pharmacies, and distribution centers. This agreement goes through June 2027. We have been partners with CVS for more than 20 years, and we're extremely pleased to further this long-standing relationship.\n\nIn addition to pharmaceutical distribution, we also have sustainable core distribution assets in the medical-surgical segment. In the second quarter, segment-adjusted operating profit grew 7% when excluding the impact of COVID-19-related items. The solid performance is primarily driven by our scale and reach across the alternate site market. Through years of intentional investment and expansion, the medical-surgical segment has established market-leading positions in the primary care and extended care markets.\n\nFollowing the needs of the patients, we're also expanding our services to other channels, such as government, consumer, and direct-to-home markets. We continue to build out one of the largest, most tenured sales forces in the industry. These seasoned sales professionals help foster trust and strategic relationships and bring us closer to our customers. Also, I want to remind you that while we continue to execute on the European exit, our strategy for our Canadian operations remains unchanged.\n\nThe Canadian business performed well in the second quarter. Aligning with the company's strategy, McKesson Canada is expanding its offering to higher-growth, higher-margin areas, including digital health solutions. Our third company priority is to streamline the portfolio, which includes our continued progress in exiting our business operations in Europe. Today, we announced the completion of the sale to the PHOENIX Group, which includes the operations in France, Italy, Ireland, Portugal, Belgium, and Slovenia.\n\nWe have now successfully exited 11 of the 12 countries in Europe. Norway remains the only country that's not been divested, but we remain committed to exploring strategic alternatives for this business. Streamlining the portfolio is an ongoing process at McKesson. It doesn't end with the European divestitures.\n\nIt's really an ongoing practice for us to continually assess our portfolio for strategic alignment. We have a rigorous evaluation process to ensure that the allocation of resources is optimized to generate shareholder return and support long-term growth for the company. We're also focused on streamlining our businesses internally. We have and will continue to modernize technology, improve levels of automation and simplify business processes.\n\nTaking these actions allows our team to execute with more speed and focus and to make our operational processes less labor-intensive and more efficient to better serve our customers and their patients. Building on the foundation of pharmaceutical and medical distribution, let me now expand on our two growth -- strategic growth areas: the biopharma services and the oncology ecosystem. In the biopharma ecosystem, we have a portfolio of differentiated assets that focus on connecting key stakeholders throughout the patient's journey and reducing prescription hurdles around access, affordability, and adherence. On our last earnings call, we shared with you examples of the affordability solutions within our biopharma ecosystem.\n\nWhile these solutions can help make prescriptions more affordable for patients, McKesson also has a significant offering of adherence-specific capabilities. We have a powerful network of over 4,000 field-based nurses who help patients manage therapies at home. We also have capabilities for in-office provider education through groups of experienced field nurses. Our adherence services help patients navigate complex medical issues and increase adherence by more than 25%.\n\nLeveraging our scaled network and connection to the pharmacies, we continue to explore new solutions and opportunities in the adherence space. To accelerate our growth in biopharma services, we've been assessing strategic opportunities through both internal and external investments. Today, we completed the acquisition of Rx Savings Solutions, which is a benefit insights company that reaches more than 17 million patients. McKesson, in fact, has been a customer of Rx Savings Solutions for more than a year.\n\nAnd as a result, we've seen significant improvements in medication affordability and adherence for our members or employee, as well as significant savings at the enterprise level. Rx Savings Solutions brings a unique portfolio of product and channel access that are complementary to our existing assets. We're excited to leverage our combined resources to create new capabilities around access, affordability, and adherence, as well as new outcome management programs for biopharma and payers. Prescription technology solutions segment has been delivering strong performance in the past year, and we continue to support the growth with investment in talent.\n\nWe usually ramp up staffing to prepare for the anticipated support needed for annual customer programs. In the second quarter, the timing and cadence of hiring has led to a slight year-over-year decline in adjusted operating profit in this segment. Looking ahead to the remainder of fiscal 2023 and beyond, biopharma services remains a large and growing opportunity, and we're confident in our differentiated market position that will help us achieve the long-term growth target laid out for this segment. We're also making good progress within our oncology ecosystem.\n\nOn October 31, we completed the transaction that brings together McKesson's U.S. Oncology Research and HCA's Sarah Cannon Research Institute in a joint venture. The team is energized to work together on integrating the two businesses, and we're excited by this opportunity to advance the next generation of cancer care by increasing patient access to clinical trials in the community setting. As part of the transaction, we also acquired Genospace, a leading innovator in precision medicine and clinical trial matching.\n\nIt will power oncology data and analytics capabilities for the joint venture and bring enhanced solutions to our provider partners. Also within the oncology ecosystem, Ontada, our data and insights business, continues to partner with biopharma companies to advance cancer research. It was recently announced that Ontada formed a new strategic alliance with BeiGene. Together, they will focus on accelerating the development of real-world evidence to improve community education, as well as increase patient access to oncology medicines.\n\nThe oncology ecosystem is expanding and becoming an increasingly important driver for the growth of the U.S. pharmaceutical segment. Our leading market position in community oncology distribution allows us to capture the growing market opportunity, driven by a strong pipeline in drug launches. The U.S.\n\nOncology Network serves approximately 15% of all new cancer patients in the U.S., and we're pleased that the network continues to attract new physicians to expand its reach and impact. The combined effort and progress on our company priorities, our focus on people and culture, on driving sustainable core growth, on streamlining the portfolio, and expanding the oncology and biopharma services ecosystems are the driving force in advancing our growth strategy and generating long-term value for our shareholders. As I review our strategic priorities, I want to make sure I highlight an important part of our enterprise strategy, which is our continued commitment to sustainability and ESG initiatives. As an impact-driven organization, we're dedicated to bringing positive changes to our stakeholders and society.\n\nWhile many impactful projects are happening across the enterprise, our focus has included improving access to healthcare, advancing health equity, and protecting our environment. Two years ago, we created our first-ever global impact organization, bringing all ESG initiatives under a single business function. We're also enhancing the governance structure to ensure visibility and accountability to these important initiatives. With consultation from an executive steering committee and direct oversight from our board of directors, our ESG initiatives are deeply intertwined with how we operate our business, foster our culture, and define our strategy.\n\nBefore I hand it over to Britt, I wanted to make just a few comments on the macroeconomic trends in the general business environment. In the past quarter, we observed stable prescription volumes and patient utilization trends, which were in line with our expectations. While the general economic environment remains quite fluid, the demand for healthcare proves to be fairly resilient and largely unimpacted. And I would say this is similar to what we have observed in past economic cycles.\n\nWe continue to experience cost inflation and some supply chain disruption impacting different parts of our business in different ways. However, through dedicated and well-planned actions, we've been able to manage the impact of these macroeconomic factors. Through the first half of the fiscal year, the financial impact has not been material to McKesson. We continue to monitor the dynamic environment.\n\nAt this time, we do not anticipate any incremental impact in addition to what has already been contemplated in our fiscal 2023 outlook. Let me pull it all together. McKesson reported a solid second quarter of fiscal 2023. Excluding the impact from COVID-19-related items and European divestitures, we're pleased with the momentum in the underlying business.\n\nWe've demonstrated our ability to execute for growth and strategic advancement while navigating a quite dynamic macroeconomic environment. We are confident about our market positions and growth trajectory heading into the second half of the fiscal year. Of course, this isn't possible without a talented team committed to working together in service of our partners and patients. I want to thank all the McKesson employees.\n\nTheir dedication, their hard work, their innovation, their spirit of collaboration are truly transformative and enabling positive impact to our partners, customers, and patients. With that, I'll turn it over to Britt for additional comments.\n\nBritt Vitalone -- Chief Financial Officer\n\nWell, thank you, Brian, and good afternoon, everyone. We're pleased to report solid financial results for our fiscal second quarter, which reflect operating execution and progress against our growth strategies. As a result of our fiscal second quarter operational and financial performance, combined with our strong financial position and outlook for continued execution in the second half, we are narrowing and increasing our full year fiscal 2023 adjusted earnings per diluted share outlook to a range of $24.45 to $24.95. Let me start with a few company updates before reviewing our second quarter results.\n\nDuring the quarter, we made meaningful progress refining and strengthening our portfolio. We completed several key transactions executing against our disciplined capital allocation framework. Let me begin with Europe. As Brian mentioned, on October 31, we completed the sale of certain European operations and other assets with the PHOENIX Group.\n\nWe're pleased that we were able to close this transaction sooner than our original fiscal 2023 guidance. To date, we've successfully exited 11 of the 12 European countries that we operated in, and Norway remains the only country that we have not entered into an agreement to sell, and we continue to explore strategic alternatives to exit Norway. Our European exit activities have created a focused portfolio, streamlined capital allocation, and it positions the company for growth in oncology and biopharma services. Next, I'm pleased to report on substantial progress with respect to our oncology and biopharma services growth strategies.\n\nLet me start with oncology. In June, we announced an agreement to form a joint venture combining McKesson's U.S. Oncology Research and HCA Healthcare's Sarah Cannon Research Institute, including the acquisition of Genospace, Sarah Cannon's personalized medicine platform. On October 31, we closed the transaction and successfully formed the joint venture.\n\nMcKesson has a 51% ownership interest and will consolidate the results of operations within our U.S. pharmaceutical segment, beginning with our fiscal third quarter. This transaction further advances our oncology ecosystem, which contains a broad range of scaled and differentiated assets and capabilities. For fiscal 2023, we anticipate that this transaction will have an immaterial impact on our results.\n\nWe expect the joint venture and the Genospace acquisition to be $0.10 to $0.20 accretive by the end of fiscal 2026 on an adjusted earnings per share basis. Let me next move to biopharma services. In September, we announced an agreement to acquire Rx Savings Solutions, a prescription price transparency and benefit insight company that offers affordability and adherence solutions to health plans and employers. Today, we announced the completion of the acquisition of Rx Savings Solutions, which will be included in our prescription technology solutions segment.\n\nThe addition of Rx Savings Solutions complements our existing biopharma services assets and supports our vision to improve access, affordability, and adherence. We anticipate this transaction will represent a modest headwind to fiscal 2023. We anticipate that Rx Savings Solutions will be $0.50 to $0.60 accretive by the end of fiscal 2026 on an adjusted earnings per share basis. As you've heard me say before and as is the case with all our recent acquisitions, we prioritize the deployment of capital toward growth directly on our stated strategies of oncology and biopharma services in a manner that delivers sound financial returns.\n\nThese transactions represent capital deployment that make both great strategic and great financial sense. Moving to a review of our second quarter fiscal 2023 results. My comments today will refer to our adjusted results on a year-over-year basis, unless I state otherwise. Consolidated revenues of $70.2 billion increased 5%, reflecting growth in the U.S.\n\npharmaceutical segment, partially offset by lower revenues in the international segment, which were a result of our European divestiture activities. Gross profit was $3.1 billion for the quarter, a decrease of 7%. Excluding the impact of our European business operations and completed divestitures, gross profit increased 5%, primarily a result of increased volumes in our U.S. pharmaceutical segment.\n\nOperating expenses in the quarter decreased 11%, largely driven by completed European divestitures in the international segment and lower opioid litigation costs. Operating profit was $1.2 billion, a decrease of 6% due to lapping of prior year equity investment gains within McKesson Ventures portfolio and completed divestitures in the international segment, partially offset by growth in the U.S. pharmaceutical segment. When excluding the impact related to the distribution of COVID-19-related products and net gains and losses associated with McKesson Ventures' equity investments, operating profit increased 6%.\n\nMoving below the line. Interest expense was $55 million in the quarter, an increase of 22%, primarily due to the unfavorable impacts in our derivative portfolio as we exit the European region. These impacts were partially offset by a net reduction of debt year over year. And the effective tax rate was 19.9% for the quarter.\n\nWrapping up our consolidated results. Second quarter diluted weighted average shares outstanding was 144.1 million, a decrease of 8%, resulting from share repurchases in fiscal 2022 and the first half of fiscal 2023. Overall, second quarter adjusted earnings per diluted share was $6.06, a decrease of 1% compared to the prior year. Moving now to our second quarter segment results, which can be found on Slides 7 through 12 and starting with U.S.\n\npharmaceutical. Revenues were $60.1 billion, an increase of 12% year over year, resulting from increased volume of specialty products, including higher volumes from retail national account customers and market growth, which was partially offset by branded-to-generic conversions. Operating profit increased 3% to $756 million, led by growth in the distribution of specialty products to providers and health systems, partially offset by lower demand of COVID-19 vaccine distribution. The contribution from our contract with U.S.\n\ngovernment for COVID-19 vaccine distribution provided a benefit of approximately $0.24 per share in the quarter, compared to $0.28 per share in the second quarter of fiscal 2022. Excluding the impact of COVID-19 vaccine distribution, the U.S. pharmaceutical segment delivered operating profit growth of 5%. In the prescription technology solutions segment, revenues were $1 billion, an increase of 9% year over year, driven by growth in prescription volumes in our third-party logistics business and technology service revenues.\n\nCompared to Q1, revenues were lower due in part to the timing of customer-driven promotional activity recognized in the first quarter in our third-party logistics business. Operating profit decreased 2% to $141 million, driven by higher operating expenses resulting from the timing of increased headcount to support customer annual verification activities, which include hub and patient support programs. Moving now to medical-surgical solutions. Revenues were $2.8 billion, a decrease of 9%, as growth in the primary care business was offset by lower sales for COVID-19 tests year over year.\n\nOperating profit decreased 4% to $307 million, driven by lower sales of COVID-19 tests, partially mitigated by performance within primary care distribution. Within our Primary Care business, we continue to see the effect of a stronger flu season when compared to the prior year. The contribution from COVID-19 tests and our contract with the U.S. government for the kitting, storage, and distribution of ancillary supplies provided a total benefit of approximately $0.33 per share in the quarter, compared to $0.44 per share in the second quarter of fiscal 2022.\n\nExcluding the impact of COVID-related items, the medical-surgical solutions segment delivered operating profit growth of 7%. Next, let me address our international results. Revenues were $6.2 billion and operating profit was $137 million, a decrease of 16%. On an FX-adjusted basis, revenues were $6.9 billion, a decrease of 25% and operating profit was $151 million, a decrease of 7%.\n\nSecond quarter results reflect the year-over-year effect from the divestitures of McKesson's U.K. and Austrian businesses. Moving on to Corporate. Corporate expenses were $144 million, an increase of 73% year over year.\n\nDuring the quarter, we had net losses of $3 million related to equity investments within the McKesson Ventures portfolio, compared to net gains of approximately $97 million in the second quarter of fiscal 2022. As a reminder, the impacts on consolidated results can be influenced by the performance of each individual investment quarter to quarter. As a result, McKesson's investments may result in gains or losses, the timing, and magnitude of which can vary for each investment. The year-over-year impact from our McKesson Ventures portfolio was partially offset by lower opioid-related litigation expenses in the quarter.\n\nWe incurred opioid-related litigation expenses of $9 million in the second quarter, and we anticipate that fiscal 2023 opioid-related litigation expenses will be approximately $50 million. Turning now to our cash position, which can be found on Slide 13. As a reminder, our cash position, working capital metrics, and resulting cash flows can each be impacted by timing and vary from quarter to quarter. We ended the quarter with $2.9 billion in cash and cash equivalents.\n\nDuring the first six months of the fiscal year, we made $222 million of capital expenditures, which include investment in distribution center capacity and automation and investments in technology, data, and analytics to support growth priorities, including our oncology and biopharma services ecosystems. For the first six months of fiscal 2023 and 2022, we had negative free cash flow of $56 million and $109 million, respectively. Year-to-date, we returned $1.6 billion of cash to our shareholders, which included $1.5 billion of share repurchases and $139 million in dividend payments. And we have $5.8 billion remaining on our share repurchase authorization.\n\nLet me turn now to our fiscal 2023 outlook. A full list of our assumptions can be found on Slides 15 through 18 in our supplemental slide presentation. And I'll begin with our consolidated outlook. Our fiscal 2023 guidance assumes 3% to 7% revenue growth and 4% decline to 2% growth for operating profit compared to fiscal 2022.\n\nLet me provide updated guidance for contribution from COVID-19 programs. Our revised guidance includes $1.45 to $1.65 of contribution attributable to the following items: $0.60 to $0.70 related to the U.S. government's vaccine distribution in our U.S. pharmaceutical segment; $1 to $1.10 related to COVID-19 tests and the kitting, storage and distribution of ancillary supplies in our medical-surgical solutions segment; and approximately $0.15 of net losses associated with McKesson Ventures' equity investments.\n\nWe anticipate corporate expenses in the range of $580 million to $620 million, which includes net losses associated with McKesson Ventures' equity investments, which we reported in the first half of the fiscal year. As you've heard me say before, it's difficult to predict when gains and losses on the McKesson Ventures portfolio companies may occur, and therefore, our practice has been and will continue to not include McKesson Ventures portfolio estimates in our guidance. When excluding the impacts related to the U.S. government's centralized COVID-19 vaccine distribution and the kitting, storage, and distribution of ancillary supplies, COVID-19 tests, and net gains or losses associated with McKesson Ventures' equity investments, we anticipate operating profit to increase 4% to 10%.\n\nMoving below the line. We anticipate interest expense to be in the range of $225 million to $235 million. The increase compared to the prior guidance reflects our intent to partially finance the Rx Savings Solutions acquisition with new debt. Our anticipated full year effective tax rate of approximately 18% to 20% remains unchanged.\n\nAnd based on our second quarter results and continued solid operating performance, including the contribution from COVID-19-related items, we are increasing and narrowing our guidance range for fiscal 2023 to a range of $24.45 to $24.95 from the previous range of $23.95 to $24.65. The increased guidance also includes the reduced outlook in our international segment from the earlier-than-expected European closing of the transaction with the PHOENIX Group. Excluding the impacts of COVID-19-related items and net gains and losses from McKesson Ventures' equity investments from both fiscal 2023 guidance and fiscal 2022 results, our fiscal 2023 adjusted earnings guidance indicates approximately 11% to 14% growth over the prior year. This outlook aligns with the previously communicated long-term growth targets, and it demonstrates the commitment to deliver sustainable growth.\n\nMoving now to the segment outlook. We continue to be pleased with the growth we are seeing in the U.S. pharmaceutical segment. The breadth of our services and solutions continue to resonate across retail, health systems, and provider settings.\n\nThe value of our core distribution platform was exemplified by the recent agreement in principle to extend our pharmaceutical distribution partnership with CVS Health through June of 2027. We also anticipate further growth across our oncology ecosystem, including a joint venture between McKesson's U.S. Oncology Research and HCA's Sarah Cannon Research Institute. And we intend to accelerate operating expense investments in the second half of fiscal 2023 to further extend our leadership position in oncology.\n\nOur positive outlook on the growth trajectory of this segment is reflected in our updated ranges. We anticipate reported revenue to increase 12% to 15% and operating profit to increase 3% to 6%. As I outlined earlier, our outlook includes approximately $0.60 to $0.70 related to COVID-19 vaccine distribution to the U.S. government, a result of the previously disclosed contract extension through July of 2023.\n\nWhen excluding the impact of COVID-19 vaccine distribution for the U.S. government, we anticipate 5% to 7% operating profit growth, which is above the long-term growth target. In the prescription technology solutions segment, we anticipate revenue growth of 10% to 16% and operating profit growth of 16% to 22%. We will continue to invest and build capabilities that focus on increasing access, affordability, and adherence solutions for patients.\n\nThe acquisition of Rx Savings Solutions accelerates our capabilities. This segment continues to perform in line with the trajectory assumed in our long-term outlook, and its growth over the last few years reflects the ongoing investment and focus. In the medical-surgical solutions segment, we anticipate reported revenues to decrease 4% to 8% and operating profit to decrease 3% to 6%. As previously mentioned, our outlook includes approximately $1 to $1.10 related to COVID-19 tests and the kitting, storage, and distribution of ancillary supplies for the U.S.\n\ngovernment, which incorporates the contract extension with the U.S. government to January of 2023. Excluding the impact of COVID-19-related items, we anticipate medical-surgical operating profit to increase 11% to 15%. Finally, in the international segment, we anticipate revenues to decline by 42% to 46% and operating profit to decline by 27% to 33%.\n\nThis year-over-year decrease includes the loss of operating profit contribution from businesses and transactions we have closed to date, including the recently closed transaction with the PHOENIX Group. For fiscal 2023, we anticipate our European operations will contribute operating profit of approximately $0.85 to $1 per diluted share primarily in the first nine months of the fiscal year. This includes year-to-date contributions from operations prior to completed sales, our operations in Norway, and contribution related to held-for-sale accounting from the transaction with the PHOENIX Group. We are pleased to have closed the transaction with the PHOENIX Group.\n\nThis transaction closed earlier than we had anticipated, negatively impacting prior operating profit guidance, and is the main driver behind the change in guidance for this segment. Let me conclude my fiscal 2023 outlook remarks with a review of cash flow and capital deployment. In fiscal 2023, our cash flows, including the timing and progression, have been impacted by European divestiture activity and other transactions. For fiscal 2023, we continue to anticipate free cash flow of approximately $3.2 billion to $3.6 billion, which is net of property acquisitions and capitalized software expenses.\n\nOur free cash flow guidance includes approximately $900 million of negative impacts from our European operations and divested assets. our North American businesses continue to generate strong free cash flow. Our capital allocation priorities remain unchanged, and our strong balance sheet affords us the flexibility to pursue multiple capital allocation priorities concurrently. We will continue to prioritize growth, principally in the areas of oncology and biopharma services, as evidenced by our joint venture with the Sarah Cannon Research Institute, the acquisition of Genospace, and the acquisition of Rx Savings Solutions.\n\nWe also remain committed to returning capital to our shareholders. Our outlook incorporates plans to repurchase approximately $3.5 billion of shares in fiscal 2023, which we anticipate will be largely complete by the end of our fiscal third quarter. As a result of the share repurchase activity, we estimate weighted average diluted shares outstanding for fiscal 2023 to be in the range of approximately 142 million to 144 million. In summary, we are pleased with our first half fiscal 2023 performance.\n\nThe strength of our business model, the value of our products and capabilities, and the execution of our proven strategies gives us the confidence and visibility to raise our earnings guidance. We continue to create value for our shareowners through solid growth, cash flow generation, and return of capital. Our strong leadership and the tremendous ongoing commitment of our people across McKesson gives us confidence that we will continue to deliver sustainable results. And with that, I'll turn the call back over to the operator for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Eric Percher with Nephron Research.\n\nEric Percher -- Nephron Research -- Analyst\n\nThank you. A question with respect to the strength in pharma on the op profit line, and I think you differentiated that strength coming from provider and health system versus the national account. Can you give us some sense for what you think is going on with the macro trend if that's continuing to run stronger? How much of this is driven by specialty distribution, specifically? And then do you think that there's an element of investments you made in specialty fiscal year '19 to '21 and/or ongoing investments that are also helping generate above-market trend?\n\nBrian Tyler -- Chief Executive Officer\n\nYeah. Eric, it's Brian. I'll jump in, and then Britt can add any color that he'd like. I mean, first off, just in terms of kind of overall market trends and expectations, I think I'd characterize it as pretty stable.\n\nI think that the volume in terms of prescription transactions that we've been seeing is in line with what we expected at the beginning of the year, probably slightly ahead of where we would have been pre-COVID. I mean, there are parts of the market that are still recovering, but as a general characterization, I would say it's pretty stable and pretty good growth. As it relates to some of the McKesson-specific assets, we've spent the better part of 15 years building up our differentiated capabilities in community distribution with particular strength in oncology. And I think as we look at the growth of the oncology pipeline, we think that that continues to be a strength, certainly supports our growth.\n\nWe have pretty robust value propositions for our community providers and our hospital partners. We think we bring them solutions that help them do their business better. And so I would just say it's probably a combination of all of those things that are supporting our growth. Biosimilars, while still early, has certainly helped support that growth.\n\nAnd we think we're well-positioned to continue to benefit as that trend continues to unfold.\n\nBritt Vitalone -- Chief Financial Officer\n\nHey, Eric. This is Britt. Maybe I'll just make a comment on the investments. We have been investing in this space, and we talked about investments that we were making specifically in Ontada, which has become a really important part of really the breadth of assets and capabilities we have in oncology.\n\nAnd Brian referenced today a strategic alliance that we're forming within Ontada with BeiGene, which is a good example of making investments for future growth. And we're just going to continue to do that and lean into oncology. We think that we have differentiated assets. And really, the breadth of services and capabilities we have from distribution, data, and analytics, our Ontada business, and now with the Sarah Cannon Research joint venture, we feel well-positioned to continue to lean in and make investments there.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\nAnd next is Michael Cherny with Bank of America.\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nGood afternoon, and thanks for taking the question. I would love to dive into the prescription tech solutions segment a bit, if I can. You talked about some of the hiring that you've done relative to supporting customer actions. I guess maybe a two-part question.\n\nOne, is that temporary hiring? Or is that people that are going to be on your payroll going forward? And then two, relative to the updated guidance, you took down revenue growth for the segment by 500 basis points but kept EBIT growth. Can you give us a sense on what the difference is between those two levels and how you're able to generate the sustained EBIT performance despite the slower revenue growth?\n\nBrian Tyler -- Chief Executive Officer\n\nYeah. Sure, Michael. I'll take the first part of that question, and then Britt can take the second part. So relative to the hiring, there is a annual component to some of these programs where we have to reverify patients' eligibility and such.\n\nAnd it is, I guess, you could call it seasonal or a spike, if you will. We don't expect it to be temporary. It's recurring every year. Candidly, as we came into this period with the labor market looking like it was looking, we were probably aggressive in trying to make sure we could secure those resources ahead of time.\n\nAnd frankly, we didn't attrit as much as we'd want. So I think it's a good reflection of McKesson as an employer of choice in the marketplace. But those two things pinched us, but we think we'll work through that over the coming quarters.\n\nBritt Vitalone -- Chief Financial Officer\n\nAs it relates to the question on revenue, as we've talked about previously, a large component of the revenue, at least within this segment, is related to third-party logistics services. And that business can often be lumpy quarter to quarter. And so as we think about the third-party logistics business for the full year, that is really a key driver to the reduction in our revenue. That is lower-margin business, and we've talked about that mix impact in the past.\n\nAnd so as we think about the underlying technology services and programs that we run, the revenue there is still strong and the margins remain quite solid.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\nNext will be Lisa Gill with J.P. Morgan.\n\nLisa Gill -- J.P. Morgan -- Analyst\n\nThanks very much, and good afternoon. I just want to go back to a couple of the comments that you made on the call. One, you talked about stable utilization and demand being resilient. I'm just curious, how are you thinking about the impact of flu? It's been a couple of years since we've had a severe flu season.\n\nThat's expected, at least based on what we've seen in the Southern Hemisphere. And then secondly, when we think about the impact of the CVS renewal, Brian or Britt, one of the things that have stuck out to me over the years is that McKesson never calls out a renewal as being a headwind. But I'm just curious, one, is there any impact that you're absorbing from that renewal? And two, are there any incremental services or anything else that you would call out with the relationship with CVS?\n\nBrian Tyler -- Chief Executive Officer\n\nLet me take those in reverse order. So relative to CVS, we're obviously very pleased to extend what's been a long-standing relationship. It's obviously a big relationship. It's a ton of complexity supporting a customer as sophisticated as CVS.\n\nThe services that we're providing will largely be unchanged. We're still doing the fulfillment for their mail-order pharmacies, for their forward distribution centers, for some of their stores. So that's largely unchanged. In terms of the financials associated, we don't comment on the specific customer financials, as you might expect, for lots of reasons.\n\nBut I will say that we've contemplated the renewal and the guidance that Britt walked you through earlier. And then as it relates to the flu, we are seeing a flu season develop. We expect it will probably be more like a pre-COVID flu season than what we've experienced in the last few years. The impact of flu in general, there's various components, three probably.\n\nThere's the flu vaccines themselves. There's the flu testing and test kits that go around the flu. And then there's any incremental office visits or front-of-store sales associated with cough and cold kinds of medicines. So we're well-positioned against each of those.\n\nThe vaccine component is probably not as important as the flu testing, to be quite candid. But as you know, we are a very capable and scaled distributor of flu vaccines and, frankly, all vaccines. And should the flu season continue to materialize, we think we'll be well-positioned to capture that.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\nAnd next will be Steven Valiquette with Barclays.\n\nSteven Valiquette -- Barclays -- Analyst\n\nGreat. Thanks. Good afternoon, everybody. So you guys normally don't call out very many monthly trends, which I think everybody kind of understands.\n\nBut back at that investor conference in September, you guys did call out that roughly 7% prescription volume growth across your business in fiscal 1Q ending in June, and you mentioned that July was kind of softer versus that trend. So I guess, just to put that to bed, was July just kind of an anomaly? Maybe you could just speak to prescription trends kind of exiting the quarter versus what you saw in that July. If July was just an anomaly, it'd be good just to kind of address that and just put that to bed. Thanks.\n\nBritt Vitalone -- Chief Financial Officer\n\nHi, Steve. This is Britt. Thanks for the question. You are correct.\n\nWe did talk about first quarter prescription volumes on average about 7% year over year. When we talked about prescription trends at Morgan Stanley, we were really giving a flash view, and that flash view was predominantly our view on July, which did end up being pretty much an anomaly. It was the lowest point that we've seen for prescription volume transactions in the first six months of the year. On average, in the second quarter, year over year, total prescription volumes increased about 4.5%.\n\nThat's well within the range that we had in our guidance at the beginning of the year. As I mentioned at the conference, we were still seeing transactions in -- within our guidance. So it still remains within our guidance. And as I talked about, the first quarter was just slightly stronger.\n\nWe were seeing an illness season extend into that first quarter. So 7% on average year over year in the first quarter and the second quarter on average, about 4% to 5%. And July ended up being really the low point that we called out at the conference.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\nNext will be Charles Rhyee with Cowen.\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nYeah. Thanks for taking the question. Just a point of clarity on the med-surg solutions guidance. Just to -- maybe I missed it earlier.\n\nJust -- can you just remind us? You talked about upping the guidance related to the kitting part, the one we look at the -- obviously, top line is better. What were the factors for the decline? Is that just FX-related? Or can you just remind -- maybe I just missed it, I apologize.\n\nBritt Vitalone -- Chief Financial Officer\n\nSo let me just see if I can translate this a little bit. The decline is in our AOP. It's a very modest decline from the previous guidance. We're still showing 11% to 15% growth excluding COVID-related items.\n\nSo that's well above the long-term guidance range that we gave at our investor day. So we feel very comfortable with that. There is no FX that runs through the medical segment. So our guidance still remains very solid.\n\nOur AOP guidance, excluding COVID-related programs, 11% to 15% is still above our long-term targets that we provided you.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\nNext will be Kevin Caliendo with UBS.\n\nKevin Caliendo -- UBS -- Analyst\n\nThanks for taking my question. In the med-surg side, you noted growth in the primary care business. Can you call out like what's happening there? Is that a change in doc visits? Is it you're able to generate more revenue from primary care? Is it a mix issue? Just any more color on what's happening there would be interesting.\n\nBrian Tyler -- Chief Executive Officer\n\nWell, I think it's probably the confluence of all of those things. We talked earlier about the presence of flu in the marketplace for the first time in a while. That certainly helped support the growth there. There's -- the last several years have been quite dynamic, obviously, in terms of missed procedures, electric -- elective procedures, things of that nature.\n\nWhat I would point you to is that the medical business is a very broad business. We have reached into all the alternate site markets. So it's not just physician office narrowly defined. It's urgent care clinics, it's retail pharmacy-based clinics, it's ambulatory surgery centers.\n\nReally anywhere a patient might present in the community to consume medical care, we have reach and support into that customer base. So it's kind of a follow-the-patient kind of strategy. And obviously, as illnesses circulate in the community, that tends to support that business segment.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\nAnd next will be George Hill with Deutsche Bank.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nHey, good evening, guys, and I appreciate you taking the question. I guess I'm going to ask one more on the medical segment. I guess I would expect that we're starting to see a decline in utilization as it relates to PPE, which probably is reflected in the updated guide. I guess could you talk, Brian, a little bit about product categories where you're seeing strength and product categories where you might be seeing weakness? Just probably focusing a little less on site of care but just would like to know which product categories are reflecting positively versus negatively.\n\nBrian Tyler -- Chief Executive Officer\n\nI mean, generally, I would say -- you asked about PPE. I would say, generally, we think that's been pretty stable. Britt, correct me if I'm wrong. I think we're well into the kind of the massive spikes in the presence of COVID.\n\nAnd so I think that that's been relatively stable. I think it's definitely a portfolio of products. I mean, we're supporting pharmaceuticals, we're supporting lab, we're supporting commodity medical supplies. We obviously have a large mature private brand program, which helps underpin and support our growth as we continue to grow and penetrate that.\n\nSo I think it's probably all of those factors, no single factor.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\nAnd next will be Brian Tanquilut with Jefferies.\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nGood afternoon, guys. Britt, just a question on the guidance rate on the vaccine and kitting side. Obviously, there's a lot of discussion about how the uptake in the vaccine is pretty slow. So just curious what your assumptions are that prompted you to raise that guidance for vaccinations.\n\nBritt Vitalone -- Chief Financial Officer\n\nYeah. Thanks for the question. As we've talked about from the beginning, we take our guidance really from the government, and we factor that in both from a vaccine perspective and as how we support the building of ancillary supply kits. And so as we've talked about at the beginning of the year, we anticipated that the volumes for the program would continue to decline versus the prior year.\n\nThat is, in fact, the case. They haven't declined as fast as we had anticipated, but they are down year over year. They are continuing to come down from prior -- from the fourth quarter. And in our guidance for the rest of the year, we anticipate that the second half will actually be lower than the first half.\n\nSo we are seeing that the centralized program is beginning to slow down. And we would expect that as our contracts expire, our medical contract expires in January and the vaccine distribution expires in June, that that will return at that point to the -- not from a centralized program back into a distributor model.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\nAnd next will be A.J. Rice with Credit Suisse.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nThanks. Hi, everyone. Just on your initiative around its access, adherence, and affordability in the biopharma segment, I wonder if you could just walk us through the economic model associated with that. Is it fee-based compensation shared results somehow that you're getting? And then you say the step-up -- you offered the step-up in Rx Savings accretion over the next year is pretty dramatic.\n\nWhat are the milestones to get to that accretion target?\n\nBrian Tyler -- Chief Executive Officer\n\nSo I'll start with kind of the business model. I mean, in our portfolio today, we have a mix of really transaction-based -- think of it as a click every time a transaction goes through. We have more programmatic models, where you pay for a service over a period of time. And then the Rx Savings Solutions model specifically is more of a subscription-type model.\n\nSo we really got a nice mix across the segment, and we're quite pleased with that mix. We're really excited about adding the Rx Savings Solutions to our portfolio. They serve about 17 million patients. It's really on point for access and affordability for patients.\n\nAnd we think there's a high complementarity between some of the programs and services that we offer in the legacy business that we can use to augment the value proposition Rx Savings Solutions has and use their technology and AI and their really analytics to help support some of the legacy McKesson programs as well. So we're super excited about that, of bringing these assets together.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nNext question, please.\n\nOperator\n\nAnd next will be Elizabeth Anderson with Evercore.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nHi, guys. Thanks so much for the question. I appreciate the update you gave us on sort of the pieces -- moving pieces in the prescription technology solutions. Ex what you were talking about in terms of the guidance step-down for the logistics business, can you talk about how sort of some of those other core businesses in that segment are doing in terms of CoverMyMeds or some of the others that we've heard have contributed over time?\n\nBrian Tyler -- Chief Executive Officer\n\nSo I'd say that Britt talked about the mix with 3PL, and I think he rightly characterized that as there's some -- I don't know the word he used, it wasn't volatility. But there is some --\n\nBritt Vitalone -- Chief Financial Officer\n\nLumpiness.\n\nBrian Tyler -- Chief Executive Officer\n\nLumpiness, yes, that's the right way to describe it. There is some lumpiness in that business. When we look at that business, it's really driven in large part by underlying script demand. So we're happy to see growth come back there.\n\nIt's driven by, in some cases, brand launches and our ability to convince brands that the value propositions we have to help them find patients break down the barriers to get those patients started on therapy and then to keep those patients on therapy, we think has a really great ROI. So historically, we've been able to grow our portfolio of brands and relationships and it's multiple, multiple hundreds now. So that's an important component of that business to keep that growing. And now with Rx Savings Solutions, we think we've got a chance to continue to grow the population or the number of people accessing that platform through expanding relationships with payers and expanding relationships with manufacturers to run more sponsored programs.\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nAnd we have time for one more question, please.\n\nOperator\n\nCertainly. That question will come from Erin Wright with Morgan Stanley.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking my question, Britt and Brian. So on the HCA JV, I guess, can you speak to how this positions you in the oncology arena? And can you speak to the financials of the deal? I think from a longer-term perspective, you mentioned some 2026 contributions, but maybe some of the near-term contributions there. And will this help to explain the types of deals that you'll be focused on kind of going forward in terms of partnerships and JVs that are relatively open in terms of that versus outright acquisitions?\n\nBrian Tyler -- Chief Executive Officer\n\nThank you for the question. We're really encouraged by the great feedback we've got from the oncology community broadly, including the biopharma manufacturers who are deep in oncology. We think through the combination of these two clinical research networks and really their underlying data and analytic capabilities that this is going to enable us to bring greater efficiency to the drug development process. And we also think, importantly, it's going to help more cancer patients access newer life-saving medications.\n\nAnd oftentimes, in absence of a JV like this in the community setting, it's hard for people to find out they're eligible for a clinical trial and they might be able to benefit from a trial that's going on. We know the uptake in the community setting is much lower. And so we're really excited when we think about the impact this can have on people's lives and helping get communities that are often underserved communities and get those patients enrolled in these programs. So we think this is about enhancing the quality of care by increasing access to novel treatment options.\n\nWe think it's about helping accelerate the commercial or getting these new exciting oncolytics to market. And we're excited to have a JV and a relationship with HCA around this. I think one of the things that we would signal to everybody is we've got a very clear strategy. There will be times where we're going to invest organically to activate that strategy.\n\nThere will be times where we'll do acquisition to activate that strategy, and there are times where combinations like this become, we think, the most effective way to get at activating our strategy. And so we'll have flexibility. We look at every deal on its own and its own merits in terms of its alignment to our strategy and our financial expectations before we decide to move forward with something. In this case, we feel really excited about the partnership with Sarah Cannon and U.S.\n\nOncology Research Network.\n\nBritt Vitalone -- Chief Financial Officer\n\nThe one other thing maybe that I would add, just as a reminder for this JV, we will have 51% of the earnings of the JV. And so we'll be recording that. The $0.10 to $0.20 accretion that I referenced is related to that 51% ownership that we have, and it's specific to the combination of this JV and the JV's activities. There are probably a number of synergies that are unrelated to this.\n\nThere's a flywheel effect of having it and combining it as part of the overall oncology ecosystem that we're not including at this time. So we'll continue to watch this over time as the JV comes together and forms and some of these synergies really come into play, but we're excited about what it's going to bring to the overall oncology business at McKesson.\n\nBrian Tyler -- Chief Executive Officer\n\nThank you, Britt, and thanks, everyone, for joining our call today. Appreciate the thoughtful questions and your support of McKesson. And thanks to Jenny, our operator, for facilitating the call. McKesson delivered a solid second quarter, really driven by continued momentum in our underlying businesses.\n\nI remain confident in our ability to consistently execute on company priorities and to drive sustainable long-term growth. I want to conclude today's call by once again just acknowledging all the great work of Team McKesson. I want to thank each of you for your dedication and what you do every day to help our customers, partners, and patients. I'm really proud to be a member and the leader of Team McKesson.\n\nThanks again for joining our call. I hope you all have a terrific evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRachel Rodriguez -- Vice President, Investor Relations\n\nBrian Tyler -- Chief Executive Officer\n\nBritt Vitalone -- Chief Financial Officer\n\nEric Percher -- Nephron Research -- Analyst\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nLisa Gill -- J.P. Morgan -- Analyst\n\nSteven Valiquette -- Barclays -- Analyst\n\nCharles Rhyee -- Cowen and Company -- Analyst\n\nKevin Caliendo -- UBS -- Analyst\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nErin Wright -- Morgan Stanley -- Analyst\n\nMore MCK analysis\n\nAll earnings call transcripts"
}