{
  "companyName": "PAR Technology Corporation",
  "companyTicker": "PAR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/par-technology-corporation-par-q2-2022-earnings-ca/",
  "content": "PAR Technology Corporation (PAR 0.04%)\nQ2 2022 Earnings Call\nAug 09, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the 2022 second quarter financial results conference call. [Operator instructions] Please be advised that today's is being recorded. I would now like to hand the conference over to your speaker today.\n\nMr. Chris Byrnes, vice president of business development. Please go ahead.\n\nChris Byrnes -- Vice President, Business Development\n\nThank you, Michelle, and good morning to everyone. I'd also like to welcome you today to the call for PAR's 2022 second quarter financial results review. The complete disclosure of our results can be found in our press release issued this afternoon, as well as in our related Form 8-K furnished to the SEC. To access the press release and the financial details, please see the investor relations and News section of our website at www.\n\npartech.com. I also want to be sure all participants today have access to our Earnings Presentation and Business Review slide deck. Individuals on the webcast should have access to the deck when they logged-on to the call this morning. For those just dialing in on the conference call, the presentation can be accessed on the Investor page of the website and we also included it as an attachment on the 8-K we filed this afternoon as well.\n\nAt this time, I'd like to take care of certain details in regards to the call today. Participants on the call should be aware that we are recording the call and it will be available for playback. If you ask a question, it will be included in both our live conference and any future use of the recording. I'd also like to remind participants that this conference call includes forward-looking statements that reflect PAR management's expectations based on currently available data.\n\nHowever, actual results are subject to future events and uncertainties. The information on this conference call related to projections or other forward-looking statements may be relied upon and subject to the Safe Harbor statement, included in our earnings release this afternoon and in our annual and quarterly filings with the SEC. Joining me on the call today is PAR's CEO and President, Savneet Singh, and Bryan Menar, PAR's chief financial officer. I'd now like to turn the call over to Savneet for the formal remarks portion of the call, which will be followed by general Q&A.\n\nSavneet?\n\nSavneet Singh -- President and Chief Executive Officer\n\nThanks, Christopher, and thanks, everyone, for joining us to review PAR's second quarter 2022 results. During the second quarter we continue to drive growth in our subscription services revenue and saw strong gross margin expansion as we continue to realize the benefits of scale and operational efficiency. The business is performing and the strategy is working. We continue to measure against near-term expectations, while simultaneously making strategic progress against this large opportunity that's in front of us.\n\nAs a company, we delivered a strong second quarter with the reported total Q2 revenues of $85.1 million, a 23.4% increase from one year ago. Our revenue growth was driven across all business lines, specifically around our software recurring revenues, resulting in $98.6 million of total live ARR at quarter end and a year-over-year growth rate of 29% from Q2 last year. This acceleration continue to be driven by a 32% growth in ARR coming from Punchh and a 31% increase coming from Brink. Equally important as we scale is a dramatic improvement we have been able to drive in gross margin on our subscription services revenue.\n\nAt the end of Q2 2022, we've now achieved a 73% gross margin, a significant improvement from the 53% we reported at the end of Q2 of 2020. We expect this positive trajectory to continue to expand over time. This growth has been driven by intense ROI-focused engineering, improved Brink architecture, and economies of scale. Strong results this quarter continue to be driven by a high level of execution across the business and the continued strong demand of PAR's Unified Commerce.\n\nWe've established strong momentum and have continued to build on that throughout the quarter. In Q2, we activated 962 new Brink sites and on that basis, churn Brink active store account now totals over 17,700, a 34% increase from one year ago. Brink bookings totaled nearly 950 stores in the quarter. We expect both metrics, activations and bookings, to increase in the second half of this year as inventory concerns are subsiding alongside strong visibility and a ramp up and go live dates for new customers.\n\nAdditionally, we continue to see ARPU extension of pipeline, which will help the revenue momentum. We continue to see impressive low churn rates for Brink, approximately 4% annualized. This low churn rate shows the trust our customers have in our products and ensures our ability to provide and also capture value for PAR in the long run. Now turning to Punchh, we continue to outperform with Punchh and added more than 3,500 sites in the quarter and now totaled more than 62,300 sites, a 29% increase in the last 12 months.\n\nWe signed 12 new customer logos in Q2 that added to our impressive contracted service list. Punchh further enhanced enhance this impressive list of integration partners with the addition of nine new partners in the quarter. We also added important product features and enhanced enhancements that include campaign management, mobile framework, royalty platform, offers management along with machine learning and AI. Applications like Punchh make it easier for brands to connect with their most loyal customers and increase customer lifetime value.\n\nWe're also beginning to see momentum within the grocery and feed store segment and hope to announce future customer wins later this year. The growth in these emerging verticals is validation the work the team has put in to expand our content in the last couple of years. PAR payment services had another strong quarter and we're extremely excited by the pipeline of customers who have engaged with PAR for our integrated payments services. They're attracted to PAR payments for those competitive pricing, transparent costs, and full integration with Brink and Punchh.\n\nPAR Payments cuts across all PAR customer types and we look forward to sharing more data later this year. Even though still early on in our payments initiative, we've seen notable customer wins during 2022 and believe this revenue stream will be meaningful and an accelerator to our future financial performance, and gives us strong confidence in hitting our 2022 goals. To update you on Data Central, we experienced a solid bounce back in Q2 and saw net new activations of more than 350 stores. As we went live in California Pizza Kitchen and signed a sizable franchise of a notable Tier 1 chain.\n\nI'm encouraged about the opportunity that Data Central has ahead of it because it's a proven solution that solves the biggest challenges the restaurant industry faces today, waiver in food management. For the last two plus years, restaurants have focused tech spend on the front of house with CRM, loyalty, digital, and delivery. Now, the most restaurants have upgraded the front of house tech stack, they're struggling with operational issues and profit leaking out the back door via prudent labor challenges. We've added to our sales staff to take advantage this opportunity, and importantly, have improved the scheduling features of the product and expect to accelerate sales and marketplace around labor solutions.\n\nAs we continue to strive to report meaningful metrics to our fast-growing subscription services revenue, we'll now report 12-month contracted ARR, which is live sites plus site signed with the expectation of going live in the next 12 months, with much of that contracted ARR going live in just the next six months. This number should give investors a more accurate view of our future revenues and is the number I personally track internally. Today, 12-month CARR stands now at $215 million, paving the way for a strong rest of the year and beyond. Our product and hardware revenue continues to perform well in a difficult and challenge environment.\n\nProduct revenues in the quarter continued to strengthen year over year and we reported at 28 -- and we reported $28.4 million in this recently ended quarter, a 19% increase from one year ago. The capital purchase environment for restaurants is always tricky, and this is even -- has been even more so pandemics, inflation pressures, and the global supply chain difficulties. As I mentioned previously, we're not immune to these challenges from supply chain and we've experienced some marginal impact with costs associated with current situation. We continue to monitor the supply chain environment closely and the reality is occurring in Asia, and specifically China in regards to the pandemic and the impact of specific shutdowns.\n\nNow, to briefly report on the government business. PAR government has delivered a strong year over year performance for the second quarter. PAR government is up 17.4% in revenue over the same period last year and has outpaced its Q2 2021 profitability by 48%. Enhanced focus on contract financial performance is resulting in bottom-line acceleration.\n\nOur government segment performed above plan for both revenue and earnings. Our ISR business had a solid quarter, driven by increased demands for recurring -- excuse me, for services resulting in a 28% year-over-year revenue growth and improved contract margins. Our government segments also delivered improved performance from mission systems and product business lines and I'm confident this segment will continue to outperform for the foreseeable future with a solid contract backlog and future award opportunities. Now, to our acquisition.\n\nAs most of you hopefully saw this morning, we announced that we acquired MENU Technologies, a fast growing omni channel ordering solution. The MENU acquisition has a robust e-commerce solution including online ordering kiosk, menu management, delivery, management, dispatch, and much more. MENU now allows parties to consolidate the restaurants' off-premise and on-premise orders into one unified tech stack. This is important to our company.\n\nAlthough small in size, we believe MENU is the best kept secret in the restaurant technology. We worked incredibly hard to win the MENU team over as we think MENU brings a level of product specification we have not seen elsewhere. Our logic in buying the business is simple. First, MENU provides PAR of best-of-breed solution for off-premise ordering.\n\nOur customers have been asking us for an alternative view and we feel we just acquired the modern version of today's incumbent, a product that gives restaurants complete configurations end-to-end commerce in a very special customer-focused culture. This acquisition should help significantly expand PAR's ARPU and potential -- and provide years of potential upsell. In enterprise software, product wins and we think we've acquired the most innovative solution in the market. MENU already has corporate contracts with several of the largest restaurant brands in the industry, extending PAR's leadership in the restaurant tech in the upper echelons of tier 1.\n\nSecond, the MENU acquisition marks PAR's expansion into international markets. MENU is already offering solutions to enterprise restaurants in 25 countries located in North -- Europe, North and South America, and now allows PAR to leverage its brand and reputation to push not only MENU, but other portfolio products internationally. Third, and most important, MENU accelerates PAR's plans to unify the restaurants. Beginning immediately PAR will initiate an effort to unify MENU with within PAR's Unified Commerce solution.\n\nSo brands no longer need to maintain two different systems for on and off-premise ordering. One cloud-based system will manage all transactions, become a true system of record, and allow for extensibility. As innovation accelerates, the number of ordering channels, a unified system allows that channel expansion to function seamlessly, while ensuring uninterrupted operations. Other benefits of adding MENU to PAR include a more seamless experience that puts the customer at the center of every transaction, regardless of the channel they use to order and pay.\n\nThank you acquisition centralizes key functions like MENU management for all systems to a shared model across both commerce and loyalty solutions. It also natively connects a kitchen management system across channels to better manage customer experiences as well as manage demand into the kitchen. The combination will also provide a material reduction in cost for brands, who may be managing multiple systems to offer innovative customer ordering through across channels, while also accelerating innovation for brands as new possibilities are unlocked by Unified Commerce. I certainly hope you're as excited as I am about this addition to PAR and our Unified Commerce offering.\n\nWe diligently thought out the correct partner we needed to acquire, we literally evaluated every player in the space, and our confident that MENU accelerates our path to becoming the world's largest restaurant technology company. I also want to reiterate that we're just getting started as we seek out other transactions of best-in-class companies that we can add to our Unified Commerce offering. Each time we allocate your capital, it's with a purpose to drive long-term shareholder value. I'm incredibly humbled about the work that's happening at PAR.\n\nWe believe our vision of Unified Commerce gives us the opportunity to become a once-in-a-generation company. With our unit economics and technology advantages, we believe we'll win Unified Commerce to key vertical markets. Looking ahead, we have sufficient cash to execute on our strategy. We're prioritizing and making excellent progress on integrating past acquisitions, and ensuring that appropriate controls are in place, while simultaneously making notable progress on our internally developed projects as well.\n\nWe feel confident hitting our 30% to 40% growth targets for the year and while the macro environment could be challenged, we feel real -- we see real reasons to be optimistic at PAR. As always, I'd like to thank all of PAR's employees for their dedication and effort over the past quarter. Across the organization, people have stepped up to ensure we meet the needs of our customers, while at the same time, embracing the changes necessary to create a company for long-term sustainable success. The continue to act as owners of our company.\n\nWith that, I'd like to hand it off to Bryan who will review our financial performance in greater detail.\n\nBryan Menar -- Chief Financial Officer\n\nThank you, Savneet and good morning, everyone. Total revenues were $85.1 million for the three months ended June 30, 2022, an increase of 23.4% compared to the three months ended June 30, 2021 with gross coming from both restaurant retail and government segments. Net loss for the second quarter of 2022 was $18.8 million or $0.70 loss per share compared to the net loss of $10 million, or $0.39 loss per share reported for the same period in 2021. Adjusted net loss for the second quarter of 2022 was $9.8 million or $0.36 loss per share compared to adjusted net loss of $9.2 million or $0.36 loss per share for the same period 2021.\n\nProduct revenue in the quarter was $28.4 million, an increase of $4.5 million, or 18.6% from the $23.9 million reported in the prior year. We continue to see strong hardware sales both with our Tier 1 legacy customers and across our Brink customer base. Service revenue was reported at $35.8 million, an increase of $8.6 million or 31.6% from the $27.2 million report in the prior year, driven by subscription services revenue from our Punchh and Brink offerings. Total subscription services revenue reported in Q2 2022 was $23.4 million compared to $16.5 million in Q2 2021.\n\nThe annual recurring revenue rate of subscription services exiting the quarter was $98.6 million, an increase of 25% compared to Q2 2021, driven by 31% growth in Brink and 32% growth in Punchh. Our recurring revenue base which includes both software-related services and hardware support contracts continues to expand. Of the $35.8 million of service revenue recorded in Q2 2022, $31 million was comprised of recurring revenue contracts as compared to $23 million in Q2 2021. Contract revenue from our government business was $20.9 million, an increase of $3.1 million or 17.4% from the $17.8 million recorded in the second quarter of 2021.\n\nIncrease in contract revenue was driven by $2.4 million or 27% increase in our ISR solutions product line. Contract backlog continues to be significant, noting a total backlog of $184.5 million as of June 30, 2022 compared to $141.2 million backlog as of June 30, 2021. Now, turning to margins. Product margin for the quarter was 14.7% versus 22.8% in Q2 2021.\n\nThe decreased margin was primarily driven by a $1.5 million charge for access and obsolete inventory. Product margin excluding the excess and absolute charge was 20% for Q2 2022. We are keenly focused on product delivery in a supply challenged market, but we continue to improve processes to efficiency -- efficiently balanced customer demand and more modest inventory levels. We continue to also monitor our pricing to properly reflect changes in a dynamic and cost environment.\n\nService margin for the quarter was 40.9% compared to 30.3% reported in the second quarter of 2021. The substantial margin improvement over multiple periods continues to be driven by improvements in hosting and support services costs and a higher mix of SaaS software. Service margin during the three months ended June 30, 2022, included $5.4 million of amortization of identifiable intangible assets compared to $5 million during the three months ended June 30, 2021. Excluding the amortization of intangible assets, total service monitored for the three months ended June 30, 2022, was 55.6%, an increase of 49.2% for three months ended June 30, 2021.\n\nGovernment contract margins were 11.1% as compared to 7.9% for the second quarter of 2021. The increase was driven by higher margin mission systems contracts and lower corporate expenses across all product lines. In regards to operating expenses, GAAP SG&A was $26.4 million, an increase of $3.5 million from the $22.9 million recorded in Q2 2021. The increase was primarily driven by $1.9 million in sales and marketing expenses, $1 million and internal technology infrastructure costs and $0.6 million increase in corporate management.\n\nNet R&D was $10.1 million, an increase of $1.5 million from $8.6 recorded in Q2 2021 as we increased spending across our software product development organization. Net interest expense was $2.5 million compared to $4.9 million recorded in Q2 2021. The decrease is driven by the refinancing of the LROC loan with the issuance of the 2027 notes in September 2021 and the reduction of attrition resulting from January 1, 2022, adoption of a recent accounting pronouncements. Now, to provide information on the company's cash flow and balance sheet position.\n\nFor the six months ended June 30, 2022, cash used in operating activities was $31.6 million versus $33.1 million for the prior year. Cash used for the six months ended June 30, 2022 was primarily driven by additional net working capital requirements due to $11.6 million increase in accounts receivable related to our government segment and a $7 million increase in inventory. These increases will be temporary as we expect the counts receivable and inventories revert back closer to December 31, 2021 levels during the second half of 2022. Cash used in investing activities was $5 million for the six months ended June 30, 2022 versus $381.7 million for the six months ended June 30, 2021.\n\nInvesting activities during the six months ended June 30, 2022 included $1.2 million of cash consideration for the Q1 2022 drive-thru tuck acquisition. Capitalized software for developed technology costs for the six months ended June 30, 2022, was $3.2 million versus $3.8 million for the six months ended June 30, 2022. Cash used in financing activities was $1.8 million for the six months ended June 30, 2022, versus $319.3 million for the prior year. Financing activities for 2022 was driven by stock-based compensation related transactions, while 2021 activities included financing related to the Punchh acquisition.\n\nDay sales outstanding decreased within the restaurant retail segment from 58 days at December 31, 2021 to 47 days at June 30, 2022. Day sales outstanding increased within the government segment from 55 days at December 31 to 89 days at June 30, 2022. The interim increase is expected to be reduced to normalize levels during the third quarter. This concludes my formal remarks and we'll move to Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from Mayank Tandon with Needham. Your line is now open.\n\nMayank Tandon -- Needham and Company -- Analyst\n\nThank you. Good morning. Congrats on the quarter. Savneet, you shared a lot of information on the acquisition, but just to clarify, maybe I missed this, how much did you pay for the acquisition? I'm pretty sure any financial metrics in terms of ARR growth and revenue contribution, and how that should flow through the balance of 2022 into 2023?\n\nBryan Menar -- Chief Financial Officer\n\nYeah. So in regards to the acquisition costs, we'll see this also as a subsequent event in our 10-Q filing later on today, the base investment was $25 million comprised a mix of both cash and equity. And there is an earn out that's linked to that, it's also primarily driven by ARR growth over the next 24 months.\n\nSavneet Singh -- President and Chief Executive Officer\n\nAnd as far as revenue expectations, it's de minimis now, but with a very strong ramp expected over the next 12 months here. What's amazing about MENU, as I mentioned, we really do think it's the best kept secret in restaurant technology, they've signed meaningful contracts with some of the largest restaurant brands internationally. And right -- that sort of point where they're taking contracted revenue live. So it'll be small this year, and we expect to accelerate meaningful in the out years with pretty decent visibility.\n\nMayank Tandon -- Needham and Company -- Analyst\n\nUnderstood. And then in terms of the contracted ARR, that's a very helpful metric. But could you just provide any framework in terms of how you're thinking about the back half of the year, given all the concerns around the recession or economic slowdown? Have you seen any slowdown in decision making from your customers and prospects? Doesn't sound like it, but we'd love to get any sort of thought process around your expectations for the back half of the year especially?\n\nSavneet Singh -- President and Chief Executive Officer\n\nYeah. In the beginning of the year, we sort of guided to 30% to 40% ARR growth and we still feel really confident about that and we think the next couple of quarters will actually be faster growth than the last quarter if the world pulls out. Now a lot of that we feel is being driven by our Brink initiative with payments, where we're seeing really strong adoption and that adaption, we haven't seen an ounce of customer pushback as relates to the macro environment or anything macro-related, we haven't really seen that change. The pipeline is in fact expanding, not contracting and that gives us some good confidence.\n\nIn our other parts of our business, we expect to see a slowdown in hardware revenues in the back half of the year and while we haven't really seen it yet, that's just an expectation that as rates go up and as the economy slows, franchisees of the large Tier 1 chains, who are hardware-only customers will probably pull back. So we're getting ready for that. We're not seeing that in an aggressive way, yet we've seen small signs of it here and there. But that's where we would expect to see a slowdown.\n\nOur contract ARRs that I put out there, I think it's a very good guide, we expect to turn most of that live in the next six months, which is why we put that metric out there is what I tracked internally. So that's a good guide for us sort of on the ARR side. But to your question where we -- if the economy slows down significantly, we will see that impacting our hardware business.\n\nMayank Tandon -- Needham and Company -- Analyst\n\nGreat. Thanks for that color. I'll get back in queue. Thank you.\n\nOperator\n\nPlease stand by for the next question. Our next question comes from Stephen Sheldon with William Blair. Your line is now open.\n\nStephen Sheldon -- William Blair and Company -- Analyst\n\nHey, thanks. I wanted to also ask about the ARR. I guess, specifically, great to see that that contracted ARR number. I think that all goes live, I think that would imply about 30% ARR growth.\n\nBut is what you're also seeing on the pipeline side -- is there is what you're seeing in the pipeline, also giving you some confidence about that 30% to 40% ARR growth number? Just any detail on the pipeline across different businesses?\n\nSavneet Singh -- President and Chief Executive Officer\n\nYeah, absolutely. And I'll go one by one, so you have some color. So the short answer is we think we'll hit that numbers as I mentioned. Again economy could turn and if it change, we feel pretty good about it now.\n\nProduct by product, the hardware business, pipeline is hard, because it's a very short sort of window and customers will change quickly. So I think we see orders come in, we always had a good quarter. But we expect the version of pipeline there to contract in the event the economy slows down. On the Brink and payment side, we feel -- we see strong pipeline of go lives happening and we've got pretty good visibility into that for the next six months.\n\nAnd we are in the process with a couple of large accounts that will set us up nicely for the following year. But today, pipeline seems as strong as it needs to be for us to hit those goals. I don't think it's a reach for us to hit those goals, otherwise we wouldn't say it. So we feel pretty decent about the Brink pipeline.\n\nBut that will be the key for the second half, can we expand that pipeline so that 2023 is successful year? 2022, we feel confident. There's not a lot we can do in 2022 to dramatically impact 2022, but it has tremendous impact on 2023. On the Punchh side, pretty much everything we have contracted or booked to-date is all that we have -- is all execute in the second half. So any business that we signed in the second half of the year, as relates to our Punchh product, will probably go live in 2023.\n\nNow, that's excluding upsells and cross-sells. So we have really strong visibility into Punchh for the remaining six months as relates to its LA. And so everything we signed for the next six months will be real CARR for the following year. So short answer is Punchh, we have very strong visibility from now to the end of the year of where we think revenue will go because that revenue has been booked and is planned to rolled out the second half of the year.\n\nPayments is a business that can impact 2022 immediately. It does not have a long go lifecycle as most of these customers are already on Brink. And that's where we have probably -- not probably without question, our strongest pipeline. Demand for payments is accelerating ahead of our expectations.\n\nAnd as hardware supply chains weaken and should help us -- Brink payment devices, which is our limiting factor in terms of revenue live at the moment. So payments, the pipeline is very, very strong and I'd argue if the economy weakens, that business will get stronger and stronger because the net cost savings to our customers. And so that's an easy switch for CFOs and CIOs to make. And lastly, on Data Central, the bar is low here.\n\nSo short answer, we feel momentum. We've got a great leader there in Marcus Wasdin who often says we've got strong but fragile momentum. And I think we'll see that continue to grow. We're in a couple of processes we feel very confident about.\n\nAnd so Data Central, I think the pipeline is very strong. So in short, I think because our businesses are contracted, they're longer sales cycles. The rest of the year is very much executing on what's been signed this year, outside of payments and in parts of Brink. So we have very good visibility this year and so from here till the end of the year, it's very much going to be what impacts 2023.\n\nStephen Sheldon -- William Blair and Company -- Analyst\n\nGot it. That's incredibly helpful. Maybe shifting to the MENU acquisition, that was great to see and clearly a lot to dig into there. But can you give some more background there between their focus on SMB versus enterprise? And then how aggressively do you plan to take this out as an option to your current U.S.\n\nenterprise customer base as an alternative to the other online ordering solution they try to partner with.\n\nSavneet Singh -- President and Chief Executive Officer\n\nSo PAR is an open solution and will always be supported with every single restaurant technology company. We sort of look at the company's incumbents when it comes to the past, and they become sort of toll keepers, that kind of stifle innovation, we want to be the opposite of that. And so we're not going to have any impact on any of our partners. Specific to your question, your priority one, two, and three, within that acquisition is taking live the revenue that that MENU has already contracted.\n\nMENU isn't -- is truly a special set of products. I probably met 100 different digital ordering companies, kiosk companies and it's hands -- far and away the best product we've seen. And when I say that, it's not a single product, it's an online ordering product. It's a mobile product, it's a loyalty product, it's a kiosk product, it's a dispatch product, it's a rails product, it's truly incredible what they built, and it's 100% built for the enterprise.\n\nAnd that's really where it aligns with what PAR's building. And so we don't -- it's not taking an SMB product and make enterprise, it's already an enterprise product. And so our goal with MENU is to take live the revenue that they've worked very hard on the last few years, and helping them take that live. And that is predominantly in international markets, the 25 markets that I spoke about in the call.\n\nBut of course, we see tremendous opportunity in bringing their products to the United States. We've been sort of pounded on by our customers to find alternatives to what they have today. And so we expect to eventually bring to United States and into a unified solution. And we've got pilots with a couple of our existing customers today and so we're not waiting on that.\n\nBut I'd say priority one is taking live revenue that's already been contracted and priority two will be bringing it to United States and bundling into our Unified Commerce solution, which is the real reason we acquired it. And so over time, I suspect the U.S. to be a huge in probably the biggest market for MENU, but today, we've got to take live the revenue that's been contracted. And again, it is -- like I said, it's just an incredible product that we're really, really excited about.\n\nStephen Sheldon -- William Blair and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nPlease stand by for the next question. Our next question comes from Jim Masago with FactSet. Your line is now open. Next question comes from Jim Masago with FactSet.\n\nYour line is now open. Please stand by for our next question. The next question comes from Samad Samana with Jefferies. Your line is now open.\n\nSamad Samana -- Jefferies -- Analyst\n\nHey, good morning, Savneet and Bryan. Hope you guys are doing well. A few questions for me. I guess I just wanted to first make sure.\n\nSo Contract ARR in last quarter's presentation was at -- it was above $116 million, that's one $115 million in 2Q. I'm curious why it was down $1 million quarter over quarter? Was there a change in either what you're including in that? Or just maybe help me understand that. And then I have a couple of follow-up questions.\n\nSavneet Singh -- President and Chief Executive Officer\n\nSure. Yeah, we mentioned on the call, it's definitely not down. What we did was to give you better visibility, we put we changed the definition of Contracted ARR to be just the next 12 months with -- and most of that next 12 months CARR is the next six months. And so we think that gives you a lot more visibility.\n\nIt's a number that I track, which is what's the revenue we've contracted that's going to go live in the next 12 months. And again, most of it will go live in the next six months.\n\nSamad Samana -- Jefferies -- Analyst\n\nGot you. I apologize. I must have missed that part. OK, that's helpful.\n\nAnd then I guess just as I think about Punchh, it's still growing above the overall ARR growth, but I guess I am curious, if I think back to when you guys acquired it, it was growing well, north of the mid-40s this quarter. I know it's a tough comp, but you're talking about growth decelerating to the low 30s. I'm just curious is it -- what's -- it just changes that are going on in the sales organization or sales cycles getting longer there, maybe what's driving some of that slowdown in that Punchh ARR growth?\n\nSavneet Singh -- President and Chief Executive Officer\n\nYeah. And just one question, when we bought the business, it had grown about 30% year-over-year from the prior year and then it obviously started a lot with our go live motion plus, the cross sell, upsell. I think it's just scale, right? We're still adding huge amounts of ARR every quarter and every year. And so as we scale, I think that growth rate will sort of stabilize.\n\nAnd as you've heard me say, we want to maintain that 30% to 40% growth rate. And so now, it's continuing to take that product internationally, leveraging the MENU acquisition, and new product upsell. So we believe will continue to grow the Punchh business 30% to 40%. I think when we were growing, 45%, that was a moment in time where we had just incredible cross-sell opportunities through the Brink acquisition, but we think it'll stabilize around this rate as we do.\n\nWe sort of think for all of our products will sort of be in that 30% to 40% range.\n\nBryan Menar -- Chief Financial Officer\n\nAnd we're seeing good movement now in adjacency. Marcus was with grocer and also with convenience, especially with that product.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. And then maybe just one last one for me. Just any update on maybe what the new Brink ARR trends are in terms of ARPU per site, are you seeing better pricing? Are you seeing similar pricing to what you've seen maybe over the last two or three quarters? Just anything that you can see that gives us an idea of maybe what the size and scale of the deals you're landing and the price you're able to retain even as you do that?\n\nSavneet Singh -- President and Chief Executive Officer\n\nThanks for asking that question, because it's I wish I extended more. So the short answer is we've been taking live a lot of sites that were contracted -- this is going to sound crazy to you, in 2016 and not as weighted down the ARPU. The average ARPU of Brink for signed contracts over the last 12 months has been significantly higher than the contracts signed, obviously, in 2016. And so in the second half, we should benefit from that momentum of the signed deals, and a lot for us to expand revenue growth within the Brink product line.\n\nSo you'll see a reversal starting slowly, but will really pick up and in 2023, we'll have a lot of benefit of taking live the contracts that we've put out there. Brink with prices is up considerably just in the last 12 months. And then, as we've found ways to monetize things like APIs and additional product modules, it'll continue to grow. So we'll see a reversal of that trend.\n\nUnfortunately, the revenue that goes live, we put in line is oftentimes older contracts that we -- they're a great sign that we've now taken live revenue that was contracted years ago. And that was stuck because of whether management or product issues. But we've been unfortunate getting the benefit of all these sites and I think that will reverse now.\n\nSamad Samana -- Jefferies -- Analyst\n\nGreat. Thanks for taking my questions.\n\nOperator\n\nPlease stand by for the next question. Our next question comes from on Anja Soderstrom with Sidoti. Your line is now open.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nHi and thank you for taking my questions. A lot of good questions asked already. I'm just curious, how did you come about with a MENU Technology acquisition? And how long have you worked on it and why now?\n\nSavneet Singh -- President and Chief Executive Officer\n\nSo we've been spending a lot of time on this idea of Unified Commerce and Unified Commerce doesn't work unless you can bring together off-premise and on-premise orders. Off-premise are things like online orders, mobile orders, everything is not in the store. And we haven't obviously had a solution for that. And -- so we spent, I'd say, two years looking for a product -- really a year and a half, but let's call it two years, to find a product that will work for us.\n\nThe great challenge in in that market, though, is that most people focus on the SMB market. And while they're a great companies, they're growing very quickly. It's incredibly hard to take an SMB product and make it enterprise, particularly in restaurants. And so we really did scour the world trying to find the best product.\n\nAs I said in my remarks, in the end, you can have the best marketing, the best sales team, the most savvy management team, but product wins and we needed to find the best product. And so we discovered MENU, I want to say, nine months, a year ago, and candidly, we didn't believe what we saw, we'd never seen a product that -- a company has so much product that was still relatively young in its maturity. And so we took a long time to give to become part of PAR. And during that time, we developed the immense appreciation for not only the product suite, but just the obsession they have over making customers happy, something we can continue to learn from at PAR.\n\nAnd so while it's a small acquisition, it's one that our entire team has rallied behind been a huge part of and you'll see us continue to grow. And what's exciting about it is this wasn't our intent when we went on the journey, but it now give us international foothold that will continue to expand and we'll start by pushing Punchh aggressively internationally, but eventually all of our products and so we love that it fills the product gap that we needed which was sort of off premise ordering. But it also brings us internationally, which is an area that we want to expand to as well as there isn't a really dominant enterprise player nationally. And then the sort of final benefit is they've got contract signed, we're not -- this is not -- when they go to the next large customer, it's not going to be a new experience, they sort of know that.\n\nThey know the RFP process. They know the testing process, security process and everything in between. So I think we'll be very excited what we discovered.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nOK. And you're also benefiting from the stronger dollar, I guess, when you acquired it.\n\nSavneet Singh -- President and Chief Executive Officer\n\nI think so. Maybe it was part stock, part cash. So we did benefits on, and but I think they're the key of the acquisition for the MENU team will be their ability to grow the ARR efficiently, and hit some of the earn-out targets that we put out something which will be in our subsequent events filing, which you'll see. And so I think to them, the motivation is to drive that earn-out.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nOK. And how do you see in general, that M&A environment now and what does that mean for you government's business potential spin off?\n\nSavneet Singh -- President and Chief Executive Officer\n\nSo I think we are -- this is our second quarter where we've printed revenue from our new contract that's driving a lot of the growth that you see. As we continue to see that and the margin expansion, we'll constantly explore the opportunities that that exists for that business. Given the growth, given the margin expansion, it's a business that should get a good multiple at any event that our board decides to monetize it.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nOK. And then, lastly, just in terms of the -- sort of the uncertain economy, has their customers tend to mess with sort of sales cycle being affected, if at all, by what's going on in the economy now for you?\n\nSavneet Singh -- President and Chief Executive Officer\n\nToday, we're not seeing tremendous change. As I mentioned in the call, we expect to see it in our Harvard Business. And I think what would potentially see it, in other parts of our business, but we're not, it's one of those things where we talked about it with our customers, but we're not seeing that elongation of sales cycles quite yet. But without question, it can and should happen.\n\nAnd we're, if it does happen, I think it'll be more of a 2023 issue as 2022 is very much, being booked now. So it's something that, I think if it happens, it will be ready for it. And we're taking precautions, slowing down hiring, focusing on price being more efficient. But today, it's -- I would say, we continue to be surprised by that the revenue is going live.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nOK. And actually, one more last one. And in terms of our Unified Solution, when you added the MENU acquisition, is they like to have a hit list of potential customers that you think are going to be more prone to signing on now when you have an even more robust solutions?\n\nSavneet Singh -- President and Chief Executive Officer\n\nOf course, I think, first and foremost, as we integrate the MENU product into card, it will make us more attractive of our existing products, those customers that are in sales cycles for just brand or just Punchh, or data central should find us more attractive, because we can unify their on-premise, off-premise to the back office. That is a really attractive proposition. And so, illustratively, if we're in a process, and let's just say Brink is in second place, not first place, this should help us push that over the finish line. And so I think it'll just naturally bring more revenue forward on our existing products.\n\nThe second part, your question, the MENU product is very well focused on the enterprise customer. It's not a product for the single store restaurant. It's a product for global international brands that want an alternative to the income that exists today. And we're highly focused on being scalable, completely configurable, and really giving control back to the restaurant.\n\nToday, I think if you talk to restaurant companies, they're happy what they have, but they're not blown away, and particularly disability to be configurable and integrated such that the kitchen is a smart Italian ordering system, and they're speaking the same language, and none of that exists today. And MENU gives them that opportunity now.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nOK. Great, thank you. That was helpful for me.\n\nOperator\n\n[Operator instructions] The next question comes from Adam Wyden with ADW Capital. Your line is now open.\n\nAdam Wyden -- ADW Capital Partners -- Analyst\n\nHey, guys. Couple questions for me. I just wanted to clarify your contract and AR definition, so that doesn't include that doesn't include payments correct. And you made another comment around Brink that it doesn't include all of Brink, so it's largely Punchh is that out, right? Like, can you -- can you kind of clarify what's in there and what's not?\n\nSavneet Singh -- President and Chief Executive Officer\n\nSure. So the majority of the delta between the live revenue and contract revenue is Punchh, a small portion of it is Brink. And that's because we don't put anything in contract revenue from Brink unless it's a signed order for that store. So as an example, that we signed a big chain today, none of that goes to contract revenue until we have visibility into that revenue coming in the next 12 months.\n\nAnd so what we've done is just made it very specific is cars, that revenue that we have visibility into the next 12 months. And so it's predominantly Punchh with a portion of a Brink -- a small portion of payments.\n\nAdam Wyden -- ADW Capital Partners -- Analyst\n\nRight. And that wouldn't -- that wouldn't include potential price increases, it wouldn't include. I mean, it basically is very light on Brink as it relates to, new live activation doesn't include pricing doesn't include payments in any material amount of that not a fair way to describe it?\n\nSavneet Singh -- President and Chief Executive Officer\n\nThat's right\n\nAdam Wyden -- ADW Capital Partners -- Analyst\n\nThat's great. So so in a perfect world, there if the economy kind of keeps together, we should there could be could be upside to that?\n\nSavneet Singh -- President and Chief Executive Officer\n\nAbsolutely. As I said, I track this number very closely internally, because I know we'll hit it. And now it's about how do we get above that.\n\nAdam Wyden -- ADW Capital Partners -- Analyst\n\nRight. So I've got two questions. The first one is more qualitative. So if you think about the journey, and I've been on the journey a long time, now, you started getting momentum, and then COVID hit, and you had your first kind of like, 1,500 Brink, live units activation, we're going to call it.\n\nAnd then, roll what the hell in a hand basket. And I think everybody woke up. And, because of the nature of getting into the stores, it made it very harder, hard to activate Brink, even though everyone knew that they needed, kind of off premise digital, then you now you have a supply chain and the inflation. I mean, do you think people are kind of up to this and saying it's almost kind of like a perfect storm in terms of like, the necessity? I mean, at what point do you think, the enterprise -- the customers say, kind of, like, yes, I get it, it's inflationary.\n\nBut like, when costs are up, but like, we're going to bite the bullet and make some investments to reduce that. I mean, I get a payment is easy, because it reduces the cost day one. But I mean, for all intents and purposes, a lot of the stuff that you're doing, does reduce cost day one that you just need, they just need to see it in a model in a workforce. I mean, do you think people kind of look at the last two years and say, what, like, I can't control revenues, but I can't spend a little bit of money up front and get a big return.\n\nI mean, it, it's kind of, because it's like, this is like, these are the ideal conditions for your business.\n\nSavneet Singh -- President and Chief Executive Officer\n\nI think you're right, this strong -- sort of is, we've become very good at sort of selling the ROI of our solution. One of our leaders, I think, has done a tremendous job in -- in showing the customers, here's what happens when you install Brink just happens when you install Brink with another module apart. And that ROI is definable. It's real.\n\nIt's real math. And it's not sort of fluffy stuff. It's actual data that we have. And I think that's how exactly how we felt, and said, I think the last year and the next couple of years are very strong environments for us to continue to see this growth that we see now.\n\nSo I don't think we're at a point where enterprises don't get that value today. It's just about convincing them to go faster. It's not a market where, we're losing tons of businesses, competitors, and keeping up. It's a business where, when the customer goes, we go, and we feel we've got a strong probability of winning that deal.\n\nAnd so it's just about building up momentum in this environment and could potentially help accelerate that with these customers, push them over the edge.\n\nAdam Wyden -- ADW Capital Partners -- Analyst\n\nGood. And then my last question is around M&A. I'm not sure if you called out what the ARR contribution is for MENU or what you'd expect it to do. But, obviously, we're in this kind of logjam, where private companies are in general, or at least historically traded at higher multiples of ARR, relative to the public comps you've seen, Vista and Thoma Bravo, you saw Avalara last week.\n\nCompanies are out there buying, I mean, just to use Avalara as an example, I think they paid 11 times ARR, 12 times or something, when you do fully diluted and options, blah, blah, blah. And, that business was probably later in its maturity and had -- it's probably a lower similar growth rate to kind of Brink in all the rest. And so, I look at, par today, and I think it's, obviously it's definitely material undervalued to that. But, the question is, is when you look at private equity, they are taking advantage of what I would call the $30 million, $40 million of kind of cost of being public, not just the New York Stock Exchange listing costs, not just the comptroller CEO, CFO, blah, blah, blah, but also just kind of the systems in place and we've kind of benchmarked it and for a company of the scale, we think it could be $20mi, $30 million, $40 million of kind of duplicative costs.And there are obviously some public company players like Agilisys, like, Olo, like Transact Technologies, There are companies out there that might not have the same valuations as the private markets, where you could effectively do a transformational deal like Punchh in the public markets and kind of, get that scale and duplicative cost and kind of, synergy value.\n\nI mean how do you think about kind of going after companies like that or in the absence of private market deals that makes sense, kind of, doing something in the public markets, where you can, kind of, take advantage of the dislocation there.\n\nSavneet Singh -- President and Chief Executive Officer\n\nI think that the macro of your common is very true, which is -- if I look at our acquisition, when the numbers get printed in 18 months, and now call it end of 2022, I think it'll be a homerun deal for PAR. And I take great pride. And I think that the Punchh acquisition, not only beat expectations, but was incredibly accretive to PAR shareholder, I suspect this deal will be as well. And so we start from there.\n\nThis -- the business -- the model has to work. And today's environment provides opportunity. If we had tried to acquire MENU, a year ago and -- we did, it would have been a very different price and been very, very hard to work. And so we feel that we can be the aggressor today, we've stepped up to a really high quality M&A team now that uncovering rock after rock.\n\nAs I said, MENU was the best kept secret, it's a business that -- I don't know if many people realize that was out there. And so we want to use this environment to be aggressive and if there's a larger asset out there that we can make work and put our playbook in to work in that organization and that play with being dive gross margin so that we can reinvest in product. Well -- but it's -- these are oftentimes opportunistic approaches where you've got to find the right asset that serves the same end market that wants to sell. And obviously, if just want to sell, we'll work very hard to convince them to sell, but that can take some time.\n\nBut the short answer is, this acquisition, while small is completely illustrative of what the point you're saying, which is there was no way we could have made the math work a year ago, but we can today, and I suspect will continue to do that for the rest of the year and next year.\n\nAdam Wyden -- ADW Capital Partners -- Analyst\n\nOK. All right. That's it for me. Thank you.\n\nOperator\n\nI am not showing any other questions at this time. I would now like to turn the conference back to Savneet Singh for closing remarks.\n\nSavneet Singh -- President and Chief Executive Officer\n\nThanks, everybody, for joining and we look forward to updating you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Byrnes -- Vice President, Business Development\n\nSavneet Singh -- President and Chief Executive Officer\n\nBryan Menar -- Chief Financial Officer\n\nMayank Tandon -- Needham and Company -- Analyst\n\nStephen Sheldon -- William Blair and Company -- Analyst\n\nSamad Samana -- Jefferies -- Analyst\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nAdam Wyden -- ADW Capital Partners -- Analyst\n\nMore PAR analysis\n\nAll earnings call transcripts"
}