{
  "companyName": "Alliance Resource Partners",
  "companyTicker": "ARLP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/31/alliance-resource-partners-arlp-q3-2022-earnings-c/",
  "content": "Alliance Resource Partners (ARLP -2.17%)\nQ3 2022 Earnings Call\nOct 31, 2022, 10:00 a.m. ET\n\nOperator\n\nGreetings and welcome to Alliance Resource Partners third quarter 2022 earnings conference call. At this time, all participants are in listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Brian Cantrell, senior vice president and chief financial officer. Thank you. You may begin.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nThank you, Doug, and welcome, everyone. Earlier this morning, Alliance Resource Partners released its third quarter 2022 financial and operating results. And we'll now discuss these results as well as our perspective on market conditions and outlook. Following our prepared remarks, we will open the call to your questions.\n\nBefore beginning, a reminder that some of our remarks today may include forward-looking statements subject to a variety of risks, uncertainties, and assumptions contained in our filings from time to time with the Securities and Exchange Commission, and are also reflected in this morning's press release. While these forward-looking statements are based on information currently available to us, if one or more of these risks or uncertainties materialize, or if our underlying assumptions prove incorrect, actual results may vary materially from those we projected or expected. In providing these remarks, the partnership has no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, unless required by law to do so. Finally, we'll also be discussing certain non-GAAP financial measures.\n\nDefinitions and reconciliations of the differences between these non-GAAP financial measures and the most directly comparable GAAP financial measures are contained at the end of ARLP's press release, which has been posted on our website and furnished to the SEC on Form 8-K. With the required preliminaries out of the way, I'll begin with a review of our results for the quarter and then turn the call over to Joe Craft, our chairman, president, and chief executive officer for his comments. As announced earlier this morning, ARLP's exceptional performance during the first half of this year continued into the 2022 quarter as we reported record revenues and coal sales prices. In addition to these records, ARLP also posted increases to coal sales and production volumes, oil and gas and coal royalty volumes, and consolidated net income and EBITDA, all as compared to the 2021 quarter.\n\nAt our coal operations, coal sales and production volumes increased 8.1% and 12.5% compared to the 2021 quarter. As previously mentioned, coal sales price per ton increased during the 2022 quarter, jumping 40.5% to a record $59.94 per ton. Increased sales volumes and record price realizations led coal sales revenues higher to $550.6 million, an increase of 52% compared to the 2021 quarter. As noted in our release, segment adjusted EBITDA expense per ton also increased during the 2022 quarter, reflecting continued inflationary pressures on numerous expense items, most notably labor-related expenses, materials and supply expenses, and maintenance costs.\n\nA few items in particular bear further mention with respect to cost increases we experienced during the 2022 quarter. In the Illinois Basin, our Hamilton Mine began a long haul move in early September that included bringing 194 longwall shields to the surface for repair and refurbishment. This extensive repair work resulted in completion of the Hamilton longwall move extending into the mid -- into mid-October. In Appalachia, our Tunnel Ridge Mine also performed a longwall move in early September.\n\nIn addition, MC Mining encountered adverse mining conditions and performed extensive maintenance on and made improvements to its coal preparation plant. Despite these higher expenses, margins at our coal operation rose on the strength of record coal sales prices to drive segment adjusted EBITDA higher to $224.6 million, an increase of 77.8% over the 2021 quarter. Turning now to ARLP's royalty segments. Compared to the 2021 quarter, royalty sales volumes for oil and gas rose 33.1% and price realizations jumped 31.6%, leading oil and gas royalties revenue to increase 75.6% to $35.3 million.\n\nOur coal royalties segment also performed well during the 2022 quarter, with royalty tons sold increasing 5.8% and royalty revenue per ton, climbing 17.5%, both as compared to the 2021 quarter. Total royalty segment adjusted EBITDA increased 66% and 7.3% compared to the 2021 and sequential quarters, respectively, jumping to a record $46.9 million. On the strength of strong performance by our coal operations and royalty segments, ARLP's consolidated total revenues for the 2022 quarter increased 51.3% to a record $628.4 million as compared to the 2021 quarter. Net income in EBITDA also jumped significantly during the 2022 quarter, increasing 186% to $164.6 million and 84% to $250.2 million, respectively, over the 2021 quarter.\n\nFinancial results also improved over the sequential quarter to total revenues and net income, both increasing 1.9% and EBITDA rising 2.6%. ARLP generated a $244.5 million of free cash flow in the 2022 quarter, more than double the free cash flow from the 2021 quarter and 210.1% higher than the sequential quarter. In keeping with our objective of returning cash to unitholders, during the 2022 quarter, we paid $52.3 million to unitholders through our quarterly distribution. Our balance sheet metrics continue to improve during the 2022 quarter as we reduced ARLP's net leverage to 0.2 times trailing adjusted EBITDA and we ended the quarter with $278.5 million of cash and liquidity of $744.7 million.\n\nARLP's financial and operating results for the first nine months of 2022 were also much improved compared to the 2021 period. Coal sales and production volumes increased 13.4% and 15.2%, respectively, while our royalty sales volumes for oil and gas and coal rose 29% and 13.1%, respectively, all as compared to the 2021 period. Increased sales volumes and commodity prices drove total revenues higher by 55.6% to $1.71 billion. Increased revenues more than offset higher total operating expenses and income taxes, leading net income higher by 187.1% to $362.7 million for the 2022 period.\n\nEBITDA for the '22 period also increased 85.3% to $646.3 million, compared to $348.9 million in the 2021 period. I think it's also important to point out that these exceptional results were achieved despite ongoing shipping delays, primarily due to transportation disruptions. While rail performance has improved recently, we continue to be negatively impacted by coal shipments falling below our expectations during the 2022 quarter. Year to date, approximately 1 million tons of ARLP's planned coal shipments have been delayed.\n\nAs we close out 2022, ARLP is currently planning for its strongest coal shipping quarter this year. But with low water levels and locked outages impacting barge movements and with the potential for a rail strike back on the table, we recognize the possibility that some shipments may shift into 2023 and we've adjusted our current expectations for 2022 coal sales volumes, prices and costs accordingly. Turning to the outlook for ARLP's royalty businesses, oil and gas royalty volumes continue to be higher than anticipated as drilling and completion activity in our minerals acreage exceeds our expectation. Increased production on ARLP's base acreage, along with additional production from the two transactions we recently closed, led us to increased full year BOE volume expectations by 9.2% at the midpoint.\n\nWe expect the performance of our oil and gas royalty segment will exceed our previous expectations in 2022 and anticipate oil and gas royalty production volumes will increase next year as well. For our coal royalty segment, the coal shipment delays I discussed previously have led us to slightly lower our full year 2022 guidance. We've also modified guidance ranges for several consolidated items for the 2022 full year. The range for anticipated income tax expense was increased to reflect the current full year performance expectations for our oil and gas royalties segment.\n\nAnd the range for planned capital expenditures in 2022 was also increased to reflect ARLP's acquisition of the reserves adjacent to our Tunnel Ridge Mine and initial work this year to begin accessing a lower cost reserve area adjacent to the River View Mine. With that, I'll turn the call over to Joe for comments on the market and his outlook for ARLP. Joe?\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nThank you, Brian, and good morning, everyone. I want to begin my comments this morning by thanking the entire Alliance organization for their hard work and dedication. Through their efforts, ARLP has delivered outstanding performance so far this year and we are on track to achieve record financial results in 2022, a significant accomplishment for a company with our 23-year growth history. I'm extremely proud of all that has been accomplished and thankful for the unwavering focus of our teams on creating long term value for all of our stakeholders.\n\nAttracting, retaining, and properly incentivizing the talent necessary to drive execution of ARLP strategy is critical to our success. Since our inception, ARLP's long-term incentive plan has been an important tool to motivate key employees by aligning their interests with the long-term performance of Alliance. To keep this plan in place for our future, ARLP recently filed a proxy solicitation requesting that unitholders approve an increase to the number of units available for award under this plan. All additional units to be included in the amended plan can only be used for future LTIP grants and cannot be issued for any other purposes.\n\nThe proxy advisory firms, ISS and Glass Lewis have both recommended consent for our proposed plan amendment and management encourages all unitholders to vote in favor of the proposal. In case you're wondering, yes, the now viral photo of the coal miner, who wanted so badly to be with his three year old son when the boy wanted to see the University of Kentucky play basketball for the first time in his life, that he showed up at last weekend's Blue-White scrimmage, still in his miner's clothes. He is an employee at Alliance's subsidiary, Excel Mining. Michael's picture has captured the hearts of tens of thousands of people around the country, who are ready to celebrate a hard working, caring family man chasing his American dream.\n\nHis picture, his story, and his work ethic are representative of more than 3,000 employees working across Excel, AARP, and all of Alliance's operating subsidiaries. It is refreshing to see the heartfelt response of those Americans that recognize the contribution of coal miners to our country's energy security. During our last earnings call, we outlined many of the factors that have contributed to the global shortages in the fuels critical to providing the world with reliable, low-cost energy. Misguided climate policies resulted in the premature abandonment of baseload power generation in favor of unreliable renewables and a drive to meet unrealistic, arbitrarily set governmental and regulatory transition deadlines.\n\nConstraints on access to capital, limiting the ability of fossil fuel producers to increase supply of critical commodities essential to meeting rising power demand, disruptions related to the conflict in Ukraine, labor shortages, supply chain, transportation challenges have all contributed to the energy crisis currently gripping the world. As the executive director of the IEA recently stated, the energy world is shifting dramatically before our eyes and responses around the world promise to make this a historic and definitive turning point. The need for reliable, affordable, secure energy has become a clear focus for governments around the world as they react to the severe impact on their citizens facing potential power capacity shortages and rapidly escalating energy costs. Coal consumption has increased in Europe as restricted Russian coal and natural gas supply has pushed many countries to delay planned retirements of coal-fired power generation and bring idled coal plants back online.\n\nWe expect this new reality will persist at least over the next couple of years, if not longer. In the U.S., utility coal inventories continue to be an extremely low levels and are expected to remain so through the winter. Against this backdrop, ARLP is well-positioned for growth over the foreseeable future. We anticipate buying activity from our domestic customers will increase as utilities seek to replenish depleted stockpiles next year.\n\nWe also anticipate favorable market conditions in Europe will provide attractive export opportunities next year as well as they try to replace 40 million tons of Russian imports that they received this year. As a result, we currently anticipate ARLP's overall coal production in 2023 will increase by as much as 2 million tons over this year's level in order to help meet these needs. Our confidence is supported by our contract book. Currently, 32.9 million tons already priced and committed for 2023 and another 22.8 million tons priced and committed in 2024.\n\nWith these commitments, we continue to believe that ARLP should benefit from increased coal volumes and margins over the next several years. We remain committed to our strategy of investing in our existing mining assets to maintain ARLP's low-cost position and to maximize the cash flow generation potential of our existing coal operations. The announcements we made earlier this morning of our decisions to acquire additional reserves adjacent to our low-cost Tunnel Ridge longwall mine and to access a lower cost, higher yielding coal seam adjacent to our River View Mine are evidence of this commitment. With these commitments providing cost savings and increased production capacity beginning in 2025 and the two new production units in the Illinois Basin we announced last quarter that will benefit us next year, we believe ARLP has the opportunity to expand its market share and sustain planned coal volumes through 2035.\n\nWe also remain focused on growing our oil and gas and coal royalty segments. The recent acquisition of an additional 4,322 acres in the Permian increases ARLP's total mineral position to approximately 62,008 net royalty acres and provides line of sight growth in future oil and gas royalty volumes. Our coal royalties segment is also expected to show future growth as a result of the Tunnel Ridge and River View activity previously discussed. ARLP continues to make progress on its new ventures energy transition strategy.\n\nWe are increasingly confident in the management team, the commercial plans and technology of Infinitum Electric, start-up developer and manufacturer of high efficiency electric motors, ARLP invested in last April. We remain excited about our investment in NGP ETP IV as their evaluation of numerous opportunities in the energy transition space has resulted in several initial investments for the fund. ARLP has recently elected to hold its commitment to Francis Energy to support development of its EV infrastructure charging network at our initial $20 million convertible note investment. We remain interested in the EV infrastructure market, and our new ventures team continues to evaluate opportunities to work with Francis Energy and others in this growing sector.\n\nARLP's management is excited about the opportunities in front of us and our future. Our visibility into the cash flow generation sustainability of our core coal and oil and gas businesses gave our board confidence to accelerate our previously targeted 10% to 15% per quarter unit holder distribution increase by bumping the distribution for the '22 quarter to $0.50 per unit, a 25% increase over the sequential quarter. Looking forward, we believe ARLP is well-positioned to deliver solid growth and attractive cash returns to our unitholders again next year. That concludes our prepared comments, and I will now ask the operator to open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Nathan Martin with The Benchmark Company. Please proceed with your question.\n\nNathan Martin -- The Benchmark Company -- Analyst\n\nHey, good morning, Joe, Brian. Thanks for taking my questions.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah, Nate.\n\nNathan Martin -- The Benchmark Company -- Analyst\n\nThat might. I want to start with 2023 first, maybe on the production update. I think last quarter you guys mentioned maybe you could grow production by a million tons year over year. Now we're got into a possible 2 million ton increase.\n\nFirst, maybe just for clarification, what production or sales number are you guys using as a base? I think you mentioned there's some sales from this year could possibly carry over into '23 due to the logistics. And then second, Joe, I think you mentioned in the past labor had kind of been a limiting factor to growth. We'd love to get your update on labor as well. Thank you.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah, for '22 in our guidance, we reduced that to 35.9 million as our base for '22. That means we've moved about 900,000 tons of what we had committed in '22 to roll rollover, potentially into '23. We're showing tons committed in '23 in our guidance up to 32.9 as at the end of the quarter. We probably added another -- we're in discussions that add probably another million tons to that as we speak.\n\nAs far as our production, again, that would take that 36 million roughly to 38 million next year, assuming that we can continue to staff as we are projecting. In the last quarterly call we talked about the Gibson South operation adding a unit and we had talked about staffing the day shift for that in October. That was completed about mid-month. So we're ramping that up as we speak.\n\nThe second shift, we have planned to come online in May of 2023. That's what we're factoring in to the assumptions that would allow us to get to the 2023 2 million tons we talked about. At some of our other operations, we've been adding some individuals that allow us just to additionally staff some of our support units, whether they be a shuttle car opportunities and additional rig motors that will increase some production. We talked also about adding another development unit in Hamilton that will allow us to have full production in Hamilton in 2023 as well.\n\nSo that's what we're assuming to achieve where we are to where we're going as far as our ability to secure the additional labor. We've seen the ability to do that. We think that things are improving in that area. We've been able to, with the pricing we have, implement some additional bonus opportunities that tie back to sales prices that has allowed us to be more competitive than most other opportunities that are employment opportunities in the area.\n\nSo we feel better today than we did last quarter about our ability to staff our operations.\n\nNathan Martin -- The Benchmark Company -- Analyst\n\nAppreciate that color, Joe. And then maybe again on '23, as you mentioned, you guys layered on like an additional, call it, 4 million tons, I think, to that 3.9 million ton number. So, now we have a sizable chunk competitive priced. I think you mentioned last quarter an expectation to see price per ton increase somewhere in the neighborhood of $10 a ton year over year.\n\nCan we get an update there? Just what maybe that the pricing looks like on those 2023 tons? Thanks.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah, I think we're on target to hit that number. So I think if we look at the $10 increase would be roughly 20% year over year on an average sales price per ton basis. So I would say where we are right now in our plans and looking forward, we think that 20% plus or minus 5% is probably still a good estimate of where we will be in 2023. A lot's going to just depend on where the markets go next year.\n\nWe're pretty bullish on export pricing. As we see Europe being -- their stockpiles being full today in anticipation of winter and the Russian Ukraine situation. But next year after they deplete those inventories, it's going to be more difficult for them to replenish those inventories, both natural gas and coal, without the Russian production. It's our opinion right now, a base case that we're using is that the Russian Ukrainian conflict will continue to mid-year next year.\n\nSo that's forming the basis of our judgments as to the opportunity in the export market, which will also put pressure on the domestic market. So we currently have 4 million tons. And so if you assume that we can close this extra million tons that we're negotiating right now, I think we shipped the same amount of export next year as we do this year or as we plan to do this year, that would suggest one and a half million would go to the export market and then two and a half million is available to either go to the domestic market or the export market. And so we're in a similar situation this year that we were -- for '23 that we were in '22, where we get significantly more demand than we've got supply.\n\nSo we will have to go to our domestic customers and give them that opportunity again to say, do what do they want to do? Do they want to commit to that tonnage soon? Or would they prefer us just to go ahead sell that to the export market? So that's sort of where we stand in trying to determine exactly what 2023 might look like.\n\nNathan Martin -- The Benchmark Company -- Analyst\n\nGot it. Thanks for those thoughts. And I think just to confirm, you said maybe exports could be flattish next year? Was that correct?\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nWell, I'm just I'm just saying, if we do what we did this year, now we get two and a half million tons left to sell the same if we go to the 2 million tons. So depending on who wants that coal most, it could go with the domestic market, it could go to the export market. And if the demand is robust, it's possible we could increase some of Gibson -- the fifth unit that we've got based in our plan is a single minor unit. We do have the equipment that we could make that a super unit.\n\nI mean, it would just depend on the market and our ability to get to people as to whether we could, again, have a little bit more incremental production next year. We're not anticipating that as we're putting our plan together at this 10 seconds.\n\nNathan Martin -- The Benchmark Company -- Analyst\n\nGot it. Makes sense. Thank you. And then maybe just one more before I turn it over.\n\nRegarding additional capex spending in '22, you guys mentioned a couple of moving pieces, but can we please get into a little more specifics on the breakdown of where that additional looks like to be 70 million or so is being allocated? And then any early thoughts on '23 capex, what that might look like? Maybe where do you think maintenance capex is currently trending given all the inflationary pressures your labor costs we talked about? I know in your release it still says $5.66 per ton, but just curious if there was any additional info there. Appreciate it.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nYes, sure, Nate. On the increase for 2023 between the reserves acquired adjacent to Tunnel Ridge and work that we're beginning to do to access, the new reserve area adjacent to River View, in total for those two projects, we'll be deploying about 120 million over three years, with approximately 38 to 40 of that actually being spent this year in 2022. And you're correct, the inflationary pressures that we've been experiencing this year, while we've seen some moderation or stabilization, if you will, in pricing, we certainly haven't seen costs come down yet. We're actually right in the middle of our planning process.\n\nAnd as we always do, we'll give an update on what we think maintenance capital will look like over the coming five years when we discuss it in January. So it may be a little bit premature to give guidance with precision precision for next year, but we'll -- we should certainly expect to see an increase on a per ton basis and we'll be providing more color on that at our next call.\n\nNathan Martin -- The Benchmark Company -- Analyst\n\nAppreciate that, Brian. I'll leave it there. Thank you guys for the time and best of luck in the fourth quarter.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nThanks, Nate.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Mark Reichman with Noble Capital Markets. Please proceed with your question.\n\nMark Reichman -- Noble Capital Markets -- Analyst\n\nGood morning and thank you for taking my question. The first one is on the two transactions in the oil and gas royalty segment. What is your expectation in terms of any of that in your 2022 guidance or what are your expectations for 2023? If you could just kind of elaborate on the impact of that acquisition? When you're talking about 2022, you're referring to the increase in volumes that we provided.\n\nYes. Yeah, how much of that is from this acquisition and what would a full year rate look like?\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nI would say the amount for 2022 is a mix of drilling activity on our base acreage prior to these transactions. But as you noted and hopefully you noted on our release, there are about 1,200 producing wells currently on that acreage. But we do anticipate a portion of the increase is also attributable to these two at least two transactions. As I mentioned earlier in my comments to Nate, we are in the middle of our planning process, which includes an updated reserve board from our engineering advisors.\n\nSo, as you know, Mark, the volumes can get a bit complicated. You have to take into account not only new wells drilling, etc., but also the decline curve. So again, it's -- we'll be providing, a specific update in terms of what our view is for 2023 in January.\n\nMark Reichman -- Noble Capital Markets -- Analyst\n\nWell, Brian, I think it's great to see that you've been able to invest to grow your existing businesses. When you think about, you're adding those units at Hamilton and Gibson South, but when you think about River View and Tunnel Ridge, how are you thinking about opportunities to boost production there? I think you mentioned, some of those you won't really see an impact until 2025 and you're going to be making those three-year stage investments. And then just maybe lastly on to that, when you think about your acquisitions in kind of the oil and gas and in the coal business, where did these kind of emanate from? I mean, what kind of led these opportunities? And are there -- do you see a broader range of opportunities to invest money going forward?\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nI'll touch on the oil and gas first and Joe will probably comment on the coal side following that. As you know, we've got our own internal technical group with regard to our oil and gas activity in particular. We are actively involved in evaluating opportunities where counterparties are looking to sell their positions. We also participate in a ground game, which is really more going in front of individual landowners to see if we can acquire their mental interests that aren't part of a larger package.\n\nSo it's -- we probably review in excess of 50 deals per year in the oil and gas space. We're -- as we've always been, we're very disciplined in our underwriting there. So we just a lot of frogs, if you will, before we pick things that ultimately we believe we can acquire at pricing that's going to give us an appropriate return. So it comes from a variety of sources on the oil and gas front.\n\nAnd Joe may want to touch on the coal side.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah, at Tunnel Ridge, we're operating at full capacity. Going into 2023, we've got some shorter panels before we access the reserves that we just acquired so that we just don't have additional capacity at Tunnel Ridge to increase production no matter what the market is as we look forward to 2023. At Riverview, we would have some additional capacity. We are, as I mentioned earlier, we are adding some people to increase production there as well, but it's only incremental without adding any new units of equipment there.\n\nAnd we could -- we do have the plant capacity to do that. But as we're trying to transition, we believe based on our ability to attract the labor that we need to complete -- to increase that volume. We just can't project that we can do that right now with any certainty. So that's some upside, but it's not built into our plans as we -- as we're currently evaluating our ability to increase production there in 2023.\n\nOperator\n\nOur next question comes from the line of David Marsh with Singular Research. Please proceed with your question.\n\nUnknown speaker\n\nHey, guys. Thanks for taking the question. So you guys finished the quarter with a really robust liquidity position, probably the most robust you've had in quite some time. Obviously, it looks like some of that's going to go into capex.\n\nBut could you talk about some thoughts around what you would do with the rest of that cash?\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nIn our capital allocation strategy, our objectives really has not changed since we had the conversation on our last call. So we will focus on maintaining our operations, as you just mentioned, and trying to make sure that we can maintain our low-cost status. And Brian just shared with you some of the allocations on our growth capital related to our existing operations by improving our cost structure going forward and our ability to potentially increase some tons in 2025. We've talked about our distributions, so we will continue to distribute our cash to our unitholders.\n\nWe'll look at some debt repayment as a possibility as we've got our $400 million term -- or our note that comes due in two or three years.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nMay of '25.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah. So we may look at the taking some of that down. And then we're also committing to invest in the oil and gas segment, whatever generate -- whatever cash flow they generate, we anticipate we'll continue to invest in the oil and gas minerals segment. And then we've got our new ventures group that we're building with staff to continue to look for investments that would be not related to either coal or oil and gas, and that would provide future growth opportunities as as we evaluate opportunities in the transition area, so to speak.\n\nSo that's the areas of the capital allocation that we are targeting today.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nYeah. We're also looking at our Matrix subsidiary that continues to develop technology and products that we think have long-term growth opportunities and we'll be allocating capital to help them in their efforts as well.\n\nUnknown speaker\n\nWould LP unit repurchases be something that would be considered at some point? And can you give us any kind of framework around how you think about that, please?\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nI think if we did any unit purchases, it would be very small. It would be only to potentially -- basically replace those units that would be issued under our long-term incentive plan, which are not very significant. So a buyback program of units is -- would be considered, but it's not a top priority.\n\nUnknown speaker\n\nGot it. Thanks so much for taking the question. Appreciate it.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nYou bet.\n\nOperator\n\nOur next question comes from the line of Dave Storms with Stonegate Capital Market. Please proceed with your question.\n\nDave Storms -- Stonegate Capital Partners -- Analyst\n\nGood morning, Joe, and thanks for taking my question. Just one for me. When you talk about supply chains being an issue and specifically around the renewed potential for a strike, how are you thinking about the possibility of a strike happening? And since that could be a pretty binary situation, what would expenses look like if the strike does take place versus if the strike did not take place?\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nI think on the rail strike, there's continuing negotiations. There's several of the various unions, there's like a dozen different unions that are impacted by those negotiations in the rail sector. I think there's several of them that have already voted down the most recent proposal. We know the railroads and U.S.\n\ngovernment is involved along with labor unions. It's a possibility. We're still believing that the federal government will be involved enough to prevent a major disruption to our economy that a rail strike would occur. So we're placing a low probability on it.\n\nHowever, it could happen. If it does happen, then there would be disruption, obviously. We believe the railroads would still operate and then exactly how they would allocate that, it's hard to judge. Most of our operations, the majority of our operations are barge traffic as opposed to rail.\n\nI would expect that there would be more demand trying to move the utilities by barge. But it's just hard to predict exactly what would happen. From what we understand as to the issues that are still outstanding that they're negotiating with, it's all about money and it doesn't seem like there -- I don't know. I don't have clarity what the negotiations are, but it seems like that they are reasonably solvable because it's mostly just about money and not other working conditions or working standards that could get more emotional, I guess, but I don't know how to predict it or to handicap that any more than what I just said.\n\nI wish I could, but -- let's hope that --\n\nDave Storms -- Stonegate Capital Partners -- Analyst\n\nIt's perfect. Thank you.\n\nOperator\n\nOur next question comes from the line of Mark Zand with Wexford. Please proceed with your question.\n\nMark Zand -- Wexford Capital -- Analyst\n\nHey, Joe. Hello, Brian.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nGood morning, Mark.\n\nMark Zand -- Wexford Capital -- Analyst\n\nSo, Brian, when -- can you give us an update on where you stand on your renegotiation for your revolver and when you think you'd be in a position to begin to start to retire your bonds?\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nSure. We're currently in discussions with our lead banks and are anticipating a formal launch to amend and extend our current revolving credit facility. It will happen sometime in the next few weeks. And we're working -- we would be working to have everything wrapped up either before or very shortly after year end to put a new facility in place.\n\nAnd I think you would -- the bonds today are trading at like 97 and a half or so. To the extent we would have the ability to go in and begin bringing down the quantum of the outstanding debt at an open market purchases, you could see us start doing so, first quarter of next year.\n\nMark Zand -- Wexford Capital -- Analyst\n\nGot it. Thanks. And then the one area that we we're a little bit, maybe hoping for a little bit better was sort of price realization from the Illinois Basin. You had a big jump between Q1 and Q2.\n\nAnd then, Q2 -- Q3 over Q2 was up a dollar and things. And I guess our sort of hope was that you'd be layering in, sort of some higher price, spot sales. Can you give us any sense on where you think Q4 will be relative to where Q3 was in terms of realization for the Illinois Basin?\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah. If we are able to ship the tons that we have scheduled, in other words, that there's no transportation interruptions, we would should see about a 5% increase over the current, the third quarter. Well, that's looking at the total not about the Illinois Basin, but just if you look at consolidated for the coal, it would be close to $64 if we were able to ship what we had projected without interruption for the fourth quarter.\n\nMark Zand -- Wexford Capital -- Analyst\n\nOK. 64. That's very helpful. Thanks, Joe.\n\nGood. Thanks very much, guys.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nThank you, Mark.\n\nOperator\n\nOur next question comes from the line of Lucas Pipes with B. Riley. Please proceed with your question.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nThank you very much for taking my question. Good morning, everyone. And Joe, it was great to hear your recognition of the workforce earlier. I also have a quick question on the pricing side.\n\nYou mentioned the opportunities both in the domestic and export market, and you'll sell the remaining tons for 2023 into the highest priced market. Where would you put the netbacks today for export tons for 2023 versus the domestic market? Thank you very much.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nToday. Lucas, we've seen API-2 drop off pretty significantly from the last quarter. So today those prices would be comparable to domestic, probably still a little maybe $15 above. But we do anticipate that the API-2 is going to bounce back to something that we saw more of on average in '22 than what is currently trading at.\n\nSo we do think that there's going to be quite a sizable spread between the export market and the domestic market in '23. What's happening in the domestic market in '23 will somewhat be determined by natural gas in a way. Natural gas prices, there was an article in the Wall Street on Friday talking about the pressure and prices going down. And the date is more I don't know what's doing right now, but when I looked this morning as it was up almost 10%.\n\nSo, yeah, natural gas can be volatile, as we know. So, on the domestic side, I think another thing and I mentioned this last quarter and it's continuing to prove to be true, is that the utility commissions are starting to ask tough questions to the utilities as to why they're making economic choices to burn natural gas when natural gas is higher than coal. So I think that there's a desire for these utilities to more than likely have to or want to buy more coal next year than they've done in the past. And that could potentially put some pressure on pricing to where what we may see currently in the trade publications as to what the price is.\n\nThere could be some upward price pressure on the domestic prices as well. So we're in a very favorable pricing environment going into 2023.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nVery helpful, Joe. And where would you put the 2023 pricing for Illinois Basin coal approximately for, again, 2023?\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nWell, not in position to tell you that. I mean, it's so volatile and again, we're in the middle of negotiations. It's -- I don't feel comfortable being able to give you what our price expectation is at this time. Time, I think that.\n\nAs I mentioned earlier, when we look at the total average sales price, we do believe that that 20% mark year over year is definitely achievable and there could be another 5% or so upside to that if we are able to achieve the numbers helping you in that regard without giving you a specific number for a particular coal miner, particular market, if that's constructive for you.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nThat's helpful. Thank you. And then last one for me. The Mississippi River conditions, how do you expect that to play out? What's embedded in your guidance in terms of continued disruption there? Thank you very much.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\n1We have additional we have volume in our current inventory that's actually in down at the docks. So ready to load our export commitment shipments for this year. So it is possible that the -- it would affect the timing of additional shipments in the export market. It's hard to predict, but we do believe that it'll be more of a timing issue as opposed to a volume issue.\n\nSo we will be able to participate at the levels that I discussed earlier. There may be a timing disruption, but not necessarily a financial impact over five- or six-month time horizon.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nAnd if river conditions remain difficult, can you move more tons onto the rail or [Inaudible]\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah, I think on the river conditions, we'll have plenty of opportunity in the domestic market as opposed to shipping in the export market because these are more lower Mississippi River issues that really affect the export market, not the domestic market. And the locks that we've talked about, we believe there's good progress on that, but where it's not going to affect our domestic shipment.\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nVery helpful. Joe and Brian continued best of luck.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nThanks, Lucas.\n\nOperator\n\nOur next question comes from the line of Viz Shire, a private investor. Please proceed with your question.\n\nUnknown speaker\n\nHey, good morning, Joe and Brian. Hey, first and foremost, thanks for all the fantastic work and the fierce focus of the entire team, all the employees, the management, everybody has done. Very happy as an individual investor. Question with regards to the new ventures team in particular.\n\nAgain, it's more of a perception. At a time when we are actually really doing well with coal, oil, gas and everything, looking at the geopolitics and how things are shaping up for the future, wouldn't us investing money with EV and other stuff out of new ventures, wouldn't that be perceived as a distraction rather than trying to deploy that capital into maybe execution excellence with our coal and oil and gas? Thank you.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah, we don't consider it a distraction. We've got dedicated investments or a team investing or looking at those investments. So it's not distracting anyone from pursuing what opportunities would be incremental to either oil and gas or our coal operations. So we just think that there's a lot of opportunities that the government is incentivizing people to invest in.\n\nSo -- and we think it's prudent. The election, midterm elections will sort of shed some light on the mood of the country as to where our future energy policy could go. I think that we're seeing some reassessment among utilities and governments around the world as their commitment to move toward the Paris Accord, their climate change objectives. So there has been a pause, but there's not been a movement away from that.\n\nSo in most cases, the governments have said, well, we're going to have to push the pause button for right now. But that does not change our objective to still continue to move away from fossil fuels. So we just need to read the political situation. And I think it's just prudent for us to look for opportunities to invest in long-term investments in assets that can provide some additional diversification opportunities in our portfolio that could be very attractive investments given the incentives that the government is putting in place in those areas.\n\nBut we'll be prudent. We're not going to take the risk that we don't consider to be any different than what we've done for the last 20 something years. So we're very focused on making good cash flow, long-term investments that will allow us to sustain the type of performance that we've been known to do over the last 23 years of our history.\n\nUnknown speaker\n\nThank you. Again one follow-up question in regards to the ongoing rail strike and some of the stuff we see in the Mississippi with the barges and stuff. Are there any particular execution excellence initiatives that is ongoing within ARLP to to focus more on the excellence, given some of these roadblocks that are outside of ARLP's control that are coming up? Thank you.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nI think with respect to how we manage our transportation for our whole business, it is a daily exercise. We are in constant contact not only with our customers but also with the transportation providers. That's just the way you need to run your business, the current environment notwithstanding. So we are absolutely focused on it.\n\nWe have teams dedicated to make sure that any challenges that we are experiencing are made very clear to customers and rails and barges and trucks. And that's not going to change. So we recognize how important it is. And we've got people that are on it every single day.\n\nUnknown speaker\n\nOK. Once again, as a small investor, thank you, Joe. Thank you, Brian. We feel very, very happy to be associated with the ARLP.\n\nThank you.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Arthur Calavritinos with ANC Capital. Please proceed with your question.\n\nArthur Calavritinos -- ANC Capital -- Analyst\n\nGood. Thank you very much and a great quarter, guys. It's good to see the good guys do well. Let me ask you just something.\n\nI've been reading a lot on you, not on on the oil and gas business. Are you guys affected at all? I've been reading about the Waha terminal or hub area, where some gas is at negative prices. And forgive me for my ignorance of that question, but are you guys close to that? Does it affect you or --\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah. So that's in the Permian. And we believe that was an isolated incident that related to a pipeline that was having some maintenance issues at the time. So there was a build up of gas that needed to be sold at a discounted price.\n\nWe don't think it's a systemic issue. We think -- we believe it's an isolated incident. But yeah, obviously, we're in that basin. so it would affect it would affect some of our volumes, but it should not be a significant event for us.\n\nArthur Calavritinos -- ANC Capital -- Analyst\n\nOK. And then in terms of the -- on coal, you said you had some, I guess uncommitted tons and the European guys are looking at it, our guys are looking at it. And is it a question of like either not, I'll say either price or the guys just feeling I can get it when I need it. And I'm surprised nobody's bid on it yet to take those tons is -- what sort of things are thinking going on in terms of [Inaudible]  \n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah. Currently you've got -- specifically to Europe, I mean their stockpiles are -- they prepared for the winter.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nAnd the Russian embargoes.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah. So they were able to accelerate shipments that they had in Russia and under contracts with Russia before the embargo took effect in August of this year. So there's not a real need today for that tonnage but there will be a need after the winter. So it's a timing issue.\n\nAnd so they don't -- and as I mentioned, we're not too anxious to sell at these prices that they'd be out to because there hasn't been that much activity. And that's why you see the swing in prices over the last month. But once those buyers get into that, start coming back to the market to replenish their stock, then we anticipate those prices will rise. So there's just not much activity right now because sellers don't want to sell at the prices and buyers don't have any place to put it right now.\n\nSo that's what's going on at this 10 seconds.\n\nArthur Calavritinos -- ANC Capital -- Analyst\n\nOK. And then on the -- just a couple of more. Thank you very much for taking the questions. When I see General Motors, I see the auto guys, the bet, you see it sequentially.\n\nThe bet on the EV is just getting bigger and bigger. I mean, the whole ranches bet on the EV. And I'm just wondering when would you guys look at when do you think we start seeing or you guys are able to say the EV market is contributing to this demand in electrons? Are we at that point where you're almost able to like point and say this is what's going on for the demand for electricity? Or is it just I know it's early, but the bets are getting bigger and bigger sequentially.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nYeah. So we personally don't believe that the demand is being reflected in the IRPs that the utilities are posting. Some will say that it is. They look at the different factors, the way they think they can manage that.\n\nAnd there's still a lot of discussion that with the transition to wind and solar taking some of that load, that might be specific to some of these factories, etc. When you think about EVs, yes, they are moving. Most -- the things we're looking at as far as when we're going to start seeing numbers of vehicles that are actually being sold in the market growing, it's probably two years away, 2025 -- 2024, 2025. And then you start looking at these plants that talk about converting basically 100% of their production to EVs by 2030, 2035.\n\nYou still have quite a bit of cars on the road that are going to continue to be combustion engines because people aren't going to sell those cars immediately. You have to replace them. A lot of the EVs are going to be -- they're still going to have their combustion engine. So we anticipate that we're not really going to see that until a couple of years from now.\n\nAnd a lot's going to depend, again, back to this energy policy and how how the elections turn out and how nations start thinking about their national security, more so than their environmental policies that will help define the answer to your question. And another thing that I think is underestimated, which is sort of where you're going, that there's going to be a large demand for power. I think another thing that's underestimated is the expectations of people to want to have those batteries and do more and more, be charged faster and faster on the road. And when you think of that, and that's going to consume a lot more power than this current technology that's being used in the cars today.\n\nSo I think there's going to be more demand for electricity that the customers are going to demand if, in fact, they do gravitate to the EVs as the auto sector is wanting them today. So I think your point, if I'm interpreting it properly, is well stated that there will be a demand increase for electricity. That probably is understated in the minds of most policymakers across the nation.\n\nArthur Calavritinos -- ANC Capital -- Analyst\n\nYeah, yeah. Agreed. Thank you. Yeah, yeah.\n\nYou put it better than I did. And then there was one of the thing I was going to say on the -- anyway, I lost my train of thought. The last thing is just a comment. I saw that thing with the basketball player at -- with his son.\n\nI think you guys with your lobbying muscle should turn that into a stamp. Have the government turn it into a stamp. So it was really heartwarming. Almost like a Norman Rockwell-ish type of thing for the modern era.\n\nBut well said and I like the comments how you led out with a preamble. So thank you very much. It was great.\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nThank you. Thanks, Arthur.\n\nArthur Calavritinos -- ANC Capital -- Analyst\n\nThanks, guys.\n\nOperator\n\nThere are no further questions. I'd like to hand the call back over to Brian Cantrell for closing remarks.\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nAppreciate it, Doug, and everyone, we appreciate your time this morning as well and also your continued support and interest in Alliance. Our next call to discuss our fourth quarter and full year 2022 financial and operating results is currently expected to occur in late January. And we hope everyone will join us again at that time. This concludes our call for the day.\n\nThanks to everyone for your participation and continued support of ARLP.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Cantrell -- Senior Vice President and Chief Financial Officer\n\nJoe Craft -- Chairman, President, and Chief Executive Officer\n\nNathan Martin -- The Benchmark Company -- Analyst\n\nMark Reichman -- Noble Capital Markets -- Analyst\n\nUnknown speaker\n\nDave Storms -- Stonegate Capital Partners -- Analyst\n\nMark Zand -- Wexford Capital -- Analyst\n\nLucas Pipes -- B. Riley Financial -- Analyst\n\nArthur Calavritinos -- ANC Capital -- Analyst\n\nMore ARLP analysis\n\nAll earnings call transcripts"
}