{
  "companyName": "Moderna Inc.",
  "companyTicker": "MRNA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/moderna-inc-mrna-q3-2022-earnings-call-transcript/",
  "content": "Moderna Inc. (MRNA 0.43%)\nQ3 2022 Earnings Call\nNov 03, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Kevin, and welcome to Moderna's third quarter 2022 earnings call. [Operator instructions] Please be advised, this call is being recorded. At this time, I'd like to turn the call over to Lavina Talukdar, head of investor relations at Moderna.\n\nPlease proceed.\n\nLavina Talukdar -- Head of Investor Relations\n\nThank you, Kevin. Good morning, everyone, and thank you for joining us on today's call to discuss Moderna's third quarter 2022 financial results and business updates. You can access the press release issued this morning, as well as the slides that we'll be reviewing by going to the Investors section of our website. On today's call are Stéphane Bancel, our chief executive officer, Stephen Hoge, our president, Arpa Garay, our chief commercial officer, and Jamie Mock, our chief financial officer.\n\nAfter prepared remarks, we will take your questions through 9:15 a.m. this morning. Before we begin, please note that this conference call will include forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Please see slide two of the accompanying presentation and our SEC filings for important risk factors that could cause our actual performance and results to differ materially from those expressed or implied in these forward-looking statements.\n\nWith that, I will turn the call over to Stephane.\n\nStéphane Bancel -- Chief Executive Officer\n\nThank you, Lavina. Good morning or good afternoon everyone. Welcome to our Q3 2022 conference call. Today, I will start with a quick business review of the quarter before Stephen reviews our clinical programs.\n\nArpa will then take you through commercial dynamics, and Jamie will present financials. I will then come back to close before we take your questions. In the quarter, we reported $3.4 billion in revenues. We reported net income of $1 billion and cash investments totaling $17 billion.\n\nWe now expect deliveries under advanced purchase agreements in the range of $18 billion to $19 billion in 2022 due to delayed deliveries from our Fill/Finish contract manufacturers, resulting in $2 billion to $3 billion of revenue deferrals into 2023. In Q3, we had to deal with a lot of complexity, launching two products, 1273.214 and 1273.222 at the same time and also moving products from 10-dose vials to five dose vials. Q3 was actually our greater delivery amount in terms of vials produced and was up about 20%, the average of the previous three quarters. Arpa will share more thoughts on 2023 in a moment.\n\nIn the third quarter, we repurchased over 7 million shares. The $3 billion share repurchase program we announced in February 2022 was completed. Since the start of our first share repurchase program in 2021 through the end of the third quarter, we have repurchased more than 23 million shares. Our first share repurchase program announced in August 2022 for an additional $3 billion in repurchase is ongoing.\n\nLet me now review the pipeline highlights and advances since our last update. I am very pleased with the important progress the Moderna team has made on advancing the pipeline closer to product launches, and at the same time, increasing the breadth of the pipeline. We continue to progress with COVID booster programs and have received authorization around the world for both of COVID 1273.214 program which target Omicron BA.1 and 1273.222, which target BA.4/5. We have, as you know, two respiratory vaccines in phase three trials as we speak that continue to progress quickly.\n\nFor flu vaccine, at R&D in September, we announced the first phase three immunogenicity study was fully enrolled. We expect now data in the first quarter of 2023. As a reminder, we plan to pursue an accelerated approval pathway for seasonal flu vaccine. We also started a phase three efficacy study with a flu vaccine, and that trial is enrolling quickly.\n\nFor phase three allergy vaccine, we are on track for data readout this winter season. We were pleased to announce that Merck exercised their option to develop and commercialize our personal cancer vaccine, mRNA-4157, paying more than $250 million in Q4. We and Merck will share costs and profit 50-50 for this program moving forward. We continue to expect data from our phase two study for PCV in Q4 this year.\n\nIn rare diseases, we are pleased to share at the R&D Day that we saw encouraging early signs of clinical benefit from both PA and GSD1a and announced a new development candidate for OTC. On slide six, you see our usual snapshot of Moderna in November 2022, showing the breadth of the pipeline, with now 48 programs in development across vaccines and therapeutics. The company continues to grow and we are now at more than 3,700 Moderna team members. Last week, we are very pleased to announce as a top employer by science for the eighth consecutive year.\n\nWe have now 15 commercial subsidiaries globally and a strong balance sheet of $17 billion to fund our continued growth. With this, I will now turn over to Stephen to review the pipeline. Stephen?\n\nStephen Hoge -- President\n\nThank you, Stephane. Good morning or good afternoon, everyone. This morning, I'll review our clinical progress. We've launched two vaccine boosters for the current fall/winter season to meet different market demands and have received authorizations or approvals worldwide for these vaccines.\n\nWe previously shared that 1273.214, which targets Omicron BA.1 induced significantly higher titers than 1273 against the BA.1 and BA.4/5 sublineages in the clinical trial. And mRNA-1273.214 is now authorized in the United Kingdom, Switzerland, Canada, Australia, European Union, Japan and other countries. For mRNA-1273.222, which targets the Omicron BA.4/5 variants, the phase two/three study is ongoing, and we expect data later this quarter. MRNA-1273.222 is authorized in the United States and now also in the United Kingdom, Switzerland, Australia, Canada, the European Union, Japan and other countries.\n\nNow moving to slide nine. I'll review our respiratory vaccines pipeline. I will cover the phase three studies in detail on the next slide. Here, I want to highlight the progress in the earlier-stage studies with our respiratory vaccines.\n\nMRNA-1020, 10.30 for seasonal influenza is in a phase one/two study and is now fully enrolled. MRNA 1345 for RSV in the pediatric population is now fully enrolled in a phase one study. Moving now to our combination respiratory pipeline, where we have made meaningful progress, mRNA-1073, our combination vaccine for COVID and flu, is in phase one/two and is fully enrolled. I'm very pleased to announce that our combination COVID, flu and RSV vaccine, or mRNA-1230, has also started enrolling in its phase one/two study.\n\nWe announced a new development candidate, mRNA-1045, this one targeting combination of RSV and influenza, and that has started in its phase one/two study. And lastly, in our combination vaccine pipeline, we also have a pediatric vaccine covering hMPV and PIV3 that study is ongoing in the fully enrolled phase oneb study. Finally, our endemic human coronavirus vaccine is in preclinical development, along with our pediatric RSV, HMPV combination vaccine. Now to review our phase three flu and RSV programs on slide 10.\n\nFor flu, our phase three immunogenicity study in the Southern Hemisphere is fully enrolled with 6,000 participants with the data readout expected in the first quarter of 2023. As we've previously noted, regulators have indicated support for an accelerated approval pathway for our seasonal flu vaccine candidate, pending the study -- the results from this study. We've also started enrolling our phase three efficacy study in the Northern Hemisphere and have now enrolled more than 10,000 participants. Timing of this confirmatory phase three efficacy readout will be driven by flu case accruals in the study and could come as early as this winter.\n\nLooking to RSV. Our pivotal phase three efficacy study in older adults has now enrolled more than 35,000 participants. As we previously mentioned, our primary endpoints in this study are safety and vaccine efficacy. Timing of the phase three efficacy readout will be driven by RSV case accruals in that study.\n\nAs we're now in the midst of a very strong RSV season, we continue to expect that the result will be available this winter season. Moving on to our latent and public health vaccine portfolio. Our CMV vaccine is ongoing in a phase three study. Our EBV vaccine to prevent infectious mononucleosis is in a phase one study, while our EBV vaccine to prevent longer-term sequelae such as cancer and multiple sclerosis is in preclinical.\n\nWe have two HIV phase one trials ongoing, and our HSV and VZV vaccines are in ongoing preclinical studies. Finally, our public health vaccine for Zika is ongoing in a phase two trial and our Nipah vaccine is ongoing in a phase one study. Now let's take a look at our therapeutics pipeline on slide 12. First, I want to note that AstraZeneca notified us that after a portfolio review, they are returning the rights to the IL-12 program to us.\n\nThey are concluding the phase one study, and we will then evaluate next steps for the program for ourselves. Second, we're excited that our checkpoint vaccine has started dosing its first patient in a phase one study. And finally, our partner, Vertex, expects to submit an IND for our mRNA cystic fibrosis program by the end of this year. We recently shared updates on our personalized cancer vaccine, PA and GSD1a programs at our latest R&D day and I will talk to those in more detail in the upcoming slides.\n\nNow recall at R&D Day that we shared data from two rare disease programs. The first is in our propionic acidemia program, which is a multi-dose study. And as of September, we had accrued six patient years of experience on the drug and administered well over 100 doses. It has generally been well tolerated, which is encouraging.\n\nWe've also seen an encouraging trend in the reduction of biomarkers and been observing a numerical decrease in the frequency of metabolic decompensation events, which is also really encouraging given the severity of these events for propionic acidemia patients. In the GSD1a program, we shared an early set of data from the first two patients in the first cohort. The study is a single ascending dose study that runs a fasting challenge in a controlled and safe environment in patients with GSD1a who are unable to normally fast or go without food for long periods of time without becoming hypoglycemic. Both patients in the first cohort have demonstrated that mRNA-3745 was well tolerated and showed an extension of fast duration and normalization of key biomarkers, including glucose, which we think is very encouraging signal of activity.\n\nTo close, I wanted to remind everyone that we expect our phase two results from our personalized cancer therapeutic by the end of the year. The randomized study comparing PCV plus KEYTRUDA versus KEYTRUDA alone enrolled approximately 150 resected melanoma patients with a high risk of recurrence. The primary endpoint is to prevent is recurrence-free survival. As Stephane mentioned earlier, our partner, Merck exercised the option to jointly develop and commercialize mRNA-4157, and we look forward to sharing that data this quarter.\n\nWith that, I will hand it over to Arpa.\n\nArpa Garay -- Chief Commercial Officer\n\nThank you, Stephen, and good day to everyone. I will start with a review of sales on slide 16. Sales to the US were $1 billion in the third quarter and were mainly from deliveries of mRNA-1273.222, our bivalent booster targeting Omicron BA.4/5. Sales to Europe of mRNA-1273.214 were also $1 billion and the rest of the world totaled $1.1 billion.\n\nThrough the first three quarters of the year, US sales were $3.4 billion, sales to Europe were $4.5 billion and sales to the rest of the world accounted for $5.7 billion. In both the three- and nine-month periods, we saw geographical diversification of sales across these key regions. We recognize there are questions regarding the 2023 market and long-term COVID booster potential and we wanted to walk you through how we are thinking about it. As we transition into an endemic market, there are important factors we considered in our commercial outlook.\n\nThese include the ongoing medical need for COVID boosters and the potential size of the annual booster market. We use the seasonal flu market to frame the opportunity, and I will take you through our thinking on that in the next couple of slides. I will also detail some of the factors underlying the transition to the commercial market in the US in 2023. I'll then wrap up the COVID section with an overview of our currently signed contracts and our outlook for additional expected contracts in 2023.\n\nFinally, I'll close with a reminder of what's coming in 2023 from our respiratory vaccine franchise a potential launch timings that we shared recently at our R&D Day in September. So starting with the medical need for COVID boosters, the chart on slide 18 compares hospitalizations and deaths associated with the seasonal flu and COVID over a relevant time period. For flu, we looked back at the past 10 influenza seasons in the US before COVID-related interventions disrupted the typical flu season. And for COVID, we looked at hospitalizations and deaths from October 2021 to September 2022, which covers the period of widespread immunity against SARS-CoV-2 and its variants either through vaccination or infection.\n\nWe believe this period is a close proxy to what population immunity to COVID could be in an endemic season. As you can see here on the chart, hospitalizations due to COVID during the past 12 months are 3x higher than the 2017, 2018 flu season, which represents the year with the highest medical burden within the 10-year period included in the analysis. And the deaths due to COVID are even higher, coming in at a rate of seven times higher than the same severe flu season. This comparison shows the higher medical burden of COVID in a period that we believe more closely approximates an endemic season and underscores the need for boosters in the endemic phase.\n\nIt also helps frame the potential endemic annual COVID market, which I want to take you through on the next slide. To size the endemic COVID booster market, we start with the flu market volumes. Volume in the annual flu market is approximately 500 million to 600 million doses around the world. The size of the market is highly dependent on the number of doses, as well as global price as shown in the sensitivity table on the left-hand side of the slide.\n\nThe prices shown here are purely illustrative to demonstrate a range of outcomes on global pricing. Ultimately, global price for COVID boosters will reflect sales mix and differential pricing across markets. Our endemic pricing will be focused on the value that the vaccine brings to healthcare systems around the world. As we move to an endemic market in 2023, key factors that will impact our volume in the year include the medical need, ongoing viral evolution, recommendations from public health authorities and consumer motivation to vaccinate.\n\nSo while we believe that volumes in the global endemic COVID market should approximate to at least 600 million doses over time, we believe it is too early to reliably predict the variables impacting the volume of doses in 2023. Turning to slide 20 and specifically addressing the transition to the commercial market in the US We anticipate a more fragmented customer base, including private payers, health plans, pharmacy chains, individual pharmacies and physician offices. We also anticipate reduced predictability in orders, seasonality of deliveries similar to flu vaccine deliveries, a shift to full distribution costs assumed by Moderna, as well as other major factors in the US such as shifting to a single dose presentation and continued innovation and product differentiation. Moving on to slide 21, we summarize the contracts that have been signed so far for 2023.\n\nWe had advanced purchase agreements for the United Kingdom, Canada, Switzerland, Taiwan and Kuwait, totaling $2.5 billion. Additionally, we expect deferrals of $2 billion to $3 billion from 2022. These deferrals are from the countries listed on the slide. Together, these advanced purchase agreements and deferrals totaled $4.5 billion to $5.5 billion in sales for 2023.\n\nFinally and very importantly, we have a number of countries where we expect additional 2023 contracts to be signed. We are working to secure 23 orders in the US, EU, Japan, Australia, Asia, Latin America and COVAX. And we expect to have visibility into these orders as contracting season begins later this quarter and continuing into next year. So to summarize the COVID outlook on slide 22, with the continued higher medical burden of COVID relative to flu, we expect the endemic COVID vaccine market could be as large or larger than flu market volumes over time.\n\nThe US market is transitioning to a commercial market and we believe we are well-positioned to serve its evolving needs. And finally, we have established a base of confirmed contracts of $4.5 billion to $5.5 billion in 2023, to which we anticipate adding a number of important orders in the months ahead from key markets, including the US, EU, Japan and others. Now before I close, I'm excited to review the formation of our respiratory vaccine franchise that we highlighted during our R&D Day in September. As early as next year, we could be expanding into flu and RSV.\n\nAnd as we look at flu and RSV, combined with COVID, they lead to more deaths annually than Alzheimer's, stroke or diabetes in developed markets. As Stephen highlighted, depending on case accruals and vaccine efficacy, we could see data from our flu and RSV phase three trials this winter. We are actively preparing for the commercial launches for these additional respiratory vaccines and will leverage the COVID commercial infrastructure that we are currently building. With that, I'd like to turn it over to Jamie.\n\nJamie Mock -- Chief Financial Officer\n\nThank you, Arpa, and hello, everyone. It's a pleasure to be here with you today. After two months at Moderna, I am even more excited about our company's future and the role we are playing in bringing a new generation of medicines to patients. For those of you whom I haven't had the pleasure of meeting yet, I look forward to working with you in the months and years ahead.\n\nToday, I will start by providing additional color on our third quarter results and capital allocation priorities and finish with the view on the key drivers on our remaining 2022 financial performance. Turning now to slide 25. Total product sales in the quarter of $3.1 billion decreased 35% year-over-year. The decrease was driven by lower sales volumes due to the timing of market authorizations, for our updated COVID-19 booster vaccines and the related manufacturing ramp-up with our CMO partners.\n\nAs a reminder, we received the marketing authorization for the US on August 31, for the European Union on September 2, and Japan on September 12. We anticipate that product sales will be higher in the fourth quarter of 2022 than in the third quarter as we continue to deliver against our supply contracts for booster vaccines. Cost of sales was 35% of product sales compared to 15% of product sales last year. This includes a charge of $333 million for inventory write-downs related to excess and obsolete COVID-19 products and expense for unutilized manufacturing capacity of $209 million and a loss on firm purchase commitments and related cancellation charges of $102 million.\n\nThese charges are driven by a shift in product demand to our Omicron-targeting COVID-19 bivalent boosters and costs associated with surplus production capacity. Research and development expenses were $820 million, an increase of 57% versus the prior year. The increase in R&D spend continues to be driven by our increasing and maturing pipeline, including phase three studies for RSV, flu, CMV and COVID boosters. Selling, general and administration expenses of $278 million increased by 65% year-over-year.\n\nThe growth in spending was driven by continued investments in personnel and outside services in support of the accelerated commercial and overall company build-out. The effective tax rate of 14% compared to 6% last year. As a reminder, we had a net operating loss carryforward of $2.3 billion at the end of 2020, which resulted in a nonrecurring benefit to the reported tax rate in 2021. After-tax net income decreased by 69% to $1 billion.\n\nDiluted EPS in Q3 2022 decreased by 67% to $2.53. As a result of our share buyback activities, the diluted weighted average share count reduced by 22 million shares to 412 million shares as of the end of Q3 2022 compared to 434 million shares the prior year. Turning now to the year-to-date financial results on slide 26. Total product sales for the first nine months of 2022 were $13.6 billion, an increase of 26% year-over-year.\n\nThe growth was mainly attributable to a favorable customer mix and higher manufacturing capacity to fulfill customer demand for the first half of 2022 compared to the first half of 2021. Cost of sales was 26% of product sales compared to 16% of product sales last year. The increase was driven by substantial demand reduction from COVAX, as mentioned in our Q2 earnings call, a shift in demand to our Omicron-targeting COVID-19 bivalent boosters and costs associated with surplus production capacity. After-tax net income was $6.9 billion, a decrease of 6% versus prior year.\n\nThe decrease in net income was primarily due to higher cost of sales, higher other operating expenses and a higher tax rate. Diluted EPS decreased by 3% to $16.46. Turning to cash and cash deposits on slide 27. We ended Q3 2022 with cash and investments of $17 billion compared to $18.1 billion at the end of the second quarter.\n\nThe decrease reflects the share buyback in Q3 of $1 billion and a federal tax payment of $0.8 billion. The ending balance of cash deposits for future product supply at the end of the quarter was $3.8 billion. Now turning to slide 28. Our capital allocation priorities remain unchanged.\n\nOur top investment priority has been and will continue to be reinvesting in the base business across multiple areas. R&D spending was $2.1 billion in the year-to-date September period, a 55% year-over-year increase. We continue to be excited about our mRNA platform and now have 48 development programs with multiple ongoing studies now in phase three. We increased our year-to-date capital expenditures by 88% year-over-year to $308 million as we expand our manufacturing footprint.\n\nWe also continue to invest in our commercial and digital capabilities, as well as the overall company build-out. Our second investment priority is to seek attractive external investments and collaboration opportunities to further expand the reach of Moderna's technologies and capabilities. We are considering attractive opportunities that enable and complement our platform and take a disciplined approach in evaluating potential outside investments. We are in multiple active discussions regarding additional external collaboration opportunities.\n\nThen after evaluating internal and external investment opportunities, we then assess additional usage of cash. In the third quarter of 2022, we repurchased 7 million shares for $1 billion. Year-to-date through September 30, we repurchased 20 million shares for $2.9 billion. In October, we completed the $3 billion authorization approved in February 2022 and began to utilize the additional $3 billion August authorization.\n\nNow let's turn to our 2022 updated financial framework on slide 29. We now expect delivery in 2022 against signed advanced purchase agreements of $18 billion to $19 billion, reflecting deferrals of $2 billion to $3 billion into 2023 due to short-term supply chain constraints. This total includes expected negative foreign exchange impacts compared to the contract value at signing, which we estimate to be approximately 1.5% of sales for the full-year 2022, assuming current exchange rates remain through the year-end. Our total cost of sales includes the cost of goods manufactured, third-party royalties, as well as logistics and warehousing costs.\n\nWe now expect our full-year 2022 reported cost of sales to be in the 26 to 28 percentage range, driven by the previously mentioned cost incurred year-to-date, a range on our Q4 volume and potentially further charges due to product updates. For R&D and SG&A, we continue to expect full-year expenses to be approximately $4 billion, driven by our maturing development portfolio and the global scale-up of our company. Based on current tax laws, we continue to expect our 2022 effective tax rate to be in the low to mid-teens as a result of benefits from the foreign-derived intangible income driven by our international business mix and stock-based compensation deduction. Finally, regarding capital expenditures, we now expect capital expenditures to be approximately $0.5 billion, slightly below the previous range of $0.6 billion to $0.8 billion driven by the timing of project completion.\n\nThis concludes my remarks concerning the financial performance, and I will turn the call back over to Stephane.\n\nStéphane Bancel -- Chief Executive Officer\n\nThank you, Jamie, Arpa and Stephen for this update. Before opening to Q&A, I just want to review some of the key priorities as we close out this year and look into 2023. For the remainder of the year, we'll continue to focus on delivering our updated Omicron boosters and drive 2022 sales. We're already working on 2023 sales contract in Europe, Japan and US from afar around the world.\n\nArpa and our team are also setting up with the US team and scaling it so that we can go private in the US market in 2023. We continue to execute on our pipeline. We look forward to be able to present when we have it, the phase two data of PCV expected before the end of the year. The team has done a great job to continue to enroll our phase three study for flu and RSV and CMV and I'm excited to see the advancement of our rare disease programs.\n\nLooking to next year, Arpa and the team and the entire organization, including manufacturing, is preparing for multiple vaccine launches in the year including commercial COVID market, as well as potential for our therapic programs to move very quickly in phase three. And finally, we hope that many of you can join us next week for our first ESG Day on November 10. The virtual event will be available from our webcast. With this, we'll be happy to take your questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] Our first question comes from Salveen Richter with Goldman Sachs. Your line is open.\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nGood morning. Thanks for taking my questions. On pricing here for the COVID vaccine, Pfizer is guiding to a price of 110 to 130 in the private market. Is this in line with what your discussions thus far suggest? And when do you think the private market will emerge next year? And then a second question here.\n\nYou were talking about some of the cost burden for next year with distribution costs and building out the commercial infrastructure around flu, RSV and trials. Could you just give us some directional color on the opex situation as we look to the forward?\n\nArpa Garay -- Chief Commercial Officer\n\nSo I can take the pricing question. So first, I'm not in a position to comment on competitor pricing. But as we think about our pricing as we evolve from a pandemic setting to an endemic setting, the real focus for us is on ensuring that our vaccines are priced based on the value that they provide to the healthcare system and reflect the cost-effectiveness guidelines that are set by public health authorities around the world. So for here, in the US, that would be ACIP.\n\nI think it's important to note that some of the pricing guidance that has been released in the past is really at a gross level, and we do anticipate some discounting across different channels. Additionally, here in the United States as we evolve into the commercial setting, it's also important to remember that for all ACIP-recommended vaccines, there is a zero out-of-pocket cost for consumers. So from a consumer access perspective, we do expect that the pricing will not be a barrier to uptake.\n\nJamie Mock -- Chief Financial Officer\n\nAnd Salveen, maybe I'll take the cost part of that. So yes, our costs will change in an endemic mode. Number one, there are presentation, preferences moving more to prefilled syringe and single-dose vials that I think will be different year over year. We have to continue to invest in bivalent vaccines, as well as Moderna will now pick up the distribution costs moving forward, particularly in the United States.\n\nAnd so, yes, our cost profile will change and we'll come out and update in terms of what that means at a later date.\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question comes from Matthew Harrison with Morgan Stanley. Your line is open.\n\nMatthew Harrison -- Morgan Stanley -- Analyst\n\nGreat. Good morning. Thanks for taking the question. I was hoping to ask on PCV.\n\nJust given this is a phase two study that's proof of concept, a p value greater than 0.05 could be considered a success in this study. So maybe you could just help us think about how you're thinking about a success in this study? And then just given that it's an open-label study, how much data is available to you internally?\n\nStephen Hoge -- President\n\nThanks, Matthew, for the question. So as you said, it's a phase two study, but it's actually a quite sizable one. There's 150 patients, and they were randomized two-to-one, so 100 patients have received the combination therapy and 50, the standard of care, which in this case is KEYTRUDA. That's actually by a sizable sample and does allow for us to look at efficacy.\n\nNow it is a phase two study. And so, we didn't prespecify a statistical threshold that we want to hit, but we are looking at hazard ratios across that, and we will get p values. I won't comment on a specific p value or hazard ratio at this time. It's premature to do so.\n\nBut obviously, we are looking against standard of care to demonstrate a significant benefit over that standard of care. It's just important to note that the study wasn't powered for that at 150 participants. And so, we will be looking to that hazard ratio and the p value as indicative. And then, depending upon the strength of that result, if it is, in fact, as you said, a p-value less than 0.05, and there's a very strong result, we will then make our subsequent decisions about how to proceed forward with development.\n\nObviously, the better -- the stronger the benefit in terms of the hazard ratio and the lower the p value, the more we're going to move very quickly toward advancing that program.\n\nOperator\n\nThank you. Our next question comes from Edward Tenthoff with Piper Sandler. Your line is open.\n\nEdward Tenthoff -- Piper Sandler -- Analyst\n\nGreat.  Thank you very much and congrats on all the progress. And congrats on all the progress. Appreciate all the detail on sort of the outlook, both for the COVID market and as we move forward. Questions back to my favorite topic, the orphan diseases.\n\nWith this proof of concept in hand from the first programs, is there a desire to be expanding the pipeline similar to what you did with vaccines upon proof of concept with COVID?\n\nStephen Hoge -- President\n\nThanks, Ed, for the question. And so, I think the short version is, absolutely. In any of our modalities, whether they're cancer vaccines or infectious vaccines or now our orphan disease, where we believe we've achieved a technological proof of concept, where we've achieved what we wanted to do in patients, we look to rapidly expand the number of diseases and implications that we can bring forward that technology in. And in the case of orphan rare diseases, as we shared, we are extremely encouraged by the data across two different diseases using two different medicines that now suggest we have, obviously, acceptable safety and tolerability profile, which is of primary importance.\n\nBut more importantly, for efficacy, we're starting to see really encouraging results in terms of biomarkers or even from a dynamic readout and potential of benefit for patients. And so, given the strength of those two pre prior results, we've actually moved quickly to expand our pipeline. We have a number of other programs that are already publicly disclosed and moving forward in clinical trials, some including M&A are already in clinical studies. And as I mentioned at our R&D Day, we're looking to substantially expand that pipeline of programs.\n\nAnd so, we announced the OTC program as one instance of that just a month ago. But you can expect that we'll be adding substantially to that. Our goal will be to more than double that pipeline in the years ahead as we expand our investments in rare diseases on the back of that derisked clinical data.\n\nEdward Tenthoff -- Piper Sandler -- Analyst\n\nExcellent. Thank you.\n\nOperator\n\nOur next question comes from Michael Yee with Jefferies. Your line is open.\n\nMichael Yee -- Jefferies -- Analyst\n\nHi. Good morning. Thanks for the questions. Maybe a question for Stephen.\n\nIn RSV, we've had two players readout results. I think one is 80%, plus or minus. One, 66% plus or minus, depending on the endpoint. So I wanted to ask you how you view the bar in terms of being competitive and whether there's some differentiation opportunity for your RSV vaccine that could readout soon.\n\nSo talk a little bit about that? And then just as a follow-up to PCV. Again, just to clarify, Merck had opted in. Can you comment on, I guess, the idea of the timing just before the data whether they had insufficient information or maybe just talk a little bit about the implications of that opt-in just before the data?\n\nStephen Hoge -- President\n\nYes. Thank you for the question, Michael. So first on RSV, obviously, we're incredibly encouraged by the results that have been seen by other vaccines given our platform has previously demonstrated its potential in COVID specifically, in respiratory vaccines. We think it bodes well for us in terms of that study.\n\nThere's a bar that's been established in terms of severe disease, as you referenced, in the 80% range. We are looking at three symptom or \"severe disease.\" It's hard to compare between the studies. They're not conducted at the exact same time, and they always have exactly the same definition, as you know. But we would absolutely hope and expect that the type of efficacy we're going to see against severe disease will be on par with, and I would even hope for better than what's been seen by others.\n\nIt's certainly been the case with our platform technology compared to others in terms of COVID that we've been able to see those sorts of potential benefits. I'll also note that we've looked at titers, and we previously shared our titers, as well as other companies have from their early clinical phase one and phase two results and we believe that the boosting of neutralizing RSV titers against both RSV-A and RSV-B that we were achieving was on par, you could always argue perhaps better or worse, but on par with what others had seen. So we're quite encouraged by that. And I think we're looking forward to the RSV efficacy results over this coming winter.\n\nOur bar for this is to be as good or better than others have been. In terms of PCV. In terms of PCV, Merck has opted in, as you said, and I know Matthew asked the question as well. So it is an open-label study, as we previously disclosed.\n\nAnd so, we have been following events through that study, those that have received the cancer vaccine in combination with KEYTRUDA versus that have not. And as we've now passed the one-year mark for a follow-up of the last patient to be randomized in that study, we now have at least a year of follow-up and then [inaudible] basis, two-plus years of follow-up across those two different cohorts, those that received combo and those received standard of care, KEYTRUDA. That data was known to us and Merck. But it's important to note, that's an ongoing uncleaned and not primary analysis.\n\nAnd so, while it is open label, the correct thing to do at this point now is begin the closing process, get all of the scans, review all of the data associated with the clinical trials, make sure nothing was missed. And in that cleaning process, then finalize that database and conduct the primary analysis of the study, which is to evaluate the hazard ratio and the statistical significance of that hazard ratio between the two arms. That's actually the process we're undergoing right now. And it's important that before we make a decision on whether that data is positive or negative and the strength of that positivity, how quickly we move forward per Matthew's question into whatever the next data developments are, that we conduct all of the right diligence on those datasets.\n\nAnd that's the work that's ongoing right now. So while Merck made their opt-in decision, which was really more calendar and contract-driven, based on, obviously, having access to that open label information, the really important analysis, the primary analysis, the one on which we will base our decisions of what to do next as well regulators and others is the one that we're trying to conduct right now and is not yet completed, but we do expect that result in this quarter.\n\nMichael Yee -- Jefferies -- Analyst\n\nThanks. Very helpful. Appreciate it.\n\nOperator\n\n[Operator instructions] Our next question comes from Gena Wang with Barclays. Your line is open.\n\nGena Wang -- Barclays -- Analyst\n\nThank you. Steve, maybe just follow-up with your comment on Merck. I just want to confirm that Merck does see the open-label data for the recurrence-free survival rate? And then also wanted to confirm that the control on the P1 model that will be in line with historical data that's in the low seven days, that was the rate. And also, how would you share the data for the PCV phase two data? Another question is regarding slide 19, the global COVID market opportunity.\n\nSince we expect significant increase in price in the US, what is your expectation for the ex-US price change across major markets since you're giving like $20 to $40 price range?\n\nStephen Hoge -- President\n\nGena, thanks for that question. So again, it was not a continuous dataset. It was an open-label study. And so, per our agreement with Merck, they had the right to know what do we know about the program at the point in which they were -- had to make their decision about whether to opt in or not.\n\nAnd so, of course, what we did is we provided them the access to the data of the study at that point in time. And as you all have noted, they elected to opt in to that program, and we are encouraged by that decision on their part. They obviously do have a tremendous amount of experience. And so, in terms of the control arm, you obviously have the KEYNOTE-054 study, which is their prior registrational studies.\n\nThey have experience of what to expect in a control arm. And I think you can infer whatever you like from their decision to say that they believe it's worth opting into that program and proceeding to the primary analysis that we're conducting right now. We will obviously be able to compare the control arm, that 50 patients who just received KEYTRUDA as standard of care against the registrational studies that those are done and actually the many years of patient experience that companies like Merck and others have, just to be confident that, in fact, if we are seeing a difference between -- we are seeing a hazard ratio of difference that it's not a difference in terms of that control arm, which will bode well because, again, patients were randomized in this study. Now in terms of the data we'll have in share, at this point, all we'd expect to share this quarter, once we've completed the analysis, the primary analysis on efficacy in this study, is just the top line data in terms of PCV, which, as I mentioned previously, is looking at the hazard ratio and then the characterization statistically of that.\n\nIn subsequent and appropriate for, including meetings and otherwise, we will look to then share the fuller dataset over time.\n\nArpa Garay -- Chief Commercial Officer\n\nAnd then I can take the pricing question. Your question was primarily around ex-US pricing and our expectations. A couple of factors are coming into play here. The first is the timing of where and how quickly, ex-US markets are going to be shifting from more of a central procurement pandemic setting to an endemic setting.\n\nSo we are looking at how different regions and countries are going to be shifting back toward a more endemic or a commercial approach. When we get to that position, we will be, again, pricing the vaccine according to the value that it provides in different healthcare systems around the world. And again, following established systems around cost effectiveness guidelines based on the country regulations and the public health authority guidance. The overall global average price, we do anticipate will be largely driven by the regional mix.\n\nSo it is hard to predict what that price will end up being. But we'll continue to share more as we see evolving demand, as well as evolving pricing.\n\nOperator\n\nThank you. Our next question comes from Tara Bancroft with Cowen. Your line is open.\n\nTara Bancroft -- Cowen and Company -- Analyst\n\nHi, guys. Thanks for taking the questions. So is it fair to say that the 2023 signed APAs of the $4.5 billion to $5.5 billion is the floor? And what minimum revenue do you think could be added from the geographies that you're expecting contracts from? And related to this then, to what extent does it include sales in the key markets that were mentioned in the press release, like, for example, does it include the option from the latest US agreement?\n\nArpa Garay -- Chief Commercial Officer\n\nThank you for the question. So the $4.5 billion to $5.5 billion is the floor sales that we anticipate in 2023 as we already have signed APAs, as well as deferrals from 2022 into '23. This number does not include options from the US government and we do anticipate additional sales coming from key markets such as the US, EU, Japan, Australia, as well as regional sales in Latin America, Asia Pacific, Middle East and COVAX. So again, to answer your question specifically, this is what we anticipate to be the floor but still unknown in terms of the total opportunity as we evolve, particularly in the US market into a commercial setting.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from Jessica Fye with J.P. Morgan. Your line is open.\n\nJessica Fye -- JPMorgan Chase and Company -- Analyst\n\nHey, guys. Good morning. Thanks for taking my question. Are the short-term supply constraints mentioned the reason for delivery delays resolved at this point? How does bivalent booster uptake so far this fall compared to your expectations? And as it relates to China's potential orders of Western mRNA vaccines, what's your level of optimism that that could come to fruition within some reasonable timelines over the next year or so?\n\nStéphane Bancel -- Chief Executive Officer\n\nSure. So it's Stephane. I'm going to take the first question on supply, and then I'll turn to Arpa for the commercial PCUs. As I shared in my remarks, we actually have to deal with very complex third quarter from a manufacturing standpoint, not launching one product but two, doing this kind of in a record times, as you are aware.\n\nWe are gearing from this at the end of June that they wanted to be five products for the US And that product was available in pharmacies all the weekend. And the shift from 10 dose per vial, which is what we sold with 1273. And for the first time, selling five dose per vial so basically doubling the number of vials needed or the same number of doses. And so, we've had quite a number of pain points with Fill/Finish manufacturers.\n\nWe are working through a lot of those issues, a lot of stores, a lot are still being sold as we speak. There are many lessons to be learned that we are working on to put robust fixes for the end of the year but also that we are in a much better place for fall of 2023. Arpa?\n\nArpa Garay -- Chief Commercial Officer\n\nSure. So the first question around vaccine uptake. We are seeing some variability around the world in terms of vaccination rates with the best data thus far really coming from the US market. As we look at 2022 vaccination uptake versus 2021, specifically for COVID boosters, we're actually tracking a similar pattern, and it's a little bit early to see what November, December and the rest of the fall and winter season will look like.\n\nBut the early rates while in absolute terms are fairly low, they are tracking the trends that we expected compared to last year. Around the world, we are seeing some markets with very high uptake of explanation rates, really driven by public health authorities. And in other markets, we're still looking at sort of the dynamics that have played out this year with populations have recently gotten their fourth booster in the summertime and regulatory bodies recommending that they wait a few months before they get their fifth booster. So I think more to come as we continue to track around the world, but the early signs of uptake are encouraging.\n\nYour last question on China. We continue to look at the opportunities in China. Nothing new to report here as of now, but it is certainly a key market of interest for us commercially.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from Geoff Meacham Jeff with Bank of America. Your line is open.\n\nGeoffrey Meacham -- Bank of America Merrill Lynch -- Analyst\n\nMorning, guys. Yeah, thanks for that question. Just had a couple. Just wanted to follow up on your last comment.\n\nYou mentioned booster adoption has been mixed, depending on geographies. Is this something that you -- that Moderna expects to further invest in with regard to value boosters, additional follow-up and studies? That's the first question. And the second one, maybe more for Stephane, the balance sheet remains pretty strong. You guys have done some buybacks, but we haven't seen sort of a cluster of acquisitions or any sort of real capital allocation.\n\nWhere would M&A sort of fall in your priority list with uses of cash? And does that change as COVID continues to sort of wind down with regard to the revenue base '23 over '22 and maybe even more modest going forward?\n\nArpa Garay -- Chief Commercial Officer\n\nSo to the first question on if we are investing in the vaccination rates, as I shared earlier today, the medical need continues to be clear for COVID booster vaccination, especially as we compare it to the hospitalizations and deaths compared to flu. So what we're really doing is partnering with governments and public health agencies to share the data that we have in terms of the ongoing medical need at a country level, as well as the value of COVID booster vaccination in their populations. And it's this partnership with the public health authorities that's really driving increased urgency and action around vaccination. So that's our approach.\n\nSo we believe public health authorities are in the best position to encourage a vaccination for their populations.\n\nStéphane Bancel -- Chief Executive Officer\n\nThanks, Arpa. And on the balance sheet side, I mean our biggest strategy, as Jamie noted in his remarks, is unchanged. As you know, we are looking and have already signed deals in terms of technology licenses and also looking at M&A. As we've said before, we still focused on nucleic acid.\n\nWe don't really think it's a good strategic use of our capital to buy small molecule asset or large molecule or cell therapy or else. So we really want the same nucleic acid. The bigger team is very active, as Jamie knows and his team knows. They are doing a lot of work where we're doing a lot of things.\n\nAs I've said in the past, we'll remain disciplined in terms of understanding the risk have on the technology side, on the biology side, understanding value. We're here to create value, not to manage press release. But the team is very active. We are looking at diligence on a regular basis but not everything that we look at comes out to be something I think we can create a lot of value with.\n\nBut we continue to look, and I would not be surprised if we continue to add partnerships in the months and quarters to come.\n\nGeoffrey Meacham -- Bank of America Merrill Lynch -- Analyst\n\nThank you, guys.\n\nOperator\n\n[Operator instructions] Our next question comes from Eliana Merle with UBS. Your line is open.\n\nEliana Merle -- UBS -- Analyst\n\nThanks so much for taking the question. Just another one on RSV. In terms of thinking about mRNA as a vaccine modality in the context of RSV as we move beyond COVID vaccines, I guess how are you thinking about the potential for mRNA and potential advantages relative to other more traditional vaccine modalities in the context of RSV? And I guess, what we could learn from some of the upcoming readouts, both, I guess, with opportunity in RSV, but also what it could tell us about mRNA potential in vaccines relative to other modalities more broadly?\n\nStephen Hoge -- President\n\nGreat. Well, thank you for the question. So first, we have previously demonstrated with our platform in COVID and in fact, in some recent publications even in flu, that we generally see a really broad-based and balanced immune response. So we tend to see very high T cells and cell-mediated immunity and I would argue some of the highest, if not always the highest antibody neutralizing titers.\n\nAnd both of those are really important as you start talking about older adults and respiratory infections, which is probably why we've tended to see higher efficacy with the mRNA platform than other approaches in that high-risk population, including in COVID over the last couple of years. And so, those features of the platform, the ability to generate really strong cell-mediated immunity, boost T cells, which are important for preventing severe disease but also pair that with achieving very high titers for a seasonal protection, where, again, you get high neutralizing titers, which provide a barrier to the amount of infection that you're going to get, which is really, really important for older adults because they're cell-mediated responses, they're innate immune system just isn't as strong, even with a great vaccine. And it's that combination that we think defines our advantage from a platform perspective and why we're so excited about developing a portfolio of respiratory vaccines across all the leading killers in that viral -- killers in that space, for older adults. And RSV just fits right into that.\n\nAs we all know, right now, there is a huge unmet need in that space. We're very pleased to have enrolled -- fully enrolled that phase three study. And we're going to -- we're actually quite pleased with the titers and cell-mediated immunity that we saw in early development, some of which we presented publicly. So we're looking forward to that efficacy readout.\n\nIn terms of other approaches, let's also just celebrate that recombinant protein and viral vector and adjuvant approaches have all shown really exciting progress in the last two -- in the last really one year, one and a half years across a range of companies. RSV has a huge unmet need. It will take many different approaches to have an impact there. And if anything, I think the success of others gives us optimism that our approach is going to also be successful, but there are likely going to be many different solutions to this for older populations.\n\nWe do believe that our platform has an advantage. But given the success of the other vaccines and really, I think, quite encouraging efficacy results, it's important to note that there are many good successful options out there, and it may not always be possible to differentiate between them, but we hope to be in that first class.\n\nEliana Merle -- UBS -- Analyst\n\nGreat. Thanks.\n\nOperator\n\n[Operator instructions] Our next question comes from Joseph Stringer with Needham. Your line is open.\n\nJoseph Stringer -- Needham and Company -- Analyst\n\nGood morning. Thanks for taking our questions. Just a clarification on the deferrals from the 2022 contracts, the $2 billion to $3 billion. Are those locked in signed APAs and they're just being deferred to '23? Or is there any optionality built into that? And then the second question is just broader based pipeline.\n\nYou're expanding pipeline, 48 programs, 35 clinical trials. But -- I was curious if you could comment on the relative mix of the pipeline, respiratory vaccines, immuno-oncology, rare disease, where it stands now and how you sort of see that evolving in that relative mix of the pipeline programs over time?\n\nJamie Mock -- Chief Financial Officer\n\nSo maybe I'll take the first one quickly. So yes, those are locked in advanced purchase agreements for 2023, and so they're just shifting to the right from 2022.\n\nStephen Hoge -- President\n\nGreat. And on the broader question of the pipeline, as you mentioned, we've got 48 programs. Now, multiple phase threes ongoing with some, we hope to be quite imminent readouts. As you look at it, right now, we have -- most of our late-stage pipeline is respiratory vaccine commercial, right? We have four programs there and we expect the flu and RSV data to come up quickly.\n\nAnd we will then move rapidly in respiratory into combination vaccines. And so, we have three adult combination vaccines and clinical studies. We have two pediatric respiratory combination vaccines that are moving forward. And that you should expect to expand into very quickly, we would hope, registrational studies over the coming period, which will allow us to then build out what we hope will be the best respiratory portfolio, both from a monovalent vaccine perspective, but most importantly, from combinations against the viruses that matter in the different populations that we really want to protect, particularly older adults and the very young.\n\nSo respiratory will be a growth area for us for the near term. But we will -- you'll start to see some diversification, again, talking about the late-stage. We already have a CMV phase three program, which is up and running and enrolling, it has been. And you should expect this in our latent virus vaccines to add additional late-stage programs.\n\nWe're quite passionate about Epstein-Barr virus as you all know, and we expect to move that in. And so, you'll start to see some first diversification in terms of our latent virus portfolio, some of that's already happened with CMV. The couple of things that will come quickly as well are we hope that the readout from our personalized cancer vaccine, therapeutic vaccine program. And it's really a therapeutic because we are preventing cancer from recurring, but we're intervening in somebody who's got that cancer already.\n\nAnd because of that, it really has a therapeutic profile to it as an intervention. And that therapeutic readout that we expect to have over the next month or so this quarter will trigger, if it's successful, moving into pivotal stage studies. And as we all know, immuno-oncology is obviously a competitive space. It's a space where there's still substantial need to improve upon the current IO therapy, and there are many different histologies and types of cancer in which it will make sense to develop a program if we show a benefit.\n\nSo that expansion could happen very quickly and will be the large diversification into oncology in the therapeutic context outside of the vaccine space. And then, the last one is late -- is rare diseases, which we spoken about. We have a couple of programs that have already started to show some very encouraging results, both pharmacology and potential clinical readouts. And as soon as we decide on doses, for instance, the propionic acidemia program and get confident that we've got alignment with regulators on the path forward for that program, you should expect us to move into pivotal studies there as well.\n\nAnd then, as I said and the answer to the prior question, that will not just be a one-off for us. Once we really believe we've got a modality, we will be bringing forward many programs in succession in parallel there. And so, as you look forward on how do we think about the diversification of the pipeline is a bigger question, it really is a question of time horizon. Right now, it's a lot of respiratory and latent.\n\nVery quickly though, we expect to be both expanding that respiratory and expanding our move in to therapeutics, particularly cancer and rare metabolic disease. And that could happen in quite short order based on upcoming clinical readouts.\n\nJoseph Stringer -- Needham and Company -- Analyst\n\nGreat. Thanks for taking our questions.\n\nOperator\n\n[Operator instructions] Our next question comes from Mani Foroohar with SVB Securities. Your line is open.\n\nLili Nsongo -- SVB Securities -- Analyst\n\nThis is Lili Nsongo on for Mani Foroohar. I just had a question related to volume to be expected. So I know that your volume prediction, you mentioned that you'd exclude 2023 based on because of the variability there. But I was wondering for 2023, how much of these volumes or revenues anticipate to be driven by the APAs? And also as you move to our more endemic model for local vaccine use continue to anticipate APAs in the future?\n\nArpa Garay -- Chief Commercial Officer\n\nSure. Thank you for that question. As I outlined in terms of the volume expectations for next year, outside of the signed APAs, we are looking at a number of variables that could impact the total volume. So in the long term, we do believe we should approach 500 million to 600 million volume comparable to the flu volumes that exist today.\n\nIn 2023, there will be a range depending on the viral evolution, the ongoing medical need across different regions, where we see public health authorities coming out with recommendations, as well as just a broader consumer appetite to vaccinate. So the reason for the sensitivity on the volume that I shared earlier is we still have a number of variables as we're continuing to transition into an endemic stage. And so, in the short term, we don't have a clear picture of that total volume and what that could look like, but we do believe, from a medical perspective, over time, we should be approaching at least the same volumes as the flu market.\n\nOperator\n\nThank you. And I'm not showing any further questions at this time. I'd like to turn the call back over to Stéphane Bancel for any closing remarks.\n\nStéphane Bancel -- Chief Executive Officer\n\nWell, thank you, everybody, for joining the call today and for your thoughtful questions. We look forward to speaking to many hours to come -- days to come and also welcoming you next week for our first ESG Day. Have a great day. Bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLavina Talukdar -- Head of Investor Relations\n\nStéphane Bancel -- Chief Executive Officer\n\nStephen Hoge -- President\n\nArpa Garay -- Chief Commercial Officer\n\nJamie Mock -- Chief Financial Officer\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nMatthew Harrison -- Morgan Stanley -- Analyst\n\nEdward Tenthoff -- Piper Sandler -- Analyst\n\nMichael Yee -- Jefferies -- Analyst\n\nGena Wang -- Barclays -- Analyst\n\nTara Bancroft -- Cowen and Company -- Analyst\n\nJessica Fye -- JPMorgan Chase and Company -- Analyst\n\nGeoffrey Meacham -- Bank of America Merrill Lynch -- Analyst\n\nEliana Merle -- UBS -- Analyst\n\nJoseph Stringer -- Needham and Company -- Analyst\n\nLili Nsongo -- SVB Securities -- Analyst\n\nMore MRNA analysis\n\nAll earnings call transcripts"
}