{
  "companyName": "3D Systems",
  "companyTicker": "DDD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/3d-systems-ddd-q2-2022-earnings-call-transcript/",
  "content": "3D Systems (DDD 1.65%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nHello. Good morning and welcome to 3D Systems conference call and audio webcast to discuss the results of the second quarter 2022. My name is Kevin and I will facilitate the audio portion of today's interactive broadcast. [Operator instructions].\n\nAs a reminder, this conference is being recorded. At this time, I would like to turn the call over to Russell Johnson, vice president, treasurer, and investor relations. Please go ahead.\n\nRussell Johnson -- Vice President, Treasurer, and Investor Relations\n\nGood morning and welcome to 3D Systems second quarter 2022 conference call. With me on today's call are Dr. Jeffrey Graves, president and chief executive officer; Wayne Pensky, interim chief financial officer; and Andrew Johnson, executive vice president and chief legal officer. The webcast portion of this call contains a slide presentation that we will refer to during the call.\n\nThose following along in the phone who wish to access the slide portion of this presentation may do so on the investor relations section of our website. For those who have accessed the streaming portion of the webcast, please be aware that there maybe a few seconds delay and that you will not be able to post questions via the web. The following discussion and responses to your questions reflect management's views as of today only and will include forward-looking statements as described on this slide. Actual results may differ materially.\n\nAdditional information about factors that could potentially impact our financial results is included in last night's press release and our filings with the SEC, including our most recent annual report on Form 10-K and quarterly reports on Form 10-Q. During this call, we will discuss certain non-GAAP financial measures. In our press release and slides accompanying this webcast, which are both available on our investor relations website, you will find additional disclosures regarding these non-GAAP measures, including reconciliations of these measures with comparable GAAP measures. Finally, unless otherwise stated, all comparisons in this call will be against our results for the comparable period of 2021.\n\nWith that, I will turn the call over to our CEO, Jeff Graves for opening remarks.\n\nJeff Graves -- Chief Executive Officer\n\nThank you, Russell, and good morning everyone. I want to thank all of you for joining today's discussion of our second quarter results. As always, it's my pleasure to have this opportunity to speak with you and share my perspectives on our ongoing efforts to make 3D Systems the world's most innovative and successful provider of additive manufacturing solutions. As I look out on the environment, which 3D Systems is operating today, I see much to be optimistic about, but I also see a complex and volatile mix of business conditions that's challenging our ability to deliver consistent results during 2022.\n\nOn one hand, it's clear to me that the underlying trends supporting the broad adoption of additive manufacturing solutions in production environments are both strong and resilient across our diversified economy in applications ranging from the traditional manufacturing shop floor to the biotech laboratory, where life-saving medical treatments are created. Additive manufacturing technologies are enabling new levels of efficiency, flexibility, and innovation. These macro trends give me tremendous confidence in this industry and in 3D Systems role as a leader in it. It's this confidence that's guiding the strategic actions we are taking this year to consistently invest in new additive technologies and in our internal infrastructure to support future growth.\n\nOn the other hand, the new normal of our post-pandemic world is proving anything but normal. As we highlighted in yesterday's earnings released during the second quarter, 3D Systems, like many other companies encountered a more difficult global business environment that we had anticipated when we exited 2021. Our performance this quarter was impacted negatively by various macroeconomic and geopolitical factors, most notably stubborn supply chain issues, foreign exchange volatility, and our exit from the Russian market. While these factors such as these are often hard to predict or control, the reality is that they generated unexpected headwinds for our business during the second quarter and led to revenue growth and profitability below our internal expectations and no doubt below the expectations of our investors as well.\n\nLooking ahead to the second half of the year, we now believe that these factors combined with an expectation of dampened consumer discretionary spending driven by the rapid rise in the price of food, gasoline, and other daily necessities will impact our results. As a result, we are taking a more conservative stance on our outlook for the balance of the year and reducing our 2022 guidance. While we hope that these effects will be short lived, I feel it's important to be prudent to plan for them until the data suggests otherwise. Fortunately, we have the scale, the balance sheet, and then an exceptional customer base, which allows us to weather these short-term headwinds and continue to prudently invest for the strong growth opportunities we see when inevitably these headwinds subside.\n\nWe will do so with the same financial discipline that I hope you now have come to associate with this leadership team. For today's call, we will start with my summary comments on the quarter and the full year forecast and then Wayne Pensky will provide more details. For the consolidated company, after adjusting for the significant divestiture program that we completed in 2021, revenue for the second quarter grew 3.2% year-over-year and 7.8% in constant currency. As I mentioned, several exogenous factors have an outsized impact on the second quarter top line.\n\nThese include the rapid strengthening of the U.S. dollar and the frustrating continuation of components shortages and other supply chain disruptions that we experienced during Q1. They also include the ongoing tragedy of the war in Ukraine, which led us to exit the Russian market and has since negatively impacted business confidence in the European countries, such as Germany, where 3D Systems and particularly our industrial segment, has traditionally had a strong presence. We are not for these headwinds our consolidated revenue for the second quarter would have grown by healthy double-digits year-over-year as we had anticipated.\n\nSo while we are by no means satisfied with our quarterly results, it's important to view them in the light of the very challenging and volatile macro environment we faced during the quarter. To reinforce the message we have stated previously, with the increasing adoption of additive manufacturing and production environments across both our healthcare and industrial customer base, we anticipate delivering solid double-digit annual revenue growth once these shorter term headwinds subside. Turning to our divestiture adjusted segment performance, in the second quarter, revenue for our industrial segment grew 3.8% year-over-year and 11.2% in constant currency, while revenue for our healthcare segment grew 2.9% and 4.7% in constant currency. The foreign exchange impact on our industrial segment was quite significant due to that segment's exposure to manufacturers and service bureau customers in Europe and Asia-Pacific.\n\nIndustrial also experienced the biggest revenue impact due to our exit from the Russian market. In healthcare, second quarter revenue came in softer than expected. The slower growth in healthcare was driven largely by a postponement of elective procedures due to both a resurgence of COVID which once again limited patient access to hospitals and to greatly heightened inflationary pressures on consumers, which forced them to prioritize their purchases and postpone optional care, particularly in the dental market. Fortunately, once the impact of COVID again subsides, inflation begins to cool we expect these elective procedures to once again accelerate.\n\nHowever, to be clear in our updated guidance, we have modeled these conditions as now extending through the year, end of the year. So in short, we are reducing our revenue estimates for the full year assuming that the challenges we saw as we exited the second quarter continue throughout the remainder of the year. These primarily include the impact of currency, inflation, and supply chain disruption. In addition to these objective factors, we are also receiving clear signals from selected customers of their visibility into near-term demand trends has diminished.\n\nIn response, they are slowing their expansion plans and adjusting purchases to more tightly control inventory levels until their visibility into demand improves. Major drivers of this uncertainty are the potential impact of recessionary pressures on consumer confidence and the stubborn high inflation environment which is an important driver of reduced discretionary healthcare spending. Secondly, but not an insignificant factor driving us to be conservative in our forecast at this point, is the potential impact of energy supply constraints on our European customers stemming from increased EU government efforts to reduce their dependency on Russian oil and gas supplies. The net effect of any such effort, which looks increasingly probable, will be further dampening of demand on capital -- or capital investments, particularly in Germany.\n\nOne obvious area that influences our secondhand forecast is our dental business, which had previously enjoyed very strong double-digit growth in the U.S. and internationally. Given the current geopolitical tensions, the resurgence of COVID in China and the curtailing of consumer discretionary spending throughout Europe and the U.S., we are projecting slower growth in our dental segment in the second half. We once again view this as transitory is still material in our full year forecast.\n\nAs we exited the second quarter and evaluated all of these risk factors, we have updated our forecasts and are now taking a more conservative view of our projected full year performance, all of which is reflected in our updated full year guidance that Wayne will discuss in a few moments. While we are disappointed in having to take this step, we are doing so out of out of an abundance of caution and in the spirit of transparency to our investors. I can assure you we don't take this decision lightly and you have my commitment that will work hard to the balance of this year to regain momentum in our financial performance that we have built over the last two years. Actions we are taking include a variety of steps to optimize our cost structure, improve the efficiency of our operations, and refine our technology portfolio to assure exciting and profitable growth in the years ahead.\n\nReflecting this focus on operational efficiencies, in July, we took a major step forward by transitioning the sourcing and manufacturing activities for much of our polymer-based printers in-house and terminating our agreement with a major contract manufacturer. In sourcing these high-tech, high mix low volume printer platforms took months of planning and required us to incur some upfront exit and inventory costs. But over time, we believe this approach gives us much better control of our critical supply chain elements, resulting in reduced manufacturing costs, improved inventory management, and improved customer-facing metrics such as quality and delivery performance. This step in combination with our new product design efforts is a key element in delivering higher gross margin performance, the goal of which is to exceed 50% in the years ahead.\n\nWe have additional efficiency actions in flight. And we will update you on our progress as we move through the year. Before I end my remarks and hand over to Wayne, I want to comment on important progress and collaborations between 3D Systems and what I believe are two of the most world's most innovative technology partners. First, in June, our longtime biotechnology development partner, United Therapeutics, announced that in close partnership with 3D Systems, they have successfully printed the most complex objects ever produced by mankind, a complete human lung scaffold, consisting of over 4,000 kilometers of pulmonary vasculature and airways, with wall thicknesses measured in fractions of the diameter of a human hair.\n\nThe complexity and precision that we have now demonstrated using biocompatible materials and our most advanced production printing platform technology is truly groundbreaking and represents a key milestone in our regenerative medicine efforts. In the first unveiling of this incredible capability, United Therapeutics' president and CEO, Dr. Martine Rothblatt and 3D Systems' founder and chief technology officer for regenerative medicine, Chuck Hull, appeared at the CNN-sponsored LIFE ITSELF conference hosted by Dr. Sanjay Gupta and Marc Hodosh.\n\nIn her presentation, Dr. Rothblatt declared for the first time publicly, her vision to have these personalized bio-printed lungs cleared for human trial within five years. With our team's increasing momentum earlier this year, we expanded the scope of our collaboration to include the manufacture of human livers and kidneys. All of these efforts are tied to the singular goal of producing an unlimited supply of fully biocompatible human organs for transplantation to people who need them around the world.\n\nWhile the goals are ambitious, I believe more than ever with it, we will meet them. And I want to thank Dr. Rothblatt for our vision and an unwavering support in leading us there. With the foundation of progress that we have made in materials, hardware and controlled technologies for printing human organs, which I believe are quite unique in the world, one of my most important goals for 3D Systems has become the building of a world class regenerative medicine business around the emerging science of photopolymer based bio-printing.\n\nBuilding upon the incredible work our teams conducted with United Therapeutics in 2021, we acquired two development companies, Allevi and Volumetric Biotechnologies, in order to bring additional technology and specialized technical skills to our regenerative programs at 3D Systems. Having now integrated these exceptionally talented scientists and engineers, I am extremely pleased with our accelerating progress and committed to this groundbreaking technology, which offers the potential to improve countless lives of people who are suffering from chronic diseases or injuries around the world. With the progress that we have now made and the expanded capacity and capabilities we have in our program, two very exciting adjacent fields of applications have now opened up to us. One is the printing of non-organ human tissue for a wide range of applications within the body.\n\nWe are actively working on a targeted subset of these high-value organ and non-organ applications and we will be discussing progress publicly when appropriate. The second application field and one that we believe offers exciting and potentially near-term opportunities, is the printing of vascularized tissue for use of drug discovery. With our ability to now print vascularized tissue that enables very precise predetermined blood flow, while accommodating an enormous range of human cells, including both healthy and diseased cells, the effectiveness of developmental drugs, therapies can rapidly be evaluated in the laboratory. Our goal is to reduce the development time for new drug therapies and over time reduce or even eliminate the need for animal testing.\n\nGiven the ongoing exploratory efforts we have underway with leading pharmaceutical companies, we are excited about the potential of this technology and are now investing in both the people and the infrastructure we will need in order to bring this to commercial operation. You can expect to hear more about these efforts later this year. In support of these developmental efforts, we are also now putting in place for the first time in our company's history, a medical advisory board to provide input on each of our regenerative medicine programs. Under the leadership of Dr.\n\nStephen Klasko, a recognized visionary leader in the global healthcare community, in the second quarter, we were pleased and honored to announce the appointment of the honorable Dr. David Shulkin, former secretary of veterans affairs, and more recently, the Honorable Alex Azar, former secretary of health and human services, and a recognized leader in the pharmaceutical industry. This distinguished group of advisors, along with additional members, soon to be named, will play an important role in our development and commercialization of these remarkable new products. In addition to the progress we are making in regenerative medicine, we were very excited to announce this week an agreement to acquire dp polar, the Germany-based developer of the industry's first additive manufacturing system, designed for true high-speed mass production of customized components.\n\ndp polar's technology is truly pathbreaking. It features multiple fixed printing heads and a rotating build platform that enables continuous high-speed 3D printing at industrial scale. Among its many unique features, it can embed objects such as sensors, electronics, or magnets into printed parts by using inline robotic pick and place capability, with its ability to achieve production speeds up to five times higher than traditional batch process printing platforms, which represent the standard in the industry today. This novel technology opens up many new exciting high volume applications for the future.\n\nWe are extremely excited to join forces with dp polar at this pivotal time for additive manufacturing, when interest in production scale applications is rising fast. While their machine is still in beta testing and therefore the acquisition will not benefit our near-term results, dp polar's technology is an ideal fit with 3D Systems' broad portfolio of polymer materials and production-focused software systems. We believe that integrating this platform with our existing industry leading solution set will drive its rapid adoption into a wide range of high-speed automated production environments. In summary, I want to emphasize that despite near-term headwinds that are challenging our results this year, we remain confident in our long-term outlook, the targets we laid out at our investor day in May.\n\nWith a strong balance sheet and a disciplined approach to running our business, we will continue to look for ways to invest strategically for long-term growth with a focus on key healthcare and industrial markets. With that, I'd like to turn the call over to Wayne who will describe our second quarter financial results and our 2022 guidance revision in more detail. Wayne?\n\nWayne Pensky -- Interim Chief Financial Officer\n\nYes. Thanks, Jeff. Good morning, everyone. We had three significant divestitures in 2021 as we discussed the non-GAAP measures from the tables we presented in last night's earnings release and as was discussed today, we excluded from the 2021 results the impact of the divestitures.\n\nWe did this to make the 2022 results comparable to the 2021 results. As Jeff discussed, revenue for the quarter did not meet our expectations due to three factors: the strengthening of the U.S. dollar, persistent supply chain issues, and geopolitical factors such as the Russia-Ukraine war. Revenue for the second quarter was $140 million, a decrease of 13.8% compared to the prior year.\n\nExcluding divestitures, revenue increased 3.2% and on a constant currency basis, revenue increased 7.8% compared to the prior year. This top line growth reflects continued solid demand in both our healthcare industrial segments and demonstrates our ability to grow the business against the very challenging background of supply chain macroeconomic and geopolitical pressures. Just to put dollars behind the three factors, nearly $6 million of this impact was attributable to the sharp appreciation of the U.S. dollar that occurred during the second quarter and reduced the U.S.\n\ndollar value of our international sales made in different currencies, which typically represent about 40% of our total sales. In the second quarter of last year, we had approximately $4 million of sales in Russia that did not repeat in the second quarter this year, because we exited the Russian market. If we exclude Russia sales from 2021, then our adjusted growth rate is 11.3%. Finally, supply chain issues in particular component shortages prevented us from filling more than $9 million of firm customer orders.\n\nBy way of comparison, in the first quarter of 2022, we are unable to ship approximately $7 million of customer orders because of supply chain issues. Jeff discussed a few of the actions we are taking to reduce these late shipments. Looking at the first half of the year, revenue excluding divestitures grew 6.5% year-over-year to $273 million. And on a constant currency basis, first half revenue grew 10.4%.\n\nSo even in a very challenging operating environment, we were able to achieve double-digit year-over-year growth in the first half of 2022. In the second quarter, we had a loss per share of $0.26 compared to a loss per share of $0.08 in the second quarter of 2021. The current quarter includes $11 million non-recurring charge or $0.09 per share for certain estimated legal costs and other settlements. The divestitures had contributed $0.05 of earnings to last year's second quarter.\n\nOur non-GAAP loss per share in the second quarter was $0.07 compared to non-GAAP earnings per share of $0.06 in the second quarter of 2021. The year-over-year decline reflects inflationary impacts on input cost -- impacts from acquired businesses as most are in development stage are just beginning commercialization and continued growth-oriented investments in R&D, including to enhance our product portfolio and improve our corporate infrastructure. Our revenue, excluding divestitures on a constant currency basis for our healthcare segment, increased 4.7% and our industrial segment revenue increased by 11.2% as compared to the second quarter of last year. The healthcare growth was fairly consistent across all markets and products.\n\nSofter discretionary spending likely limited growth in end markets such as dental and elective surgeries. Our industrial revenue growth was driven by continued strength in precision micro casting applications such as jewelry, by demand for production machines for aerospace applications, by continued pull-through materials by our significant installed base of printers. Partially offsetting the sales growth industrials are exited from the Russian market, weaker machine and materials sales in Europe due to macroeconomic concerns and to China due to COVID-related lockdowns and supply chain disruptions. Our gross profit margin was 37.9%, compared to 42.4% in the prior year.\n\nGross profit margin was lower due to multiple factors, including the 2021 divestitures of non-core assets. The input cost and freight inflation that was in an effect of what we are able to pass through to customers by way of price increases and manufacturing variances within certain of our contract manufactured products. We also saw small impacts on gross margin due to mix effects of selling more printers and less materials than the prior year. As reflected in our revised guidance, we expect gross margins to remain steady as we move through the year through the continued impacts of inflation on input costs.\n\nOur operating expenses increased 7.7% to $85 million in the second quarter of 2022 compared to the same period a year ago. This includes the $11 million non-recurring charge previously discussed. On a non-GAAP basis, operating expenses were $60.9 million as compared to $48.9 million from the same period a year ago. The higher non-GAAP operating expenses reflect spending in target areas to support future growth.\n\nBut half this increase is due to expenses from recently acquired businesses, while the remainder reflects increased research and development costs to refresh and enhance their product portfolio and investments to strengthen our corporate infrastructure. Adjusted EBITDA defined as non-GAAP operating profit plus depreciation was a negative $2.6 million for the second quarter compared to $12.9 million for the second quarter of 2021. The year-over-year decline in adjusted EBITDA margin reflects all the factors that we have previously discussed. We now turn to the balance sheet.\n\nWe ended the quarter with $638 million of cash and short-term investments on hand. Our cash and short-term investments declined approximately $151 million since the end of last year, driven primarily by $83.3 million paid for acquisitions and equity investments cash used in operations of $38.2 million and capital expenditures of $10.4 million. We continue to have a strong balance sheet with sufficient cash to support organic growth, including in regenerative medicine. As previously stated, we regard 2022 as an investment year during which we will make additional targeted investments in high potential growth areas of our business and in our corporate infrastructure as part of our overall strategy to profitably grow revenue in both the healthcare and industrial segments.\n\nAfter we complete the acquisition of dp polar that Jeff discussed, we will likely take a pause in acquisitions to make sure we focus on execution and fully integrate the recent acquisitions we have made. Nonetheless, we will always remain alert for any game-changing investments. In 2021, we began providing guidance on full year non-GAAP gross profit margins. And in this year, we expanded our guidance to include revenue and non-GAAP operating expenses.\n\nGiven our lower than expected performance in the second quarter combined with a challenging macroeconomic environment we have received for the second half of the year, we are revising our full year 2022 guidance. We now expect revenue be within a range of $530 million to $570 million, which reflects an estimated $20 million of negative foreign exchange impact for the full year as well as additional negative impacts from reduced spending in selected end markets, such as dental, elective surgeries and international manufacturers caused by the challenging environment. We now expect non-GAAP gross margins to be in the range of 39% to 41% to the reasons mentioned earlier. We are narrowing the range of our non-GAAP operating expenses to be between $245 million to $250 million.\n\nThis revised 2022 guidance assumes no significant additional changes in the macroeconomic environment that could negatively impact business demand or disrupt our supply chain, such as COVID, geopolitical events or foreign exchange volatility. I will now turn it back to Jeff before we transition to Q&A.\n\nJeff Graves -- Chief Executive Officer\n\nThanks, Wayne. Before Wayne and I take your questions, I'd like to add one more additional comment. As you likely saw last week, we announced that Michael Turner will join 3D Systems as our new chief financial officer at the end of this month. I am delighted to have Michael join our team.\n\nHe is an accomplished financial executive with a strong technical background, is ideally suited to lead our finance and accounting function. I encourage all of you to connect with Michael after his arrival, introduce yourselves and get to know him as you wish. I'd like to also take this opportunity to thank my colleague and good friend Wayne Pensky for so ably serving as our interim CFO for these last several months. Wayne will be staying on for a while to ensure that Michael has a smooth transition into his new role, then we will be returning to his well-deserved retirement.\n\nSo Wayne, thank you very much for all you have done for us. So, Kevin, I think we can now open up the line for questions.\n\nOperator\n\nCertainly. [Operator instructions]. Our first question today is coming from Greg Palm from Craig-Hallum Capital Group. Your line is now live.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nYes, good morning. Thanks for taking the questions here. I wanted to first dig into the guidance a bit, because last quarter when you provided guidance, you talked about demand outstripping your ability to fulfill. So, I guess if we think about the reduction for the second half, how much is incremental FX headwinds relative to where we were last quarter? Was that the $20 million? How much if any, is additional supply chain challenges that you are now running into and how much is true demand falling off? And I guess of the demand anyway, you can breakout more specifically the impacts across the various end markets or geographies?\n\nWayne Pensky -- Interim Chief Financial Officer\n\nSo with respect to FX, you are correct that the $20 million is the difference between what we did last guidance versus this guidance. With respect to supply chain, I wouldn't view that really as a factor in terms of changing our guidance, while we didn't assume any improvement, we didn't assume it was going to get any worse. So I wouldn't view supply chain as the factor for reducing the guidance. The rest is really about this slower demand in the end markets, primarily dental and then the rest of if you think about what's happening in Europe in terms of slowdown of our customers, in terms of their ability to manufacture that everybody is taking a pause, their inventories probably went up in the past, they are probably trying to manage that inventory down and they are much more cautious about their own outlook.\n\nJeff Graves -- Chief Executive Officer\n\nGreg, it's very much what you would see in the newspaper everyday. If people are having to spend more money on gas and food and basically, they are cutting back on certainly on discretionary items, which is particularly impacting the dental industry. So that was -- that's a major second half effect for us as we -- as that rolls through the supply chain. And again, we view that as temporary that the outlook for that business is quite strong.\n\nBut undoubtedly, it's going to -- it's projected to have an effect in the second half of the year, hopefully with inflation peaking soon that will start rolling back, but it's prudent at this point to assume it just lasts throughout the year and we go on. The other effect clearly is with COVID spiking up in different parts of the country in the world, it's nudged out the treatment in hospitals for COVID patients has nudged out discretionary operations, especially around orthopedics. So, that outlook has flowed somewhat to and it's much like the initial spike in COVID did back in late '20 and early '21. So we would expect it to be transitory and somewhat highly transitory.\n\nBut you just don't know how many of those variants are still out there. So, instead of looking at a quarter by quarter, which we will continue to do, we just assumed this condition lasts throughout the year and we updated our guidance.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nThat's helpful. I mean, Jeff, presumably, the dental that you are alluding to, is more of the big projects type stuff. I mean, do you have any visibility into whether that's just getting pushed out to next year or is it unclear still at this point?\n\nJeff Graves -- Chief Executive Officer\n\nYes, I think the demand is going to -- just my opinion, Greg, demand is going to remain for those products if they are very popular. And I think people are just having to make short-term decisions, with gas and food becoming so expensive and I use that symbolically, I think everything is becoming more expensive. People have had to just put off things that are truly discretionary, but still highly valued. So all the feedback we get is that it's temporary and it will pass the growth outlook back, if you listen to that customer base, which they are public companies, you can listen to them.\n\nWhat they say is, their long-term outlook is still for very strong double-digit growth and the numbers I've heard are 20% to 30%, they talk about publicly, but for this year, it's been ratcheted back to low double-digits, high single-digits and that ripples through the supply chain. So there we see no other indications that they are planning for long-term dampening. I mean all of the other discussion and things are all around continued strong growth. It's a very short-term factor.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nUnderstood. And I guess last one I mean just in light of everything going on, it's surprising that you are raising your opex guide. I mean, I guess, going forward, how should we think about investments on a go forward basis as we get into next year and beyond?\n\nJeff Graves -- Chief Executive Officer\n\nNo, it's good questions, Greg. It's funny when challenging economic environments hit, I think historically, you see companies do one of two things. Obviously, everybody becomes more prudent and they watch their spending. But for folks with a stronger balance sheet, I think you see them saying, look, some of the weaker competitors in our space are going to really struggle in this environment.\n\nThey weren't built for short-term headwinds. And with our scale and our balance sheet coming into the year, we were very well equipped to deal with a downturn and continue investments. So we are able to pickup talent, we are able to pickup I look at this dp polar group an outstanding group of people that small companies struggle in these environments, because they have to rely on longer term revenue projections and that becomes more variable and they burn through their cash. So in essence, for bigger companies like ours with a strong balance sheet, it gives us an opportunity to really kind of double down and say we are going to come out of this really strong.\n\nAnd when you look at our infrastructure investments, if you make the assumption, you are coming out of the strong you better have the infrastructure to support the growth. So that's why we are maintaining the infrastructure investments we are making. So now, I won't tell you we are not looking at all of them and we are cutting back where we can and we are managing through our costs. We definitely are.\n\nWe are going to run a good business. We believe in running a profitable cash generating business. But there are certain periods of time where you have an opportunity to really move ahead. And I think that's us right now.\n\nIf you look at regenerative medicine, which are a really organic investments at this point and you look at this high-speed production process that dp brings us, those types of investments really pay dividends in the long-term if you can maintain them. So, while everybody is struggling, it's our chance now to really kind of kind of push ahead.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nOK, good. Alright. Well, best of luck going forward. Thanks.\n\nJeff Graves -- Chief Executive Officer\n\nThanks, Greg.\n\nOperator\n\nThank you. Next question is coming from Troy Jensen from Lake Street Capital. Your line is now live.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nHey, gentlemen. Thanks for taking my question. Maybe to follow-up on Greg's question line here. Supply constraints, it seems like it's been three or four quarters now that Wayne and Jeff talked about $68 million of demand that you guys can fulfill.\n\nAnd to me, you guys will be building a big backlog with these orders that you can't ship. So you factor that in with just kind of the reduce -- the reduction of about $50 million in revenues with a growing backlog. I just wonder if you kind of touch on what's happening to these orders and is the backlog in visibility improving at all?\n\nJeff Graves -- Chief Executive Officer\n\nI see this, an insightful question, Troy, as always. Yes, so backlog is building, there is no doubt about it. And we don't usually talk about those numbers. But there is no doubt about a backlog's building, we were able to -- we left more on the table in Q2 than we did on Q1.\n\nAnd we don't want to use that as an excuse in the second half, because I do think that things are going to plateau and then get better. But we thought the second half would be significantly better when we enter the year. And at this point, we are going to wait until the data says it is better to really talk about it. So in terms of the durability of orders, when you push orders out, obviously there is a fraction of people that could -- that may choose to cancel.\n\nBut by and large, we are not seeing any diminishing of demand. Folks are willing to wait for product. And part of our move in manufacturing Troy to bring our largest contract manufacturer operation back in-house is we really believe we can better control it and meet our delivery commitments and manage our supply chain. It's a big move for us or required a lot of planning.\n\nBut especially when times get tougher, you just don't get the attention from the contract manufacturers that you want and it's much better to run it in house. So we are making that move. I think it's a permanent move with a high mix of product that we need to provide to our customers. It's a better way to manage the supply chain.\n\nSo, we took a big step in July to bring that in-house. And I think you will see incremental improvements going forward between that and supply chain is truly getting better around the world. I think we will come closer and closer to meeting our growing demand that we see out there.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nOK, thank you. Just a follow-up for you Jeff, dp polar, I guess when I think of inkjet, I think more of prototyping. And I think that's because material properties, I believe these machines need to use acrylic materials. So when you talk about a production machine, you are producing molds, right? Was I kind of think indirect production or is it?\n\nJeff Graves -- Chief Executive Officer\n\nWith your background, Troy, particularly appreciate this machine, they have a great -- by the way, if you go to the dp polar website, they have a fantastic YouTube video posted there of the machine. And it demonstrates the technology with their printing technology, their inkjet printing technology it can actually accommodate much more of our current portfolio of materials that are printed. So a lot of our materials will be able to be printable, if not now in the near future. And those heads can be interchanged with other printing technologies.\n\nSo you can substitute other printing technologies for those print heads. And they're stationary, which makes it much simpler. And it prints on a rotating platform. So no, no, it's it is particularly geared toward continuous production and high-speed production of products.\n\nOur estimates are, Troy, anywhere from three to over five times more productive for production applications. And the doubly cool thing when you watch the video is you can use pick and place robots to put all electronics or magnetics within the component is printed, which is really gives you another capability with 3D printing that you don't have in the current batch processes.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nCan you do multiple materials?\n\nJeff Graves -- Chief Executive Officer\n\nYes, you can do multi materials. You can build components of all different geometries continuously as you rotate the platform. It is just a fantastic technology and one of the key pieces of IP here, Troy, is the machine intelligence because the spinning platform is spinning base plate is so large, there's a big velocity difference between the inner radius and the outer radius. So the intelligence of the machine to be able to uniformly present across broad -- across through multiple printheads, across a broad radius is really exceptional and they have got -- they've been working at it for several years.\n\nAnd they've got a great concept that's now been demonstrated and moving into beta ship and phase now.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nGot you. Alright, Jeff. Well, thank you for that info and good luck on the second half.\n\nJeff Graves -- Chief Executive Officer\n\nThanks, Troy.\n\nOperator\n\nThank you. Next question today is coming from Ananda Baruah from Loop Capital. Your line is now live.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nHey, guys, good morning, I really appreciate you taking the taking the questions. A couple if I could, just sort of going over going back to sort of the commercial context, what you guys talked about reduced visibility from selling to your customers? Are you also yet seeing a meaningful demand impact from those votes? Are you just sort of getting the softer signals that the visibility is being reduced?\n\nJeff Graves -- Chief Executive Officer\n\nNo, it's there's a concrete false in demand, I'd say it's still positive, there's still demand out there. But it's definitely a lower rate of demand growth, the second half than we had originally modeled. And what they attribute that to which they pass on to us is, customers are really struggling, their customers are struggling because they're having to spend more on the basics of life than they are in for example, in improving their smiles, things that are truly optional. And there's sad extensions to that, too.\n\nAnd orthopedics were procedures that are labeled optional, are often very painful for patients, and they really would like to take care of them. But hospitals have been managing their capacity. With COVID, they don't want to overcommit their capacity. So they've discouraged optional procedures.\n\nAnd we factor that into our second half planning. So, both of those factors impact our healthcare business. And we view both of them very much not as transitory. But I'm tired of waking up every morning saying, it's going to get better next quarter.\n\nAnd at this point, I think we just said, well, we'll project it through the end of the year. And hopefully, it'll be better than that. But I think it's a good time to be conservative and just say, these, these pressures are going to be for the full year.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nIt's the right thing. I mean, investors are going around see the guidance lowered anyway. At some point, maintaining the guide probably would just be a headwind to the stock. I mean, you don't like to see this move today in the stock.\n\nBut, it would be a headwind to participation at some point. So it's a wise thing to do, Jeff, is to debit balance. And on the, I guess, on the non-consumer adjacent, kind of verticals, let's say you're trying to manufacture verticals, what's the context is there at this point?\n\nJeff Graves -- Chief Executive Officer\n\nYes. So I think, supply chains around the world are trying to catch up. And you probably see this in your personal life. And certainly, if you've gone out to buy a car recently, or even a spare part for a car, I don't place a fuel pump the other day, and it had to be shipped from Germany.\n\nAnd it took weeks and things that used to take days take weeks. So I think supply chains on the industrial base worldwide are still playing catch up. So there's really nice demand and with one exception, I'll tell you that there's really nice demand in the industrial environment, because our customers are looking to bring manufacturing closer to home over time. And they want more flexibility, if they're going to do it, they want more automation, they want more flexibility, they want a lower cost.\n\nSo it gives him an opportunity for 3D printing to really move in there and demonstrate his capability in production environments. So that's good, that's really a good tailwind to have. The one area in the world that's problematic that is Europe and particularly Germany, which is an industrial powerhouse. The outlook they have and the concerns they have around the Russian energy supply has caused the government to send signals to watch industrial production, potentially cut back in certain industries and parts.\n\nAnd if you follow their announcements, the German industrial firms, you are worried about that, because come winter time, they need the energy. And companies consume a lot of energy. So, they are trying to cut back early, store energy. And I think that's led to an overall concern about capital investment in that part of the world.\n\nAnd again, if the war is a tragedy on many fronts, I hope and pray it lifts soon. But I think that's yet a coming risk for everyone. And we have factored that into our guidance. And looking forward, it's hard to estimate, but we factored it in and said, look, we think Europe could get weaker, not stronger over time, due to energy and the war.\n\nSo, again, hopefully they will find a solution and a good outcome there. But I think it's prudent to just have a wait and see attitude.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nThat's helpful context. Thanks, Jeff. [Inaudible] there. Thanks so much.\n\nJeff Graves -- Chief Executive Officer\n\nThanks, Ananda.\n\nOperator\n\nThank you. Our next question is coming from Wamsi Mohan from Bank of America. Your line is now live.\n\nJeff Graves -- Chief Executive Officer\n\nGood morning, Wamsi.\n\nUnknown speaker\n\nHi. Thanks for taking the questions. It's actually John on behalf of Wamsi. Just wanted to quickly touch up on gross margin.\n\nI know the full year guide, midpoint around 40% implies slight improvement in the margin trajectory in the second half. So, just wondering what might be driving that improvement? And when do you expect these headwinds of consumer spending or supply chain constraints to gradually recover?\n\nJeff Graves -- Chief Executive Officer\n\nYou take the first one, Wayne. I will take the second one, which will be pure speculation.\n\nWayne Pensky -- Interim Chief Financial Officer\n\nWith respect to the margin outlook, that point on 40%, that's not terribly different than how we did in the first half of the year. And so I think we need to do a little bit better on one, passing our price increases, and secondly, just in terms of the input costs going up. So, it assumes a slight improvement there, but not a huge amount or huge improvement.\n\nJeff Graves -- Chief Executive Officer\n\nAnd in terms of when things will get better. We came into the year with just the base assumption, I think we were very transparent about this that supply chain issues, which impact our gross margins, were going to be a struggle through the first half of the year, and then they would improve in the second half. I think as we exit Q2, the number of risk issues in the world has probably increased versus the beginning of the year. And as we look at -- in the second half, we just thought, it's prudent not to really speculate on when things will get a lot better.\n\nLet's just assume it stays basically the same and projected through the end of the year now. And I do think by '23, there is a good chance that supply chains have straightened themselves out. We do see evidence. And you would be probably see this in common everyday things of going to restaurants and things that the world is returning toward normal, but there is a lot of training.\n\nWithin a restaurant this weekend, there is typically a lot of training opportunities for new people that are taken jobs. And I think every company is working their way through that. And that will happen in the second half. And I think '23 will be better.\n\nBut at this point, when we are only dealing with '22 guidance, we say, let's just assume everything stays as tough as it is now for the rest of the year. And I think that's a prudent position to take, and that's what we have done.\n\nUnknown speaker\n\nGot it. And a quick follow-up if I may. Just curious, are you seeing the slowdown more related to the system side or the consumables?\n\nJeff Graves -- Chief Executive Officer\n\nVery good question. So, it depends on the market and the place in the world. In the -- it's a very interesting question, actually. And most of our customers look through this downturn period.\n\nAnd they say, OK, let's watch inventories, let's cut down on consumable materials to kind of run leaner. I think in the first half, we probably saw people building because they thought the second half was going to be strong. So they built inventory, supply chains were disrupted. It caused everybody to add inventories.\n\nI think in the second half here, we are seeing people be a little bit more prudent, if you would, and managing their inventories or cash position, make sure they don't have too much on hand. So I would tell you consumables in the second half, we are projecting as probably a bit softer than we are probably -- and Wayne correct me on this. But I think it's consumables in the second half will probably projecting to be to be softer. They are certainly softer than we would have originally imagined.\n\nIn the first -- yes, that is softer than the first half. And then on the -- but on the capital side, on new printers and things, we see that demand remaining strong, basically across the market. So, that tells you really basically customers are looking through this and saying, I am going to need the printing capacity, but I may not need the consumables right now in the next couple of quarters. So, it hurts our mix.\n\nBut it does encourage you that the long-term you are installing more printers, there is more -- going to be more consumption of consumables including materials and software in the long-term, because the capacity will be out there. So, that it's a -- that's a good question and thanks for asking it. Any other color on that, Wayne?\n\nWayne Pensky -- Interim Chief Financial Officer\n\nGenerally speaking, in our forecasts the second half is about the same in sales in the first half.\n\nJeff Graves -- Chief Executive Officer\n\nYes. That originally we projected it up with a richer mix, OK?\n\nUnknown speaker\n\nOK. Understood. Thank you.\n\nOperator\n\nThank you. Next question is coming from Brian Drab from William Blair. Your line is now live.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nHi. Thanks for taking just a couple of quick questions here. In the second half of the year, do you expect the typical, I know it's hard to forecast anything right now? But are you portraying typical seasonality in the fourth quarter with revenue from the third quarter?\n\nJeff Graves -- Chief Executive Officer\n\nYes. Typically, Brian, as you know, from falling, there is usually a bump in the fourth quarter. It's a little bit stronger going into end of the year. I would just encourage you though to -- if any years going to be watered down, I think this year will be, I wouldn't expect there to be -- we are not expecting a huge change quarter-to-quarter.\n\nIf anything, there may be a slight shift toward Q4 over Q3. Is that fair?\n\nBrian Drab -- William Blair and Company -- Analyst\n\nYes, it's pretty minor. If you look in the prior years, fourth quarter had a much more noticeable bump than we are forecasting right now.\n\nJeff Graves -- Chief Executive Officer\n\nRight. Fourth quarters weighs away. I mean we could still get it. But again, Brian, we took the approach this time of let's just assume the world just kind of stays like it is now for the rest of the year.\n\nSo, that's in terms of building a model that's where our favorite, so -- for this year.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nAlright. OK. And you gave the industrial and healthcare change in revenue year-over-year, I may have missed it. But did you tell us what dental was either up or down year-over-year in the second quarter?\n\nWayne Pensky -- Interim Chief Financial Officer\n\nWe did not.\n\nJeff Graves -- Chief Executive Officer\n\nWe didn't put that out there, Brian. We didn't put that out there.\n\nWayne Pensky -- Interim Chief Financial Officer\n\nLook, if you look at for the first half dental, for the first half was about the same as the prior year. And if you look out for the guidance for the second half that will be lower second half than it was in the first half.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nOK. Alright. Thanks.\n\nWayne Pensky -- Interim Chief Financial Officer\n\nThat really goes back to Jeff's comments about, a little -- as they are forecasting their own growth. If they over-forecasted previously, and drop it down now, they probably need less printers, and a little bit of consumption of less materials.\n\nJeff Graves -- Chief Executive Officer\n\nThat's just it, Brian. I think they came into the year assuming their growth rates were going to be consistent with prior year growth rates. And so they were anyway building fast. So, I think they have certainly seen a drop off in their demand due to discretionary spending issues.\n\nAnd that's rippled through the supply chain. So, there was a clearly an effort to manage inventory on their part. And in the face of softening demand for their products here in the second half. And they have gone out of their way to assure long-term growth rates are, they are maintaining the same guidance.\n\nAnd I think that's true. But in the short-term is certainly as impactful in the second half.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nYes. Got it. Understood. OK.\n\nThanks for that color.\n\nJeff Graves -- Chief Executive Officer\n\nYou're welcome, Brian.\n\nOperator\n\nThank you. [Operator instructions]. Our next question is coming from Noelle Dilts from Stifel. Your line is now live.\n\nNoelle Dilts -- Stifel Financial Corp. -- Analyst\n\nHi, there. So, I was hoping that you could expand a little bit on how you have to respond from a production standpoint, when you have say, a slowdown with a large customer in terms of what you are expecting from demand. So, for example, are you going to have to work through some excess inventory here in the back half of the year? And how should we think about that from a cash flow perspective? Thanks.\n\nJeff Graves -- Chief Executive Officer\n\nYes. Well, certainly, we did -- we have built inventories. And I will give a little color and Wayne maybe you could comment more from a cash perspective, if we can estimate that. We have built, no doubt, we have built inventory.\n\nNo, it's been such a difficult time, to just make sure you have all the components to meet demand in these printers. So, we have undoubtedly built inventory. So, now as things slow down, we have got to manage through that inventory. And I think part of bringing production back in-house for our biggest plants here is I think we can manage our inventories better that way.\n\nAnd better meet demand as well, by the way. But yes, undoubtedly, there is -- I think we have an opportunity actually in inventory management to generate cash over time, because we have got a lot of inventory. But it's always a challenge, because there is a lot of volatility, if you will, in demand right now across the platforms. So, it probably doesn't help you much.\n\nWayne Pensky -- Interim Chief Financial Officer\n\nYes. So, the first half inventories went up about $16 million. As we just sort of reflect how much what Jeff was to say. But as we talked, as Jeff mentioned earlier, we are going to bring some of the manufacturing in-house.\n\nAnd you will see in the 10-Q that was posted this morning that meant in July, we actually bought another $15 million of inventory. So, inventory that previous was on our books now came our books as part of bringing inventory in-house. Now, we think that number is probably too high. And our goal in life was to work that down a little bit.\n\nBut you will see inventory going up just for that reason.\n\nJeff Graves -- Chief Executive Officer\n\nAnd a lot of it will happen when the supply chain just becomes more predictable. We have had inventory a lot of extra parts, because you really didn't know what was going to hang up your shipments. So and in Murphy's Law, we hung up more shipments than we did in Q1, that we did in Q2. So you never quite have all the right stuff, eating too much of room one and not enough, another.\n\nSo, that will work down, the supply chains get smoother and more predictable. And I think we will be more efficient doing it than we would have been an outsourced model. But it will take a little time. So you will see a bump up and it is listed in the Q, right, see a bump up in the Q, a significant bump up as we took that inventory back on our books from our contract manufacturer.\n\nAnd I think you will slowly see a bleed off over time, which will be a cash generator for us.\n\nNoelle Dilts -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you.\n\nJeff Graves -- Chief Executive Officer\n\nSure.\n\nOperator\n\nThank you. Next question is coming from Paul Chung from J.P. Morgan. Your line is now live.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking my question. So, just on the move back to in-house manufacturing, what percent of the portfolio is kind of moving in-house? And where are you moving it? And can you quantify kind of the margin uplift from these actions? And should we expect kind of higher levels of capex kind of moving forward as a result?\n\nJeff Graves -- Chief Executive Officer\n\nThere were several, I see you are meeting Kevin's goal of one question. Now, there is several parts of that question. And they are all good ones, by the way. So one nice thing about this move was the plant is right here in Rock Hill, South Carolina.\n\nSo it's very close to our current headquarters, and a lot of our engineers here in town. So we took the lease back over ourselves. We took production back in-house. And so there is some incremental cost with that.\n\nBut in general, I think we will manage those costs. We were paying for them anyway to the contract manufacturer with a markup. So I think there will be a -- there should over time be a cost savings there as we drive more efficiency out of that plant, same thing with the inventory. So, it's right here, there is no physical move, frankly, of the production process.\n\nIt's us taking over the lease again and really running the plant ourselves. So, there is no move required. Thank goodness, we are not moving products around. An answer to part of your question though, it is a very significant part of our polymer based production.\n\nAnd it probably approaches half. It's a very big percentage. And hopefully, that will grow over time. Our industry fault, well, I shouldn't -- I can't speak for other companies.\n\nBut we offer the broadest range of printing platforms in the industry. It's what our customers want, because they want a large flexibility in solving their application issues. So we offer and as part of our model, we offer the broadest range of printing technologies in the entire industry, from polymers to metals. And we are going to keep that model.\n\nWhat we are doing to make it more efficient is moving to a modular engineering approach. So we have more commonality between platforms. And we are bringing manufacturing back in-house, because contract manufacturers notoriously are if they are not as efficient with a low-volume high mix product lines, and high tech product lines. So by bringing it back in-house, I think we will do a better job of managing that.\n\nAnd when you combine it with the move to modular engineering, I think you will see some significant cost reduction over time in our COGS, just due to efficiency of design and manufacturing. But it will take time. Those are usually multi-year efforts. But I would tell you, it's a key part of us getting to 50% gross margins, is improving the gross margin on our printer products.\n\nDid that cover all the pieces of your question, Paul?\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nJust the capex levels, I assume there is going to be a little bit out there.\n\nJeff Graves -- Chief Executive Officer\n\nNow, these are assembly operations. So, there is really very little capital involved. Now, we will make some capex investments in IT infrastructure and things to run the plant better. But it's largely an assembly operation.\n\nWayne Pensky -- Interim Chief Financial Officer\n\nIt won't be noticeable.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nYes. Got it. Thank you.\n\nWayne Pensky -- Interim Chief Financial Officer\n\nYou're welcome. Thanks.\n\nOperator\n\nThank you. Our final question today is coming from Jim Ricchiuti from Needham & Company. Your line is now live.\n\nChris Grenga -- Needham and Company -- Analyst\n\nHi, good morning. It's actually Chris Grenga on for Jim. Just wanted to ask, how do you think about the level of SG&A and R&D in the event that demand softens further? And could you talk about some of the levers that you discussed in the prepared remarks that you have to address cost structure efficiencies? Thank you.\n\nJeff Graves -- Chief Executive Officer\n\nYes. And that's -- I will say, Chris, that's the art of it. It's how to manage those costs down when you see this conflicting thing of short-term headwinds and long-term demand growth and pretty exciting demand growth, you need to come out of it on the other side ready for that. And so, the desire is to maintain continuity in R&D spending, our SG&A we look at because our G&A costs are high right now.\n\nBut a lot of that is geared toward improving our infrastructure and efficiency. So I think you can quite clearly see G&A coming down in future years, but we've got to invest to make sure our foundation is strong, and that we have the platform to support growth, R&D spending, we just -- I'm hoping that we can manage that down over time as well. But I would tell you in this industry, right now, it's a disruptive industry. And you've got to watch, how much you're spending on R&D, because that those production platforms when they hit are going to be very sticky sales.\n\nAnd that's -- it's going to drive a lot of consumable utilization. So you need to have the platforms in order to meet that demand. And that's one reason we invested in dp polar is we picked up years of R&D work that's been done with a machine that's ready to go to beta customers now, to accelerate that whole process. So I'm not giving you a crisp answer, I want to be very, very selective about R&D spending and make sure we're doing it correctly.\n\nWith the leadership we have in place now, I think there's a really nice opportunity to focus and get more out of our R&D spin with modularity and platforms. In terms of bringing the overall spin down, I really don't want to make commitments on that in the long-term, it's – as we grow, they're easier to bear. So the scale really helps. But on $1 basis, we have to be very careful.\n\nG&A I think we can bring down and even sales efficiency, we can bring down over time with scale, with the scale we have, the G&A particularly I think we can breakdown in future years. Wayne, anything you want to add?\n\nWayne Pensky -- Interim Chief Financial Officer\n\nYes, I guess the only thing I'd add, we've with dp polar, that will make our seventh acquisition a little over last year. And each of those comes with a little bit of SG&A and R&D costs. And so we've added those into the mix. And the most of them are early stage development companies or early stage of commercialization.\n\nWe're not yet bringing in a lot of revenue. So as those guys progressed, we'll get a little bit more leverage from those in the interim, we just need to manage them as best we can.\n\nJeff Graves -- Chief Executive Officer\n\nIs that answered you question?\n\nYou got it.\n\nChris Grenga -- Needham and Company -- Analyst\n\nSure thing. Thank you. Yes. Thank you.\n\nOperator\n\nThank you. We reached the end of our question-and-answer session. I'd like to turn the floor back over to Dr. Graves for any further closing comments.\n\nJeff Graves -- Chief Executive Officer\n\nThanks, Kevin. So thank you all for joining the call this morning. We look forward to updating you again on our business next quarter. And we wish you all a great day.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRussell Johnson -- Vice President, Treasurer, and Investor Relations\n\nJeff Graves -- Chief Executive Officer\n\nWayne Pensky -- Interim Chief Financial Officer\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nUnknown speaker\n\nBrian Drab -- William Blair and Company -- Analyst\n\nNoelle Dilts -- Stifel Financial Corp. -- Analyst\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nChris Grenga -- Needham and Company -- Analyst\n\nMore DDD analysis\n\nAll earnings call transcripts"
}