{
  "companyName": "Axon Enterprise",
  "companyTicker": "AXON",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/axon-enterprise-axon-q3-2022-earnings-call-transcr/",
  "content": "Axon Enterprise (AXON 0.21%)\nQ3 2022 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nHello, everyone. Welcome to our Q3 2022 earnings. Thank you so much for joining us and our executive team today. We hope that you've had a chance to read our shareholder letter at investor.axon.com.\n\nOur prepared remarks today are meant to build on the information in that robust letter. During this call, we will discuss our business outlook and make forward-looking statements. Any forward-looking statements made today are pursuant to and within the meaning of the safe harbor provision of the Private Securities Litigation Reform Act of 1995. These comments are based on our predictions and expectations as of today and are not guarantees of future performance.\n\nAll forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially, and we discuss these risks in our SEC filings. And before we turn the call over to Rick, we will do our investor video. [Commercial break]\n\nRick Smith -- Chief Executive Officer\n\nThank you, Andrea and Angel. Our year-to-date results are pretty exciting with revenue growth of 32% in the first nine months. So what's the secret sauce that's driving this revenue growth Josh and Brenda will provide color on the details, and we also outline them for you in our shareholder letter. But at the highest level, we provide products that solve real-world problems.\n\nOur solutions work -- we make our customers happy, we keep them safe and the public benefits. So we benefit and our shareholders benefit. I've been spending a lot of time with customers and communities on our Moonshot goal because helping the public to dream with us deepens our relationships and answers about the broader questions about why we invest in the areas that we do. It also paves the path for us to keep innovating in areas that will make a difference.\n\nWe have been really heartened by the buy-in we've seen on the Moonshot, bringing together groups that you don't normally see alongside each other. These include the fraternal order of police, the African American Mayors Association, the major county shares of America, the national organization of Black Law Enforcement executives and the National Policing Institute to name just a few. A common reaction I've been getting about our moonshine is well, this all sounds great, but how are you going to do this? Look, we don't have all the specific answers just yet. Just like when Jack Kennedy challenged the nation to put a human on the moon, not all the tech existed yet.\n\nBut we have a good idea of where Axon can invest to move the needle. Using technology to solve deeply entrenched challenges is why I founded the company and why we're here today. Aon has been and will continue to double down on our investment in things like number one, nonlethal tools, such as our enormously successful TASER platform. We believe the majority of TASER adoption remains in front of us.\n\nWe're still under 10% penetrated in terms of our global TAM. And we're working on some really exciting technology over the next 10 years to help hit our goal. Number two, virtual reality. We're seeing a lot of interest in our VR training, which we sell on a subscription to customers.\n\nNumber three, cameras and sensors that never miss a moment. Over the next few years, you're going to see us introduce next-generation body cameras, and we'll keep them a tie between our real-time operations and our devices, which brings me to number four, real-time and remote response. The public safety sector deserves public safety-grade communications tools that are as easy to use as consumer technology. They deserve better situational awareness and it will help them improve their decision-making and their ability to respond effectively.\n\nAlso, we believe that remote response can limit human exposure to danger. Our thinking is that we're moving the officer from harm's way leads to safer outcomes for everyone. And this is why we're investing in Axon Air. Our drone solutions as a first responder as well as counter-drone technology.\n\nNumber five, we're investing in community impact, engagement and feedback tools. such My90, which is a tuck-in acquisition we completed last year of a company that essentially allows the public and rank-and-file officers to anonymously deliver feedback to police leadership. This tool is already helping police departments deepen trust with their communities. Number six, we're investing in more comprehensive and actionable response to resistance reporting.\n\nThis includes both traditional use of course, and de-escalation data. Data collection tools today either don't exist or they don't talk with each other very well or the data is just not collected in a way that's very useful. We believe the public is hungry for better data, especially on incidents involving in support. And we believe we can meet this need.\n\nAnd we need this data to reach our Moonshot. Now we know the Moonshot Gold will not be easy, but we also know that the private sector and companies like Axon have a unique role to play. As I look at our team, which includes leaders like Josh and Britney I'm confident that they'll ensure we continue to invest prudently with a high degree of accountability to all of our stakeholders, driving the business model that creates impressive value creation, solves some of the most challenging problems facing modern society. and delivers great shareholder returns.\n\nSo with that, I'm going to turn it over to Josh.\n\nJosh Isner -- Chief Operating Officer\n\nThanks a lot, Rick. During last quarter's call, I mentioned that the primary thing we can control is where we collectively focus our attention. Our sights remain set on continued top-line growth, which I will address and margin expansion over the long term, which Britney will cover. We are increasingly confident that we can do both well in parallel.\n\nOn the top line, we are very pleased with quarterly revenue of 34% and our Q4 outlook for 40% growth at the midpoint. We're having a strong year, and we are seeing a strengthening of demand across all product lines. Britney will unpack the revenue growth in the quarter for you shortly. But I'd like to take a moment to touch upon what we believe will sustain healthy growth rates of 20-plus percent for the years to come.\n\nWe're growing along two axes. The first is expanding our product suite for existing customers. Both Rick and the shareholder letter talked about a product road map where we believe we can continue to deliver premium solutions to customers at a compelling value proposition for them. We want to make it super clear that our state and local law enforcement business is nowhere near saturated, and we see a long and wide runway for continued growth.\n\nWe believe that in the next five years, you will see Axon emerge as the leading operating system for public safety, strengthened by our strategy of focusing on the customer experience and not cobbling together point solutions that don't work well together, which is the current state of the industry outside of Axon. The second axis is deferred buying into new markets by both adding new types of customer profiles or users and by adding to our core customer base. You can think of our core customers as falling into roughly four categories of funding sources, the U.S. state and local governments, the U.S.\n\nfederal government, international government customers and commercial enterprises. Simultaneously, the types of users we are adding to our platforms is expanding beyond law enforcement. We are adding attorneys, fire and EMS personnel, corrections in the U.S. military and the funding for those types of users generally rolls up into the four sources I mentioned.\n\nI'd like to update you on two of those four. First, our progress with the U.S. federal government and second, touch upon international growth. We are very excited about our U.S.\n\nfederal government business. In the first three quarters of 2022, the federal government has booked contracts exceeding $200 million, up from an approximate $15 million to $20 million run rate just a few years ago. Annual revenue has grown to the tens of millions and our deliverables now extend over the next several years. Our progress with the federal government is a direct result of our intentional investments in both sales channel and product.\n\nWe have been building trusted relationship with agencies that are now finding value in our products and missions and our commitment to helping them be successful. And while we can't necessarily name all of those customers, the breadth and depth of the federal government's interest in our entire product line continues to excite us. And now turning toward global expansion. We continue to refine our international go-to-market strategy.\n\nWe see two things as being the drivers and even the accelerators to international growth. The first is continuing to innovate on our TASER platform. We believe the total TASER installed base has room to grow by more than five times over time. And as we continue to develop technology that potentially matches a pistol in terms of stopping power, we think we have the opportunity to become the primary defense weapon in several international markets.\n\nThe second thing we are focusing on is helping European customers overcome their historical resistance to cloud solutions. This is a playbook we ran in the U.S. starting in around 2012. And domestic state and local customers at first were very averse to cloud-hosted software, and we successfully evangelized the cloud to build a business that now tops $400 million in annual recurring revenue.\n\nWe are starting to chip away at cloud acceptance in the EU, and we see European governments starting to adopt other commercial services for cloud, and we believe that this bodes well for our international SaaS business. Just like in the U.S., once we overcome that initial version, strong adoption of evidence management will follow. Finally, last quarter, I told you that I am working on building the team that Axon needs for the next 5 to 10 years. We are thrilled to introduce Brittany Bagley, our chief financial officer and chief business officer.\n\nShe brings a wealth of experience not only as a public company CFO, but also as a seasoned board member and investor in the technology segment. We sought to attract an executive who brings a NexPlay mindset, versatility, mental toughness and a strong capability to deliver outside outcomes and we are excited that Britney brings all of those qualities to Axon. Based on working with Britney over the last 40 days, I can say with confidence and excitement that the future of Axon's core strategic and financial functions is very, very bright. Now I'll hand it over to Brittany.\n\nBrittany Bagley -- Chief Financial Officer\n\nThank you, Josh. Hi, everyone. I'm thrilled to be on my first official Axon earnings call. I want to start with a big thank you to the team for making it such a great quarter and to Jim Zito for doing such a nice job in the interim CFO role.\n\nIt's an exciting time to have joined such an incredible company. I'd like to share a little about why I joined and where you'll see me put my focus over the coming quarters. While there were many reasons to join, three main ones that I would like to highlight include the strong leadership team, the company is inspiring mission to protect life and the compelling business model. On that last one, especially, I think the combination of the hardware ecosystem the company has been building along with innovative software solutions creates a powerful flywheel that is both high growth and profitable, which provides a relatively rare position in the technology world.\n\nAdditionally, delivering mission-critical products to public safety customers who purchase on long-term contracts makes Axon's revenue both recurring and dependable. As Josh discussed, we continue to have a lot of growth in front of us, and I look forward to supporting our mission and a profitable growth trajectory. To that point, my areas of focus will be on helping the team continue to execute and deliver strong results over the next several years. As both CFO and chief business officer, I get to take a strategic and holistic view of the business to ensure we're making the right long-term decisions to deliver on our mission and our financial promise.\n\nNear term, that means spending time, better understanding Axon's gross margin potential and how I can help move the needle on other metrics we care about, including overall profitability and cash flow. We see opportunities to improve gross margin by investing in automation, driving manufacturing efficiency and improving fixed cost absorption as we scale. Driving the revenue mix further toward software is also a key gross margin lever over the longer term. We are also focusing on controlling opex by enhancing financial discipline while still investing in research and development and sales channel expansion to support future growth.\n\nIn addition to leaning in on operational areas of the business, I am also focused on helping Axon to deliver upon its strategic ecosystem vision, leveraging partnerships, investments in M&A, to truly become the leading technology hub for public safety. Turning now to the quarter. Our domestic business grew 37% year over year in Q3 and continues to make up more than 80% of our revenue. This strength came across the board, supporting strong TASER segment growth at 19% along with great software and sensors segment growth at 51%, which was driven by Sensors growth of 51% and Axon Cloud growth, also at 51%.\n\nOne of the great things we're seeing domestically is strong demand for the premium versions of our products and bundles. Beyond the strength in our core business and the traction we're seeing on our software and cloud revenue, we continue to be excited about other areas of growth, including our international business, which delivered 20% growth in Q3. We had a strong Q3 gross margin of 62%, which represented more than 100 basis points of sequential improvement. The increase was primarily due to the strength of Axon Cloud and the overall product mix in the quarter.\n\nAxon Cloud gross margin in Q3 benefited from our new long-term contract with Microsoft Azure. While this benefit will continue, we also have low to no margin professional services costs which supports the setup of these contracts and the mix can change quarter to quarter. That doesn't change our view on exceeding the long-term target of 80% plus for the software business, but we do expect quarterly variations as a result. In addition to the sequential gross margin improvement, the strong top-line revenue allowed us to achieve good operating leverage in the quarter and resulted in adjusted EBITDA of $68 million or 21.7% margin.\n\nFinally, I wanted to touch on our outlook. Given the strong quarter, we are raising our annual revenue guidance to a range of $1.15 billion to $1.16 billion, which reflects about 34% annual growth at the midpoint. This also implies Q4 annual revenue growth of 40% at the midpoint. Turning to our adjusted EBITDA.\n\nWe are raising our outlook from $200 million to a range of $215 million to $220 million, which we believe demonstrates strong performance on profitability. Our Q4 adjusted EBITDA is expected to be in the range of $49 million to $54 million. Implied margins are down slightly sequentially from Q3 on product mix and less opex leverage but remained strong overall with an almost 19% EBITDA margin implied at the midpoint for the year. We are proud of our performance and outlook, and they speak to the bigger picture that Rick and Josh talked about, which is the overall strength of the business we are building.\n\nWe look forward to delivering another strong Q4 and setting ourselves up well for 2023 and as we execute against our financial objective of profitably delivering a 20%-plus top-line CAGR going forward. With that, I would like to open it up to questions back to Andrea.\n\nAndrea James -- Chief Communications Officer\n\nThank you, and we have you all in the queue. So if you're on the call, assume we've got you in the queue. Thank you so much. We'll take our first question from Josh Reilley at Needham.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nAll right. Very impressive results during the quarter. I guess maybe starting off, you had a pretty significant revenue beat here, obviously. How much of a tailwind are you seeing now from stimulus government funds from programs like the ARPA beginning to hit budgets? Or is that something that you see more of an impact in 2023, and beat in Q3 is driven more by budgets that haven't been impacted to date by those budgets?\n\nJosh Isner -- Chief Operating Officer\n\nYes. Josh, I appreciate the question and nice to see you again. I don't necessarily think there's a ton of correlation between our momentum and results in any onetime or kind of recurring government subsidy for products. I think ultimately, we're building a very strong business where there's a very high ROI on our products and our customers continue to see that and not only buy more of them, but buy more and more premium levels and licenses.\n\nAnd so while those are nice moment in time types of tailwinds for some customers, I don't think they have any major implication on our continued growth, and we're very confident that independent of those factors, we're building a very strong and consistent business.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nGot it. That's super helpful. And then the TASER gross margin was down sequentially and remains probably below where you guys wanted. I know that's a focus now for Britney as you're evaluating cost there.\n\nBut was there anything specific in the quarter that brought the margin down sequentially? Or any color there would be helpful.\n\nBrittany Bagley -- Chief Financial Officer\n\nYes. I would say that we have been investing in everything related to our manufacturing capacity as well as supply chain for the TASER. And so you have seen that impact the gross margin this quarter and a little bit year to date. I think it will be one of the big areas of focus as we look to improve gross margins is making sure we can really scale into those costs and scale as we get leverage on gross margin over time.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nGot it. Congrats again.\n\nAndrea James -- Chief Communications Officer\n\nNext question from Jonathan Ho at William Blair.\n\nJonathan Ho -- William Blair and Company -- Analyst\n\nLet me echo my congratulations as well. I wanted to start out with your commentary around sort of the higher-end bundles and maybe customer behaviors that are leading to more selection of that higher-end bundle I just want to understand sort of why you're seeing this behavior and whether you expect it to purchase or not?\n\nJosh Isner -- Chief Operating Officer\n\nYes. Certainly, Jonathan. I think the first thing I'd say on those bundles is even though we're seeing a lot of demand, there's a white space ahead of us in terms of adoption of those bundles, especially in state and local, and it's really driven by the adoption is driven by the idea that in those bundles, we're adding more and more value-added add-ons. And so Jeff's team is doing a fantastic job understanding accidental contact -- sorry about that.\n\nI think Jeff's team is doing a great job understanding some of what the customers are wanting in future releases of our products and then going back and building those things that are highly valuable. An example of that is transcription. And another example is VR, both of which exist in our more premium version of the Officer Safety Plan, and that's driving a lot of customers toward those bundles. And so we'll continue to iterate on that strategy and make sure that the things that are the most highly valued in tandem with our core products appear and bundles in a way that make the customer excited about the potential of buying all of these items and features at one time and one license.\n\nRick Smith -- Chief Executive Officer\n\nJosh, I would add to it as well. What I'm seeing with customers, I can't think of a customer that's been like gone up to a premium bundle and gone down the other direction, that the more stuff they use from us, the more value they see in it and very sort of the flywheel effect where what I'm hearing from customers is they just want to put more of their solutions with Axon. They struggle with technology. They're hamstrung by really long, complex procurement rules that make it very difficult for them to be agile in what they're doing.\n\nAnd so I think we've earned their trust and it's really incumbent on us to keep earning it every day. So we don't break this dynamic, but it does seem to me that they're pretty consistently moving up the ladder each time we launch something that integrates with the other stuff. It's paying off, it's working well. And again, a lot of that just goes to awesome execution and Jeff the product team.\n\nJonathan Ho -- William Blair and Company -- Analyst\n\nExcellent. And just as a follow-up, with the U.S. Fed opportunity -- U.S. federal government opportunity, what has been most impactful in terms of helping you break into this market? I mean, obviously, it's been a target for a number of years, but it seems like things improved from a step function perspective.\n\nwhat initiatives or what level of education do you have to sort of provide to kind of get further into the U.S. debt opportunity.\n\nRick Smith -- Chief Executive Officer\n\nSo I'll start and then maybe hand it back over to Josh. I think investing to get that ramp accreditation for the Eves.com system early. It was a bit of a bet when we did it, right? It was expensive. It was difficult to invest in that.\n\nAnd I think to this day, we're still the only Fed ramp accredited or certified system and all these federal agencies that want to use the cloud, that obviously gives us a tremendous advantage. And then we've obviously seen things like the administration moving toward standardization with body cameras. And then Richard Collin, who we hired a few years ago, is really, I think, just done a great job building out a team that really understands the federal space and is building some fantastic relationships.\n\nJosh Isner -- Chief Operating Officer\n\nYes. I'd just add to that, Rick, especially on the last point. For us, every problem starts with how we build a strong team, full of subject matter experts that we can trust their instincts and expertise to execute. And when we brought Richard in, that was two years into our business, and we haven't quite cracked the code on how to run a growing federal business and just bringing him on along with a very talented team with him as well as more and more product focus has just unlocked this amazing opportunity and even though we've had a phenomenal year and seen a literal 10x in bookings at this point in the last few years, we still think we're very much on our own side of the field and have a long way to go to maximize the full opportunity across federal, but we really believe we have the team in place to do that.\n\nAndrea James -- Chief Communications Officer\n\nNext question, Erik Lapinski. Go ahead, Erik from Morgan Stanley.\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nI maybe want to just follow up a little bit on the federal side because it looks like at least the deal with the Veteran Affairs was pretty comprehensive across the product portfolio, whereas I know you're in other federal agencies, maybe with some products but not all of them. I guess just would be curious on that, like as you're moving into newer federal agencies, do you see the opportunity for more of a sizable kind of across-the-spectrum deal upfront? I maybe haven't seen 1 that included fleet previously. So it would be good to just kind of understand the vision there that some federal customers are having and kind of if you are seeing more of that.\n\nRick Smith -- Chief Executive Officer\n\nLet me start first, and then I know Josh is going to want to talk to this, too. I would say this is where we see the advantage. We talk about being a mission-focused business. And a lot of times, that can sound like puffery or kind of fluff, but it really is true.\n\nWe are running this business to solve problems we're passionate about. And of course, we also want to run a rigorous business where we have financial models that make sense. But the finance has come from the problems we solve and infusing that in every employee, I'm just so impressed with the team and the attitude they've got where it's all about keeping our customers productive and safe and happy, and we really give a lot of latitude to our teams to make things right. And where that pays off is we don't think of these as just contracts we're going to sell and make a few bucks to move on to the next one.\n\nAnd so we get phenomenal customer references and the investments we make in really delivering a great product to the end user, not focusing on winning the bid RFP sort of bureaucratic process I think, builds the type of things where you see these relationships where people even relatively early on, they're cross checking with their other agency customers that are similar, and they're getting the confidence to give us a large part of their technology ecosystem. So I think that's the underlying thing is the focus of the team on really the passion around the business to build things that really delight and protect our customers that give customers the confidence to go do that. But I'll turn it over to Josh to maybe give a little more color to federal specifically.\n\nJosh Isner -- Chief Operating Officer\n\nI think Jeff was going to chime in first, Rick.\n\nJeff Kunins -- Chief Product Officer\n\nYes, sure. I totally echo everything Rick said. And then combined with that, you've heard us talk a lot, whether it's in margins or in many other places about scale and our flywheel and leverage over time. But in the way we invent and deliver our products to our customers as we do these market segments, expansion.\n\nThe same thing is true there as well because you can think of leverage where we've spent a decade on our core dams and cameras products and then even longer on TASER. And at this point, even internally, what we have is small surgical dedicated parts of our engineering team for these expansion markets like federal who can inherit all of the common aspects of those products that are already fit for purpose for all segments we're competing in, but then overlay on top of that in a very focused way what our federal customers need to tailor those existing products to unlock federal. And then over time, as that keeps getting even more and more large and well-situated, you'll see us build bespoke products that might be first for federal after we've earned the right by building out those sockets with loyalty to the products that we already had.\n\nJosh Isner -- Chief Operating Officer\n\nAnd I'd just add, finally, I think, to your question about fleet specifically, Erik, in federal, I think is we'll have one or two products off the bat that are nice fits for the customer and expand for lack of a better term from there. And then there will be other customers that see the value across the board in terms of what we offer and want to engage in a more extensive contract upfront. I think we still maintain the belief that either way, longer term, the customer ends up in the same place, which is very happy with Axon's full suite of products. And the VA is a great example of an agency that trust us on day one to deliver all of it.\n\nAnd in some other cases, we'll see that same phenomenon over time.\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nAwesome. That's really helpful. And maybe if I could just sneak in a follow-up. But more focused on records.\n\nIt looks like in the release, you included at this point, you kind of have 40 agencies and 12 doing a full replacement. Just as we think about, obviously, a full replacement a very intensive workload. How much are you being relied on for that type of work? And do you see opportunity to potentially streamline that or build software around it over time that makes it kind of more simplified, I guess, in moving fully to records and just to understand maybe some of the time lines you're seeing with those 12?\n\nJeff Kunins -- Chief Product Officer\n\nSure. I'll take that. So like we said, I think like you see when you talk to anyone in the industry, where we remain -- these are big complex deployments just like ERP systems and things like that, and there's nothing that will ever change the fundamental physics that those are big, complex systems because they have big complex work to do, but we are -- we remain extraordinarily optimistic and confident in our long-term trajectory and growing our leadership position in this segment. But we're approaching it and we think a humble and disciplined way, one deployment at a time.\n\nAnd as you heard us share we are both continuing to go up and to the right steadily in agencies adopting records overall and for their full deployment and our ability to continue to scale up a number of those that we're working on simultaneously and the amount of bespoke work per each successive deployment, both of those are going in the right direction. And so I think you'll see continued steady and accelerating momentum there, but we also are not going to get over our skis and B2 Chess before we've earned it.\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nAwesome. Congrats on the good quarter.\n\nAndrea James -- Chief Communications Officer\n\nKeith Housum at Northcoast.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nSure. Guys, again, everybody else is saying during the phenomenal quarter. But as we look at some of the individual results, Axon Fleet sales were down 15% from the prior year [Inaudible] down as well. Could the core even better? I'm assuming if you had access to some of the I guess, materials you wanted there.\n\nI guess perhaps provide a little bit of color on some of those two sites that did not perhaps do as well as some of the other items in your portfolio?\n\nJosh Isner -- Chief Operating Officer\n\nYes. Certainly, Keith. And I don't necessarily want to speculate on what the quarter could have been. We're really proud of where we landed.\n\nBut I think it is an indicator that the future looks bright for a variety of reasons, including increased fleet shipments. We did run into one or two minor items with the hubs that power our fleet unit from our supplier, but the good news is in Q4, you'll see that demand rebound substantially, and we expect to see our best ever shipment of fleet -- quarter of shipments for fleet specifically in Q4 and the strong demand continues well into the future there. And we're very excited to continue to build on our market lead in that product line.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nGreat. And just as my follow-up and maybe, Brittany, I put you on the hot seat here for your first time. As we talk about the Moonshot goal, how does that fit into Axon's I guess, existing R&D budget and the financial profile?\n\nBrittany Bagley -- Chief Financial Officer\n\nYes. I mean I think the way we philosophically think about it is that we can achieve both really healthy top-line growth and head toward that Moonshot. And do that profitably and have a really nice bottom line as part of the business. And so to your point, that will be a balance for us as we go forward.\n\nBut of course, with our growth, we're not going to stop innovating. We're not going to stop investing in R&D. We're not going to stop coming up with great new products. And so it's just that a lot of those will be focused on helping achieve that mission, but all inside the financial profile that we think is the right long-term profile for the company.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nSo I guess I hear it in our way, you don't have to see a significant expense increase for R&D as a result of this large goal?\n\nBrittany Bagley -- Chief Financial Officer\n\nNo. There's nothing specifically we're calling out on that. I do think we will continue to invest in R&D, and we've been consistent on saying that, but this wouldn't necessarily change that profile in a way we're calling out today.\n\nAndrea James -- Chief Communications Officer\n\nSami Badri at Credit Suisse.\n\nSami Badri -- Credit Suisse -- Analyst\n\nAll right. My first question was on the 20% annualized growth target I was hoping you could kind of give us an idea on how you're going to get there, either by new subscriptions, existing subscriptions that are seeing some price increases as a function of new features -- maybe you could kind of give us an idea on the composition of that 20% growth. And then my second question is on capex. It looks like your guidance was reduced for the year.\n\nCould we just go through the puts and takes on that, please?\n\nJosh Isner -- Chief Operating Officer\n\nSure. I'll start with the revenue growth question and then hand it over to Brittany for the capex question. I think, Sami, one of the beauties of our business and business model is there's a lot of different ways we can achieve exciting growth -- and it's not one specific thing. I think there are -- some of the things you mentioned are very much in play.\n\nWe'll continue to invest in new products that delight customers and cause customers to want to buy more at higher pricing tiers and more premium bundles. But I think it really bought boils down to two specific things. We're going to do a really good job of building new products for our existing customer base, meaning state and local U.S., especially, how do we introduce new products into that base over time. And the second one is applying existing products to newer markets like international, federal and enterprise.\n\nAnd we really believe -- we're doing those things well in parallel, and we'll do them even better in parallel next year. And of course, by doing so, that opens up kind of growth opportunity on both of those axes. So I'll probably leave it at that for now and hand it over to Brittany for the capex question.\n\nBrittany Bagley -- Chief Financial Officer\n\nThanks, Josh. I mean, I think the only thing I would add is I think it's exciting how many levers I see the business having in terms of where and how it can grow. There's an enormous amount of opportunity. So now you have to focus and make sure you're executing against them and going after the right ones, but the opportunity is there.\n\nI think from a capex standpoint, what we just highlighted is we are making some capex investments this year, and some of those are getting really pushed out to next year. It's more of a timing piece than a fundamental change in strategy.\n\nSami Badri -- Credit Suisse -- Analyst\n\nGot it. I have one more question, and it's mainly on working capital and just inventory. Do you foresee inventory levels just consistently stepping up from now all the way perhaps maybe until the end of 2023, just a function of supply chains and components and all those other factors that are essentially increasing inventory levels?\n\nBrittany Bagley -- Chief Financial Officer\n\nI'd say there are two things right now that are driving our inventory investments. One is, we are still not out of supply chain challenges. So we still have products that are supply constrained that we would like to get back in stock on and get to a better inventory position. And then I think, too, just with the types of growth we're seeing across some of our products, we need to continue to invest in inventory to support that top-line growth.\n\nSo I do think you'll continue to see that be just a strategic area of investment. I think at the same time, one of the things I talked about is really making sure we are doing a good job with our free cash flow. And so as we get to '23, we'll have to work to make sure we're appropriately balancing strong free cash flow generation with making sure we have that inventory we need to support the top line.\n\nAndrea James -- Chief Communications Officer\n\nPaul Chung with J.P. Morgan.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nYes. OK. So just another follow-up on the free cash flow. So you're putting up record numbers here and have kind of seen free cash flow conversion surge as well.\n\nSo talk about how the firm has driven the higher conversion? Is this kind of sustainable here.\n\nBrittany Bagley -- Chief Financial Officer\n\nI think it's been a big area of focus. The team has done a nice job specifically stepping up what they've been doing from a collection standpoint and paying more attention to our accounts receivable. And so that's a lot of what gets us. I think as we go through the rest of the year to our free cash flow targets.\n\nAnd again, I think it's just -- of course, we need to balance with our inventory investments and making sure we're in the right place from that standpoint, making sure from a capex standpoint, we're investing in the business where we need to invest in the business. But there should be some good free cash flow characteristics that we can continue to focus on.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. And then just a follow-up. On the investments you're pursuing, we saw a lot of that at the show.\n\nSo we're seeing some momentum across your investment and what can really become more material over time, what do you get excited about on the investments there?\n\nBrittany Bagley -- Chief Financial Officer\n\nYes. Well, I'll start and then maybe I'll let Jeff jump in a little bit, but I get excited in a couple of places. One, there really is this incredible ecosystem that the company has created where the hardware and the software have a flywheel to benefit each other. You heard us talking about how more customers are buying the premium parts of our business.\n\nAnd so that's really proving out the software. And so I get excited that we can make investments in partnerships that continue to drive that ecosystem. At the same time, with my CFO hat, we're going to be thoughtful and we're going to be disciplined about where and how we invest but I really do think we have a unique opportunity in front of us with that as a lever to continue to pull things in. And I think what's great is the more you can bundle some of these products together, the more powerful each one is.\n\nAnd so it's just a great opportunity there. But Jeff, I know you spend a lot of time thinking through the ecosystem and products and where we should make investments. So if you want to add anything.\n\nJeff Kunins -- Chief Product Officer\n\nSure, absolutely. Thanks, Brittany. Again, thanks for the question. Yes, I think of it, of course, very similarly, I think in three core areas.\n\nOne, as Josh said earlier and Rick alluded to in people not stepping down, the power of our bundles, I sort of belay my own Amazon roots and the power of things like crime or other similarly situated models. The fact is that giving customers for a fair price that they already think is a great deal even for a subset of the benefits that they already know they want to use. And then once they've done that, they have access to at what feels like free to them an additional and steadily growing set of product benefits that just light up. In fact, just today, I was talking with one of my team members who was at one of our major city customers who's already in a particular level of our bundles, but they weren't using performance, for example, and they had been approached by another company with a stand-alone product at IACP, and then we help them realize and remember that they had access to performance and boom, they instantly started using it, and now they're more excited about the bundle than ever.\n\nI think the second across our ecosystem, as you've heard Andrew and all of us talk about is not just our own first-party product, but more and more and more the story or the narrative or the idea of the Axon network is becoming more and more tangibly real as customers have and use both our own products and our partners' products, whether that's Block or Fusus or DroneSense or D-Drone, yes, it's great that they can sometimes buy those on one piece of paper, but the actual products themselves light up in ways that weren't -- were just a moments in a video, a demo vision idea not too long ago, and now they're real. And then the third that gets me excited about in our own products is more and more of these magical connections and leverage from our software services adding value to our hardware, even once that hardware has already been deployed. And the two greatest examples of that are Respond. And so the many, many, many hundreds of thousands of our AB3 body cameras that now have to respond paid licenses connected with them and those agencies using those real-time connected features respond, which is both a paid add-on and great value and ALPR-as-a-software connection to Fleet 3.\n\nAnd the absolute peanut butter and chocolate combination that our customers are finding of having both the world's best hands-down stand-alone in-car camera system, but that being connected to the world's best cloud-powered democratized access price point and ethically design ALPR system. So it's those connections, both inside our first-party products and across us and our partners' products. That's super exciting for me.\n\nAndrea James -- Chief Communications Officer\n\nWill Power at Baird. Go ahead, Will. You are up.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nI guess a couple of questions. First one is probably for Josh, maybe Jeff, but nice acceleration in the software revenue in the quarter. I guess I'd love to get any other color around the key drivers of that. How much of that is tied to OSP 7 plus adoption, attorneys and dams.\n\nI mean what's kind of leading to that acceleration when you've seen the last few quarters?\n\nJosh Isner -- Chief Operating Officer\n\nYes, certainly, Will, nice to see you again. I think it's really just a combination of a few things driving more users to our more premium licenses, expanding our user base to more software-only use cases outside of kind of core state and local, you mentioned attorneys, that's certainly a big one, and there are others along that same realm -- and then just increased overall adoption across Evidence.com even within state and local, we continue to add users every quarter, and we see some of that also in federal and international and enterprise as well. So goes back to really focusing on selling more into our existing markets and then opening up new markets in parallel, and that's one of the places we're seeing some of the results. And of course, there's a lot more work to do there as well.\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nOK. And then maybe just second question, for Britney. Just as we look at margins, EBITDA margins going forward, I know you touched on it, it sounds like you expect EBITDA margins to dip in I guess it would be great to get any additional color there's going to be higher revenue than I think at least we were modeling previously, obviously, down from Q3, are there seasonal issues there? Q3 obviously helped most helped by the outperformance on the revenue side. But then, I guess, in tandem with that, just your broader thought process on EBITDA margin expansion over the next few years as you move into '23, what does that kind of comp look like relative to '22? Any other kind of frameworks that can help us with there.\n\nBrittany Bagley -- Chief Financial Officer\n\nYes. So I think a couple of things going on in Q4 are we talked about having slightly less leverage on our opex -- we do continue to invest in opex as we head into the fourth quarter of the year. We have also talked a little bit about how it's still a very positive margin for the overall year. So we'll get to almost 19% EBITDA margins.\n\nBut I think if you look at sort of last year to this year, what you really saw was gross margins came down year over year, and that's a lot of what was impacting our EBITDA margins year over year. So we actually have managed to get some opex leverage if you look at some of those numbers. And so as we look and start thinking about what is that going to be like in the future, it's one of the main reasons that I'm really starting by digging into gross margins and where can we get some continued leverage in gross margins. That all can then flow through to the bottom line and support what we come out with in terms of longer-term EBITDA targets.\n\nWe'll have more for you on '23 when we get to our Q4 earnings call, but really looking forward to digging in there and being able to provide some more of that color.\n\nAndrea James -- Chief Communications Officer\n\nJeremy Hamblin at Craig-Hallum.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nCongrats. Brittany, I want to follow up on that last point, actually. So gross performance was pretty solid especially with a lot of the revenue upside tied to 83 cameras. And now that you've had obviously still getting familiar with the company and the opportunities and so forth.\n\nBut I sense that there is a notable tone change in terms of opportunity on gross margin and that, that may be like a key focus on a go-forward basis of where there's opportunity. So I wanted to get a sense for the timing of -- well, A, how much low-hanging fruit do you think there is because maybe if you're going to gain 500 basis points, how much of that is easy and how much of it is -- you're going to have work hard? So I wanted to get a sense of how much opportunity you think there is overall? And then also the timing on what you think if -- again, I'm just throwing something out there but how much of the gains do you think could happen in the next 18 to 24 versus a five or six-year slot?\n\nBrittany Bagley -- Chief Financial Officer\n\nYes. No, I appreciate the question. I mean I would say I think that the business has been well run. And so I wouldn't say there's any glaring low-hanging fruit, but I would also say it's a business that's come through many of the supply -- well, still in many of the ongoing supply chain challenges.\n\nThe company has been paying PPV and having to invest in manufacturing capacity and automation and all things, I think, that have been talked about but should start to see some benefits going forward as we continue to grow, as we continue to get scale on some of those investments, hopefully as we get to a more normalized supply chain, you saw the growth in software, which is higher margin for us. So that product mix is very important going forward. I think all of those things are the things that we're going to need to do to drive gross margin improvement.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nOK. And in a similar vein, then in terms of -- it also sends that maybe your opex growth might also be -- there's been a lot of investment over the last few years. And a lot of that was new product rollout and not that you're not still iterating from there. But it does -- I do get the sense that now you're going to mature or realize some of the opportunities in those business that it's taken four, five years to lay the foundation and start to see a little scale.\n\nIs that a correct read that obviously, continue to invest, but maybe the rate of growth in your opex might be a little bit lower than what it's been in the last few years.\n\nBrittany Bagley -- Chief Financial Officer\n\nI mean I think that we're certainly looking to get some good opex leverage as we continue to grow. But I also -- I don't want to leave you with the impression that we're not going to continue to invest in their growth because the opportunity in front of us is just so enormous you should all want us to be investing behind going after that. And so I think we're going to continue to be really thoughtful about where we do that and make sure we're getting a good return on those investment dollars, but both from an R&D standpoint and then some of these new channel opportunities are big and you're starting to see that pay off in federal. And so we would like to keep doing that and keep driving that top-line growth, just doing that profitably and making sure there's a good balance there and a good focus on really getting return for the dollars we're investing.\n\nAndrea James -- Chief Communications Officer\n\nWe'll go a couple of minutes over. Erik Suppiger at JMP, go ahead.\n\nErik Suppiger -- JMP Securities -- Analyst\n\nOn the international front, can you talk a little bit about kind of the near-term strategy? I'm not sure if there's a time line associated with the five times opportunity that you envision there, but can you talk a little bit about kind of your lead products and how you're going to develop the international markets?\n\nJosh Isner -- Chief Operating Officer\n\nSure. I think generally speaking, the focus, Erik, is really to land with one product, whether it's on the CEW side, the video side, interview room, in-car video, any of our digital evidence management products, and there we'll bet on ourselves to continue to grow the adoption and numbers and volume of that one product, but we'll also grow the adoption and volume of other products along the way. So right now, we still remain focused on doing everything we can to grow in the U.K. and Canada and Australia being our Tier 1 international markets, but also just finding one product to fit in all of these other large national police forces and from their supplement with our additional products.\n\nAnd I think it's working well. We've seen a lot of interesting TASER adoption this year in markets where we haven't really participated before, but we also see a tremendous pipeline going into next year and the year after, not only across TASER, but across body cams and cloud. So we're very excited about the prospects of international, and it's really about that land and expand strategy that we talked about earlier in the call.\n\nRick Smith -- Chief Executive Officer\n\nLet me jump in and help the I think, in particular, this Moonshot, right? One can look at that and say, OK, well, how do I tie that back to the commute return to the company? And what we're trying to do is push ourselves not to just think of, in particular, the TASER as a product that we're going to incrementally -- making marginally better than the last version, but how do we absolute the bullet? How do we become the primary defensive weapon and one that doesn't fail? When we do that, we will move the TASER from a specialist item that a few officers or a specialized team may have to where every officer is going to need one. Now in the United States, Police will carry a TASER on one hip and a gun on the other. In most international markets, we don't see that dynamic happen where vest-in, I think maybe a more American approach to carry both devices. When we start to approach the stopping power and reliability of a pistol with a nominative weapon, I think that will be a game changer where -- not in the United States, the United States has unique challenges because of the gun culture broadly in the country, cop certainly need to carry both for quite some time.\n\nBut if you think about France, Germany, Spain or [Inaudible] international where officers are routinely wearing handguns, if we can give them something that's similar in performance stopping power, I think we'll see those countries potentially shift to where a TASER energy weapon can become their primary device and suddenly we go from 5% to 10% of a police force to approximating even a 100%. So I think that sort of thinking is going to pay off in really break out moments of growth for us, particularly in the international space. And then the other piece is the Cloud. We are hammering the way.\n\nIt's taken longer than I thought it would in Europe, in particular, to get acceptance to the cloud over the same objections we saw in the U.S. a decade ago. We're seeing some bright spots and signs of light. And I think if we get one or two leading customers to crack and prove the cloud is safe, but we'll start to see the dam break there as well.\n\nSo I'm particularly excited about the international opportunities led by TASER overall.\n\nErik Suppiger -- JMP Securities -- Analyst\n\nDoes the TASER take time? You had talked about the Moonshot and getting to the point where it starts to obsolete bullet. Does that imply that the lead product would be the sensors and dams until TASER starts reaching that level or what -- how do you think between those two?\n\nRick Smith -- Chief Executive Officer\n\nWell, I'd say in many markets, the TASER is already a lead product. It tends to bring us, I think, into more markets because of its unique value proposition. But I think that will accelerate as we continue to step up its capability to move from a specialist capture tool to a highly reliable personal defense system. I don't know if you want to make any additional commentary, Josh.\n\nJosh Isner -- Chief Operating Officer\n\nI think that covers it, Rick.\n\nAndrea James -- Chief Communications Officer\n\nWe'll take questions from one more list and then Rick will close this out. Logan Hennen from Northland Securities.\n\nLogan Hennen -- Northland Securities -- Analyst\n\nCongrats again. Another great quarter. So with our first question, we were hoping that you guys could shed a little light around what percentage of sales is currently coming from the federal government -- and how do you guys expect that to change come fiscal year '23 and '24?\n\nJosh Isner -- Chief Operating Officer\n\nYes. Logan, I appreciate the question, and thanks a lot. I don't know that we're going to go into that level of detail right now. I'd say our focus in federal continues to remain on growing bookings and total contract value, with the expectation is that flows to the top line and revenue not only upfront as those contracts are signed, but over time.\n\nBut at this point, we're not prepared to break out federal revenue. And maybe we'll reassess later. But at the moment, we're sticking with the way we're reporting it.\n\nLogan Hennen -- Northland Securities -- Analyst\n\nYes. Understandable. So our next question is, what should we anticipate for fourth quarter bookings? What have you guys kind of noticed so far? Do you expect that to be the highest in any quarter this year?\n\nJosh Isner -- Chief Operating Officer\n\nWe do expect Q4 to be our highest bookings quarter of the year for sure and maybe even ever depending on a few factors there. So we're certainly excited about it, but that's the extent to which we'll elaborate on that right now.\n\nAndrea James -- Chief Communications Officer\n\nAll right. Thank you, Logan, and thank you, everyone. We're going to have Rick close us out.\n\nRick Smith -- Chief Executive Officer\n\nThanks, Andrea. And of course, thanks for our shareholders. It is with great pride that we're able to deliver results like this and it is an amazing team. I got to tell you, Josh Isner, having watched him grow in his career is just an amazing team builder and he gets a lot of credit for helping us find and recruit Brittany, this is her first call with you guys, but I can tell you, we're already feeling the magic that she's adding to the team.\n\nAnd of course, Jeff and the amazing team he has built over in product, and he's continuing to just bring in amazing talent. So there's never been a better time to be at Axon or the Moonshot. We didn't blindly make that promise without some pretty clear vision of how we're going to get there. So to get to the move, we're working on the Saturn V and the Eagle Lander and a lot of really awesome tech, you can expect to see over the next couple of years.\n\nSo with that, I'm going to wish you all a happy holiday season. Thank you for your patience and sticking with us. Many have been following the company for a long time. We're delighted to see the investments we're making in the past pay off, and we're excited to show you where today's investments will pay off tomorrow in the future.\n\nSo if I don't see you all, enjoy your holidays, and we look forward to talking to you in the new year.\n\nDuration: 0 minutes\n\nRick Smith -- Chief Executive Officer\n\nJosh Isner -- Chief Operating Officer\n\nBrittany Bagley -- Chief Financial Officer\n\nAndrea James -- Chief Communications Officer\n\nJosh Reilly -- Needham and Company -- Analyst\n\nJonathan Ho -- William Blair and Company -- Analyst\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nJeff Kunins -- Chief Product Officer\n\nKeith Housum -- Northcoast Research -- Analyst\n\nSami Badri -- Credit Suisse -- Analyst\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nWill Power -- Robert W. Baird and Company -- Analyst\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nErik Suppiger -- JMP Securities -- Analyst\n\nLogan Hennen -- Northland Securities -- Analyst\n\nMore AXON analysis\n\nAll earnings call transcripts"
}