{
  "companyName": "Kohl's",
  "companyTicker": "KSS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/kohls-kss-q3-2022-earnings-call-transcript/",
  "content": "Kohl's (KSS 0.68%)\nQ3 2022 Earnings Call\nNov 17, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning. My name is Dennis, and I will be your conference operator today. At this time, I would like to welcome everyone to Kohl's Corporation third-quarter 2022 earnings conference call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer session. [Operator instructions] I would now like to turn the conference over to Mark Rupe, senior vice president, investor relations. Please go ahead.\n\nMark Rupe -- Vice President, Investor Relations\n\nThank you. Certain statements made on this call, including projected financial results and the company's future initiatives, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Kohl's intends forward-looking terminology, such as believes, expects, may, will, should, anticipates, plans, or similar expressions, to identify forward-looking statements. Such statements are subject to certain risks and uncertainties which could cause Kohl's actual results to differ materially from those projected in such forward-looking statements.\n\nSuch risks and uncertainties include, but are not limited to, those that are described in item 1A in Kohl's most recent annual report on Form 10-K, and Item 1A of Part II of the company's quarterly report on Form 10-Q, for the first quarter of fiscal 2022, and as may be supplemented from time to time in Kohl's other filings with the SEC, all of which are expressly incorporated herein by reference. Forward-looking statements relate to the date initially made, and Kohl's undertakes no obligation to update them. In addition, during this call, we will make reference to non-GAAP financial measures. Information necessary to reconcile these non-GAAP financial measures can be found in the investor presentation filed as an exhibit to our Form 8-K filed with the SEC and is available on the company's investor relations website.\n\nPlease note that this call will be recorded. However, replays of this call will not be updated. So, if you're listening to a replay of this call, it is possible that the information discussed is no longer current. And Kohl's undertakes no obligation to update such information.\n\nToday's call will be abbreviated as compared to past earnings calls. We are planning the call to last approximately 40 minutes. With me this morning are Peter Boneparth, our independent chair of the board, and Jill Timm, our chief financial officer. I will now turn the call over to Peter.\n\nPeter Boneparth -- Independent Chairman of the Board\n\nThank you, Mark, and thank you for joining us this morning. I'm going to provide some brief introductory remarks, and then I'll turn it over to Jill to review our third-quarter results. We will then take some Q&A. As we shared last week, Michelle Gass decided to step down as CEO to become the successor CEO at Levi's, a valued brand partner of ours.\n\nOn behalf of the board, management, and all of our associates, I want to thank Michelle for her contribution to Kohl's during the past nine years. Her efforts to strategically transform Kohl's through brand introductions and partnerships, like Sephora, and her focus on building an inclusive and collaborative culture will benefit the company for years to come. Michelle is an outstanding leader, and we look forward to continuing to work closely with her in the future. We have plans in place to facilitate a smooth transition.\n\nThe board appointed Thomas Kingsbury as interim CEO. Many of you know Tom from his leadership at the Burlington is highly regarded and an exceptional operator with a keen focus on inventory management. I knew Tom from his early days at Filene's, and I personally have always had a great deal of respect for his professionalism, retail acumen, and integrity. Tom is no stranger to Kohl's.\n\nHe calls Milwaukee home. He's been on the board since 2021 and has been intimately involved in working with Michelle and the team. He is the perfect fit to lead the company during this interim period, and we greatly appreciate his willingness to serve in this capacity. We expect him to hit the ground running.\n\nGiven the recent volatility in our business and consumer behavior, the significant macroeconomic headwinds, along with the unexpected CEO transition, we will not be giving guidance for the fourth quarter and are withdrawing our prior outlook for the year. We also want to make sure that the company has the flexibility to take the actions necessary in the fourth quarter to best position the business for 2023. We continue to have strong conviction in our strategies, and it is our intent to resume providing guidance on our Q4 call in late February for the new fiscal year 2023. Now, let me spend a few minutes on our next steps.\n\nThe board last week formed a committee to oversee the search for a new CEO. Michael Bender, our current chair of the nominating and ESG committee, will be leading our efforts with help from Christine Day, Margaret Jenkins, as well as Tom and I. Kohl's is a great company with bright prospects, and this is an attractive role and an opportunity in the retail industry we are excited to engage with candidates. Let me share with you some of the key characteristics we are looking for in a new CEO.\n\nKohl's has always been known for brand's value and convenience, so it's important that we land a candidate who has great brand-building experience, understands our go-to-market value proposition, and has deep omni channel expertise. In addition, we are looking for a leader that can build great teams and drive stellar results while furthering the innovative spirit and inclusive and collaborative culture. We don't have a timeline for you on how long it will take, but we know that the process is underway, and that Tom has agreed to remain interim CEO until a permanent successor is named. This company has been through a lot over the last couple of years.\n\nI want to thank our shareholders for the time you invest in engaging with us, as well as to thank you for your continued support during this transition period. We are committed to finding the next great CEO to successfully position Kohl's to drive sales, grow earnings, and create shareholder value. This board is also committed to supporting Tom, the management team, and the entire associate base during this interim period. I will now turn over the call to Jill to discuss our third-quarter results.\n\nJill Timm -- Chief Financial Officer\n\nThank you, Peter. And good morning, everyone. Before I get started, I do want to thank Michelle for her leadership and partnership over the past decade. Let me now review our third-quarter results and business performance.\n\nAs we shared last week, sales were down approximately 7%. Our operating margin was 4.7%, and diluted EPS was $0.82. Our performance during the third quarter was relatively in line with our expectations as the organization continued to manage the business effectively in a challenging macroeconomic environment. Persistently high inflation continues to dampen consumer spending and our business, given our exposure to discretionary categories like apparel and home goods, which are facing disproportionate pressure.\n\nDuring the quarter, we saw our middle-income customers continue to purchase fewer items per trip and trade down to our value-oriented private brands. From a channel perspective, store sales outperformed digital and improved sequentially in Q3 due in part to having more Sephora shops open and our investment in labor to enhance execution across the store. Digital sales were down 8% to last year but still up nearly 20% to the third quarter of 2019. Digital accounted for 29% of sales.\n\nFrom a product perspective, sales of our private brands increased slightly to last year with strong performance in our top private brands, including Sonoma, Croft & Barrow, Jumping Beans, Nine West, Tek Gear, and Lauren Conrad. Accessories was our best performing line of business, up mid-teens percent, driven by strong performance from Sephora beauty sales. We continue to see mid to high single-digit percent sales lifts in stores with Sephora relative to the balance of the chain. This was partially offset by lower sales of jewelry driven by in-store displacement.\n\nOur core women's business outperformed the company average and, excluding juniors, was flat to last year. We maintain momentum in dresses, though experience weakness in juniors and intimates, which we are working to improve. As it relates to some of our other categories, active underperformed in Q3 versus the company's, driven by continued softness in active footwear. Our outdoor business continues to outperform with growth from Eddie Bauer and Lands' End.\n\nIn footwear, we are pleased with the growth achieved in our dress casual business, especially in boots. And lastly, men's performed in line, while home and children's underperformed the company average. Now, let me turn to the rest of the income statement. Q3 gross margin was 37.3%, down 263 basis points from last year.\n\nThe decline was driven by an ongoing increase in freight costs, which pressured margins by 150 basis points; product cost inflation, which was a 50 basis point headwind; as well as elevated shrink levels. Our margin continued to benefit from our pricing and promotional optimization strategies. SG&A expenses decreased 3.3% to $1.3 billion, benefiting primarily from the lack of holiday-based retention incentives this year and lapping last year's Sephora rollout expenses. And through disciplined expense management, we were able to offset some of the continued wage headwinds.\n\nDepreciation expense of $202 million was $8 million lower than last year due to reduced technology capital spend. Interest expense of $81 million was $15 million higher than last year due to Sephora-related lease amendments and increased borrowings. Net income for the quarter was $97 million. And as previously reported, earnings per diluted share was $0.82.\n\nTurning to the balance sheet and cash flow. Our inventory at quarter end increased 34% to last year, with our Sephora at Kohl's beauty investments contributing 5 percentage points of the increase. When compared to the third quarter of 2019, inventory was flat. During Q3, we start the pack and hold merchandise on the sales floor and in-transits normalized.\n\nWe feel good about the progress we are making to reduce inventory and continue to expect further improvement by year-end, remaining agile and responsive to the demand environment. Operating cash flow was $121 million in the third quarter. Capital expenditures for the quarter were $185 million, driven mainly by Sephora and new stores. We opened five new stores in 2022, four of which occurred in early November, and relocated another four stores.\n\nDuring the quarter, we paid $57 million, or $0.50 per share, in dividends to shareholders. In addition, as previously disclosed on November 9th, the board declared another quarterly cash dividend of $0.50 per share payable to shareholders on December 21st. Subsequent to the end of the quarter, we completed our $500 million accelerated share repurchase program. In total, we received 17.9 million shares, which resulted in an average price of approximately $28 per share.\n\nFrom an accounting perspective, we recognized 11.8 million shares in Q3 and will recognize the remaining 6.1 million shares in Q4. Now, let me provide an update on our capital structure and capital allocation priorities. Starting first with our revolving credit facility. As expected, we increased our usage of the revolver during the third quarter, driven by our seasonal inventory build ahead of holiday and to execute the $500 million accelerated share repurchase program.\n\nAt the end of the third quarter, our outstanding revolver balance was $668 million. Importantly, we expect to fully repay our revolver borrowings in early December as we move through the key parts of the holiday selling season. We have consistently communicated that our long-term objective is to maintain our investment-grade rating, supported by prudent balance sheet management and a leverage target of 2.5 times. Our philosophy and objectives have not changed on this front.\n\nLooking forward, our capital allocation actions will prioritize the dividend, followed by returning our balance sheet to its historical strengths. We plan to pay down our two bond maturities totaling $275 million in 2023. We are not planning on repurchasing any additional shares until our balance sheet is strengthened on a path toward our leverage target of 2.5 times. We used the recently completed $500 million ASR as a pull forward from 2023.\n\nAnd we recently completed a robust process where we engaged with dozens of industry participants to assess potential asset monetization opportunities for our owned real estate. This included robust engagements with large, fully integrated real estate service firms specialty real estate advisory and brokerage firms, large institutional real estate investors, and specialty real estate investment and private equity firms. Given the market volatility and current rate environment, we have concluded that it's best to stay the course and continue with our existing process of regularly evaluating our real estate to maximize asset value, drive long-term profitability, and optimize the portfolio with a focus on maintaining balance sheet health and financial flexibility. We will continue to take advantage of favorable opportunities as they arise but not engaged in a transformative sales leaseback transaction at this time.\n\nLet me share a few comments on our forward outlook. For holidays, knowing how important value is to customers this year, we are amplifying our value messaging through our holiday brand campaigns, as well as by featuring our private brands more prominently in our marketing and leaning into our iconic Kohl's Cash and Kohl's Rewards programs across key promotional events. Our key product focus areas include an expanded Sephora gifting assortment; increased newness and greater exclusivity in toys, tech, and pet; active and cozy apparel; and special occasion outfitting such as holiday dresses. Gifting is an important theme in our messaging, and we look forward to serving our customers once again this holiday season.\n\nboth online and in-store, including our now over 600 stores with Sephora at Kohl's shops. As it relates to our financial outlook, as Peter stated in his opening remarks, we remain committed to and confident in our strategy. However, we are not providing fourth-quarter sales and earnings guidance at this time. It is the prudent thing to do given the recent unpredictable trends in our business, the significant macroeconomic headwinds, along with the unexpected CEO transition.\n\nWe also want to make sure that we have the flexibility to take the actions necessary to best position the business for 2023. Let me share a few qualitative comments on recent trends and select financial commentary. In recent weeks, the environment has become more unpredictable to forecast. Following fairly stable trends in August and September, sales decelerated in late October, with softness continuing into November as compared to last year.\n\nWe believe this is primarily a function of a later start to holiday shopping as compared to 2021, where customers were concerned about scarcity of inventory. Given our expectation that the challenging environment will continue in the short term, we're taking actions across multiple fronts to ensure that we are best positioned. We are planning inventory commitments conservatively, executing expense savings opportunities, and reducing capital expenditures. We will do this while continuing to invest in our key future growth initiatives.\n\nOur partnership with Sephora remains extremely strong, and we are both incredibly focused on building Sephora at Kohl's to $2 billion in sales. In 2023, we'll open 250 additional Sephora at Kohl's shops, bringing the total to 850, as well as make progress on developing a smaller footprint concept for our remaining 300 stores. In closing, I want to extend a special thank you to all of our associates. I admire your commitment to putting our customers first each and every day, and I greatly value your dedication to Kohl's.\n\nThe holiday season is a special time for so many reasons, both personally and for our business. I'm excited to see more and more of our customers experience the elevated store environment with Sephora and benefit from our value-driven holiday promotional strategies. With that, Peter and I are happy to take your questions at this time.\n\nOperator\n\n[Operator instructions] And your first question is from the line of Mark Altschwager with Baird. Please go ahead.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nGood morning. Thank you for taking my question. First, Peter, with respect to the CEO search, could you expand on the key attributes the board is looking for? Are you looking for an individual who can execute on the current strategies the companies outlined or perhaps looking to shake things up a bit? And finally, is there a scenario where Tom continues in the role for more than an interim basis?\n\nPeter Boneparth -- Independent Chairman of the Board\n\nYeah, thanks, Mark, and good morning. As regards your first question, just to elaborate, the board and the current management team and Tom are fully aligned that the strategy that we've embarked upon is the right one. So, we're not looking for a CEO who's coming in to change the strategy that we've embarked on. What we are looking for is a very strong operator, as I said, somebody who can drive sales, somebody who can drive earnings per share, and somebody who understands the basic tenets behind the Kohl's value proposition and the brand strategy.\n\nSo, what we are confident is that this is among the top three jobs in retail and that the search firm is going to lead to -- us to somebody who can run this business for a long time. As it relates to Tom's ongoing involvement, Tom has committed to us that he will be interim CEO until we find one. So, while there's no ending date on that, what's very clear is his assignment at this point is interim. We couldn't be asking for a better leader at this time given his background and his and his support of Kohl's along the way.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nThank you for that. And, Jill, I know you don't like to provide a lot of monthly detail. But given the decision to withdraw the guide, any more color you can give us on the volatility into late October and early November would be helpful, just as we try to get a sense of what the run rate is kind of exiting the quarter and into early Q4. And then, on gross margin, you called out some of the puts and takes in Q3 on freight and costs and shrink.\n\nJust any thoughts on what those factors look like in Q4 relative to Q3 based on what you see today? Thank you.\n\nJill Timm -- Chief Financial Officer\n\nGood morning, Mark. I think, for sales, you know, we mentioned on the call, we saw stable sales in August and September. It was that late part of October that we really saw softness. So, you can read that into it actually underperformed the quarter.\n\nWe saw softness continue in November. What I would say is it's moderately better. So, we are seeing some improvement. Like we mentioned, we are looking to see is that shopper reverting back to more of that pre-pandemic 2019 shopping period because, last year, we did see an acceleration due to the scarcity of inventories.\n\nBut given the volatility and really the uncertainty in the macro environment, we just don't have a lot of visibility into that, which led us to partially withdraw -- or why we want to withdraw the guidance today. In terms of margin, you know, we had talked a lot about freight being a headwind all year. We knew we would start lapping that as a headwind in Q4. So, that will actually moderate.\n\nBut what does come back in Q4, as you saw we called out, is that cost inflation. So where freight will moderate, cost inflation actually elevates. So, we'll see a similar pressure there. And then, shrink is just really ongoing.\n\nI think you've heard about that more macro. So, we've continued to see shrink as a headwind for us. We're doing a lot of things to try to manage that with, of course, the first and foremost priority of us keeping our associates and our customers safe as we go through from that perspective. So, I think that's kind of the color I can give you as we move into the fourth quarter.\n\nBut I would say, just overall, it's the uncertainty and the lack of visibility we have, not that we don't have a conviction and confidence in the strategy that we're employing.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nGreat. Thanks again.\n\nOperator\n\nYour next question is from the line of Bob Drbul with Guggenheim. Please go ahead.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nHi. Yeah, I just want to sort of follow up on Mark's questions. But I don't know if it's Peter, Jill, or both, but can you just talk about the decision to actually withdraw the guidance, you know, versus maybe a wider range? You know, any framework that you can give us around Q4 but even into '23 as you think about, you know, how you want to position the business in '23, I think that would be pretty helpful. And I do have a follow-up.\n\nPeter Boneparth -- Independent Chairman of the Board\n\nBob, maybe I'll start and toss it over to Jill. First of all, good morning. Nice to talk to you. The -- so, as you know, I've been doing this a long time, as have many members of our board, as has Jill.\n\nAnd I would say that the visibility for the fourth quarter has been as difficult as any period I can remember. So, what you have, as we've said, is, on the one hand, you had last year's situation where nobody had an inventory. Everybody -- as a result, all customers were inclined to buy early. And so, you had these big numbers early in the quarter, so people had a lot of conviction.\n\nOf course, by the end of the quarter, people who got inventory problems had issues, and we had that as well. Now, you flip over, everybody has a lot of inventory. The customers, obviously, were anticipating a highly promotional calendar. And then, we saw this pronounced slowdown in October going into November.\n\nWas that consumer behavior, was that weather, was that the elections? I don't think anybody really knows. It's probably a combination of all those three factors. You then combine that, in our minds, with, obviously, an unexpected CEO transition. And our judgment call, which is, frankly, is a 5149 call, our judgment was that it was very important to give Tom and the team the latitude in the fourth quarter to execute on our basic strategy, which is to drive value and sales during a very promotional environment.\n\nYou've heard from other competitors. I think it's consistent with what everybody is saying out there. I think everybody believes that Christmas will come, but I don't think anybody out there today knows for sure exactly what's going to happen. I don't know, Jill, if you have anything to add to that.\n\nJill Timm -- Chief Financial Officer\n\nNo, I would echo the sentiment. I think it's really about the unpredictability and the volatility and the trends that we've seen over the last several weeks. It's not that we're not confident in the strategy as we enter into the holiday season. We know it's going to be very focused on value.\n\nIt's a core tenet for Kohl's. So, this affords us the opportunity to make sure that we can compete, go after the market share. We're set up really well. We have 600 Sephora shops.\n\nWe have a lot of newness across the store, including smart home, pet, leaning into successful areas like outdoor and dress. So, we have confidence in the strategy. I think it's much more about the uncertainty and unpredictability of the macro environment that Peter had mentioned.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nGot it. And, you know, I just -- I have a follow-up question. So I think, you know, one of the brands that you called out, you know, was Lauren Conrad brand. You know, one of the products that seems to be creating a lot of chatter is the women's LC Lauren Conrad midrise leggings.\n\nAnd I was just wondering, you know, if that's enough to really sort of carry the brand, if, you know -- if you have any comments around, you know, how that is performing in stock or, you know, how important it'll be to you in the fourth quarter. Thanks.\n\nPeter Boneparth -- Independent Chairman of the Board\n\nWell, Lauren, we did call out -- I think we have called out, has been a successful brand for us and is really resonating with our customer. I personally am a Lauren Conrad shopper, as everyone knows. And who doesn't love a great pair of leggings? So, I think it's just really indicative of the success of -- her leggings are doing well but really of just the brand in general. And, you know, we talked about women's, the core women's business was flat on the quarter.\n\nSo, when you take out, you know, juniors, which we've talked about, we're working through some of the issues we have there. So, we feel really happy with how women's is performing. And overall, Lauren is just a great brand. We're happy with the partnership, and I'm really happy that you actually know about the Lauren Conrad leggings.\n\nSo, apparently, our social marketing is broad reaching.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nThank you. \n\nOperator\n\nYour next question is from the line of Gabby Carbone with Deutsche Bank. Please go ahead.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nHi. Good morning. Thanks for taking my question. So, on inventory, last quarter, you mentioned it would likely be at, maybe, high teens at the end of the year, which kind of brings you back in line with 2019 levels.\n\nYou know, curious if that's kind of how you're still thinking about it. I understand you aren't providing guidance. And then, just on the promotional front, just curious of your activity and kind of how you're thinking about the holiday maybe is still going to be better than what you saw in 2019. Thank you.\n\nJill Timm -- Chief Financial Officer\n\nSo, in terms of inventory, I think, you know, inventory is actually right where we expected to be. I think we talked in Q2, we knew we weren't going -- we were going to make improvements, but it wouldn't be a large amount of improvement because we wanted to protect holiday. We wanted to make sure we are flowing those fresh receipts, which we did. So, a lot of that benefit would come to us after we flowed the holiday receipts.\n\nWe're still very focused on inventory. I know just talking with Tom, it's a key focus of his as well. So, you will see that we are positioning ourselves with the flexibility to make sure that we enter 2023 clean and ready to be successful in that year. So, I would say we're going to continue to focus and bring that down.\n\nI'm happy with the fact that we're flat to '19 from an inventory perspective even with the investments we're making into beauty. So, the progress is right where we expected it to be. In terms of the holiday period, I mean, holiday is always unique, and we know there's a lot of business still in front of us for holiday. We know it's going to be promotional.\n\nYou know, when Peter started this call, he talked about the core values of Kohl's and value, you know, convenience and brand. And so, we're going to really lean into that. You know, we have the iconic Kohl's Cash. We have our Kohl's Rewards programs.\n\nWe're going to use our Kohl's Credit value offering as well to really drive that business through the holiday season and make sure that we're competitive. And I think that's another portion of what -- you know, the actions we took. This is really going to give us the flexibility to compete and make sure we're getting that market share.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nYour next question comes from the line of Oliver Chen with Cowen. Please go ahead.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, Peter and Jill. Nice to talk to you. And nice job on Lauren Conrad as well. As we look ahead in this uncertain environment, which categories do you think might have more promotional intensity? And would love your general views on what's happening with the consumer with these crosscurrents because there still is low unemployment and some savings, but the consumer is just becoming much more price conscious.\n\nJill Timm -- Chief Financial Officer\n\nYeah. I can definitely start on this one. Well, I'll start with the consumer because you talked about it. You know, we mentioned on the call in Q2 and now, again, we're seeing it as our lower-income customers and higher-income customers are growing.\n\nWe're really seeing that squeeze, and who is our core customer, which is the middle income. And that continues into this quarter as well as we watch that customer move. So, we know value is important. We also saw, Oliver, how they voted in the quarter.\n\nThey migrated both in Q2 and Q3 to our proprietary brands. So, they've outperformed national brands for the last two quarters, which is really the first time that we've seen that in a long time. So, we know value is definitely going to win this holiday season, and we need to lean into that. You know, we talked a lot about newness, but even in our Sephora shop, we know that we have an opportunity to elevate gifting.\n\nSo, we'll be doing that. But we're going to have gifts that even start at $35. So, really leaning into the fact that we're bringing in a little bit lower-income customer and how can we make sure that we're fulfilling their needs across the store. In terms of the promotional intensity, I mean, I definitely think it's going to be widespread.\n\nI don't know if there's any particular category that's going to have more promotional intensity than others. I just want you to -- you know, that is a core fundamental of who Kohl's is, and we're prepared to compete this holiday.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThanks. Happy holidays.\n\nJill Timm -- Chief Financial Officer\n\nTo you as well.\n\nOperator\n\nYour next question is from the line of Omar Saad with Evercore Partners. Please go ahead.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nHi. Thanks for taking my question. Jill, could you do a deeper dive on the inventory, you know, balance? You know, how you feel about the, you know, positioning, especially kind of COVID-winning categories versus kind of recovery and occasion-driven categories. Do you feel like you're well positioned from inventory standpoint as consumers return to some of their pre-pandemic shopping behaviors and categories they're shopping in, or are you comfortable where you're at? Thank you.\n\nJill Timm -- Chief Financial Officer\n\nSure. I think from an inventory perspective, you know, last year, as we called out, we were low on inventory. So, we really needed to build back. And I think the two big places that we've built back in, first and foremost, was women's.\n\nSo, if we go back over time, we took a transition. In women's, we did a lot of exiting out of underperforming brands, and now, we're trying to bring back in that newness. And that was tough to do last year given the supply chain disruption. So, we were definitely under inventory.\n\nAnd I think we feel well positioned, from an inventory perspective, for women's. You know, we're seeing that resonate with the customer. Dresses, specifically, has been a new category for us, right? We haven't always participated in it, but we know that dresses and dress casual are more important. So, we funded into that inventory, and it's definitely been performing for us.\n\nYou'll see, even into the holiday period, we're going to have more dresses really around that holiday occasional dressing as well. So, feel good and well positioned from that perspective. In home, we're actually moving back into some of our electronics, smart home TVs, things that we haven't necessarily participated in but we know are big Black Friday deal drivers for people to come to the store. So, I think the newness that they're bringing in, and electronics is great.\n\nAnd then, we're also expanding our outdoor business. And so, you're going to see things like tents and coolers and seating. So, that's really going to build up and another strength that we've had over the past quarter, you know. And then I think last is, you know, active is a place that you've seen softness.\n\nBut on the apparel side, we're still trending well. So, you're going to see that we move that to the front of the store with Sephora. You're going to see that we're going to have a great array of product, but really going to see more on our Flex and Tek Gear because of the value orientation of those products, which are going to be much more important during this holiday season. So, I think, as I look across inventory, I feel like the progress we made was where we expect it to be.\n\nWe feel good with the content that we have as we head into holiday, and then we will have the flexibility to make any moves that we need to to make sure we enter 2023 from a strong position.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nGot it. Thank you. And then, maybe any quick thoughts on what's going on on the active footwear side of the business? And, you know, any levers you can pull to get that going again?\n\nJill Timm -- Chief Financial Officer\n\nYeah, I think, right now, it's about the supply chain and just getting the newness in. And when we do get newness, it sells well. We just don't have enough of it. From my understanding, you know, we should start seeing a flow happen more in Q1.\n\nSo, we expect, spring of '23, we'll start pushing that back into a positive zone. But I would say what I am excited about in footwear, Omar, is the dress side of the business is really coming through. We actually ran, you know, positive comps there, and we have a great boot business happening as well, which is a good statement as we move into the holiday period. So, I think active footwear will lag a little bit but really excited about the dress side of the business.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThanks. Have a great holiday.\n\nJill Timm -- Chief Financial Officer\n\nThanks. You as well.\n\nOperator\n\nYour next question is from the line of Ashley Helgans with Jefferies. Please go ahead.\n\nBlake Anderson -- Jefferies -- Analyst\n\nHi. It's Blake on for Ashley. Good morning. I wanted to ask two questions, one on the promotions and just the impact of gross margins.\n\nSo, I think you mentioned freight as a headwind in Q3, and then product cost inflation. And if you could hone in a little bit more on the gross margin impact from promotions, and then, maybe any directional read how we should be thinking about Q4 promotions.\n\nJill Timm -- Chief Financial Officer\n\nSure. You know, I think, as you know, we have had a strategy around our pricing and promotion and really optimizing that. So, we actually called that out as a benefit to our margin in the third quarter, really helping offset some of these headwinds as well as, you know, helping us when we had to clear through some inventory to offset that. What I'd actually say is we're optimizing those promotions to be much more effective as well.\n\nSo, much more targeted offers, much more personalized offers, you know, eliminating a lot of stackability, which was confusing for the customer because they had to do math. So, really making sure that the offers that we're putting in are meaningful to the customer to drive their behavior. So, that strategy is still being employed, you know, pricing being really important during this holiday season to make sure that we're being competitive and then underlying where's that extra benefit we can get from Kohl's Cash specifically, and then, of course, all offers. As we move into holiday, it's always promotional.\n\nIt's something that, you know, Kohl's has thrived in over the years. We know how to be promotional. We know how to lean in and out. And I think the agility that we have today is a new muscle that you haven't seen, you know, in years past that we're going to be able to make those moves much more quickly depending on what we're seeing from a consumer perspective.\n\nSo, we're able to promote -- to be competitive, promote, to see where the product is moving and promote in a much more targeted manner to move consumer behavior. So, I feel that this actually plays to a strength of Kohl's, and we're set up to take advantage of that in the fourth quarter.\n\nBlake Anderson -- Jefferies -- Analyst\n\nThat's great to hear. Thank you. And then, also, on Sephora, just wondering -- you've had some of those stores now for about a year or year plus. So, just wondering if you could comment a little more broadly on how those stores are comping.\n\nAnd then, how do you expect that customer to hold up under inflation versus your chain average? Thank you.\n\nJill Timm -- Chief Financial Officer\n\nSure. What I would say is, one, we're still seeing great performance from Sephora. They're up mid to high single digits or outperforming the balance of the chain. So, we feel good.\n\nThe stores obviously just comp for one month of the quarter. But, you know, it is positive. So, we feel great that they are comping. I think that we're seeing -- in beauty -- beauty sales.\n\nI think that we're seeing across is that beauty, people need it. They see this as a need. We've always said this is a traffic driver for us. That's why they come back.\n\nAnd even during inflationary times, they need to replenish their lipstick or makeup or cosmetics and skincare. So, we feel like this is definitely a thing that can continue to drive our business during the holiday period. Like I mentioned on the call, we know, last year, gifting was something that outperformed for us. So, you're going to see a much more expanded gifting assortment this year.\n\nWe're going to have some at very good value price points to really take into accountability the uncertainty and the inflationary environment that we're in. And we're going to do this all with a much more elevated marketing support in partnership with Sephora. So, I think we feel great with the strategy as it unfolds. We feel great -- you know, as you know, those first 200 stores start hitting their comp year, and we feel really well set up for the holiday period.\n\nBlake Anderson -- Jefferies -- Analyst\n\nThanks so much.\n\nOperator\n\nYour next question is from the line of Chuck Grom with Gordon Haskett. Please go ahead.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey, good morning. Thanks very much. I'm glad to see the progress on inventory, Jill. Last quarter, you guys provided a really nice slide, unpacking that across different buckets: core and transit, Sephora, pack and hold.\n\nJust wondering if you could, you know -- maybe frame out those buckets for us this go around.\n\nJill Timm -- Chief Financial Officer\n\nYeah. So, made it a lot easier on us, Chuck. Honestly, the pack and hold on the floor, so it is literally not a difference to last year. Obviously, we didn't buy into that inventory, so that went away in third quarter.\n\nAnd then, we mentioned on the call our in-transit is really just kind of came back in line. I think you saw, across the supply chain, disruption. We had written in a lot of extra time. That wasn't needed because the ports are pretty clear.\n\nThere's capacity in, you know, that -- in the shipping lanes, and so we were able to normalize that. So, we didn't have to call it out. The one thing we did call out was about 500 basis points for beauty. So, as we now have, you know, the 600 stores open, we made that investment into inventory.\n\nSo, that was the only reconciling item. So, really trying to simplify what we're looking at. But even with beauty flat to 2019, so we do feel good with the progress, but more progress to come, as we mentioned, going to Q4. All right, I think that was our last question.\n\nSo, I just want to thank you, everyone, for listening on the call today and wish you a wonderful holiday season.\n\nOperator\n\nThank you all for joining Kohl's Corporation third-quarter 2022 earnings conference call. This does conclude today's call. You may now disconnect.\n\nDuration: 0 minutes\n\nMark Rupe -- Vice President, Investor Relations\n\nPeter Boneparth -- Independent Chairman of the Board\n\nJill Timm -- Chief Financial Officer\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOmar Saad -- Evercore ISI -- Analyst\n\nBlake Anderson -- Jefferies -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nMore KSS analysis\n\nAll earnings call transcripts"
}