{
  "companyName": "VIA optronics AG",
  "companyTicker": "VIAO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/29/via-optronics-ag-viao-q2-2022-earnings-call-transc/",
  "content": "VIA optronics AG (VIAO 6.41%)\nQ2 2022 Earnings Call\nSep 29, 2022, 8:30 a.m. ET\n\nOperator\n\nWelcome to the VIA Optronics preliminary second quarter 2022 earnings conference call and webcast. [Audio gap]\n\nLisa Fortuna -- Investor Relations\n\nWelcome. Joining me today are Jurgen Eichner, founder and chief executive officer; and Dr. Makcus Peters, chief financial officer. I'd like to remind everyone that statements made during this conference call relating to the company's expected future performance, future business prospects, or future events or plans may include forward-looking statements as defined under the Private Securities Litigation Reform Act of 1995.\n\nParticipants are directed to VIA Optronics' Form 20-F for a description of certain business risks, some of which may be outside of the control of the company that may cause actual results to materially differ from those expressed in the forward-looking statements. We expressly disclaim any duty to provide updates to our forward-looking statements whether as a result of new information, future events, or otherwise. Our earnings release for the preliminary second quarter 2022 results is posted on the company's website at via-optronics.com. With that, let me now turn the call over to Jurgen for his opening remarks.\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nYes. Thank you, Lisa. Good morning and good afternoon, and thank you all for joining us today. So once more we are proud of how our team has performed during the quarter amid ongoing component shortages and shipping challenges.\n\nWe grew the top-line revenue by 10% with 15.5% growth in our display solutions segment, driven by stronger demand across all end markets and the ongoing production ramp-up at the facility in Nuremberg. Further, we continue to see a greater need for connectivity in cars, more autonomous systems, and shared mobility. The accelerated transition to a carbon-neutral economy is creating a strong tailwind for EV and hydrogen markets and [Technical difficulty] to implement our previously announced actions to improve profitability and cash flow with various cost savings and performance improvement projects expected to take effect during the second half of the year. These actions include both internal activities such as improving production efficiencies and streamlining resources, as well as measures related to customer pricing and supply agreements to improve the company's profitability and cash flow.\n\nMost of our sales prices have already been adjusted and freight costs continue to be offloaded. We remain on track to become net profit neutral at the end of the year on a run rate basis. Furthermore, as indicated before, based on our very low use of energy in our production, we are not as impacted by energy costs compared to most others in the industry. This quarter, we announce plans for new production location in the Philippines to support our growth strategy as we diversify our production base and improve cost efficiency.\n\nWe can leverage VIA Optronics in the Philippines, which we incorporated in September of last year to build a new more cost-effective site that can produce current VIA products in conjunction with the Chinese production site in Suzhou. This site helps VIA Optronics to expand our production capabilities and capacity in Asia and exemplifies the significant growth and demand for our solutions. Furthermore, we announced a new production line in Thailand due to the increase in camera demand that we see in the future. Similar to displays, cars will be equipped with up to 10 cameras per car.\n\nWe continue to expect that camera revenues will become a very visible revenue stream in the future. In summary, we are pleased by the process we have made during the second quarter of 2022 with effects becoming visible during the remainder of this year and beyond, supporting continued momentum and growth. With that said, I'd like to turn now the call over to Markus for review of our second quarter 2022 performance and full-year outlook. Markus?\n\nMarkus Peters -- Chief Financial Officer\n\nThanks, Jurgen, and good morning and good afternoon to everybody. I'll start by reviewing our financial and operating performance for the second quarter of 2022. Then I will outline the outlook for the third quarter and full year 2022. For the second quarter, total revenue of EUR 48.1 million increased 10% from EUR 43.7 million for the second quarter of 2021, driven by further growth in the Display solutions segment.\n\nDisplay solutions revenue of EUR 43.2 million increased by 15.5% from EUR 37.4 million in the second quarter of 2021, driven primarily by stronger demand in end markets and ongoing production ramp-up in [Inaudible]. Sensor technologies revenue of EUR 4.9 million decreased by EUR 21.8 million, sorry by 21.8% from EUR 6.3 million in the second quarter of 2021 due to lower demand, partially as a consequence of market saturation. Revenue from the automotive end market increased 54% in the second quarter 2022, and accounted for 46% of display solutions revenue, especially due to higher volumes within the EV market segment. Revenue related to the industrial and specialized applications end market decreased 22% in the second quarter 2022, yes this accounted for 30% of display solutions revenue.\n\nRevenue related to the consumer end market increased to 37% in the second quarter 2022 and accounted for 24% of display solutions revenue due to strong demand partially caused by the termination of lockdown restrictions in China. Gross profit margin decreased to 8.5% from 14% in the second quarter of 2021. Display solutions gross profit margin of 6.5% decreased from 10.7% in the second quarter of 2021 due to higher logistics cost throughout the value chain and margin pressure. Sensor technologies gross profit margin of 31.8% decreased slightly from 34.4% in the second quarter of 2021, driven by decline in demand and consequently lower utilization of the production facility in Japan.\n\nWe continue to work on stabilizing the current situation with our team in Japan. Research and development expenses decreased to EUR 1.7 million from EUR 2 million in the second quarter of 2021 as we shifted toward utilizing more internal R&D services. Selling expenses remained stable at EUR 1.2 million. General and administrative expenses of EUR 6.5 million increased from EUR 4.9 million in the second quarter of 2021.\n\nOperating loss was EUR 1.2 million in the second quarter 2022, compared to operating loss of EUR 3.1 million in the second quarter 2021. Net loss was EUR 1.4 million or EUR 0.31 per basic and diluted share, compared to net loss of EUR 4 million or EUR 0.88 per basic and diluted share in the second quarter of 2021. EBITDA loss was EUR 0.1 million in the second quarter of 2022, compared to EBITDA loss of EUR 1.9 million in the second quarter of 2021. Display solutions EBITDA loss was EUR 0.3 million, compared to EBITDA of EUR 0.9 million in the second quarter of 2021.\n\nSensor technologies EBITDA was EUR 0.3 million, compared to EUR 1.6 million in the second quarter of 2021. Other segments' EBITDA loss was EUR 0.1 million, compared to an EBITDA loss of EUR 4.4 million in the second quarter of 2021. The second quarter of 2021 results were positively impacted by FX gains. We finished the second quarter with cash and cash equivalents of EUR 53.3 million, up from EUR 47.1 million at the end of the first quarter of 2022, which was driven by improvements in working capital management which enhances our runway to fund our growth initiatives.\n\nFor the third quarter of 2022, we expect total revenue in the range of EUR 44 million to EUR 49 million. For full year 2022, we continue to expect revenue growth of approximately 5% to 10% compared to 2021 taking into account our economic uncertainties. In closing, we are on track to achieve long-term consistent growth. We remain focused on our growth perspectives, especially in the automotive and industrial markets, and are committed to implement further initiatives to improve the company's profitability.\n\nWith that financial overview, I'd like now to turn the call back over to Jurgen for a few closing comments. Jurgen?\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nThank you, Markus. As you can hear, we are very happy with what we achieved during the second quarter toward improving our pricing and decreasing our cost to get back to profitability. As indicated, we feel positive that we will be net profit neutral on run rate basis by the end of the year, with the expectation of further progress over the next two quarters. The expansion plans in the Philippines will further improve our cost base and make us more competitive in Asia and more independent of geopolitical impacts.\n\nOur technology and products are green and fit to the expanding applications in the target markets. We remain highly confident that display, touch, and camera quantities will continue to grow its base for the foreseeable future. In conclusion, we are proud of VIA's recent accomplishments on cost reductions and are excited about the prospect for the remainder of the year and beyond. Looking at all the insecurities and sentiments in the world, we are happy to see not only stable market conditions for our products.\n\nOn top of that, we see growing demands giving us a solid base for our business, resulting in our belief that we are well-positioned to drive strong growth and shareholder value over the next several years and we are looking forward to sharing the journey with all of you. Thank you for your continued support. That concludes our prepared remarks and I'll now turn the call over to the operator for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question today comes from Andrew Buscaglia from Berenberg. Your line is open. Please go ahead.\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nGood morning.\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nHi, Andrew.\n\nMarkus Peters -- Chief Financial Officer\n\nHello, Andrew.\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nGood morning. I was just hoping you would provide a little more color around your guidance of 5% to 10%. You know, the Q3 guide implies year-over-year dip in revenues at the midpoint and then some improvement probably in Q4, but I guess what gives you that confidence to maintain the guide, what are you seeing in the backlog and can you just talk about visibility at this point?\n\nMarkus Peters -- Chief Financial Officer\n\nAbout the turnover guidance we have some visibility for Q3, so we hope we can achieve these numbers and of course all comments are subject to the uncertainties of the market, but we think that is more probably than not profit that we achieved this turnover in the given guidance for the total year.\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nMaybe in that same topic, just maybe the impact of the supply chain, if you could talk about what you're seeing in terms of supply chain challenges affecting the top line, how the quarter progressed and kind of what you're seeing to date?\n\nMarkus Peters -- Chief Financial Officer\n\nJurgen, do you want to take this or everyone gives a comment?\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nYes. I can say something to it. So there we have some challenges in the supply chain, but not really, we could actually manage that well, so I don't expect any impact there in the next -- in the remainder of the year. What we see is that some of the demands in the consumer market are actually going down talking about revenues, so that will be a change, but it's at the end of the day the low-margin products that we also wanted to basically reduce in our portfolio so that is basically a development, but it fits into our strategy.\n\nMarkus Peters -- Chief Financial Officer\n\nYes. And the bigger challenges we have with the logistic chains rather than with the supply chain in getting material, because if there is a strike in the Hamburg Harbor and the ships can't unload, that's, of course, a problem. And it is, it's all about logistics and if Shanghai Port closes again, then you have to switch to planes if you get a plane. So that's a bigger challenge for us than the availability of raw materials.\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nYes. OK. And then --\n\nMarkus Peters -- Chief Financial Officer\n\nAlso bigger cost constraint from one of the biggest cost increases in the last quarter is logistic cost.\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nSo even in light of all these, obviously everyone is sort of being affected by this, but you're EBITDA almost broke even this quarter. Markus, do you think going forward it sounds like you're confident with some of the actions you've been taking that you'll hit break even? I mean, I know you had said by I think exiting the year, but is there any more color you can provide on Q3 and Q4?\n\nMarkus Peters -- Chief Financial Officer\n\nQ3, Q2 was strongly was impacted by some fixed gains. As we know, from the IPO, we collected a couple of dollars, which we still keep in our accounts and since our balance sheet is in euros with the current situation of strength of the U.S. dollar, we have of course currency gains, which we have to recognize in the P&L. So I'm certainly confident that some of the measures we are planning will take the first effect in Q3 and Q4 and they will continue to accelerate in the next year.\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nYes. Maybe we sort of mentioned as well Andrew, so we are today for the next five, seven days just basically a number together with our management team. So we are planning for the upcoming year and whatever we have seen so far looks OK. So it seems that we are in a good way.\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nOK. All right. Thank you, guys.\n\nMarkus Peters -- Chief Financial Officer\n\nMost welcome.\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nThank you, Andrew.\n\nOperator\n\nOur next question comes from Anthony Stoss from Craig-Hallum. Your line is open. Please go ahead.\n\nAnthony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nHi, guys. A couple of questions for Markus and then a follow-up for Jurgen. Markus, can you give us more detail on the other operating income, $7.6 million, what is that, why was it so big? And then just your view on just operating expenses going forward? And then again I have a follow-up for Jurgen after.\n\nMarkus Peters -- Chief Financial Officer\n\nYes. The operating incoming expenses needed to be seen as gross values, and they are in the overwhelming amount driven by FX effects. So if you take both, you'll probably have an approximation of the FX effects.\n\nAnthony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nOK.\n\nMarkus Peters -- Chief Financial Officer\n\nAs I've explained before, we have huge amounts of U.S. dollars and with the strength of the U.S. dollar and preparing a balance sheet in euros, I'd rather, I believe we don't need to continue because it's easy math then you have FX gains and of course, we recognized this in the books, we don't hide it.\n\nAnthony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nDo you expect your operating expenses to remain relatively flat or grow sequentially each quarter going forward?\n\nMarkus Peters -- Chief Financial Officer\n\nThe operating expenses I would expect to be rather flat and grow with inflation. And of course, I mean if you, if you increase, if you double your production you also will have some increase in operating expenses, but it will accelerate at a lower rate. That's our expectation.\n\nAnthony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Then the follow-up for Jurgen, part of the reason for the IPO was your expectation on growing gross margins toward 20%. You're sitting around 8% still. What can you do to really help improve gross margins going forward and really keep it solidly double digits and work toward 20%?\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nYes. Hello, Tony. So again, so since the IPO a few things have changed, especially the price pressure in the automotive market, which basically was accelerated by the automotive OEMs during the last, during the COVID years, let's put it that way. What we are doing to get back on track in terms of margins is relatively simple.\n\nAt the end of the day, we are removing, as indicated before, the low-margin projects. So you will see, or maybe not this year, but in the next year you will see a reduction in the consumer low margining projects. We are focused on the higher margining projects, and on top of that, we are coming up with added value projects where we have a higher margin now, but this will come over time. Now what you also see is that we are moving to lower, it sounds strange, but at the end of the day we are moving to lower-cost countries.\n\nSo we are moving partly products from China into the Philippines where we have a different cost base. We want to escape whatever, 10% to 20% cost increase, salary increase, or whatever you call it. In China last year it was 20%. So this would give us another competitive edge compared to others which are still bound to Mainland China and don't have other alternatives.\n\nSo it's a combination of selecting the right projects. It's adding value in areas where we can probably talk more about during the next call. And it's also reducing costs, cost in production, not only by changing locations or using other locations, but also putting a lot of effort right now in production efficiency and automation.\n\nAnthony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nPerfect. Thanks for the color. Best of luck, guys.\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nThanks, Tony.\n\nMarkus Peters -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nAt this time there are no other questions in the queue. Today's call has now concluded. We'd like to thank you for your participation. You may now disconnect your lines.\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nThank you very much.\n\nDuration: 0 minutes\n\nLisa Fortuna -- Investor Relations\n\nJurgen Eichner -- Founder and Chief Executive Officer\n\nMarkus Peters -- Chief Financial Officer\n\nAndrew Buscaglia -- Berenberg Capital Markets -- Analyst\n\nAnthony Stoss -- Craig-Hallum Capital Group -- Analyst\n\nMore VIAO analysis\n\nAll earnings call transcripts"
}