{
  "companyName": "Accuray",
  "companyTicker": "ARAY",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/accuray-aray-q4-2022-earnings-call-transcript/",
  "content": "Accuray (ARAY 1.46%)\nQ4 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Accuray fourth quarter 2022 financial results conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Ken Mobeck, vice president, finance. Please go ahead.\n\nKen Mobeck -- Vice President of Finance\n\nThank you, Operator, and good afternoon, everyone. Welcome to Accuray's conference call to review financial results for the fourth quarter of fiscal year 2022, which ended June 30, 2022. During our call this afternoon, management will review recent corporate developments. Joining us on today's call are Suzanne Winter, Accuray's president and chief executive officer; and Ali Pervaiz, Accuray's chief financial officer.\n\nBefore we begin, I would like to remind you that our call today includes forward-looking statements. Actual results may differ materially from those contemplated or implied by these forward-looking statements. Factors that could cause these results to differ materially are set forth in the press release we issued just after the market closed this afternoon, as well as in our filings with the Securities and Exchange Commission. The forward-looking statements on this call are based on information available to us as of today's date, and we assume no obligation to update any forward-looking statements as a result of new information or future events, except to the extent required by applicable securities laws.\n\nAccordingly, you should not put undue reliance on any forward-looking statements. A few housekeeping items for today's call. First, during the Q&A session, we request that participants limit themselves to two questions and then requeue with any follow-ups. Second, all references we make to a specific quarter in the prepared remarks are to our fiscal year quarters.\n\nFor example, statements regarding our fourth quarter refer to our fiscal fourth quarter ended June 30, 2022. Additionally, there will be a supplemental slide deck to accompany this call, which can be accessed by going directly to Accuray's investor page at investors.accuray.com. With that, let me turn the call over to Accuray's chief executive officer, Suzanne Winter. Suzanne?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nThank you, Ken. Good afternoon, everyone, and thank you for joining. Since this marks my first opportunity to address you since I became CEO, I want to share with you my goals and vision as I embark on this great opportunity. As we move into fiscal year '23, we are laser-focused on, first, growing materially faster than the market; second, delivering differentiated solutions to greatly improve care and outcomes for all of our stakeholders; third, growing and improving our service business offerings; and finally, enhancing margins and free cash flow.\n\nI will touch on each of these in my remarks, but this is my focus and the focus of my team as we enter fiscal year '23. I want to start out by thanking the Accuray team for their steadfast dedication to serving global customers this quarter and this year. Our teams demonstrated incredible resilience navigating the supply chain and logistics challenges to fulfill demand and deliver outstanding support to our customers and their patients. Today, we reported strong fourth quarter results on both revenue and EBITDA despite this challenging macro environment.\n\nIn the fourth quarter, we added 37 new system orders, which is up 12% growth in units sequentially. We see growing demand for the CyberKnife S7 system for sites that are building dedicated stereotactic radiosurgery and SBRT programs, as well as rapid adoption of our new product introductions like ClearRT Imaging and Radixact where to date we have 115 orders for ClearRT, with 73 shipped to customers since our introduction 18 months ago. Reflecting on the full year, we achieved significant company and product milestones. We finished our fiscal year with $430 million in revenue, representing 8% year-over-year growth.\n\nThis is the highest revenue performance in the company's history and a year-over-year growth rate that is more than twice the estimated worldwide radiotherapy market growth. Annual product revenue was outstanding with 16% unit growth and 22% revenue growth. Our innovation-driven growth strategy is working. This year, we strengthened the product portfolio by establishing Radixact as the industry's only CT-Linac platform available in the market.\n\nThe introduction of ClearRT provides superior image quality compared to conventional external beam radiation therapy systems, and matched with Accuray's proprietary Synchrony technology, is the only system that can continuously track tumor movement and adjust treatment delivery to the tumors' location in real time without the use of gating, which stops treatment when the tumor is out of range. As a result of this new standard of imaging performance, this year ClearRT was awarded the 2022 MedTech Breakthrough Award for the Best New Technology Solution for Oncology. ClearRT provides better visualization to guide therapy compared to conventional external beam radiation therapy systems that use cone-beam imaging and at approximately half the cost of MR-Linac and with greater versatility and speed. This year, we also introduced VOLO Ultra to enhance Radixact treatment planning speed and quality.\n\nCustomers have told us that VOLO Ultra is a significant enhancement, reducing treatment planning time from 45% to 90%, depending on the plan. Customers have reported that departments that normally treat an average of 40 patients per day can now treat an additional eight patients per day due to the increased operational efficiency from VOLO Ultra. Additionally, this year the CyberKnife gained additional momentum capitalizing on the rapidly growing use of five fractions or less ultra hypofractionated treatments for providers building world-class stereotactic radiosurgery and SBRT programs. CyberKnife's unique open robotic design delivers thousands of noncoplanar beam angles to the tumor, moving around the patient, delivering the highest precision therapy while reducing anxiety that can be caused from other radiation therapy systems that require the patient to move into a smallbore tunnel for treatment.\n\nAdditionally, the use of Synchrony 4D continuous tumor tracking and correction also eliminates the need for restrictive breathing devices that are required with other radiation therapy systems, making it the gold standard SRS/SBRT system with the best experience for the patient. In FY'22, CyberKnife showed significant revenue growth due to the growing demand for installations that provide the capability to deliver five fractions or less treatment for key indications like prostate, lung, breast and metastases. These clinical indications represent approximately 70% of all patient cases worldwide. However, to date, only approximately 20% of treatments are estimated to use ultra-hypofractionation.\n\nAccuray Technology is strongly positioned to capitalize on the expected demand for ultra hypofractionated treatments, which we believe will be a market catalyst to drive over 2,200 technology replacements aged 10 years or older over the next five years and representing a $5 billion total market potential in the U.S. and Western Europe alone. Additionally, this clinical trend is reinforced as we saw greater patient awareness for Accuray Technology and more patients driving decisions for their own course of therapy. We reported incredible patient stories like retired Rear Admiral, Garry Hall, former national security director to the White House, who was featured in the June 30 USA Today insert regarding his experiences being treated on the CyberKnife system after being diagnosed with prostate cancer.\n\nAfter his wife's diligent research exploring treatment options, he advocated for the CyberKnife treatment due to its noninvasive, nonsurgical, highest precision five-fraction treatment. Also, Al Gold, a retired businessman whose positive experience being treated for prostate cancer with the CyberKnife system drove his decision to name his Kentucky Derby racehorse CyberKnife. We continue to be inspired by patients who have been treated with our technology and are working with patient advocacy groups to educate patients on treatment options. Turning to our full year regional performance, we are seeing the return on investments we are making in the Americas region commercial infrastructure.\n\nIn FY'22, the Americas region delivered 31% year-over-year growth in orders and 17.5% growth in revenue. In the fourth quarter, consistent with our goal of expanding patient access, we installed the first Radixact system with ClearRT and Synchrony at the VA in Los Angeles, where the latest radiation therapy will now be available to the greater L.A. community. In the EIMEA region, while orders declined 10.6% year over year, largely due to geopolitical tensions given the war in Ukraine, revenue increased 10.7%, driven by year-over-year growth in India and Southern Europe subregions.\n\nIn the fourth quarter, we won two new orders in Spain following a large public tender for systems in the premium high-performance segment. In the APAC region, the extended China COVID lockdown tempered order demand, but we still increased orders by 8% year over year. However, backlog conversion was also very strong with revenue growing 9% year over year. In Q4, we installed the second Radixact system with ClearRT and Synchrony at the prestigious Royal Brisbane and Women's Hospital in Australia.\n\nAnd finally, in Japan, region orders were flat and revenue declined 15% year over year and was disproportionately impacted by FX headwinds with the strengthening of the U.S. dollar. On the positive side, Japan continues to lead in competitive conversions with four or five orders in the fourth quarter being replacements of older competitive installed base. This past year, we've really turned up the volume with our strategic partnerships with the goal of creating best-in-class solutions and reducing the time to deliver them to the market.\n\nOur partnership with RaySearch continues to strengthen with treatment planning, OIS solutions and development of online adaptive solutions. Our partnership seeks to leverage Accuray's ClearRT imaging and RaySearch' powerful AI and contouring algorithms to provide an optimized solution for online adaptation of a treatment plan, while the patient is still on the treatment table. Brainlab, a leader in surgical navigation, provides connectivity of their Element software and Quentry registries for CyberKnife customers doing brain and spine procedures. Our partnership leverages Brainlab's expertise and access to their installed base of over 5,000 neurosurgical customers globally.\n\nFinally, our partnership with C-RAD enhances our breast cancer treatment capabilities on Radixact and expands the versatility of the system to single bunker sites, providing the most comprehensive breast solution in the market. This year, 163 new clinical and physics abstracts were presented at the major conferences worldwide, demonstrating how Accuray's unique technology is improving clinical outcomes compared to conventional linac. In FY'22, the multicenter PACE-B trial demonstrated the difference the CyberKnife robotic noncoplanar delivery with Synchrony made in the quality of life for prostate cancer patients treated with ultra hypofractionated therapy. PACE-B demonstrated 50% less bladder complications compared to patients treated with conventional systems.\n\nThe TomoBreast trial showed that Accuray's precise delivery of hypofractionated therapy was associated with 8.9% improvement in the secondary negative impact to heart and lung function compared to hypofractionated treatments delivered on a conventional external beam system. And at the Radiosurgical Society meeting, a study abstract highlighting the use of the CyberKnife system for trigeminal neuralgia was recognized as the best clinical abstract of the conference. Study results showed that pain relief lasted for 10 years after receiving treatment in greater than 70% of patients treated. Turning to our growth agenda for fiscal year '23, our strategy of innovation-driven growth is working, and we are committed to build upon these fundamentals and strengthen new areas that position us to win more customers and gain share.\n\nThe first pillar of our strategy, disruptive innovation. I will remind everyone of our ultimate objective at Accuray, building a better future for patients diagnosed with cancer or certain neurological diseases. We are committed to being recognized by the industry as a true innovation leader where we attract the best talent and create an environment that envisions a better way forward. Typical med tech companies invest between 5% to 10% of revenue back into R&D.\n\nAccuray expects to invest approximately 14% of revenue back into R&D in FY'23 to help ensure we are at the forefront of radiation therapy innovation and provide the maximum ROI for our shareholders. We do this in an effort to provide new and effective ways to treat patients and expand options for care, which we believe will translate into long-term value for our shareholders. We have four main product development programs that are the top priorities for the company. Additionally, we are embarking on a multiyear global transformation of our service business, which has been flat for the last several years, evaluating all segments of our service offerings in an effort to deliver and capture greater value for our support solutions and strengthen and grow this annuity by helping our customers become more efficient and advance their operations.\n\nFor example, many customers dealing with labor shortages and turnover are seeking solutions that provide advanced system training tailored more specifically to their needs. We will also leverage system data to provide operational insights that can be a powerful tool to help radiation therapy departments optimize workflow, capacity and efficiency. Further, we have restructured our service and commercial organizations to ensure that we become closer to our customers, and we'll continue to evaluate the effectiveness and profitability of direct versus indirect operations in our target geographies. The second pillar focuses on expanding financial margins.\n\nAs we enter the new year fiscal year '23, we expect continued macroeconomic challenges and new potential headwinds to emerge. We will be laser focused on margin expansion and plan to increase our operating rigor and accountability, capture greater value on our products and solutions, and look for ways to further optimize our supply chain through supplier optimization, flexible sourcing and ensuring that we operate with efficiency and sustainability. We will invest in the right areas that we expect to drive value for our customers and at the same time, attacking areas where we see margin leakage. The third pillar is simplifying and building a more durable business.\n\nWe need to make work easier and be nimbler in the way we make decisions and operate. As a result, we are making significant investments back into the company foundation. Approximately $12 million investment in ERP and cybersecurity are main areas of focus to protect the company and our customers. The return on these investments is expected to solidify our fundamentals, provide better business data and analytics so we can make faster and more effective decision-making, and ultimately simplify our work.\n\nOur final pillar is transformational corporate strategies. We just celebrated the three-year anniversary of the creation of CNNC Accuray in China. The China JV now has an organization that will be 200 people strong in China, a state-of-the-art manufacturing facility, an incredible training center that will be able to serve global customers, a greater than 75% win rate in the Type A premium market over the past three years, and strong backlog for revenue conversion. Additionally, we will continue to compete in the Type B segment with our current product portfolio, accessing the largest segment of the China market, where 1,800 systems in the next five years are expected to be sold, representing market potential of approximately $600 million annually.\n\nWhile the COVID lockdown has delayed our jointly developed Type B product, we are on track for NMPA submission in Q2 of FY'23 and are confident that it will be a winning solution for the growing Type B market and expect it to make a meaningful impact on Accuray in FY'24. Additionally, the translation of the value product to access the global market segments beyond China will allow Accuray to compete in a broader global market where conventional external beam radiation therapy systems currently compete. This represents an incremental 45% of the global radiation therapy market access where we currently do not compete with our premium high-performance products. I will now hand it over to Ali to review the financials.\n\nAli Pervaiz -- Chief Financial Officer\n\nThank you, Suzanne, and good afternoon, everyone. We are pleased with our team's dedicated execution. And as a result, Accuray has delivered a strong quarter and closed fiscal 2022 despite ongoing global challenges that Suzanne had referenced earlier. Total revenue for the quarter was $110 million, which was down 1% compared to the prior year.\n\nOn a full year basis, total revenue was $430 million, which was up 8.5% from prior year and a record revenue number for the company, driven by strong execution from our cross-functional teams despite all the macroeconomic headwinds. Product revenue for the fourth quarter was $58 million, an increase of 3.4% from prior year. On a full year basis, product revenue was $214.7 million, an increase of 21.5% year over year, representing strong customer demand for our key innovations. From a product mix perspective, the TomoTherapy platform accounted for approximately 65% of the quarter's revenue unit volume, while the CyberKnife platform accounted for the remaining 35%.\n\nFor the full year, TomoTherapy accounted for approximately 69% of unit volume, whereas the CyberKnife platform accounted for the remaining 31%. Service revenue for the quarter was $52 million, which was down 5% from prior year primarily due to FX headwinds in our non-U.S. markets. On a full year basis, service revenue was $215 million, a decrease of 2% from the prior year, again, mainly impacted by FX headwinds.\n\nGross orders played out as expected with fourth quarter orders at $88 million, which was down 22% from the fourth quarter of the prior year, which had challenging comps. For the fiscal 2022, gross orders totaled $332 million, which was up 2% from the prior year. From a product mix perspective, the TomoTherapy platform accounted for approximately 65% of gross order unit volume for the quarter and the CyberKnife platform accounted for the remaining 35%. For the full year, TomoTherapy accounted for approximately 67% of gross orders unit volume and CyberKnife accounted for the remaining 33%.\n\nOur book-to-bill ratio, which is defined as gross orders divided by product revenue was 1.5 in the fourth quarter and for the full year, which is higher than the industry standard of 1.2 to 1.3. Moving forward, we will use the book-to-bill ratio versus the industry to measure the strength of our order performance. Additionally, we will focus our teams in booking orders that are expected to convert to revenue in a more time-efficient manner prior to 30 months. We think this is a good predictor of short and midterm revenue trends.\n\nMoving to backlog, I will remind everyone that we report product order backlog which is 30 months or younger. We ended the fourth quarter with backlog of approximately $564 million, which is 9% lower than prior year. This was due to net age-outs for the quarter, which were approximately $40 million, mainly driven by slowed installations in China due to COVID lockdowns and delays in our EIMEA region due to the war in Ukraine, and we expect to convert the majority of these to revenue in the quarters ahead. Total age-ins for the quarter were $9.8 million.\n\nWe had only one unit cancellation that was $2.3 million, and there were $3 million of FX and other adjustments. For the year, cancellations totaled $11 million, which is the lowest cancellation amount over the last five years. Our focus for fiscal year '23 and beyond will be on reducing overall age-out activity levels. This year, approximately $35 million of orders aged back in during fiscal 2022, which is the highest age-in activity we have reported over the last five years, validating our views that our 30-month age-out policy does not translate into an order loss as our teams remain focused on revenue conversion, including from deals that have aged out.\n\nOur overall gross margin for the quarter was 39.1% compared to 39.4% in the prior year despite macroeconomic challenges referenced earlier. On a full year basis, our overall gross margin was 37.2% compared to 40.3% from prior year, mainly due to the inflation and FX headwinds, which I will further expand on as I provide context on our product and service gross margins. Product gross margin for the quarter was 45.1% compared to 41.5% from the prior year, primarily driven by favorable product mix, including upgrades with higher margins, reflecting our innovations. Full year product gross margin was 40.7% compared to 42.2% from the prior year, primarily driven by increased material and freight costs, which were partially offset by proactive margin preservation actions focused on price and cost discipline.\n\nService gross margin for the quarter was 32.5% compared to 37.3% from the prior year, primarily due to lower contract revenue in our non-U.S. markets driven by recent FX headwinds. On a full year basis, service gross margin was 33.7% compared to 38.7% from the prior year due to higher parts and freight costs, increased travel expenses and FX headwinds. Operating expenses for the quarter were $41 million, compared to $40 million in the prior year.\n\nOn a full year basis, operating expenses were $151.8 million, compared to $137.3 million from the prior year, driven by strategic investments in R&D and incremental sales and marketing expenses as business returns to a more normalized run rate in the post COVID-19 environment. Operating income for the quarter was $2 million, compared to $4.1 million from prior year, whereas on a full year basis, operating income was $8.1 million, compared to $22.2 million. Adjusted EBITDA for the quarter was $5.2 million, compared to $6.7 million in the prior year. On a full year basis, adjusted EBITDA was $22.8 million, which exceeded the higher end of our revised guidance.\n\nThe reconciliation between GAAP net income and adjusted EBITDA is described in our earnings release issued today. Turning to the balance sheet, total cash, cash equivalents and short-term restricted cash amounted to $89 million, compared to $98 million at the end of last quarter. Net accounts receivable was $94 million, up $9 million from prior year due to back-end loaded shipments. Our net inventory balance was $142 million, up $16 million from prior year as we have built up our inventory to navigate through the ongoing supply chain challenges to fulfill our customer demand while ensuring healthy service stocking levels.\n\nThose are our key financial highlights. And with that, I'd like to hand the call back to Suzanne for our fiscal 2023 outlook. Suzanne?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nThank you, Ali. Looking forward to FY'23, our revenue guidance takes into account continued uncertainty and impact from the macro environment and COVID lockdown in China to persist through the first half of the fiscal year. Additionally, we have assumed the incremental foreign exchange headwinds we saw in Q4 to continue in the first half as well. For FY'23, we expect revenue in the range of $447 million to $455 million, with a midpoint of approximately 5% growth year over year, which would outpace the market.\n\nSimilar to prior years, we expect our revenue to be 45% in the first half with the remainder in the second half of FY'23. For adjusted EBITDA, we are targeting a range of $26 million to $30 million with a midpoint of approximately 23% year-over-year growth. Ali and I expect to have greater visibility to macro conditions and the impact on our performance as we move through the fiscal year. Improvements in supply chain factors and accelerated recovery in China will allow us to drive performance higher than guidance.\n\nIn closing, we remain confident in our long-term strategy and pipeline of innovative solutions and are committed to investing in technology and clinical innovation that differentiates Accuray Technology and makes a meaningful difference in patient outcomes. We have exciting growth catalysts in our pipeline that we believe will sustain our long-term growth profile and will allow us to deliver above-market growth. Operationally, we remain laser-focused on capital deployment, improving margins and profitability while strengthening our balance sheet so that we maximize financial flexibility and create shareholder value. Once again, I would like to thank our entire Accuray team for their dedication and passion.\n\nWe know that the work we do makes a major difference in the lives of the patients we serve. This is why I came to this company, and I believe it is our greatest competitive advantage. I am honored to be taking over the role as president and CEO of this amazing company and team. Together, we will move the organization forward and fulfill our company mission of creating a better future for patients with cancer and neurological disease.\n\nI will now turn it over to the Operator for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Today's first question comes from Brooks O'Neil with Lake Street Capital Markets. Please go ahead.\n\nBrooks O'Neil -- Lake Street Capital Markets -- Analyst\n\nGood afternoon, and I guess I have to say congratulations on a terrific start to both Suzanne and Ali. I think it's very encouraging, so I'm quite excited. I actually can't believe you got any orders in the quarter, and to get $88 million is an amazing accomplishment. But what I want to ask about is, I know this is a delicate topic, but if you could talk a little bit about your competitive assessment and how your systems and machines stack up relative to your specific competitors, that would be a big help to us.\n\nAnd again, congratulations on a terrific start.\n\nSuzanne Winter -- President and Chief Executive Officer\n\nThank you, Brooks, and thank you for the question. Yeah, in terms of how we stack up versus our competition, I think we are in a very strong position, especially in the premium and high-performance segments and those customers that are looking to do ultra hypofractionated treatments, which is again, a growing clinical trend. What that means is, they need more of the highest precision possible because it's higher radiation dose in fewer fractions. With all of the work that has been done on our technology development to be able to provide that level of precision is now coming to fruit, to bear, and we are doing very, very well.\n\nAgain, the biggest differentiators for us for us are certainly the ClearRT, the better visualization. Again, we're the only CT-Linac on the market, which can provide diagnostic level CT imaging so that they can see what they treat. Synchrony continues to be a differentiator for Accuray in our ability to follow tumor motion, which happens during the procedure, and adjust the beam in real time. And now we're seeing the clinical data to show that it makes a difference in the long-term outcome of the patient, as well as the short term.\n\nThat's been tremendous. And I think we see that from our product revenue at 22% revenue growth for the year, we're starting to see really the fruits of that kind of technology differentiation.\n\nBrooks O'Neil -- Lake Street Capital Markets -- Analyst\n\nGreat. And then just can you give us a sense in real time about the situation in China and what you're seeing there? Do you expect I guess to be able to advance your goal in China in 2023? Or do you think you're going to be locked down so to speak?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nYes. Our guidance, the assumption in our guidance is that we're going to see similar conditions in the first half of the year due to the COVID lockdown. The second half of FY'22, we did see a softening of demand just because they were locked down. They had to remain on site.\n\nBut I do think there's glimmers of hope. There is definitely some movement happening, especially on the bidding processes. But again, from a guidance perspective, we are assuming that it's going to be similar to the second half, what we'll see in the first half of the year. But again, it isn't demand that's going away, it's really when does it start back up again.\n\nIn China, we had a very strong year overall at 11% growth in revenue, 12% growth in orders. We are over the 100 installed base in China, installs are up. We're very excited about where we stand with China. We've got a very healthy backlog from which to convert.\n\nAnd while we're competing the Type B products now, we're really excited about the future with the JV product, and we're back on track with getting a process into NMPA for that product. Again, it remains to be seen, but we're being cautiously optimistic based on some of the signs that we're seeing.\n\nBrooks O'Neil -- Lake Street Capital Markets -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nAnd the next question today comes from Neil Chatterji with B. Riley. Please go ahead.\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nHi, guys. Can you hear me?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nYes. Hey, Neil.\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nOK. Thanks for the questions, and congratulations, Suzanne and Ali, for being the first call as CEO and CFO. First question, just maybe on -- you mentioned or you touched on the replacement markets would be I guess the 2,200 opportunities. I was just kind of curious on that as we come to the new fiscal year, could you maybe just talk about how this could stack up versus this past fiscal year in terms of the number of systems and hitting that typical 10-year replacement age? Is it kind of at the same level? Or are you expecting kind of a greater number, just given kind of the dynamics with COVID and the current capital spending environment in terms of extending lives of systems?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nYeah. Thanks for the question, Neil. I think what we have seen, especially in the developed markets where we do have an installed base or competition has an installed base that is older, eight years plus, 10 years plus, we actually are seeing increased activity to upgrade those systems. And certainly, we saw that from our Americas revenue, they were our region of the year and over 50% of their business was trade-in/trade-up of the older systems.\n\nIt is a definite focused commercial effort on our part to drive that. And certainly, innovation gives a really strong reason to go to administration to be able to get the capital equipment funds to be able to trade-up and improve the overall performance. That of course is matched with a clinical trend where more patients and more clinicians are starting to use ultra-hypofractionation as we talked about, within that high-performance segment. I expect it to continue, especially in the developed markets as a driver.\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nGot it. Thanks for that. And then maybe just as a follow-up, you mentioned in relation to the age-outs in EIMEA, the kind of Ukraine Russia impact. I was just kind of curious more broadly just with the current geopolitical situation, is that impacting kind of other aspects of the business, whether it's just the Asia Pac business or the supply chain say from like China, U.S., Taiwan relations? And then also if having a local partner in China helps kind of insulate you at all from that.\n\nSuzanne Winter -- President and Chief Executive Officer\n\nSure. There was -- let me just take some of the questions in part, and I'll have Ali jump in here as well. But just the overall sort of geopolitical tensions, I think it has impact really across the board. Not only from our age-outs or customers being able to install.\n\nAnd certainly, in China we know that there's been delays and that has impacted our net age-outs. However, those orders are not going away. Those licenses aren't going away. It's really just a timing issue in terms of install.\n\nBut that also -- those kinds of events are also impacting from a supply chain standpoint for example. And again, our supply chain team I think has done just a tremendous job in managing everything that gets thrown at them to be able to fulfill and also just the variability in what the issue du jour might be in terms of what they need to deal with. But for example, one of the areas where we know we have new shortage would be in the specialty gases, which is directly impacted by what's happening in Ukraine. These specialty gases have worsened since, the access to the specialty gases have worsened since the war in Ukraine and our teams are working overtime to make sure that we've got other supplies and that we mitigate that.\n\nBut that's an example I think of there's always an issue that we are contending with. But I think that what we've put in place is early visibility, early action. And I just -- I can't say enough about the team here and what they've been able to do to manage it. But Ali, I'll let you talk a little bit about the age-outs.\n\nAli Pervaiz -- Chief Financial Officer\n\nYeah, absolutely. Neil, thanks for the question. In terms of net age-outs, as I referenced in the script, we had net age-outs of about $40 million. And you're right, primarily they were in China and in EIMEA.\n\nAnd like Suzanne said, we have a high level of confidence for the orders from China to age back in. It's just a matter of time when sort of the situation over there loosens up. On EIMEA, specifically the Russia orders, we are certainly keeping a close eye on them because that situation is pretty dynamic. We continue to check in with our teams to make sure that we're doing everything we can to try and convert those to revenue.\n\nThat's the situation from a net age-out perspective. I think one thing I do want to reiterate is that we had, in fiscal year '22, $35 million of orders that aged back in and contributed to revenue. Our teams are maniacally focused on ensuring that we are working the entirety of our backlog and trying to convert it to revenue.\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nGreat. I'll jump back in the queue. Thanks.\n\nOperator\n\nAnd our next question today comes from Marie Thibault with BTIG. Please go ahead.\n\nMarie Thibault -- BTIG -- Analyst\n\nHi. Congratulations on the strong report, and congrats to both Suzanne and Ali on this first quarter on the call. I wanted to start maybe with a general question on capex environment. I know you gave us a little bit of color on China, but would love to hear just across your geographies, what hospital appetite for capital spending is like, whether you're seeing any slowdowns or delays in purchasing decisions at this point?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nThanks for the question, Marie. I would say that it differs by region. It also differs by institution a little bit of what we're seeing. I think that in general, I would say of course, we're seeing the slowdown in China.\n\nWe probably will see some slowdown from an order standpoint in Japan also just due to potential recession there. But in general, I would say what we learned from COVID is that cancer care continues. As a result, I think we have as a segment and as an industry, become more resilient to the macroeconomic, at least the economy factors. We continue to be very balanced from a regional perspective so that we're not so exposed to one region dynamics.\n\nWhat we see is our customers are still very busy, that there's still a backlog of patients that need access to radiation therapy treatment. And certainly, as post-COVID with increased diagnostic testing and increased again, diagnosis of cancer and actually more progressive, we are seeing our sites that are in need of equipment. We're going where the opportunity is, that's part of building a big funnel. But overall, I think it just -- it varies.\n\nMarie Thibault -- BTIG -- Analyst\n\nOK, makes sense. And certainly, that's a reassuring commentary. Suzanne, I want to dig in a little bit more on some of your comments around improving the service business. Certainly, some of the capabilities you described sound like they would be very useful for your customers.\n\nAre you thinking about raising prices alongside of this? And how long do you expect some of these improvements to take? Is this several quarters? Is this several years? How do you view that transformation? Thanks for taking the question.\n\nSuzanne Winter -- President and Chief Executive Officer\n\nThank you for the question because this is one of our main priorities. It's definitely a multiyear endeavor. And as we know, in the service business, it takes a while to see the impact just because of the long cycle of the sales process. But we're absolutely committed to getting this engine growing.\n\nIt's our annuity, and we think it has tremendous value. Now, we're looking at multiple things, I think, in the area of service. We're certainly looking at everything from adding higher value-added offerings that we believe the customers need, and they have told us that they'd be willing to pay a premium for it. And so again, it's not really just about raising prices.\n\nIt's about creating more value for them for which they will see the operational efficiency benefits. Again, we talked a little bit about reorganizing our teams. We think that that will have a better holistic approach to the solutions that we provide them so that we understand their unique needs and we deliver tailored solutions from a training perspective, from an installation and project management opportunity. And then I think we have other areas where we're going to continue to look to see if there's more operational insights that we can provide, again, that will create value for our customers.\n\nWith that, we think we get the engine running, and at the same time, we think we'll be able to get more margin as well.\n\nMarie Thibault -- BTIG -- Analyst\n\nThank you so much.\n\nOperator\n\nAnd our next question today comes from Josh Jennings at Cowen. Please go ahead.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nHi. Thanks for taking the questions, and congratulations on a strong end of the year and a strong start, Suzanne and Ali. I wanted to ask about just Synchrony and ClearRT. The way we've been thinking about those launches is it's driving increased demand from the customer base globally.\n\nBut I wanted to also just check in as we think about this next fiscal year about pricing and whether we should be thinking about ClearRT and Synchrony adoption attached to system orders driving ASPs up and low pricing be a tailwind because of this technology innovation and maybe a higher attachment rate this year?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nThanks for the question, Josh, and I'll start, then then I'll hand it to Ali. But absolutely, I think that that's the goal of all of the innovations that we are driving, not only differentiation, but that we're also creating a richer configuration to the systems that are ordered and that driving the overall pricing on the system because there is greater value associated with it. And I think that we're starting to see for sure the attachment rates on Radixact systems are inclusive of those two functions, as well as the VOLO Ultra. That's what we're trying to drive with product development and I think we're starting to see that.\n\nAli Pervaiz -- Chief Financial Officer\n\nYeah. I totally agree. We -- I think one of the things going into fiscal year '23 that we're very focused on, which Suzanne spoke about during her prepared remarks, was around margin expansion. And on margin expansion, we are very focused on pricing and making sure that we get the price that our innovations demand.\n\nWe're working very closely with our region teams. We have a lot of their incentives aligned to ensuring that we get price and we get to a certain level of margin on both our orders and our revenue. There's a line of incentive over there, and I feel really confident in our ability to execute on that.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nThanks for that. I wanted to ask about China and the great revenue and order growth in China in the last fiscal year. I was hoping you may be able to help us think through whether you had more success in the Type A channel than the Type B channel as you're making progress toward this Type B launch in the JV, and just how much of a tailwind in the Type B channel. Obviously, the JV is going to create a big tailwind, but just where the business stands today on the Type B side versus Type A in China.\n\nAnd then also, if you could just review the timelines around when we should start thinking about your forecasting, when we should start thinking about revenue contributions from the JV? Thanks a lot of taking the questions.\n\nSuzanne Winter -- President and Chief Executive Officer\n\nOK. Thank you, Josh. Yeah. No, I think we feel really -- we feel so good about the mix between Type A and Type B actually in China.\n\nWe obviously have a very strong backlog in Type A. We are expecting the Fifth Year Plan to come through, and we'll see how much of that will be Type A versus Type B. In general though, we know that the Type B market is a bigger percent of the overall China market, and we want to play there. And we want to play with our best product.\n\nWe are competing now in the Type B product and I would say that we have sort of equal representation from Type A and Type B in terms of orders and revenue as we look at FY'22. But moving forward, we do expect the percentage to be more Type B, especially as we get our new JV product to market. And then Ali, if there's anything else there?\n\nAli Pervaiz -- Chief Financial Officer\n\nNo, I think you covered it.\n\nOperator\n\n[Operator instructions] Today's next question comes from Jason Wittes with Loop Capital. Please go ahead.\n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nHi. Thanks for taking the questions, and congratulations on your start as CEO. Just a couple of questions. One, a clarification on timing for the China JV Class B product.\n\nI guess you were saying -- was that second quarter you're going to submit approval? And after that submission, how long do you anticipate it will take? And I think you had also mentioned related to this that you were potentially going to be showcasing that Class B product at a convention in China this year. I don't know if you'd comment on all those issues.\n\nSuzanne Winter -- President and Chief Executive Officer\n\nThanks for the question, Jason. Yes, so what we did say in the prepared remarks was that we were on track for the submission to NMPA with that product in Q2 of FY'23. Aa a result of the lockdowns that continue and we are expecting to continue, we also think that these shows will not be a good opportunity to do the market introduction. We're actually going to wait to do the market introduction until we are closer to the NMPA approval.\n\nThose plans are still being put in place as we work with our JV partners.\n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nOK. And then you mentioned it should have a material impact on fiscal '24. I assume that's with the orders not with necessarily revenues because it generally takes I guess nine to 12 months or nine to 18 months to put these in the ground?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nWe are expecting a material impact in FY'24, both orders and revenue.\n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nOK. That's good to hear. And then on service margins, I appreciate your focus and your comments in terms of how you're looking to improve those margins. Ideally, where do you think the margin should be for Accuray for service specifically?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nI'll let Ali jump into that.\n\nAli Pervaiz -- Chief Financial Officer\n\nYeah. We obviously, in the past year, experienced a lot of headwinds in the form of inflation in both material and in freight. We have had increased travel costs, and we have had FX headwinds that have been impacting our service business, which is why our margins for the year are around 33.7%. I think it's probably reasonable to expect that through some of the actions we're going to take in fiscal year '23, we revert back to pre-COVID levels.\n\nThat hovered somewhere between 36% and 37% for service. And then we're really excited about going into fiscal year '23 and really transforming the service business. I think through those actions, we can certainly start to expect some more margin accretion in fiscal year '24 and '25. We'll give you more details on that as the year goes on.\n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nOK, that's helpful. And also, in terms of just supply shortages and things like that that clearly impacted this year. I understand that there's still headwinds, but in terms of where you stand in terms of inventories, you've done some build-outs, is that less of an issue that you should be concerned about or we should be concerned about for this coming fiscal year?\n\nSuzanne Winter -- President and Chief Executive Officer\n\nWhere we are constantly working and managing and balancing, I think from a supply chain standpoint, we don't think that we're out of the woods yet. And that's part of the guidance that we have is assuming that at least through the first half, we expect to see some inventory challenges. Some things have gotten better and other things have then come into the spotlight. The environment in general, is just -- has seen significant lead times on certain critical components, so we continue to monitor that again and get early visibility and taking action.\n\nAs a result of that though, we've driven demand for materials for those long lead time components, those kind of things like electronic circuit boards, power suppliers, compute systems, many others. But we've also focused on improving our global stocking position for critical service parts. We've taken a look at the top 20 highest consumption service parts just to make sure that we've got those in place, like magnatrons, the multi-leaf collimators, the jaw actuators. We feel like we're in a good position.\n\nBut again, there are new things that come up, and we just -- we need to be in a constant state of early vigilance.\n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nAppreciate the color. I'll jump back in the queue.\n\nOperator\n\nAnd ladies and gentlemen, this concludes our question-and-answer session. I'd like to turn the conference back over to Suzanne Winter for closing remarks.\n\nSuzanne Winter -- President and Chief Executive Officer\n\nI want to thank everyone for your continued interest in Accuray, and we look forward to speaking with you again in October for our first fiscal 2023 quarter earnings release. And I'll turn it back over to the Operator.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKen Mobeck -- Vice President of Finance\n\nSuzanne Winter -- President and Chief Executive Officer\n\nAli Pervaiz -- Chief Financial Officer\n\nBrooks O'Neil -- Lake Street Capital Markets -- Analyst\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nMarie Thibault -- BTIG -- Analyst\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nJason Wittes -- Loop Capital Markets -- Analyst\n\nMore ARAY analysis\n\nAll earnings call transcripts"
}