{
  "companyName": "Blend Labs, Inc.",
  "companyTicker": "BLND",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/blend-labs-inc-blnd-q2-2022-earnings-call-transcri/",
  "content": "Blend Labs, Inc. (BLND 16.13%)\nQ2 2022 Earnings Call\nAug 15, 2022, 4:30 p.m. ET\n\nCrystal Sumner\n\nGood afternoon, and welcome to Blend's second quarter 2022 earnings conference call. My name is Crystal Sumner, head of legal, compliance and risk for the company. With me today are Nima Ghamsari, co-founder and head of Blend; Tim Mayopoulos, president; and Marc Greenberg, head of finance. After Nima and Marc deliver their prepared remarks, the team will take questions.\n\nYou can find the supplemental slides on our investor relations web page at investor.blend.com. During the call, we will refer to certain non-GAAP measures, which are reconciled to GAAP results in today's earnings release and in the appendix to our supplemental slides. Non-GAAP measures are not intended to be a substitute for GAAP results. Also, certain statements made during today's conference call regarding Blend and its operations may be considered forward-looking statements under federal securities laws.\n\nThe company cautions you that forward-looking statements involve substantial risk and uncertainties and a number of factors, many of which are beyond the company's control, could cause actual results, events or circumstances to differ materially from those described in these statements. Please see the risk factors we've identified in our most recent 10-K, 10-Q and other SEC filings. We are not undertaking any commitment to update these statements if conditions change, except as required by law. I'll now turn the call over to Nima.\n\nNima Ghamsari -- Co-Founder and Head\n\nThank you, Crystal, and good afternoon, everyone. Thank you for joining us. I'll cover three things today: first, I'll highlight our Q2 results and business trends, which are reinforcing Blend's underlying growth thesis; second, I'll lay out our plan for realigning our cost structure and positioning Blend for future profitability; and third, I'll speak to key trends in our business, and how we'll continue to win going forward. Starting with Q2 results.\n\nWe continue to see strong top-line performance with revenue at $65.5 million for the quarter. We grew our Blend platform revenue by approximately 5% year over year against a 37% mortgage market volume decline in the same period. We are continuing to increase our share of funded loan volume even during the current market reset. Additionally, within our consumer banking and marketplace segment, we saw revenue grow by over 50% this quarter as opposed to the same period last year and we have seen an increase in the number of banking transactions every quarter since we launched.\n\nOn the title front, we are making progress by migrating customers from traditional Title to our software-enabled Blend Title solution. Notably, we went live with Mr. Cooper and our Blend Title solution this quarter. I want to quickly call out the impairment charge we recognized on Title365 in our results today.\n\nWhile this is a noncash charge, it is clearly a significant number. This business was purchased during a much more robust economic and mortgage refinance environment. In light of current market challenges, we performed an assessment of goodwill and intangible assets within the Title365 reporting unit and have recognized an impairment charge. Title365 has strategic value to Blend and remains a leader in its business.\n\nHaving title on the Blend platform enables us to deliver vertically integrated mortgage and home equity solutions. Title365 is filling that role and accelerating our path to this objective. Overall, our second quarter revenue and metrics represent continued progress against transforming this industry. I want to be clear that I'm very confident in Blend's long-term opportunity as a result of this progress.\n\nThat being said, we know there are many things we can do better as a business, starting with our cost structure. As we said last time, we have undertaken a comprehensive view of our P&L in light of the change in market conditions. Today, we'll share our plans, our targets for cost alignment and what the long-term operating model for the company will look like. The headlines are, first, we are operating the company prudently as if mortgage industry unit volumes will remain at or near historic lows through 2025.\n\nDespite this, we expect to achieve positive free cash flow during that time. Second, along the way, we plan to reduce our non-GAAP net operating loss by 50% from current levels by the end of 2023. And third, we believe we're going to achieve these goals with our current capital base, which includes $475 million in liquidity at quarter end, inclusive of our $25 million undrawn line of credit, while reserving options to manage our capital structure opportunistically going forward. Our plans include specific targeted ranges for gross margin and for the primary components of operating expenses.\n\nI'll let Marc walk through those details shortly. But first, I'd like to give an overview of the key initiatives we're undertaking. Our first and most immediate lever is our cost of labor. Since April, we have eliminated over 400 positions or 25% of our workforce, including the elimination of backfills.\n\nWe should see the full impact of these actions by Q1 2023. In aggregate, both actions are expected to reduce our annualized expenses by approximately $60 million. We will continue to monitor and adjust this cost base as market conditions warrant. We have also significantly limited hiring, focusing on the most important positions for the company.\n\nOur second lever is offshoring. Through our acquisition of Title365, we expanded our geographic reach to India, home to two full-scale operational hubs that currently support our title business. We believe our India operations provide a foundation that can support the entirety of Blend and work is already underway to streamline our corporate support functions and shift work where we historically relied on third-party vendors. Third, we are taking decisive steps to achieve near-term cost efficiencies in non-personnel spending across our products and corporate functions.\n\nThese steps include consolidating third-party vendor spend across tools, services and partnerships, as well as driving down deployment costs and shortening deployment windows through bundling, moves which can drive efficiencies for both Blend and our customers. Our fourth lever and one of the big long-term ones is product prioritization and increased rigor around return on investment. We are prioritizing product lines that we believe can deliver ROI on a relatively short time horizon. We are emphasizing solutions that are high value to our customers and that reflect our assessment of customer needs and demands over the next 12 months.\n\nWe will be disciplined in measuring success and flexible in allocating capital as return potential dictates. While I fully anticipate this initiative will make us more disciplined in our R&D programs, I also want to be clear that we will continue to invest in sustaining and adding value to our key products to ensure we are growing and deepening our customer relationships for the long term. Our goal across all of these cost reduction efforts and investment initiatives is to make Blend stronger for the long term to not only sustain us during this tough period, but well into the market rebound. The benefits of the changes we are making will not arrive in a linear fashion, but we commit to keeping you posted on progress toward the headline goals I shared earlier.\n\nIn addition to our cost structure plan, we are focused on top-line growth. Our growth is inextricably linked to that of our customers, and I think about our growth drivers parallel to the customer journey with Blend as we deploy, deepen and broaden our suite of products. In Q2, we reported gross revenue retention of 99%, roughly in line with 98% in Q1 and market adjusted net revenue retention of 164%, up from 159% in Q1. Additionally, we have a healthy pipeline of customers who have signed but have yet to deploy.\n\nSo there are built-in revenue opportunities that we have good visibility on. Our differentiated mortgage product allows us to win customers in this tight margin environment. One recent example is PNC Bank, one of the largest diversified financial institutions in the U.S., which went live with our mortgage solution in Q2 in under six months from signing and work is underway to launch our close product as well. In addition, because we continue to add value to our platform on a regular basis, we are able to responsibly raise price with our customers.\n\nWe are seeing consistent quarterly uplifts in pricing per transaction. Specifically, we've seen more than half of our renewals in Q2 at higher rates because of the value we continue to add to our platform on a regular basis, which adds value to our customer base. Within our consumer banking and marketplace segment, we grew revenue 53% year over year in Q2 and remain on pace with our plans to double this business in 2022 as compared to 2021. We are seeing customers start with mortgage but stay for our end-to-end platform solution.\n\nAt the end of the second quarter, 71% of customers use multiple Blend solutions, reflecting an increase from 59% in the prior year. Notably, our income verification and close solutions are in high demand, and we're seeing significant growth in our home equity suite as that market heats up. Putting this all together, we are making progress, and we are strengthening Blend for the long term. However, 2022 forecasted mortgage industry volumes have come down materially since we released our initial guidance in March.\n\nDespite that, we've only brought down our Blend platform outlook modestly, reflecting both our outperformance relative to industry declines and the growth we are seeing in our home equity offering. Overall, this guidance change for Blend platform is offset by a like-for-like increase in Title revenue in light of better-than-expected performance on that side due to home equity and default business. Marc will provide more details on our guidance update in a few minutes. To summarize, we remain optimistic in our ability to execute and delivered another solid revenue quarter as we continue to grow market share.\n\nWe plan to continue to optimize our cost structure, streamline our support functions and prioritize products that generate near-term ROI such that we can generate free cash flow under a prolonged market reset. And we are positioning ourselves as a category creator as we continue to drive innovation through our software solution for digital banking. I want to end by saying that at Blend, we're playing to win and we're playing to win big. We are not playing to avoid losing.\n\nThere's a once-in-a-lifetime industry transformation happening right now. Most banking products are still analog and processed in a manual way by humans. They lack a modern software stack that works across the bank to deepen relationships with our customers at a lower cost. We believe the lenders and banks who adopt our technology will come out the other side winners.\n\nThat's our role in the industry as the trusted partner to hundreds of financial institutions across the country. And so, we're going to continue to play to win. Thanks. And now, let me turn it over to Marc.\n\nMarc Greenberg -- Head of Finance\n\nThanks, Nima, and good afternoon, everyone. I'll walk through our financial results and provide context in the following order: First, I'll start with a recap including how we're performing in this mortgage cycle. Second, I'll provide more color on our recent plan and future efforts to reduce our cost structure as part of our broader capital management strategy. And last, I'll provide context around our guidance revision and how we expect to see trends unfolding for the rest of the year.\n\nThen we'll open up for questions. Let's start with the highlights from Q2. Our results reflect continued outperformance in mortgage banking relative to the industry and solid growth in our consumer banking and marketplace offerings, offset by declines in the legacy title business. Total revenues for the quarter were $65.5 million.\n\nBlend platform segment revenue was $33.6 million, notably up about 5% year on year, despite a 37% decline in mortgage originations volume in the same period. Title365 segment revenue was $31.9 million. Shifting to consumer banking and marketplace, we achieved revenue of $8.5 million this quarter, up from $5.6 million or 53% as compared to the prior-year period. Year on year, total consumer banking transactions grew by approximately 138,000 to approximately 215,000 in Q2, supporting, in particular, the increase we observed in our home equity revenue as compared to the prior quarter.\n\nClosing up the revenue discussion, we recognized $1.2 million in professional services revenue. Moving to gross profit. Q2 non-GAAP gross profit was approximately $25.8 million, up from $19.9 million in the prior-year period. Current period non-GAAP gross profit includes $20.6 million attributable to Blend platform and $5.2 million to Title365.\n\nProducts like Blend Income, Blend Close and Blend Title are lower margin than some of our other product lines. And as those products ramp up, but before they get to scale, our aggregate margins will be diluted. We expect our medium-term non-GAAP Blend platform gross margins to be in the low 60% range. Non-GAAP operating expenses for the second quarter totaled $65.3 million compared with $46.2 million in the prior year, which is primarily attributed to increased costs associated with Title365.\n\nKeep in mind, when comparing year over year, that last year's Q2 was our final quarter without many expenses associated with operating as a public company. As you can see in our financial supplement, our non-GAAP loss from operations was $39.5 million versus $26.3 million in the prior year. This quarter, we also recognized approximately $392 million noncash charge to reflect impairment of Title365 goodwill and intangible assets, driven by a decline in the fair value of the Title365 reporting unit. Now turning to our balance sheet.\n\nOur cash, cash equivalents and marketable securities on June 30 totaled $450 million. Our $25 million revolving line of credit remains undrawn. We believe we have ample runway and liquidity in light of the cost reduction efforts we've outlined today, noting that our $225 million term loan does not come due until 2026. Further, as Nima noted, we have additional cost levers to pull depending on the depth and severity of the mortgage banking downturn, and we will be opportunistic when it comes to improving our capital position.\n\nAs Nima highlighted at the top of the call, we're introducing a number of operating improvement initiatives with clear objectives that define our path to positive free cash flow and ultimately, profitability. That plan has started with our two announced workforce reductions. The second, in August, included approximately 220 positions, which when taken together with our actions in April, affected over 400 positions and approximately 25% of our pre-reduction workforce. Layering in the April reduction, these eliminated positions represent annualized compensation expenses of over $60 million.\n\nWhile the majority of the reductions were in Title365 where our needs reduced both due to anticipated lower refi volumes near term and our migration of legacy Title365 customers to Blend Title, we also undertook significant reductions in parts of our general and administrative operations. We expect cost savings associated with the RIFs to materialize starting in Q1 2023. As Nima mentioned, we're also undertaking a transition of business processes and corporate support to India, and that work is already underway. As we expand our capabilities in India, we'll be able to share more detail on future calls.\n\nWhat I can share today, however, is the progress we've been making on reducing our vendor expenses. We are reducing our vendor spend by at least $6 million per quarter in 2023. We are achieving this through the continued maturation of processes and G&A, commercial operations and cloud operations. We are also moving some work in-house and moving it offshore.\n\nWe are reducing the number of vendors we have and simplifying where we can, and we're undertaking more robust negotiations with those we decide to retain. When complete, we believe the steps we're taking will significantly impact our current model as we move toward profitability. As we execute toward profitability in the medium term, this is directionally where we expect costs as a percent of revenue to land. We expect G&A expense to be reduced a further 20% in 2023 with a medium-term operating goal to get G&A to the low teens as a percentage of annual revenue.\n\nWe are also targeting sales and marketing expense to land in the 20s as a percent of revenue in the medium term, though there is a wider range of outcomes here depending on the pace of and opportunity for revenue growth, noting that commission sales fall into this bucket. And, finally, we expect R&D expense to be in the high teens to low 20s on our road to profitability. I want to emphasize what Nima said earlier, and that is, we are operating the company to achieve positive free cash flow under the assumption that mortgage industry unit volumes will remain at or near historic lows through 2025. We are in the early stages of executing on this plan, so the composition within our operating expense lines may shift over time and may not be linear.\n\nI also want to touch on gross margins, especially in challenging and uncertain markets like this, our product offers customers a cost-competitive advantage to in-house development that is best-in-class. As our product matures and we continuously enhance our offering, our incremental value has outpaced the price we charge. In addition to applying discipline and increasing scale to drive our cost to deliver even lower, we are taking steps to ensure our pricing is reflective of the full cycle value we offer to our customers. As Nima mentioned, we've seen more than half of our renewals in Q2 at higher rates.\n\nWe expect this trend to persist. As a result, we're targeting medium-term Blend platform gross margin in the mid-60% range. This may seem below some of the current targets of our software peers. However, our platform gross margin will be determined by shifting mix across our growing product suite.\n\nWe have some very high gross margin products and some that will carry lower margins, like income verification. These products are strategically important and a reliable source of significant incremental gross profit dollars at scale. Of course, cost reduction is only half of the margin equation. As Nima highlighted, we continue to see growth drivers that reinforce market share gains within mortgage, ongoing revenue diversification led by consumer banking and marketplace and the opportunity to responsibly increase prices as we deliver greater value to our customers.\n\nTo summarize, we're taking immediate steps to reduce and manage our personnel spend, we're taking immediate steps to reduce and manage our third-party vendor spend, we are planning further efficiencies through offshoring and we are taking concrete steps to prioritize profitable revenue growth. Nima shared a goal of exiting 2023 with our non-GAAP net operating loss reduced to 50% of current levels. This is how we plan to achieve it. I'll wrap up now with 2022 guidance and our near-term outlook.\n\nIn light of prevailing market conditions, we have adjusted our 2022 revenue guidance for the Blend platform down by $5 million, while raising the 2022 revenue guidance for the Title365 segment up by $5 million. We are affirming our full year guidance range of between $230 million and $250 million in consolidated revenue in 2022 with between $135 million and $145 million in the Blend platform segment. On the Title365 side, we're raising our guidance range of $90 million to $100 million to $95 million to $105 million, largely attributed to the outperformance of our default and home equity products within that segment, which is expected to offset the decline in origination and title volume. While this inflationary environment and market reset presents challenges, we remain focused on things that are within our control.\n\nThis includes meaningfully reducing our cash burn through aligning our operating structure with current market volume, streamlining processes, increasing our operational efficiency across the company and adopting a capital-efficient growth model for the near term. This also means narrowing the scope of our strategic priorities while continuing to grow penetration of our platform in the market. Wrapping up, the first half of 2022 has been a challenging one for the industry, but we remain optimistic about our cost, revenue and growth drivers that are within our control. With that, I'd like to thank you for joining us.\n\nCrystal, we are now ready for questions.\n\nCrystal Sumner\n\nThank you, Marc and Nima, for your remarks. We'll now turn to Q&A. Our first question comes from Matt Stotler from William Blair.\n\nMatt Stotler -- William Blair -- Analyst\n\nThank you for the questions. Maybe just to start with one on the Blend Title transition -- transitioning your Title business over to core Blend platform. You talked about that starting in mid-2022. It seems like that's kind of early in terms of progression, but we're seeing a little bit of outperformance on the Title365 side.\n\nSo just any update on the expected transition to the core Blend Title platform and the updated timeline there?\n\nMarc Greenberg -- Head of Finance\n\nSo the outperformance on the Title365 side is really because they have built in countercyclical offsets, right? They have the default business, as well as the home equity business. So that's where you're seeing the outperformance on the Title365 side. Otherwise, Mr. Cooper transition is going great.\n\nThey've been a wonderful partner for us, and we're ready for the increase in volume in the second half of the year.\n\nCrystal Sumner\n\nNext question comes from Joseph Vafi from Canaccord. Please feel free to unmute yourself, and go ahead. Looks like you might be muted.\n\nJoseph Vafi -- Canaccord Genuity -- Analyst\n\nHello? Can you hear me?\n\nCrystal Sumner\n\nYes, we can.\n\nJoseph Vafi -- Canaccord Genuity -- Analyst\n\nYes Hi. Good afternoon, everyone. Thanks for taking my question. Sorry for the background noise.\n\nI was wondering if you could just give us a little bit more flavor on the demand environment of new logos. We kind of continue to see banks do a lot of digital transformation, but I wanted to get an updated view from you on the pulse on the mortgage side. Thanks a lot.\n\nTimothy Mayopoulos -- President\n\nYeah, sure. Thanks for the question. On the mortgage side, we mentioned one new logo in PNC, but both our mortgage side and the add-ons for mortgage, the pipeline remains strong and specifically, add-ons around close and verification of income. And the reason those remain strong is because efficiency really matters in a time of market margin compression.\n\nAnd so, we're seeing intense focus from our customers around implementing digital technology and implementing more digital technology than they had before. And so, actually, we feel good about our mortgage side, and we'll continue to invest there going forward.\n\nCrystal Sumner\n\nNext question comes from Ryan Tomasello from KBW. Please feel free to unmute, and go ahead.\n\nRyan Tomasello -- KBW -- Analyst\n\nHi, everyone. Thanks for taking the questions. I guess, just digesting all of the operating targets correctly, maybe you can say if there's a consolidated top-line revenue growth target that's associated with these having a net operating loss and breakeven over that 2025 time horizon? Whether or not that's by segment or just on a consolidated basis, I think that would be helpful just for us to understand the bridge between both the opex, as well as the top-line modeling here.\n\nMarc Greenberg -- Head of Finance\n\nYeah, thanks, Ryan. So we're using MBA as our guide for the mortgage volumes. They're frankly more conservative than Fannie. So we've made a transition to the MBA forecast going forward.\n\nBut it's a pretty volatile market out there. So -- but all of our growth metrics are moving in the right direction. We are not going to give specific revenue guidance at this point. We'll just focus on now to the end of the year, and then we'll try and update you as best we can.\n\nCrystal Sumner\n\nNext question comes from Maddie Schrage from KeyBanc. \n\nMaddie Schrage -- KeyBanc Capital Markets -- Analyst\n\nHey, guys, thanks for taking my question. I was wondering if you could talk a bit about how you're thinking about multiyear conditions for the mortgage industry with respect to new mortgages versus refis and what factors you're planning on monitoring to see any signal of a rebound in demand. And then, just a follow-up, what type of visibility do you have in terms of share gains based on your current pipeline? Thanks.\n\nMarc Greenberg -- Head of Finance\n\nYeah, sure. So first of all, it's hard to project forward mortgage volumes beyond 2023. There's good industry MBA forecast, for example, on 2023 and less so 2024 and beyond. So we're kind of -- we're taking a prudent approach to the beyond years and saying it's going to remain flat, which is near all-time lows through that period.\n\nAnd so, we're managing the business as if -- even if it remains flat, we still get to that cash flow positive and profitable measures as a company. Things that we're paying attention to? Obviously, interest rates, what the -- how new home purchases are going. There's been different things happening in the market. And then, ultimately, at the end of the day, we're focusing on -- primarily on the things within our control, which is growing our market share.\n\nSo on your second question on market share, we do spend quite a bit of time looking at how much total volume there is out there and who the best targets are. We mentioned PNC, but there's a number of others that we've also signed in the last few months that have continued to grow our volume base, as well as rolling out customers we sold before that, which is why you're seeing us outperform in the mortgage segment compared to the market. Like we said, it's down 37% year over year and our mortgage segment is nothing, not down even nearly that much. And so, that's one piece.\n\nAnd the other piece in consumer banking more broadly, we continue to win there, whether it's home equity or personal loans or other aspects of the mortgage life cycle that we haven't touched yet, we continue to increase our diversification of revenue, which has been a great way for us to not just expand our revenue base, but expand our TAM and create some countercyclical measures that make us less exposed to interest rates that might negatively impact revenue if things change.\n\nCrystal Sumner\n\n[Operator instructions] Our next question comes from Terry Tillman from Truist. Please feel free to unmute, and go ahead.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah, good afternoon. Thanks for taking my two-part question. The first part of it is maybe for Marc, in terms of mortgage transactions. I think, it was in the first quarter Q, it was $376,000.\n\nCan you share what the actual mortgage transactions were in 2Q? And the second part of my question is for either Marc or Nima is just -- it's good to hear there's a healthy pipeline in terms of new mortgage and consumer banking customers. Have you all tweaked your assumptions because of the macro on the timing of them rolling out or rolling -- or are those -- the rollout schedules, are they remaining resilient? Thank you.\n\nMarc Greenberg -- Head of Finance\n\nSo in terms of mortgage banking transactions, in Page 15 of the supplement, we outlined 348,000 mortgage banking transactions, 215,000 consumer banking transactions. So yes, we went from 380,000 to 348,000 in Q2, and those numbers we do update as we get more information from our customers. And then, the second part of the question -- sorry, Terry, can you give us that second part again?\n\nTerry Tillman -- Truist Securities -- Analyst\n\nThe second part of the question -- sorry, I missed that on Slide 15. Thanks for the reference though. The second part of the question is just related to -- you're talking about a healthy pipeline in terms of one business. What I'm curious about is sometimes what we're hearing is there can be just some slower pace of rollouts because of just macro factors, lack of staffing, etc.\n\nHave you all changed in the last 90 days how you're thinking about these rollout schedules that could impact platform revenue in 3Q and 4Q? Thank you.\n\nNima Ghamsari -- Co-Founder and Head\n\nNot materially. We are -- we've been planning some of these roll outs to our customers for a while. They've staffed up for them. And then, like we said, the pipeline for new business is also healthy, especially around things like home equity and income and close.\n\nAnd so, on both of those fronts, we feel pretty good. And it reflects in our guidance, I think that Marc touched on our guidance and what we changed there, but it reflects on our guidance as well that we're not materially changing the guidance despite the market coming down quite a bit. And just one other thing I'll call out is that when we roll out with customers nowadays versus maybe two years ago, we often roll out with multiple solutions at once. Like, for example, we have a top 20 bank rolling out with our mortgage solution toward the back half of this year and they're going to have multiple solutions when they go live on Day 1.\n\nSo they're going to have our mortgage and income together, which is a little bit of a different situation than maybe what we did before. And that allows us to get them value faster. And also, it's, obviously, good for us and our consumers as well.\n\nCrystal Sumner\n\nNext question comes from Michael Turrin from Wells Fargo. Please feel free to unmute, and go ahead.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nYeah, thanks. Appreciate you taking the question. I mean, you mentioned the industry volume declines. We can see it in just the mortgage banking transactions disclosed, yet you're able to hold on to the combined revenue target for the year here still.\n\nSo just wanted to spend a moment on the offset. So is this a function of having taken a conservative lens around mortgage since the start of the year? Is the growth you're seeing on the consumer banking transaction side providing enough of an offset? What are you seeing that helps you hold on to the outlook here? And anything you can add around just what's assumed for rest of the year and if there's any cushion if the macro were to continue to worsen? I think, it's just very useful context. Thank you.\n\nNima Ghamsari -- Co-Founder and Head\n\nYou bet. Thanks, Michael. So there were some slightly unexpected offsets in the Title365 business in default and home equity being a little bit better than we expected. We've been able to responsibly increase prices across our customer base on renewal in particular.\n\nAnd it's really in line with the value that we're delivering. So that's some offset. We are not -- I wouldn't characterize our guidance as cushion, but I think it's prudent.\n\nCrystal Sumner\n\nNext question comes from Ryan Tomasello from KBW.\n\nRyan Tomasello -- KBW -- Analyst\n\nHi, everyone, thanks for taking the time. I just wanted to drill down into Title365 and the migration there, I guess, following up on earlier questions. Can you talk about the margin uplift you expect when migrating 365 clients to the Blend Title product? Maybe remind us how that product is priced relative to the legacy products. And the gross margin you would expect on Blend Title transaction versus the same revenues coming from legacy Title.\n\nAnd I guess, wrapping that up, just the timeline for fully winding down the legacy Title365 revenues? And what percentage you would expect to ultimately capture on the Blend Title products? Thanks.\n\nNima Ghamsari -- Co-Founder and Head\n\nSure. So we're really in the early days of the transition to software-enabled Title. So there's no change in pricing and we're not really offering any guidance on the eventual margins. We think this builds in -- it's a comprehensive product that makes it better for consumers and better for lenders.\n\nIt's an integrated product that delivers more value, particularly in the instant home equity that we've been talking a lot about with an integrated title solution. So at this point, there's not much more I can say, I don't think, about the margins on the title side. I think, we're in early days here, Ryan.\n\nCrystal Sumner\n\nNext question comes from Matt Stotler from William Blair.\n\nMatt Stotler -- William Blair -- Analyst\n\nI think, in a follow-up, just maybe one on the marketplace opportunity here. Obviously, consumer banking and marketplace is where you're seeing a lot of growth. And you mentioned a couple of components of that on the consumer banking side. Any update on, I guess, the marketplace ecosystem generally? And then, any plans to monetize that going forward?\n\nMarc Greenberg -- Head of Finance\n\nThe marketplace -- I mean, the consumer banking marketplace includes all non-mortgage consumer banking transactions, so personal loans, home equity, credit cards, deposit accounts. So those dollars are in there. It includes things like property and casualty insurance that are coming to scale that we've been at for a couple of years now. And then, going forward, it will eventually likely include the software-enabled title, right? So I mean, the -- there's not -- that has been a great offset, a diversification of our revenue.\n\nIt's countercyclical to the underlying -- many of those are countercyclical to the underlying mortgage transactions. Is that where you're going, Matt?\n\nMatt Stotler -- William Blair -- Analyst\n\nYeah, yeah. In terms of -- I think what I was more focused on is as you think about things like homeowners insurance and things like that, that you're building into the consumer journey and being able to monetize that kind of part of the journey where that fits in. Obviously, there's a number of different places where the marketplace -- or you can establish marketplaces within that journey and you talked to them at length historically. But yes, more on just that component of the broader journey, being able to add those in and monetize those ecosystems as part of the broader consumer journey.\n\nMarc Greenberg -- Head of Finance\n\nYeah, and the ones that are -- the one that's probably being monetized the most today, Matt, is the homeowners insurance, property and casualty insurance. And so, that one is already in our flow, used by a number of our customers. We also have a bunch of partnerships on that front as well, since that's the one that's probably furthest along. Probably next is Title, which like we said, we're migrating over as another marketplace.\n\nI don't have anything on the valuation side quite yet, although we're talking to a number of partners on that -- valuation being whether it's automated or -- automated valuations, AVMs, or appraisals. And then, there's a few other things that we've talked about in the flow that could help for identity and fraud that might be able to help us continue to add value to the -- whether it's the homeowners -- sorry, the home ownership journey or the broader consumer financial journey. So we'll continue to do that opportunistically. I will say, just going back to our -- my commentary around ROI for products.\n\nWe are being very thoughtful about the things that can drive the most value for our customers and consumers in a short time horizon. And so, we're making sure we focus our energy around those kinds of things and make sure we deliver on those things to the end before we go and expand to too many new things, that we can be focused as a company.\n\nCrystal Sumner\n\nNext question comes from Terry Tillman from Truist. Please feel free to unmute.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah, thanks for my follow-up. Marc, it's a question for you. I think, you're all talking about $60 million worth of comp expense coming out of the model through the various actions. I hope I have that right.\n\nIt's kind of a timing question in terms of -- I mean, some of this takes time to flow through the model. But is there any general sense you could give us on how kind of the loss profile could look like 3Q versus 4Q, maybe in relationship to what we saw in 2Q with the $39 million loss? Thank you.\n\nMarc Greenberg -- Head of Finance\n\nYou bet. Thanks, Terry. Yes, it is -- some of those costs were not fully annualized, obviously, and we grew a lot in the second half of 2021. In terms of the net loss, I wouldn't assume a materially different net loss in Q3 and Q4 relative to Q1 and Q2.\n\nRemember, there are some challenges on the revenue side that we're also trying to offset. So on a net-net, costs do come down marginally, but we're also addressing a volume decrease, particularly on refinancing at Title365.\n\nCrystal Sumner\n\nNow we'll be addressing submitted questions from investors from via the Say platform. Our first question is, is Blend Labs adding other financial products to its line of offerings?\n\nNima Ghamsari -- Co-Founder and Head\n\nYeah, this is a good question. It goes back again to our ROI. We are making sure we figure out the products that mean the most to our customers and consumers. And so, we're going to be constantly adding new financial products.\n\nI want to make one side note, which is our investment in Blend Builder, which we've talked about quite a bit. It's our low-code, drag-and-drop platform to make it possible to create these new products with fewer R&D resources, which makes the ROI equation that much more appealing for us to be able to deliver those things. So expect to see some announcements from us in the coming months as we respond to changes in the environment. There are some new products that make a lot of sense given the new market environment and all the vertically integrated capabilities we have.\n\nAnd so, stay tuned on that, we'll come out to market with some things here in the next few months.\n\nCrystal Sumner\n\nAnother question from investors via the Say platform, is Blend Labs -- oh, sorry. How are you managing the current tension between growth and profitability?\n\nNima Ghamsari -- Co-Founder and Head\n\nYeah. And I hope I addressed a little bit of this earlier in my remarks, but I want to explicitly call out that managing profitability as a stand-alone, it's relatively straightforward. Managing growth as a stand-alone is relatively straightforward. It's much easier to do those things in a vacuum.\n\nBut doing it together, figuring out that right harmony between those two things is extremely difficult. And so, that's the hard part. That's the thing that we've been spending a lot of time on, and you've kind of heard a little bit about what we're cutting back on, what product lines we're cutting back on, what internal corporate support we're cutting back on. And so, we're -- you're seeing some of the plans to become more profitable by cutting back on some of those things, and we'll continue to do so, as well as driving those high ROI products for our customers in the short and medium term.\n\nAnd combined, those two things will give us enough fuel to continue to grow while not overly consuming the precious capital that we have, and we want to make sure that we retain for the long term.\n\nCrystal Sumner\n\nAnother question from the Say platform, how would you characterize the competitive environment? And related, what are your perspectives on consolidation in the sector?\n\nNima Ghamsari -- Co-Founder and Head\n\nWell, we certainly pay close attention to our competitors. We are a very paranoid company in the sense that we're constantly looking at what's going on in the market. That being said, I think nothing has materially changed in the competitive environment during the last few quarters. And just to reiterate what some of the competitive environment looks like.\n\nAt the top end of the market, our primary alternative to Blend is -- a primary alternative to Blend is an internal build. At the medium and lower end of the market, it's typically point solutions that we compete against. In both cases, Blend is sort of a premium offering that can work across products, and we'll continue to invest in that to continue to win and grow market share, which we've done historically, and we've shown even in this quarter that we've been able to do. We have seen consolidation, we have seen some consolidation both in terms of our customers merging together, which is ultimately good for Blend as it becomes a more concentrated industry with customers that rely on us across the bank or lender.\n\nAnd we've also seen some point solutions out in the market become part of larger platforms. And I actually expect both of those trends to continue. We'll pay attention. We'll continue to be paranoid and react where necessary accordingly.\n\nBut overall, I will say that materially -- there's nothing that's materially changed in the competitive landscape for us in the last few quarters.\n\nCrystal Sumner\n\nAnd the last question I'll take is also from the Say platform, what has the sales environment been like in this downturn? Are customers pushing off digital transformation initiatives?\n\nNima Ghamsari -- Co-Founder and Head\n\nYeah. And this -- maybe this is a corollary to what Terry from Truist was saying, just are people pushing off these implementations and rollouts or bought -- these new buying opportunities. And I'll say, one, I think a lot of those -- those software companies where the rollouts are getting pushed out or people are getting negotiated down are nice to have platforms in the sense that they feel like the organization can live without a new data warehouse or without a new BI reporting tool. And I'm not specifically calling those out as things that are not important, but I just think if those things slip two or three or four quarters, it doesn't materially affect the revenue of the organization.\n\nWhereas Blend, given where we sit for our customers and how we try to help them modernize acquiring customers and serving their customers, we're not a non-essential solution. We partner very closely with our customers to be that essential solution that helps them deliver better experiences across the bank at a lower cost. And cost is something that they don't want to be spending more money than they need to for a longer period of time. We actually help them lower their costs as opposed to adding to their cost base.\n\nSo we're not a non-essential solution. And so, two, I think to add on to that, I think our customers will continue to invest in the downturn as some of the customers that we have, given where we play in the market, that -- we have often some of the largest lenders and banks in the country as customers -- they take a long-term view of the market. I've been very encouraged by the fact that when I talk to our customers, they are really -- they're on offense. I mean, I said we're playing to win as Blend to be this platform that can be used across all these products to serve these modern banking experiences to consumers through our customers, our customers are taking the same approach.\n\nThey want to play to win. They're not the same in the next cycle, but they're even bigger and better than they were in the last cycle. And lastly, because we are a company that drives ROI for them, we often are somebody that they want to bet on to help get them there. And just one supporting sort of anecdotal data, we track quotas for sales reps and we're beating our quotas in the verification of income and home equity, which are really important business lines for us.\n\nAnd in Q3 so far, we're tracking strongly for those business lines again. And so, we'll continue to invest in those products as long as they can drive that ROI for our customers.\n\nCrystal Sumner\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCrystal Sumner\n\nNima Ghamsari -- Co-Founder and Head\n\nMarc Greenberg -- Head of Finance\n\nMatt Stotler -- William Blair -- Analyst\n\nJoseph Vafi -- Canaccord Genuity -- Analyst\n\nTimothy Mayopoulos -- President\n\nRyan Tomasello -- KBW -- Analyst\n\nMaddie Schrage -- KeyBanc Capital Markets -- Analyst\n\nTerry Tillman -- Truist Securities -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nMore BLND analysis\n\nAll earnings call transcripts"
}