{
  "companyName": "Stitch Fix",
  "companyTicker": "SFIX",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/07/stitch-fix-sfix-q1-2023-earnings-call-transcript/",
  "content": "Stitch Fix (SFIX)\nQ1 2023 Earnings Call\nDec 06, 2022, 5:00 p.m. ET\n\nOperator\n\nHello and thank you for standing by. Welcome to the Stitch Fix first-quarter fiscal 2023 earnings conference call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question-and-answer session.\n\n[Operator instructions] It is now my pleasure to introduce Hayden Blair.\n\nHayden Blair -- Investor Relations and Treasury\n\nGood afternoon and thank you for joining us today to discuss the results for Stitch Fix's first quarter of fiscal year 2023. Joining me on the call today are Elizabeth Spaulding, CEO of Stitch Fix, and Dan Jedda, CFO. We have posted complete first-quarter 2023 financial results in a press release on the Quarterly Results section of our website, investors.stitchfix.com. The link to the webcast of today's conference call can also be found on our site.\n\nWe would like to remind everyone that we will be making forward-looking statements on this call, which involve risks and uncertainties. Actual results could differ materially from those contemplated by our forward-looking statements. Reported results should not be considered as an indication of future performance. Please review our filings with the SEC for a discussion of the factors that could cause the results to differ, in particular, our press release issued and filed today, as well as the Risk Factors sections of our annual report on Form 10-K for our fiscal year 2022 previously filed with the SEC, and the quarterly report on Form 10-Q for our first quarter of fiscal year 2023, which we expect to be filed tomorrow.\n\nAlso, note that the forward-looking statements on this call are based on information available to us as of today's date. We disclaim any obligation to update any forward-looking statements except as required by law. During this call, we will discuss certain non-GAAP financial measures. Reconciliations to the most directly comparable GAAP financial measures are provided in the press release on our Investor Relations website.\n\nThese non-GAAP measures are not intended to be a substitute for our GAAP results. Finally, this call in its entirety is being webcast on our Investor Relations website, and a replay of this call will be available on the website shortly. With that, I will turn the call over to Elizabeth.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nThanks, Hayden. As we stated on last quarter's call, following a transformative year with the rollout of Freestyle, we began fiscal year 2023 with a clear focus on growing our client base and achieving profitability. As the macroeconomic environment continues to be uncertain, we are now further balancing the need to optimize our cost structure against achieving the long-term growth objectives of the business. We are confident in this approach and are determined to use this moment as a catalyst to create a leaner, more nimble, and profitable Stitch Fix while continuing to enhance the experience for our clients.\n\nIn fiscal Q1, the retail industry experienced a meaningful pull forward at the holiday promotional environment, which continues to be more pronounced than expected due to weak consumer sentiment and excess inventories. We believe this resulted in lower client spending and also had a large impact on our net active clients, which declined 11% year over year. Overall, Q1 net revenue declined 22% year over year to 455.6 million, which was at the low end of the range provided on the Q4 call. Despite this, we continue to deliver on operational efficiencies and cost control, which enabled us to beat our provided outlook on adjusted EBITDA at -7.4 million for the first quarter.\n\nDan will provide more details on the quarter in his section. Today, I will discuss our plan for the balance of 2023 and a few key area: first, our focus on profitability and how we plan to further simplify our cost structure to create a more efficient operating model; second, how we continue to strengthen our client experience with an emphasis on our biggest differentiators of discovery, fit, and human relationships; and lastly, how we are evolving our marketing strategy to increase our focus on engaging and reactivating the audiences that already know us. First, on our focus on profitability and a leaner operating model. On the last call, we said that we recognized returning to positive adjusted EBITDA and free cash flow was of the utmost importance.\n\nThis remains our central focus, and the continued uncertain macro environment underscores the value of a leaner, profitable business model that will allow us to adapt quickly in the future. As such, we are increasing our FY '23 cost reduction targets that we announced two quarters ago to 135 million from the 40 million to 60 million previously discussed. While much of the new reductions will come from advertising, which I will discuss more later on, we are also targeting more fixed and variable productivity in a number of areas. We recognize we need to operate the business more efficiently and focus on the areas most critical to move us forward in the current environment.\n\nWe believe we can execute these initiatives while simultaneously enhancing our client experience and without compromising the long-term growth potential our highly differentiated business model presents. To reinforce, our biggest focus is on achieving profitability. That said, we do want to give you an understanding of what we are working on in the background that is foundational to further enhancing our client experience. Our clients do Stitch Fix to find items they would not have otherwise found for themselves, for the tremendous convenience our styling service provides, and for the personalization we deliver in clients' style and fit.\n\nWe are the leaders in providing personalized styling support through our fix model, which, together with Freestyle's on-demand styling features, like Shop Your Looks and Trending For You, drive higher conversion and lower return rates relative to traditional e-commerce retail. Knowing this, there are two specific areas of opportunity we are focused on enhancing to grow and retain our net active client base, making it easier to enter our ecosystem and ensuring our clients feel consistently heard and served in a personalized way to keep them coming back again and again. In terms of entering our ecosystem, we made progress in the first quarter testing a new outreach strategy to a large number of sign-up prospects who have not yet purchased from us, which increased conversion by 30% over last quarter. We are also working on faster sign-up processes and more personalized search-based landing pages to continue to make it easier for clients to get started with Stitch Fix.\n\nIn terms of feeling heard and served in a personalized way to keep clients coming back again and again, we see clear opportunities to improve client retention at critical moments with Fix Preview and Fix Checkout. For example, we know that when clients keep at least one item and are looking forward to their next fix, they are likely to have multiple future fixes. The inverse is also true. If a client buys zero items in their first fix, they're three times as likely to cancel their auto-ship than clients who bought one item.\n\nGiven the criticality of these moments, we are testing multiple new ways for richer interaction and listening both before clients receive their fix, as well as when they share feedback if we haven't hit the mark. One test underway includes stylist experts contacting first-time clients who purchase zero items to get to know our clients better and to proactively suggest replacement items from Freestyle for the client so that we can get it right. We expect this higher level of personal touch and communication will be meaningful in improving client happiness and, ultimately, improve retention. And lastly, we are evolving our marketing strategy to increase our focus on engaging and reactivating the audiences that already know us while continuing to lean into new acquisition channels.\n\nThis is a critical step toward increasing profitability as we will reduce marketing spend in the back half of the year. As a business, we have relied on digital performance-based channels and lower funnel spending on client prospects. While these channels did and still prove to be successful, they are now less efficient than they once were. In addition, we have a pool of over 10 million consumers that have already interacted with us, but have not recently or ever made a purchase that we can more directly target or bring back into our ecosystem.\n\nRecent testing showed the cost per acquisition for reengagement of this pool is significantly less than prospective clients who have never interacted with us. Our experience has continued to evolve, and we want to reach those clients who already know us and help them rediscover their love for Stitch Fix. In addition, we're continuing to expand our underpenetrated marketing channels such as affiliates, influencers, and SEO/SEM, which will take time to develop into meaningful contributors but will be important over time for new customer acquisition. In summary, we remain confident in our unique and differentiated business model and the long-term opportunity ahead of us, and we are adapting to meet the moment in these uncertain times.\n\nBy focusing on these things within our control, we will continue to set ourselves up to achieve adjusted EBITDA and free cash flow positivity in the near term while maximizing our long-term potential. With that, I will turn the call over to Dan.\n\nDan Jedda -- Chief Financial Officer\n\nThank you, Elizabeth, and hello to everyone on the call. Q1 net revenue declined 22% year over year to 455.6 million, which came in at the low end of our guidance due to lower net active clients and a pull forward of holiday-related promotions across the industry. The deep discounting the industry has experienced well in advance of the normal holiday season particularly impacted October Freestyle revenue. Adjusted EBITDA for the quarter came in at -7.4 million, which was above our outlook, largely due to effective cost controls as we continue to drive toward our goal of positive adjusted EBITDA and free cash flow.\n\nNet active clients in the quarter declined 11% year over year to 3.7 million. While this was an improvement from a sequential loss from Q3 to Q4 of last year, net active clients were lower than what we expected at the onset of the quarter. While we are seeing an increase in new active customers, we continue to see a high number of customers delaying spending partially due to the macro environment. Revenue per active client was approximately flat year over year at $525.\n\nHowever, our analysis does show that clients are spending less across a broad set of cohorts, and we expect this to continue given the economic backdrop and the deep discounting we're seeing in the retail industry. Q1 gross margin came in as expected at 42.1%, down 490 basis points year over year, driven primarily by higher product costs, higher clearance, and unfavorable transportation costs year over year. Sequentially, gross margin was up 210 basis points from Q4 due mostly to improved inventory reserves. We continue to believe gross margin will be approximately 42% throughout the rest of FY '23.\n\nAdvertising was 9% of revenue in the quarter. For the remainder of the year, we expect advertising as a percent of revenue to be lower than our historic rate due to the marketing shift Elizabeth discussed. We will be laser-focused on spending advertising dollars where we see near-term positive ROI and will continue to build out new marketing channels. For the remainder of this year, we expect advertising to be approximately 5% to 6% of revenue, so we'll continue to evaluate our advertising spend to ensure we're managing to the right return on investment.\n\nNet inventory grew 20% year over year due to higher receipt volume. We did expect this higher inventory given our long lead times from order placement to receipt of inventory. We aggressively adjusted our buying in Q4 of last year, and we expect inventory to come down sequentially in Q2 and continue to decline in the second half of the year. Free cash flow for the quarter was -16 million, and we ended the quarter with 209 million in cash, cash equivalents, and highly rated securities.\n\nNow, on to our outlook. The challenging economic environment increases uncertainty around the trajectory of net actives and, therefore, revenue as we look forward. We know that high rates of inflation are impacting consumer purchases and high levels of inventory are impacting pricing with deeper discounting across the retail industry. Additionally, we are reducing our advertising spend amid a very promotional holiday season.\n\nIn these times, we are less certain how the revenue story plays out for the rest of the year. And so, our goal continues to be managing our overall costs while continuing to focus on improving our client experience with the goal of becoming adjusted EBITDA and free cash flow positive in the near term. In light of this backdrop, we anticipate revenues to be between 410 million and 420 million for Q2 as we continue to see pressure on net active clients and expect the holiday promotional environment to continue throughout the end of the quarter. We expect adjusted EBITDA for the quarter to be between negative 5 million and positive 5 million, primarily reflecting our ongoing cost structure efforts and a reduced level of advertising spend.\n\nGiven our current visibility around our marketing and retention efforts and balancing the uncertainty in this challenging backdrop, we are lowering our full-year FY '23 revenue guide to between 1.6 billion and 1.7 billion. This is no material change in the current competitive landscape and macro environment from where we are -- where we see it today. Despite this, we are raising our outlook on adjusted EBITDA for the year to be between negative 10 million and positive 10 million, reflecting our reduced advertising levels and ongoing cost management initiatives. Before we turn it over to Q&A, I want to remind everyone that even at current levels, our unit and order economics continue to be strong with contribution profit, excluding advertising, in the range of 25% to 30%.\n\nWe know there is further opportunity to improve both fixed and variable costs, and therefore, we see an opportunity to increase our contribution margin in addition to improving fixed leverage. In the meantime, we will continue to focus on the things we can control, deepening our differentiation, improving our client experience, and rightsizing our overall cost structure, all with a focus on near-term positive adjusted EBITDA and free cash flow. Doing this sets us up to be in a strong position, producing healthy and profitable leverage as the economy improves and for a return to growth. With that, I'll turn the call over to the operator for Q&A.\n\nOperator\n\nThank you. [Operator instructions] And our first question comes from the line of Youssef Squali with Truist.\n\nYoussef Squali -- Truist Securities\n\nGreat. Thank you very much. Hi, guys. So, just a couple questions for me.\n\nOne, on the last earnings call, you guys talked a little bit about some of the new product enhancements, personalization features, efforts that you guys were doing to drive engagement and improve the user experience. You also had a brand campaign that was launched, if I remember correctly, in mid-September. Can you just speak to the performance -- to, one, the efforts you're making, where are you there; second, how the campaign did relative to your own expectations? And then, broadly speaking, how are you kind of positioned for the rest of the year from kind of an inventory standpoint? Where would you like inventory to be at the end of the year? Thank you.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nHey, thanks, Youssef. I can take the first part of that, and then I'll let Dan speak to our inventory position. You know, on the customer experience, I think I alluded to some of this on the call that we're pleased with the progress that we're making on clients entering our user experience. You know, that was an area that we've been focused on over the last several quarters.\n\nAnd we're significantly off our lows in new client conversion, which gives us confidence that we're, you know, doing the right things to create an even more seamless entry into new Stitch Fix customers. And that's starting to pay dividends. You know, we did things like improved our dynamic landing pages depending on where clients were coming from, including some improvements to the style quiz. And we've begun to experiment with what we're really featuring and talking about in terms of how it works in the Stitch Fix experience and sort of the unique differentiators of our styling experience.\n\nAnd we're leaning into further improvements on that as we enter Q2 with things like, you know, delaying our email capture, one-time login, you know, just areas that we're very aware of that create friction. So, pleased with the progress that we're making and continuing to focus on and doing more there. More broadly, within the user experience, I also had mentioned these kind of critical moments of truth within Fix Preview, as well as within the checkout experience. And so, we've made a number of improvements on how we're servicing inventory to our clients.\n\nI mentioned Fix Preview. That one, we're a little bit, you know -- that, as we launched and rolled that out over time, you know, increased our overall AOB and retention as we rolled that out a year or two ago. We now see kind of the next wave of improvements of client listening and learning, and we're eager to dive in there. We like what we're seeing in these very early tests, but, you know, we've yet to scale them and more to come over the coming quarters.\n\nAnd then, kind of related to the -- those landing pages and how we're educating consumers, that's a good bridge into your question on the brand campaign. That was the first time we had done a campaign that was consistent across the U.K. and the U.S. and really focused on an always-on messaging around how it works and really educating consumers on the unique differentiators.\n\nAnd so, the consumer qualitative feedback that we've received from that is strong. We like what we're hearing in terms of consumer appreciation of the value proposition. We also saw some improvements in organic traffic conversion that we think, you know, could be attributed to the -- the relevance of that campaign. It's something that we imagine kind of being layered within how our influencers are talking about Stitch Fix, how we talk at a -- you know, within TV and OTT.\n\nSo, it's something that we anticipate we will build on in the future and is, you know, part of really conveying our unique value proposition. I will let Dan touch on the inventory position question.\n\nDan Jedda -- Chief Financial Officer\n\nOn inventory, as we mentioned in the prior call, we did expect us to increase inventory, and we did expect this quarter the 220 million to be the peak. And we are seeing that decrease throughout November and even through the first week of December. So, the trajectory is right where we expected. We will be lower in Q2.\n\nWe're going to continue to be lower in Q3 and Q4 sequentially because we have rightsized our buying for the second half of the year. So, that inventory will go down, and I suspect it will be negative on a year-on-year basis in the back half of the year.\n\nYoussef Squali -- Truist Securities\n\nThat's helpful. Thank you.\n\nOperator\n\nThank you. And our next question comes from the line of Simeon Siegel with BMO Capital Markets.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nThanks, everyone. Hope you're doing well and had a nice Thanksgiving. I was hoping you could give any color on gross versus net adds, maybe in active clients this quarter. And then, if I heard it correctly, and apologies if I didn't, I was hoping you could elaborate a little bit on the comment about consumers having a choice where to shop, impacting that net adds.\n\nI guess that sounds a little bit more typical for traditional retail. So -- so, I guess you guys had been maybe insulated given the loyal Fix shoppers. So, are you seeing a pivot in the existing base or the customer approach to your company? And if the active client positioning is now competing against traditional retailers, does that change how you focus on running and forecasting the business? Again, if I missed hearing it or misheard, I apologize. Thanks, guys.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nYeah, thanks, Simeon. I can start, and, Dan, feel free to chime in as well. So, on the gross versus net adds, I think Dan touched on that, where, you know, we did see an increase in clients in our gross add quarter on quarter, so Q1 versus Q4. That said, we also saw an increase in clients who haven't shopped with us in 12 months plus.\n\nAnd that is something I think we attribute in part to the macro environment and just the pullback that, overall, I think the category is seeing in retail spending. You know, we believe that a lot of the efforts that we're focused on in terms of retaining clients longer, improving the experience, you know, reactivating clients, some of what I talked about on the marketing front, all will be important in terms of driving improvements over time. The competition with traditional retail, I think what we were referring to there is, you know, quarter on quarter, we did see increases in things like our AOV and our average unit retails. That said, we did see softness in Freestyle relative to what we would have anticipated.\n\nAnd we could see, as we compared it to a lot of the pull forward and the promotional calendars of other players in the space, that we were impacted by some of those promotional offers that happened, you know, August, September, just far earlier than we typically would have seen. And then, I think Dan mentioned the cohort-to-cohort spending. You know, our consumers are telling us that, in this macro environment, that they're just being more judicious with their spending. And so, you know, while our keep rates and our average order values are holding steady, we are seeing some stretching out of frequency and stretching out of those Freestyle purchases.\n\nSo, you know, we still believe we are very unique in our core value proposition. We compete on things like discovery, and fit, and human relationships. That said, I think, you know, freestyle, in particular, is probably more impacted by really -- really promotional environment, which we saw in particular in that August, September, October time frame.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGot it. Thanks. That's very helpful. And then, just let me just follow up on that comment you made about the quarter-over-quarter ASP.\n\nHow was the year-over-year ASP this quarter?\n\nElizabeth Spaulding -- Chief Executive Officer\n\nYeah, I think, quarter over quarter, we saw a few percentage points increase on AOV and, similarly, on an ASP basis, in part -- I think it was over 10% up quarter on quarter. You know, part of that is seasonal. We do see it leaning into outerwear and goods that are slightly higher priced. But overall, I mean, we saw health, I would say, in general within our AOVs and average unit retails.\n\nI think it's more maybe a frequency of spending that we saw more of a pullback.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks so much, guys. Best of luck the rest of the holiday.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nThanks, Simeon.\n\nOperator\n\nThank you. And our next question comes from the line of Mark Altschwager with R.W. Baird.\n\nMark Altschwager -- Robert W. Baird -- Analyst\n\nGood afternoon. Thanks for taking my question. With respect to the shift in marketing strategy, is this a temporary shift amid the current macro? Or what are the proof points that you want to see in the transformation to give you confidence to more aggressively go after the TAM of consumers who haven't engaged with the platform before?\n\nElizabeth Spaulding -- Chief Executive Officer\n\nYeah. Thanks, Mark. You know, I would say it is, in part, a response to the environment but also a really strong belief that really happy clients and reactivating clients are some of our best channels for marketing and believing there's opportunity to further expand those in addition to the areas of TAM expansion into some of these new marketing channels that we've just historically been under-penetrated. One thing I think we were very deliberate about, and I think Dan mentioned this in his remarks, as did I, is just being very focused on near-term positive ROI.\n\nAnd so, I think what we really work through is just being more deliberate and really raising the bar of our payback thresholds, which we're always very disciplined. We just essentially made the decision, given that ambition of free cash flow positivity, EBITDA positivity, and just what we're seeing in the macro backdrop, to be even more disciplined in terms of those payback periods. We're also using it as an opportunity to go even faster at really doubling down on opportunities to reactivate clients that have loved us in the past. That pool and that opportunity has obviously grown over time as we become a more mature business.\n\nAnd so, you know, Dan mentioned the 5% to 6%. That's our best view for the full year. But we'll learn, you know, over the next few quarters. And based on the paybacks we're seeing, you know, we may opt to spend more as we go forward, but it's not a permanent shift.\n\nIt's more let's -- let's learn into this and be even more disciplined on paybacks in the near term.\n\nMark Altschwager -- Robert W. Baird -- Analyst\n\nThank you. And then a follow-up on Freestyle is it makes sense that the heavily promotional backdrop would impact engagement there. So, what are you doing or what can you do to kind of manage your competitive position in such a dynamic price environment?\n\nElizabeth Spaulding -- Chief Executive Officer\n\nYeah, it's a great question. I mean, I think we're very focused on, you know, first of all, just continuing to invest in our biggest differentiators, things like outfitting, things like focusing on new arrivals that are most relevant to each of our clients. You know, part of what we're hearing from consumers is making more value out of the wardrobe that they already have. And we know that, you know, our outfit-based feed showing new arrivals, in the context of outfits, is highly converting.\n\nYou know, one example recently, as you know, we do a new outfits email every week. We added dynamic content that's one-to-one for each consumer that shows them how to wear items from our new arrivals that's bespoke to each client. And we saw a 30% increase in conversion rate on those emails. So, part of our strategy, I think, is just being more relevant and differentiated on the things that make us special and, you know, relevant week to week in moment.\n\nI think the other is, you know, we never really had any sort of, you know, limited-time-offer clearance valve pre-Freestyle. So, over the course of this year, we have been experimenting with episodic events that we feel like meet the moment within the promotional calendar. You know, roughly, I would say around once a quarter. But, you know, our -- our goal is not to become a promotional retailer but to really deliver value on these differentiators of discovery, fit, human relationship, and really focus there first and foremost, while also, you know, recognizing Freestyle creates an opportunity to map more fully to the retail calendar and be relevant with what consumers are seeing.\n\nMark Altschwager -- Robert W. Baird -- Analyst\n\nThank you and happy holidays.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nThanks, Mark.\n\nOperator\n\nThank you. And our next question comes from the line of Edward Yruma with Piper Sandler. \n\nEd Yruma -- Piper Sandler -- Analyst\n\nHey, good evening, guys. Thanks for taking the questions. I guess, first is the bigger picture question and making sure we are framing this correctly. Are you effectively saying that until the environment becomes less promotional, that you're going to kind of trade off net adds for profitability? And are we fair to assume that until that changes, that net adds will remain negative? And then, as a follow-up, as you think about, you know, the promotional environment thing, particularly prolonged, you know, I know that you're obviously not in the percent-off game or coupon game, but are there other ways you can drive a stronger price value relationship if that's what the consumer ends up hitting toward? Thank you.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nYeah, thank you, Ed. On -- on the first point in terms of where we're focused, you know, I think both Dan and I emphasized that that, first and foremost, you know, this return to free cash flow positivity and EBITDA profitability is our main focus. So, we are very much emphasizing that. And I would say, given the current macro environment and then this deliberate and intentional decision to pull back on marketing spend for the focus of being very near-term ROI positive, we're not predicting a return to inflecting that sequential net active client base this year.\n\nThat said, all of the things that we're working on that I talked about in the background, both the client experience to improve retention, adapting our focus on marketing to do more with the clients that already know us, we believe really sets us up for healthy client growth in the future, particularly as the economy improves. So, I would say we're very focused on profitability together with the most critical places on our customer experience. And then, on the promo environment, you know, we have always had our buy five discount within the Fix offering, which we know delivers value to clients. We have our Style Pass offering for customers that have kept over 10 items, where we offer them, essentially, unlimited fixes.\n\nThose are places that we see as a jumping-off point for the expansion of our loyalty program over time. Nothing to announce there yet, but that is on our road map to, you know, deliver value to our customers really across what we now know is such a compelling ecosystem between Fix and Freestyle and, to some extent, an untapped opportunity to really bring all of those elements together in a more systematic program. So, we definitely see something there down the road. Nothing specific to announce just yet in terms of timing.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from the line of David Bellinger with MKM Partners.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nHey, thanks for taking the questions. So, first one on the revenue guidance for the year. So, Q1 fell within your range, albeit toward the lower end. So, did you see trends slow materially toward the end of Q1 and so far into Q2? And have you subsequently adjusted each quarter of the year down further since then? Just how should we think about the change in the pace of which it took shape in terms of the revenue guidance for the year?\n\nDan Jedda -- Chief Financial Officer\n\nYeah, I'll take that one. We did see, as we mentioned, some impact of the deep discounting in the retail industry which impacted our October sales, which was the last month of the quarter. And, you know, on a go-forward basis, how we're looking at the revenue guide is a function of what we saw -- what we saw in the holiday period and the deep discounting and expecting the macro environment to continue as is, but also taking into account some of the marketing initiatives that we've talked early on -- earlier in the call. So, the way -- the way I would think about that guide going forward is it's more of a similar change on a year-on-year basis for the rest of the quarter as it is with Q1, just given that -- the guide that we gave of the negative one point -- the 1.6 billion to 1.7 billion for full-year revenue.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nGot it. And then my follow-up, just -- just bigger picture. If we step back, do you think your inventory position is holding back revenue growth and client growth in some ways? Is there some type of larger inventory issue at play for Stitch Fix? And do you need sort of a reset or refresh in order -- in order to, again, connect with your core customer base?\n\nElizabeth Spaulding -- Chief Executive Officer\n\nI mean, I can start. And, Dan, feel free to chime in. I mean, I think we feel like, over the course of the last year plus, we introduced a really healthy mix of national brands together with our strong exclusive and Stitch Fix-only brands, which the latter make up the majority of our inventory. We -- we onboarded, you know, north of 80 brands in FY '22.\n\nWe've been able to grow our different product categories, with Freestyle in particular, like footwear and outerwear and dresses. And, you know, we have a refresh-rebuy approach to our exclusive brands that makes us reasonably adaptable that we'll keep leaning into. So, I think we actually have a lot of the right product. Now, of course, for true category expansion, getting into the layers of growth we see possible as we really go after expanding our TAM, that, I think, is setting ourselves up as we work toward this fiscal year on some of the client experience.\n\nSome of the other work that we're focused on in the background are things like a unified data platform, which I think I've mentioned some of this on prior call that, you know, our infrastructure was built, you know, very rapidly to scale our Fix business into multiple lines of business like women's, men's, kids in the U.K. It didn't have the foresight to know we'd launched freestyle or the foresight to say, \"Let's get into a lot of different product categories.\" So, we're, essentially, you know, slowing down a bit to speed up in the future by preparing our infrastructure so that we can add on more of these new categories as we get into fiscal year '24. But that all said, you know, we feel like we have the right assortment for our consumer. We're very focused on the combination of what we call our supermom within women's, as well as leaning into a fashionista.\n\nAnd we know we've actually grown the penetration of that fashionista client over the last 12 months.\n\nOperator\n\nThank you. And our next question comes from the line of Ike Boruchow with --\n\nJesse Sobelson -- Wells Fargo Securities -- Analyst\n\nHi, everyone. This is Jesse Sobelson on for Ike. I was just curious, with the Freestyle offering being a little bit challenged with the promotional environment today, do you guys ever plan on evolving the offering to be maybe more in line with general retail business practices and the general, you know, retail landscape with, you know, the counter promotions and such? Thank you.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nHey, Jesse, thanks for the question. Can you just clarify when you say more like traditional [Inaudible]\n\nJesse Sobelson -- Wells Fargo Securities -- Analyst\n\nA lot of traditional retailers typically exhibit promotions on a typical calendar, such as deeper discounts during the holiday period or, you know, summer sales, depending on what it is they're selling. Whereas I kind of understand Freestyle to be a little bit more full priced. So, I was curious if there is any interest in potentially adapting the offering to be more in line with the cadence of some of the apparel distribution industry.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nOK. Got it. Yeah. So, I mentioned this a little bit earlier.\n\nI guess a few things I would offer, you know, first, in terms of some of our highest converting areas within Freestyle, I think we've shared this in the past between, you know, 40% to 50% of our conversions happen in outfit-based shopping, which is a big differentiator. You know, we're helping clients see what items could go with something that they've already purchased, as well as outfit-based shopping based on what we think is trending for them, as well as in any of our product detail pages, being able to see items in the context of algorithmically generated outfits, as well as outfits that have been curated by our stylists. So, those characteristics, one thing that's interesting as we have done, you know, episodic limited-time offers now that we can flex that muscle similar to traditional retail, is that we see a halo effect to full-priced items during those same time periods as people come into the site experience. So, I think we absolutely will continue to experiment and likely lean forward.\n\nYou know, we had our first Black Friday-Cyber Monday event, which we saw, you know, good lift in terms of what we were able to offer our clients in that window. But I think we really want to strike a good balance of being, you know, relevant in those seasonal time periods, but ultimately do what we do best, which is differentiating based on style, discovery, fit. And as I mentioned to one of the prior questions I got on the notion of loyalty, you know, we've always had this Style Pass program, but we see down the road no timeline yet to share here. You know, being able to offer just rewards back to our clients the same way they're rewarded if they buy five items in a fix.\n\nSo, I think rather than trying to just replicate the retail calendar, we would like to be really focused on what's unique to us.\n\nJesse Sobelson -- Wells Fargo Securities -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. And our next question comes from the line of Tom Nikic with Wedbush Securities.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nHey, everybody. Thanks for taking my question. Is it safe to assume the cuts in the revenue guidance is predominantly because of more conservative assumptions around Freestyle? [Inaudible] you know, when the business contract and start growing again, it would be predominantly driven by a recovery in the -- in the Freestyle business? Thanks.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nHey, Tom, you cut out a little here. I think I'll let Dan answer. But just to play back, I think your question was, is the reduced guide largely driven by Freestyle? Is that the question, or can you just clarify?\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nYeah, that's -- that's right. And then, like, would you expect the recovery to be driven by Freestyle as well?\n\nDan Jedda -- Chief Financial Officer\n\nYeah, I can take that. It wasn't driven entirely by Freestyle. We talked a little bit about the reduction in advertising -- talked a lot about the reduction in advertising. Certainly, that's some of the reduction in revenue that we guided to.\n\nWe also -- part of that is just the net actives and where we are today. And so, while I do think Freestyle will -- as the economy improves, Freestyle will improve, and that will help with growth. Certainly, fixes is critical and important to our business as well. And Elizabeth talked earlier about a variety of areas that we're focusing on to drive reengagement, engagement in clients who have filled out their style profile but never purchase with us, etc.\n\nSo, that is also going to be the catalyst to grow going forward. And of course, the macro environment, as we talked about, will be a catalyst when that doesn't prove as well.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nThanks very much and happy holidays.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nThanks, Tom.\n\nOperator\n\nThank you. And our next question comes from the line of Kunal Madhukar with UBS.\n\nKunal Madhukar -- UBS -- Analyst\n\nHi. Thanks for taking my question. A few if I could. One is on the inventory side.\n\nSo, I go back to Q3 '22 earnings call that, you know, you talked about the supply chain and the improvements that you had made. And I'm literally reading from the transcript. One of the big benefits of our business, we can make adjustments pretty rapidly, especially given the nature of how many goods we are actually in control of directly. And I compare that to, you know, what you said earlier in this call today is the inventory was higher because of long lead time.\n\nSo, can you help us understand, you know, exactly what's happening with the inventory? Are you in control of the supply chain? Are you not? Can you rapidly flex up and down? Well, you know, that -- that's -- that'll be the first.\n\nDan Jedda -- Chief Financial Officer\n\nSo, let me -- let me just explain. First of all, from order placement to receipt of inventory for a lot of our product, especially, of course, our exclusive brand product, which is made to order, is, you know, about a six-month lead time. So, you know, there are other areas, specifically within national brands and other areas, that we can flex up or down in. But we have a fairly sizable exclusive product, and those are pretty long lead times.\n\nActually, they're probably even longer than six months. So, what I was referring to in why our inventory was -- is higher now is because we had placed those orders when we had a different demand trajectory six to nine months ago. We have since adjusted, which is why we expect inventory to go down in Q2 and then continue to go down throughout the rest of the fiscal year. That said, you know, where there are pockets of opportunity, we absolutely can chase into that demand depending on where it is, and we do that fairly well.\n\nBut we do have these slightly longer lead times for exclusive and our -- well, our exclusive product.\n\nKunal Madhukar -- UBS -- Analyst\n\nGot it. Thanks. So, second one would be, you know, you guided to 5% to 6% of -- so, more advertising cost of, like, 5% to 6%. That is significantly below anything that you did pre-COVID.\n\nAnd you were extremely disciplined even then. But what that means is, this quarter, your advertising spend was down 19% year over year when sales were down 22% year over year. For the rest of the year, you're guiding to sales being down 20% in each of the following quarters, but the advertising spend will be down about 50% in each of the quarters. So, what gives us the confidence that, you know, sales should not be even lower than -- than the guide rate now?\n\nElizabeth Spaulding -- Chief Executive Officer\n\nYeah. You know, I can -- I can start on that. And, Dan, feel free to add on. I mean, first of all, I think, you know, we've always been very disciplined about how we manage our marketing spend.\n\nAnd I think we both touched on that to some extent on the call. We are opting to be even more rigorous in the time period of payback than we typically are, just in the spirit of the macro backdrop, this uncertain time, and really ensuring that we have very near-term ROI on our marketing spend. You know, a certain portion of our revenue, to be clear, comes from subsequent sales of existing clients that we're marketing to through channels like CRM and engaging them to come back in. But it's not as much of the result of our paid spend.\n\nSo, our growth rate is in part due by new customer acquisitions, but it's also in part based on the installed base of our customers that are on auto-ship and subsequent sales. So, I don't think you should expect to see a perfectly one-to-one correlation with that downshift in marketing spend relative to our -- our revenue rate. I'd say, overall, in terms of, you know, is that a permanent shift or not, I think we got that question earlier. We are going to measure, as we always do, day to day, week to week, and make adjustments accordingly.\n\nAnd some of the new areas that we've been leaning into that are under-penetrated for Stitch Fix, SEO/SEM, influencer affiliate, as we start to see goodness there, we will begin to scale those. Of course, that number may change over time. But I say, you know, net net, the delta between those two rates is that part of the growth rate as an installed base and part of the growth rate is new customer acquisition.\n\nKunal Madhukar -- UBS -- Analyst\n\nGot it. Thanks. And one last one if I could. And this is with regard to, you know, the comment around, you know, keep rate and AOV applied, but we see stretching frequencies.\n\nSo, is that -- can you give us a sense of, like, how the frequency is stretching? And could that stretch into, you know, once every six months or once every 12 months in order to further push, you know, the fixes into maybe next year kind of thing?\n\nElizabeth Spaulding -- Chief Executive Officer\n\nYeah, I can start on that. You know, our clients aren't all university -- universally, like, every three months. You know, we have a mix of cohorts, some of which who get fixes every six weeks, some of which are every three months, some of which are, you know, biannual. It's more of that.\n\nAnd then, a certain amount of our clients are what we call manual. You know, they're episodically ordering fixes, and they, you know, tend to occur at a certain frequency. You know, I'd say a few things are probably driving that stretching out. One is, you know, a little bit of stretching across all of those cohorts.\n\nSo, it's not like everyone's going from three to six. Somebody might have been six weeks and maybe they're skipping a shipment and then going back to that six-week cadence. It also, you know, as we've slowed down the new add cohorts, they tend to have some of the higher frequencies, and so some of the stretching is also a result of the mix shift of our client base in terms of the cohort age. But, you know, I think our goal is really, overall, on just continuing to be meeting the moment for our clients, you know, helping their dollars go further with things like what I was describing with outfits, you know, being incredibly effective of how we're listening, and, you know, frankly, just having the right assortment.\n\nOne thing we've seen is that, you know, we have sort of a sweet spot of where we've seen very strong velocity with price points, you know, under $100 blazers, sort of contemporary apparel, and women's at $150 price point. So, just really making sure we're meeting them with what they're looking for regardless if they're extending a little bit or at the same frequency that they've been with us over time.\n\nKunal Madhukar -- UBS -- Analyst\n\nGot it. Thank you so much.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nThanks, Kunal.\n\nOperator\n\nThank you. And our next question comes from the line of Trevor Young with Barclays.\n\nTrevor Young -- Barclays -- Analyst\n\nGreat. Thanks. Just, first, on the increase in the cost reduction target to 135. Do you expect to realize all of that in '23 since most of that is advertising? And then, within that, how much is really advertising and durable versus just more kind of near-term pulling back given the current environment?\n\nElizabeth Spaulding -- Chief Executive Officer\n\nYeah. Thanks, Trevor. I can start, but I definitely would love Dan to chime in here. You know, as we said in prior quarters, we had that 40 million to 60 million.\n\nWe shared that. We were tracking to that and likely to go beyond it. Now, this increase to 135, you know, a meaningful chunk of that is, in fact, advertising dollars together with fixed and variable productivity. In terms of when we will see it realized, Dan, do you want to just share more on that?\n\nDan Jedda -- Chief Financial Officer\n\nYeah. That will be realized in our fiscal year. That's how we -- that's why we're recording it the way we do because a lot of it is advertising. And when you model out that 5% to 6% of revenue, you'll see that.\n\nAnd then, of course, the remainder is a combination of fixed and variable efficiencies and leverage, which on the -- to answer your second part, on a go-forward basis, as we mentioned on the advertising, that will -- you know, we'll look at that very closely. We look at the ROI on that. We'll spend into where we have near-term positive ROI, and we're not -- we're going to pull back where we don't. And so, we'll manage that very closely for the rest of the year and, of course, into our fiscal '24.\n\nAnd then, all of the -- on the variable and fixed, obviously, that is indefinite. And we'll continue going forward as we see those efficiencies and take advantage of them.\n\nTrevor Young -- Barclays -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThank you. And our next question comes from the line of Dana Telsey with Telsey Advisory Group.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood afternoon, everyone. As you -- as you're talking about the customers delaying spending, is there any particular cohort that you're seeing it from, more or less? And then, can you talk about product trends in terms of what you saw and in terms of pricing, both on Freestyle and what you're seeing requested in fixes? And lastly, with the advertising spend moving from 9% this year to 5% to 6%, what made 5% to 6% the right number? And what are you looking for to see if you need to increase advertising given what the revenue impact may be? Thank you.\n\nDan Jedda -- Chief Financial Officer\n\nYeah. I'll start with that, and I'll ask -- Elizabeth can take the second part of that question. When we look -- it's a good question on the cohorts. And we looked at this in many different ways across our cohorts.\n\nAnd we -- I mentioned in my prepared remarks, we didn't see a broad spending reduction across all our cohorts. So, clearly, the macro environment is impacting spend, whether it's a client who has, you know, in 50-plus fixes or a client in their first 15 fixes. And regardless of tenure, we looked at it every which way. And while we had seen increasing spend quarter on quarter in these cohorts for, you know, many quarters back and even a couple of quarters back, we saw an increase, we clearly saw the spending go down across the broad set of cohorts in this latest fiscal quarter.\n\nAnd we do expect that to continue, just given the high inflationary environment, the competitive landscape, and the overall macroeconomic factors.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nAnd, Dana, I can touch on the trends question and the marketing question. So, maybe I'll start with some of what we saw in the quarter and some of the trends we're seeing. And then, we're about to release our style forecast. Our annual style forecast will come out next week.\n\nSo, I can give a preview to some of what we're hearing there from our 3.7 million clients, from our stylists, from consumer surveys and industry data, which are sort of our -- some of our predictions for the coming calendar year. But in terms of what we saw this quarter, I would say, in particular for women's back to work, clients are shifting into work wear over more of that casual end use that we saw a year ago. So, structured blazers was an area where we saw particular growth. A real sweet spot in the sub-$100 blazer price point, those were up north of 120% year on year.\n\nWe also saw a shift to dressier outerwear with a variety of kind of wool shacket styles and silhouettes. We also saw strength within booties and heels against last year, up over 25% year on year, so, clearly, a female consumer who was going out again, night out and workwear styles that can transition into the evening. We also saw with men some similar, I would say, trends in terms of going back to work. Very strong velocity within our workwear segment and with outerwear seeing strength in things like shirt jackets.\n\nAnd then, kids have stayed more casual, I would say, with graphics and cozy attire. Within our forecast, some of the things that we're seeing now and coming forward is, you know, a real focus on getting back to holiday parties and holiday trends. Brighter and bolder colors is something we're expecting in the future, and then a tendency toward wide-leg bottoms, which started several seasons ago. But we're beginning to really see that shift occur in a more meaningful way.\n\nAnd then, on the marketing spend, the 5% to 6%, you know, I would say it was kind of a combination assessment of, you know, really being very focused on our free cash flow and EBITDA ambition for the year and really holding ourselves to this very strong threshold of the time frame of payback, together with the belief that there's opportunity for us to be doing more in areas that I mentioned on the prepared remarks, like reactivation of clients who have not shopped with us as recently and being more productive going after those segments, as well as that group of clients we often call our sign-up prospects. And so, together, you know, that was our -- our estimate of what we could do to still create momentum with -- with clients but be able to really be more efficient in the back half of the year.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from the line of Mark Mahaney with Evercore ISI.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nWell, thanks. I think most of my questions have been answered, so I'll just ask one. Just on free cash flow and the ability to sustain positive free cash flow going forwards, outside of the macro recovery, what would be the key factors that will cause that to happen or not to happen? Like, what are the -- what are the variables that you can most control outside of macro that will allow you to sustain positive free cash flow, you know, over the next several years? Thank you.\n\nDan Jedda -- Chief Financial Officer\n\nYeah, I can take that. You know, I mentioned that toward the end of the prepared remarks, just our overall contribution margin, which is very healthy at 25% to 30%, ex marketing. And so, really, it is that inflection on -- on revenue of course getting -- you know, growing again at some point. We do feel like our order and unit economics are very strong.\n\nWe are rightsizing our cost structure. We do have a lot of opportunity for variable productivity. All these workstreams are in process and part of the cost savings initiative, $135 million that we stated on the call. So, you know, we feel good about the second half in terms of -- and obviously, our EBITDA guide -- our adjusted EBITDA guide shows that we feel good about the second half.\n\nAnd going forward, you know, we do think there's leverage on top of that. So, it's a combination of continuing on these areas that we're -- that we've embarked upon to streamline our cost structure. And of course, we will, you know, we need to get the revenue growing again at some point, whether that's through category expansion and/or all the initiatives that we're working on right now, inclusive of the new marketing -- the new advertising models that we've talked about.\n\nElizabeth Spaulding -- Chief Executive Officer\n\nMark, I would just -- I think that that really sums it up in terms of where we see that long-term return to free cash flow. I guess a couple of other things I would add, on the gross margin side of things, you know, the majority of our goods are exclusive brands, Stitch Fix only, and those have very meaningful gross margin kind of delta between those and national brands and have just continued to be a strength for us. You know, there's a several-hundred-basis-point difference. We're just continuing to make sure that we're investing in the right brands, the right price points that we're building exclusively for our clients.\n\nAnd then, you know, I think that marketing piece that we're making the shift on, you know, we really do believe that we can get stronger over time with a combination of these newer channels we're less penetrated in but also doing more with keeping our clients happier longer. You know, better conversion, better retention, better reactivation, that should drive more productivity in the P&L as well.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nThank you, Dan. Thank you, Elizabeth.\n\nOperator\n\nThank you. And our next question comes from the line of Aneesha Sherman with Bernstein.\n\nAneesha Sherman -- Bernstein Investment Research and Management -- Analyst\n\nHi. Thank you. My question is around inventory. So, Elizabeth, you talked about national brands being slightly lower margin.\n\nI'm curious if you're seeing more interest from vendors, particularly national brands, as they try to clear their own inventories this quarter and, you know, probably going into next quarter as well. And is there an opportunity there in terms of gross margin from a better buying environment that you may be seeing right now? And then, a follow-up also on inventory. You mentioned the six-month lead time is your typical lead time. So, I guess I would assume that the goods that you have now are spring-summer '23 goods.\n\nWhat -- how do you think about the risk of sell-through for that product, especially if you see macro continuing to be weak into the next quarter or two? Thanks.\n\nDan Jedda -- Chief Financial Officer\n\nYeah, I can -- I can take that question. No, we're not -- we're not seeing that. And it's not something we've considered in terms of national brands. Of course, we've been selective on bringing in the right national brands that we think our customers are going to love that do well within Fix or within Freestyle.\n\nBut we haven't seen anything change beyond that in terms of being approached for national brands to offload inventory. And really with our focus on exclusive brands and our Stitch Fix-only brands, which is not only higher margin, but it's what our clients love, we just feel there's an opportunity to continue to invest in those areas. With respect to the question on -- on inventory, you know, we talked a little bit about summer-spring in Q4. We took -- we took some inventory reserves to account for that.\n\nWe feel that we're in a very good spot in terms of what we've reserved for. And we've also -- as Elizabeth mentioned, we also have different avenues to -- to focus on overstock inventory, mainly limited-time offers and/or clearance events, whether they're, you know, at the end of the season, which we often do to help us clear out some of the inventory -- excess inventory that we do have. So, while we do have a high inventory, we watch it pretty closely. I'm not concerned about the health of the inventory at this point.\n\nAgain, we looked at this in our Q4 and took the appropriate level of reserves and have since clearanced a lot of that inventory out. Very focused on fall-winter right now, which we're just getting going into that season. And so, we're watching how that -- how that does. And again, as we expect inventory to come down sequentially over the next three quarters, we feel we're in a good spot going forward.\n\nAneesha Sherman -- Bernstein Investment Research and Management -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. And our final question comes from the line of Lamont Williams with Stifel.\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nHi. Thank you for taking the question. I'm just -- and pardon me if this is already answered, but on the Freestyle penetration, I believe you've talked about that being pretty consistent around 30% for women. Is that still the case today?\n\nElizabeth Spaulding -- Chief Executive Officer\n\nHey, Lamont. Thanks for the question. Yeah, I think, overall, we look at it across our base. But yeah, it's kind of in that 25% range and it's stayed pretty steady, I would say, in terms of new client adoption and holding steady there.\n\nYou know, we do have things on the horizon that we'll be launching in the back half of the year, like SMS, encouraging more app downloads. Those things, we believe -- you know, we still believe there's opportunity for that to get higher, but it stayed pretty stable, I would say, over the last several quarters.\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. And that does conclude today's conference call. Ladies and gentlemen, thank you for participating. And you may now disconnect.\n\nDuration: 0 minutes\n\nHayden Blair -- Investor Relations and Treasury\n\nElizabeth Spaulding -- Chief Executive Officer\n\nDan Jedda -- Chief Financial Officer\n\nYoussef Squali -- Truist Securities\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nMark Altschwager -- Robert W. Baird -- Analyst\n\nEd Yruma -- Piper Sandler -- Analyst\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nJesse Sobelson -- Wells Fargo Securities -- Analyst\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nKunal Madhukar -- UBS -- Analyst\n\nTrevor Young -- Barclays -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nAneesha Sherman -- Bernstein Investment Research and Management -- Analyst\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nMore SFIX analysis\n\nAll earnings call transcripts"
}