{
  "companyName": "Poshmark, Inc.",
  "companyTicker": "POSH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/poshmark-inc-posh-q2-2022-earnings-call-transcript/",
  "content": "Poshmark, Inc. (POSH)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:45 p.m. ET\n\nOperator\n\nGood day, and welcome to the Poshmark second quarter 2022 earnings conference call. Please note, today's conference is being recorded. All lines have been placed on mute to prevent any background noise. After the speakers' remarks, there will be a question-and-answer session.\n\n[Operator instructions] Once again, please limit questions to one. Thank you. At this time, I will turn the conference over to Christine Chen, head of investor relations for Poshmark.\n\nChristine Chen -- Head of Investor Relations\n\nWelcome to Poshmark's second quarter 2022 conference call. Joining me today are Manish Chandra, our founder, chairman, and CEO; and Rodrigo Brumana, chief financial officer. Please keep in mind that our remarks today include forward-looking statements such as statements related to our financial guidance and key drivers, the impact of COVID-19 on our communities' business and strategy, the potential benefits of our marketing and product initiatives, and the anticipated return on our investments and their ability to drive growth. Our actual results may differ materially than those expressed or implied in our forward-looking statements.\n\nForward-looking statements involve substantial risks and uncertainties, which are described in today's earnings release and our filings with the SEC, including our most recent annual report on Form 10-K and subsequent filings. Any forward-looking statements we make on this call are based on our beliefs and assumptions as of today, and we don't have any obligation to update them. Also, during the call, we'll present GAAP and non-GAAP financial measures. A reconciliation of non-GAAP to GAAP measures is included in today's earnings release, which you can find on our IR website, along with a replay of this call.\n\nAnd with that, I'll turn it over to Manish.\n\nManish Chandra -- Founder, Chairman, and Chief Executive Officer\n\nThanks, Christine. Hello, and welcome, everyone. Thank you for joining us for our second quarter 2022 earnings call. Before we discuss our second quarter results, I want to take a step back to reflect on our mission.\n\nWhen we started Poshmark in 2011, we focused on making selling a superpower by making, selling and buying fashion simple, social and fun by building the world's largest network of shoppable closets and creating a new, more human way to shop online. Our social marketplace is designed to serve everyone, whether you're looking to make money, save money, experiment with new styles, or discover new people and brands. We built every aspect of Poshmark to make selling so easy that anyone with a closet and a smartphone could do it. By empowering everyone to sell fashion directly from their closets, we're transforming shopping online.\n\nThis has driven our growth for more than a decade. The unique dynamic of Poshmark is that over time, sellers become buyers and buyers become sellers. And by the fifth year, there is over 40% overlap between buyers and sellers. Our community of highly engaged and loyal users is our competitive advantage.\n\nAnd by serving and supporting them, we drove profitability even as we cut down marketing in the first half of 2020. As we mentioned on our last earnings call, we're focused on making Poshmark the No. 1 destination for sellers by empowering them with the tools and support to grow their businesses and making our marketplace the most trusted destination for buyers. Now let's discuss our second quarter results.\n\nWe're pleased to report that our second quarter performance exceeded our initial expectations due to our strong focus on execution. We reported a strong quarter despite a tough consumer environment, growing revenues 9% to $89.1 million, beating our expectations for the quarter. Second quarter GMV grew 8% to $483.5 million, while on a two-year basis, GMV grew by 34% and revenues grew by 33%. Our growth is driven by Poshmark's approach to making buying and selling fashion simple, fun, and sustainable.\n\nOur users continue to choose Poshmark as a top destination for selling items from their closets and shopping the closets of others. This, combined with our boutique sellers, continues to make Poshmark or top destination for fashion, as demonstrated by 14% TTM active buyer growth to a record 8 million in the second quarter. We continue to evolve our marketing strategy to navigate the impact of Apple privacy changes and a volatile macro environment. We're drawing attention to Poshmark as a sustainable fashion destination, particularly for style and value-conscious shoppers who are feeling more constrained due to inflation, and as a place to make money from your closet.\n\nOur April marketing campaign focused on Earth month and storytelling, highlighting secondhand styles and vintage trends. This resonated particularly well with our Gen Z and Millennial customers who are shopping vintage and secondhand for eco-friendly purposes and nostalgia. During the second quarter, shoppers came to Poshmark for their fashion needs and to discover the latest trends while saving money. Our marketplace continues to reflect the lives' interest in changing needs of consumers.\n\nDuring the second quarter, luggage and travel bags were up 50% Y-o-Y as shoppers embrace vacation and business travel again. As people return to work, shoppers are turning to resale in their hunt for formal workwear to make their budget stretch further. During the second quarter, blazers and suit jackets grew 61%, and sales of ties were up 45% year over year. The evolution of business casual into business comfort is driving a huge spike in sales for comfort sneaker brands like On Running and Hoka.\n\nWhile orders for Birkenstock sandals and flip flops were up 30% Y-o-Y during the quarter. Zara flare jeans and Abercrombie straight leg jeans were up 97% and 64% Y-o-Y in May, demonstrating that we continue to be part of the seismic shift in fashion as silhouette changes to elastic waist, relaxed fits, and flared bottoms. The power of Poshmark's community makes selling and shopping simple. Social interactions, combined with our marketplace platform, which provide all the tools a seller needs, make selling and shopping simple and fun.\n\nSellers and shoppers and their engagement with our marketplace drove 70% year-over-year growth in social interactions to a record $57.5 billion during TTM Q2 '22. Social interactions range from duration to likes, comments, or offers on the platform. This social engagement drives community connection and ultimately conversion as more than 80% of all purchases are preceded by a social interaction, such as a like, comment, or offer. Poshmark's social experience and inclusive community is a key differentiator as experienced sellers who are often Posh ambassadors voluntarily reach out to help new sellers and provide mentorship.\n\nPoshmark sellers continue to not only share their own inventory but curate inventory from the closets of other sellers. After two years of lockdowns and virtual events, we have been overjoyed to return to in-person community events, which are an important part of helping our sellers grow their businesses. This important growth activation engine introduces the Poshmark community to new sellers, fosters loyalty and connection at the micro-community level, and grows our highly engaged user base. These events create one-of-a-kind opportunity for our community to come together to socialize and share success stories and advice on how to build their businesses on Poshmark.\n\nWe held 87 of these events in the second quarter, up from 35 in the first quarter, attracting community members from across the U.S. We're excited to host PoshFest, our fashion and entrepreneurship conference and the biggest event of the year at the end of September. This two-day event focuses on educating attendees about merchandising, business planning, branding, and data to help sellers grow their businesses on Poshmark. As our first PoshFest back in person in three years, our community is ecstatic to once again have the opportunity to connect with one another and gain valuable expertise to increase their sales and have an immersive Posh experience.\n\nLooking at the second half of the year, we continue to focus on growing our core fashion categories by continuing our product innovation to enhance both the seller and buyer experience. Fashion-related categories, apparel, shoes, packs, and accessories, which is the core of Poshmark, drives more than 90% of our GMV, and we remain focused on strengthening this core in 2022 to increase our wallet share gains with consumers and drive market share gains and GMV growth. Higher contribution from premium-priced product continues to be one of the factors that drove year-over-year AOV growth during the second quarter of 2022. We remain committed to growing our market share in premium-priced products and have started testing various applications of the technology from our Suede One acquisition to drive innovation in our current authentication processes.\n\nWe intend to expand our authentication services to price points below 500 by the end of the year. We have a very seller-centric marketplace, and seller success and liquidity is where everything starts at Poshmark. Thus, we remain focused on product innovation to give sellers better ways to market, merchandise, and sell their listings and new ways for buyers to discover trends and engage with our marketplace to drive conversion. We continue to deliver innovative and easy-to-use solutions that contribute to the long-term growth of our sellers by helping sellers of all sizes easily manage their Poshmark closets and connect with customers in new ways to drive sales.\n\nIn May, we updated My Shoppers, our CRM that we launched in October 2021, which enables sellers to communicate with shoppers who have engaged with their closets and make offers to group of potential buyers. We continue to make these powerful tools available to all our sellers with the focus on making selling simple and accessible to everyone from a seller with a few items in their closet to large resellers with thousands of items. This new version has seen higher adoption by sellers and resulted in an increase in seller offers. In June, we introduced Closet QR codes, making it easy to scan, share view and engage with sellers' closets with a quick scan of your phone, which will be particularly useful with the return of in-person events, making it simple for sellers to market their closet to buyers and increase their number of followers.\n\nPersonal Closet QR codes can be used as an identifier on sellers' social media accounts printed on flyer and business cards are included in the packages they ship to buyers. We continue to be excited by the opportunity for brand closets to contribute to the growth of our core fashion categories. Though still small, Brand Closets GMV during the second quarter of 2022 grew 1.5x compared to the first quarter of 2022. We continue to have a strong pipeline of interested brands and retailers.\n\nDuring the second quarter, we launched our integration with ChannelAdvisor, another milestone in making it easy for high-volume sellers to sell at Poshmark, providing them with the ability to integrate our marketplace to synchronize product, inventory, and order information with other e-commerce platforms. As a style destination where shoppers come to discover, follow and shop, product innovation enables us to drive the treasure hunt for fashion. We continue to innovate our Shop by Trends feature and introduced Trend Guidelines in April. This feature allows sellers and buyers to see more details about trending products down to color, brand, and keywords.\n\nIt provides sellers with more ways to strengthen their trend-related listings and drive conversion. At the end of June, we added a new buyer protection banner to help drive trust and confidence with the new buyers. Poshmark offers an amazing protection policy to all buyers, but not all buyers know about this policy, which includes refunding orders that do not match the listing description. Initial tests of this new feature have shown an increase in buy-now orders, first-time buyers, new use orders, and new user GMV.\n\nLooking beyond the core, we view international expansion as a strategic long-term growth opportunity. In May, we celebrated Poshmark Canada's three-year anniversary. Over the last three years, we have built and grown a community of over 4 million users across all provinces and territories in Canada. These secondhand lovers and entrepreneurial sellers have listed close to $1 billion worth of inventory on Poshmark.\n\nOver 2.6 billion total social interactions have been made on Poshmark Canada since launch. And our Canadian community has attended over 100 virtual and in-person events. During the second quarter, we rolled out Adyen as a new payment service provider in Canada, which enabled us to process payments locally in Canada instead of cross-border to the U.S., which saves in card network, cross-border costs. For the second half of 2022, the majority of our international investment continues to be focused on driving growth through advertising, community development and shipping innovation to grow our seller base.\n\nIn conclusion, our focus remains becoming the world's leading social marketplace and the No. 1 destination for sellers around the world. We're focused on what we can control and continue to innovate for the future, so our sellers can succeed. By tapping into our sellers' entrepreneurial spirit, we are positioning ourselves to emerge from any potential economic downturn stronger than ever.\n\nWe empower millions of sellers to easily turn their closets into shops and connect with customers, resulting in a flexible frictionless marketplace that's ready to meet the ever-changing needs of shoppers. We help Poshmark sellers control their destiny through good and challenging economic times by providing them a reliable and supportive lifeline to help them pay their bills, build emergency funds cover college costs, and go after their dreams. Our competitive advantage is a loyal community of fashion lovers who believe in our new way of shopping, one that is simple, social, fun, and sustainable. Now I'd like to turn it over to Rodrigo to dive deeper into the financials.\n\nRodrigo Brumana -- Chief Financial Officer\n\nThank you, Manish. As we mentioned on our last call, we overcame tough comps in April and had a strong start to the quarter. In the latter half of the quarter, we experienced anticipated seasonality as consumers shifted their attention from cleaning out closets to preparing for spring and summer vacations, which was more pronounced in June. Despite this seasonality, headwinds for inflation, and a slowdown in consumer spending, we still beat our revenue guidance range of $86 million to $88 million.\n\nIn Q2 2022, GMV grew 8% to $483.5 million, up from $449.6 million in the second quarter of 2021 or 34% growth on a two-year basis despite a tough comparison. Net revenues grew 9% to $89.1 million, up from $81.6 million in the second quarter of 2021 or 33% growth on a two-year basis. This result was ahead of our guidance of $86 million to $88 million, driven in part by a better-than-expected take rate and a 14% growth in trailing 12-month active buyers to a record 8 million, up from 7 million in the second quarter of 2021. On a two-year basis, trailing 12-month active buyers grew 32%, thanks to our continued marketing investments in product innovation.\n\nOur take rate in the second quarter was 18.4%, up slightly from 18.2% from last year, ahead of our expectations for flat year over year due to a better-than-expected cancellation rate. That more than offset the pressure from continued mix shift toward orders greater than $15. Mix shift continues to be a take rate headwind as orders less than $15 have a higher take rate due to the flat fee of $2.95. Cost of revenues of $15 million in the second quarter was 16.8% of revenues, an increase of 17% from the second quarter of 2021.\n\nAdjusted gross margin was 83.2% of revenues in the second quarter, down from 84.4% from the second quarter of 2021 due to higher hosting costs and the lapping of a nonrecurring credit in transaction payment processing fees, which was a 40-basis-point benefit during the second quarter of 2021. Marketing expenses, excluding stock-based compensation, or SBC, of $42.6 million in the second quarter was 47.8% of revenues, up from 38.6% in the second quarter of 2021. This result is in line with our guidance of high 40s. Market increased 35% from $31.5 million in the second quarter of 2021 due to higher CPU, more in-person events, and community building initiatives, though CPUs have improved slightly from their peak in January.\n\nWe remain supportive of our continued investment in marketing to introduce more users to our social experience, which promotes a strong cohort retention and loyalty over time. Moving to other operating expenses, ops and support, excluding SBC, of $14.6 million in the second quarter was 16.4% of revenues, which is up from 14.9% in the second quarter of 2021 and is slightly better than expected due to lower cancellation rates and a slowdown in hiring in certain areas. R&D excluding SBC of $12.8 million in the second quarter was 14.3% of revenues, up from 11.5% of revenues in the second quarter of 2021. This was due to planned increasing hiring as we have previously discussed, as we continue to invest additional resources across a number of strategic initiatives.\n\nR&D was slightly better than expected due to delays in vendor spending and a slowdown in hiring base. G&A excluding SBC of $14 million in the second quarter was 15.7% of revenues, up from 11.4% in the second quarter of 2021, primarily due to the ongoing costs of being a public company. Stock-based compensation was $12.1 million in the second quarter, up from $8.1 million in the second quarter of 2021. Adjusted EBITDA, which excludes SBC, was negative $9.8 million, down from $6.5 million in the second quarter of 2021.\n\nAdjusted EBITDA margins were negative 11% compared to an 8% margin in the second quarter of 2021. Compared to last year, the decrease in profitability was primarily driven by investments in marketing, R&D, and G&A. However, it's important to note that these numbers were at the midpoint of our guidance of negative $9 million to $11 million. We will continue to focus on balancing marketing efficiency and investing for future growth.\n\nOperating loss, excluding SBC, was negative $10.8 million in the second quarter with operating margins of negative 12.2%. That compares to $5.7 million with margins of 7% in the second quarter of 2021. Net loss to common shareholders was negative $22.9 million in the second quarter compared to negative $2.5 million in the second quarter of 2021. Cash and cash equivalents were $581.2 million at the end of the second quarter or about $7.41 in cash per share.\n\nMoving to the cash flow statement for the six months ended in June 30, 2022. Free cash flow was negative $3.5 million compared to $25 million for the six months ended June 30, 2021. We are focused on driving growth and continue to optimize our investments in product innovation and marketing to drive GMV growth for the future. We remain confident that our asset-light and high gross margin business model positions us to grow market share.\n\nWe help our community get more value for their money while meeting their wardrobe needs as they attend more in-person events and travel. And we are a relied-upon destination for consumers who want to supplement their income by unlocking the value in their closets. However, the current macro environment and the unpredictability of consumer spending behavior in the face of inflation leads us to be cautious in our outlook for the third quarter. We also continue to navigate changes in the digital advertising landscape and expect IDFA to maintain pressure on CPU rates in the second half of 2022.\n\nGiven the macro environment that could impact our top line, we have begun evaluating our cost structure in the third quarter and expect to begin rationalizing our spending, which is reflected in our outlook. Now on to guidance. Looking to the third quarter, we saw typical seasonality return in July as consumers focused on summer vacations. We remain cautious that inflation may continue to pressure consumer spending.\n\nAs such, we expect third quarter revenues of $85 million to $87 million, resulting in a growth of 7% to 9%. On a two-year basis, growth is expected to be 24% to 27%. We expect our third quarter take rate to be slightly higher year over year due to lower cancellation rates. We are focused on driving growth while managing our cost structure and expect negative adjusted EBITDA of $9 million to $11 million in the third quarter as we continue to invest in R&D to drive product innovation, G&A to build the infrastructure necessary to evolve as a publicly traded company and marketing to grow our community of users.\n\nWe expect adjusted gross margin to be down slightly from Q2 2022 due to higher hosting costs and as we lap 120 basis points of a nonrecurring credit in transaction payment processing fees during the third quarter of 2021. Ops and support, excluding SBC, in the third quarter is expected to be 18% of revenues as we continue to invest in customer support and authentication services. R&D excluding SBC in the third quarter is expected to be 16% of revenues as we continue to increase our investment in product innovation to give sellers better ways to market, merchandise and sale their listings in new ways for buyers to discover trends and engaging in our marketplace to drive the conversion. G&A, excluding SBC, in the third quarter is expected to be 19% of revenues due to the higher cost of being a public company and as we build out finance, accounting, and legal teams.\n\nWe continue to expect marketing, excluding SBC, as a percentage of revenues to be in the high 40s in the third quarter, in fourth quarter as we invest in our brand, diversify our marketing channels, and address higher costs in digital advertising. We have proved that our platform is sticky. Our cohorts delivered net positive GMV dollar retention over time. With high gross margins and a strong balance sheet, we have the ability and conviction to continue to invest in marketing to accelerate GMV growth for the future.\n\nIn the near term, these investments will enable us to build our community of sellers and grow active buyers, which will put us in a stronger position in the long run. In closing, consistent to what we have shared in our last earnings call, while we expect that macroeconomic factors could continue to impact consumer behavior in 2022, we are focused on our core business and execution. This includes, first, continuing to enhance our product experience to help our sellers grow their businesses; second, continuing to build our brand with the global consumer; and third, investing in marketing, talent, and robust operating mechanisms to improve execution and optimize long-term growth. I'd like to leave you with two final thoughts.\n\nFirst, we have started the year putting more focus on our core business and improving our execution mechanisms. As we plan for the second half, we have identified ways to deliver more with less. And during the third quarter, we have begun the focus on cost savings where appropriate, as we previously mentioned. We will continue to explore these cost savings opportunities through the second half of 2022.\n\nSecond, I'd like to remind you of the strength, uniqueness, and the stability of our business. Unlike some of our peers that have seen recent transaction volume retracting to pre-pandemic levels, our business remains strong, growing, and we continue to add users to our sticky platform. We are not seeing big swings or volatility in users and GMV as some of the pure e-commerce peers are seeing. We believe our stability stems from a social aspect of our business that continues to attract and retain users, buyers, and sellers, which in turn drives high engagement and stickiness of our cohorts.\n\nThat fact, coupled with our asset-light model and a strong balance sheet, reaffirms our conviction to continue to invest in product innovation and marketing because our business model is resilient for the current environment and well positioned to benefit from secular trends in resale, sustainable commerce and consumers looking for value and unique looks. Thank you. And I will now turn the call over to the operator so we can take your questions.\n\nOperator\n\n[Operator instructions] We'll pause for just a moment to compile the Q&A roster. Your first question comes from the line of Lauren Schenk with Morgan Stanley.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nGreat. Thank you. I guess the 70% increase in engagement year over year is obviously an encouraging number. I guess what can you do to better convert that engagement to GMV? Or what levers do you think are potentially the most powerful? And then just one quick follow-up.\n\nJust in terms of the macro backdrop assumed in the third quarter guide, are you sort of assuming a stable macro backdrop relative to 2Q or perhaps slightly worse? Thanks.\n\nManish Chandra -- Founder, Chairman, and Chief Executive Officer\n\nI'll take the first question, Lauren. This is Manish. In terms of the conversion pieces, some of the core investments we are making on better search, better feed are sort of the core pieces to convert this engagement but also better tools. So some of the work we are doing with My Shoppers lead sellers to be able to engage with these shoppers and convert them and activate them into final buyers.\n\nSo that sort of -- the key piece is better search, better feed, and ultimately more empowering seller tools that they can use to connect with their shoppers directly. Let me have Rodrigo give a little bit of color on that quarter.\n\nRodrigo Brumana -- Chief Financial Officer\n\nYeah. Look, the question about macroenvironment, whether that we saw getting worse or not, let me kind of step back and give you the thoughts on the Q3 guidance here. So you see a GMV deceleration from Q3 as it relates to future. And number one is because we have seen a seasonal year-over-year growth deceleration from Q2 into Q3 over the past three years, that started in 2019.\n\nNumber two, June GMV growth slowed down from May, and we saw a typical seasonality returning in July as consumers focused on summer vacations. Number three, we remain cautious that inflation may continue to pressure consumer spending. And number four, we also continue to navigate changes in the digital advertising landscape as we expect IDFA to maintain pressure on our revenue growth rates for the third and the fourth quarter, like I said on the call. And finally, when providing guidance, as usual, we are more conservative than historical performance given the current macroeconomic environment and circumstances.\n\nAnd while our business offers great value proposition for the fashion we believe the consumers are buying fashion as life returns to normalcy. But we are mindful that macroeconomic challenges faced by the community can affect the community, and we have a conservative view in our outlook.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour next question comes from the line of Alexandra Steiger with Goldman Sachs.\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nThanks for taking my question. Maybe one follow-up on your macro commentary here. Can you maybe share like what you're seeing across the different markets and geos you're operating in over the past few weeks and months in terms of like how your customers but also your sellers engaging with the platform? And then maybe second, just on your pro sellers, I was wondering if you can give us an update on your push to grow your pro seller base and what type of tools and services you're focused on to improve that selling experiences for pro sellers. Thank you.\n\nManish Chandra -- Founder, Chairman, and Chief Executive Officer\n\nSure. So, what we're seeing in the United States is -- and then in Canada, as well as sort of a return back to, I would say, the comps are closer to 2019 pre-COVID. So, we're seeing seasonality and inventory mix shift more to pre-pandemic levels. And we've shared a little bit of that color in the commentary.\n\nPeople are buying more back-to-school clothes. People are buying more luggage for travel. So, what we feel is that the world is slowly but surely returning back to normal. And fashion cycles are generally caused for sort of more turns of your closet.\n\nSo that's sort of a high-level picture that we are seeing. But inflation and other things make us cautious as we look into the future. When we think a little bit about how do we grow our gross sellers a lot of the investment we are doing is in scaling and connection. So, if you think of Poshmark as a social selling platform, a lot of ways our sellers sell is by curation and connection.\n\nSo, we've invested in our bulk sharing tools to make it very easy to share. We also continue to invest in our CRM, our customer relationship tool called My Shoppers, which allows one-on-one connection between the seller but at scale. And we've added and enhanced these tools by adding prepackaged list of customers, giving them easier way to connect with more people at the same time and allowing them to also create some programmatic rules that they can use to program into these tools. And finally, we continue to look at new ways in which sellers can reach their shoppers and continue to innovate on that front, again, making that connection process that merchandising cost is both faster but also very efficient.\n\nAnd overall, I think the tools have been received very well. The last piece I would emphasize is that the world is getting back to physical. So, we have also invested in our physical connections back with our sellers. We've started to host not just smaller events but larger events.\n\nWe had one of our larger Posh party lives a couple of weeks back in L.A. This is the first large-scale event since the pandemic started actually really since 2019. And we have another one coming up in New York next week. And we're extending key pieces of -- key members of our team to kind of be part of that, and we're seeing a lot of our professional sellers and larger sellers come to these events.\n\nAnd then lastly, our main conference called PoshFest is also going to be in person this year in Houston toward the end of this quarter. So very excited about all of those formats to also help our pro seller community.\n\nRodrigo Brumana -- Chief Financial Officer\n\nActually, I'll just add one thing since the question was also related to macro. The same way that Manish is emphasizing the back to normalcy and that was addressing the seasonality in June and July, we also see a stronger start of August, which means back to school and people ending their vacation is also reflecting in our initial numbers as we kind of look through the quarter.\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nYour next question comes from the line of Oliver Chen with Cowen.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi. Regarding the trends that you're seeing in July, I would love to hear if there's continued volatility and how inflation is interplaying there and also on marketing efficiency trends.\n\nRodrigo Brumana -- Chief Financial Officer\n\nYeah. Look let's talk about the inflation here. First, higher food prices -- higher food and gas prices could be a negative impact on apparel spend overall. However, an inflationary environment could benefit our marketplace, particularly for the more price-sensitive consumer as they search for value.\n\nAnd on the seller side, we offer consumers an easy and empowering way to monetize their closets and make extra cash, potentially offset the next tank of gas. So we help Poshmark sellers control their own destiny in tough economic times and as always. So -- but we have also a pretty big portfolio here. So it's hard to specifically identify the impact of inflation in terms of whether our assortment is increasing the prices or seeing the price increases because also over time, we see the increase in the average order value as customers look for premium priced products.\n\nSo it's hard to dissect the impact and, call it, specifically. But you see trends in higher EUV impacting our platform and then you continue to see buyers and sellers kind of looking to Poshmark. So that's one. In terms of marketing efficiency, like I said, we remain cautious just because the IDFA was a step change to the entire industry, not specifically to us here at Poshmark.\n\nSo we'll take through at least Q4 to kind of fully lap it. But there is a positive sign stemming from when we see CPUs right now compared to the January peak. It shows that we have been starting to kind of circumvent some of the headwinds, not fully. And there was always a question whether we are ever going to come back to the prior levels from IDFA.\n\nBut we are seeing improvements on the marketing efficiency as we try different channels such as TV, creator content. And also, as Manish said, we're also diverting some of the marketing spend to support the in-person events such as the PoshFest. And we think that there is a lot of value on the community to see each other back again in person. We always measure the activity before and after, and there is always higher user engagement, more sales that come out of it.\n\nSo from a marketing efficiency standpoint, we are all improving slightly, but to improve year over time.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you. And best regards.\n\nOperator\n\nYour next question comes from the line of Trevor Young with Barclays.\n\nTrevor Young -- Barclays -- Analyst\n\nGreat. Thanks. Rodrigo, back to your commentary about the incremental investment and balancing that versus trying to find cost savings. Is some of that savings just funding some of these new investments? Or should we expect that to flow through to EBITDA at some point maybe in the next year? And then bigger picture, given where you stand with cash on hand, how important is it for you to get back to positive EBITDA sometime next year versus leaning in on spend as maybe some peers are pulling back?\n\nRodrigo Brumana -- Chief Financial Officer\n\nYeah. Look, in terms of the EBITDA -- so first, in terms of the cost structure, as we look at savings here and there, right now, we are using that to do two things: to continue our path and investing in marketing, especially because we are running the business from the long run standpoint. And we continue to support the market investments as long as our lifetime value continues to be very, very positive and which is the issue that we had with the increasing marketing as a percentage of revenue was essentially on the tax side the cost of acquisition increased because of the IDFA. But our cohorts continue to behave well.\n\nThey continue to return the net positive GMV dollar retention over time. So with that, we are balanced on containing, let's say, the decrease in profitability but also committed to continue to invest in marketing. And like I said, we are committed to the high 40s at least through the end of the year as we guided marketing Q3 and Q4. Remind me your second part of your question.\n\nTrevor Young -- Barclays -- Analyst\n\nJust overall, given where you stand with cash on hand, how important is it to you to get back to positive EBITDA maybe sometime next year versus continuing to lean to not spend, like you said, on marketing and other areas?\n\nRodrigo Brumana -- Chief Financial Officer\n\nYeah. Let's not talk about next year, but let's talk about long term. We are committed to run this business toward profitability. There is no question about it.\n\nBut we are also an emerging company, and we see a tremendous opportunity in the market to acquire users because we know our platform is sticky. We know that when users come they transact, they engage. We saw 57 billion social interactions there. So we want to bring the users here because we know that long term, we will return on that investment.\n\nSo, look, we proved that we can be profitable. A couple of quarters ago we show that more than half of our spend is variable. We can be profitable at any point right now. We can count on the power of our balance sheet, and we can continue to see the positive metrics from the market acquisition.\n\nSo, we think that at this moment, building this company for the long run is more important. And then we know that we can count with our balance sheet in any case, and we know that we can be profitable at any time you want.\n\nTrevor Young -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Ralph Schackart with William Blair.\n\nRalph Schackart -- William Blair -- Analyst\n\nGood afternoon. thanks for taking the question. First, just on retention, I know it's something that you've talked about historically is a growing focus. Maybe just sort of an update where you are in that process? How are those efforts been trending? And how are you thinking about this opportunity? And then I have a follow-up.\n\nRodrigo Brumana -- Chief Financial Officer\n\nOK. So we're talking about retention. We don't talk specifically on the quarter in terms of what is happening in the quarter. So we don't disclose cohort performance on a quarter basis on a full year basis.\n\nBut that said, this is the unique thing about Posh. Once we acquire a cohort, it delivers that consistent net positive GMV dollar retention. And we continue to see that as we reported the full year. So we will be reporting the full year in a couple of quarters, and we expect that to continue.\n\nOur cohorts continue to remain stable. And we see a strong engagement from our users, which is another evidence when we see the 70% growth in social interactions to a record of 57 billion interactions there. So we continue to see it. That's why we are continuing to invest in marketing because the lifetime value from our users is still a return on what we invest there.\n\nRalph Schackart -- William Blair -- Analyst\n\nGreat. And you kind of referenced the large buyer base on the call. Obviously, 8 million TTM active buyers is a large base. Maybe talk about the opportunity to reengage this customer base, more specifically to grow wallet share with them, especially given the diversity of products and categories that you offer.\n\nThanks.\n\nRodrigo Brumana -- Chief Financial Officer\n\nYeah. Actually, even stepping back a little bit, if you look at, we have 80 million -- more than 80 million registered users in a couple of million active users -- so in the 8 million active buyers that we talked about. So the way we think about it is we target the inactive users as well. And we believe that the cost to reactivate the user or to retain a user is cheaper than acquiring a new user.\n\nAs I said, we still consider ourselves as an emerging company, but now we are also starting to divert some of the marketing spend from new user acquisition to retention. And there are three areas that we kind of use for this reactivation. Number one is promotions. We have incentives and giveaways for both buyers and sellers.\n\nNumber two is awareness. We have broad-based campaigns through TV, celebrities, and influencers that generate traffic and engagement for new and existing users. That's interesting because the awareness they actually go for both for new user acquisition, but we see pretty good in terms of retention. Finally is search.\n\nWe have remarketing campaigns through Google Shopping, SEO, and paid search there.\n\nRalph Schackart -- William Blair -- Analyst\n\nGreat. Thanks, Rodrigo.\n\nOperator\n\nYour next question comes from the line of Rick Patel with Raymond James.\n\nRick Patel -- Raymond James -- Analyst\n\nThank you. Good afternoon and thanks for taking the question. My question is on the outlook for EBITDA. Your new guidance for the third quarter implies roughly the same amount of loss in the second quarter despite the revenue growth being a touch lower at the midpoint.\n\nI guess as we think beyond the third quarter, and I know you're not guiding the fourth quarter specifically, but I'm hoping we can have color on the right way to think about things because your comparisons do get a bit tougher but you're also getting more aggressive with cost control. So should we expect EBITDA pressure to be relatively contained as you exit the year? Or is it reasonable to expect a different outcome?\n\nRodrigo Brumana -- Chief Financial Officer\n\nWell, like you said, you're not guiding beyond Q3. But let me kind of share how to think about it. In Q3, we have just begun our spend rationalization. And as mentioned on the call, the Q3 guidance reflects those cost savings that we are contemplating, but those are not impacting the fourth quarter given it takes time to implement.\n\nBut given the macroeconomic environment, we are taking the cautious lenses on the revenue guidance, and that flows through the EBITDA. So, like you say, with a slightly lower guidance on the revenue that kind of flows through. Again, we are not guiding Q4, but high level, it's not a bad idea just to stick to similar levels as Q3. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Ashley Helgans with Jefferies.\n\nAshley Helgans -- Jefferies -- Analyst\n\nHey, thanks for taking our question. We were curious what you're seeing on the seller side. I'm wondering if you're seeing more people come to the platform as they look the ways to monetize their closet given the weaker macro backdrop. And then also, any update you can give us on the India market.\n\nThanks.\n\nManish Chandra -- Founder, Chairman, and Chief Executive Officer\n\nSure. Yeah. The seller engagement is definitely higher as we've gone into Q3. We're starting to see the sellers starting to come back.\n\nI think it's driven by two things. Certainly, the inflation and people's desire to make money. But I think it is also -- when you think about what people are facing is that they actually have to rotate their closets. They have to sort of start to refresh that wardrobe.\n\nAnd in so many ways, people are realizing that when they are thinking about the various dimensions of how they engage with fashion, the answer comes back to their closet. And so in many ways, I think we're excited because we believe the future of fashion is in your closet. And that's super exciting to think about both on a seller and a shopper perspective. Going back to India, I think we continue to see very good engagement numbers in India.\n\nBoth India and Australia, I think as the pandemic has receded, we're able to engage more with the community and start to expect that community developing. I think it's going to still take a little bit of time to get the revenue development fully happening, but the community development is starting to happen, and some of the core underlying engagement befits we see are very encouraging in both of those markets.\n\nAshley Helgans -- Jefferies -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nYour next question comes from the line of Anna Andreeva with Needham and Company.\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nGreat. Thanks so much. A couple of questions from us. You guys mentioned a couple of times taking a look at the expense structure.\n\nCan you talk about what specific buckets of opportunity that could entail? And then secondly, just a question on take rate. Looking out longer term, what do you think is the right level there? Do you guys expect that mix shift to above $15 purchase to continue to be a factor? Or are there initiatives in the business to help offset that? Thank you so much.\n\nManish Chandra -- Founder, Chairman, and Chief Executive Officer\n\nLet me just make a comment, and I'll turn it over to Rodrigo to give more color. The mantra that we're using is quite simple internally. And it's to do less with more impact. And it's really all about prioritization, choosing fewer projects that have higher impact focusing on the core is the approach we are taking to how we are not just thinking about cost but where investments can be the most effective in the business.\n\nWith that, let me turn it over.\n\nRodrigo Brumana -- Chief Financial Officer\n\nYeah. With fewer things with higher impact and we have slowed down hiring. We are looking, being very judicious about contractor spend. There are things that are important, but they may not be prudent.\n\nAnd then over here, the organization is actually helping quite a lot in making sure that we are spending on the highest priority. We want to do fewer and more impactful claims. And your question on the take rate, we do expect the secular trend that we have seen in our business of consumers moving to more premium-priced products might continue. The other thing is, even though we cannot specifically call out but the impact of inflation, even if you do nothing, the value of your closet will increase.\n\nAnd the value of a new pair of jeans if you buy new will go higher, which means at some point, the market and the sellers react. So, I'm going to say, over time, you should expect a slight pressure on take rate just because of we should expect to see more orders higher than $15 as opposed to lower than $15. And as a reminder, below $15, we have the $2.95 flat fee. That's why the shift to orders higher than $15 will continue to be a slightly pressure to our take rate over time.\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nVery helpful. Thank you so much.\n\nOperator\n\nThank you. [Operator instructions] Please limit questions to one. Your next question comes from the line of Tom Nikic with Wedbush Securities.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nHi. Good afternoon, guys. Thanks for taking my question. Rodrigo, just at a high level, what needs to happen to get this business profitable again? And I know you say that you can do it.\n\nYou can be profitable again, anytime you want. But like what is the scenario where like you would be willing to manage the company to profitability again? Is it when the revenue base or the user base grows to a certain level? Is it dependent on the leverage of the marketing expense? And just trying to wrap my head around how the company becomes profitable again.\n\nRodrigo Brumana -- Chief Financial Officer\n\nYeah. Well, as your question was high level, I'm going to give you a high-level answer, which is our focus on the core, focus on growing our user base, which translates to a higher seller base, which translates to a higher buyer base. When you do that at scale, that's kind of how we are going to get the best back to profitability. Obviously, we could anticipate it, we could influence that sooner.\n\nIt depends on -- again, the large majority of our investment is variable. But it comes back to the focus on the core that we started this year and the mantra that Manish was talking about fewer things with higher impact. And number three, like I said before, some of the investments we're making in infrastructure systems, procedures and operating mechanisms should drive a higher execution.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Nick Jones with JMP Securities.\n\nNick Jones -- JMP Securities -- Analyst\n\nGreat. Thanks for taking the questions. I guess just one on the expanding authentication below $500 by year-end. I mean how low will you take authentication? And I guess what are the puts and takes as to kind of the incremental cost to what the value of the product is? If it's a handbag that's extremely used, does it still need to be authenticated? I guess can you just expand a little bit on moving below that $500 price point? Thanks.\n\nManish Chandra -- Founder, Chairman, and Chief Executive Officer\n\nThe strategy we want to take is to really empower the buyers and sellers to participate in it. And we haven't ruled out the possibility of maybe pricing it slightly but -- for lower price points. So that's the strategy we are looking at. We'll have more to talk about.\n\nBut ultimately, we feel that it is something that both buyers and sellers will feel empowered as we launched it so that they can use it based on their needs and not just sort of what we provide today, which is at $500 and higher, it's a free authentication. And the technology that we acquired with Suede One allows us to have that leverage over time. So that's sort of the high-level thinking. But details will be fine-tuned as we get to the go-to-market strategy there.\n\nOperator\n\nYour next question comes from the line of David Bellinger with MKM Partners.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nHey, thanks for taking my questions. Two quick ones. Just first, following up on the cost controls. Are those aimed more at, call it, longer-term initiatives that might not be significant revenue generators today? Or can we expect to see some type of slower near-term revenue in GMV just given these expense pullbacks and the related follow-through? And then secondly, just any comments you can make on the traction you're seeing in some of the newer categories like pet and electronics now that those have been on the platform for some time? Thank you.\n\nRodrigo Brumana -- Chief Financial Officer\n\nOK. Look, the cost rationalization that we're doing right now, it should not impact revenue because we are focusing on things that can be deprioritized. And if there is an impact, the impact should be the minimum. And then that has been baked in our Q3 revenue guidance.\n\nSo again, we are being very judicious here. And we can do that because, again, most of our spend is variable. And number two, we have access to a very strong balance sheet. So we can be very thoughtful about how and when we review our cost structure.\n\nAnd again, we're in the first innings. And Manish, why don't you take that?\n\nManish Chandra -- Founder, Chairman, and Chief Executive Officer\n\nOn the pets and electronics, we're super encouraged by the contribution. Both are still new, launched just last year. And just as a reminder, our noncore categories represent only 7% of our GMV, but they continue to grow faster than our core fashion categories in the business.\n\nOperator\n\nAt this time, there are no further questions. I'll turn the call over to management for closing remarks.\n\nManish Chandra -- Founder, Chairman, and Chief Executive Officer\n\nThank you, everyone, for joining us, and we'll see you next quarter. Have a wonderful rest of the summer.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChristine Chen -- Head of Investor Relations\n\nManish Chandra -- Founder, Chairman, and Chief Executive Officer\n\nRodrigo Brumana -- Chief Financial Officer\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nAlexandra Steiger -- Goldman Sachs -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nTrevor Young -- Barclays -- Analyst\n\nRalph Schackart -- William Blair -- Analyst\n\nRick Patel -- Raymond James -- Analyst\n\nAshley Helgans -- Jefferies -- Analyst\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nNick Jones -- JMP Securities -- Analyst\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nMore POSH analysis\n\nAll earnings call transcripts"
}