{
  "companyName": "Westport Fuel Systems Inc.",
  "companyTicker": "WPRT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/westport-fuel-systems-inc-wprt-q2-2022-earnings-ca/",
  "content": "Westport Fuel Systems Inc. (WPRT 0.65%)\nQ2 2022 Earnings Call\nAug 09, 2022, 10:00 a.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the Westport Fuel Systems second quarter 2022 results conference call. As a reminder all participants are in listen-only mode and the conference is being recorded.\n\n[Operator instructions]. I would now like to turn the conference over to Ashley Nuell, senior director of investor relations. Please go ahead.\n\nAshley Nuell -- Senior Director of Investor Relations\n\nGood morning, everyone. Welcome to Westport Fuel Systems second quarter 2022 conference call, which is being held to coincide with the press release containing Westport Fuel Systems financial results that was distributed yesterday. On today's call, speaking on behalf of Westport Fuel Systems is chief executive officer, David Johnson; and chief financial officer, Richard Orazietti. Attendance on this call is open to the public, but questions will be restricted to the investment community.\n\nYou are reminded that certain statements made in this conference call and our responses to various questions may constitute forward-looking statements within the meaning of the US and applicable Canadian securities laws, and as such, forward-looking statements are made based on our current expectations and involve certain risks and uncertainties. With that I'll turn the call over to you, David.\n\nDavid Johnson -- Chief Executive Officer\n\nThanks, Ashley. Good morning, everyone. I'm pleased to be with you today to discuss our second quarter. Once again, our team delivered strong top line results as we continue to execute against our strategy and made a very challenging macro environment.\n\nToday, I'll be walking through our HPDI growth story, including the regulatory environment and total custom ownership analysis, which demonstrates that HPDI is the most affordable way and the most available way to reduce CO2 and meet CO2 standards. I'll also discuss our LPG business to both our light-duty OEM and independent aftermarket channels, where we're seeing improvements because of the increased price advantage of LPG compared to petrol. Finally, I'll walk you through our Indian business, where we're seeing growth today and expecting this growth to continue as CNG fuel station buildout continues toward 10,000 stations. Following that, I'll pass it over to Richard to cover the financials.\n\nOur business continues to deliver strong results quarter over quarter, despite the ongoing challenges our industry is facing. In the second quarter, we delivered revenues slightly up compared to Q2 last year, an achievement considering the combined impact of adverse foreign exchange rates and sanctions stemming from the Russia-Ukraine conflict, which combined to negatively impact the quarter by $13 million. Excluding these impacts, revenue would have increased by 16%. This is truly a testament to the strong results driven by our business units, where we saw increasing sales.\n\nThat is in India as well as in our hydrogen and electronics businesses plus the addition of the fuel storage business we acquired in late May 2021. Although not a second quarter item, I want to take a moment to highlight the significant new business we announced last month to supply LPG fuel systems to a leading OEM. This deal is forecast to generate EUR38 million in revenue through the end of 2025, with production expected to begin in Q4 next year. Cost competitive alternative fuel solutions such as LPG are a compelling option to reduce greenhouse gas emissions in markets like Europe, where refueling infrastructure is well established.\n\nWe're also developing fuel systems to respond to future regulations, including the proposed Euro 7 standards, and we look forward to updating the market on these developments. This new business highlights our industry position as a leading Tier 1 supplier of alternative fuel systems that respond to current and future emission standards and to customers' needs for affordable transportation. This new business we've secured is a key step in our plan to grow to profitability. In May, at the ACT Expo in Long Beach, California, we unveiled our hydrogen HPDI system for internal combustion engines for head-duty applications, and we did so in the form of a fully functioning heavy-duty demonstration vehicle.\n\nThere was dramatic interest from all the different players in our ecosystem, OEMs, fleets, fuel providers and more. Increasingly, hydrogen is viewed as the zero carbon fuel we need for our industry and we're helping the industry to understand that ICE engines with HPDI will play a critical role in transforming from fossil fuels to clean and renewable fuels because HPDI is such an effective and affordable path to follow. Fundamentally, the outlook remains positive for our business as we continue to deliver solid results despite the various headwinds we and our industry are facing. In our heavy-duty OEM segment, despite a challenging LNG pricing environment, our European HPDI launch partner is continuing to gain market share over competitors that offer spark-ignited natural gas engines.\n\nWe're seeing the market appreciating and valuing HPDI's superior performance and efficiency and as a result, we continue to see order flow for HPDI systems, despite headwinds from higher LNG fuel prices relative to diesel. HPDI volumes will be a significant driver to bring Westport to profitability as increased volumes drive economies of scale. And we're in a good position now for HPDI growth with the 2025 European CO2 regulations will drive OEMs to act to decarbonize. European OEMs need to meet regulations that require a 15% reduction in fleet average CO2 with products that don't adversely impact the performance and reliability of their customers' demand.\n\nHPDI is a solution. A key reason HPDI is gaining in the marketplace comes down to superior fuel efficiency. In a recently published road test, HPDI enabled fuel savings of more than 25% when compared to other natural gas engines. 25% is a massive number in this industry.\n\nIn the lifetime of a typical truck, about $700,000 worth of fuel is consumed. So, a 25% savings means $175,000 in lifetime savings, a very positive business case and why HPDI is continuing to prove its economic and environmental business benefits every day on the road in thousands of vehicles in Europe. HPDI, especially when using biogas, will be an important part of the solution made even more compelling when the fuel price advantage of LNG versus diesel is reestablished. Looking to the wider policy climate, we continue to see a positive trend that supports our heavy-duty business outlook.\n\nThe Ukraine crisis has spurred a commitment to reducing reliance on Russian gas, resulting in additional biogas production plans in, which is a huge positive for our sector. We're already seeing examples of this. In June, Scandinavian Biogas announced a $269 million bio-LNG delivery agreement. And in Italy, Biomet announced receiving a $75 million investment to create Europe's largest plant for producing biomethane from waste.\n\nWhile it's unlikely that any single low-carbon energy source can replace Russian gas, especially as the EU seeks to reduce reliance on fossil fuels and imported energy. The wider adoption of biogas and more investments into net zero fuels creates further growth opportunities and new markets for our clean affordable products. To summarize, our heavy-duty business remains strong in the face of industrywide headwinds. There is growing recognition and appeal of our HPDI systems because of its low cost, clear performance advantages over spark-ignited engines and carbon reductions that fleet operators are looking for, and which OEMs require to respond to regulations.\n\nHydrogen HPDI is going to play a pivotal role in the future of Westport, and we've demonstrated this through both analysis and engine testing and now with our demonstration vehicles that HPDI works great than hydrogen. Unsurprisingly, we saw considerable interest in our hydrogen HPDI solutions at the ACT Expo in May. And our work with Scania continues this summer with our newest 13 liter state-of-the-art engine in our test in Vancouver. Hydrogen HPDI is compelling with near-zero greenhouse gas emissions, lower vehicle costs and low industrialization costs as compared to fuel cells or battery electric vehicles, particularly for heavy-duty long-haul trucking applications.\n\nWe've demonstrated that power, torque and efficiency using hydrogen HPDI is significantly better than the same engine running a diesel fuel. These demonstrations are changing the conversation right now. To be clear, OEMs can now see that HPDI has a long and bright future, because it's successful on natural gas and biogas today, and is the most economic way to use hydrogen in the future. Driving our conversations with both current and future OEM customers regarding our hydrogen HPDI solution is the potential to bring the product to market sooner to the straightforward application of existing HPDI componentry.\n\nThe opportunity to continue using OEM's existing engine development capabilities and manufacturing communities avoiding large investments required to develop and industrialize other technologies is very appealing. It makes good economic sense. Good business sense and is a real solution for the industry. Combining better economics with better performance is driving significant interest in our unique product offering.\n\nHydrogen continues to gain significant traction and attention globally. The European Union has set a 2050 deadline to achieve its goal of becoming carbon neutral. And hydrogen fuel in the heavy-duty vehicle sector will play a substantial role in their de-carbonization strategy. Following our success at the ACT Expo will introduce hydrogen HPDI technology for the first time in Europe at the IAA Transportation Conference in Hanover, Germany in mid-September.\n\nAnd we're thrilled to continue to demonstrate to the global industry that our HPDI technology works brilliantly with zero carbon hydrogen, and enables the most affordable way to use green hydrogen in long-haul heavy-duty transportation applications and other important high load applications. We're enabling HPDI used by OEMs and fleets for long-haul trucking with natural gas, biogas and with a clear path to zero carbon hydrogen. HPDI is a solution of the future that OEMs can access today. Just last week, on August 4, we hit another milestone, the Westport Hydrogen HPDI truck pulling Raley's Ozark trailer fueled with hydrogen for the first time in America at the West Sacramento station, the first hydrogen station in the world.\n\nTurning our attention to China, in light of LNG pricing that continues to negatively impact the market in China, where HIS continue to work with HPDI so that'll be poised to launch its market fundamentals return. Discussions continue with potential Chinese partners specifically around hydrogen HPDI. China is now ranked first in the world for the number of hydrogen refueling stations with more than 250, accounting for about 40% of the global total. The China Hydrogen Alliance forecasted demand for hydrogen will reach 35 million tonnes by 2030, with continued robust growth for decades to come.\n\nLight-duty vehicles fueled by LPG, our growing market trends that positively impacts our business through both our aftermarket and OEM channels. High fuel costs create opportunities for our business as both industry operators and end customers look for lower cost options, lower cost to acquire and lower cost to operate. Alternative fuels are part of the answer. What's happening currently with the price of LPG is a good example.\n\nFor LPG, there's a clear price advantage that is a growing part of our story. Fuel prices change and customers react. It's in these price advantage environments where we gain market share and ultimately drive profitability. In important markets like Turkey, Italy and Poland, LPG is available and the price advantage of petrol has recently been increasing.\n\nIn Italy, for example, historically, the price advantage of LPG was about $0.60, rising to over $0.80 more recently, comparing petrol price per liter with LPG price petrol liter equivalent. Drivers who drive an LPG are saving roughly EUR50 every time they refuel their car. I'll say that again, drivers who drive an LPG are saving roughly EUR50 every time they refuel their car. In addition to the pricing advantage, LPG refueling infrastructure in Europe is widespread, supporting further growth in the market itself.\n\nOur business in India continues to grow, it has become a case study for the type of market where we can be competitive, and as a result gain market share with our clean and affordable solutions. Our revenues in India continue to grow, up more than 50% to $10 million this quarter. The market in India is transforming from a diesel, petrol market to CNG, where we continue to see a price advantage. Natural gas-fueled vehicles are taking the place of diesel in a real way and now represent more than 11% of sales for passenger cars and about 29% of commercial vehicles.\n\nAnd we're seeing strong demand for our products from three-wheelers and taxis, as well as heavy duty trucks. India aims to have natural gas make up 19% of their overall energy mix in the coming years, alongside plans to build 10,000 natural gas refueling stations, which are expected to be installed by 2028. India is poised to play a significant role in the growing hydrogen economy as well. In June, Adani New Industries, one of India's largest energy companies announced a $50 billion investment to develop green hydrogen ecosystem, representing India's largest commitment to green hydrogen from an individual company to date.\n\nIn summary, industry represents a growth market for us, supported by strong fuel price advantage, a supportive policy backdrop and a growing hydrogen economy. No question. We continue to face headwinds now, but we also have substantial tailwinds. Emissions regulations, government action, societal demand, economic and great products that respond to the call the action right now, we remain well-positioned as a company.\n\nWe have the right products for today and for the future. China, the world's top LNG buyer last year is in the midst of a large sold out the industry has ever witnessed. 10 new LNG import terminals are slated to come online in 2023 alone, and capacity will roughly double in the five years through 2025. In Europe, we're just 2.5 years out from the 2025 regulation with penalties being implemented, and I can tell you from discussions we've had with global OEMs around HPDI and that life helps are going up as the cost significance and overall capability and reliability concerns of the newer technologies are being made there.\n\nThe European Union has relaunched repower EU in the face of its energy challenges. Repower use plans call for rapidly increased imports of LNG, replacing imported pipeline gas in Russia, the utilization of the significant untapped biomethane resources in Europe and also green hydrogen production, all of which will require significant privatization and build out infrastructure. There's also been a quadrupling of the hydrogen targets originally set out in the Fir for 55 legislation. The ambition was five million tons, and now with Repower EU Plan, we target 20 million tons by 2030.\n\nThis represents a significant growth opportunity for our company. All of this indicates increased interest in hydrogen HPDI as a game-changer for heavy-duty transport. With that, I'd like to turn it over to Richard to go through our financials.\n\nRichard Orazietti -- Chief Financial Officer\n\nGood morning, and thank you, David. Revenue for the second quarter of 2022 of $80 million was slightly up from the prior year quarter despite the challenging headwinds from volatile fuel prices, inflationary pressures and production input costs, continued supply chain challenges plaguing the automotive industry. and the negative impact from the Russia-Ukraine conflict on our sales volumes to the Russian market. Further, the weakening of the euro against the US dollar during the quarter has had a significant impact on the translation of our financial results due to our large euro exposure.\n\nAs David mentioned, the combined impact from the Russia-Ukraine conflict and the 13% decrease of the euro against the US dollar negatively impacted revenue this quarter by about $13 million. Despite what feels like a long list of headwinds, we are proud of the work that our team accomplished this quarter in our business units. Our OEM business continued to grow, primarily driven by the addition of our Fuel Storage business acquired in June 2021, but as well as modest growth in our hydrogen and electronics businesses and increased sales of our light-duty OEM products in the Indian market. Offsetting the growth in OEM revenue, our independent aftermarket revenue was lower year over year due to reduced sales volumes, primarily a result of the impact of sanctions from the Russia-Ukraine conflict.\n\nNet loss was $11.6 million for the second quarter of 2022 compared to a net income of $17.2 million for the same prior year period. As a reminder, the second quarter 2021 included two significant one-time items that bolstered earnings, namely the recognition of a $5.9 million bargain purchase gain related to the acquisition of the Fuel Storage business, and an $8.9 million tax recovery recognized for a COVID-19 tax release ruling from the government of Italy. Besides these non-recurring items, the decrease in earnings was driven by lower year-over-year gross margins of $5.2 million and the loss of equity income from the termination and sale of the CWI joint venture. Adjusted EBITDA was negative $4.3 million compared to positive $6.2 million in the same prior year period.\n\nThe $10.5 million decrease was mainly due to the loss of equity income from CWI and the lower gross margin, partially offset by decreased operating expenses. We are experiencing gross margin pressure due to higher material costs from the global supply chain shortage, general price inflation in our production input costs, and lower sales volumes related to the Russia-Ukraine conflict, and also, we are seeing pressure from volatile CNG and LNG prices, particularly in Western Europe on our sales volumes. Turning to our business segments. OEM revenue for the second quarter of 2022 was $54.3 million, up 15% compared to the prior year quarter.\n\nThe operating loss from OEM was $5.6 million, up from a loss of $3.4 million for the prior year. The increase in revenue was primarily driven by the additional revenues of $5.1 million from our Fuel Storage business. We also saw increased light-duty OEM business sales volumes, specifically in India as well as increased sales volumes in our electronics and hydrogen businesses. This was partially offset due to lower sales volumes to our European OEM customers caused by higher CNG fuel prices.\n\nOur hydrogen components business continues to grow with Europe, China and North America being our primary market. Our existing GFI branded hydrogen business supplying components of Plug Power, Ballard and others have seen average annual revenue growth of 50% over the last three years. In our electronics business, we are seeing volume growth from a key customer and supported by overall demand increase across the business unit. Turning to heavy-duty OEM.\n\nOur sales volume to our European OEM launch partner decreased slightly compared to the same prior year period, but remains in line with year-to-date volumes from last year. The decrease in the quarter was a direct result of the softness in demand caused by unfavorable fuel price differential between LNG and diesel in many Western European markets. Higher LNG prices are causing a significant challenge to the demand for LNG trucks, which is expected to temper our expected volume growth through our OEM launch partner through 2022 and until relative LNG prices returned to a more favorable equilibrium. Gross margin was $4.7 million or 9% of revenues for the quarter, compared to $7.2 million or 15% of revenues in the prior year.\n\nWe saw a decrease in gross margin in our light-duty OEM business due to lower sales volumes to our European OEM customers caused by the higher CNG fuel prices, which was partially offset by higher sales growth to emerging markets with lower gross margins.Gross margin in our heavy-duty OEM business decreased year over year due to lower comparative sales volumes, a contracted annual price discount to our OEM launch partner in the first quarter of 2022 and higher material and warranty costs. Further, we continue to incur higher production input costs from supply chain challenges and equation and logistics, utilities and other costs, which we have only partially been able to pass on to our OEM customers. Partially offsetting these pressures, gross margin increased by 1.1% from our fuel storage business. R&D expenses for the second quarter were $4.1 million, which were lower year over year due to foreign exchange.\n\nOur heavy-duty OEM R&D activities continue to focus on the development of next-generation HPDI fuel system technology and demonstrations with potential OEM customers on our HPDI fuel systems hydrogen and natural gas applications. Our light-duty OEM research and development is focused on development of new LPG systems in line for installations for potential OEM customers. Now turning to independent aftermarket, our business continues to face significant challenges from reduced sales volumes in Eastern Europe due to the ongoing Russia-Ukraine conflict and volatile fuel prices. Revenue for the second quarter was $25.7 million, down 19% compared to the prior year period.\n\nAside from the impact of Russian sanctions, sales volumes were lower to key markets of Turkey and Argentina, softness in the Argentine market, specifically due to higher CNG prices, which have been a recent challenge for our CNG products due to the volatile fuel price. Further, the aforementioned foreign exchange impact of the weakening euro had a significant impact on the comparative performance. Gross margin was $5.8 million or 23% of revenues for the quarter, down $2.7 million, compared with the same prior year period. The decrease in gross margin and gross margin percentage was attributable to lower sales volumes and increased material costs from the global supply chain shortages and inflation.\n\nOn a positive note, the LPG price differential, the gasoline is improving, which is providing some support for increased sales demand, which we are seeing signals in some of our key markets like Argentina, Italy, Poland and Turkey. With this positive tailwind and other countermeasures to mitigate the impact of inflation and improved productivity, we are taking the necessary steps now to improve profitability in our aftermarket business. Finally, I'd like to touch on liquidity, our cash position decreased by $29.4 million during the second quarter to $98.2 million. Our net cash flows used in operating activities were $16.5 million in the second quarter of 2022, an increase of $7.8 million compared to the same prior year period, primarily driven by an increase in operating working capital, specifically a buildup of accounts receivable and inventory.\n\nWe've built up inventory to manage against supply chain risks along with shortages of raw materials and components. Further, our inventory levels increased due to lower-than-expected sales volumes from Russia and other markets. And our growing electronics business, which we are taking actions to monetize the existing inventory and optimize our inventory levels. Our net cash used from investing activities in the quarter was $3.5 million, primarily driven by capital investments in HPDI.\n\nNet cash flows used in financing activities were $8.5 million for the second quarter of 2022, primarily due to a net repayment of debt as we begin paying down our debt on a quarterly basis after a period of deferral from COVID-19 relief. We remain focused on our allocation of capital and resources and executing our strategic and operating plans, and as such, are focused on improving profitability and liquidity. We have also seen continued pressure on gross margin, a trend we are working to reverse. Currently, we are working with our customers in both OEM and independent aftermarket businesses to implement price increases and also taking productivity counter measures to manage our profitability going forward.\n\nAs the negative macroeconomic and uncertain geopolitical conditions continue to persist, the duration and severity of the impact on future quarters is currently uncertain. Having said that, we do see positive signals in the growth of our OEM businesses, and a path to profitability as sales volumes grow in our heavy-duty and light-duty OEM businesses. We are also optimistic about our return to improve profitability of our independent aftermarket business from the current tailwind of favorable LPG prices. With that, I would like to turn it back to David.\n\nDavid Johnson -- Chief Executive Officer\n\nThank you, Richard. Before we open the call for questions, I want to close on a few key points. Westport Fuel Systems delivers market-ready transportation solutions that reduce emissions and save money, lower cost to OEMs to bring to market and lower cost vehicles for feedstock rate. We remain encouraged by the outlook for our business, and here are just three reasons why.Our HPDI story, performance, efficiency, low cost and even better with hydrogen.\n\nSecond, the growth of our LPG business; and third, the growth we're seeing and we expect to see in our business in India. As a supplier of advanced fuel delivery components and systems for clean, low-carbon fuels, I'm confident in our ability to capture the additional market opportunities we have in front of us. All these factors give us optimism in our ability to meet the needs of our customers and advance toward our financial objectives. And with that, I'll turn it over to the operator to open the call for questions.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] The first question is from Colin Rusch with Oppenheimer. Please go ahead.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThanks so much, guys. Now could you talk about what you're seeing right now in terms of the ecosystem developing to support the ramp of hydrogen with HPDI? Certainly, there's a lot of action, not particularly in the US, but certainly in Europe as well around some of the fueling and supply chain elements that going to be required to support that ramp?\n\nDavid Johnson -- Chief Executive Officer\n\nYes, good morning, Colin. Good question on hydrogen. It's – I would say, it's a very exciting time in the history and developments around the world, primarily driven by a combination of government and industry action are taking different approaches in a different details, of course, but fundamentally, what we see, and I think the Russia-Ukraine crisis has really crystallized is in Europe, is that there's like a renewed energy or an increased energy around taking those actions and making those investments. So there's investments in building out the capability to produce and make available green hydrogen or incentives in the marketplace to -- for all elements of the ecosystem.\n\nI think this is a really important development. What we saw at ACT Expo in May was that there's a preponderance of -- or even a majority of the offerings out there are fuel cell based and ourselves and Cummins were at the show with internal combustion alternatives. And this, I think, is really what's new is kind of the recognition by the existing and mature industry that hydrogen is coming as a fuel, that it's going to be the fuel of the future and it will have a place in the industry, and therefore, we need to get ready and now searching for what are those best ideas, best technologies, most practical and realistic to respond to the availability of hydrogen fuel in the future and the need to use that to decarbonize transportation. So I really see this kind of as a really formative time in our industry and actors like the Hydrogen Council, collaboration of industry and government all the different players and ecosystem really having an important effect on capitalizing toward action of both generation of hydrogen, distribution of hydrogen and use more hydrogen.\n\nAnd where we see HBI playing is being very practical and affordable way to use hydrogen very effectively for long-haul, heavy-duty transportation. So in addition to showing our demonstration vehicle as we did at ACT Expo in Long Beach in May and then just last week in Sacramento. And then in September at the IAA and Hanover -- we're demonstrating this capability in dyno cells with combustion engines. And there's, I would say, a tremendous amount of increasing momentum to accept and understand its potential to use the existing internal combustion engine infrastructure, existing plants, existing vehicles, all the existing infrastructure can be reused with HPDI and deliver a very effective product that uses green hydrogen in the future and therefore, has a huge impact on decarbonization in a very affordable way.\n\nSo we think this is really important for Westport Fuel Systems and really promising for our industry.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThat's super helpful. And then just in a more practical way, given what we've seen in terms of raw material movement and similarly over of some of those baskets and other elements recently. I'm just curious how quickly, that might start flowing through some of your cost structure and what you're doing to kind of attend to that and start working down some of the component costs?\n\nDavid Johnson -- Chief Executive Officer\n\nYes. So, I think, as a general premise in our industry right now, not specifically the HPDI, but just thinking about the industry, we have -- in the world, we have this huge inflationary pressure around the world. And so, we're seeing that the key aspect for us is to manage our pricing in real time with the cost increases. This is super challenging.\n\nIn the OEM business, for example, basically, our customers are, let's say, open begrudgingly, of course, to price increases to reflect the inflationary cost pressures that we're seeing and they're seeing, but it's a process whereby the costs go up, and then you ask for the price increase, and we're successful in getting those price increases. But it's after the fact, not before the fact. That's different from our aftermarket business, where basically the price goes on to a consumer and the consumer is willing to pay that price if they can make it back up with fuel price savings. And this is where we're very pleased about the movement we've seen in the price advantage of LPG versus gasoline and diesel, because that allows customers to pay back the cost of acquiring the hardware to put on their vehicles and allows us, therefore, to recover the cost increases we're seeing in our aftermarket products with increased product pricing there.\n\nSo, yeah, in general, the key element is being able to pass those cost increases that we're seeing on to our customers.And then fundamentally, with our HPDI business probably the more important aspect is getting the volume up, so we can access economies of scale, bringing the cost down and increasing our margins. And that is a path we're on, but not yet got to the point where we can declare that we've got to those appropriate margins for that product. That is still at relatively low volumes in total and needs more growth before we can get to a profitable standpoint.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nOK. Thanks, so much, guys.\n\nDavid Johnson -- Chief Executive Officer\n\nThank you, Colin.\n\nOperator\n\nThe next question is from Eric Stine with Craig-Hallum Capital Markets. Please go ahead.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nHi, David. Hi, Richard.\n\nDavid Johnson -- Chief Executive Officer\n\nHey, there.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nSo you just mentioned some of the market developments. As we think about hydrogen HPDI. I know we've got the introduction of the demo unit in Europe here in mid-September. But as you think about the next, I guess, for the remainder of 2022 and into 2023, without naming specifics, I know you can't do that, but just maybe some signposts that we should look for or expectations that you would have that say that you are on the right track here and in a timely fashion?\n\nDavid Johnson -- Chief Executive Officer\n\nI think, there can be any number of developments that could get announced in the future, Eric. Obviously, I can't forecast those or promise those. But fundamentally, the business with respect to hydrogen is one that we found so far, people are willing to talk about a bit more than perhaps our natural gas developments as an example. So I could expect that.\n\nAnd we're looking forward to the chance to show that. For us, right now, what's wonderful is this demonstration truck that we do have, because basically, you can hand the keys to customers and government officials and other people that need to understand what the potential is of hydrogen HPDI. And we can do that by showing the capability of the truck, to pull a load to drive just like trucks that they're used to. And in all of my experience in the industry through the years, there's nothing better than handing someone that keys to a vehicle and saying, try this out, see what you think.\n\nAnd so, that's what we're doing now. So we did this past week in Sacramento, I think it really makes a big difference in the psychology of approaching what is essentially new technology, right, new technology of the industry to think, hey, we can run hydrogen through the internal combustion engine and have a -- not just a viable product, but a great product. We're demonstrating more power, more torque, and more efficiency with hydrogen HPDI than you get with the base diesel engine that we apply it to. So, really a great, great offering and we're looking forward to the chance that one-by-one, we'll be able to make more announcements that will help the investor community understand the progress we're making.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nRight. No, absolutely. The -- maybe a follow-up on that. I mean do you feel like acknowledging this is the OEM world, it still takes quite a bit of time.\n\nBut if you compare this to LNG, I mean, the fact that you now have Volvo in Europe, you've got trucks in the market, the market knows HPDI. I mean do you think that that potentially hydrogen moves faster in its development, or do you expect kind of a similar -- how it plays out similar to LNG?\n\nDavid Johnson -- Chief Executive Officer\n\nWell, first of all, for sure, I expect that from our side as a fuel system provider, we can move faster with hydrogen than look at the history of HPDI with natural gas, just because we're taking existing components and system know-how and applying it to just basically connecting and using hydrogen as natural gas. So that development path looks quicker to us. It certainly looks quicker to us than the full industrialization of a fuel cell path, for example, where they've got to go build plants. The components we're using comes off on standing lines as the componentry for our natural gas solutions.\n\nAnd so that seems faster. I would say also that fundamentally, the economics are in the favor of HPDI with respect to the efficiency of the engine delivers and the cost of the componentry versus the change that has to be made in the vehicle to adopt other technologies. So, I think, yes, that can move faster. But perhaps most importantly, this view that we're helping our OEM customers and customer prospects understand that HPDI is a long-term solution to achieving low-carbon long-haul heavy-duty transport that because hydrogen is a long-term solution with HPDI and you can use natural gas and biogas today, there is a path forward that says you can act today with natural gas and access the hundreds of stations in Europe, the thousands of stations in China, the thousand-plus, almost 2,000 stations in the US, there's this ability to use HPDI today and have a path forward with hydrogen, and that adds to the potential for an accelerant of our business, pulled by hydrogen in the future, but grounded in natural gas and biogas today.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nYes. Understood. Maybe last one for me, just on Weichai. Thanks for the update there in China.\n\nAnd I know you've got the take-or-pay, but likely just given the macro, you're not going to hit those timing targets. Is that something that potentially could be renegotiated to, in some way, include hydrogen, a mix of hydrogen and LNG or how should we think about that?\n\nDavid Johnson -- Chief Executive Officer\n\nYes. As you've seen before, we struck the agreement with Weichai back in 2018, and then we had a renegotiation of the terms and the volumes just last year. So, everything is up for negotiation, I would say. Nonetheless, we do have some commitment and it always should be an improvement on what we have today.\n\nBut nonetheless, there are some practicalities and today, we see this adverse price condition in China, we expect natural gas that is really weighing on the marketplace and specifically, the launch of our products at Weichai. So as that is remedied as that is fixed in the marketplace through market mechanisms and perhaps government action, then we would look forward to some action, and that could include some change in our contract, but who knows that's all in the future.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nOK. Thank you.\n\nDavid Johnson -- Chief Executive Officer\n\nThank you, Eric.\n\nOperator\n\nThe next question is from Rob Brown with Lake Street Capital Markets. Please go ahead.\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nGood morning. My first question is on the European HPDI product. I think it was a slight growth this year or this quarter. How do you see the order rates sort of in real time here? Are they continuing to slowdown with the price spread or are they sustaining sort of flat or just sort of directionally, how is the order flow given the current price situation?\n\nRichard Orazietti -- Chief Financial Officer\n\nYes. So, it's a very interesting thing. Historically, we've talked about our product, HPDI and our other cases products being able to offer and unlock and give customers access to an economic advantage because of the price advantage that natural gas and LPG typically offer versus gasoline and diesel. And right now, in Europe and China, we kind of have this parity or in some cases at the pump, LNG tends to be a bit more expensive than diesel.\n\nAnd so, we have this adverse condition right now, which we don't expect to persist, but that is really flattening the curve that you will in some fashion in the near term as we've looked at this year, what kind of volumes are on the flattish side with respect to HPDI as opposed to growth. Nonetheless, we're really happy and we see that the CO2 standards are on the horizon. And so, our OEM customers and prospective customers face this regulatory requirement starting in 2025 with substantial penalties they don't need it. So, we think that becomes more of a driving force as the driving force really in the marketplace is actually the OEMs requirement to reduce CO2 and our solution being one of the most effective ways to do that.\n\nI mentioned earlier in the call that, we've got this report -- road test report showing 25% better fuel economy, there's a fuel economy associated with doing HPDI versus spark-ignited engines. And so, this really crystallizes and makes a glaring example of how HPDI really benefits and so when you say, hey, I've got to get to a lower carbon fuel, now what's the most effective one is HPDI. And so those are kind of the key forces in the marketplace. We've got higher LNG prices.\n\nSo, we've got this big economic benefit and the need to decarbonize and that's kind of flattening our growth curve in this moment, but we don't expect that to persist. And certainly, as 2025 is on the horizon, we expect an acceleration of that volume because HPDI is a very cost-effective way to respond to regulation.\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nOK. And then on the LPG contract you announced with an OEM, is that a new contract or a new OEM or maybe just some color on what market it's in and is it an extension or a new contract?\n\nRichard Orazietti -- Chief Financial Officer\n\nYes, sure. This is a really important step for us. It is a new business for us. So, we're really excited to have this new customer and have this new business.\n\nObviously, it's a meaningful number for us in terms of our revenue outlook over the contract period of EUR38 million. So that's a big deal for us.And fundamentally our path to profitability as the company is through growth. And so, we can really secure a business like this based on the technologies and the products that we offer and the services that Westport Food System offers to our OEM customers. It's a big deal and we're really excited about it.\n\nAnd we hope to add more to that, of course, we continue the growth trajectory. For us, as we look at LPG, the benefit of LPG is growing, the economic benefit, the environmental benefit, the huge installed infrastructure of refueling stations, and we're taking tens of thousands of stations across Europe were LPG. It's a very common fuel there, the most common in the world for transportation right now. And so that's a great development for us.\n\nWe're excited about it. And we think it really demonstrates that Westport Fuel Systems is the leading OEM for supplying these kind of systems to the OEM industry in total.\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nOK. Thank you. I'll turn it over.\n\nDavid Johnson -- Chief Executive Officer\n\nThanks, Rob.\n\nOperator\n\nThe next question is from Amit Dayal with H.C. Wainwright. Please go ahead.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nThank you. Good morning everyone. Most of my questions have been asked, David. With respect to sort of the HPDI 2.0 sales environment, I know there are some near-term headwinds, et cetera.\n\nBut have you seen any deals fall through, or are customers just slowing down adoption in this environment? Like how should we think about that product over the next few quarters, sales for that product?\n\nDavid Johnson -- Chief Executive Officer\n\nYes. I think -- good to speak with you, Amit. I think in generally, most of our activities are now with customers, are now considering the opportunity that HPDI offers with both hydrogen and natural gas. And so this is really what's catalyzing our discussions with customers is the opportunity for HPDI to do both and to have that path to -- hydrogen in the future.\n\nAnd so that's making the opportunities for HPDI with natural gas and biogas more accessible, more interesting for our customers.And so that I would tell you is probably the main ingredient that's really driving discussions. And we see this around the world, right? So as an example, we've spent a lot of time talking about our business with Weichai and looking to get that launch with natural gas, but there is a tremendous amount of opportunity for HPDI with hydrogen in China, we're carrying on conversations with many OEMs there around that opportunity. They're building on hydrogen structure. So we talked about Europe, because it's very accessible to us.\n\nBut in China, they're in the lead, like they are with natural gas in terms of refueling infrastructure. And so we see a big opportunity there. And that, to me, is really the catalyst for the discussions on HPDI in general across markets around the world is this move to hydrogen in the future, natural gas and biogas now.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nUnderstood. So just want to bridge that, so it's almost like we have to come out with a new offering that has -- that can support both these capabilities or you have the hydrogen capability provided. What would be the time line to introduce a product like this? Are you already sort of working on developing it at an accelerated pace? Like any color on sort of your thoughts strategically on how you have been tapping with this opportunity?\n\nDavid Johnson -- Chief Executive Officer\n\nYes. So actually clarify that the fundamentals of our HPDI system from the injector and the system architecture and the componentry and so forth are very, very similar. So basically, today, in our demonstration vehicle we're using the same hardware. We do expect and are working on the various details of tuning that hardware and modifying it to make it fully validated and available for hydrogen.So I do expect in the long run that the actual hardware will be different right? It will be exactly the same components for hydrogen and natural gas.\n\nNonetheless, the fundamental technology and, for example, how it fits on the vehicle, how it fits in the engine is the same. And so this is what really opens the door for those developments that are future hydrogen natural gas now and biogas too. And so that is the path that we see and the path that we're working with our customers on many fronts for many markets like China, Europe and North America.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nYes, yes. I think I did see some of that at expo, you showed me some of the models alongside -- around this basically. With respect to the LPG system, David, I think you mentioned production could begin in the fourth quarter next year. I don't know if I got that correct?\n\nDavid Johnson -- Chief Executive Officer\n\nNo, no, that's exactly correct. Fourth quarter of next year is start of production for that project and then over the two-year period that unfolds after that EUR38 million of revenue is our expectation.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nOK. Understood. So near-term margin outlook, should we -- from a -- just a conservative standpoint, even though the macro environment could be improving to your favor from a supply chain perspective, et cetera? Should we assume similar levels for margins in 3Q and 4Q?\n\nDavid Johnson -- Chief Executive Officer\n\nSo generally, I would expect in the near-term, as mentioned about -- I mean the big levers going on with respect to pricing -- excuse me, margins are three factors; cost pressure from inflation, pricing activity that we take on. And then with respect to HPDI, we need the volume curve to actually achieve the economies of scale and improve our margins there. So I would expect not a big movement in the margin in the near-term as we work to pass along costs that we're seeing to our customers in terms of pricing. And then looking for that improvement in the economic conditions of LNG in the marketplace to drive the recovery and then the resumption of growth in our volumes of HPDI.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nOK, got it. Thank you. That's all I have for now. I'll take my other questions off-line.\n\nDavid Johnson -- Chief Executive Officer\n\nThanks, Amit.\n\nOperator\n\nThe next question is from Jeff Osborne with Cowen. Please go ahead.\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nThis is Jeff Rossetti on for Jeff Osborne. Thanks for taking our questions. I just wanted to see if I could ask on the O&M volume -- OEM volume side, how to think about the headwinds on the LNG side for heavy-duty with respect to the tailwind you're seeing for LPG for light duty. I know you called out that given LNG prices, you might see some slowdown with your HDPI 2.0 OEM launch partner?\n\nDavid Johnson -- Chief Executive Officer\n\nYeah. So our outlook right now is, I would say, for HBI is flattish with some upside potential. And certainly, we've seen in global markets some moderation of the LNG prices. But the condition in Europe is really quite challenging with respect to trying to forecast fuel prices with the ongoing Russia-Ukraine war.\n\nI think someone who's got a crystal ball on that should be super valuable at this juncture.But fundamentally, in the long run, I do believe that the LNG flows around the world, natural gas ability will continue to grow. And certainly, with high LNG prices, we have more and more biogas coming online, and that will help. So fundamentally, until there is some kind of, let's say, reestablishment of an LNG price advantage versus diesel, and then the implications associated with the CO2 standards in Europe, I would expect some flattish and modestly upward trends and some luck. And then when the price is reestablished and CO2 standards can in place, we expect a big change and a big growth potential as HPDI continues to demonstrate that it is the most cost-effective way for OEMs to respond to the regulations and for customers to access cleaner transportation.\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nGot it. OK. And one that's very – another one that's probably difficult to sort of postulate on, but one large Tier 1 provider talked about potential gas supply disruptions in the back half of the year in Europe. And I was just thinking, if you had contemplated any scenarios around that or if you had any thoughts around that potential?\n\nRichard Orazietti -- Chief Financial Officer\n\nYeah. No, I think as a general premise, it's – we don't have an ore in the water with respect to controlling availability or pricing field. So we're – it's an external factor that we respond to. One of the things that, I think is very positive for our company in this, let's say, dynamic market or volatile market or unknowable market in the future, is the fact that we do have a diversity of market diversity of products and a diversity of fuels that we support.\n\nSo as an example, we're seeing growth in our hydrogen business right now in our markets in North America and in China. And we're seeing growth in our electronics business, our LPG business sees growth. And then we're working in markets around the world. So it's not all about Europe, LNG and HPDI.\n\nThere are other elements of our business, which are having those – those tailwinds supporting us. And so that's where I think fundamentally looking at our results just this past quarter, coming off flat in the context of really constraining the business in Russia that was important to our P&L. Historically, and hopefully, in the future will be important again, but right now is super impacted by the conflict and then the foreign exchange. So the things that we would have been up more than 10% had we not had those factors, I think it's indicative of where the company is going in the long run.\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nOK. Thanks. Just one last one, if I could. I think Richard talked about the working capital build.\n\nI just wanted to see, if there was any thoughts on, if there's going to be any kind of release near-term on the working capital side? Thanks.\n\nRichard Orazietti -- Chief Financial Officer\n\nYeah, for sure. We did build up some inventories, specifically with respect to the electronics business. I think everybody around the world understands the challenges this business has faced, we didn't have much choice in the matter. So basically, suppliers of chips in the marketplace said, if you ever want to get chips to get and you better place orders.\n\nAnd so in this context, we didn't have a lot of flexibility, and so we have built up those inventories. And certainly, we expect to get those inventories down as a function of time, as we use them up, and perhaps hopefully, the markets for – from our suppliers specifically, become more stable, predictable and ones that we can return to normal terms and normal order cycle as opposed to having to hold inventory to protect our sales.\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nThank you.\n\nRichard Orazietti -- Chief Financial Officer\n\nThanks, Jeff.\n\nOperator\n\nThe next question is from Mac Whale of Cormark Securities. Please go ahead.\n\nMac Whale -- Cormark Securities -- Analyst\n\nGood morning. In terms of, when there's a truck sales downturn, we usually see fleets drive their vehicles longer and that builds up some pent-up demand. So when you finally do launch or when your partner is actually ramping up, do you have any insight from, say, new OEM projections about whether that will play a role in the ramp-up phase?\n\nDavid Johnson -- Chief Executive Officer\n\nYes. Good morning, Mac. So the view I have in this regard is that our business right now is still sub-5% of the marketplace, right? It's a very small fraction of the total market. So if the market declined by 10%, 15%, 20%, the reality is that I expect and we've seen historically the markets moved around, and we've been growing through the years as we -- after the launch in 2018, despite the ups and downs in the marketplace because we're the small percentage and the focus of our customers, the OEMs and their customers, the fleet is in accessing lower carbon fuels for their trucks.\n\nAnd be able to offer a lower carbon solutions to the marketplace. So I don't think that affects us so much. Of course, it can't be viewed as positive that the volume goes down and it can be viewed as positive as the volume of the market was up in total, but I would say the impact is nearly -- not nearly as important as the impact of the growth of market share of our product, so historically, just a couple of years ago, gases field products in the European truck market were sub-1% and now they're on the order of 3% so it's triple, right? So we've seen that our volume, which has gone up dramatically this time, but still it's still relatively low buying even though the growth has been good. So yes, overall, I don't see the market volume in total and having such a big impact, but rather the growth trajectory of our product, and that's driven by the economics that we talked about and the regulation that we talked about.\n\nMac Whale -- Cormark Securities -- Analyst\n\nSo just -- so I understand that. So you have the mark -- you have a market share, but you also have the market rebounding like there's normally a big pent-up demand. So are you saying that the adoption will be the adoption for natural gas regardless, and so your market share growth might actually slow because the adoption will just be based on this sort of niche, or are you saying the opposite saying, no, the market will grow and it will raise all boats including alternative fuels, so your growth rate would actually be faster. I'm not quite sure I understood your answer.\n\nDavid Johnson -- Chief Executive Officer\n\nYes. So I think there's two percentages, right? So there's -- what's the percentage growth of the marketplace? Is it going from – so if you think about Europe, is it going from 300,000 trucks a year to 400,000 trucks a year, 350 down to 250 what is that movement. And then there's the market share of our product in the market. And that to me is the more important growth factor.\n\nSo as we – so what's primary with secondary? And for us, what's primary is that movement of our market share in the market. So if you compare it, if you will, to like diesels right now or 97% of the market, 98% of the market, so if the market goes down by 10%, diesel volume goes down by 10%. In our case, it doesn't move that way because we're expecting and we've seen that our market share is growing dramatically. And so that's the more important effect.\n\nMac Whale -- Cormark Securities -- Analyst\n\nOK. OK. I have a bunch of other questions, but we will take it offline this afternoon. I have a call at 11.\n\nI have to jump on. So sorry, I was late in the queue, but hope we'll talk later. Thanks.\n\nDavid Johnson -- Chief Executive Officer\n\nOK. Thanks, Mac. Thanks so much.\n\nOperator\n\nThe next question is from Bill Peterson with JPMorgan. Please go ahead.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nThanks for taking my questions. I wanted to come back to hydrogen. I know you've done some work with TUPY AVL. I believe Cummins was supposed to happen this year.\n\nI just want to get an update on that one in particular. Do you still expect that? And I believe you talked about the potential fourth partner. Just trying to understand how the interest in hydrogen should play out with these specific partners?\n\nDavid Johnson -- Chief Executive Officer\n\nYeah. Good morning, Bill, thanks for your question. So it's right. We have these projects.\n\nWe have a project with Scania that we mentioned earlier in this call. We have a project with AVL and TUPY also working. That activity is actually taking place at AVL in Grz, Austria. We have work going on with Cummins that was announced as part of our announcement earlier this year on the share sale that we did.\n\nSo these projects are all running, and we'll look forward to sharing some information about them when our partners agree that's OK to do when we hit certain milestones and so forth. And we do expect to have new customers added to the queue as we work with customers around the world, including China, Europe and North America to demonstrate as we are doing with our demo vehicle. So all those are progressing, and we look forward to sharing updates when they're available and approved by our customers.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nOK. Thanks for that. And then secondly, on the cost side, specifically for opex, I guess how should we think about the opex trajectory for the remainder of the year, presumably probably bolting, but also you might get some -- who knows what's going to have the exchange rates. But just try to help us understand what you're doing on the cost side?\n\nRichard Orazietti -- Chief Financial Officer\n\nBill. I'm here Bill, I think we'd -- you'd estimate that we're going to be comparable going toward the back end of the year. In terms of opex, like the R&D, our program is expected to spend approximately about $30 million this year. And G&A it might be a little bit lighter.\n\nWe're investing more money for sure within business development. So sales and marketing is something that as we're getting the hydrogen truck on the road and more activity in terms of development in North America, but these are just small numbers. The bigger issue, Bill, was actually within our gross margins, and that's something that -- there's a -- we'll call it a mix change that's happening. I mean, what we can talk about on our call a little bit later, but we're looking for upside in our independent aftermarket.\n\nSo we should see margins improve there. Our OEM business is -- as we've talked about and I know it's been challenged by the higher CNG prices. And so there's a little bit of a mix change where we're seeing really great growth in India. That has a slightly lower margin, but very promising.With regards to our heavy-duty business, we're going to -- we'll see sort of flattish year-over-year growth is kind of where we're sort of estimating right now.\n\nAnd so I would say that margins will be more or less kind of what you saw in the second quarter. It might improve a little bit with regards to -- we had some additional warranty costs that were a little bit higher than normal, but that are being sort of a net by our engineering department.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nGood. Thank you. Good luck.\n\nRichard Orazietti -- Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nThis concludes the question-and-answer session. I would like to turn the conference back over to Mr. David Johnson for any closing remarks.\n\nDavid Johnson -- Chief Executive Officer\n\nYeah. Thanks, everyone, for your time and attention this morning in the grand scheme of things, I appreciate the chance to review our results with you feel guardedly optimistic in this really challenging time that we continue to deliver the product that the marketplace needs to both economically and environmentally improved transportation. There's work to be done ahead, and we look forward to reviewing with you in upcoming investor conferences. Thanks again for your time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAshley Nuell -- Senior Director of Investor Relations\n\nDavid Johnson -- Chief Executive Officer\n\nRichard Orazietti -- Chief Financial Officer\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nRob Brown -- Lake Street Capital Markets -- Analyst\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nJeff Rossetti -- Cowen and Company -- Analyst\n\nMac Whale -- Cormark Securities -- Analyst\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nMore WPRT analysis\n\nAll earnings call transcripts"
}