{
  "companyName": "Alto Ingredients, Inc.",
  "companyTicker": "ALTO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/alto-ingredients-inc-alto-q2-2022-earnings-call-tr/",
  "content": "Alto Ingredients, Inc. (ALTO 1.05%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Alto Ingredients' second quarter 2020 results conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Kirsten Chapman with LHA investor relations. Please go ahead.\n\nKirsten Chapman -- LHA Investor Relations\n\nThank you, Gary, and thank you all for joining us today for the Alto Ingredients' second quarter 2022 results conference call. On the call today are Mike Kandris, CEO, and Bryon McGregor, CFO. Alto Ingredients issued a press release after the market closed today, providing details of the company's quarterly results. The company also prepared a presentation for today's call that is available on the company's website at altoingredients.com.\n\nA telephone replay of today's call will be available through August 15, the details of which are included in today's press release. A webcast replay will also be available at the Alto Ingredients website. Please note that the information on this call speaks only as of today, August 8. You are advised that the time-sensitive information may no longer be accurate at the time of any replay.\n\nPlease refer to the company's safe harbor statement on slide two of the presentation available online, which states that some of the comments in the presentation constitute forward-looking statements and considerations that involve a number of risks and uncertainties. The actual future results of Alto Ingredients could differ materially from those statements. Factors that could cause or contribute to such differences include, but are not limited to, events, risks and other factors previously and from time to time disclosed in Alto Ingredients filings with the SEC. Except as required by applicable law, the company assumes no obligation to update any forward-looking statements.\n\nIn management's prepared remarks, non-GAAP measures will be referenced. Management uses these non-GAAP measures to monitor the financial performance of operations and believes these measures will assist investors in assessing the company's performance for the periods being reported. The company defines adjusted EBITDA as unaudited net income or loss attributed to Alto Ingredients before interest expense, interest income, provision or benefit of income taxes, asset impairments, loss on extinguishment of debt, acquisition-related expense, fair value adjustments and depreciation and amortization expense. To support the company's review of non-GAAP information later in this call, a reconciling table was included in today's press release.\n\nOn today's call, Mike Kandris will begin with some highlights and review the vision and quarterly activities. Bryon McGregor will then provide detail on our Q2 financial results, then Mike will wrap with a summary and open the call for Q&A. It's now my pleasure to introduce Mike Kandris, CEO. Mike, please go ahead.\n\nMIke Kandris -- Chief Executive Officer\n\nThank you, Kirsten. And thank you, everyone, for joining us today. Our diversification into specialty alcohols and essential ingredients continues to serve us well. As we continue to build for the future, our plan includes upgrading equipment and operating systems to increase efficiency and plant reliability, expanding our corn storage capacity, enhancing our specialty alcohol production and broadening its distribution and reinvesting in essential ingredients.\n\nIn short, these capital projects strengthen and improve our current asset base and will generate even greater profitability. Before I update you on our progress, I'll note we reported positive net income and adjusted EBITDA for the second quarter of 2022, which included $22.7 million in cash from the USDA's biofuel producer program. Bryon will review this and other financial information in more detail in a moment. I'll now review our efforts related to our long-term strategic plan.\n\nDuring this time of macroeconomic challenges, we are managing projects within our control. In the second quarter, with our improved liquidity, we accelerated the litany of repair and maintenance projects as well as several equipment upgrades throughout the portfolio. First, we recently purchased two new boilers for the Pekin campus. They will enhance our steam capabilities at both Pekin and ICP and increase the interconnectivity between the two facilities.\n\nWith the greater capacity of these state-of-the-art boilers, we will replace three of our old units. More reliable and efficient, our new system will have lower energy usage and costs, plus the additional redundancy will increase our control of energy access across the campus. Regarding our Eagle Alcohol acquisition, the break bulk, tote, and drum sales are in line with our expectations. Although currently, increased freight costs have resulted in some profit compression.\n\nThe integration is complete, and we have made progress against our plan to leverage Eagle's distribution to add totes and drums to Alto's offering. And through Eagle's relationships, we have expanded our customer base. We believe this will produce significant benefits for years to come. We have prioritized upgrading our specialty alcohol equipment at our Pekin wet mill.\n\nOver the years, many beverage customers have raised their quality standards. And with these upgrades, our equipment will be best-in-class and we will be able to meet the highest quality requirements and enable us to service additional beverage customers, further increasing the synergy of the Eagle transaction. In Idaho, we are on track with our essential ingredients expansion. This project consists of two phases.\n\nThe first, representing the further extraction of corn oil, and the second, the separation and production of enhanced protein. Construction of the corn oil extraction phase is now complete. Based on better-than-expected preliminary results, we intend to accelerate the installation of the corn oil extraction technology in our other dry mills. We remain on track with the second phase to commence high-protein production at Magic Valley in Burley 2023.\n\nAnd once the installation at Magic Valley is complete and operational, it will inform us how we roll the technology out to our other facilities. Also, we are expanding our corn storage at our Pekin facilities and expect to complete the project by mid-November. This will approximately double the number of days of storage at the site and meet our goal to have additional capacity in place before the holidays and winter weather. We have also made numerous additional upgrades at our facility.\n\nTo name a few, we have completed the upgrade and expansion of ICP's corn oil production, we have increased corn oil storage and railcar load-out capabilities across all locations, we have made logistics improvements at ICP, which included truck access to the plant at scale upgrades, and at the wet mill, we upgraded control systems at the front end of the process and rebuilt one of the two turbines. These projects are some examples of our commitment to upgrade our facilities to improve efficiency and reliability. We are also engaged in longer-term projects. Regarding our renewable natural gas project at Pekin, we are currently in our engineering and design phase with the goal of making an impact by the end of 2023.\n\nRegarding carbon capture and sequestration. The U.S. Senate's recent approval of the Inflation Reduction Act is very exciting and significantly improves our project economics, raising the carbon capture tax credit from $50 per metric ton to $85 per metric ton. As previously discussed, we produced approximately 700,000 metric tons of CO2 a year at our Pekin campus.\n\nThese facilities sit atop the Mount Simon formation, identified as one of the best and largest aquifers in the country for sequestration. To maximize the inherent value of our CO2, we have been actively pursuing numerous options, ranging from the development of a stand-alone project to the sale of the CO2 to one of the various pipelines currently under development in our area. Approval of this legislation will greatly clarify our strategy and options and will accelerate our decision and implementation of this important project. Before I turn the call over to Bryon, I'd like to welcome Gabby Gray as an independent director, who was recently elected to our board at our annual shareholder meeting.\n\nShe is a chemical engineer with fast experience in refining and has been advising the board for the past year regarding plant operations and optimization as well as process safety management. I'd also like to thank John Prince for his service and wish him the best in his retirement from the board. With that, Bryon, over to you for a review of the financials.\n\nBryon McGregor -- Chief Financial Officer\n\nThank you, Mike. I'll provide some additional color around our results and metrics for the second quarter of 2022. Net sales were $362 million, up from the $298 million in the second quarter of 2021. This increase is primarily due to the addition of our Idaho plant production and higher average sales price per gallon of renewable fuel, which largely reflects fuel and corn supply constraints that translated into higher ethanol prices.\n\nFor the quarter, while crush margins were positive, they did not reflect the full cost of delivered corn to our sites. In short, the improvement in board crush was largely offset by the rising corn basis. As such, our specialty alcohol and higher-value essential ingredient production contributed the majority of the quarter's gross profit. Alcohol sales were $275 million, and essential ingredient sales were $83 million.\n\nWe sold 77 million total production gallons. And the 17% increase from the second quarter of 2021 was partially offset by a reduction in third-party sales, reflecting our strategy to focus our marketing and trading efforts around core assets. Specialty alcohols contributed 26 million gallons, in line with our 2022 contracted volume of 90 million gallons. The 6% increase over second quarter 2021 reflects the expanded capacity as well as increased exports and industrial demand.\n\nCost of goods sold were $353 million versus $283 million in the second quarter of 2021. This reflects high corn basis, greater delivery costs and logistical and service disruptions. Notably, our freight cost significantly increased year over year and doubled sequentially. Also, we recorded $10 million of noncash unrealized gains on our forward derivative positions.\n\nThis was largely offset by a $10 million noncash lower of cost or market adjustment on ending inventories largely related to an unplanned power outage at our Pekin campus, resulting from a lightning strike to the local utility. SG&A expenses were $9 million compared to $7 million in the second quarter of 2021. This increase, which we expected, reflects expenses related to our Eagle alcohol acquisition and the associated accrual for future contingent payments. As Mike mentioned, during the quarter, we recorded income related to a $22.7 million cash grant from the USDA, which was part of the CARES Act to support companies that experienced renewable fuel losses related to the COVID-19 pandemic.\n\nWe are deploying the funds to support ongoing operations, including facility maintenance. And we have already accelerated some of our important infrastructure projects, as Mike previously mentioned. Net income available to common shareholders was $21.5 million or $0.29 per diluted share compared to $8 million or $0.11 per diluted share in the second quarter of 2021. Adjusted EBITDA was $29.9 million compared to $17 million in the second quarter of 2021.\n\nOur balance sheet is clean and strong with cash and cash equivalents totaling $57 million as of June 30, 2022 compared to $50.6 million at December 31, 2021. At June 30, 2022, our working capital was more than $178 million and over $125 million net of our outstanding $52 million revolving line of credit balance. This represents an improvement of over $16 million from December 31, 2021. Increases include the USDA grant, higher accounts receivable and inventory balances, which were offset by $15 million invested in Eagle alcohol and over $15 million in capital improvements and repair and maintenance expenses already incurred for the first six months of 2022.\n\nWe have no additional debt, and we expect to further strengthen our liquidity as we complete the renewal of our revolving line of credit in Q3. Looking ahead to third quarter, although forward crush margins remain positive, we are coming into a late harvest with high corn basis and low corn inventories. In anticipation, we have scheduled much of our fall maintenance and repairs in Q3 to reduce our related -- our relative use of corn and minimize the impact of short-term higher commodity prices. With that, I'll turn the call back to Mike.\n\nMIke Kandris -- Chief Executive Officer\n\nThanks, Bryon. In summary, only two years ago, in the second quarter of 2020, we began the Alto Ingredients' transformation to emphasize higher-margin products, specialty alcohols and essential ingredients. In this short time since April of 2020, we have generated significant financial benefits, yielding over $70 million in net income and $190 million in adjusted EBITDA, and more is on the horizon. With a strong balance sheet, we have accelerated critical infrastructure projects.\n\nThese projects continue our ongoing work to increase plant efficiency, reliability, redundancy and capacity. Blended with our efforts to extend our distribution and expand our relationships, we are improving our position to capture a variety of opportunities and drive profitable growth. Finally, I'd like to invite investors to meet with us at the H.C. Wainwright Conference in New York City in September.\n\nWith that, I'd like to open the call for questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question is from Shar Pourreza with Guggenheim.  Please go ahead.\n\nConstantine Lednev -- Guggenheim Partners -- Analyst\n\nHi. Good afternoon, team. It's actually Constantine here for Shar. I just wanted to start off with the kind of work that you're doing around the carbon capture storage.\n\nAnd obviously, the IRA that is kind of being contemplated is a big benefit. Just thinking about the threshold for an investment decision and potentially some of the timing around the engineering working partnerships that you have done if there's anything there.\n\nBryon McGregor -- Chief Financial Officer\n\nYeah. So as we said in our -- it's Bryon, as we mentioned in our prepared remarks and Mike mentioned, there is -- we're pursuing a number of different options concurrently and really just need to make a decision with regards to which way is the most beneficial for shareholders and for the company. There are certain advantages to going at it alone and building the plant and especially with regards to distance and pipeline. And at the same time, there's also risks that you absorb with that as compared to building with the pipeline and being able to allocate those risks on to a third party.\n\nso clearly, with this approved legislation, it certainly changes the economic dynamics, but also then makes it much more clear for us as to how we want and where we would potentially want to go with this. But be assured that we are very much cognizant of the importance of the timing and have been very active in this -- in our process, not only for the last -- particularly for the last six months, but I'd say over the last year. And we hope to move quickly in making a decision and moving forward and providing more clarity around that, understanding that if we were to go it on our own, it would also be important not to get out in front of some of the other work that needs to be done in laying the groundwork if you're going to be out trying to lay some pipeline, right, to not change the economics around that. So just ask everybody to be patient, and we look forward to being able to provide a lot more information in that regard.\n\nConstantine Lednev -- Guggenheim Partners -- Analyst\n\nExcellent. That's a lot of great detail. And maybe if you just have any commentary on kind of the engineering work that's been done at this point. Is there realized cost structure that you're contemplating in your planning? And how does that kind of relate with maybe some of the broader industry benchmarks that we've seen?\n\nBryon McGregor -- Chief Financial Officer\n\nYeah. I think they're very much similar. I would say that depending on which direction you're going, some of that work has been done. But I would say the long pull and intent at this point is largely your permitting and not necessarily your engineering and design.\n\nThere's a lot of work that has been done in that regard, and there's actually been a lot of field work that's been done as well as identifying locations and the like. So it's not as if we're the only party in that neighborhood. And indeed, there's a reason that the pipelines are coming by our location or near our location relatively for injection purposes.\n\nConstantine Lednev -- Guggenheim Partners -- Analyst\n\nOK. Excellent. And maybe a last one for me. In terms of just capital allocation more broadly, have your considerations changed given kind of the backdrop year-to-date between the IRA and of the commodity environment? Any changes maybe to the amount and timing of capital that you plan to deploy on cost efficiency versus kind of increasing protein and other product expansion?\n\nBryon McGregor -- Chief Financial Officer\n\nCertainly, yeah. And as Mike had indicated, there's a lot of projects that actually we haven't really numerated yet that we look forward to sharing more on, and those may actually have an impact as well as to what -- how we prioritize those projects. There are some that may actually have even a better return on investment than currently the ones that we've identified for you, and so we'll stage those appropriately to make sure that we're bringing the best and highest return to the fore and accelerating those projects. Does that help?\n\nConstantine Lednev -- Guggenheim Partners -- Analyst\n\nYes. I think so.\n\nBryon McGregor -- Chief Financial Officer\n\nYeah, I just do not mean to be obtuse, but the ideas as well is that we don't really want to talk about projects that haven't yet been approved or that may have some confidentiality associated with it. We wouldn't want to disclose before their time.\n\nConstantine Lednev -- Guggenheim Partners -- Analyst\n\nCertainly. And I appreciate that. Thanks for taking the questions.\n\nOperator\n\nThe next question is from Eric Stine with Craig-Hallum. Please go ahead.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nHey. So just going back to the carbon capture a little bit and putting aside the fact that you don't want to get in front of some capital projects that you might already have underway or getting closer. Is this more a decision between speed to market and that potentially the pipeline or at least the activity there and those that are being built are a little bit further along or greater economics? It just seems -- I don't know what the capex would be if you went stand-alone, I'd love to hear that, but it would seem like $50 million plus in EBITDA a year is pretty attractive to go at it alone unless there is a reason to go the other route.\n\nMIke Kandris -- Chief Executive Officer\n\nEric, I think the really good news is we have a lot of interest, a lot of options, a lot of folks we've been talking to. It is a critical decision for the company, both from a capital standpoint, future economics. And we really have been diligent in terms of trying to vet all the different options that we have out there. With this legislation and the potential change there, it greatly changes the economics of some of these options.\n\nAnd so, if everything goes as planned and it passes, it's certainly going to kind of shake up the -- some of the work that we've done up to this point. I kind of feel like we're fortunate. We are where we are. We haven't launched into one of the options that maybe would change with this legislation.\n\nSo I think we're going to be really, really thoughtful as we go through this. And you're right. It does take a lot of capital to go it on your own, but the economics are very compelling. So those are the kind of things we have to sort out, and we're working hard at it.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nOK. Yeah. I guess, I'll stay tuned on that. In terms of some of the strategic projects, operational initiatives, comparing what you've got in your deck with what you had last quarter, so it doesn't look like you've necessarily taken on additional projects.\n\nIt is more about acceleration. I guess, confirming, is that the case? And then I mean, should we look at that as, I think you laid out $50 million in incremental EBITDA as part of these projects. Should we just look at that as you've pulled that forward two quarters or something along those lines?\n\nMIke Kandris -- Chief Executive Officer\n\nI think that's right. Definitely, the projects that we have, particularly corn oil, is what I mentioned in the script. It definitely is giving great returns, and it's one that we've kind of shifted the phase one, phase two of the CoPromax. The economics are there.\n\nWe're very much looking at the project of generating the returns that we've talked about. But the corn oil part, we can accelerate that. So we're constantly looking at these projects, and it's a very dynamic situation. So given where we are as a company, we're going to take advantage of the things that give us the greater returns.\n\nAnd that's one example of a shift that we've made as opposed to rolling out CoPromax full on at all our locations, we're going to accelerate the corn oil portion, and then we'll look to when we complete the protein piece in Magic Valley. And I would add that we're already talking to potential customers in Magic Valley about what that would look like, and we're very optimistic about the returns where we will get on the protein side also. But we're constantly looking at what makes sense, where we need to go, how to deploy the capital. We want to be very prudent as we do that.\n\nAnd at the same time, other projects come up from time to time, and we need to evaluate them and where they stack up in the return profile. So it's an ongoing deal, and it's very dynamic.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nOK. Understood on that. And maybe last one for me, just more model-related. But you mentioned the turnarounds that you plan to do in the third quarter.\n\nI mean, any clarity on link or maybe it's an overall utilization rate you expect in the quarter would be helpful.\n\nBryon McGregor -- Chief Financial Officer\n\nYeah, I would expect that there would probably be -- well, it's difficult to say because we actually had a number of interruptions, as you say. If you look on the total production rate that we had as compared to capacity for the quarter, we were down a little bit quarter over quarter, railroad interruptions and all like, particularly for our Western plants. So if you look at the aggregate, it may be about the same, but we're trying to manage as best we can to make sure that we're taking advantage of these windows where you see cost increasing to be able to efficiently do your repairs and maintenance and scheduled outage before you move into the winter period. So we're glad we have that optionality and we expect that you'll see a moderation in basis and corn prices once we get into harvest.\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question is from Amit Dayal with H.C. Wainwright. Please go ahead.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nThank you. Good afternoon, everyone. With respect to the alcohol distribution business, I know you commented a little bit that you are seeing some freight cost related impacts on margins in that business. But there's talk about potential recession, etc.\n\nCan you give us any sense how you're positioned for that type of market environment for this segment?\n\nMIke Kandris -- Chief Executive Officer\n\nYeah. we've said before, the Eagle acquisition really had multiple layers to it. There's the base business in St. Louis, what they currently were doing.\n\nThat business was a $30-plus million business with about $4 million of EBITDA during the integration and with some of the freight logistics. There's been some pressure on that, but we're fully now that the integration is behind us. We're fully expecting to have that piece of the acquisition, continue to generate good performance. But the other parts of the acquisition are equally or maybe even more important, and that is adding vertical integration with totes and drums for our Alto business and expanding that capability and not just be in a position where you provide bulk product.\n\nWe now have the option to do totes and drugs. We will also look to expand that distribution business. We think it's a good business, and we -- the expansion could be within Alto, but it could also be taking the Eagle platform and expanding that geographically. And then, the last piece of that acquisition really is around using the relationships that Eagle has built over the years to enhance our sales into the beverage space with specialty alcohol and just generally grow Alto business with the relationships the Eagle folks have.\n\nSo it's kind of a multifaceted acquisition. It isn't just buying the St. Louis distribution.\n\nBryon McGregor -- Chief Financial Officer\n\nWhat I'd add to that a bit, Amit, as well is that freight impact, the compression that we've seen ultimately will adjust itself, right? I mean, as you go into new contractors on negotiations, you make sure you make the appropriate adjustments for that. well, you may not have the flexibility in the given year under a one-year contract, you certainly make sure adjusting true-up in the renewal periods.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nRight. And does that brand also potentially play out for the ethanol sales as well? I mean, your thoughts around those types of drivers come out faster than what you're seeing for the forward crush margins. Could we see some upside maybe toward the end of the year?\n\nBryon McGregor -- Chief Financial Officer\n\nI don't know if you see it -- yeah, I mean, sorry, I don't know that you would see it at the end of the year, but you would certainly see as we go into contracted negotiations or contract negotiations in the fourth quarter because of the late harvest. For our specialty alcohols, you would be making the appropriate adjustments, where this -- when you've got fixed price contracts, it's unusual to have freight adjustments. So you have to work your way through that and you make your -- as you enter those new fall negotiations for 2023, you make the appropriate adjustments for your input costs.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nOK. And then, I think Bryon, you mentioned some planned shutdown in the third quarter. How long will this be for? A week or two?\n\nBryon McGregor -- Chief Financial Officer\n\nYeah, I don't know that it would be a week, but some of the call it, two, three, four days in a couple of the plants. It does not actually include the wet mill this year. The wet mill will be done about -- we did the last -- I guess, it was last August that we did the wet mill, so you probably got somewhere between another nine months to a year before we bring down the wet mill. And that, by far, is that's the most significant impact because of the continuous fermentation and all of the associated services and production around that that has a material shutdown of some or an impact of probably one to two weeks\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nThat's all I have. I'll take my questions offline. Thank you.\n\nOperator\n\n[Operator instructions] The next question is from David Bastian with Kingdom Capital Advisors. Please go ahead.\n\nDavid Bastian -- Kingdom Capital Advisors -- Analyst\n\nHi, Mike. Hi, Byron. Good afternoon. First question is on the -- on the specialty alcohol, you provided a guidance for the 90 million gallons of contracting this year.\n\nAre we going to get guidance on gross profit there like we did last year?\n\nBryon McGregor -- Chief Financial Officer\n\nI guess, I'd say is we haven't been able to give it so far, and it's a good question. It's certainly something that we've tried to tackle. I don't know that it would give you much comfort. By the end of Q3, we can give you.\n\nQ4, but we'll give you as much guidance as we can and visibility as we can as long as we can, but we're not able to give you that guidance for this quarter.\n\nDavid Bastian -- Kingdom Capital Advisors -- Analyst\n\nOK. Could you maybe give some commentary on how the specialty market is looking both for the remainder of this year and as you start looking toward contracting this fall for 2023?\n\nBryon McGregor -- Chief Financial Officer\n\nI would say that nothing has really changed. We're on track. As we mentioned in our prepared remarks, we're certainly on track with the contracted volume. Indeed, we expect to sell in excess of what we had indicated to you and the Street.\n\nWe indicated 90 million gallons, and we're on track to sell in excess of that. We're seeing a pickup in industrial and export sales as well. And we would expect in 2023 to be able to place more product and hopefully be able to upgrade and upmarket those products, particularly as we -- as Mike mentioned in his prepared remarks around raising the quality of product at our wet mill to achieve the highest quality products available, and we hope to have that completed at the end of Q3 to be available. While we wouldn't expect to place all that product, we would certainly expect to be able to place more of that product year over year into a higher-value market.\n\nDavid Bastian -- Kingdom Capital Advisors -- Analyst\n\nGot it. That's good to hear. Switching gears to the protein upgrades. You've mentioned the 9 million uplift for '23.\n\nIf you're going to get an extra 9 million or so gallons of corn in Magic Valley, at current prices, that would be, what, almost a 9 million contribution on its own. So are you seeing a lot of that 25 million you're hoping for them getting accelerated as a result of accelerating the corn oil to other sites?\n\nMIke Kandris -- Chief Executive Officer\n\nI think that's a fair comment, David. And quite frankly, the preliminary results that we're seeing coming out of Magic Valley are very impressive, and I think that's led to our decision to take phase one and accelerate it across the platform. The numbers again, they're preliminary. The system was just completed, but we're very optimistic about where we can go with it.\n\nBryon McGregor -- Chief Financial Officer\n\nIndeed, we're actually even seeing with the corn oil part of the system that we're seeing significant good results with regards to the protein, so we're excited about that even for having the protein facility in place.\n\nMIke Kandris -- Chief Executive Officer\n\nYes, fully installed.\n\nDavid Bastian -- Kingdom Capital Advisors -- Analyst\n\nGreat. That's awesome to hear. Thank you. That's all for me.\n\nMIke Kandris -- Chief Executive Officer\n\nThanks, Dave.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to CEO, Mike Kandris, for any closing remarks.\n\nMIke Kandris -- Chief Executive Officer\n\nThank you, Gary. Thank you, again, for joining us today and for your continued support. We feel very good about the future, the direction of the company. And again, we want to thank you for your continued support, and have a good afternoon.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKirsten Chapman -- LHA Investor Relations\n\nMIke Kandris -- Chief Executive Officer\n\nBryon McGregor -- Chief Financial Officer\n\nConstantine Lednev -- Guggenheim Partners -- Analyst\n\nEric Stine -- Craig-Hallum Capital Group -- Analyst\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nDavid Bastian -- Kingdom Capital Advisors -- Analyst\n\nMore ALTO analysis\n\nAll earnings call transcripts"
}