{
  "companyName": "Bentley Systems, Incorporated",
  "companyTicker": "BSY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/bentley-systems-incorporated-bsy-q2-2022-earnings/",
  "content": "Bentley Systems, Incorporated (BSY -0.38%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:15 a.m. ET\n\nMichael Fischette\n\nGood morning, everyone, and thank you for joining us for Bentley Systems' Q2 '22 operating results webcast. I am Michael Fischette, Bentley's vice president, deputy general counsel. On the webcast today, we have Bentley Systems' chief executive officer, Greg Bentley; Chief Financial Officer Werner Andre; Chief Operating Officer Nicholas Cumins; and Chief Investment Officer David Hollister. Before we begin, allow me to provide a disclaimer regarding forward-looking statements.\n\nThis webcast, including the question-and-answer portion of the webcast, may include forward-looking statements related to the expected future results for our company and are therefore forward-looking statements. Our actual results may differ materially from our projections due to a number of risks and uncertainties. The risks and uncertainties that forward-looking statements are subject to are described in our operating results release and other SEC filings. Today's remarks will also in references to non-GAAP financial measures.\n\nAdditional information, including reconciliation between non-GAAP financial information to the GAAP financial information is provided in the press release and supplemental slide presentation. The webcast will be available for replay on the Bentley Systems' Investor Relations website at investors.bentley.com. After the presentation, we will conclude with Q&A. With that, let me introduce the CEO of Bentley Systems, Greg Bentley.\n\nGreg Bentley -- Chief Executive Officer\n\nGood morning, as the case may be. Thanks to each of you for your interest and our operating results presentation will follow the usual sequence starting with the tone of our business. As we announced today, I'm pleased to say that '22 Q2 proved to be a straightforward and quite satisfactory quarter, tracking toward our annual financial outlook subject to ongoing FX volatility. And notwithstanding arbitrary FX impacts on reported revenues, our intrinsic natural hedge improved by the inclusion of Seequent substantially protects our operating margins.\n\n'22 Q2 was characterized by substantial alleviation of the particular disruption, which did affect us in '22 Q1, the regional geopolitical drama, although '22 Q2 brings about a conclusion to our business in Russia, this also concludes the uncertainty about prospects there. And as to what I think was related counter globalism, which manifested in attrition in China, this fortunately appears to have been a shock confined to '22 Q1 although there should still be concerned about bilateral trade and/or investment impediments from the Chinese and/or U.S. governments. Although Northern Europe's new business declined during the quarter, new business in Central Europe and Southern Europe rebounded sequentially and year over year.\n\nDrilling below these headlines, Chief Operating Officer Nicholas Cumins will follow me as usual, to break down our business performance, where notable by region and by product domain. Chief Financial Officer, Werner Andre, will cover all of our metrics, but I here focus on what we and I think most of you regard as our key performance indicator. Net of absorbing the remaining 0.5% of ARR lost in '22 Q2 due to our Russia exit, constant currency ARR growth was 11.5%, plus 2.5% from power line systems year over year. Platform acquisition Seequent was included a year ago.\n\nI spoke last quarter about, and will be highlighting further today, the intrinsic economic resilience of infrastructure engineering generally, which our first half business performance reflects. But beyond that, these platform acquisitions of Seequent for environmental opportunities and of power line systems for grid opportunities are flourishing at the convergence of the major global priorities for infrastructure investment, digital advancement and climate and energy resilience and are adding to our momentum for the balance of this year. All considered and despite prevailing macroeconomic worries, our current view of 2022 business performance has not materially changed from our annual financial outlook, which, as I explained last quarter, we do not undertake to revise quarterly merely to incorporate inevitable FX fluctuations. Sequentially, year-over-year ARR growth reflects the detrimental impacts of Russia and of some denominator math that Werner will explain.\n\nNet revenue retention for the trailing year also in constant currency hasn't yet been so impacted by Russia and rebounded to 109% in '22 Q2. The evident lagging relationship between ARR and NRR will be disrupted by Russia, where any and all subscription revenue is now, by definition, nonrecurring, not an ARR, but the revenue impact is spread out. ARR is otherwise higher than NRR by virtue of our new business in new logos, which in 2022, Q2 continued to contribute 3% in ARR growth thanks largely to Virtuosity, which I described as one of our incremental initiatives for the 2020s. Virtuosity's encouraging ARR growth continued, seasonalized as here, with indeed the majority of its new business generated like last quarter from over 600 further new names, mainly in SMB.\n\nThe other major initiative for the 2020s, our user success organization has focused to start with on the enterprise majority of our business and is generating very worthwhile returns. Here, we continue to expand at a deliberate pace, the proportion of accounts under our E365 program. We started E365 upgrades generally with our largest accounts, and are working our way down as a greater number of accounts upgrading to E365 each quarter. The ARR growth, which occurs at the time of such upgrades, which are priced to generally cover our enterprise success services cost, is a small fraction of our overall E365 ARR growth.\n\nEspecially with the EPC firms within E365, finally, expanding consumption in 2022, accretion in E365 accounts fostered by our myriad of enterprise success services delivered by engineering experts for new going digital workflows is being achieved at a gratifying multiple of the accretion rate in all other accounts. E365 accretion now makes up the substantial majority of BSY's ARR growth. Now we've consistently been reporting on tone of business by infrastructure sector. Since pandemic began, we have focused on application usage comparisons to pre-2020 so that the signal of underlying directions wouldn't be swamped by the noise of pandemic volatility from quarter to quarter.\n\nBut now that 2022 has been substantially post pandemic, I think it's appropriate in my color commentary to henceforth resume distinguishing the tone of business across sectors in terms of our ongoing productivity and generating new business productivity within each, relative to their current proportion of our ARR shown here. At the same time, we've refined the sector definitions primarily to usefully separate resources in industrial. Given now an industrial sector in its own right, discrete manufacturing plants have been newly reclassified there from commercial facilities. This sector, commercial facilities is the smallest for us including in the current relative productivity of new business generation.\n\nWith some renewable energy and environmental accounts and products having been likewise reclassified to the newly distinct resource sector, public works and utilities new business continues its enduring relative resilience for reasons that I emphasized last quarter. With Seequent now consolidated in our year-over-year comparisons, its major focus on mining and the subsurface environment makes it worthwhile to distinguish between, respectively, resources and industrial infrastructure sectors with quite different tone of business dynamics for one versus the other, for instance, at present. Besides mining, resources includes oil and gas upstream activities, all offshore structures, pipelines, and renewables, including geothermal as well as wind and solar. It is gratifying to show here that with Seequent's inclusion and corresponding to consensus EDSDG priorities, the resources sector is setting the pace in terms of our relative new business productivity.\n\nThe industrial infrastructure sector captures all process plants, including most oil and gas downstream assets. And here, we can report that last quarter's incipient upward inflection in new business continues, including for EPCs, which are benefiting from the capex response to urgent new priorities for energy security and self-sufficiency in major economies. To be clear, despite the right directional momentum, the industrial infrastructure sectors usage is still far from pre-2020 levels. But it is now the case that finally, the tone of business is positive sequentially across all infrastructure sectors.\n\nAnd in at least all sectors other than commercial facilities, the protected nature of project cycles confer relative confidence and continued resilience for the foreseeable future. Speaking of business confidence, this survey last quarter by Dodge Engineering News Record, showed civil engineering firms reporting unprecedented, so far as I know, levels of backlog. But this quarter's update, now civil engineering firms consider their current backlog to be 135% of what they consider ideal, reinforces our observations at BSY. Engineering firms are certainly of necessity placing greater priority on going digital in the face of engineering hiring constraints compounded by retirements that are expected, if anything, to intensify.\n\nHowever, we are glad there is a source for more insights into the influence on infrastructure engineering decision-makers of potentially threatening macro conditions that seem to hover in prospect now. Last month's report from a quarterly survey by the American Council of engineering companies, which you can access directly at the link here, and though not specific to only its civil firm members and while also U.S.-centric, provides data that is quite on point for that purpose. The surveys so entitled Tabulation of Current Economic Survey versus Last Quarter indeed shows that perhaps, as in the rest of the world, the engineering firms' confidence about the U.S. economy, which wasn't particularly high to start with, has declined compared to the previous two quarters.\n\nBut their enthusiasm about their engineering and design services industry, which was and is at levels of sentiment comparatively much higher, and I suspect higher than almost ever, has been encouragingly sustained over that same period. And responding about their own firms, they express even greater confidence. Now in full disclosure, when asked about their sentiment as to projected conditions a year from now, their enthusiasm is more subdued, but still strong. Note that the surveys scale provides for negative numbers for various sentiment as seen here for the overall economy, but not seen here for their industry, let alone for the respondents' owned firms.\n\nI think it's especially meaningful that the great majority of respondents, those to the right of the vertical line, expect their presumably already outsized backlogs to increase measurably over the same coming year. Moreover, here providing a fully informed response to a question we are often asked during this same coming year in the U.S., the great majority of firms expect a relatively imminent increase in projects related to the Infrastructure Investment and Jobs Act. And while the survey shows that engineering firms are more concerned about inflation than in previous quarters, the larger firms have almost all protected themselves with escalation clauses in their long-term contracts and this is especially prevalent in civil infrastructure engineering contracting. Where I suppose all these reasons, bringing this together across infrastructure sectors, the most positive sentiment seems to generally correspond to BSY's civil engineering firm footprint in resources, in public work facilities and in industrial with commercial facilities as expected, reflecting less enthusiastic sentiment.\n\nIndeed, in presenting and assessing BSY's tone of business, it is certainly relevant to consider the sentiment of these engineering firms in this case in the U.S. In aggregate, their usage of our software corresponds rather closely to this familiar breakdown of our ARR by end market infrastructure sector. Literally, most infrastructure engineering work is done by the owner-operators supply chains. That is these contracting firms who thus, together account for the slight majority of our ARR.\n\nRecall that as of the beginning of this year, just the engineering news record top design firms contributed this substantial portion of our overall run rate and historical growth. It would be interesting to know whether as investors and analysts, you may be familiar with these top design firms globally that are also publicly traded and which together constitute most of our largest accounts. Perhaps surprisingly, until now, we have not had a senior leader focused on engineering firms to make the case for BSY's affinity with them and vice versa, given our comprehensive portfolio and our ability and intention to fully address their challenges and opportunities. But we have had the perfect candidate.\n\nClaire Rutkowski joined BSY as our chief information officer, six-plus years ago, having spent her career previously rising to the CIO role at a top engineering firm. Since then, she has incrementally served beyond her day job as our external CIO champion, a liaison to her former peers as engineering firm CIOs, an important constituency of decision-makers for us. I'm pleased to announce that Claire will now make this her full-time mission expanding our industry solutions group, which until now has been dedicated only to owner operators in our end markets to lead our offerings and advocacy for engineering firms globally. I've asked Claire to supplement the engineering firm facts and figures we just reviewed with her informed firsthand assessment of their tone of business.\n\nNicholas will then follow with his operations review of notable regions and products in the quarter. Claire?\n\nClaire Rutkowski -- Chief Information Officer\n\nThanks, Greg. It's an exciting time to be involved in infrastructure and an even better time to be engaged with our engineering accounts. I started out in technology and quickly migrated to engineering. Over time, I rose to be the CIO of what is now one of the top engineering firms in the world.\n\nI'm passionate about helping the industry as a whole advance, which is one of the reasons why I'm so thrilled to Bentley's CIO champion and engineering advocate. There are so many ways we can improve and move forward and now is the time. Engineering and construction firms are risk averse. They need to be.\n\nQuality is of the utmost concern when designing an asset and safety is paramount when constructing or operating that asset. If something goes wrong, people can get hurt. Going digital may once have been seen as challenging the priorities of quality and safety. However, technology has advanced to the point that engineering firms are now prioritizing going digital to enhance quality and safety, along with environmental resilience and sustainability.\n\nAfter all, why have people hanging from ropes to inspect bridges and dams when one can use a drone. In parallel, the AEC industry has crossed an important tipping point, which will enable them to advance their going digital ambitions even faster. Because most firms traditionally build through time and materials or cost-plus mechanisms, adding efficiency through automation or component-based design could arguably reduce revenue, not ideal. However, recent industry surveys show firms taking advantage of lump sum and fixed fee opportunities, which provide direct incentives to accelerate going digital.\n\nAnd there's more good news. As the data Greg presents shows, backlog is up. Depending on the survey being used, it's anywhere from 10 to 15 months on average. While firms have traditionally grown through recruiting more engineers, that's now at diminishing returns.\n\nSo CEOs are necessarily putting a high priority on going digital to take advantage of increasing their work without increasing their workforce. The pandemic forced engineering firms to accelerate going digital. They had no choice to facilitate virtualizing their talent, often through our project-wise offerings. This proved to all firms that they can compete for infrastructure engineering projects anywhere in the world and recruit everywhere.\n\nNot only do engineering firms want to use the most efficient and effective ways to design, procure and construct but they also want to transform their traditional offerings. Why simply deliver a design for an asset when you can deliver a digital twin of it as well, one that is full of all the engineering information needed to effectively construct and operate that asset. And why not extend that even further by offering to manage the operation and maintenance of the digital twin, ensuring it remains evergreen. Lots of opportunities are opening up for our engineering accounts.\n\nFirms are competing to create new offerings, which include full asset life cycle management, providing consulting services, which deliver data insights and analytics, corrective actions and recommendations and so on. Engineering is progressively shifting from a design-driven focus to a data-driven focus and the possibilities are endless. 62% of the 292 entries in our going digital awards last year and 74% of the winners were submitted by engineering firms. We have received even more and more amazing entries for the year-end infrastructure 2022.\n\nWe will be inviting you to join in person in London on November 14 and 15. I look forward to meeting you there. I'd now like to turn this over to Nicholas Cumins, our chief operating officer, to discuss his perspectives on the quarter.\n\nNicholas Cumins -- Chief Operating Officer\n\nThank you, Claire. Let me provide additional color commentary from an operational perspective, starting with regions. In every region, we're as busy as ever. Macro conditions for infrastructure engineering are favorable and there are good tailwinds.\n\nIndia, Southeast Asia, Middle East turned out. India, in particular, continues to accelerate. We have strong momentum with engineering and construction firms, and industrial and resources are up year over year. In our Q1 call, we noted some difficult market conditions in Europe.\n\nAnd I'm pleased to report that new business growth picked up the pace in Southern and Central Europe specifically with Northern Europe still somewhat lagging. As Greg mentioned, in Q2, we made the decision to exit Russia. I would like to acknowledge the contribution of our former colleagues who have developed a thriving business there. Of course, following the decision, we moved to wind down business in the region.\n\nAll of the regions performed in line with expectations. Pipelines are strong across the business and continue to grow. Construction firms have healthy backlogs, pressure is still on projects to deliver, and firms continue to invest in technology to address efficiency opportunities. Money is flowing and firms are prime for software to add more efficiency, improve their workflows, enabling them to do more with less.\n\nNow I would like to share some color regarding products, highlight the strong performance. As you probably know, most digital twin start with capturing the asset condition of the project site via photogrammetry or LiDAR taken with drones or UAVs. We have one of the industry's leading products that accomplishes this called Context Capture. It has the potential to transform inspections and safety reviews beyond traditional methods to establish virtual or even autonomous inspections, gather much more detailed information, which can be processed using machine learning techniques and present data in an iterative manner.\n\nA great example of this in action is the Diablo dam project undertaken by HDR for Care City, taking a more thorough understanding of the aging dam's current conditions. We are seeing more and more use of Context Captures by firms, in public works and utilities, and more and more interest from software and technology providers to incorporate our capabilities into their offerings. Bringing the focus back to Q2, out of pipe and sacks were also strong performers. The drivers of the recovery in oil and gas and the prioritization of energy security, particularly in Europe.\n\nIncreased funding is enabling all the operators to address some of their maintenance backlog, which they had previously deferred. And we are seeing some engineering services firms win some big contracts for both brownfield and greenfield oil and gas projects. The second part of the story is about renewables. We saw increased consumption relating to offshore wind power, notably in China.\n\nAnd we're also seeing a renewed interest in extending the life of nuclear infrastructure. We have two of only a few products worldwide that are certified for nuclear that are audited in a special program and adhere to international standards. Another strong performance in Q2 was plant site, or digital twin solution for process industries develop and core filled with Siemens. Advances in the capabilities of plant site are driving adoption and increased consumption, particularly in oil and gas.\n\nNow it is possible to visualize and group a significantly large number of models, combining the subsurface, the subsea and the top site so that operators can do multiple assets, indeed the entirety of an oil field in a single view. The final thing I want to highlight today is the standardization by the Texas Department of Transportation on our bridge design product, open bridge across its extensive supply chain. Texas DOT manages the largest highway system in the U.S. with more than 80,000 miles of highway, or more than 3x the circumference of the earth.\n\nRather than only using traditional 2D plan sets in construction, Texas DOT is moving toward using 3D models created through Open Bridge. Bentley is proud to partner with Texas DOT to advance infrastructure for the state of Texas. I've highlighted a few products, but I believe strongly that the formula for growth is innovation times adoption. And what is driving adoption and therefore, growth is our commitment to our users to deliver successful outcomes.\n\nAnd I would like to recognize the essential role that our user success organization is playing in our growth. Back to you, Greg.\n\nGreg Bentley -- Chief Executive Officer\n\nThank you, Nicholas. Our particular corporate developments for '22 Q2 will all be covered by Chief Investment Officer David Hollister. Transactions he will report on include a divestment that has taken the form of a promising minority investment. Generally, as the emerging digital twin ecosystem gradually comes into a closer focus, we get involved in related endeavors that depend on our applications.\n\nA case in point is our data vending business Streetlytics. It was spawned by our Cube mobility modeling logic, which was then acquired with Cube by BSY. I regard data vending businesses as being too far afield from our mainstream software and cloud services comfort zone. But we don't object to having an investment stake, particularly when, as in this case, our infrastructure modeling and simulation applications create demand for such data.\n\nDavid, please bring us up-to-date across these various investment aspects, including some smallish recent programmatic acquisitions, and then please introduce Chief Financial Officer Werner Andre. Thanks.\n\nDavid Hollister -- Chief Investment Officer\n\nThank you, Greg. I'll provide a little more detail on the Streetlytics transaction first and then give a brief update on other BSY investments activities, including a couple of recent programmatic acquisitions. As for our transaction with Teralytics, as Greg mentioned, late last month, we closed on the merger of our Streetlytics mobility data business with Teralytics. We originally acquired Streetlytics as part of our acquisition of Citi Labs in 2019, which primarily brought us the Cube open modeling and simulation solutions used to analyze the effects of new projects and policies on city transportation networks.\n\nToday, our solutions for mobility, modeling and simulation include not just Cube, but also our inroad software solutions for advanced traffic and vehicle simulation as well as Legion for passenger and pedestrian simulation and open roads for comprehensive roadway and civil design. Together, these solutions enable modeling, simulation and delivery of comprehensive mobility digital twins of multimodal transportation systems at urban, metropolitan, regional and national scales. Obviously, modeling and simulation requires a real-time data set. And the more robust that data set, the more credible and useful are in simulations.\n\nAs further evidence of the importance of robust data needed to design and optimize tomorrow's digital cities, I refer you to the Jacobs acquisition earlier this year of Streetlight data. A key reason for our Streetlytics and its merger with Teralytics is enhanced data and improved modeling logic of Qube, which is applied to complete and improve the quality of the street segment traffic data. From a financial perspective, we believe the transaction unlocks unrealized Streetlytics value in the form of our ongoing equity interest in Teralytics and will be net revenue additive to Bentley Systems via the more robust data to be sourced from Teralytics and included and monetized with the Bentley Systems modeling and simulation solutions I just mentioned. You'll recall, our iTwin Ventures corporate venture capital fund was formed to stimulate and encourage entrepreneurialism in developing digital twin applications, including those leveraging our iTwin platform.\n\nSince I last presented this slide, we've added three new investments to our portfolio of growth stage businesses and the opportunity pipeline of early stage companies working toward infrastructure digital twins continues to grow. As for the more mature operating businesses, our grid opportunities continue to pick up momentum. And as Greg mentioned, Power Line Systems and SPIDA continued to perform well and exceed our initial expectations for both growth in revenue and margin performance. Last week, we announced that Cohesive had acquired Maxim icon, which is based in Brazil and adds talent to our team, improve service delivery cost efficiency and establishes an entry point for future cohesive growth in South America.\n\nAs we've shared, Cohesive is a digital integrator business providing digital strategy advisory services, integration services, systems deployment services and operating support to help our clients achieve their business outcomes, significantly enabled by emerging digital twin technologies. Cohesive is now the culmination over the last two years of six acquisitions, together with Bentley's existing professional services businesses supporting infrastructure owners. This unprecedented integration has been challenging, including talent attrition and other distractions to maintain a consistent pipeline and efficient service delivery. All are now coming together, including a well-defined cohesive branding and I encourage you to learn more about what we do at Cohesive.\n\nJust about a year ago, we completed the acquisitions of Sense Metrix and Vista Data Vision to establish a foothold with infrastructure IoT. We've now just announced that we also closed on the acquisition of Australia-based Eagle IO in addition to extending our IoT reach to ANZ. It's additive and very well complements our existing infrastructure IoT technology stack. Eagle IO also brings strong talent and expertise to our team, which we absolutely need and want for our infrastructure IoT business growing at about a 30% clip.\n\nEagle IO is also a particularly relevant and prominent solution for environmental compliance, further bolstering our ESDG priorities. As I explained during our operating results call earlier this year, we still operate our IoT business as part of our BSY investments acceleration portfolio. Our reasons for doing this are to accelerate and indoctrinate both the technology and the commercials into our business on a number of dimensions. First, you heard Greg and Claire speak about engineering firms and their importance as we grow our product portfolio.\n\nA priority for us was to introduce infrastructure IoT offerings to them, the engineering firms, seeking to deliver the value of infrastructure IoT insights for the benefit of their own clients. We've done that, including institutionalizing it into our business and commercial models. As I mentioned, it's growing at a respectable pace. Next, we'll establish a structured IoT platform layer to accommodate this operating technology within digital twins.\n\nWe're a platform company. And the goal is to embed this structure and capability thoughtfully as part of the iTwin platform. We call this the sensor data service to the iTwin platform and development is well underway. Further infrastructure IoT offerings, we're advancing as we incubate this within our acceleration team are the development of plug-and-play asset-specific monitoring solutions that are fit for purpose for owners of specific asset types.\n\nSuch applications include bridges, dams, mines and grids. As we've explained, a comprehensive infrastructure digital twin will bring together the ET, the IT and critically the OT, with the OT arriving via increasingly pervasive infrastructure IoT technologies. Our IoT solutions are being positioned as the industry standard for infrastructure IoT and the value it brings to digital twins. On a final note, last quarter, we highlighted a new project-wise focused joint venture in China.\n\nWe continue to work on necessary product modifications and go-to-market planning. It's unlikely this venture generates material revenue in 2022. More ventures are being considered and negotiated and we hope to have further announcements on that later this year. And now over to Werner for more details on our operating results.\n\nWerner Andre -- Chief Financial Officer\n\nThank you, David. Our second quarter was strong, and we are very pleased with the performance and resilience of our business across products and regions. Total revenues for the second quarter were $268 million, and grew 20% over the prior year, or 26% on a constant currency basis. For the first half of 2022, total revenues grew 22%, or 27% on a constant currency basis.\n\nOn a constant currency basis, our Q2 revenues grew 29% in Americas, 21% in EMEA and 28% in APAC. Most of that growth comes from subscriptions, representing 87% of our revenues and growing by approximately 31% on a constant currency basis. This growth is supported by our business performance across products and regions and our platform acquisitions of Seequent and Power Line Systems, including their meaningful post-acquisition growth. The growth of our E365 program and consumption growth within our E365 accounts as well as the continued growth momentum of our Virtuosity subscriptions are solid contributors to our business performance.\n\nThe recent strengthening of the U.S. dollar resulted in significant year-over-year currency headwinds, reducing GAAP revenues at actual currencies. Relative to the foreign exchange rates assumed in our 2022 annual financial outlook, FX headwinds dragged down our GAAP revenues for the quarter by approximately $7 million. To further quantify the impact of the U.S.\n\ndollar strengthening on our annual financial outlook, if current exchange rates will prevail for the remainder of the year, our full year GAAP revenues would be negatively impacted by approximately $25 million relative to the revenues based on exchange rates in effect when we determine our full year 2022 outlook at the beginning of this year. Our business is otherwise robust, even net of fully exiting Russia. The FX impact on our revenues is significantly mitigated by our natural hedge and hence, the impact to our profitability is minimized. I'll talk about that in a moment.\n\nMoving on to recurring revenue performance. Our last 12 months recurring revenues increased by 25% and are representing 88% of total revenues. Our platform acquisition of Seequent and Power Line Systems and their post-acquisition growth contributed about 16 percentage points of this improvement. Our account retention rate remains at 98% and our constant currency recurring revenue net retention rate, which is a key measure of our success, including recurring revenues with our existing accounts rebounded to 109%, as we expected in line with higher ARR growth rates over the past four quarters and our accounts being as busy as ever.\n\nOur constant currency ARR growth rate is 14% year over year, which is a combination of 11.5% from business performance and 2.5% from the onboarding of PLS in Q1. For the first time, the ARR growth from the onboarding of Seequent in June 2021 is not in the year-over-year growth, but rather than the year-over-year comparative basis. This higher denominator now reduces our indicated ARR growth rate from business performance by approximately 1% when compared to Q1. Our ARR growth rate has also been impacted by about 1% as a result of exiting Russia.\n\nAs we announced in our Q1 remarks, we rolled down half of our ARR in Russia during Q1 based on an expected reduction in business recurrence at that time. And we have now written down the second half of this 1% in Q2. Our GAAP operating income was $55.7 million for '22 Q2, up $22.5 million from last year. Our GAAP results for the quarter and year to date reflect charges for acquisition-related costs related to PLS in 2022 and Seequent in 2021.\n\nIncremental amortization from purchase intangibles and incremental noncash stock-based compensation, partly offset by mark-to-market valuation gains from the revaluation of our deferred compensation plan liabilities. On the right, our adjusted EBITDA metric normalizes for such accounting. Our second quarter adjusted EBITDA grew by 25% and our year-to-date adjusted EBITDA of $184 million is an improvement of 21%. Our year-to-date adjusted EBITDA margin is 33.9%.\n\nAnd we are fully on track to deliver on our 33% adjusted EBITDA margin target for 2022. And while our adjusted EBITDA in absolute terms is, of course, impacted by currency movements, the FX impact on our margin target is significantly mitigated given our natural hedge, which has now become more effective with the inclusion of New Zealand-based Seequent, those invoices are primarily denominated in U.S. dollar. I'd also like to comment on our income tax rate, which appears as negative 9% for the second quarter.\n\nAs in the first quarter, our tax rate benefited from significant discrete mean for tax benefits primarily associated with the timing of distribution from our deferred compensation plan. For the full year, we continue to expect an income tax rate closer to 15%. Moving on to liquidity. Our first half 2022 GAAP operating cash flows of $169 million remains strong, representing a cash conversion ratio from adjusted EBITDA of 92%, even after payment of acquisition-related expenses of $13 million.\n\nOur last 12 months operating cash flow of $308 million represents a cash conversion ratio from last 12 months adjusted EBITDA of 86% after payment of acquisition-related expenses of $18 million. During the first half of 2022, we spent approximately $41 million of de facto share repurchases associated with stock-based compensation and to offset evolution from such compensation. As we discussed in our Q1 remarks, we significantly reduced such de facto share repurchases starting in the second quarter. And we since announced the stock repurchase program, which enables us to consider market conditions and flexibly reprioritizing the application of our cash generation, including the cash savings from the switch to gross equity distributions as between programmatic acquisitions, delevering and stock repurchases to offset ongoing dilution from equity compensation.\n\nDuring Q2, we repurchased $13 million of our stock under this program. With regards to capital allocation, our net debt senior leverage was 1.4 times as of the end of June, down from 1.6 times as of the end of December 2021, which I presented during our year-end 2021 operating results call on a pro forma basis to reflect the financing of our acquisition of PLS. When including our 2026 and 2027 convertible notes as debt, our net debt leverage was 4.8 times as of the end of June. As a remark during last quarter, while interest rates continue to rise, approximately 75% of our debt is protected from changes in interest rates for either highly favorable coupon interest of our convertible notes, or our $200 million interest rate swap.\n\nMay I conclude by recalling that Greg started out by referring to '22 Q2 as straightforward. Indeed, we see all of our end market sectors for the first time in 2020s being characterized by variously positive tones of new business. And similarly, across global regions, Russia having effectively disappeared by now, our quota carriers everywhere report infrastructure engineering activity and prospects at relatively full capacity. At the same time, our own business performance execution is demonstrating the return on our investment in E365 success, SMB penetration and an NRR and ARR growth inflections.\n\nOur straightforward combination of resilience and execution makes us confident even in this year of seemingly increasing macro uncertainty at large, in continuing to rely the compound of predicted and predictable operating results. Thank you, and now to your questions.\n\nMichael Fischette\n\n[Operator instructions] We'll start with Matt Hedberg at RBC.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGuys, can you hear me?\n\nGreg Bentley -- Chief Executive Officer\n\nYes.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nSuper informative. Greg, you mentioned -- something we talked about a couple of quarters ago, and it seems like it sort of died down a little bit, but you mentioned the Infrastructure and Job Act here in the U.S. I'm curious, could you double click on that and -- because I think a lot of investors are curious kind of how that plays out? I know it takes a long time for funding to unfold. But just a little bit more color, maybe some of the green shoots that you're seeing from that?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, it is, as anticipated a couple of quarters ago now, the money is flowing. The appropriations are done each month. We read of another named program from one or another of the federal departments that is starting to entertain grant applications and so forth. So our impression has been that as expected, it's ramping up.\n\nSo I was very glad to see the ratification of that in the survey reported from ACEC which showed the degree to which the engineering firms are seeing -- those are the jobs that, as far as the design, the start of the projects, and then there will be construction jobs as well. But they are -- we're maybe a third or a quarter or – a quarter or a third of the way into the ramp-up of the incremental spending now. Again, that's most true happening first in highways and then some of the other newer programs in broadband and water and so forth are somewhat behind those, but everyone is confident about their progress also.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThat's great. Now that's super good to hear. I know we've all been sort of anticipating this. And then for Werner, in sort of the balanced growth and profitability is impressive.\n\nCan you give us a little bit of insight on how you're thinking about hiring for the second half of this year? And kind of how you look at -- I think you said Q2 is sort of straightforward. How do you think about that balance of growth and investment into what still looks like an uncertain second half of the calendar year?\n\nWerner Andre -- Chief Financial Officer\n\nYes. Maybe first, some of the -- our adjusted EBITDA margin is exactly where we were expecting it to be and hoped it would be to hit the target of 33%. We have approximately 400 open positions, which is a reflection of attrition that we had, attrition that we project and growing the company. The company is going right across the board.\n\nWe reset every quarter when we look at the revenue run rates and cost run rates and then open up the hiring relative to the run rate. So that combination makes very comfortable to target toward a 33% in Q1.\n\nGreg Bentley -- Chief Executive Officer\n\nI might add that attrition for us is real, but relatively favorable to peers and our probably success initiatives are going to differentiate us, we hope, in retention going forward. But our business is just not very volatile in the scheme of things, either at the top line or on the bottom line. If you see, we're mainly annual subscriptions. We -- our cost -- our people.With the open positions, we just won't compromise our standard, and it's taking longer to find the right quality of people, but we haven't made big changes to our hiring plans, and we don't anticipate needing to do that hiring.\n\nAnd Nicholas, do you want to add anything to that?\n\nNicholas Cumins -- Chief Operating Officer\n\nHiring is a priority to support the growth of the company in the long term. So yes, there's no slowing down on our side in terms of hiring, whether it's in go-to-market for the success organization, for our product organization. All steam ahead.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nCongrats on the results, guys.\n\nMichael Fischette\n\nNext, we'll go to Joe Vruwink at Baird.\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nIf I just reflect on some of the things you've brought up on the call. So given an increase in projects with IIJ, positive tone of business across all sectors, new business improvement and geos that were previously seeing some pressure and a pretty good pipeline. How would you expect all of this to manifest in core ARR growth from this point onward? And do you think that an inflection toward the upper end of the 11.5% to 13.5% range, is that possible when you think about some of these things and new ARR to be generated in the second half?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, Joe, thanks for the question. We say we'll update our annual financial outlook only when the material change, and we've decided it didn't -- it doesn't rise to that at the moment. What's to be remembered is we're a percent behind by virtue of Russia. If not for the Russia exit, our ARR growth year over year in constant currency would have been 12.5% in the first quarter and 12.5% in the second quarter.\n\nBut we've lost that percent, then we would have to make it up. So -- and then we have the uncertainty about China. You might say, well, wouldn't you be able to narrow your range as half of the year is behind you in ARR growth. In China, it's still such a question mark.\n\nAs we mentioned, the counter globalism didn't recur in the second quarter, thank goodness. And our teams there are enthusiastic, especially about new infrastructure programs in China that are meant to be quickly delivered and making a difference this year. But on the other hand, when you look at -- consider the news of the past week and the government tensions, it doesn't seem like we could count on China one way or the other. So I think that's -- remember, that's 5% of our business.\n\nSo that's a swing that we think remains in the range of ARR growth for the balance of the year, but it would be possible to make it up, but it would also be possible to encounter, for instance, recurrence of problems in China. So we are -- we're confident that the range is the right range at this point. Nicholas, you want to add to that?\n\nNicholas Cumins -- Chief Operating Officer\n\nJust on China, I think, Greg, you explained it very well. There's a lot of unknowns, of course. On the other hand, if you follow the news, the President Xi Jinping has as an all-in effort -- all-out efforts to invest in infrastructure. So obviously, the opportunity is as big as ever in China for infrastructure, engineering.\n\nNow we are leveling the playing field as we announced last quarter with our JV strategy and the first JV that we've created. So if some of the companies over there, some of the organization over there want to procure Chinese software, we can do that. But we're also taking a lot of steps to invigorate our core business in China. We are creating a user success organization over there.\n\nWe're going to launch E365 in China later this year. We are making a lot of the capabilities, or product-wise, or core product in China that were only available on the cloud. We're making them available on-premises so that company, organizations over there who cannot use cloud solution will be able to benefit from that innovation. So we think this is really going to help on the growth of China.\n\nBut of course, lots of facilities on the overall relationships between China and the rest of the world.\n\nGreg Bentley -- Chief Executive Officer\n\nSo, Joe, that's a lot of emphasis on China. But the point is the rest of the world and the rest of the products and the sectors are pretty predictably, can be counted on that for the year. So the risk is -- and the risk of Russia behind us wasn't a good outcome, but it's an outcome. We have to make it up and China is the question mark.\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nOK. OK. Understood. And then second question, I wanted to focus a bit on the metals and mining exposure.\n\nCurious if you can just give maybe an updated rate of growth for Seequent? And then when you think about some of the activity that's happening around geological modeling now with Micromine ending of AspenTech, of course, you've operated Seequent for a year. Does that tell you anything about maybe customer readiness to invest in a bigger way around these solutions and so the fact that and peers are now gravitating over as kind of a reflection on a better market opportunity?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, it is the case that Aspen's acquisition of Micromine's kind of a change in their direction now under Emerson majority ownership, but does reflect secular opportunities in mining. Mining can be done differently and better, and it starts with the subsurface modeling that Seequent plan here. As the growth rates -- each and both of Seequent and Power Line Systems are growing twice as fast as Bentley Systems. And that continues to be true as we grow faster, if you see what I mean.\n\nSo we're very happy with the opportunities in what I call environmental digital twins, including mining and in grid digital twins. Those are resounding opportunities for the foreseeable future, I think. Nicholas, what would you like to add about Seequent?\n\nNicholas Cumins -- Chief Operating Officer\n\nSo Seequent is very good again this quarter. In mining, for sure. I mean, it continues to benefit from very large investments in mining to support the world's energy transition, not just in mining. It did pretty good in civil as well according to plan.\n\nNow if we look at mining, some of the acquisitions that Seequent made, and we announced exactly a year ago actually, have done extremely well, double to triple digit growth, which is a sign of a market which keeps pushing the envelope in terms of digital transformation. It did very well in Africa. We had some existing large users in Africa who double down, so to speak, in their investment in digital. Now with respect to Micromine, this was not a surprise because we know that the founders had sold to a key firms, so we knew that an acquisition was going to come.\n\nThe overlap with the Seequent portfolio is in some area. I mean Micromine is actually more downstream. It's more on mining operations, right? So we will take it more as a confirmation point that indeed, mining is a hot business and mining software has a lot of potential. But I just want to reemphasize the fact that Seequent -- with Seequent, we do have, I will say, the largest and the deepest portfolio of products available for geoprofessional.\n\nIt's really second to none, right? So our breadth and depth of our capabilities remains leading.\n\nMichael Fischette\n\nNext, we'll go to Matthew Broome at Mizuho.\n\nMatthew Broome -- Mizuho Securities -- Analyst\n\nSo it sounds like Virtuosity has another good quarter, helping to drive new business growth and I guess it's been just over two years now since you launched Virtuosity. What are the main things, I guess, you've learned since launching that business and your broader zero touch strategy in terms of approaching the SMB opportunity in particular? And then how material do you expect zero touch sales to become over the next sort of five years or so versus where they are today?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, it will take to five years to get to the zero touch. It's a strategy not yet quite the norm, but it is our major investment initiative, I would say, in terms of people and the investment we're applying there. What Virtuosity has done for us is validated the potential we can reach with direct engagement, these practitioners -- engineering practitioners who are mainly an SMB firms that can really be a way to beat the competition that's coming at it from a channel approach. And here again, I'll ask if you want to add anything to that, Nicholas?\n\nNicholas Cumins -- Chief Operating Officer\n\nYes. What Virtuosity allowed us to prove is two things. One is the real potential for indeed a zero touch engagement with our accounts. For sure, it's started in SMB, but we see really no reason why at some point, it shouldn't be available as well for some of our enterprise accounts who are not yet on E365, for example.\n\nBut the other thing that it helps us prove is the strength of an inside sales team, right? So we've done it with the core business of Bentley, the core portfolio. Actually, one of the things that stood out also for Seequent in the last quarter was the inside sales team. So it was a clear standout in terms of revenue acceleration. So those are two muscles that we are building up now as an organization, zero touch and low touch, if you want with [Inaudible].\n\nGreg Bentley -- Chief Executive Officer\n\nIt just shows a differentiated strategy. The market is ready for a differentiated strategy there, we think. And our products are suitable to extend our balance, SMB becoming a comparable portion of our business to the enterprise business over time, as you say, the five years.\n\nMatthew Broome -- Mizuho Securities -- Analyst\n\nRight. OK. And then secondly, just curious in terms of your current M&A focus, are you open to additional platform acquisitions in the near term? And is there any area of your business you're looking to strengthen using M&A?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, the platform acquisitions, of course, don't depend on us but availability, and I haven't sounded very optimistic about that. David Hollister, could you help answer?\n\nDavid Hollister -- Chief Investment Officer\n\nYes. Sure. Sure. Yes.\n\nYes. Platform acquisitions, those obviously that we have completed are doing quite well, but the prospects for more of those are not great. But we do continue to have appetite at a programmatic level. Our strategy hasn't changed.\n\nIt's certainly obvious that the velocity of deals we're closing this year is off the pace of what we were closing last year. We're still seeing opportunities, but not as many. I would suggest that we're not seeing as many PE-sponsored opportunities in terms of volume, which is not surprising. They probably are reverting to the playbook of prior years where they had to be more patient and just hold acquisition -- or hold portfolio of companies and grow them until they're more ripe and market conditions are more receptive.\n\nThose PE-sponsored deals that we are seeing get done are closing at valuations that we're not willing to venture into. We haven't seen the market correction in those M&A multiples that we're seeing in the public multiples. And we're just going to be disciplined about valuation. So we're looking hard.\n\nWe're working hard, but there are deals that are just at a price we're not willing to go to. We did close this year on a few. [Inaudible] last quarter, as you know. PLS to start the year.\n\nA couple of small deals, Maximo Con, which is -- there was a theme here that we're growing and we're recruiting and we want talent. This was effectively a talent acquisition. Maximo Con. And then just today, we're announcing the acquisition of Eagle IO, which is additive to our infrastructure, IoT, tech stack and talent team.\n\nBoth of those together, the Maximo Con and the Eagle IO are our smallest, as Greg described, but together, they don't get to eight figures in terms of acquisition price. But the pipeline is robust. We continue to work our strategy and our appetite hasn't changed. So we'll get back on pace with velocity soon enough.\n\nMichael Fischette\n\nNext, we'll go to Devin of KeyBanc.\n\nUnknown speaker\n\nI just have maybe just one question from my side. I'm encouraged to hear that macro in Asia and some regions in Europe improving in the past quarter. I just want to ask about the linearity of improvement in those regions. The improvement sort of happened more so in the beginning of the quarter? Or is it toward the end of the quarter? Any commentary you can provide on that?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, I'm sure Asia has been strong throughout the quarter, but Europe, we've been monitoring closely, and it hasn't been the same story across Europe. And now when we report new business, of course, new business for us is ARR growth. When there is new business, there is ARR growth. We mentioned, for instance, Northern Europe, new business declined during the quarter, but there's still was new business.\n\nIt just slowed down. But maybe, Nicholas, can you help with the notion of where in the quarter, and I think our quota carriers all feel that there's excellent pipeline and prospects at the moment. But perhaps you can elaborate on that.\n\nNicholas Cumins -- Chief Operating Officer\n\nYes. Pipelines are very strong and growing. So Europe, we saw a growth last quarter, but the growth has accelerated in Northern -- sorry, in Southern Europe and in Central Europe. In Southeast Asia and India, if you recall the previous quarters, we already called them out.\n\nSo the growth keeps accelerating over there. And it's following the same pattern. It's very much related to industrial and resources. So in that sense, it is predictable.\n\nIs the linearity exactly where we would like to be? It's still not on the enterprise side of the house. So we're making sure that commercial offerings, there is not any contra incentive for accounts to it as long as possible at the end of the quarter in order for us to to close a deal. So we're improving linearity, but it's not exactly where I would like it to be. In SMB, that's quite different.\n\nThis is more of a volume sales. So this is actually really throughout the quarter and way more linear, yes.\n\nGreg Bentley -- Chief Executive Officer\n\nThe other thing I'd like to emphasize on that deal is I mentioned really for the first time that the bulk of our ARR growth is in our E365 account and that is consumption growth, which does occur linearly during the quarter. So sort of underneath, we talk about deals and we -- and our quota carriers still chase deals and so forth. But the underlying volume-based daily consumption in E365, which adds up to most of it now and of the accretion we get, and most of our ARR growth is that accretion that is, that has become linear, if you see what I mean.\n\nMichael Fischette\n\nThanks, Devin. Next, we'll go to Kristen Owen from Oppenheimer.\n\nKristen Owen -- Oppenheimer and Company -- Analyst\n\nWanted to ask -- I know we've talked a lot about the IIJA, but more recently, the inflation reduction at $60 billion for ruble infrastructure. You've got a limited time window for that extended investment tax credit. So the question is really about market ready to capture expanded wallet share, whether that's through PLS on the grid side or even Seequent to support the EV incentives. If you have the market readiness or the capacity to capture greater market share than you otherwise would have, given how early you are in sort of the integration process of those acquisitions?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, the integration process of the acquisitions wouldn't hold that up and renewables are putting a real smile on our face across the resources sector that we've broken out now and showing that growing faster than anything else. Perhaps embarrassingly, I haven't sufficiently studied the inflation act to know how much of it can be applied to capex, if you see what I mean. But an enabler, especially for grid mobility and renewables depends on grid capacity is the improvement in the permitting that will allow, especially in the U.S. new transmission capacity to be added faster.\n\nAnd I hope that, that legislation continues to address that bottleneck. It's a bottleneck around the world. But we're seeing excellent progress with Power Line Systems. But it's a fraction of what it can be and it needs to be to hook up the renewal capacity that's being added or has already been added in some parts of the world.\n\nKristen Owen -- Oppenheimer and Company -- Analyst\n\nGreat. And wanted to ask about player's appointment. If I recall correctly, a significant portion of your TAM sits within your existing customer base. When I think about her realignment to really focus on that part of the business, how are you thinking about your ability to accelerate wallet share gain with these leading engineering firms?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, we look at each of the top firms and they're -- we look at their spend with us, their run rate with us per $1 million of their design revenues, which they report to engineering news record and that's kind of a report card on how important we are to them and how aggressive they are in going digital. And most of them are on E365 or destined to be on E365 and have the benefit of our success team and new digital success blueprint. And so what I'm getting at is if in each side of ban, you might recall -- we measured our service addressable market are saying by saying what about what each of the firms in each size band among engineering terms, would spend per millions of dollars of their design revenue, which we know because they reported the engineering news record, what the one that spends the most on that is? And none of these are small. So these are not -- there's no aberrations in that data and apply ourselves to do that, and we can multiply our revenue and engineering firms by achieving in all of them, the density we have in some of them.\n\nAnd Claire will help us understand that and communicate better and focus more.Nicholas, maybe you want to talk a bit about the solutions group and the evolution of that?\n\nNicholas Cumins -- Chief Operating Officer\n\nYes. So we established a solutions group about a year ago now. And the focus, as Greg commented during the prepared remarks was very much on owners, operators and was a line along all the major infrastructure sectors such as transportation or mobility, electricity, water utility, so on and so forth. And the main purpose of that group and the same will apply from now on to engineering firms with Claire, was really to look at the world through the lens of the industries we serve, understand the big trends in that industry, the big themes of that industry and clarify how we Bentley, can best support those trends.\n\nHow could we support the transformation of the of these sectors. So this is what Claire is going to do, focusing on engineering firm, which is indeed the majority of our revenue scale, looking at the world through their lens, how can we help them be more efficient and more effective, whether at the individual engineering practitioner level using our engine applications or as an organization using our enterprise systems such as project-wise. And how can we help them if this is something they want to do, transform their business. If they want to become digital integrators, if they want to offer they own digital services to owners and operators and have more of a recurring revenue stream, how can we help them with our experience there and our software.\n\nMichael Fischette\n\nGreat. Next, we'll go to Andrew DeGasperi from Berenberg.\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nMaybe, Greg, thanks for breaking out the Resources contribution recently. And I just wanted to ask, you mentioned oil and gas had a recovery. I just wondered how that much does it contribute to AR right now? Maybe could you elaborate a little bit how fast it's been growing relative to Bentley's core revenue?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, that was the portion previously in industrial. So you saw that, that was at most 20% of -- and even a bit less than that. But it's gone down, of course, to be with the capex since 2019. It's now headed back in the right direction but slowly.\n\nSo I would say it's not a significant contributor to ARR growth now, but it was a drag on explicitly because they were all on the E365 program. That's the particular significance of turning it around. It helps E365 as a whole look as good as it really is.\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nAnd then maybe one on Virtuosity. I know you mentioned the 600 new SMB customers that are adding on. Have you seen that momentum continue so far in Q3 on that? And do you expect any slowdown given the challenging conditions that customers seeing?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, I don't think we comment much on Q3 yet, but I -- but slowdown doesn't characterize anything about Virtuosity. I think it's green light. If the more capacity we put in there with -- and it's been adding more inside sales reps, but we need to add the digital multiplication of their reach is -- and that we're working on as fast as we can.\n\nMichael Fischette\n\nNext, we'll go to Michael Funk at BofA.\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nOne for you, Greg. So I always appreciate the commentary on exposure by project type and then ARR growth by project type as well. Do you have any thoughts or comments to have though, on funding the project type meaning public versus private funding as you think about rates increasing and capital budgets potentially getting cut?\n\nGreg Bentley -- Chief Executive Officer\n\nWell, the industrial sector, as we now narrow it, not to include resources and renewables is privately funded. And that's where that exposure would be the commercial facilities sector. You see that's relatively small. I think we've moved the discrete manufacturing into industrial, that's privately funded and by rights would be interest rate sensitive.\n\nTo tell you the truth, I keep expecting that to turn down and it hasn't yet. It may be because in commercial facilities, the way we're differently using space now in the commercial and facility spaces requires enough adaptation that it's making up for what would otherwise be lower capital investment there. But you're right, it's necessary to break that down by infrastructure sector. Certainly, in public works and utilities and resources, it's mainly government or public expenditure that is not at risk, we think.\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nNo. It's great commentary.\n\nMichael Fischette\n\nWe'll go to Kash Rangan at Goldman Sachs.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nGreat results. You made a point about engineering labor, design labor being in short supply and how the role of software is even more paramount. I'm curious if you could expand your thoughts because it has implications for how you've been making acquisitions, adding more depth to the product portfolio. But if engineering talent is in short supply, how does the company go about getting more product adoption in a labor-constrained market.\n\nI was just curious to get your thoughts on that?\n\nGreg Bentley -- Chief Executive Officer\n\nThat has become the priority for the engineering firms. They do not expect this to turn around. And it couldn't because the new civil engineers and geotechnical engineers and structural engineers need to be in school now and they're not. So I'd like to say the engineering firms and engineering organizations for whom the pandemic prove to them that going digital was necessity, they wouldn't have thought they could conduct their business if they couldn't come to work.\n\nBut they were able to do that, thanks to going digital. And now that occurs to them is the same solution to their capacity problem to, as we say, be able to do more work without a greater workforce. So I think that is the main theme within those firms. It's not our theme.\n\nIt's their theme thankfully and we'll have clear to be able to help communicate that. Automation, replication, as Claire mentioned, component-based designs, those are the way to get more work with fewer engineering hours. And with the backlog, I just saw at 135%, and they expect it to increase from there. It's -- everyone is on the same side of taking advantage of this.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nAnd finally, is it your view that the company is gaining wallet share and market share? And if that's the case, how could you possibly accelerate share gains?\n\nGreg Bentley -- Chief Executive Officer\n\nThank you. Well, I think that the share of engineering work that is infrastructure engineering work is growing in the world as among all engineering work. You see because of the priorities we call ESDG to do with resilience and energy transition and so forth. We are -- we don't tend to beat our test about our own share, but I think that's gaining as well, at least in the SMB sector.\n\nAnd we'll -- we are in a position of relative confidence now. We're sorry to have the Russia exit behind us, still worried about China, but otherwise, the lights are green, and we're confident about achieving our original annual outlook despite the concerns that have come and gone and will continue to come and go in 2022.So thanks to everyone for their time and attention today.\n\nMichael Fischette\n\nYes. With that, I see no more questions in queue. So we'll end the call on that note. Thank you for your time, everybody, and we'll see you next quarter.\n\nGreg Bentley -- Chief Executive Officer\n\nCheers.\n\nMichael Fischette\n\nThank you.\n\nDuration: 0 minutes\n\nMichael Fischette\n\nGreg Bentley -- Chief Executive Officer\n\nClaire Rutkowski -- Chief Information Officer\n\nNicholas Cumins -- Chief Operating Officer\n\nDavid Hollister -- Chief Investment Officer\n\nWerner Andre -- Chief Financial Officer\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nMatthew Broome -- Mizuho Securities -- Analyst\n\nUnknown speaker\n\nKristen Owen -- Oppenheimer and Company -- Analyst\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nMore BSY analysis\n\nAll earnings call transcripts"
}