{
  "companyName": "Avaya Holdings Corp.",
  "companyTicker": "AVYA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/avaya-holdings-corp-avya-q3-2022-earnings-call-tra/",
  "content": "Avaya Holdings Corp. (AVYA 6.23%)\nQ3 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nUnknown speaker\n\nWelcome to Avaya's call to discuss certain preliminary fiscal 2022 third quarter financial results. Alan Masarek, Avaya's president and CEO; and Kieran McGrath, executive vice president and CFO, will lead this video conference and share with you some prepared remarks. The press release and investor slides referenced on this video conference are accessible on the investor page of our website as well as in the 8-K filed today with the SEC. These should aid in your understanding of Avaya's preliminary financial results.\n\nAll financial metrics referenced on this call are non-GAAP, with the exception of revenue. We have included a reconciliation of such non-GAAP metrics to GAAP in the press release and investor slides, which were filed with the SEC earlier today. Also during this call, we will be making certain forward-looking statements, including statements concerning our future prospects; financial results; liquidity; cost-cutting initiatives; internal controls; ongoing investigations by our Audit Committee; our strategies, investments; industry trends; and our ability to successfully respond to business risks, including those related to the spread of COVID-19, inflation and increased raw materials costs and other supply chain issues. Such statements are considered forward-looking statements under the Private Securities Litigation Reform Act of 1995 and are subject to certain risks and uncertainties which could cause actual results to differ materially from those contemplated by our forward-looking statements.\n\nInformation about these various risks and uncertainties may be found in our most recent filings with the SEC, including our Form 10-K and our Form 10-Qs. Reported results should not be considered an indication of future performance. Also note that the forward-looking statements on this video conference are based on information available to us as of today's date. We disclaim any obligation to update any forward-looking statements, including guidance, except as required by law.\n\nI'll now turn it over to Alan.\n\nAlan Masarek -- Chief Executive Officer\n\nGood morning. I'm Alan Masarek, and I'm pleased to be speaking with you for the first time as Avaya's CEO. I'll start out by addressing our disappointing results for the quarter, but before we dive in, let me highlight two points. First, my commitment to you is that our team and I will share information in an open, honest, direct, and transparent manner.\n\nAnd second, I've always considered Avaya's opportunity for success to be much greater than its past performance. I've been interested in Avaya for a long time because I see many parallels to my experience leading Vonage's transformation, which I'll describe later. With respect to our preliminary Q3 results, please refer to the investor deck, in which we highlight the components of the miss and we reconcile Q3 results to prior public guidance. The largest component of the revenue miss was $64 million in lower subscription revenues versus the internal forecast reflected in our public guidance.\n\nIn Q3, total contract value was less than our internal forecast because average contract duration and average contract size declined. Avaya's subscription revenues are based on total contract revenues, so these declines in duration and size meaningfully depress current quarter revenue recognition. These declines generally happen because some customers signed shorter-term contracts, while others renewed maintenance agreements instead of signing long-term software subscription contracts. The net result of these changes reduced the subscription revenue we could recognize for the 606 accounting standard, yet in spite of this large decline, velocity and demand for subscription remained strong.\n\nWe signed nearly 120 more subscription deals in Q3 versus Q2. Now the other large element of the revenue miss was $43 million related to capex licenses that were either delayed into Q4, downsized or lost. This revenue miss happened proportionally across the theaters, and we are working with our teams and channel partners to determine root causes. To summarize.\n\nThe lower subscription total contract value, the sequential quarterly increase in maintenance bookings and the accelerated decline of capex licenses seemed to imply that customers became cautious on making longer-term commitments to Avaya, perhaps due to concerns about Avaya's near-term maturities -- near-term debt maturities given the very public nature and the extended length of time it took to premarket launch and complete the financing during Q3. Moving forward, we need to accelerate our contract booking and corresponding revenue recognition assessment and recording so we can more quickly report performance. Avaya's subscription contract booking and accounting systems need to be more automated, particularly given the large quantity of contracts requiring manual review. In Q3, Avaya signed over 300 subscription contracts greater than $100,000 in TCV.\n\nEach of those contracts required manual review to determine revenue recognition, so we need to plan. We're planning to analyze the necessary upgrades. Or we are planning to analyze -- we plan -- to our systems to speed up our processes, particularly related to revenue recognition reviews around bespoke contracts. In parallel with our internal work, our Audit Committee has engaged external counsel as a matter of good governance to conduct an independent investigation of Q3 results.\n\nGiven the time it will take to complete this work, we will delay filing our third quarter 10-Q until this review is completed. Now let's shift gears to the actions underway to improve Avaya's near- and long-term prospects. In the July 28 press release, the company announced cost reduction initiatives to eliminate between $225 million and $250 million of costs. As we operationalize these cost savings and define our go-to-market and go-forward business plans, we may increase the size of this cost reduction initiative because the goal is to rightsize Avaya's cost structure to align with our contractual recurring revenue business model.\n\nMy goal is to reduce enough costs so we generate positive net operating free cash flows in fiscal '23, excluding the restructuring costs. We intend to operationalize as many of these cuts as possible in this Q4. And for reductions requiring more time, the company will accrue pending restructuring charges at year end. So let's now return to why I wanted to join Avaya as CEO.\n\nI joined because I'm not a stranger to business transformations. Most recently, I guided Vonage through its own journey from a VoIP-based residential phone provider that was in multiyear revenue decline into a global enterprise cloud communications company with increasing revenues and profitability that led to a significant equity value appreciation. I know what it takes to succeed in this highly competitive global communications marketplace. I also understand the challenges in transitioning to a subscription-based cloud model.\n\nSo while all large-scale transformations are tough, Avaya has an enviable set of assets that are foundational to its success. Avaya is an iconic brand with a truly global customer footprint. Avaya serves 90,000 customers across 190 countries with a massive partner ecosystem. Avaya's customer base includes many of the world's largest enterprises.\n\nAnd Avaya maintains some of the world's largest communications deployments, so while our Q3 revenue and EBITDA miss is highly concerning, let's not forget Avaya's positive accomplishments in the quarter. And I'll take just three. First, Avaya's transformation to subscription and cloud-delivered services remains well underway. In Q3, OneCloud ARR increased to $838 million, an increase of 12% sequentially and 97% year over year.\n\nThis underscores the continued progress of our business model transformation and the strength of our offerings. Second, Avaya signed 92 deals in Q3 with TCV greater than $1 million, demonstrating continued strength with enterprise customers. We added approximately 1,300 new logos, with over 60% of those signing up for our cloud and subscription offers. And third, recurring revenue was 70%, up from 64% a year ago.\n\nAnd our own remaining performance obligations commonly referred to as revenue backlog remained steady at $2.3 billion. Now notwithstanding these positives, Avaya has much to improve on. I've already discussed the need to rightsize our cost structure. We also need to continue to develop the products necessary to accelerate our transformation to cloud-based solutions.\n\nThis says -- said, we have a strong technical foundation from which to build, including over 4,000 patents, many of which are seminal to our industry. And importantly, this shift to cloud-based technology is precisely the transition I led at Vonage. I also believe that a cultural revitalization is necessary. We revitalized Vonage's culture, and I intend to do the same here.\n\nI want Avaya to become the preferred destination place to work for the most talented in our industry. As I told Avaya employees during a live video presentation to the entire company last week: Prepare to win. Prepare to win. The message of winning is the same message we'll bring to Avaya's customers and partners.\n\nWe want to be the world's best communications supplier. We will focus our investments on driving innovation and advancing the product development that our customers expect from us, and as such, we intend to win our customer's business every day. To our customers, I say I want to hear from you, to listen to your perspectives and to your ideas and to strengthen our partnership. I invite you to reach out to me directly and I will be doing the same.\n\nTo our partners. I recognize and I appreciate the tremendous value you play in Avaya's future, the great value you provide to our customers. I'm committed to strengthening our relationships so that we jointly deliver the best possible solutions for our customers. In closing.\n\nI want you to know that our priority right now is to be heads down, executing on what I outlined today. We will be refreshing our outlook as we finalize our go-forward plans and our cost reduction initiatives. I will provide updates just as soon as available, and as such, we will not be taking Q&A today. Thanks for your support, and thank you in advance for your patience.\n\nI'll now turn the call over to Kieran for his CFO commentary.\n\nKieran McGrath -- Executive Vice President and Chief Financial Officer\n\nThanks, Alan, and welcome. Happy to have you.\n\nAlan Masarek -- Chief Executive Officer\n\nThank you, Kieran.\n\nKieran McGrath -- Executive Vice President and Chief Financial Officer\n\nHey. Good morning, everyone. As a reminder, all figures mentioned on this call are as reported -- are at reported rates unless otherwise indicated in our constant currency. I also want to note that all of the third quarter fiscal 2022 results that we're discussing here this morning, including any related comparisons to prior periods, are preliminary financial results that have not yet been reviewed or audited.\n\nThey're also based on our good-faith estimates and were prepared prior to the completion of our financial statement close process. These preliminary results therefore should not be considered final until we file our Form 10-Q for the quarter. Now for the third quarter of our fiscal 2023, revenue was $577 million. This was down 21% as reported and 20% in constant currency against the $732 million as reported in the year-ago period and versus $716 million reported in Q2 fiscal 2022.\n\nOur OneCloud annual recurring revenue or ARR grew this quarter, adding $88 million, to end the quarter at $838 million. Sequential growth was 12%, and 97% growth year over year. Revenue contribution from CAPS or Cloud, Alliance Partner and Subscription represented 53% of total revenue, versus 40% a year ago, but in absolute dollars was down approximately $85 million sequentially primarily due to the reduction in subscription point-in-time revenue that Alan referred to in his comments. For our third fiscal quarter, recurring revenue accounted for 70% of total revenue.\n\nAnd software and services revenue represented 88% of total revenue. Software revenue alone was 62% of revenue. Now let me turn to profitability. Non-GAAP gross margin was 51% in the third quarter, compared to 61.5% in the year-ago period and 56.7% sequentially.\n\nOur product margins of 43.8% were down three percentage points sequentially primarily due to lower hardware gross margins. Year-to-year gross margin is down 17 percentage points primarily due to the decline in high-margin capex license software revenue. Services margin came in at 53.9%, down seven points sequentially and eight points year on year. The sequential decline is due to lower Q3 subscription revenue.\n\nAs to the year-on-year decline, while subscription revenue grew, the growth was not sufficient to offset declines in high-margin maintenance revenue over that same time period. Our third quarter non-GAAP operating income was $20 million, representing a non-GAAP operating margin of 3% versus 20% in the year-ago period. Adjusted EBITDA was $54 million, representing an adjusted EBITDA margin of 9%, down from 24% last year due to the aforementioned revenue reductions, partially mitigated by the expense reductions previously announced back in Q2. Non-GAAP EPS was negative $0.24 in the third quarter, compared to positive $0.75 in the year-ago period and positive $0.53 sequentially.\n\nYou will note in the accompanying preliminary financial statements contained within our Q3 press release that we expect to record a $1.272 billion noncash impairment charge against the carrying value of our trade name and goodwill intangible assets. This charge is a preliminary estimate and analysis is still ongoing. Finally, on cash. Cash flow from operations was negative $85 million, contributing to a third quarter ending cash balance of $217 million.\n\nAdjusting the third quarter ending cash balance for the net proceeds of the incremental term loan and exchangeable notes financing which was completed on July 12. Avaya's cash on hand would be composed of $404 million of cash and cash equivalents and $221 million of restricted cash held in escrow. Now let me conclude by reinforcing what Alan noted. We are not standing still.\n\nWe are taking an aggressive set of actions to reset our run rate of cost and expense. We expect to generate between $225 million and $250 million of annual cost and expense reductions and have already begun to operationalize these plans. As Alan stated, as we finalize these plans, we may increase the size of the cost initiatives. We are intently focused on liquidity and maintaining our financial and operating flexibility so as to continue to invest in the business and sustain the transition of our business model.\n\nWith that, let me hand it back to Alan.\n\nAlan Masarek -- Chief Executive Officer\n\nThanks, Kieran. Let me conclude today, first, by again thanking everyone for their support. I understand there is a great deal of disappointment, concern, and worry based upon the results of this Q3. I get it.\n\nThis said, I think it would be a mistake to sit back and look at the disappointments of Q3 and to sort of extrapolate that forward and say, \"Boy, that's the future of this company.\" I don't believe that at all. When I joined as CEO, I came with eyes wide open. I understand how difficult transformations are. I've done it before.\n\nAnd so as I said earlier, I believe fully that Avaya's future, its opportunity for success, is better than its past performance, a lot better. And so I came here believing in those assets, which are irreplaceable, that I mentioned in my comments. And we intend to lead and manage this company to the best of our ability to generate those more positive results in the future. Having just got here, there's much more I need to learn and there's much more obviously we need to do, and so I ask all stakeholders here for your patience and for your support.\n\nWe will be back to you as quickly as we can with our renewed outlook and our go-forward business plan. Thanks, and have a great day. I appreciate it.\n\nDuration: 0 minutes\n\nUnknown speaker\n\nAlan Masarek -- Chief Executive Officer\n\nKieran McGrath -- Executive Vice President and Chief Financial Officer\n\nMore AVYA analysis\n\nAll earnings call transcripts"
}