{
  "companyName": "Wynn Resorts",
  "companyTicker": "WYNN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/wynn-resorts-wynn-q2-2022-earnings-call-transcript/",
  "content": "Wynn Resorts (WYNN 1.49%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the Wynn Resorts second quarter 2022 earnings call. [Operator instructions] This call is being recorded. [Operator instructions] I would now like to turn the line over to Julie Cameron-Doe, chief financial officer. Please go ahead.\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nThank you, operator, and good afternoon, everyone. On the call with me today are Craig Billings and Brian Gullbrants in Las Vegas. Also on the line are Ian Coughlan, Linda Chen, Frederic Luvisutto and Jenny Holaday. I want to remind you that we may make forward-looking statements under safe harbor federal securities laws, and those statements may or may not come true.\n\nI will now turn the call over to Craig Billings.\n\nCraig Billings -- Chief Executive Officer\n\nThanks, Julie. Good afternoon, everyone. Thanks for joining us today. Before getting into the quarter, I'd really like to thank our 27,000 team members globally.\n\n2020 so far has been very different in Macau than it has been in North America. Our folks in Macau have endured what I know is a difficult period of isolation and volatility while our teams in Las Vegas and Boston have responded admirably to meaningfully elevated business volumes. To those operating in both circumstances, thank you. I appreciate you.\n\nStarting in Las Vegas. The team at Wynn Las Vegas turned in another all-time record quarter with $227 million of EBITDA and broad-based strength across casino, hotel, food and beverage and retail, all well above 2Q 2019 levels. In fact, our EBITDA this quarter was over 40% above the pre-COVID Las Vegas Strip EBITDA record also delivered by Wynn Las Vegas in 2014. A few other all-time quarterly records to call out: record EBITDA margin, record slot handle in Wynn, record non-baccarat table Wynn, record hotel revenue and record revenue from restaurants and bars.\n\nMeanwhile, our customer satisfaction scores in the first half of 2022 were up 3% over the first half of 2019. Our performance in Las Vegas speaks for itself. Looking ahead, while we are keenly aware of the macro environment and the uncertainty facing the economy, we've been encouraged that the strength we have experienced over the past several quarters has continued into Q3. In fact, our forward bookings continue to pace at pre-COVID levels on substantially higher ADRs.\n\nJuly was very strong for us with occupancy of 91%. We expect the usual seasonal slowdown in August with occupancy declining in the mid- to high 80s before accelerating back to the low 90s in September as group's return in large numbers. While we haven't seen any noticeable signs of weakness in our current operations or in our outlook, we are watching this closely. Our experience during the pandemic has made us nimbler than ever, and we are confident that we can adapt quickly to changes in the economic landscape, should they arise.\n\nTurning to Boston. Encore also had a great quarter, generating $64 million of EBITDA, a second quarter record for the property. We saw strength across the casino with record gross gaming revenue, and on the non-gaming side, we generated record hotel revenue with particular strength in cash ADR and occupancy. The positive momentum has continued into Q3.\n\nAnd again, similar to Las Vegas, we have yet to see signs of a slowdown. We were happy to see the Massachusetts legislature pass the sports betting bill and having already constructed a Sports Book at Encore Boston Harbor in 2021, we expect that retail sports betting will soon be a significant opportunity for propertywide customer acquisition in Boston. We also continue to finalize our plans for our upcoming development projects across the street from the property that will add incremental parking, food and beverage and entertainment amenities. Design and planning for that project is on schedule, and we are excited for our next phase of growth in Boston.\n\nIn Macau, the market continues to be very difficult with marketwide GGR in July, only reaching approximately 2% of July '19 levels. Our results have reflected that in roll, drop, hotel occupancy and EBITDA. Overall, our EBITDA loss in Q2 was $90 million, which was negatively impacted by around $8 million from low VIP holds. So on a normalized basis, our EBITDA loss was $900,000 per day in 2Q.\n\nAnd despite the nearly two-week marketwide casino closure in July, our EBITDA loss has been comparable at approximately $1 million per day quarter to date in Q3. Our team has done a fantastic job controlling costs in a very challenging operating environment through a combination of decreases in payroll and fixed opex. Several weeks ago, we announced some important leadership changes in Macau with Linda Chen moving into the role of president early next year; Frederic Luvisutto moving into the role of COO for the entire Macau business; and Craig Fullalove, assuming the role of CFO and CIO for the business. I know many of you know and as I do respect Ian immensely, so I'm pleased that he will remain at the company in an advisory role through 2023.\n\nI have immense confidence in Linda, Frederic and Craig and know that they are the right team for the future. The authorities in Macau continue to advance the concession process according to the preestablished time line. We are currently working through our response to the concession tender RFP. Longer term, we remain excited about the prospects for Macau with so much pent-up demand for travel and tourism in Asia.\n\nOur market-leading assets and strong liquidity position us well to thrive as visitation returns to the market over time. At Wynn Interactive, the strategy we implemented late last year to manage the business with a long-term shareholder-friendly view is working with our overall EBITDA burn rate declining to $21 million in Q2 from $32 million in 1Q, despite a 3% quarter-over-quarter decline in total turnover due to the seasonally weak second quarter sports calendar. We are looking forward to the potential for a significant catalyst for WynnBET in Massachusetts both in digital and retail sports betting. Lastly, the design and programming for our project in the UAE are really coming along, and I grow more excited about the opportunity every day.\n\nThe project parking along a beautiful white sand beach will contain a 200,000 square foot casino, an extensive food and beverage portfolio and numerous forms of entertainment and spectacle. The more time I spend in this project, the more I'm convinced in our ability to build robust gaming and non-gaming businesses. With that, I'll now turn it over to Julie to run through some additional details on the quarter. Julie?\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nThank you, Craig. At Wynn Las Vegas, we generated an all-time quarterly record of $226.7 million of adjusted property EBITDA on $561.1 million of operating revenue during the quarter. Higher than normal hold positively impacted EBITDA by around $6 million in Q2. Our hotel occupancy was 90.5% quarter, up 40 basis points versus Q2 2019.\n\nImportantly, we stayed true to our luxury brand and continue to compete on quality of product and service experience with our overall ADR reaching $460 during Q2 2022, 38% above Q2 2019 levels. Our other non-gaming businesses saw broad-based strength across food and beverage and retail, which were also well above pre-pandemic levels. In the casino, our Q2 2022 slot handle was 63% above Q2 2019 levels, and our table dropped was 28% above Q2 2019 level, despite still suppressed international plays during the quarter due to COVID-related travel challenges. The team in Vegas has done a great job of controlling costs without negatively impacting the guest experience, delivering adjusted property EBITDA margin of 40.4% in the quarter.\n\nOn a hold-normalized basis, our EBITDA margin was up over 1,200 basis points compared to Q2 2019. Opex, excluding gaming tax per day was $3.5 million in Q2 2022, in line with Q2 2019 levels despite a 21% increase in revenue due to lower head count and broad-based cost efficiencies in areas that do not impact guest experience. We remain committed to maintaining our cost structure that appropriately balance the market on our guest service standards. In Boston, we generated adjusted property EBITDA at $63.7 million through Q2 2022, with EBITDA margin at 13.3%.\n\nWe saw broad-based strength across casino and non-gaming. In the casino, we generated $181 million of GGR, a property record with strength across both tables and slots. Our non-gaming revenue grew 78% year over year, with particular strength in the hotel, driven by 94.1% occupancy and a $309 ADR. As Craig noted earlier, Q2 strength continued into Q3 as consumer spending on the unique experience remains strong.\n\nWe stay disciplined on the cost side with opex, excluding gaming tax per day of approximately $1.1 million in Q2 2022. This was a decrease of approximately 13%, compared to $1.3 million per day in Q4 2019 and up modestly relative to Q1 2022 on higher revenue and higher payroll. As we've previously foreshadowed, contractual labor agreements added around $45,000 per day for our opex base beginning late in the quarter. We are well-positioned to drive strong operating leverage as we continue to grow the top line over time.\n\nOur Macau operations delivered a EBITDA loss of $90.3 million in the quarter on $117.2 million of operating revenue as the COVID situation in the region has continued presence. As Craig noted, lower-than-normal VIP holds negatively impacted our EBITDA by around $8 million during the quarter. Businesses remained challenging into Q3 as local COVID outbreaks in Macau observed a shutdown of integrated resorts for nearly two weeks during July. Despite the closure, our quarter-to-date EBITDA burn was approximately $1 million per day, in line with Q2.\n\nOur opex, excluding gaming tax, was approximately $1.9 million per day in Q2, a sequential decrease, compared to $2.1 million in Q1 2022. The team has done a great job remaining disciplined on costs in a difficult operating environment. Longer term, we're well-positioned to drive strong operating leverage as the business recovers over time. Turning to Wynn Interactive .\n\nIn Q2, the business generated approximately $704 million in total turnover, a decline of 3% sequentially versus Q1 due to a seasonally weaker sport calendar. Decreases in marketing expense and other opex drove an improvement in our EBITDA burn rate of $21 million in Q2 2022 from $31.5 million in Q1 2022. Moving on to the balance sheet. Our liquidity position remains very strong with global cash and revolver availability of approximately $3.1 billion as of June 30.\n\nThis is comprised of $1.3 billion of total cash and available liquidity in Macau and $1.7 billion in the U.S. These numbers exclude the $500 million intercompany revolving credit facility, Wynn Resort and Wynn [Inaudible] with Wynn Macau, which further bolsters our already strong liquidity position in Macau and highlights the continued confidence we have in the long-term prospects for that business. Our previously announced sale leaseback transactions at a real estate Encore Boston Harbor remains on track for a Q4 close. Pro forma for the transaction, we have approximately $4.7 billion of consolidated global cash and liquidity.\n\nImportantly, the combination of very strong performance in Las Vegas and Boston with the property generating trailing 12-month EBITDA of just over $1 billion together with our robust liquidity creates a very healthy pro forma domestic leverage profile. Finally, our capex in the quarter was $90 million, primarily related to the Wynn Las Vegas room remodel and the theater renovation. With that, we'll now open up the call to Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Carlo Santarelli with Deutsche Bank. You may go ahead, sir.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nHi, everyone. Thank you, guys. Obviously, the booking pace on group remains pretty solid in Las Vegas. And clearly, there's a lot of pent-up demand for that.\n\nWith the experience of now taking on bookings and hosting groups in the new facility. As you guys look out to 2023, what do you believe to be kind of the tailwind from an occupied room night perspective or an occupancy perspective? As well as perhaps what impact that might have on kind of the margin profile of the property with the presumably added occupancy?\n\nCraig Billings -- Chief Executive Officer\n\nThanks, Carlo. Yeah, it's definitely true that group continues to be strong. And I'll ask Brian to talk about pacing in just a second. As we've talked about on prior calls, we did have some legacy group rooms as I think everyone at the market would from contracts booked in prior years that were at lower ADRs.\n\nWe've been, obviously, signing new contracts at higher ADRs, which as they roll in will offset that. From an occupied room night perspective, I mean, we're running very healthy occupancy today. So I don't think it would change overall occupancy, but obviously, it does mix. Brian, do you want to talk about pacing a little bit?\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nSure. Our sales team here at Wynn Las Vegas continues to just do an outstanding job, building a really strong base of business for our future. The second half of '22 that we're into now is ahead of pace and '23, we see quite strong. Just to give you a bit a sense of how we're doing the cumulative group bookings in the first half of '22 we're 40% above the first half of '19.\n\nSo the team just continues to build that solid base from which I think we can effectively yield-manage our rooms better next year and as we move into the future.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nGreat. Thank you. And then, just as you think about that group room night as it pertains to 2023, and acknowledging other than the first quarter, which was a little lighter from an occupancy perspective, but 90% in this quarter. Who does that customer supplant next year? Is that -- are you still getting a healthy or at least a tangible amount of rooms through OTAs and third-party channels right now? Or who is kind of being replaced? I assume it's likely not the casino customer.\n\nCraig Billings -- Chief Executive Officer\n\nWell, we -- it's a great question, Carlo. We've already scaled back our allocation to some of the lower-profitability channels. That's, obviously, the first thing you do any time you're yield managing. And it's a little bit of a rich man's problem now as we think forward because we have a very healthy casino business, as you saw in the numbers, and we have a very healthy group business.\n\nSo we're attuned to how we optimize that mix, and we'll be doing that over the course of the next couple of quarters. So stay tuned on '23, but we recognize, I'd love to call it an issue, it's actually an opportunity. We recognize the opportunity, and we will take advantage of it.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nThanks, everybody.\n\nCraig Billings -- Chief Executive Officer\n\nThanks, Carlo.\n\nOperator\n\nThank you. Our next caller is Joe Greff with J.P. Morgan.\n\nJoe Greff -- J.P. Morgan -- Analyst\n\nHey, everybody. I have two questions. One is another similar question on group in Las Vegas. When you look at next year, Craig, what are you targeting in terms of percentage of room nights related to the group segment? And then, how much of that is on the books now? And how much of the strategy is in the period for the period going forward on group given the seemingly upward movement in ADR rock group?\n\nCraig Billings -- Chief Executive Officer\n\nBrian, do you want to take that?\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nSure. I think, as we look at it right now, we're pacing to a normal percentage of around roughly 30%. We continue to excel as far as where we are for next year, we're slightly ahead of where we should -- where we normally are. So we're very confident that we'll hit the number we need to and it continues to contribute to our bottom line in base.\n\nCraig Billings -- Chief Executive Officer\n\nAnd those new bookings, particularly for new customers in the out years are at a substantially higher ADR.\n\nJoe Greff -- J.P. Morgan -- Analyst\n\nGreat. One thing that maybe surprised us looking at your earnings release tonight, Craig, was the buyback activity. Can you talk about that and how much of your capital allocation going forward is going to be buyback activity, assuming share price levels at or around these levels?\n\nCraig Billings -- Chief Executive Officer\n\nJoe, you know us, you've been following us for years, and you know that we're not programmatic about buybacks. We repurchased the stock when we think it's ridiculously cheap. And during Q2, that was certainly the case, particularly from mid May through the end of the quarter. So we're always balancing liquidity needs, capital deployment for growth and returning capital to shareholders.\n\nThe wildcard, let's be honest, the wildcard is Macau. So as we get better visibility on Macau over time then we can have more confidence in each particular form of capital deployment and know that we can do them concurrently.\n\nJoe Greff -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next caller is Shaun Kelley with Bank of America. You may go ahead.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much. I just wanted to sort of ask about the trends in Las Vegas a little bit more. The color on just the trajectory of what you're seeing on the casino floor relative to the hotel. Could you just maybe help us think about as we get into some of the tougher, I think, comps on the growth that we've seen in casino, what are some of your expectations around trends or what may be driving that growth? I know market share gains, maybe on the slot side has been a theme, but maybe pros cons on casino growth? And then, like I said, we've already talked about hotels, so just more on the GGR line?\n\nCraig Billings -- Chief Executive Officer\n\nSure. I'll start and then Brian will jump in. So this started really back in 2019. So you've heard us talk about before our reconstitution of our database strategy.\n\nWe've made a bunch of changes in hosting. We launched Wynn Rewards. So really going into the reemergence of COVID, we had reoriented our casino strategy, and I think it shows. At the same time, we've been very relentlessly reinvesting in the property in Las Vegas despite COVID.\n\nIn the rooms, in the food and beverage, and amenities, and it shows and customers notice it. And so, yeah, we are taking share, and I'm incredibly proud of the team for doing that. Brian, do you want to give a little bit of incremental color qualitatively on July?\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nYeah. When you look at what we've done in July, we actually what the host team and the marketing team and the casino segments have focused on really expanding into markets that we haven't been in before, reaching in further into domestic segments that we are seeing great returns on. And year over year, both drop and handle are significantly up. I couldn't be happier with the team right now, and they continue to just continue to push with special events and driving weekends.\n\nIt's just a great balance right now, and we're going to continue to do more of it.\n\nCraig Billings -- Chief Executive Officer\n\nAnd Shaun, we acknowledge trees don't grow to the sky, right? I mean, you're seeing this in all your Las Vegas names. But as I said in my prepared remarks, we watch the data daily, right? We don't have to look in Las Vegas. We don't have to look after 10 properties. We look after one.\n\nAnd we know everything that's going on in this building. And as I mentioned in my prepared remarks, we don't see slowdowns, so that's where we are.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nReally encouraging. And then, my follow-up would be not so much about slowdown, but just about maybe traditional seasonality a little bit here, right? Historically, I think, the properties tend to do a little bit better in the first half than second, especially in the third quarter. Can you help us just think about how those patterns may shape up for the balance of the year? Because we are hearing a little bit more from the broader lodging industry about a return to more normal seasonal behavior. Just any comments we could think about just to make sure we're in the right place for seasonal purposes?\n\nCraig Billings -- Chief Executive Officer\n\nSure. You're right. August is usually pretty weak in Las Vegas. I think that's probably true or I shouldn't think pretty weak, relatively weak, particularly given the quarter that we've just experienced.\n\nSo August is usually a pretty slow month. Groups come back in September, and you start to see an increase in occupancy. I talked about the occupancy shifts that we would expect over the course of Q3 in my prepared remarks, and we stand by that. So business is good.\n\nIn fact, it's really good. But you always see seasonality in the quarter. You can go back and look at historical Q2 to Q3 movement from an EBITDA perspective in percentage terms. And I think, you will see that seasonality.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nThank you. Our next caller is David Katz with Jefferies. You may go ahead.\n\nDavid Katz -- Jefferies -- Analyst\n\nHi. Afternoon. Thanks for taking my questions. I was hoping for some insight around Interactive.\n\nGiven that Massachusetts is moving forward, we do observe that there was a little bit of movement and the loss in the quarter. What are your updated thoughts there? Would the burn go up a bit, given that Massachusetts becomes an opportunity on home turf will take it all? Thanks.\n\nCraig Billings -- Chief Executive Officer\n\nSure. No problem. So beginning, I think, with our Q3 call, since last year, we talked a little bit about what we were seeing in the market and some of the irrationality that we were seeing in the market. I can say that that has markedly declined, and that's encouraging.\n\nSo to see other players in the market behaving reasonably well is great. For us, Massachusetts, I've said this before, Massachusetts was always an important good strapping event for WynnBET and for Wynn Interactive as is any movement in iGaming, which we, obviously, don't see at the moment, but I'm certainly will over the longer term. So our goal is really to make sure that we are consistently running the business as best we can from a lifetime value to cost per acquisition perspective. So increased retention, decreased CPA, increased handle per customer.\n\nThat's the way we run the business. That has resulted in a declining burn over time, which you've seen in each quarter has sequentially gone by, as we told you it would. That burn could go up modestly with the launch of Massachusetts because we will do some user acquisition. I don't think we'll ever be back in the position that we were in at the launch of last NFL season.\n\nWe've learned a lot in terms of which marketing channels work and which don't. But the business is -- they're really executing in that portion of our business, and we're watching the market very, very closely. We'll be in Massachusetts from Day 1.\n\nDavid Katz -- Jefferies -- Analyst\n\nUnderstood. And if I can just follow up, does the promotional landscape that you noted, enable you to consider going back to other states where you don't have a land-based presence or regrowing the business? Or should we really just be thinking about Massachusetts for the moment?\n\nCraig Billings -- Chief Executive Officer\n\nWell, we are continuing to launch in additional states, and we're continuing to set the foundation in place to grow that business over time as the TAM grows and as our business grows. But Massachusetts, obviously, for obvious reasons, we have the land-based presence there. You've seen market share from fellow market participants in places where they have brick-and-mortar presence, and it, obviously, warrants prioritizing Massachusetts.\n\nDavid Katz -- Jefferies -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nThank you. Our next caller is Dan Politzer with Wells Fargo. You may go ahead, sir.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nHey, good afternoon, everyone. And thanks for taking my question. I just wanted to follow up on Las Vegas. Obviously, margins were really strong in the quarter.\n\nI think, your gaming mix at this point is back to 2019 levels. So now that mix is basically normalized. Is there any reason to think that you wouldn't be able to sustain margins in that high 30% range going forward?\n\nCraig Billings -- Chief Executive Officer\n\nWell, look, we've generated operating leverage all over the building over the course of really the past three-or-so quarters. And I'm incredibly proud of the team for doing that. If you look at our rates, if you look at what we've done in food and beverage, really every nook and cranny we've driven operating leverage. So what you're seeing is that really the culmination not of aggressively reducing FTEs or negatively impacting the customer experience but rather pricing.\n\nAnd so, we go as -- with that in mind, we go as pricing does, right? And so, I'm loath to pin a margin and forecast whether we can maintain a 40% margin, an incredibly healthy margin because what we won't do is gut staffing and degrade the customer experience to even if there is a modest recession. We just don't do that. We are thinking about our brand over a 20-year term, not over a quarter. So I'm loath to pin a particular margin, but what I can tell you is that the team here is very appropriately managing staffing.\n\nWe are probably down about 10% from pre-COVID levels. yet our customer satisfaction scores are up, and we are pricing our product appropriately based on the quality of that product.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nGot it. And then, just pivoting to Interactive. Obviously, you guys have become a lot more rational. The markets become more rational in terms of pricing and promotion and marketing.\n\nAs we think about where we go from here as we go into football season in the back end of the year, how should we think about your burn rate relative to that 2Q number?\n\nCraig Billings -- Chief Executive Officer\n\nWell, what we have consistently said is that we'll be driving down the burn each quarter. Now Massachusetts, as I mentioned earlier, I think, to David's question, Massachusetts could change that. But I don't imagine it materially shifting. So it's really kind of immaterial in the grand scheme of things.\n\nAnd so, I wouldn't spend a bunch of time and brand damage trying to forecast it. The trend should be down with the exception of a few quarters that we might do some user acquisition in Massachusetts as the market opens.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nThanks for the detail.\n\nCraig Billings -- Chief Executive Officer\n\nYou got it.\n\nOperator\n\nThank you. Our next caller is Brandt Montour with Barclays. You may go ahead, sir.\n\nBrandt Montour -- Barclays -- Analyst\n\nHey, good afternoon, everyone. Thanks for taking my question. So in Las Vegas, I was hoping you could just talk about international inbound visitation? And maybe walk us around the globe, where you think you have the most sort of mix during normal times? We, obviously, have our assumptions. But if you could just walk us around the globe and talk about where you think you're going to see upside near term, medium term, long term? And how much of upside we could sort of see here?\n\nCraig Billings -- Chief Executive Officer\n\nI'll start, and then, I'll pass it to Brian. Keep in mind there are a lot of potential international visitors that have been unable to visit. So we've been able -- we've been quite successful on the international front despite that, but that is a tailwind that we have. Brian, do you want to talk about mix and opportunities?\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nSure. We've definitely seen a pickup in the international clientele, both from the gaming and non-gaming side of our business. Obviously, Canada and Mexico are the first ones that have popped up. We are seeing great traction in the U.K.\n\nnow. In fact, just came out of a meeting with the LVCVA and the lift out of London is actually at 106% now of what it was in 2019 pre-COVID level. So it means U.K. is back.\n\nThe biggest opportunity for us moving forward is, obviously, China. We are not seeing -- it's anemic at this point, and that's all based on what you all know out there. So right now, our biggest upside is China. We are seeing other Asian business come back, but not to the extent we'd like.\n\nSo I'm optimistic about what's in the future, and we got a lot of upside, I think, at some point.\n\nBrandt Montour -- Barclays -- Analyst\n\nOK. Great. Thanks for that. And just if I could follow up on Macau.\n\nMaybe you could just give us an update on your thoughts around the retendering process, any sort of surprises or anything that you'd want to let us know about in an update?\n\nCraig Billings -- Chief Executive Officer\n\nI'll start, and then, I'll ask Ian to provide his thoughts as well. Not really. I mean, we understand and appreciate what Macau is trying to achieve, diversifying the market, both in terms of the geographic origin of visitors and their motivations to visit is not a process that happens overnight. In Vegas, it took many years, and it was a concerted effort by both government and business.\n\nWe were instrumental in leading that change here in Vegas, and we will, of course, continue to play our part in Macau's journey to do the same. Ian anything you would add, in particular, on the tender requirements?\n\nIan Coughlan -- President, Wynn Macau\n\nI think, the rules that were issued and the time line, we're very clear. We have sought some minor clarifications and we're in a six-week process of crystallizing our responses, which will get submitted by all six operators on September 14. And then, we go into a period of negotiation. And I think, the government's intent is clearly before the end of the year to announce the successful operator.\n\nBrandt Montour -- Barclays -- Analyst\n\nOK. Thanks so much.\n\nCraig Billings -- Chief Executive Officer\n\nYou got it.\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nOK, operator, we'll take one last question.\n\nOperator\n\nThank you. And our final question comes from Robin Farley with UBS. You may go ahead.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thanks. Two things just to clarify that you've talked about it a little bit already. One was just for group for '23, what's your booked position or kind of room nights booked compared to 2019 at the moment for '23? It sounds like there was a lot of acceleration in the first half.\n\nI'm just wondering where that kind of you booked for '23.\n\nCraig Billings -- Chief Executive Officer\n\nBrian?\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nSure. We are ahead of both '19 and, obviously, '21, and we continue to pick up. We are not going to need to pick up much in the year for the year as we are focused on moving forward with actually a higher number. So we'll have -- we're hoping the highest number of group rooms we've ever had because of the expansion of the convention center we had a couple of years ago.\n\nSo really starting to grow into that space and take advantage of it. It also allows us with a slightly larger base to yield a little bit better our rates as we move forward into the year. So all encouraging but certainly better than '19 and '21.\n\nRobin Farley -- UBS -- Analyst\n\nOK. Great. Thanks. And then, the other question is just on the Vegas margins.\n\nAnd I know you talked about maintaining the guest experience and all of that. How much of the margin increase do you think is sustainable? Because the -- I guess, you said in the past on previous calls that you don't have as many open positions maybe as some other Vegas properties. But is there anything about the margin that you think is not sustainable? Or how would you sort of guide us to expect that?\n\nCraig Billings -- Chief Executive Officer\n\nSure. We learned to run the business differently before COVID. We've talked about this before. And we completely reevaluated how we do that.\n\nAnd so, we are running, I mentioned earlier on about 10% less FTEs than pre-COVID. And we're doing it in an absolute range of the market and our customer satisfaction scores are going up. So that's a real testament to the team. So I would consider that at this point, permanent.\n\nThe operating leverage that we were able to obtain out of the business units, look, room, as you well know, room prices fluctuate with supply and demand. So you can have positive operating leverage -- deleveraging operating leverage in rooms in a week's notice. On the food and beverage side, I suspect some of it's sticky. I mean, inflation is what it is, and we've been able to drive a decent amount of operating leverage out of the food and beverage portion of the business.\n\nSo it's a little bit of a mixed bag. But Robin, I guess, what I would say is the FTE count is what it is.\n\nRobin Farley -- UBS -- Analyst\n\nOK. Great. Thanks very much.\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nOK. Well, with that, we'll now close the call. Thank you, everyone, and we look forward to talking to you again next quarter.\n\nCraig Billings -- Chief Executive Officer\n\nThanks, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nCraig Billings -- Chief Executive Officer\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nJoe Greff -- J.P. Morgan -- Analyst\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nBrandt Montour -- Barclays -- Analyst\n\nIan Coughlan -- President, Wynn Macau\n\nRobin Farley -- UBS -- Analyst\n\nMore WYNN analysis\n\nAll earnings call transcripts"
}