{
  "companyName": "Chimerix",
  "companyTicker": "CMRX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/chimerix-cmrx-q2-2022-earnings-call-transcript/",
  "content": "Chimerix (CMRX -0.54%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the Chimerix second quarter 2022 earnings conference call. I would now like to introduce you to your host for today's call, Michelle LaSpaluto, vice president of strategic planning and investor relations at Chimerix. Please proceed.\n\nMichelle LaSpaluto -- Vice President of Strategic Planning and Investor Relations\n\nThank you, and good afternoon, everyone. This afternoon, we issued a press release on our second quarter operating update. You can access this press release in our investors section of our website. With me on today's call are president and chief executive officer, Mike Sherman; chief medical officer, Allen Melemed; chief financial and business officer, Mike Andriole; chief science officer, Randall Lanier; and our chief technology officer of Imipridones, Josh Allen.\n\nBefore we begin, I'd like to remind you that the statements made on today's call include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and are subject to risks and uncertainties and other factors. These risks and uncertainties and other factors could cause actual results to differ materially from those referred to in the forward-looking statements. Please refer to our filings with the SEC for a more complete disclosure of these risks and uncertainties. At this time, I would like to turn the call over to our president and chief executive officer, Mike Sherman.\n\nMike Sherman -- President and Chief Executive Officer\n\nGood afternoon, everyone. Thanks for joining us today. We've been busy the past few months, so let me get right to the details of the progress we've made, and I'll start with TEMBEXA. In July, we marked a significant milestone recording our first TEMBEXA product revenue covered by two international agreements of $35 million in aggregate.\n\nThis was only possible because we made the decision a couple of years ago to manufacture over 300,000 treatment courses of TEMBEXA at our own risk without a contract, somewhat atypical in the biodefense space. Because of that decision, we were able to take advantage of this opportunity immediately, completing contracts and shipping products in a matter of days. If you're looking to isolate and Chimerix's execution as it relates to creating and delivering on contracts, these are great examples. The same decision to manufacture product at risk will also position us to respond immediately to place TEMBEXA into the U.S.\n\nstockpile once the BARDA agreement is in place. We mentioned previously that the monkeypox outbreak introduced some new considerations for both BARDA and Chimerix. So we are and have been thoughtful to address those urgently. In the meantime, the international sales we recorded have satisfied our near-term capital needs.\n\nYou may be aware that while TEMBEXA was approved for smallpox, preclinical data does support the activity of TEMBEXA against multiple orthopoxviruses, including monkeypox. The FDA commented on that potential in their post-approval manuscript. And the fact of the matter is no randomized control studies have been performed in humans with monkeypox with either of the FDA-approved antivirals for smallpox. And there are still a lot of unknowns as the virus spread and mutates into potentially more resistant strains.\n\nWe're working with leading infectious disease physicians on potential options to generate additional data. Let me now turn to ONC201. Pleased to announce today the design details of our phase 3 ACTION study of ONC201. This is the most advanced study in this H3 K27M population of patients.\n\nI'll let Allen go into the design details, but let me make a few points upfront. We've worked with KOLs across disciplines and geographies to design a trial with a probability of success that's high and multiple ways to achieve this efficiently. The ACTION study is highly differentiated from the other phase 3 studies that have been performed in the broader glioblastoma space. It really comes down to the phase 2 data we have in hand and the circumstance in which it was generated compared to other drugs that really differentiate this drug's likelihood of success.\n\nI should first note that about a third of the studies in this space advance the phase 3 without phase 2 data. For those that did advance based on phase 2 data, it was rare that the patient population was associated with a targeted genetically specified mutation like H3 K27M. With that target, we can focus on the same homogeneous population of patients in phase 3 that were the source of the data in phase 2. We can also identify those patients with the same tools used in phase 2, which are reliable diagnostic methods already nearly universally used.\n\nThe isolation of single-agent activity is also critical. Many previous phase 2 studies have been conducted with drug combinations or have failed to have adequate wash-out periods to distinguish drug effect. They then relied on time point endpoints like PFS compared to historical benchmarks. And in contrast, we've carefully isolated the single-agent activity of ONC201 in our phase 2 data.\n\nImportantly, we've measured tumor response using RANO criteria, the most rigorous standard. This method was developed to address some of the shortcomings of prior response rate measures such as the Levin and MacDonald criteria. Our overall response rate of 20% to 30% in the relapse setting using RANO, complemented by the durability of those responses evaluated by blinded independent central review, also increase our confidence relative to prior studies done using less stringent criteria. It's also critically important that our efficacy data was generated in the absence of anti-angiogenic drugs like Avastin, which can confound imaging and yield false response and progression assessments, which have historically failed to translate to phase 3 success for other drugs.\n\nAnd finally, the consistency across multiple clinically meaningful endpoints is particularly convincing. The ONC201 data demonstrates a clear association between response and a reduction in steroid use and an improvement in performance status. There's also an association with survival as all responders were alive at two years or were alive at the data lock if that was earlier than two years. For patients who did not achieve a response, none were alive at two years.\n\nThe internal consistency of this data is striking. We previously noted the ongoing work related to compiling safety data to strengthen the risk-benefit assessment of ONC201. Last fall, we reported just a summary of safety data from the 50-patient efficacy cohort. I'm now happy to say we've completed a more robust assessment of over 200 patients, and the results reveal a very attractive safety profile as expected.\n\nI'll turn the call over to Allen to share more about the details of the phase 3 ACTION study as well as hit on those findings in the latest safety assessment. Allen?\n\nAllen Melemed -- Chief Medical Officer\n\nThank you, Mike. I'm excited to briefly go over the details of our ACTION phase 3 study. We expect to activate select U.S. site later this year and continue into international sites throughout the first half of next year.\n\nACTION is a randomized, double-blind, placebo-controlled and multicenter study in newly diagnosed diffuse glioma patients whose tumor harbor the H3 K27M mutation. Treatment with ONC201 will occur following completion of radiation therapy. The study will enroll approximately 450 patients, who'd be randomized to receive 625-milligram of ONC201 at one of two dosing frequencies once with twice weekly or placebo. The primary endpoint of the study is overall survival.\n\nThe study will also evaluate progression-free survival with an alpha control for both OS and PFS. OS will be assessed for efficacy at three alpha control time points, two interim analysis by the independent data monitoring committee followed by a final assessment. The final PFS analysis will be formed using RANO HGG blinded independent central review. Participants in this study must have a Karnofsky or Lansky performance status, which is a measure of patient's ability to perform ordinary tasks of greater than or equal 70 at the time of randomization.\n\nKey exclusion criteria are the presence of a primary spinal tumor, diffuse intrinsic pontine glioma, evidence of leptomeningeal spread of disease or cerebrospinal fluid dissemination. The study will take place up to 120 sites in North America, Europe, and Asia Pacific. The first interim analysis is anticipated in early 2025 with final data in 2026. The study has greater than an 80% power with an assumed hazard ratio of 0.65 overall survival and 0.60 for progression-free survival.\n\nIndependent comparison will perform for each ONC201 study group versus control at each time point. The study design builds on findings from the phase 2 data that should increase the likelihood that patients will respond ONC201. These factors include moving to [Inaudible] align, likely including patients with less bulk disease, increasing the time for patients being on ONC201 as well as limiting the study to patients with KPS of greater than or equal to 70. All of these factors were associated with better response in the phase 2 data set.\n\nIn addition, the study design has a number of elements, which should support rapid enrollment. This includes a wider time line to identify patients as there's a natural six-week gap between initial diagnosis and completion of radiation therapy. The presence of an H3 K27M mutation will be  identified as part of the standard of care at the time of initial diagnosis with a widely available test. In addition, patients are twice as like to receive ONC201 placebo.\n\nWe receive excitement from numerous KOLs globally to participate in the study. Lastly, we have been keenly listening as FDA guidance and expectations for oncology development programs are evolving. In addition to an increased push toward randomized clinical trials registration, FDA has pushed further which is a multiple dose in a target indications, which is included discussions with Chimerix, noting that ONC201's efficacy was mainly based on the single dose and schedule, we incorporated an additional dose in the phase 2study with the upside of increasing study enthusiasm and probability of a successful study. This additional schedule has been well tolerated in previous ONC201 trials.\n\nIn the meantime, we have been updating our ONC201 safety data analysis that includes a robust safety analysis performed by 211 patients. With this new safety data added to the efficacy data we've already reported, we now have a better characterization of this risk benefit of this drug. In this analysis, treatment emergent adverse events that were drug-related, were generally Grade 1 and 2. The most common events were headache, fatigue, nausea and vomiting.\n\nThe only related adverse event of Grade 3 or higher that occurred in more than 2% of patients was fatigue reported at 2.8%. Adverse events reported in the pediatric population were generally similar to that reported in adults. Only five patients, 2.4%, experienced a treatment-related adverse event leading to this type of drug discontinuation, reduction, or interruption. These events were neutropenia in three patients, hypersensitivity in one patient, neutrophil count 50 creatine in one patient, and a [Inaudible] in one patient.\n\nWith the phase 3 trial soon underway and this data in hand, we plan to reenvisage the questions of accelerated proof-of-based on the phase 2 data with the FDA in the fourth quarter of this year. With that, I turn it over to Mike Andriole to speak to our financial results.\n\nMike Andriole -- Chief Financial and Business Officer\n\nThanks, Allen, and good afternoon, everyone. With Allen's overview of the ACTION study and rationale for why we're optimistic about its outcome, I wanted to just make a few comments on the potential commercial market for ONC201. As most of you are aware, diffuse gliomas are a particularly lethal form of brain cancer and H3 K27M mutants are among the worst of what is already a poor prognosis. The unmet need for new therapies in glioma broadly and H3 K27M mutants in particular, is among the highest unmet needs in all of oncology.\n\nAs it relates to ONC201, our market research indicates that the unaided awareness of this agent for H3 K27M mutants is already high. And following the participation in the ACTION study of up to 120 sites across the major markets, we expect the association of this agent to H3 K27M mutations will be nearly ubiquitous among top prescribing neuro-oncologists. If the ACTION study is successful, we expect this awareness will translate to rapid adoption of the therapy in major markets. This likely adoption should be aided by a competitive landscape that is quite attractive.\n\nSpecifically, we're not aware of any other phase 2 or phase 3 programs in the industry targeting this mutation. These dynamics likely make ONC201 unique in a market where there have been several examples of underperforming commercial launches in oncology in recent years. Consequently, we view the commercial risk here is relatively low and continue to view this as a worldwide annual revenue opportunity that should comfortably exceed $500 million. As Mike mentioned earlier, this past July, we announced two international TEMBEXA procurement contracts, totaling nearly $35 million.\n\nWe've delivered nearly all of that product recently, and will realize at least $32 million in revenue in the third quarter. On a pro forma basis, cash at the end of June would have been approximately $70 million when including this additional revenue. As it relates to the pending transaction for the sale of TEMBEXA to Emergent in late July, the HSR waiting period expired. That satisfied one of the key closing conditions.\n\nThe other two remaining key closing conditions are execution of the procurement contract with BARDA and BARDA's approval of a pre-novation agreement between Chimerix and Emergent. I know that investors are eager to have a BARDA contract executed, as are we. Certainly, the recent declaration of the monkeypox outbreak as a public health emergency by both the WHO and HHS has influenced how both parties are approaching the final details of this agreement. To that end, we'll work expeditiously with our counterparts at BARDA to finalize the contract as soon as reasonably possible.\n\nIn the interim, we continue to operate the business in the ordinary course and we'll provide another update to the market on the finalization of the BARDA agreement when we can. With our  current cash position, in addition to the expected cash generated from the sale of TEMBEXA, Chimerix expects to be well positioned to advance the ACTION study and other pipeline programs without concern of a near-term dilutive financing. Now moving to our statement of operations. The company reported a net loss of $23.5 million or $0.27 per basic and diluted share for the second quarter of 2022, compared with a net loss of $17.8 million or $0.21 per basic and diluted share in the second quarter of 2021.\n\nResearch and development expenses increased to $18 million for the second quarter of 2022, compared to $13.8 million for the same period in 2021. The main driver of this increase is the ongoing development related to ONC201. General and administrative expenses increased to $5.8 million for the second quarter of 2022 compared to $4.4 million for the same period in 2021. And with that overview, I'll now turn the call back to Mike Sherman for closing remarks.\n\nMike?\n\nMike Sherman -- President and Chief Executive Officer\n\nThanks, Mike. Before I open it up for questions, I'd like to take a minute to welcome Christopher Jordan to the team as our vice president of regulatory affairs. Christopher comes to us with over 30 years of pharma experience across all stages of product development. Some of our management team have had the pleasure of working with Christopher at Endocyte and Novartis, where he recently led the regulatory strategy and execution of the FDA approval and EMA submission of PSMA-617 or Pluvicto as it's now known.\n\nHis knowledge in the oncology field and track record of navigating complicated regulatory processes will be a great addition to the team as we continue the development of our oncology pipeline. With that, Brianna, I'll turn it over to you to open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Your first question will come from Maury Raycroft with Jefferies. Your line is now open.\n\nMaury Raycroft -- Jefferies -- Analyst\n\nHi. Thanks for taking my questions, and congrats on getting the phase 3 design. For the phase 3, you have two interim OS assessments by independent data monitoring committee at 164 events and then 246 events and then the final at 327 events. If successful, could either the initial interim assessments at 164 or 246 be enough to file for approval?\n\nMike Sherman -- President and Chief Executive Officer\n\nYes, those are designed such that with statistical significance at those endpoints. You've got -- you'll have PFS in hand response rate data in hand and overall survival with -- at those early end points, pretty significant advantages, we would expect those to be the basis of a regulatory submission and approval.\n\nMaury Raycroft -- Jefferies -- Analyst\n\nGot it. And then also, can you talk more about the twice-a-week dosing and what you've seen in prior clinical data that supports the rationale for moving the twice per week dosing into the phase 3?\n\nMike Sherman -- President and Chief Executive Officer\n\nI may just turn that direct over to Allen and Josh to share both the rationale for including it as well as some of the experience we've had with it in prior trials.\n\nAllen Melemed -- Chief Medical Officer\n\nYes. This is Allen. I'll start. We have evaluated twice weekly dosing and have been shown that this has been in effect a safe regimen in several studies.\n\nOne of the reasons why to move this forward is we wanted to have the opportunity to have even a more intense dose. We know that we want to try to maximize the effect we've seen, and we really haven't seen any challenge so far with safety from the current dosing regimen. This also is addressed in part from what you've seen from the FDA regarding optimization of dose. And we think that this helped also address the situation where you have two shots on goal and essentially, you have two places for a patient to get on study with ONC201.\n\nI'll pass it on to Josh for any additional comments.\n\nJosh Allen -- Chief Technology Officer of Imipridones\n\nSure. This is just speaking to the rationale really comes from preclinical in vitro findings showing that the efficacy of ONC201 can be increased with prolonged exposure to the same concentration a little bit of a sweet spot toward 48 hours with an in-basin time really leading to that maximal effect. So the thinking is that we're getting into these brain tumors with the current dose, achieving therapeutic concentrations. And if we can just prolong that duration for an extra day by giving a second dose on a consecutive day there, that might be the key to unlocking an increasing efficacy based on those models.\n\nSo that in combination with the safety experience in the clinic that Allen has put through is what the system incorporates that.\n\nMike Sherman -- President and Chief Executive Officer\n\nI'll add one other thing, Maury, the notion that to encourage an enrollment in this trial, you would need to go to a 2-1 randomization anyway if it were a single schedule. And so you kind of get that 2-1 benefit here with just a little bit higher  in aggregate. So it's, I think, a good use of the statistical power in order to get another shot on goal for success and still encourage patients to enroll.\n\nMaury Raycroft -- Jefferies -- Analyst\n\nGot it. That's all helpful. And maybe last question for me. Just wondering if in communications with FDA, if they communicated on whether an accelerated approval path based on the phase 2 data and additional supporting data, if that's still on the table?\n\nMike Sherman -- President and Chief Executive Officer\n\nYes, as we discussed at our last call, we essentially delayed that conversation after their feedback earlier this spring with a focus on getting -- moving with the phase 3 trial and knowing that without this additional safety data in hand, we were a little bit limited in our ability to make a strong case for the risk-benefit assessment. So now that we have this additional safety data set, which really plays out exactly as we expected, we'll be able to go back to them. So in the meantime, we really haven't pushed that conversation beyond the phase 3 trial. We'll revisit that here later this year.\n\nMaury Raycroft -- Jefferies -- Analyst\n\nGot it. OK. Thanks for taking my questions.\n\nMike Sherman -- President and Chief Executive Officer\n\nThanks, Maury.\n\nOperator\n\nYour next question comes from Joseph Thome with Cowen. Your line is now open.\n\nJoseph Thome -- Cowen and Company -- Analyst\n\nHi there. Good afternoon. Thank you for taking my question. Maybe the first one, just on ONC201.\n\nWith the phase 3 , you're administrating shortly after completion of radiation. Is there a time frame that's mandated in the study? And maybe can you compare this to the time frame post radiation that patients saw ONC201 in the phase 2 analysis population, that would be helpful.\n\nMike Sherman -- President and Chief Executive Officer\n\nSure. I'll let Allen answer that one.\n\nAllen Melemed -- Chief Medical Officer\n\nSo there's a couple of ways you're looking at it. It's one of the reasons we've done this way, we're allowing patients to start the screening process when they are initially diagnosed and then starting the radiation therapy. So you have plenty of time where you can actually grab the patients. There's a specific time frame which you should be in grind in mind, which I believe and Josh, correct it, they had six to eight weeks post radiation -- I'm sorry, not post radiation -- post initial diagnosis.\n\nBut I want Josh to clarify the exact timing. I don't really have that in my front of me.\n\nJosh Allen -- Chief Technology Officer of Imipridones\n\nYes, sure. We'll enroll in the range of two to six weeks post radiation for this study, and that contrasts to the prior efficacy analysis in the relapsed setting was more than three months, that wash-out period there. So this study is substantially moving patients up closer to radiotherapy, which we think will get them a better shot at having prolonged duration of therapy and perhaps better response as well.\n\nJoseph Thome -- Cowen and Company -- Analyst\n\nOK. Perfect. And then maybe jumping over to TEMBEXA. Is there a time limit associated with the EBS deal closing and when the BARDA contract needs to be finalized, is that to be a 2022 event? And then second part of that, should we anticipate any substantial additional ex U.S.\n\nrevenues going forward? Or have you kind of hit the key markets?\n\nMike Sherman -- President and Chief Executive Officer\n\nI'll let Mike hit those two questions.\n\nMike Andriole -- Chief Financial and Business Officer\n\nYes, there is an outside date in that agreement that's available there for both parties, Joe, it's September 30 in that agreement. And then as it relates to the international opportunity, we continue to have discussions with parties internationally. I think the declaration of the public health emergency, certainly by the WHO continues to sort of activate interest in those conversations. So the contracts that we entered into at the end of June were certainly ones that we were able to turn around very quickly.\n\nWe'll continue to have those conversations in the weeks ahead.\n\nJoseph Thome -- Cowen and Company -- Analyst\n\nThank you very much.\n\nOperator\n\nYour next question comes from Ed White with H.C. Wainwright. Your line is now open.\n\nEd White -- H.C. Wainwright -- Analyst\n\nGood evening. Thanks for taking my questions. Just circling back to the potential for accelerated approval, have you set a meeting date with the FDA yet regarding accelerated approval? And does using the two different dosing schedules in the phase 3 study somewhat tamper the expectations for accelerated approval?\n\nMike Sherman -- President and Chief Executive Officer\n\nYes, I'll let others add to this. We're preparing the materials that would be the basis for that meeting now as the safety data set is just -- has just been completed. I would suggest that having that study in place and up and running and really well advanced at the time an action from the regulators would be taken on an accelerated approval is a big part of what the FDA wants and needs to see in considering an accelerated approval. So I think that would actually provide some comfort.\n\nIf we were exploring lower doses, I think that could be potentially problematic in their review, but because we're actually exploring the potential of a more efficacious higher dose that, obviously, if it's not more effective or it's insufficient safety, then that would not impact an accelerated approval relative to the lower dose. It actually also simplifies some potential commercial issues that might arise to your lowering your dose from an accelerated approval regimen. So I don't think it impacts in a negative way their consideration. In fact, I think having a robust design with certainty around having overall survival to confirm full approval really was going to be required anyway, and this just gets them a much more robust assessment of that.\n\nAnd frankly, consistent with their guidance as it relates to -- for a dose optimization that I think would be supportive of that conversation.\n\nAllen Melemed -- Chief Medical Officer\n\nMike, can I add? This is Allen. I think part of this goes back to the feedback we received and actually all suits received from FDA years back. So dose optimization really wasn't in the situation back then, things that evolved in FDA. So again, if you go according to what they've said, the finalization often we're focused on the phase 3 aspect of that.\n\nSo I do think I agree with Mike, that we have still had the reasons to discuss it. This is also very high unmet need population with significant need.\n\nEd White -- H.C. Wainwright -- Analyst\n\nOK. And then just on TEMBEXA. Regarding monkeypox, have you been approached by any government outside the U.S. regarding potential purchases due to monkeypox? And perhaps if you could just review in a little bit more detail the preclinical data for monkeypox and your thoughts on either you or Emergent pursuing studies in monkeypox?\n\nMike Sherman -- President and Chief Executive Officer\n\nMaybe I think, Ed, as it relates to the conversations with parties outside the U.S., those were likely accelerated as a result of monkeypox, although maybe never directly referenced in that context, given the approval in smallpox. As Mike said, those conversations are ongoing. Maybe I'll turn it over to Randall, just to make a couple of comments, knowing that there  are a lot of unknowns in terms of the treatments for monkeypox. There is some pretty compelling basis to believe that TEMBEXA be an active and safe agent for use in this population.\n\nRandall Lanier -- Chief Science Officer\n\nSure, Mike. So I'll start, I guess, with in vitro and just say that monkeypox is the second most sensitive orthopoxvirus we've ever tested. It's about twice as sensitive to TEMBEXA as variola, about four times more sensitive than the mousepox virus that we used for approval and about 14 times more sensitive than the rabbit pox virus that we use for approval. So from an in vitro standpoint, there's every reason to believe that monkeypox would be highly responsive to TEMBEXA.\n\nWe also have two animal models, one of them in mice, which showed 100% protection from monkeypox virus infection with TEMBEXA and then one in prairie dogs, where it was sort of intermediate protection, but it turned out that prairie dogs, like monkeys, actually anabolized TEMBEXA so much faster. So the exposure within prairie dogs of TEMBEXA is about 15% that of human. And that's the reason that we saw kind of intermediate responses there. With respect to humans, obviously, there's the published cases of three monkeypox virus cases in the U.K., where all three patients responded very well to TEMBEXA.\n\nAnd the paper was actually fairly negative on the drug for reasons that we don't fully understand, but the patients receiving TEMBEXA did all fully recover. There was clear virologic effects. They did have transient ALT elevations that caused TEMBEXA to be discontinued. But the patients all responded fully.\n\nAnd I should just add that with regard to the ALT elevations, the manuscript ignored all of the FDA data, which was instead of three patients, was 392 TEMBEXA recipients versus 208 placebo recipients, where the ALT elevations were 7% in the TEMBEXA arm and 5% in the placebo arm. So all of the data suggests that this drug should work quite well for monkeypox.\n\nEd White -- H.C. Wainwright -- Analyst\n\nOK. Great. Thanks for taking my questions.\n\nOperator\n\nYour next question comes from Soumit Roy with JonesResearch. Your line is now open.\n\nSoumit Roy -- JonesResearch -- Analyst\n\nHi, everyone. Congratulations on all the progress. A quick question on the ACTION trial. Possibly, Allen, if you can remind us from the relapsed/refractory glioma phase 2, what were the immediate prior treatment regimen for those patients? Was it mostly radiation and also the temozolomide chemo? And the second is on ACTION, would have been better to have a physician's choice as a control arm rather than a placebo? Just any thoughts?\n\nAllen Melemed -- Chief Medical Officer\n\nYes. So in the first quarter, the choice of the control arm. And I think the -- I think it's important to note in the control in the phase 3 trial, post radiation therapy, there really is no standard of care. Patients typically receive the radiation therapy and then they wade wait into progressive disease.\n\nSo this is an ideal time to study this. It also builds on some of the factors we saw in the phase 2 trial that we think will actually increase the probability of the success. Typically, this study, you're going to have a little smaller disease, you're going to be on therapy longer, and we're going to include the lower KPS score including the 60s. So we do think these factors increase our probability of technical success in this population.\n\nI'm going to ask Josh to kind of go through what you found in the prior therapy with the one who initially doing these trials from the phase 2 studies. Josh?\n\nJosh Allen -- Chief Technology Officer of Imipridones\n\nYes, with regards to the prior therapies in that recurring experience, obviously, all of these patients had radiation recurred and weighted more than 90 days as I've noted on an earlier comment. In terms of additional therapies, these patients all prior to getting ONC201 tended particularly in the adult population to include temozolomide, even though that chemotherapy is known to not have a benefit within subsets of H3 K27M-mutant glioma. We still saw exposure to that just given the path of other agents. Other therapies included bevacizumab for symptomatic relief with edema in addition to [Inaudible], so really just a mixture of chemotherapy, and we're hopeful that moving earlier as we've noted a couple of times, moving earlier in line the therapy prior exposure to those chemotherapies will increase the likelihood of our patients benefit of ONC201.\n\nSoumit Roy -- JonesResearch -- Analyst\n\nGot it. And one last question ONC206. Just curious on the time line, what are you thinking of to bring this drug pre-IND or in the clinic?\n\nMike Sherman -- President and Chief Executive Officer\n\nYes. We've mentioned that drug is being evaluated in two studies: one, a pediatric and another an adult. The adult study is being sponsored by the NIH and to be fair, our focus has really been on accelerating ONC201. And so we are escalating that dose through that program.\n\nI would expect to be able to get into sort of the therapeutic window here into next year. But we'll report separately as we get closer to what we expect to be a data readout on that ANDA selection for an indication that we would pursue that. One of the things we've talked about in the past is that even though there's the targets for ONC206 are the same as ONC201, that drug opens up different opportunities in terms of development within oncology and so we would expect to pursue certain nonoverlapping indications initially with ONC201.\n\nSoumit Roy -- JonesResearch -- Analyst\n\nGot it. Thank you so much for taking the questions.\n\nMike Sherman -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThere are no further questions at this time. I will now turn the call back over to Mike Sherman.\n\nMike Sherman -- President and Chief Executive Officer\n\nThanks, Brianna, and thanks again, everyone, for joining the call. We look forward to the next update, particularly on the progress of the BARDA contract. Thank you. Have a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichelle LaSpaluto -- Vice President of Strategic Planning and Investor Relations\n\nMike Sherman -- President and Chief Executive Officer\n\nAllen Melemed -- Chief Medical Officer\n\nMike Andriole -- Chief Financial and Business Officer\n\nMaury Raycroft -- Jefferies -- Analyst\n\nJosh Allen -- Chief Technology Officer of Imipridones\n\nJoseph Thome -- Cowen and Company -- Analyst\n\nEd White -- H.C. Wainwright -- Analyst\n\nRandall Lanier -- Chief Science Officer\n\nSoumit Roy -- JonesResearch -- Analyst\n\nMore CMRX analysis\n\nAll earnings call transcripts"
}