{
  "companyName": "Stitch Fix",
  "companyTicker": "SFIX",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/21/stitch-fix-sfix-q4-2022-earnings-call-transcript/",
  "content": "Stitch Fix (SFIX)\nQ4 2022 Earnings Call\nSep 20, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Stitch Fix fourth quarter 2022 earnings call. Today's conference is being recorded. At this time, I'd like to turn the conference over to Hayden Blair. Please go ahead.\n\nHayden Blair -- Investor Relations and Treasury\n\nGood afternoon. and thank you for joining us today to discuss the results for Stitch Fix's fourth quarter and full year 2022. Joining me on the call today are Elizabeth Spaulding, CEO of Stitch Fix; and Dan Jedda, CFO. We have posted complete fourth quarter and full year 2022 financial results in a press release on the quarterly results section of our website, investors.stitchfix.com.\n\nA link to the webcast of today's conference call can also be found on our site. We would like to remind everyone that we will be making forward-looking statements on this call, which involve risks and uncertainties. Actual results could differ materially from those contemplated by our forward-looking statements. Reported results should not be considered as an indication of future performance.\n\nPlease review our filings with the SEC for a discussion of the factors that could cause the results to differ. In particular, our press release issued and filed today, as well as the Risk Factors section of our quarterly report on Form 10-Q for our third quarter previously filed with the SEC and the annual report on Form 10-K for fiscal year 2022, which we expect to be final tomorrow. Also note that the forward-looking statements on this call are based on information available to us as of today's date. We disclaim any obligation to update any forward-looking statements, except as required by law.\n\nDuring this call, we will discuss certain non-GAAP financial measures. Reconciliations to the most directly comparable GAAP financial measures are provided in the press release on our Investor Relations website. These non-GAAP measures are not intended to be a substitute for our GAAP results. Finally, this call in its entirety is being webcast on our Investor Relations website, and a replay of this call will be available on the website shortly.\n\nI'd now like to turn the call over to Elizabeth.\n\nElizabeth Spaulding -- President\n\nThank you, Hayden, and thank you, all, for joining us for Stitch Fix's Q4 2022 earnings call. FY '22 was a pivotal year for Stitch Fix as we embarked on a significant transformation with the full rollout of Freestyle. Freestyle, combined with our original Fixes offering, broadens our ecosystem and our ability to solve the hardest consumer shopping and styling problems, fit, discovery, and human relationships. These differentiators remain as relevant as ever as we provide our clients with the right product at the right time.\n\nWe learned a lot over the course of FY '22 and we are building on our areas of progress. In this challenging macroeconomic environment, and as we continue to work through our transformation, we recognize that returning to profitability is of utmost importance. This is our top priority. This will happen by both returning to active client growth and by optimizing our cost base.\n\nWe are pleased with the progress that we made in Q4 on rightsizing our cost base, and we are on track to exceed the top end of our expected annual savings in FY '23. Today, I will first provide details on our financial performance in Q4 and FY '22. Then I will discuss how we are building on our learnings from this past year to drive net active clients and improve how we operate the business for both scale and profitability. Dan will then share more details on our cost management and productivity efforts.\n\nFirst, on our financials. The realities of record inflation levels and a deteriorating retail landscape resulted in slower discretionary spend in apparel and presented us with an increasingly challenging fourth quarter, particularly in June and July. Q4 net revenue declined 16% year over year to $482 million, driven by a 9% year-over-year decline in net active clients, which ended FY '22 at 3.8 million. Adjusted EBITDA in the quarter was negative $31.8 million.\n\nRevenue per active client grew 8% year over year to $546 in the fourth quarter. Looking at our full FY '22, net revenue declined 1% year over year to $2.1 billion, along with an adjusted EBITDA loss of $19.5 million. Despite this, Freestyle revenue grew 21% year over year with penetration from our fixed client base steadily increasing since its launch. Now let me share more on our go-forward strategy for FY '23.\n\nFirst, we're capitalizing on the health of our existing customer base by nourishing our core differentiators and improving our unique experience. Second, we're focused on net active client growth by broadening our marketing portfolio, refining the onboarding experience to capture both new and prospective clients, and targeting strategies that reengage previously active clients. And finally, we're committed to managing our costs efficiently and strengthening our infrastructure in order to build a profitable business that is ripe for future expansion. Starting on the first point.\n\nWe know we win when our clients feel heard when we send the right items based on personal preference and fit and when we push style boundaries in new ways. Our powerful combination of data science and creative human judgment has enabled us to ship over 75 million fixes and to fulfill over 10 million free sell orders to date. We also know that the first few experiences with Stitch Fix represent a critical opportunity to build a long-term relationship and keep our clients coming back for more. In FY '23, building on our strength of listening and responding to client requests and meeting the moment, we are evolving our stylist request nodes to include the ability to add specific occasions so that our stylists can deliver stronger choices in these discovery moments.\n\nWe also plan to insert more opportunities to collaborate with our stylist community in real time. Additionally, we're working to deliver a diverse assortment that showcases our varying price points. especially at a time when consumers are more cost-conscious. We believe these efforts will drive higher engagement and further cement Stitch Fix as the go-to online styling partner for both current and future customers.\n\nOn to the second point, we recognize that reigniting the active client flywheel is vital for growth. We know that success will not only come through new client activation but also through prospective clients and reengaging clients who haven't shopped with us for over 12 months. In mid-September, we released our first ever multinational brand campaign with the goal of communicating how Stitch Fix works and celebrating the personalization that we deliver. While traffic improved through the second half of FY '22, we expect this campaign to drive a sizable increase in impressions across TV, paid social and branded content partnerships and by building brand awareness will increase traffic to our ecosystem.\n\nWe also launched an affiliate influencer network in early August. Though small today, we plan to scale quickly with a goal of incorporating our stylist throughout FY '23 as a way to tap more into our unique differentiators. And lastly, over the course of FY '22, we made improvements post the Freestyle launch to get conversion to a better place since its low point earlier in the year, and we're making further investments in the client onboarding journey to drive conversion rates even higher. These investments include style quid simplification and seamless login experiences in order to reduce barriers to entry and more immediately show how we serve client interest.\n\nWe also have many prospective clients who've given us information but has yet to convert and many who haven't shopped with us for over 12 months, both of which represent opportunities for reengagement. We're approaching these moments of reengagement with new strategies given our expanded offering. As an example, we are enhancing our email programs to include algorithmically generated product reviews that better showcased our inventory and are leveraging more stylist-centric messaging and content. On the third and final point on enabling profitable growth and expansion.\n\nIn the near term, and as Dan will share more, we are taking a variety of important actions to continue to improve our free cash flow. More broadly, we are focused on developing our infrastructure to drive profitable growth and support our future expansion. With our tech infrastructure, we're investing in our structured data platform and more modular architecture to enable faster launch of new client features. We're also innovating on our core algorithms to allow for dynamic engagement and real-time styling.\n\nWith this complex work well underway, we're confident in our technology strategy. By evolving our underlying infrastructure, we're creating a stable foundation for scale and are setting the stage for profitable growth in FY '24. I'd like to conclude by thanking our team for all their hard work and innovating on behalf of our customers. We will continue to adapt as needed to build value for our shareholders without losing sight of the customer-centric culture that defines Stitch Fix.\n\nI'm proud of the team that we've built the strategy we have now set in place, and I feel encouraged by what this next chapter brings for Stitch Fix. We're clear-eyed about the current challenges that the macro environment presents, and we remain focused on the key initiatives discussed today in order to deliver exceptional shopping and styling experiences to our clients and to achieve profitability in the future. With that, I will turn the call over to Dan.\n\nDan Jedda -- Chief Financial Officer\n\nThanks, Elizabeth, and hello to everyone joining us on today's call. As Elizabeth discussed, our business is undergoing a significant transformation, which we are pushing forward in FY '23. At the same time, we recognize the challenges presented by the current macro environment. And as such, we continue to direct our business in a financially responsible manner.\n\nIn Q4, we generated net revenue of $482 million, down 16% year over year, driven by softness in Fixes volume, which was partially offset by demand in Freestyle. July was especially challenging in tandem with macroeconomic deterioration throughout the summer months and as consumer discretionary spend pulled back from apparel. Notably, these trends have continued in the first half of Q1. Active clients ended Q4 down 3% sequentially and 9% year over year at 3.8 million.\n\nQ4 gross margin was 40%, driven largely by increased inventory reserves and higher liquidations to the excess spring and summer goods. Adjusting for this increase in our inventory reserve and higher liquidations, gross margin was 42.5%, a decline of about 400 basis points from a year ago. This reduction is primarily due to tightening product margins from rising inflation and increased penetration of national brands, as well as an increase in transportation costs. Sequentially, gross margin was flat once adjusting for the increased inventory reserves and higher liquidations.\n\nTurning to inventory. We ended Q4 with net inventory down 7% year over year and down 7% quarter over quarter to $197 million. We took action in the quarter to rightsize our inventory through our July limited sales event and third-party liquidations, which focused on moving spring and summer product. Looking ahead, we are continuing our efforts to rightsize our inventory position to be in line with demand.\n\nFor any excess inventory, we'll look at utilizing limited sales events, continuing to use third-party liquidators, and delaying inbound receipts or holding inventory based on the right economic decision. We will likely continue to see elevated inventory levels in the first half of our fiscal year, but we expect to see lower levels relative to demand in the back half. Advertising was just under 10% of net revenue in Q4, slightly down over Q3 but up 390 basis points versus the same quarter last year. For the full year FY '22, advertising represented approximately 9% of net revenue.\n\nFor FY '23, we expect to maintain levels of spend at around 9% of net revenue as we grow the virality of Stitch Fix, as well as continue to improve on our core performance marketing channels and expand into newer channels, such as SEM, influencers, and affiliates. Moving on to adjusted EBITDA. Q4 adjusted EBITDA was negative $32 million. This excluded $26 million in restructuring and other one-time charges.\n\nWe ended Q4 with no debt and $231 million in cash, cash equivalents, and highly rated securities, as well as an undrawn $100 million revolving line of credit. Now on to our outlook. There are a number of factors impacting the predictability of our forecast. As we turn the page on FY '22, we are focused on the goal of achieving adjusted EBITDA profitability and positive free cash flow.\n\nOur path to profitability consists of customer-centric actions intended to grow active clients, increasing leverage in gross margin, improving fixed and variable productivity, and driving positive free cash flow. Elizabeth discussed our focus and actions on driving active clients. On gross margin, we expect both Q1 and full year gross margin to be around 42%, and primarily reflecting an improved inventory position and expected lower transportation costs versus the fourth quarter of FY '22. SG&A, excluding advertising and stock-based compensation, was down 8% sequentially and essentially flat year over year when excluding restructuring and one-time charges.\n\nWhile we are pleased with our expense control in Q4, we will continue to focus on reducing fixed cost and improving variable productivity. As we optimize our cost structure, we will continue to evaluate our real estate footprint and prioritize our investment in product and technology. With these efforts in place, we are on track to exceed the high end of the $40 million to $60 million in expected annual cost savings we discussed last quarter. In addition to cost savings, we are also focused on driving toward positive free cash flow and expect to improve our overall cash conversion cycle in FY '23 by rightsizing inventory, extending vendor terms, and investing in capex with near-term positive ROI.\n\nMoving to our outlook. It's important to note that lower active clients in FY '22 will have an impact on revenue. particularly in the first half of the fiscal year. With this in mind, we expect total revenue to be between $1.76 billion and $1.86 billion for full year FY '23.\n\nWe will manage the business toward a goal of being adjusted EBITDA and free cash flow positive sometime in FY '23. For the full year FY '23, we expect adjusted EBITDA to be between negative $45 million and negative $25 million. Moving on to Q1. Largely due to the dynamics previously discussed on the current state of net active clients and the associated ongoing impact of macro challenges, we expect Q1 revenue to be between $455 million and $465 million.\n\nDue to our ongoing efforts in reducing our cost structure, we expect Q1 adjusted EBITDA will substantially improve versus Q4 of FY '22 and be negative $15 million to negative $10 million. This guidance assumes net active clients will be down quarter over quarter but less so than the sequential change between Q3 and Q4. As we reinforce multiple times during this call, we are laser-focused on our return to profitability. We recognize the importance of building a solid foundation so that we can grow from a position of strength.\n\nThis will be achieved by a return to net active client growth and continuing to optimize our cost structure. With that, I'd like to turn the call over to the operator for Q&A.\n\nOperator\n\n[Operator instructions] We will take our first question from Youssef Squali with Truist Securities. Please go ahead.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nGreat. Thank you very much. Hi, guys. Just two quick questions for me.\n\nOne, maybe -- can you just speak to the onboarding process and improvements you've made there? Obviously, you're deciding to increase your marketing, which would lead me to believe that you believe that your onboarding process and conversion rates, etc., have improved relative to where they were even three months ago. So maybe any kind of quantification of where we are in that process would be really helpful. And then as you look at the business, beyond 2023, and I know there are a lot of moving parts here. But relative to kind of how you guys looked at the business, I guess, a couple of years ago, what kind of growth do you think this business can support all things considered looking at the TAM changes, etc.? Is this still kind of a double-digit business, double-digit growth business, do you feel? Or is that something that now we need to adjust as we think through the opportunity? Thank you.\n\nElizabeth Spaulding -- President\n\nHey, Youssef. Thanks for the questions. Yeah, on the first point, we made a lot of progress on conversion over the last couple of quarters. And we have seen a return to levels that we had seen in the past.\n\nThat said, we believe we can still make progress and upside in some of the consumer pain points that we know of. We've made it easier to get back into our Fixes experience. We've made improvements in iterative testing on more of an understanding of what is about. We know it's an unusual service.\n\nAnd so we've done, I think, a lot of good iterative improvements on making that easy for clients to understand. That said, we still see opportunity to make it even easier to get inside in terms of seamless login. We still provide kind of that step where you have to provide your email upfront. And so all of those are areas we're going to keep working on.\n\nSo we've made progress. We continue to make progress, but we see more work ahead. And then on the marketing front, we're continuing to expand and strengthen our portfolio, both with new clients but also with signed-up prospects, those are folks who have given us all their information but have not converted, as well as reactivation. And so we are always super disciplined with how we spend in that sort of 9% to 10% range and are making sure that we are getting a return on any investment we make and we'll keep broadening that portfolio.\n\nOn the beyond 2023 kind of -- beyond this fiscal year, I mean, if you think about it, Stitch Fix is still a pretty small business and an enormous apparel market. We're about a $2 billion company in a $400 billion U.S.-only addressable market. And we know that by opening up the Freestyle experience together with Stitch Fix that has both created incrementality within our existing client base but we believe at two to three times increases the TAM of being a Fix-only business. So we're just incredibly focused this year on continuing to improve the customer experience get on that positive net active track, which we do expect to turn the corner on net active clients sequentially over the course of -- at some point in FY '23 and just ensuring we have the stable foundation of profitability to build on beyond this year.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nOK, great. Thanks for the help.\n\nOperator\n\nWe will take our next question from Cory Carpenter with J.P. Morgan. Please go ahead.\n\nCory Carpenter -- J.P. Morgan -- Analyst\n\nOK. Thanks for the question. Just maybe to start on Freestyle, could you talk about your priorities for Freestyle specifically this year? And are you -- how much of your marketing spend do you expect to deploy against Freestyle? And then related to that, last quarter, you made the decision to direct new customer traffic to the fixed flow exclusively. Is that still the case? And any plans to redirect some of that back to Freestyle in the future? Thank you.\n\nElizabeth Spaulding -- President\n\nYeah. Thanks, Cory, for the question. We continue to make improvements in the Freestyle experience. We had talked in the last quarter or two around search, and that's become -- that was one of our most asked-for features with clients.\n\nThat has done well, doing things like beta testing, seeing outfits in search, just continuous improvement of really integrating more of our styling-led differentiation, those three areas that we think we do better than anybody else that are really solving the hardest problems of fit, discovery and human relationship, really, our ambition is to just make that more and more integrated in the Freestyle experience and really this blurring of the Fix and Freestyle offering. We know our best happiest clients are engaging with both and just making it easier to be participating across that full ecosystem. If you were to Google search, a particular item, you can land on a product detail page or a category page and start right with Freestyle, but our core front door experience, we're really focused on just getting people into our full ecosystem. And what we found is starting with a Fix is a great entry point.\n\nAnd so we're very focused there right now just because we like what we're seeing, but we'll continue to experiment with that throughout the year. We do acquire clients through kind of landing on product detail pages, but I'd say our core customer activation focus is really through starting with the full ecosystem and starting with the Fix right now.\n\nCory Carpenter -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nWe will take our next question from Simeon Siegel with BMO Capital Markets. Please go ahead.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nThanks. Hey, good afternoon, everyone. Sorry if I missed it, but did you say how we should think about the go-forward clients for  RPAC embedded within the 1Q and full year revenue guide? And maybe just speak to the comfort in the improvement embedded over the year. Thanks.\n\nElizabeth Spaulding -- President\n\nSimeon, can you just clarify the question? Are you asking what we expect on active clients? Or what are you asking?\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nYeah, yeah. Just any context within the -- you gave the revenue guidance for the first quarter and the full year, so any context on how that breaks down between price versus clients?\n\nElizabeth Spaulding -- President\n\nGot it. Yeah, we don't guide specifically to active. As I mentioned in response to a moment ago, we do anticipate at some point over the course of this year, turning the corner on improvement in positive net active. I mean, simply by virtue of the fact that we're starting the year with 3.8 million versus over 4 million clients, that just has a really big impact on the absolute revenue for the year.\n\nSo that is really the biggest driver. And as you know, like as we acquire clients, they're spending builds over time, and so we're just not going to see the benefit of that impact. But let me pause there and see if Dan, anything to add on that in terms of how it translates to revenue?\n\nDan Jedda -- Chief Financial Officer\n\nNo. The only thing I'd add on the active clients and RPAC, I did say in the earlier remarks that well net actives will be down for Q1, they'll be down less so than the Q3 to Q4 sequential change that we saw in -- and so as we get closer to adding net active clients, that will likely have the impact of bringing RPAC down simply because these newer clients aren't on our platform long enough to spend disproportionate to clients that are -- that have been here and spending on a regular cadence with us. So that's the way we think about our RPAC here. So again, as we continue to diminish the decline in net actives and ultimately start to grow net actives, I would expect RPAC to be impacted by that, but it will have a net positive, of course, on revenue as subsequent fixes and subsequent engagement with Freestyle take on with our newer clients.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. And then just given the strength of the data that you have, are there any learnings between the clients that have lapsed? So is there any -- I don't know if there's age, demographic, shopping tendency like just you guys have a wealth of data. So as you look at the cohorts or you look at the groups that have peeled off, anything that you can learn from that?\n\nElizabeth Spaulding -- President\n\nYeah. I mean, I would say a few things. In general, our clients are the happiest when they feel like we heard their preferences, and we responded accordingly and present the right product at the right time, which we get right a lot of the time, but we don't always get it right. And immediately address if we didn't get it right through or connecting them with a stylist, like that's actually a lot of what we're going to be focused on this year is bringing more of that stylist front and center and that active listening.\n\nI mean, it is a big part of what has made us so successful. And so using that data to both reactivate clients, which we actually have a pretty healthy reactivation rate. We see more upside there. was actually positive year on year.\n\nOur reactivations of FY '22 versus FY '21 actually entirely driven by growth in Freestyle. And so what we believe is the broadening variety of our assortment, the broadening of price points, all of those good things will benefit the broader client population over time. But ultimately, it's that sense of the client feeling deeply heard and we put the right product in front of them at the right time. And so any time we have that signal of where we can improve it is where we're focused, both frankly, with our active clients, as well as with RPAC clients.\n\nDan Jedda -- Chief Financial Officer\n\nAnd just to add on to that, I will say it's not a learning, but it is for us because we've known it for a while. It is worth reiterating is our clients' desire to get fit right, which we do very well is really important, and they love that. We've talked about fit a lot in prior calls, and it's just worth repeating how important that is. and how we focus on that and continue to try to get better and better at fit.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks. Best of luck.\n\nOperator\n\nWe will take our next question from Mark Altschwager with Baird. Please go ahead.\n\nAmy Teske -- Baird -- Analyst\n\nHi. This is Amy Teske on for Baird. Beyond the broader apparel pullback, I was hoping you could dig in a little bit more into consumer behavior changes, what you're seeing in terms of box frequency, keep rates, average sales price? And any details you can provide on trends in specific product care category?\n\nElizabeth Spaulding -- President\n\nYeah. Thanks, Amy. I think we do a lot of research of what consumers are asking for. We get signal on the majority of our fixes of where the preferences are.\n\nAnd then, of course, we're always tracking what average unit retails and what price points are resonating. And I would say a couple of things. First, on just like category trends, we've definitely seen that continued shift back to workwear, both with our men's and our women's segments. Blazers are back to pre-COVID levels, men's polos have been a strong trend.\n\nSo we are seeing kind of category trends that we've thankfully been prepared for. I will say that consumers are telling us they are feeling more cash constrained. We have different experiences within Freestyle where we highlight items under 50. And in general, we have seen our price points that are at more affordable average unit retails outperforming, which is a strong signal that consumers are looking for value right now.\n\nAnd then we do ask our clients about sort of their anticipated spending going forward. And we have heard clients both in serving consumers in the U.K. and the U.S. that they may be buying fewer items per Fixes in the future.\n\nAnd so we're just really preparing to have the right product at the right time. I think, thankfully, in our business, over half of it are clients who are getting auto shipment with fixes, but we want to make sure that we're providing the value for them in this moment. We'll also be beta testing later this year some new loyalty-based programs. And so our focus is really just making sure we're both providing right product, right time, and rewarding loyalty and value with our customers.\n\nAnd that early signal that we get is incredibly valuable to make sure we have the right product.\n\nAmy Teske -- Baird -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nWe will take our next question from Edward Yruma with Piper Sandler. Please go ahead. \n\nEdward Yruma -- Piper Sandler -- Analyst\n\nHey, guys. Thanks very much for taking my question. I guess twofold. First, I know you've been pretty tactical with SG&A reductions, but if you could kind of help us just understand fixed versus variable SG&A, particularly in light of what could be a tougher demand environment? And then as a follow-up to that, I just want to understand the markdown reserves that are embedded on the inventory now, how should we think about that? Are they kind of trued up at this point? Was there open in the quarter? Thanks very much.\n\nElizabeth Spaulding -- President\n\nYeah. Thank you, Ed. Let me hand it over to Dan to answer both of those.\n\nDan Jedda -- Chief Financial Officer\n\nYeah. On the SG&A reduction, as we said earlier, we are on track to achieve the high end -- to exceed the high end of the $40 million to $60 million that we talked about last quarter. The bulk of that is in fixed which is what we targeted from a cost reduction standpoint. I will say though that on the variable side, which is our warehouse or selling in our -- sorry, our stylists in our customer service, we've seen improvement -- quite a bit improvement quarter on quarter in that area as well across our variable nature.\n\nSo we feel really good about our SG&A costs and the continuing leverage that we get both on fixed and variable. I think that both -- we're going to see leverage on both in FY '23. That's the answer to your first question. And to your second question on inventory reserves as we -- as I talked about earlier, we did increase our inventory reserves, primarily for excess spring and summer good inventory.\n\nWe are looking -- we do expect the back half of FY '23 to improve our inventory position. A lot of that depends, of course, on the macro environment. But we do feel like we have hit the top end of that reserve and we're not expecting increases in reserves going forward simply because we're focused very much on rightsizing our inventory. We feel very good about the fall and winter inventory that we've got coming in.\n\nAnd at this point, I think we're in a good position from an inventory reserve perspective.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nWe will take our next question from Lauren Schenk with Morgan Stanley. Please go ahead.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nGreat. Thank you.I guess as we think about the factors that are weighing on net adds, is traffic really the biggest headwind followed by conversion and then churn? Or how should we think about kind of the different factors within net adds? And then any update on what percentage of Fixes customers have tried Freestyle or made more than purchase on Freestyle. I know you'd given some of those stats in the past. Thanks so much.\n\nElizabeth Spaulding -- President\n\nHey, Lauren. Thanks for the questions. Yeah, I mentioned on the call that we saw steady improvements in traffic in the back half of FY '22. And so we like the progress we're seeing.\n\nWe've also made progress on conversion. Our best traffic is that sort of direct in organic traffic, and that's where we're continuing to push and make progress on. I think we all just saw a huge rushed to e-commerce a couple of years ago. Some of that has leveled back off.\n\nAnd so our ability to just continue to strengthen the mix of our marketing portfolio and sort of continue to expand our toolkit there beyond what was, I would say, a pretty heavily growth marketing focus a couple of years ago. So we like the progress we're seeing, still have more to do that first multinational campaign that we just launched we think is going to help build consideration, things like our new affiliate influencer network. So it's really a combination, I would say, of continuing to improve high-quality traffic sources, bringing back in clients that we can reactivate together with continued kind of continued gains in the conversion funnel, which we have gotten back to levels that we were at in the past, but we still see more upside by just making it more frictionless and seamless to enter. So I would say it's really a combination of the two.\n\nAnd then on your fix into Freestyle, I'd say that stayed at pretty heavy levels. I think we've reported in the past that resonates with around a fifth of clients that come back again and again if they're a Freestyle first purchaser. I think you're asking those specifically how many of our Fixes clients get into Freestyle. And I think we've shared in the past something like around 30% of our women's clients.\n\nWe've penetrated with Freestyle and that's remained steady, which we believe is below full potential, frankly. And we're looking for the next way to kind of reduce what I would say is the cognitive load of a brand-new Fixes customer learning about Freestyle just continuing to make that easier and easier. As an example, in every six we send, we have these ways to wear it style cards that we send in a Fix. We see a future of just making those incredibly easy to buy with the Fix checkout process as an entry point into Freestyle.\n\nSo essentially just finding that next frontier ways of moving that a further step change, but I'd say it's been pretty steady at that level to date, but we don't think it's full potential.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nWe will take our next question from David Bellinger with MKM Partners. Please go ahead.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nHey, thanks for taking my questions. I've got a couple. So my first one, just on the guidance. It seems like there's some active client growth embedded in the back half of the year.\n\nSo what gives you the confidence that the clients will rebound? Is there anything you're seeing into Q1 on traffic or conversion to support that? And then just my second one, so RPAC expected to be down again in Q1. And understanding the dynamic you spoke about earlier that initial users aren't spending much right away. But are you seeing anything beyond that? Anything on average order values or some type of trade-down effect or mix shift that's affecting that RPAC number? Thanks.\n\nElizabeth Spaulding -- President\n\nThanks, David. I'll take the first one, and then I'll let Dan talk more about RPAC. Yes, I mean, I think all of the things that we mentioned on the prepared remarks and some of what I've responded within the last few questions, just the initiatives and the progress we're making on continued improvement on onboarding, continued focus on bringing our signed-up prospects reactivation, new traffic channels, inter experience. And so we are making progress.\n\nAnd based on what we're seeing and based on what we believe will be kind of lapping on a year-on-year basis. We anticipate that over the course of this year, we will turn the quarter. On the RPAC side, let me hand it to Dan to share more on that.\n\nDan Jedda -- Chief Financial Officer\n\nYeah. A couple of comments on the behavior or clients who are purchasing. Of course, the average age -- the average tenure of our client has increased as a result of our net active declines. And so when that happens, the older clients tend to have a slightly lower keep rate than newer clients simply because their costs get filled up over the course of 10, 20, 30, 40, 50 Fixes.\n\nBut we are still seeing very solid keep rates and AOVs in both Fix and Freestyle on the new clients coming in. on a relative basis. So there's nothing Elizabeth had talked about potentially some impact. And we do see it around the fringes on the clients that come in, they might be lower priced clients.\n\nBut when you look at it holistically, the AOVs, both for Fix and Freestyle on a cohort basis of the new clients coming in, still look very strong.\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe will take our next question from Trevor Young with Barclays. Please go ahead.\n\nTrevor Young -- Barclays -- Analyst\n\nGreat. Thanks. Dan, on the full year guide, can you help us understand how you're thinking about that revenue growth cadence throughout the year in light of the down 20% in 1Q and the easing compares it sounded like 1H under pressure, maybe some inventory overhang kind of challenging holiday, but then maybe second half has improved. And what would need to go right for you to exit the year in positive growth territory?\n\nDan Jedda -- Chief Financial Officer\n\nYeah. It's a good question. And so in Q1 of last year, we had a very strong quarter. We were up 18% year on year.\n\nThat is at the time that we started to see the issues with our Fixes funnel that we've discussed many times but the impact of subsequent Fixes gave us a very strong quarter. We see -- we have an easier comparative in the -- as we go forward with in FY '23. That, coupled with our net actives declining at a far slower rate. And as Elizabeth mentioned, we do hope -- we do have goals and hope to get to and we'll get to sequential improvement in net actives.\n\nIn a quarter this year, all that means that the growth rates that we see in the back half of the year will improve relative to the growth rates that we see in the first half of the year. In response to your second question, what do we have to see to exit the year? We talked about net actives growing. And as we go through quarter by quarter and see net actives improved, we do think we'll end the year in a very strong position. In the meantime, as you could see from our EBITDA guide, our cost structure, we're very focused on that, both in Q1 and full year.\n\nAnd so given our focus on fixed and variable costs, we feel that we will end Q4 in the back half of FY '23 in a strong position.\n\nTrevor Young -- Barclays -- Analyst\n\nRight. Thank you.\n\nOperator\n\nWe will take our next question from Ike Boruchow with Wells Fargo. Please go ahead.\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nHey, everyone. just two quick ones. I think you said the Freestyle was up 21% in Q4. Can you just say specifically what the subscription business was down in Q4? And then, Dan, on the gross margins, can you walk us through the reserve impact to gross margin.\n\nHow we should basically think about the puts and takes on gross margin for next year? I think you said it's 42% for Q1 and the full year? Should there be much volatility for the remaining Q2 to Q4? Should this be pretty much 42% almost every quarter, if you just any variability to call out? Thanks.\n\nElizabeth Spaulding -- President\n\nYeah. Thanks, Ike. I can take the first one, and then Dan can add on and talk about gross margin. That Freestyle growth rate, just to clarify, was our full year FY '22 growth rate, not a Q4 growth rate.\n\nAnd on our full year basis, we were about negative 1% for the total business. We don't actually break out by business unit, but I -- you can infer from that that there was growth in Freestyle and slight decline within the Fixes business. Mean overall, it's really just a function of getting the net active growth back on track. And we entered the year of FY '22 with more clients than we exited.\n\nAnd so that's a big driver of that fixed number. And then just continued adoption and rollout of Freestyle, which we know has been largely accretive and incremental to our existing Fixes client base. Let me let Dan comment on the gross margin question.\n\nDan Jedda -- Chief Financial Officer\n\nYeah. Ike, to your question on gross margin, we talked to -- we referenced it earlier that once you adjust for our incremental inventory reserve and third-party liquidation sales, Q4 was at 42.5%. We guided for Q1 to be 42% in full year. We feel good about our overall product margins.\n\nWe feel good about our gross margin line items. The one caveat, of course, is just the timing of inventory a lot of our inventory, most of our inventory that we will receive in our first half was ordered six months ago. We ordered inventory early because of supply chain challenges back then. A lot of those supply chain challenges have since alleviated.\n\nSo the timing of the inventory is a little bit uncertain as we go into our H1 for our fall/winter. And that could create some variability, but we do expect the 42% to be consistent quarter on quarter, absent of any inventory surprises, which at this point, we're managing quite closely. So you can infer that the 42% is relatively stable, pending some small changes quarter on quarter.\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nGot it.\n\nOperator\n\nWe will take our next question from Ashley Helgans with Jefferies. Please go ahead.\n\nAshley Helgans -- Jefferies -- Analyst\n\nHey, thanks for taking our questions. Just on the fiscal year guide, what kind of macro backdrop are you throughout fiscal year '23? And then a lot of retailers have been talking about higher promotions heading into the back half of the year? Can you update us on your promotional strategy now that you have the ability to use Freestyle promotional tool? Thanks.\n\nElizabeth Spaulding -- President\n\nYeah. I can start -- thanks for the question, Ashley. I'll start with the promotional kind of behavior and then let Dan talk about the full year guide expectations. So yes.\n\nI mean, when we were a fixes-only business, we really had no release valves or promotional offerings for our clients with the exception of our buy discount, which obviously has been very popular with our customers. Over the course of the last eight months or so, we've been able to experiment with a couple of limited time offers where we're taking advantage of showing value to our Freestyle clients, as well as testing and experimenting with inventory that's not moving as quickly. So we had -- the first of those back in, I think it was in late Q2, early Q3 and then again within Q4, and then we also did a Labor Day event a few weeks ago. And overall, we like what we've seen.\n\nThose events have exceeded our expectations. In certain situations, we really like the ability to drive halo to the rest of our products. And so we are going to be really thoughtful to do these episodically, deliver value to our clients. But overall, we now have this release valve that we wouldn't have had with the Fix-only business.\n\nI'll let Dan talk about the full year question.\n\nDan Jedda -- Chief Financial Officer\n\nYes, Ashley. To your question on our full year, I would say that we have not factored in any deep improvements or the changes from where we're at now based on us on the visibility we currently have. So it's basically a status quo on where we're at now and what we feel is the right guidance to give on everything that we know now and what we've seen over the last several months with our trends.\n\nAshley Helgans -- Jefferies -- Analyst\n\nGreat. Thanks for the color.\n\nOperator\n\nWe will take our next question from Tom Nikic with Wedbush Securities. Please go ahead.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nHey, good afternoon, and thanks for taking my question. I wanted to follow up on Ike's question earlier about the gross margins. Dan, for many, many years, this is a business that had gross margins kind of in the mid-40s. And now you've kind of been in the low 40s, like the 42% range in the last couple of quarters, and that's the guide for FY '23.\n\nIs this essentially like the new gross margin for the company long term? Are there opportunities to take the gross margins higher? Like what -- how do we think about puts and takes on gross margin? And like can you get back to that kind of mid-40s gross margin that the company had for many years before the recent quarters?\n\nDan Jedda -- Chief Financial Officer\n\nYeah. It's a good question, Tom. The sequential changes that you're talking about were in H1 of FY '22, we were closer to the 45%. In H2, we were closer to the 42% is really, as I said earlier, the result of inflationary costs from a product standpoint, along with transportation costs, which is well documented on the increase that's going on in the form of the -- from the carriers.\n\nAnd so while we do expect that to continue on in FY '23, there are opportunities to ultimately grow and improve margin. For example, we've talked about this in the past. Our network is not optimized yet to have the lowest amount of transportation cost from a carrier or split shipments perspective. These are things that we're working on currently.\n\nAnd so in these areas that are the biggest drivers of gross margin, mainly transportation and product costs, there is opportunity, should the inflationary environment reside or as we get better and better with transportation and optimizing our carrier networks. And again, that's more longer term. So I wouldn't say that the 42% is the normal going into FY '24 or '25, and we'll look at that and update you guys as we get closer to the end of the year. But for now, 42% is more of the realistic just given the inflationary costs that we're seeing in both transportation and on the product side.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nUnderstand. Thanks.\n\nOperator\n\nWe will take our next question from Kunal Madhukar with UBS. Please go ahead.\n\nKunal Madhukar -- UBS -- Analyst\n\nGreat. Thanks for taking my question. Let's start with the traffic increase that you talked about. So you said there is a steady improvement in traffic in this back half.\n\nConversion rates also improved. And yet a couple of things. One is your LTM active client number declined significantly high single digits on a year-over-year basis. And you are also talking about the average age of the client base has increased, which means you're retaining some of the older customers.\n\nSo what am I missing here? You're probably adding more customers and yet you have more older customers, who do you lose? And why is the LTM number down? And then I have a quick follow-up.\n\nElizabeth Spaulding -- President\n\nThanks, Kunal. Yeah, I did mention that we saw steady gains in the back half relative to earlier in the year on traffic, and then we have made progress on conversion. So those are both true. Conversion rates are obviously different depending on the source of traffic and channel.\n\nAnd so we like what we're seeing on driving more to the experience -- the area that we still have room to improve is that direct and organic traffic, which tends to be the highest converting traffic. So while on an apples-to-apples basis, we've made steady progress on conversion we still see opportunity to drive that really high considered traffic that is super high intent on coming to Stitch Fix. So areas of opportunity that we're very focused on -- are those signed up prospects who've already come and given their information, but not converted, increasing the penetration of those customers, we see as a big opportunity, reactivating prior clients where they know they found what they needed in the past that may be lapsed over time and bringing them back. And then things like I mentioned, like the early efforts to begin to scale our affiliate influencer.\n\nSo all of those tend to drive, especially the former, that very high-intent traffic. So not all traffic is apples-to-apples is part of what you're hearing. And then on the tenure point, we just have not added the same magnitude of new customers is really the core issue. It's not that it's a different customer base.\n\nIt's more -- we just haven't had the same order of magnitude of new customers, which early in life cycle, clients just tend to spend more with us than over, say, the two- to three-year time frame, their spend tends to go down a bit. And so those are the dynamics that I think you're hearing. Dan, add anything to that?\n\nDan Jedda -- Chief Financial Officer\n\nNo. I think I'll just add on to what Elizabeth said, which I fully agree with, in that once we do turn the corner and add that active, that average tenure will come back down. and we will see that impact over the subsequent time lines as these new customers engage more with Fix and Freestyle over their tenure. So we would expect that trend to reverse when we add new actives.\n\nKunal Madhukar -- UBS -- Analyst\n\nGot it. And the follow-up is on Freestyle. So Freestyle started in the middle of last fiscal year, effectively. And so if it started virtually from scratch in the middle of last fiscal year, and maybe had six to nine months of revenue and then it grew 21%.\n\nSo did it grow from like 4% of total revenue to 10% of total revenue? Or how big is Freestyle right now?\n\nElizabeth Spaulding -- President\n\nYeah. I can start, and Dan, feel free to add. So Kunal, we actually began an experience of being able to shop your looks, shop on items you had bought in the past Fix experience kind of late in fiscal '20. And then we started to ramp up more features and that shopping experience in fiscal '21 just as an add-on feature for existing clients, and we've continued to build out more features and functionality, and we'll continue to do so.\n\nIt was just in last fiscal year of FY '22 that we made it possible that you could start with that experience. So it was not brand-new halfway through last year, but the features and the expansion of the branding of Freestyle happened last fall -- don't break out.\n\nKunal Madhukar -- UBS -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nWe will take our next question from Janet Kloppenburg with JJK Research Associates. Please go ahead.\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nHi, everybody. I just had a couple of follow-on questions about merchandising execution and the inventory content. I was just wondering, you talked about the where to work trends being good. And I think that might be helping drive the average spend per customer, not sure, but wondering if you feel like your inventory investments there are where they should be or if they're improving now and that's helping drive the improved performance that you're seeing right now.\n\nMaybe if you could talk a little bit about your investments and where to work in special occasion versus cash flow on trends you're seeing there. And also on the men's performance because I know that that gender had been weaker than women's. And just lastly, Dan, on the inventory, I know you're comfortable that it's coming down. I'm just wondering again on content and seasonal carryover, particularly due to late deliveries of summer or maybe because of supply chain delays and how that looks going forward.\n\nThank you.\n\nElizabeth Spaulding -- President\n\nYeah. Jan, I can start on the merchandising. I mean, we definitely have seen particular strength recently in just categories that, frankly, have been less popular during the COVID time frame are really starting to come back. As I mentioned, blazers being a good example of that.\n\nIn women's, we also saw like a 30% increase in seasonal heels. Clearly, people are going back into the work environment, even if it's hybrid work, things like dresses have continued to be strong, particular types of dresses like medium maxi. And then with men's, things that are versa like polo shirts have continued to show strength. But I would say like athleisure, comfortable close, those tend to still be very strong categories for us.\n\nAnd so it's really the portfolio of products that I think have benefited us and that we've kind of played across. We're not just athleisure, we're not just workwear, we're really able to adapt to the signal that we're hearing from our clients. And over the course of the last year, we did add a number of national brands that we've tested into, but the majority of our sales are still with kind of the combination of Stitch Fix only and private label that we're able to adapt reasonably quickly based on client preference. Obviously, some categories are longer lead time like footwear.\n\nSo I would say we're seeing kind of continued consumer demand and things like athleisure in addition to workwear. So it's not just a salon shift to those categories --\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nAnd you're comfortable that -- are you comfortable that your inventories outlined in sync with the category demand?\n\nElizabeth Spaulding -- President\n\nI think we're feeling like we have the right presence of categories. I think like most of our category, just the overall discretionary investment is what I think kind of all of apparel is probably experiencing right now. But in terms of having affordable price points, having the categories that consumers are looking for, I think probably the bigger headwind within retail apparel overall is just the shift that consumers are making given inflation, gas prices, I think it's more of a macro than a micro. And let me -- I know you have the supply chain speed question, Dan can you take that one?\n\nDan Jedda -- Chief Financial Officer\n\nQuestion on the spring and summer goods. That was the reason we gave when we talked about the 250-basis-point impact on gross margin from 40% that we had in Q4. I feel very good about the spring and summer goods in the form of -- we've adequately reserved for that. We've actually executed quite a bit on rightsizing that inventory.\n\nI will say, of course, the supply chain issues as it relates to fall and winter is where we're focused on. Now a lot of those orders were placed six months ago. And so we have one more cycle here before we feel we can rightsize their inventory, and I would expect inventory to go up sequentially in Q1, although we're still working on rightsizing that inventory. So for the spring/summer, I feel very good.\n\nAnd I also feel pretty good -- I feel very good about the back half that we'll have our inventory rightsized by the back half of our FY '23.\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nYeah. Thanks so much. I'll follow up on it later.\n\nOperator\n\nWe will take our next question from Dana Telsey with Telsey Advisory Group. Please go ahead.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. Good morning, everyone. Just following up on Janet's question on inventory. Can you talk about rightsizing the inventory? What levels do you expect it to be? And is there a marker for the first half of the fiscal year and by the end of the fiscal year as you're looking at it? And then on expense reduction, which I believe last quarter, you had talked about the $40 million to $60 million annual cost savings.\n\nHow is that progressing? And the one-time restructuring charges of $15 million to $20 million in this past fourth quarter. Is that done? Or is there anything more we should look at? And then just Elizabeth on product. as you think about planning for the holiday season, what are you leaning into? What are you seeing from brands from your own private label? And how do you expect that mix to shape? Thank you.\n\nElizabeth Spaulding -- President\n\nI'll let Dan take the first couple of questions.\n\nDan Jedda -- Chief Financial Officer\n\nDana, to your first question, we don't provide a forecast for inventory. That said, we feel that we can get upwards of four to five times turns on a gross inventory basis. We're not there now, but we feel, ultimately, we eventually can get to that level. that's probably longer term, but we're making good progress or we plan to make good progress throughout FY '23 on rightsizing our inventory and keeping it at the right level of turns on a go-forward basis.\n\nAnd we'll update you more in future earnings calls on where we're at with respect to our inventory position. On the cost savings initiative, and we mentioned last quarter that $40 million to $60 million is what we expected to receive. We are on track, as we said earlier, to exceed that number. Most of that -- a lot of it is operationalized.\n\nThere's still a lot of initiatives that we have that we're working on. So we'll give an update on what that is going to be as we go through FY '23. But I feel very good on $40 million to $60 million exceeding that $60 million threshold. The bulk of that is on the fixed cost side.\n\nOn top of that, we are expecting to get variable productivity for a lot of the work that we did in Q4 on both the warehouse and the styling side of the business. And so that will help in the cost savings initiative going forward. And then finally to your question on the restructuring charges, we may have small amounts of restructuring. We don't anticipate anything for Q1 as big as Q4, there might be some small restructuring and one-time charge initiatives.\n\nWe'll update you guys on that as we go into Q2. But it will not be like it was, of course, in Q4. Again, stay tuned on restructuring and one-time charges.\n\nElizabeth Spaulding -- President\n\nAnd then I can just mention, I think, Dan, you were asking questions some of the trends we're seeing on our assortment and heading into the holiday season. I would just say broadly, we've learned a lot on sort of the discovery within Freestyle of some of the brands that we've added. And in particular, I think we've seen popularity with contemporary brands with accessible price points and limited distribution. Some of our top brands that we've seen in Freestyle have been brands like Modern Citizen, VERO MODA, brands are basically priced at that sweet spot of under $150, in addition to particular strength in a number of our exclusive brands, Market & Spruce, and 41 Hawthorn continue to be some of the biggest brands within our portfolio, both Fix and Freestyle.\n\nI think we're hearing in terms of client signal in our request notes are going out again and preparing for the holiday season. We are more of a self-purchase occasion still rather than gifting. So our focus is probably going to be on that in terms of dresses and going out there, and we're ready for that. So thank you for that question.\n\nOperator\n\nThank you. There are no further questions at this time. Ms. Spaulding, I'd like to turn the conference back to you for any additional or closing remarks.\n\nElizabeth Spaulding -- President\n\nThank you, everybody, for joining us today and all the questions. We look forward to updating you on our progress.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHayden Blair -- Investor Relations and Treasury\n\nElizabeth Spaulding -- President\n\nDan Jedda -- Chief Financial Officer\n\nYoussef Squali -- Truist Securities -- Analyst\n\nCory Carpenter -- J.P. Morgan -- Analyst\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nAmy Teske -- Baird -- Analyst\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nDavid Bellinger -- MKM Partners -- Analyst\n\nTrevor Young -- Barclays -- Analyst\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nAshley Helgans -- Jefferies -- Analyst\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nKunal Madhukar -- UBS -- Analyst\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nMore SFIX analysis\n\nAll earnings call transcripts"
}