{
  "companyName": "Baozun",
  "companyTicker": "BZUN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/29/baozun-bzun-q3-2022-earnings-call-transcript/",
  "content": "Baozun (BZUN 3.11%)\nQ3 2022 Earnings Call\nNov 29, 2022, 6:30 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and thank you for standing by for the Baozun's third-quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. After management's prepared remarks, there will be a question-and-answer session. As a reminder, today's conference call is being recorded.\n\nI will now turn the meeting over to your host for today's call, Ms. Wendy Sun, senior director of corporate development and investor relations of Baozun. Please proceed, Wendy.\n\nWendy Sun -- Senior Director of Corporate Development and Investor Relations\n\nThank you, operator. Hello, everyone, and thank you for joining us today. Our third-quarter 2022 earnings release was distributed earlier, and it is available on our IR website at ir.baozun.com, as well as on GlobeNewswire services. They have also posted a PowerPoint presentation that accompanies our comments to the same IR website, where they are available for download.\n\nOn the call today from Baozun, we have Mr. Vincent Qiu, chairman and chief executive officer; Mr. Arthur Yu, chief financial officer; Ms. Tracy Li, our vice president of strategic business development; and Ms.\n\nSandrine Zerbib, president of Baozun brand management. Mr. Qiu will review the business operations and company highlights, followed by Mr. Yu, who will discuss financials and key operating metrics.\n\nThey will all be available to answer your questions during the Q&A session that follows. Before we begin, I would like to remind you that this conference call contains forward-looking statements within the meaning of the Securities Exchange Act of 1934 and the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements are based upon management's current expectations and current market and operating conditions and relates to events that involve known or unknown risks, uncertainties, and other factors, all of which are difficult to predict and many of which are beyond the company's control, which may cause the company's actual results to differ materially from those in the forward-looking statements.\n\nFurther information regarding these and other risks, uncertainties, or factors is included in the company's filings with the U.S. SEC and in announcement on the website of Hong Kong Stock Exchange. The company does not take any obligation to update any forward-looking statements, except as required under applicable law. Finally, please note that, unless otherwise stated, all figures mentioned during this conference call are in RMB and comparisons are on a year-over-year basis.\n\nIt is now my pleasure to introduce our chairman and chief executive officer, Mr. Vincent Qiu. Vincent, please go ahead.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nThank you, Wendy. Hello, everyone. And thank you all for your time. Despite the ongoing challenging environment, we are encouraged with the resilience of business as shown on Slide number 2.\n\nIn addition, we delivered double-digit growth in several categories, including luxury, fashion apparel, and FMCG. Moreover, digital marketing and IT solutions revenue increased by 22%. While product sales continue to decline as planned as we keep optimizing distribution model, service revenue grows 4% year over year. Business development during the quarter was on track with a net addition of seven brand partners of store operations.\n\nFor existing client base, it's worth noting that our business development also speaks to higher engagement in omnichannel and more value-added services. Our integrated omnichannel operations help brands to timely identify evolving e-commerce trends, thus enhancing resource allocation efficiency. During the quarter, over 42% of our brand engaged with us on a omnichannel approach. We continuously develop new features and tools to augment, bundle the value-added service.\n\nThis quarter, we launched the short video cleaning tool, which automatically converts long video or live streaming record to short videos. We also co-developed with a market place an AI-based outbound calling system to make proactive communications to targeted brand customers. This helps us with better purchase frequency and conversion. We expanded the regional service centers to more cities recently and added new scope to them, supported by our customer service management systems or [Inaudible] as a backbone.\n\nWe improved not only service quality but also efficiency. The new module named [Inaudible] which means [Inaudible] anywhere, has been developed and ported onto [Inaudible] for centrally managed company creation tool during the quarter. Despite the short-term headwinds from macro environment, we are glad to see that brand partners still take China as one of the most critical markets with a lot of potential. We continue to see a trend of digital transformation, such as the rapid convergence between online and offline, or OMO, continues.\n\nAlong with the digital transformation trend and the emphasis on our China-for-China strategy, [Inaudible] are investing in IT solutions for the long term. As such, our technology-related revenue sees notable growth with a sound pipeline for additional growth. In light of the strong demand, we officially launched a BOCDOP, a Baozun omnichannel digital operation platform, a package solution with powerful customization capabilities. BOCDOP is a center -- multiple-channel order fulfillment, and it delivers power for omnichannel D2C, data intelligence, and decision support functionalities to our brand partners.\n\nFollowing many years of nonstop investment in technology, we started expanding upstream in recent years and target to evolve into a technology-driven omnichannel commerce player. Early this November, we announced our acquisition of Gap Greater China, one of the largest American specialty apparel brands. Along with the acquisition, we launched the Baozun brand management, a new line of business that we see as a strategic addition that naturally flows from our core e-commerce service and technology offering. The acquisition is a good fit to develop BBM since we have worked with the brand for many years.\n\nWe love it, and we believe in it. It has only been a few weeks since our announcement, and we are still in the process of finalizing the acquisition. It is encouraging that since the news went on air, many other brands have come to us to discuss about China-for-China strategy and about our technology-driven approach. It has become obvious that our brand management offering clearly can add more to our value proposition, and it differentiates us from traditional service providers.\n\nWhile it will make time -- it will take time and hard work to fully actualize our vision, we believe a close-loop demand to supply value chain, as well as integrated offline and online commerce will make brands unique and much more successful than before. I shall now hand over the call to Arthur to go over our financials. Thank you.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thank you, Vincent, and hello, everyone. Please turn to Slide 4. During the quarter, our total GMV increased by 16% to 18.6 billion, mainly due to outstanding performance of one leading electronics brand.\n\nExcluding this brand, the adjusted GMV would have been flat on a year-over-year basis. Total revenues declined by 8% to 1.7 billion of which product sales declined by 29%, while service revenue increased by 4% compared with the same period of last year. Now, let's turn to Slide number 5 for a breakdown of revenue. Despite a decline in total revenue, several categories, including apparel and FMCG, achieved double-digit growth.\n\nThe value-added services has shown more resilience in this quarter, where digital marketing and IT solutions increased by 22% and warehousing and fulfillment service revenue declined by only 7%. Overall, the contribution from value-added service increased to 23% of total revenue in this quarter. Please turn to Slide number 6. In this quarter, our cost of products decreased by 30% to 415 million, mainly due to continued efforts in optimizing product sales business.\n\nAs a result, despite a reduction of 29% in product sales revenue, the gross margin for product sales improved by 175 bps to 16.6%. Moreover, our overall gross margin improved by 800 bps to 76.2%, driven by a combination of a higher-service revenue mix and improving gross profit margin. Now, turning to Slide number 7. Our non-GAAP income from operations was 17 million during the quarter, representing a non-GAAP operating profit margin of 1%.\n\nNon-GAAP net income was breakeven this quarter, mainly impacted by unfavorable exchange rate movements. Once again, we have prepared waterfall diagrams depicting our analysis of how our top line and bottom line evolved year over year. As a reminder, this analysis is unaudited and should solely be used as supporting numbers to aid discussion. First, on Slide number 8.\n\nThis diagram shows our net revenue work from Quarter 3 2021 to Quarter 3 2022. In red, you can see the biggest item impacting our revenue this quarter was product sales as we continued our efforts to optimize low-quality distribution revenue. Revenue from DM and IT services, which we view as value-added services, grew by 22% this quarter. Revenue from warehouse and logistics declined by 7%, mainly due to our decision to disinvest a subsidiary in the business, which I will address more later.\n\nExcluding such disinvestments, revenue from warehouse and logistics should have been a slight increase year over year. On a positive note, this initiative led to better profitability. Now, please turn to Slide number 9 for the indicative work of non-GAAP operating profits. As mentioned earlier, the combination of higher COVID-related costs and general operating deleverage due to lower revenue resulted in less profit for online store operation businesses generally across all categories.\n\nHowever, as show, non-GAAP operating profit from digital marketing and IT improved by 30 million year over year. In addition, the optimization of low-quality distribution business contributed 3 million, and profits from warehouse and logistics business improved slightly by 1 million. We also generated a positive savings of 3 million from back-office cost optimization. In cost optimization, we continue to gain higher efficiencies by centralizing our operating capabilities, rising incentives, and consolidating office footprint.\n\nMore significantly, this quarter, we selected small cities, such as Jinan, Chengdu, and Enshi, to expand the scope and scale of our regional service center. Now, approximately, 60% of our customer service staff are located in regional service centers. By placing customer service staff in regional centers, increased service flexibility and agility to better cope against COVID-induced turbulence. Moreover, we expanded beyond customer service and added more operating functions at regional service centers and live-stream studios.\n\nWe also further deepened our cooperation with Cainiao to leverage our established infrastructure and network. As you may recall, in the second quarter, we began to manage Cainiao's warehouses in the apparel category, got business referrals in luxury and premium sectors, and also launched the small solution for some of our key sportswear brands. Motivated by this -- by the synergies and after further careful evaluation, we decided to reduce our shareholding of Baobida, a last-mile delivery agency, to minimize duplication with Cainiao. As you may recall, last year, priority to our strategic alliance with Cainiao, we invested into Baobida to expand our logistics capabilities.\n\nHowever, now, with Cainiao's alliance, we decided to withdraw our [Technical difficulty] to a minority holding in Baobida. Now, turning to Slide number 10 about our cash flow. As of September 30, 2022, our cash and cash equivalents totaled 2.9 billion. In light of macro uncertainty, we continue to improve working capital efficiency.\n\nDuring the quarter, we launched new initiatives to further advance our [Inaudible] process to improve inventory management, billing, and collection activities. Historically, in order to prepare for the Double 11 festival, the first quarter typically require peak operating cash flow. This third quarter, benefiting from the programs in our inventory procurement planning, we were able to narrow the operating cash outflow to only 113 million, compared with 740 million a year ago. During the quarter, we repurchased approximately 700,000 ADS for approximately $6.1 million.\n\nTo date, with our share buyback effort, we repurchased a cumulative total of $68 million in the last nine months. Lastly, the voluntary conversion into a primary listing status on the main board of the stock exchange of Hong Kong Limited became effective on the first of November. Baozun is now a due primary leasing company on both Hong Kong Stock Exchange and the Nasdaq Global Select market. This marks a significant milestone in our capital market journey.\n\nOverall, our effectiveness in maintaining operations and supporting our partners' success during this period of macro uncertainty underscores the durability and strength of our business model. Throughout this year, we prioritized the cost transformation and working capital efficiency, and our efforts are bearing fruit in terms of higher gross margin, lower operating expense, and better cash flows. The establishment of Baozun brand management, along with the acquisition of Gap Greater China, will provide us with good opportunity for future growth. This is my financial review section.\n\nAnd that concludes our prepared remarks. Thank you. Operator, we are now ready to begin the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] Please stand by while we compile the Q&A roster. Our first question comes from the line of Alicia Yap from Citi. Please go ahead.\n\nYour line is open.\n\nAlicia Yap -- Citi -- Analyst\n\nHi, thank you. Good evening, management. Thanks for taking my questions. I have two questions.\n\nFirst, if management can share with us any preliminary color that, you know, you are seeing in terms of the consumption sentiment and, you know, across all the channels post a single stage. So, in relation to that, how should we think about the overall GMV and revenue growth for the fourth quarter? And if management also have any preliminary view on the 2023 outlook. Second question is your digital marketing and IT solution is actually doing pretty well. If you can elaborate a little bit what type of the brand's customer and the operation metrics like the take rate that you can share with us related to this service.\n\nAnd will this revenue line continue to deliver decent growth in the coming quarters? So, how should we think about that? Thank you.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thank you, Alicia. So, maybe, Tracy can comment on the Double 11 performance and the consumption segment. And I can answer about the views of Q4 and next year.\n\nIf that's OK, Tracy.\n\nTracy Li -- Vice President, Strategic Business Development\n\nNo problem. Thanks for the question. I think right now, China consumers still very largely impact from the COVID-19. And also, you can see in recent two months, actually from the logistics part of view, there's still a lot of lockdown and the impact on that.\n\nBut on the Double 11's number, we can see the overhead number is still under pressure, which means there's no big increase. But still it is very important window we see the trends on different categories. So, on that part, actually, I can summarize some of the observation from our point of view from our BI system and also from the public system. We see from the consumption trend, the upward consumption, home improvement, self-scale, and the sports lifestyle are the four heated schemes.\n\nTake the sport lifestyle scheme for example, the sales of the category outdoors, sports equipment, [Inaudible] and also the sports footwear were lifted by range from 28% to 9% year-on-year increase represently. And also, you can see the fitness, mountain climbing, skinny, urban sports, camping, and the running and basketball contributes most of the category. And also, we can see the luxury and also previous jewelry, bags and luggage has been several -- I mean a few of the categories still reached steady growth in the past four quarters. So, I think among these four areas, we still can see the opportunity for next year.\n\nBut also, there are also down trends category like the fashion accessories and also men's and women's footwear. And this has been reflect over two or three quarters decline in most of the daily sales and the big promotion. So, for all of this part, we still need a steady growth way to single out. And besides the category shift, I think we also see the platform pay more attention on the user retention and the acceleration of private domain cadence for new business incrementals, like Alisports [Inaudible] and doing newly added store member enrollment benefits, the membership compound and membership gifts.\n\nAnd all of this has given our potential to collaborate brands and platform together on the digital marketing and also interactive technology-related. So, I think on that part, we can back to other parts to talk about our next year's plan, yes.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thank you, Tracy. In regarding to the Q4 outlook, our current view is from the GMV perspective, we see some good momentum in electronics and FMCG. But we also see some strong headwinds in terms of the apparels and the sportswear.\n\nSo, overall, we believe our Q4 GMV will be in line with the market, which is likely to be flat year over year. In terms of the revenue, at this moment, we still see the optimization of the low-quality product sales will continue unless the market sentiment pick up. So, from a revenue perspective, we think there will be a low teen decline year over year. The main contributor factor is the product sales, which we continue to optimize.\n\nIn terms of the next year, I think it's a little bit too early to comment because there are still some very big factor, which is in the overall macro kind of condition and also the COVID policy. But our view for next year from a current perspective is conservative. And we want to plan on a conservative basis for the next year as well, i.e., to focus on the quality instead of focus on the growth. But on the -- on your second question, Alicia, regarding the digital marketing and IT solutions, i.e., our view on the value-added service, I think that's one of the areas we see there's a quite strong momentum from our client base.\n\nSo, basically, at this moment, our brand partners start to focus on the medium- and long-term investments of the business in China. So, therefore, we have seen a strong kind of the pipeline from the value-added service like IT solutions, like the digital marketing, and the market-related kind of the proposals from our offerings. So, we think that will continue. And given the investments into the technology in the last few years, I think Baozun is well positioned to take on those opportunities at the current market situation.\n\nOK?\n\nAlicia Yap -- Citi -- Analyst\n\nYeah. Thank you, Arthur. Thank you, Tracy.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thank you, Alicia.\n\nOperator\n\nThank you. We will take our next our next question. Our next question comes from the line of Charlie Chen from China Renaissance. Please go ahead.\n\nYour line is open.\n\nCharlie Chen -- China Renaissance -- Analyst\n\nThank you, management, for taking my questions. I've got two questions here. The first one is regarding the GMV combination. So, I can see in this quarter, the GMV contribution from non-Tmall channel seems to be a little bit lower than last year, 4Q 2021.\n\nSo, can you explain what's the rationale and background behind this, and what's the long-term goal of this GMV growth between Tmall and non-Tmall channel? That's the first question. And the second question is regarding the Gap acquisition as well as the whole restructuring. So, can you give us more color about the progress after you acquired -- announced the acquisition of Gap? And also, I can see Baozun seems to be transforming from a pure marketing agency to a more comprehensive service company. So, how do you expect the length of this transition period? When do you see the synergies or integration should be completed and we can see some results or impact going forward? Thank you.\n\nWendy Sun -- Senior Director of Corporate Development and Investor Relations\n\nHello? Hey, operator, can you hear me?\n\nOperator\n\nYes. I can hear you loud and clear.\n\nWendy Sun -- Senior Director of Corporate Development and Investor Relations\n\nOK. Since the line was just -- get dropped [Technical difficulty]\n\nOperator\n\nPlease continue to stand by. Your conference will resume shortly.\n\nWendy Sun -- Senior Director of Corporate Development and Investor Relations\n\nHey, operator.\n\nOperator\n\nHi there. I can hear you.\n\nWendy Sun -- Senior Director of Corporate Development and Investor Relations\n\nOK. You can only hear us [Inaudible]\n\nOperator\n\nYes. But you are coming to me loud and clear.\n\nWendy Sun -- Senior Director of Corporate Development and Investor Relations\n\nActually, how about Charlie, do you have to talk about brand management for the second question? Maybe, Sandrine, can you take this one when we tie together this when ready?\n\nSandrine Zerbib -- President, Baozun Brand Management\n\nYes, sure. Sure. Hello, Charlie. This is Sandrine.\n\nThank you for your question. So, it's about three weeks, we have signed with Gap. We have not [Technical difficulty] happen and, generally, if everything goes smoothly on the approval procedure. So, we are very mobilized in the [Inaudible] which now focuses on really taking a deep dive with a different Gap function to enable a deeper understanding of the operation today.\n\nAnd we identify the areas for improvement. And then based on this, we will be able to pretty much more detail. But still I understand you want to have a little bit of color. So, for the time being, what we are learning from the feedback is confirming what we were seeing in the -- what we're seeing here in the digitization, that on the one hand, there will be some quick wins in terms of a bit of a restructuring and cost cutting, mainly from the fact that we are now managing from China a Chinese company.\n\nAnd then going forward, as we mentioned earlier, we see some real opportunities around product that can be [Technical difficulty] relevant way. And as you may remember, we have full freedom on the supply chain. The supply chain is ours, so we can really improve the speed to market, reactivity to trends, and also bring some elements that are more locally relevant in the product design and development. So, that's one aspect.\n\nThe other aspect is ready to work and actually, the first one, we're also trending to date, to work on the gross margin and reduce the discount level, which are, in our view, too high today. And we believe that by differentiating products by channels, which is not really done today, we can really improve the [Technical difficulty] The third aspect, which would be a priority is for us to revamp the current portfolio of stores. So, it's not really about opening many more stores for the time being. It's going to be really to make the current stores both in terms of look and feel and in terms of operations much better than what we have today.\n\nSo, this is pretty as much color I can give today. With all this, financially, we think that it can translate into a very significant reduction of the loss in '23. We consider that loss can be reduced [Technical difficulty] by half of what it used to be in '22. Then we will see a further reduction of loss in '24 in order to reach breakeven point in '25 and profit in '26.\n\nSo, that is for Gap. And I would leave it to Wendy to allocate the other questions to some other people.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thanks, Sandrine. Charlie, let me maybe answer your question on the Tmall. So, the trends you have seen is actually impacted by a major electronics brands outperforming in Quarter 3.\n\nSo, if we -- excluding the increase of this one single brand, our Tmall percentage has actually dropped. Our non-Tmall has increased by a single digit. So, that's the true reflection of what's going on in the non-Tmall channel. And in addition, our omnichannel strategy is actually not ways of purpose to push the people from the Tmall to a non-Tmall channel.\n\nIt's actually to encourage people to go for the omnichannel, which has increased the stickiness and to provide more value-added service from Baozun to the client. So, by this quarter, we have 42% of our total brand partners through spoken to operate omnichannel holder. So, this is our current situation. Thank you.\n\nCharlie Chen -- China Renaissance -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We will take our next question. Please stand by. Our next question comes from the line of Thomas Chong from Jefferies.\n\nPlease go ahead. Your line is open.\n\nUnknown speaker\n\n[Inaudible] for taking my questions. I have two questions. My first question is, could management share some color about change of domestic versus international brands? And my second question is, could management share some updates about the cooperation with Cainiao and [Inaudible]about expansion into Southeast Asia market? Thanks.\n\nArthur Yu -- Chief Financial Officer\n\nOK. So, Tracy, if you can take the first one, then I will take the second one.\n\nTracy Li -- Vice President, Strategic Business Development\n\nSure. No problem. Hello. Thanks for the question.\n\nI think in terms of the -- to win in the consumer side, I think they're facing the same pressure no matters following our local brands, how to solve the short-term problem and how to invest in longer program to win in that [indiscernible]. But for the online segments, we can see, actually, most of the players are still emphasizing the importance of the online part because of the relatively poor store performance in recent quarters. So, right now, actually, we are working with our brand partners to come out with a three-year plan to talk about how to connect with their consumers directly and then how to allocate their budgets smartly, I mean, cross-channel and also to reach the direct communication with the consumer. And also from the -- for the local brands part, we are likely -- we are very likely to share.\n\nWe have some breakthrough in the past few months to seek the collaboration opportunity in professional ways, areas like IT service, content marketing, interactive marketing technology, and the consumer customer service. I think in the longer run, being professional in specific areas still will be the win in the service market. Thank you.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thank you, Tracy. In regarding to the Cainiao, we have continued our good progress in terms of catching the synergy. So, as we mentioned in the past, we see the synergy coming from three areas.\n\nSo, the first one is join BD. So, where is the Cainiao and Alibaba ecosystem, we would be able to -- I mean, we are seeing some additional BD opportunity coming in from the ecosystem. So -- which is hoping both Baozun logistics and also Baozun as whole to conduct new business. The second one we see is actually to utilizing the scale and even structure of Cainiao.\n\nSo, basically, in terms of the warehousing and in terms of the last-mile delivery Cainiao style has provided a very good kind of support for us to get more resource. And finally, we see the technology enhancement. So, basically previously -- is actually Baozun makes the investment into the technology on the logistics part. And now, we can utilize the Cainiao network on the technology enhancement like RFID technology, which is giving us more efficiency when we operate in the warehouse.\n\nSo, overall, we think we are in the good trend with our alliance with Cainiao. In terms of the Southeast Asia expansion, we are continuing to focus on building our own capability in that region. And also, our approach is trying to replicate some best practice and take the learnings we have from operating the e-commerce in China. But also our approach in the Southeast Asia is to work closely with the brand to grow the e-commerce offerings in that region.\n\nSo, when we have made more progress, we will come to report back to the market. OK?\n\nUnknown speaker\n\nThank you.\n\nArthur Yu -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. We will take our next question. Our next question comes from the line of [Inaudible] from CICC. Please go ahead.\n\nYour line is open.\n\nUnknown speaker\n\nHi, good evening, management. Thank you for taking my questions. We noticed that the number of brand partners for store operations increased. As the macro environment is weak, could you please share something about customer acquisition strategy used in this quarter? And could you please share some details from the new brand partners such as the industry, scale, and the main channels which help them to operate? Thank you.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Thank you. Tracy, would you like to take on, and then I can maybe add on more color after you?\n\nTracy Li -- Vice President, Strategic Business Development\n\nSure. Thanks for the question. For the last quarter, actually, most of our new wins focusing on our new revenue source, which is the IT client and also digital marketing clients. And you can see actually, they are combined with our emerging category like our CC category and also the luxury category -- so which indicates actually our strategy on the one-stop solution, which means we come -- actually, we start from the operation, but we extended our service to other part strategy works.\n\nAnd you can see, actually in this market, we can see some of our clients actually invest a lot in the long-term strategy, including the interactive marketing and also your data and also infrastructure setup. Yeah. Arthur, do you have any other entry question -- answer for this?\n\nArthur Yu -- Chief Financial Officer\n\nNo, I think another thing I would like to add is in terms of the value-added service, we are utilizing the omnichannel and also to utilizing the foundation we have built over the time. We think that will be a main source of the new business coming in the next few quarters. That's it.\n\nUnknown speaker\n\nThank you.\n\nArthur Yu -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] And we will take our next question. The next question comes from the line of [Inaudible] from Guangfa Securities. Please go ahead.\n\nYour line is open.\n\nUnknown speaker\n\nHello, management team. So, I have two questions. The first one is about the luxury revenue has reached fast growth during the past quarter. So, could you please elaborate over on the future strategies for expanding the luxury category? Also do you have a certain benchmark percentage of luxury categories contributing to the revenue? My second question is, do you have the investment strategy for the 2023? Thank you.\n\nArthur Yu -- Chief Financial Officer\n\nOK. Let me answer your second question first. And then Tracy can cover the luxury questions. Yes.\n\nIn terms of the investment strategy, as you have seen, we recently made the announcement of acquiring Gap China's business. So, in the short term, our focus will be building the Gap China business and building the Baozun brand management type a new business unit. So, we will focus our efforts on integration and also transition to make sure it is a success. And in terms of the investment, our focus will, in the short term, be -- the brand-related investments will be our focus.\n\nSo, I mentioned in the last few quarters, Baozun has made investments, either the minority investments or the controlling investment into six brands. And we have made some good progress in terms of those brands, which in Double 11, the GMV from those six brands, adding together has grown over 200% year over year, which shows the enhancement of Baozun adding value to those brands. And also [Inaudible] the Double 11 performance has also been good. The GMV has grown 22% year over year for the Gap during Double 11, which outperforms the market.\n\nAll this shows, with Baozun enhancement, we will be able to add more value to those brands growth kind of story. At the same time, when we're looking at the investment, we're also proactively optimizing our investment portfolio. As mentioned earlier, the Baobida, which is the last-mile delivery investments we made, we actually practically introduced another strategic investor to take the controlling stake and make Baozun become a minority stake. This is because this investment is a little bit duplicate to our strategic lines to -- with Cainiao.\n\nSo, with that in mind, we actually optimize our investment portfolio to turn our style from a majority -- to turn ourselves from a majority shareholder into a minority shareholder. Looking at the medium to longer term, I think our investment priority are focused on the international expansion and also building technology capability on top of the brand management. And with the current market condition, we actually keep an open eye on the good-value assets as we did for the Gap China acquisition. OK.\n\nSo that's on the investment strategy. So, Tracy, maybe you have something on the luxury business. Yes? Tracy, can you hear me?\n\nTracy Li -- Vice President, Strategic Business Development\n\nYes, come back to the luxury story. I think we need to look to the industry from different angles. In short term, actually, definitely, the market is facing pressures on the slowing down growth. Take this Double 11, for example.\n\nMany brands have ramp up in variety and intensively all benefits to enhance the sales such as deeper discount, interest-free installments, and also GMV -- GWP [Inaudible] But on the other hand, we see many of our brand partners are investing for the longer -- middle to longer strategy. Some of them take just two years as opportunities to adjust their pricing strategy. They are more focusing on the product innovation itself. And also the brand group, they emphasize on the consumer-centric and increase their budgets on content marketing and the data infrastructure.\n\nWe see a lot of innovations initiate happening in this Double 11. The lead to the [Inaudible] and also, you see a lot of limited edition SKUs and online SKUs has moving to the live stream topics to continue to drive the sales and also to attract new members. So, I think that is the true size of the factor base currently in the industry. And for Baozun, we still treat luxury as our strategic part of our overall business.\n\nBecause of the luxury market is still growing, they still have lower penetration, and we see a lot of lease in new pipelines right now. And we in the longer run, I think it's not just rely on one or two cases. We rooted in, I think, over 10 years practice in fashion, and then we develop our luxury industry solutions in more forward-looking strategy, which is more omnichannel with leading IT solutions and more consumer driven with a strong in-house sales team and more reliable and value-added service related to logistics solutions. And with all of this, we have the strong belief to grow with the market in the next one or two years.\n\nThank you.\n\nOperator\n\nThank you. We will take our next question. Our next question comes from the line of Charlie Chen from China Renaissance. Please go ahead.\n\nYour line is open.\n\nCharlie Chen -- China Renaissance -- Analyst\n\nThank you, management, for taking my questions again. One question regarding the launch of BOCDOP. So, I heard Vincent mention that. So, can you share more color about this topic? And how do you think about the cost and the top-line contribution for 2023? Thank you.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nThank you for the question. This is Vincent. I will talk about the concept of this is in BOCDOP. We call it BOCDOP.\n\nIn Chinese, we gave you a Chinese name called the [Foreign language], it's product line or solution. And then, Arthur, maybe you can talk more about the revenue of, you know, local expectations.\n\nArthur Yu -- Chief Financial Officer\n\nYes.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nYes. Actually, in the past several years, Baozun's core system, we call this a middle-end system, including all the order fulfillment, order management and processing system, and also order fulfillment system. We call this middle end. This middle end or DOP, digital operating platform, plays a very important role to support an omnichannel retail and D2C-based business.\n\nBecause all the traditional ERPs, they don't have these kind of offerings. I mean China, because of the omnichannel and the online/offline integration is much faster and advanced than the other countries in the market. So, there is a strong demand in the local market for this kind of system. With this system, all the brands can operate their retail and D2C, you know, business. They can open stores on Tmall and JD and WeChat, everywhere in the same time.\n\nAnd they can process all the orders from the channels and make sure they can deliver all these orders to the customers. So, that is the system. So, previously, it's just about a highly customized system for each of the clients Baozun did the same as the other players. Recently, we put a lot of investment in the packaging and the product types of this solution.\n\nBut right now, I think the productization level is much higher than before. So, we package this as a solution. You know, it's a more ready to market. So, we are trying to market the solution to Baozun client base and also other new clients and also some medium and small size of the clients, trying to help us with omnichannel solution, you know, strategy.\n\nSo, that is the concept of the products. We are seeing very good progress, and we're trying to make it better in future, the near future. And, Arthur, about the revenue, what's your view on that? Yes.\n\nArthur Yu -- Chief Financial Officer\n\nYes, sure. So, Charlie, thanks for the question. From a financial point of view, I think we may continue the investments into technology, which is to build the competitive advantage of Baozun over our competitors and from the introduction of the BOCDOP, which is actually helping us to commercialize those technology in a more advanced way. So looking forward, we will be able to see the investment side.\n\nWe continue to make a similar amount of investments into technology year over year, so the cost would not increase. However, we foresee the revenue from the technology will increase year over year because our better structured productization and also commercialization of our IT offerings. So, in return, that will help us to drive our profit margin from the type offering into the market.\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nOne more thing. Thank you, Arthur. One more thing, you know, not only support or the clients with omnichannel order processing and fulfilling capabilities, but also with all the data collected from different channels, we can also deliver a much better business intelligence capability and decision support capability to all the clients. Yeah.\n\nThank you.\n\nArthur Yu -- Chief Financial Officer\n\nYeah. And also in addition to that, I think investment into technology not only benefits the traditional e-commerce business. It will also benefit the Baozun business management business as well. So, with the Gap China, we will be able to use our technology to drive the transformation of the brand we acquired as well.\n\nSo, that will help to create more value.\n\nCharlie Chen -- China Renaissance -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. There are no further questions, so I would like to hand back to management for closing remarks.\n\nWendy Sun -- Senior Director of Corporate Development and Investor Relations\n\nThank you, operator. In closing, on behalf of the Baozun's management team, we would like to thank you for your participation in today's call. If you require any further information, feel free to reach out to the IR team. Thank you for joining us today.\n\nThis concludes the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nWendy Sun -- Senior Director of Corporate Development and Investor Relations\n\nVincent Qiu -- Chairman and Chief Executive Officer\n\nArthur Yu -- Chief Financial Officer\n\nAlicia Yap -- Citi -- Analyst\n\nTracy Li -- Vice President, Strategic Business Development\n\nCharlie Chen -- China Renaissance -- Analyst\n\nSandrine Zerbib -- President, Baozun Brand Management\n\nUnknown speaker\n\nMore BZUN analysis\n\nAll earnings call transcripts"
}