{
  "companyName": "Veritone, Inc.",
  "companyTicker": "VERI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/veritone-inc-veri-q2-2022-earnings-call-transcript/",
  "content": "Veritone, Inc. (VERI 3.31%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Veritone second quarter 2022 financial results conference call. All participants will be in listen-only mode. [Operator instructions] Please note, today's event is being recorded. I would now like to turn the conference over to Brian Alger, senior vice president, investor relations and capital markets.\n\nPlease go ahead.\n\nBrian Alger -- Senior Vice President, Investor Relations and Capital Markets\n\nThank you, and good afternoon. After the market closed today, Veritone issued a press release announcing results for the second quarter ended June 30, 2022. The press release and other supplemental information is available at the Investors section of Veritone's website. Joining us for today's call are both the live and digital twin versions of Veritone's chairman and CEO, Chad Steelberg; president, Ryan Steelberg; and CFO, Mike Zemetra, who will provide prepared remarks and then open up the call for a live question-and-answer session.\n\nPlease note that certain information discussed on the call today, including certain answers to your questions, will include forward-looking statements. This includes, without limitation, statements about our business strategy and future financial and operating performance. These forward-looking statements are subject to risks, uncertainties, and assumptions that may cause the actual results to differ materially from those stated. Certain of these risks and assumptions are discussed in Veritone's SEC filings, including its annual report on Form 10-K.\n\nThese forward-looking statements are based on the assumptions as of today, August 9, 2022, and Veritone undertakes no obligation to revise or update them. During the call, the actual and forecasted financial measures we will be discussing will be presented on a non-GAAP basis, unless noted otherwise. Reconciliations of these measures to the corresponding GAAP measures are included in the press release we issued today. Finally, I would like to remind everyone that not only has this call been produced with Veritone Voice, our proprietary synthetic voice solution, but it's also being recorded and will be made available for replay via a link in the Investors section of the company's website at www.veritone.com.\n\nNow, I'd like to turn the call over to the digital twin of our Chairman and CEO, Chad Steelberg. Chad?\n\nChad Steelberg -- Chairman and Chief Executive Officer\n\nThank you, Brian. Good afternoon, everyone. [Foreign language] As Brian noted, I am digital twin Chad. I'm happy to speak with you today and to provide an update on the progress of our business.\n\nFor the second quarter of 2022, Veritone reported revenue of $34.2 million, representing year-over-year growth of 78% on a GAAP basis and 2% on a pro forma basis. Over the same period, bookings in the quarter nearly doubled and our customer count grew 42%, both on a pro forma basis. As Ryan and Mike will detail shortly, the vast majority of our business tracked very well in the second quarter of 2022. However, actions taken by one of our largest customers, Amazon, impacted our financial growth in the quarter.\n\nAs you can see from the balance sheet in our earnings release, Veritone is well capitalized. We have over $220 million in cash and cash equivalents with many levers of growth. We continue to strategically invest in our growth and the opportunity that aiWARE represents. We are implementing a number of cost-saving initiatives and other tactical changes to better align our business with the opportunities ahead.\n\nArtificial intelligence, in good times and bad, will continue to thrive. Our sequential and year-on-year growth in new customers and bookings in the quarter is a testament to that fact. Additionally, gross revenue retention was well in excess of 90% in Q2 2022. Consumption activity negatively impacted our results in the second quarter, primarily driven by Amazon, even while the fundamental strength of the overall business, our market penetration, and our technology improved meaningfully.\n\nWith ample resources, strong management, and a firm commitment to the end goal, we remain confident in our business, our technology, and our strategy. Now, I'll turn the call over to Ryan, our President, to provide further details on our operational progress. Over to you, Ryan.\n\nRyan Steelberg -- President\n\nThank you, Chad. In the second quarter of 2022, GAAP revenue grew 78% year on year with strong growth in both Software Products and Services, as well as our Managed Services. Quarterly new software bookings of $14.7 million was our second consecutive software bookings record. And as Chad mentioned, our software customer count grew to 594, up 42% year on year on a pro forma basis.\n\nWithin our Managed Services business, we saw strong year-on-year revenue growth as average gross billings per active customer grew 16% to a record $736,000. Let's start the business review with commercial enterprise. Q2 2022 commercial enterprise revenues increased 78% over the prior-year period. Within commercial enterprise, on a GAAP basis, our Managed Services grew 16% year over year, and our software and services revenue grew by nearly 229%.\n\nOn a pro forma basis, our commercial Software Products and Services revenues declined 8% year over year. While PandoLogic's contribution was significant to the first quarter's growth, actions taken by our customer, Amazon, resulted in a significantly softer second quarter despite strong revenues and bookings from our other commercial Software Products and Services. Importantly, on a year-to-date basis, our commercial Software Products and Services are up 21% year over year. Commercial enterprise customer growth, in general, was strong with PandoLogic seeing over 60% year-over-year growth in its customer base, while Veritone as a whole grew its customer base 42%.\n\nOur final customer count at quarter-end was 594. Within commercial enterprise, we are rapidly signing up new customers and partners to leverage Veritone Voice and our broader Veriverse offerings. Though revenue contribution to date has not been material, the contracting and engagement with numerous creators across multiple media genres confirms our expectations for this rapidly evolving market. We expect Veritone Voice and our other Veriverse offerings, in aggregate, to strengthen top and bottom-line expansion.\n\nIn Q2, we completed the acquisition of synthetic voice technology company VocaliD to further accelerate market adoption of our Veriverse offerings. I want to reiterate, customer retention across all of our business remains quite strong, well north of 90%. This strong retention and customer growth continued to fortify our business and provide the basis for our revenue growth through continued land and expand sales efforts. Shifting to government and regulated industries, or GRI.\n\nGRI had a strong quarter on a relative basis. Revenue grew 94% year over year to $871,000. The diversity of revenues and the strong bookings gives us further confidence in our go-to-market strategy and product fit. Our activity with various government and law enforcement agencies, as well as across the broader legal landscape continues to build momentum.\n\nAt the state and local level, our products have tremendous product/market fit, and new LEAs are being added almost every day. In California alone, we have 169 agencies using our software every day. Nationwide, we have over 287 LEAs leveraging our software. At the state and federal level, sales cycles are longer, but our bookings and pipeline of new business continues to build.\n\nOn the energy front, demand has accelerated since we officially launched our iDERMS product suite and presented our performance metrics against the California Independent System Operator and the results of our deployment at Tampa Electric Company. We are now actively engaged in generating revenues from multiple operators, each with significant potential for expansion. In general, Veritone's business remains strong. Our customer growth, record bookings, and increasingly diverse revenue base, all speak to that reality.\n\nEven within the hiring markets, where the size of Amazon's workforce overshadows many, we continue to see extremely strong revenue growth. In fact, excluding Amazon, PandoLogic's revenues were up over 50% year over year. We know we have a significant opportunity to increase our market share, and it is up to us to deliver the right solutions at the right time with the proper amount of support to maximize that opportunity. We remain focused and dedicated to executing on our strategy.\n\nNow, I would like to hand the call off to Mike Zemetra, our CFO, to go through the financial results and guidance in more detail. Over to you, Mike.\n\nMike Zemetra -- Chief Financial Officer\n\nThank you, Ryan. Q2 was a mixed quarter. On one side, we continue to execute across our business with software customer growth of 42% year over year, record bookings up 199% year over year, customer gross retention in the high 90 percentiles, and excluding Amazon, net customer retention well in excess of 120% year over year. Atop this, we ended Q2 with over $220 million in cash, $157 million of which is unencumbered, and instituted cost-saving measures in Q3 2022, most notably curtailing hiring, that when aggregated gives us 10-plus years of cash at this year's projected burn rate.\n\nAs mentioned, we did face some headwinds in Q2 with our largest customer, Amazon, which ran initiatives to reduce its hiring across its fulfillment business beyond the levels we had previously forecasted. Our updated second half 2022 guidance reflects the current estimated run rate of the Amazon hiring consumption. Also, we closed a small but strategic acquisition at the end of the quarter that we believe will accelerate our synthetic voice strategy. During my remaining prepared remarks, I will discuss our Q2 year-over-year performance and KPIs on a pro forma basis as if we own PandoLogic since the beginning of 2021, our Q2 cash position and working capital, and Q3 and full year 2022 guidance.\n\nNow, turning to Q2 2022 financial performance. Q2 revenue of $34.2 million was a record second quarter, up $15 million or 78% from Q2 2021. Software Products and Services revenue increased $12.8 million or 229%, a Q2 record of $18.4 million driven by the addition of PandoLogic coupled with year-over-year increases in our legacy solutions. Managed Services revenue grew $2.2 million or 16% driven largely by growth in content licensing, which rose 42% year over year, driven by the overall increase in digital content usage and in live events coverage as we return to pre-COVID conditions.\n\nOn a pro forma basis, Q2 2022 revenue was up 2% year over year, driven by the 16% increase in Managed Services, offset by an 8% decline in Software Products and Services. During Q2, key customer metrics drove improvements across our Software Products and Services, including ending customers up 42%, customer gross retention in the high 90 percentiles, and net retention, excluding Amazon, up over 120%. Veritone legacy Software Products and Services was the largest beneficiary, increasing 70% year over year. Offsetting this was a decline in AAR of 8% driven in large part by a $5.6 million or 39% decline in PandoLogic business.\n\nDriving PandoLogic's decline was Amazon, which reduced its Q2 hiring consumption as a result of overhiring in Q1 2022 amid COVID-19 constraints coupled with initiatives to reduce overall headcount in its fulfillment business in Q2. As a percentage of our consolidated revenue, Amazon fell to 11% in Q2 2022 as compared to 31% in Q1 2022. On the positive side, Q2 2022 non-Amazon revenue and customer growth for PandoLogic was over 50% year over year. Reaching less than 5% of applicable market share, we see large growth opportunities for our PandoLogic solutions, and we'll continue to aggressively invest in its growth in the near and long term.\n\nIn Q2, we generated strong software metrics. New bookings were $14.7 million, up 199% from pro forma Q2 2021; gross revenue retention in the high 90 percentiles; ending customers of 594, up 42% year over year on a pro forma basis; Q2 AAR of $187,000, down 8% from a pro forma $203,000 in Q2 2021 driven by the decline in Amazon; and excluding Amazon, net retention continued to be over 120%. In Managed Services, advertising gross billings per active customer increased to $736,000, up 18% over Q2 2021. Overall, Q2 2022 advertising revenue was fairly flat year over year, largely driven by the timing of new and larger event-driven campaigns by key customers in the first half of 2021 versus first half 2022.\n\nIn late Q2, we acquired VocaliD for a total of $3.6 million, which consisted of $1.6 million in upfront cash and $2 million in deferred cash payments to be made in 2023. VocaliD will serve as our synthetic voice platform, which will greatly improve the speed and adoption of our synthetic voice products and services. For 2022, we expect VocaliD to generate less than 1% of our consolidated revenue and a relatively neutral impact on our forecasted 2022 non-GAAP net income guidance. Q2 2022 non-GAAP gross profit reached $27.5 million, improving $13.6 million or 97% from Q2 of 2021.\n\nGross margins expanded to 80% in Q2 2022, up compared to 73% in Q2 2021, both benefited from the entire quarter inclusion of PandoLogic, as well as the year-over-year increase in software revenue from legacy Veritone services. As previously discussed, and as we continue to scale over the next 12 to 24 months, including the full impact of PandoLogic, we expect total gross margins to reflect PandoLogic seasonality, which is slowest in the first half of the year and greatest in Q4, improving sequentially throughout the year and for total gross margins to continue exceeding 80% throughout the remainder of 2022. On a pro forma basis, Software Products and Services totaled 54% of revenue in Q2 2022 versus 60% in Q2 2021 pro forma driven by the year-over-year decline in Amazon. Q2 2022 pro forma gross margin was slightly down year over year at 80% as compared to 83% in Q2 2021.\n\nQ2 non-GAAP net loss was $7.2 million as compared to non-GAAP net loss of $3.9 million in Q2 2021. Driving this increase were recent growth investments in our operations, namely, in hiring of engineering, sales, and marketing resources to accelerate 2022 and long-term revenue growth. In addition, we are spending roughly $5 million more per year in new employee retention initiatives and launching new infrastructure systems to enable us to scale more efficiently, including Oracle and Workday, each of which launched in Q2 2022. During Q2, core operations posted a non-GAAP net loss of $1.5 million compared with a profit of $1.4 million in Q2 2021, reflecting the recent investments we've made.\n\nThe corporate non-GAAP net loss was $5.7 million, relatively flat when compared to $5.3 million in Q2 2021. The slight increase was driven principally by higher G&A costs to support our growth year over year, coupled with first year of full Sarbanes-Oxley compliance costs. As a percentage of revenue, corporate costs dropped from 28% in Q2 2021 to 17% in Q2 2022. On a pro forma basis, the $7.2 million Q2 non-GAAP net loss compares to a $2.0 million non-GAAP net profit in Q2 2021, reflecting lower revenue and margin from Amazon in Q2 2022 coupled with a higher operating cost base.\n\nOur hiring plan for 2022 was front-loaded in the first half of 2022, which will also have a heavier impact on forecasted 2022 bottom-line results. Turning to our balance sheet. At June 30, 2022, we held cash and restricted cash of $220.5 million, including approximately $64 million from Managed Services customers for future payments to vendors. This compares to $254.7 million at December 31, 2021.\n\nThe 6-month $34.2 million net decrease reflects net cash outflows of $30.6 million from acquisition-driven and financing activities, including approximately $14.4 million cash outflows for PandoLogic's 2021 earnout; $9.5 million in restricted stock net settlements; and $6.9 million in cash paid for investments, acquisitions, and fixed assets. Cash flow from operations of negative $4.3 million over the first half reflects the $12.3 million first half non-GAAP net loss, partially offset by net positive working capital changes from operations. Working capital will continue to fluctuate depending on the timing and due dates of payments in any given period. Our unencumbered cash at the end of Q2 2022 was approximately $157 million, which at today's projected 2022 burn rate is sufficient to operate the existing business and support growth for the next 10 years plus.\n\nWe ended June 30, 2022, with 36.1 million shares outstanding. Turning to financial guidance for Q3 and full year 2022. As previously discussed, Amazon's recent hiring actions had a greater-than-expected impact on us in Q2 2022, which we are estimating to continue for the remainder of this year. As a result, we are updating our previous top- and bottom-line guidance for the year, including Q3 2022, to better reflect this estimated impact of Amazon on our results.\n\nWith that backdrop and a reminder that PandoLogic has significant revenue seasonality with the lowest consumption in the first half of the year and accelerating throughout the second half of the year, we expect Q3 2022 revenue to be between $34 million and $36 million, representing an approximate 54% increase year over year at the midpoint versus Q3 2021 GAAP and relatively flat versus Q3 2021 pro forma. Q3 guidance includes a full quarter of our recent acquisitions, which is projected to represent approximately 2% to 3% of Q3 consolidated revenue. We expect Q3 2022 non-GAAP net loss to be between $7 million and $6 million as compared to Q3 2021 non-GAAP net loss of $2.3 million but slightly down versus Q2 2021 pro forma non-GAAP net income of $3.9 million, reflecting the decline in Amazon coupled with the stepped-up investments in people and infrastructure costs to support our near- and long-term growth. For full-year 2022, we expect revenue to be between $150 million and $160 million, representing a year-over-year increase of 35% at the midpoint on a GAAP basis and near 5% increase on a pro forma basis for 2022.\n\nThe primary driver of this updated revenue outlook is Amazon, with our guide now reflecting a lowered state of Amazon hiring consumption throughout the remainder of 2022. We expect our combined Software Products and Services revenue growth to be an approximate 50% year over year on a GAAP basis. Full-year 2022 guidance includes our recent Q2 acquisition, which is projected to represent approximately 2% of full-year 2022 consolidated revenue. We expect full-year non-GAAP net loss to be between $10 million and $15 million depending on the timing and the overall mix of our revenue.\n\nThis compares to a non-GAAP net profit of $6.8 million in 2021. Before I close, we plan to be speaking at the BofA SMID Cap Ideas Conference tomorrow, August 10. If you'd be interested in scheduling a one-on-one, please reach out to Brian or your BofA representative. Operator, now we would like to open up the call for questions.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] Today's first question comes from Koji Ikeda with BofA. Please go ahead.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking my questions. You know, just thinking about PandoLogic and how much it's kind of driving the guide down here. I know it comes out in the Q, but I was wondering if you could just kind of give us on an absolute basis what the revenue contribution from PandoLogic was in the quarter.\n\nKind of the back-of-the-envelope math looks like about $3.7 million. Is that about right? And then just kind of getting more granular, what was the Amazon contribution so we could start parsing that out and looking at the other side of the business that was growing faster for Pando.\n\nMike Zemetra -- Chief Financial Officer\n\nYeah. I'll take maybe the second part of that question. We said Amazon represented about 11% of our consolidated revenue for Q2, and we don't specifically break out PandoLogic from the legacy business. But historically, we said that Amazon represented, you know, anywhere from, call it, 70% to 80% of that business.\n\nHowever, with the growth of the non-Amazon revenue, it's substantially lower now.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, Mike. So, the Amazon part was 11% of total revenue. Got it.\n\nGot it. OK. OK. So, thinking about the profitability profile of the business and the net income guide down, it looks like that's pretty much attributable to Amazon.\n\nIs that the right way of thinking about the net income guide down? But more so kind of thinking going forward, when can we potentially expect you guys to get profitable again? What needs to happen either from a Veritone business, aiWARE, or PandoLogic business for you guys to get profitable net income? Thanks, guys.\n\nChad Steelberg -- Chairman and Chief Executive Officer\n\nYeah, sure. Mike, why don't I take it a little bit more on the strategic side? Then Ryan can jump in operationally. From -- when you think about our business and how we're investing, I mean, this year, at the tail end of last year, we had just over 500 employees. And today, we're sitting at just over 700.\n\nSo, we continue to significantly invest in both sales, marketing, and technology investment in the company because our strategy is working. If you look at our net retention and our growth metrics on the business, net of Amazon, one customer, they're as good as we've seen in our past and record-breaking in some cases. 199% growth in total bookings, 42% customer growth, 60% CAGR over the past five years. And so, we know what we're doing is working.\n\nWe're continuing to be diligent. But at the same time, right, we're also being conscious of macroeconomic environments. We are conscious of what's happening in Amazon, and we're being smart about how we're managing the business and realigning it for growth. And so, again, I don't want the Street or you, Koji, to think in any way that this, in any way, reflects that our strategy hasn't been on point.\n\nI think that we just got caught a little bit blindsided by how strong the negative impact was on Amazon hiring. And a testimony to the PandoLogic team, we've recovered and done a phenomenal job in growing other sectors of that business very quickly. So, Mike?\n\nMike Zemetra -- Chief Financial Officer\n\nYeah. And then if you take a step back, I mean, our commercial enterprise business is incredibly profitable, including PandoLogic. And we're continuing to invest in long term across the regulated industry and enterprise part of our business. And we're not going to give any guide in terms of 2023, but we're going to continue along the same strategy, and it should turn the ship here shortly if that makes sense.\n\nRyan Steelberg -- President\n\nAnd I would just add that I think the investments that we've made in the human capital side and on the product side, I feel very confident that we have the right product mix and -- both in production today and frankly, that's emerging right now into full production that I don't think any potential curtailing of our internal hiring pace is in any way going to disrupt our revenue potential growth as it relates to our products and services. So, I think our -- again, a testament to our increased customer counts, our very high net retention rates coupled with what, frankly, has already been built or is being built here shortly, very, very bullish on the future growth prospects for every other area of the business. And also, including Pando, their continued excellence in growing their nonhigh-volume sellers and really, say, non-Amazon business is incredible.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, guys. Thanks for taking the questions.\n\nChad Steelberg -- Chairman and Chief Executive Officer\n\nSure.\n\nOperator\n\nAnd our next question today comes from Darren Aftahi with ROTH Capital Partners. Please go ahead.\n\nDarren Aftahi -- ROTH Capital Partners -- Analyst\n\nHey, guys, thanks for taking my questions. Two, if I may. Just on the record bookings, can you guys kind of dive in a little bit deeper into kind of where you're seeing strength there and maybe when that revenue is actually going to get recognized and manifest in the business? And then, Ryan, I think you said advertising was flat. I'm just curious, every other kind of ad tech company has kind of talked about this disastrous cadence.\n\nSo, I'm curious to understand the cadence between April and June and maybe into July, if you're actually seeing your business soften further and if that's taken into account in the guidance going forward. Thanks.\n\nRyan Steelberg -- President\n\nYeah. You know, our ad business has been very strong and resilient. Our actual gross billing per customer are up, and we'll -- I think that some of the details we provided in the tables. More importantly, I could tell you that as of two days ago, our ad business has booked already more total revenue of billings than all of last year.\n\nAnd a couple of primary reasons why our ad business is more resilient is, a, we have a very differentiated solution. Again, because of aiWARE, we have a very unique offering where only a few companies like us can really do contextual-based insight targeting to influence through the creative economy. I don't want to get too technical there, but it's a clear product differentiation. Number two is our business is performance marketing.\n\nSo, unlike a lot of other brands, CPM-based or impression-based buyers, almost all of our spend -- or super majority of our spend is performance-based. And it just shows the testament that we -- as long as we're delivering performance, we're able to maintain those bookings. The only negative side was -- the only downside at all, if I'm trying to find anything in the ad business, was just some of the start-up businesses that we always like to try to nurture considering the pullback in venture spending had it. But we had increased growth in all of our large -- increased spend from the majority of our larger customers in the ad business.\n\nSo, very, very pleased, and I expect continued strong performance.\n\nMike Zemetra -- Chief Financial Officer\n\nYes, maybe I'll take the bookings one. I mean, Darren, it was across the board. It wasn't one specific area, just really representing the strength of our business. And you could probably expect about 60% of that or so to be realized over the next 12 months.\n\nRyan Steelberg -- President\n\nAnd Veritone Voice, Darren, and some of our new technologies are part of that bookings.\n\nDarren Aftahi -- ROTH Capital Partners -- Analyst\n\nThanks, Ryan.\n\nOperator\n\n[Operator instructions] Our next question comes from Chad Bennett at Craig-Hallum. Please go ahead.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks for taking my question. So, it looks like relative to the prior bookings question, you actually did see a pretty decent uptick, just backing into numbers. I know you don't like to disclose kind of what Pando was but backing into numbers on aiWARE sequentially.\n\nSo, was that -- from a revenue standpoint, I should say. So, was that a function of -- again, kind of what drove the aiWARE growth sequentially from a revenue standpoint?\n\nRyan Steelberg -- President\n\nWell, from a bookings -- as we stated earlier, it was primarily through increased selling and the mobilization of commercial enterprise products and services and software and also an uptick in bookings on GRI, between primarily those two elements.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nOK. But the GRI business, you know, again, I'm talking sequentially, was up modestly sequentially. So, it seems like it was a lot of other commercial-related sectors that drove aiWARE revenue growth sequentially. Is that what you're saying?\n\nRyan Steelberg -- President\n\nCommercial enterprise, yes, was the majority or the lion's share of the bookings.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nOK. And then second question just on -- you know, when we're thinking about the Pando business model and margin profile when you acquired it, is that still -- at the current run rate, is that still a 50% EBITDA margin business?\n\nMike Zemetra -- Chief Financial Officer\n\nYeah. I could take that one. So, we have made investments into PandoLogic, namely, on sales and marketing and R&D. So, we're running slightly below that 50%, but it's still incredibly profitable.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nAll right. Thanks for taking my questions.\n\nRyan Steelberg -- President\n\nThank you, Chad.\n\nOperator\n\nAnd our next question comes from Pat Walravens at JMP Securities. Please go ahead.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you. I have two. Maybe I'll start with one for Mike.\n\nSo, Mike, when does -- how much debt is there? When does it come due? And should we be worried about you repaying it?\n\nMike Zemetra -- Chief Financial Officer\n\nYeah. Good question. So, there's a little over --\n\nPat Walravens -- JMP Securities -- Analyst\n\nYeah. I was thinking [Inaudible]\n\nMike Zemetra -- Chief Financial Officer\n\nYeah. $200 million, it's convertible debt. We issued the notes in November of last year. They're five-year notes, interest-only, and they're convertible about $36 a share.\n\nSo, no covenants, nothing crazy. So, it's all sitting in long term, but nothing to worry about in the near term.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOK. And right now, you have $150 million in unencumbered cash, right? So, I think --\n\nMike Zemetra -- Chief Financial Officer\n\n$157 million.\n\nPat Walravens -- JMP Securities -- Analyst\n\n$157 million. We just want to hear you guys are going to start generating cash, right, so that we don't have to worry about this.\n\nMike Zemetra -- Chief Financial Officer\n\nYes, of course.\n\nPat Walravens -- JMP Securities -- Analyst\n\nAnd then secondly, Chad, benefit of 2020 hindsight, and obviously that's a big, you know, caveat, but what would you have done differently around Pando?\n\nChad Steelberg -- Chairman and Chief Executive Officer\n\nYou know, I think we all went into Pando transaction with our eyes wide open. We knew that they had a significant customer concentration in Amazon. We knew that they were investing heavily, and we were helping them invest in expanding their business line into differentiated new customers that were smaller. And obviously, you're going to have less revenue per customer, but you're going to get a lot more tonnage in the TAM through that.\n\nAnd so, we knew exactly what was expected. And to be honest, I think at some point, we knew that Amazon was going to slow. I think the surprise for us is just how quickly they hit the brakes on that. But that business is still massively profitable.\n\nIt's a phenomenal acquisition for us even in today's economics, and we're extremely bullish about what that looks like going forward. So, I don't think, Pat, there was any real surprises. I think we structured the transaction really well on the earnout side and incentivized the management team and protected the Veritone shareholders with making sure that we're all aligned and there was some protection in terms of what the net-net cost would be in the event that Amazon or another catastrophe might have hit the business. So, at the end of the day, again, profitable business, going well.\n\nI think we still purchased it nicely. They're integrating aiWARE technology and continuing to innovate. So, I'm very excited about it. We'll do it again in a heartbeat.\n\nMike Zemetra -- Chief Financial Officer\n\nAnd remember, and I'm not sure this came out on the call, I mean, it's certainly in the earnings release, the software side of the business was up 21% first half sequentially -- or first half over first half. And PandoLogic was up still 18%, 20% as well. And remember, in the first half, we got a benefit from Amazon overhiring, which they corrected in Q2. It was just a larger correction than what we anticipated.\n\nSo, the fundamentals of the PandoLogic business are still performing over the first half of the year. We do expect there to be some incremental lower consumption in the back half, but this thing is still rocking and rolling.\n\nRyan Steelberg -- President\n\nIf I may add, and then just real quick about that also is in terms of market share, right, on the programmatic side, we believe that the programmatic has already -- has really only touched about 5% of the market opportunity. So, it's a very high ceiling of growth for that opportunity. And then obviously, that's a testament -- or reinforced by our ability to grow unique customers over 50%.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOK. And then my last one on this topic is so in the press release, the purchase price was $150 million, but that was cash stock and an earnout, right? So, Mike, can you remind us how that was initially structured? And what did it really work out to? At the end of the day, did you guys really pay $150 million?\n\nMike Zemetra -- Chief Financial Officer\n\nYes. So, I mean, we'll find out by the end of this year. But it was $85 million upfront, and then the remaining $65 million was based upon earnouts in 2021 and 2022. They fully hit their earnout in 2021.\n\nSo, we've got about $43 million of the $65 million to be paid out based upon their performance this year. And it's literally -- it's a waterfall schedule from zero to $21 million to $43 million, depending on their end-of-year results. So, intuitively, if they end up missing, which is why we put in this protection around Amazon, that purchase price would be significantly lower.\n\nPat Walravens -- JMP Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAnd ladies and gentlemen, this concludes our question-and-answer session. I'd like to turn the conference back over to Chad Steelberg for any final marks.\n\nChad Steelberg -- Chairman and Chief Executive Officer\n\nThank you, operator. We are pleased with the overall execution of our business. Our customer growth, retention, and new bookings all speak to the fundamental strength of the business. We have ample resources in terms of capital and talent to pursue and execute against our growth strategies.\n\nOur confidence in aiWARE is backed by our strong customer metrics, and we remain steadfast in our strategy. Despite the ongoing geopolitical and macroeconomic volatility that surrounds all of us today, without question, the future of enterprise is going to be powered by artificial intelligence, and we believe Veritone will play a vital role in unlocking that potential. Thank you for joining us on today's call. Good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Alger -- Senior Vice President, Investor Relations and Capital Markets\n\nChad Steelberg -- Chairman and Chief Executive Officer\n\nRyan Steelberg -- President\n\nMike Zemetra -- Chief Financial Officer\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nDarren Aftahi -- ROTH Capital Partners -- Analyst\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nMore VERI analysis\n\nAll earnings call transcripts"
}