{
  "companyName": "Lucira Health, Inc.",
  "companyTicker": "LHDX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/lucira-health-inc-lhdx-q2-2022-earnings-call-trans/",
  "content": "Lucira Health, Inc. (LHDX -7.42%)\nQ2 2022 Earnings Call\nAug 15, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to Lucira Health second quarter earnings conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. As a reminder, this conference is being recorded. I would now like to turn the conference over to Louisa Smith from the Gilmartin Group.\n\nLouisa Smith -- Investor Relations\n\nThank you, Olivia, and good afternoon, everyone. Earlier today, Lucira Health released financial results for the second quarter ended June 30, 2022. A copy of the press release is available on the company's website. Joining me on today's call are Erik Engelson, president and chief executive officer; and Dan George, chief financial officer.\n\nBefore we begin, I'd like to remind you that during this conference call, the company will make forward-looking statements regarding future events. We encourage you to review the company's past and future filings with the SEC, including, without limitation, the risk factors section in the company's most recently filed annual report on Form 10-K and subsequently filed quarterly reports on Form 10-Q, which identify the specific factors that may cause actual results or events to differ materially from those described in these forward-looking statements. These factors may include, without limitation, statements regarding product development and manufacturing, product potential, the regulatory environment, sales and marketing strategies, capital resources, or operating performance.  With that, I'll now turn the call over to Erik.\n\nErik Engelson -- President and Chief Executive Officer\n\nThank you, Louisa. Good afternoon, everyone, and thank you for joining us. Welcome to the second quarter 2022 earnings conference call. Lucira had a solid second quarter in which sales continue to be driven by demand for our accurate and easy-to-use molecular COVID-19 test.\n\nSecond quarter revenues were approximately $26.1 million, a 110% increase over sales in the same period last year. Second quarter 2022 ending cash and cash equivalents was $75 million, and inventory was bolstered in advance of anticipated shipments in the fall and winter time frame. The anticipated dip from Q1 revenue performance is consistent with our previously stated expectations that the calendar year will be book-ended based on the prevalence of influenza-like illness infections in the Northern Hemisphere during fall and winter months. Despite the seasonality that we experienced this quarter, we are pleased with our financial performance delivered in a quarter known to be a light performer for respiratory disease testing in general.  Throughout the second quarter, we exercised our manufacturing flexibility, made global regulatory strides, grew our online selling and targeting capabilities and progressed the product portfolio.\n\nAs it relates to our existing COVID-19 product, we received approvals from the FDA and Health Canada to extend shelf life to 18 months. As a result, we believe we are well positioned to respond to anticipated COVID-19 test demand during the upcoming winter respiratory season in the Northern Hemisphere with on-hand inventory. In addition, we submitted a de novo 510k application to the FDA for clearance of our COVID-19 product, anticipating a future day when the EUA may be rescinded. In early July, we announced that the COVID-19 test received a full exemption in New Zealand for immediate commercial use.\n\nAs is the case in most countries where we have received approval, New Zealand performed its own clinical evaluation prior to granting the full exemption. I'm pleased to share that Lucira's products have consistently performed very well during these independent evaluations. We are readying the COVID and flu product launch in key global markets upon additional regulatory approvals. As previously announced, the EUA for this product has been submitted to the FDA.\n\nThe early spike in influenza-like illness prevalence reported from Australia during their recent winter sensitized us to the demand that we may see in the Northern Hemisphere this fall and winter. In response, we plan to focus our flexible manufacturing capacity mostly on the COVID and flu tests. We are delighted with last week's announcement of the commercial rollout of the COVID and flu product in Canada. Lucira received regulatory approval from Health Canada for the sale of the COVID and flu test with a self test at home indication.  In preparation for this announcement, we built an initial launch quantity of the combo test, and we plan to ship product in Canada starting this month.\n\nThe approval in Canada enables patients and healthcare providers to accurately diagnose flu A, flu B and COVID-19 on the spot in 30 minutes or less with lab quality results. Lucira's digital result capture, transmission and integration software has been upgraded so that it now works with the combo product. The ability to have an accurate and immediate differential diagnosis for these diseases enables near real-time prescription initiation and treatment. This is accomplished without exposing healthcare professionals to potential infection as a result of at-home testing.\n\nWe believe that we have sufficient capacity to support anticipated demand, including the manufacture of the COVID and flu product. As I alluded to previously, regarding the upcoming Canadian launch, the speed with which Lucira was able to create the COVID & Flu product speaks to the flexibility of the core Lucira technology as well as to the skill and agility of our team. Because Lucira has been refining the core technology and developing assays for nearly 10 years, we benefited from past work. Going forward, we anticipate leveraging work already accomplished on other assays, such as chlamydia and gonorrhea, for example.\n\nLonger term, we believe that the flexibility of Lucira's technology, compared with our commercial performance over the last several quarters, demonstrates that strong financial performance can be achieved with modest volumes. In addition, substantial progress was made in the evolution of LUCI Connect, our digital reporting and integration platform. For example, operational speed and several other convenience features were recently improved. We have exciting initiatives in the works that will help close the loop between test results and treatment.\n\nFor example, upon receiving a positive test result, LUCI Connect will link a patient to high-quality, low-cost providers at the patient's convenience. This, in turn, will result in rapid consultation, prescription, and drug delivery as appropriate. Not only will this provide ease and convenience to patients at home, but it will be a value-added Lucira service to our telehealth partners. We are investing in LUCI Connect, both to improve the patient's experience and also because it will be good for business.\n\nThis is only the beginning. We have big plans in development to expand the functionality of LUCI Connect in the near term, and look forward to sharing more about this in coming quarters. We believe that technology applied to the needs of our customers is at the core of our mission, and that long-term growth with a digital emphasis opens the door to diverse partnership capabilities and telehealth applications. Lucira views COVID-19 testing as a proxy for the company's capabilities in the emerging category of highly convenient testing.\n\nAdditionally, we consider ourselves as both a molecular test manufacturer as well as a digital healthcare company. Bain & Company recently announced data on the transition in the way that primary care is delivered. They reported that during the pandemic, 18% of primary care visits were virtual, increasing from 1% in 2018. The share of virtual primary care settled at around 12% at the end of 2021, much higher than pre-pandemic levels.\n\nAnd virtual health could climb to 20% of market penetration by 2030. We believe that Lucira will play an increasingly important role in this paradigm shift in the control of infection and early treatment of respiratory diseases, STIs, and in women's health. Accurate instrument-free molecular tests, paired with our flexible digital platform that integrates into partner systems, enables convenience, and ease of use. We believe that when we look at Lucira, we are seeing stepping stones along a path into the future.\n\nMore new products, expansion of the digital platform, greater market awareness of Lucira's offerings, greater DTC penetration, international expansion, and decreased cost of goods are our growth drivers. Appropriate stewardship of capital is always front of mind. We are doing very exciting things at Lucira, and we have just gotten started. As always, we recognize and thank the employees, partners, and contractors, who execute Lucira's mission with their hard work and enthusiasm.\n\nWhat you have just heard about does not come easily despite our team's ability to make it appear so. I will now turn the call over to Dan George, our CFO, for a detailed discussion of financials.\n\nDan George -- Chief Financial Officer\n\nThanks, Erik. Please refer to our press release issued earlier today for a summary of our financial results for the second quarter of 2022 and a discussion on and reconciliation of our non-GAAP financial measures. Net sales for the second quarter of 2022 were $26.1 million, a 110% increase over the second quarter of 2021. Our net revenue was primarily driven by sales directly to consumers, businesses and distributors, healthcare providers and international customers.\n\nGross profit and gross margin for the second quarter of 2022 were $8 million and 31%, respectively, compared to a gross loss and negative gross margin for the second quarter of 2021 of approximately $100,000 and 1%, respectively. Our increase in gross profit and gross margin was driven primarily by increased sales and operational efficiencies gained through increased manufacturing output and scale. R&D expenses were $10.8 million in the second quarter and compared to $10.1 million in the same period in 2021. New product development, clinical activities and validation and manufacturing activities primarily drove the increase.\n\nSelling, general, and administration expenses were $18.6 million in the second quarter of 2022 compared to approximately $6.1 million in the same period in 2021. The increase was primarily related to increasing personnel-related costs and third-party services to facilitate commercial activities and public company compliance.  GAAP net loss was $21.7 million in the second quarter of 2022, compared to $16.2 million in the same period in 2021. Non-GAAP net loss was approximately $18.1 million in the second quarter of 2022, compared to $14.7 million in the same period in 2021. The increase in net loss was primarily a result of our increased operating expenses.\n\nWe ended the quarter with $75 million in cash and cash equivalents, compared to cash and cash equivalents of $106 million at the end of 2021. The decrease in cash was primarily related to investments made in inventory, partially offset by the closing of the first tranche of our debt financing agreement of $30 million. As a reminder, most of our investments in our contracted manufacturing facility in the Dominican Republic have been completed, allowing us now to manufacture at scale. These investments include automation of certain critical manufacturing steps.\n\nWe are also investing in our lease facility in San Diego County, which will house commercial operations and other functions. We believe we have the cash necessary to fund our long-term business strategy. I'll turn the call back over to Olivia for Q&A.\n\nOperator\n\nThank you. [Operator instructions]. And now our first question, coming from the line of Brian Weinstein from William Blair. Your line is open.\n\nGriffin Soriano -- William Blair -- Analyst\n\nHey, guys. Good afternoon. This is Griffin on for Brian. Thanks for the questions.\n\nMaybe just to start, Dan, on outlook. I appreciate that you're not giving any formal guidance here. But maybe can you just talk about how you're thinking about the second half? About halfway through the third quarter here, and we've got the respiratory season coming in the fourth quarter. So just any color on second half would be helpful.\n\nDan George -- Chief Financial Officer\n\nSure. I mean, to your point, Griffin, we're not giving guidance, but I think you can look at our third quarter as sequential growth -- top line sequential growth over Q2. And as Erik mentioned in the prepared remarks, we're looking for a strong Q4 and Q1 that coincides with the fall and winter months.\n\nGriffin Soriano -- William Blair -- Analyst\n\nOK. Yes. I appreciate that. And then on the Health Canada over-the-counter combo approval last week, and I know you guys already have a CE mark there.\n\nJust first, any color on where ASPs sort of the combo test are coming in internationally? And then second, just bigger picture on these markets, are these more nice markets to have? Or do you think they are real drivers in terms of revenue going forward?\n\nErik Engelson -- President and Chief Executive Officer\n\nGriffin, Erik here. The ASPs in Canada are similar to the ASPs in the U.S., just converted into Canadian currency. So about CA$98 for the combo and CA$84 for the COVID test. And we see Canada as an important part of our business going forward.\n\nSo we're very pleased to have this approval.  And in fact, Health Canada approval marks the first time an at-home self-test for COVID and flu has been approved by a major regulatory body. So this was partially pulled by Canada and partially facilitated by Lucira. So we're very pleased with this, and have expectations that this will be important to Lucira.\n\nGriffin Soriano -- William Blair -- Analyst\n\nOK. And then on the pipeline, just specifically giving CT/NG, leveraging past work there as an example. Maybe could you just give us an update on maybe not formal time lines, but where you are in the process? I think last quarter, you're undergoing some feasibility evaluation. So just any update on the pipeline beyond respiratory would be helpful.\n\nErik Engelson -- President and Chief Executive Officer\n\nYes, absolutely. So just as the COVID and flu product is here today in Canada and, hopefully, will be soon in the U.S. and elsewhere. Next -- the next thing to focus on is our digital offering.\n\nIt's going to be, we believe, very important to our business because it's going to enable a connection between a positive test result and prescription and treatment. And making that seamless and easy to use in a digital world without the need for any other instrumentation, readers, etc., will make it extremely convenient to users. So I would focus on that as the next step in the pipeline, and we're very excited about that.  We have been continuing to work on chlamydia and gonorrhea and other tests in the background, and we'll have more color to share on those in the coming quarters. So I don't want to get too far ahead of ourselves here for the resources into the digital effort, and I would focus on that as the next delivery.\n\nGriffin Soriano -- William Blair -- Analyst\n\nAll right. And then maybe just to wrap up a bigger picture question. Would love to just get some updated thoughts on maybe the sort of future of diagnostics and testing in home, some lessons that you've learned over the past couple of years that are informing some of these thoughts and why you think Lucira is well positioned going forward?\n\nErik Engelson -- President and Chief Executive Officer\n\nAll it took was this little pandemic to help create this transition. I mean that -- not so facetiously. This would have been a slower transition had it not been for the COVID pandemic. But just as I mentioned that Bain & Company research pointed out, this transition is happening now.\n\nIt's happening in the U.S., and it's happening in other markets. One of our talented team members internally likes to point out that, back in the day, you used to have to go to Blockbuster to rent a video. And now that's hard to even imagine when you can stream at home. It's the exact same kind of transition in diagnostic testing leading to treatment.\n\nAnd particularly in the case of infectious disease, you don't want people in circulation, and you want to be able to treat -- test and treat as early as possible. And oftentimes, that means that you're feverish. So you don't even have the energy to go out and be tested at that point. And I have specific examples of myself and other family members who have suffered through this.\n\nI was absolutely positive after returning on an international flight in July that I had flu because it felt everything like flu. It wasn't flu, it was COVID. And I knew that because I could test immediately on Lucira, and then I was able to get treatment following that. I think that's the future.\n\nSo I think the time is now, and Lucira is right at the right point to be able to contribute to this transition and to build a very strong business around this.\n\nGriffin Soriano -- William Blair -- Analyst\n\nAll right. Thanks for the questions.\n\nErik Engelson -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And our next question, coming from the line of Derik De Bruin from Bank of America. Your line is open.\n\nJohn Kim -- Bank of America Merrill Lynch -- Analyst\n\nHi, team. This is John on for Derik. I wanted to ask about the cash. Obviously, you guys are building up your inventory and that contributed to a significant burn in the quarter.\n\nHow should we think about the runway? Or how much runway -- how much run rate do you have with all these products coming online, with all the approvals happening internationally and domestically?\n\nDan George -- Chief Financial Officer\n\nSure. So as I mentioned, we do believe that we have significant or enough cash capital to see us through our strategic forecast. And we do plan on utilizing in the back half of the year the inventory that we've already invested in to facilitate COVID sales.\n\nErik Engelson -- President and Chief Executive Officer\n\nYes. No, I would just add, and just to underscore that the extension to 18-month shelf life is very helpful in that regard, in removing risk around that inventory. So we're very pleased about that. And also complements to our team on the ability to develop and execute a new product on minimal operating expense.\n\nSo really well done internally.\n\nJohn Kim -- Bank of America Merrill Lynch -- Analyst\n\nOK. Then going forward, how are you thinking about COVID-19 versus a combo mix in terms of contribution to sales in the back half as well as beyond?\n\nErik Engelson -- President and Chief Executive Officer\n\nYes. So the good news is that our manufacturing is flexible enough, and these products lend themselves to this flexibility so that we can move back and forth fairly readily. And so we'll plan to do so. Now that we have the inventory that we have of COVID product, we will prioritize building of the combo product.\n\nAnd so that just gives us a lot of flexibility and resistance to any forecasting errors to be able to supply the market. So look, we're going to have to see how this rolls out. It's hard to imagine that if you can test for both COVID and flu that you're not going to do so because both diseases have similar presenting symptoms. And you just don't know.\n\nSo if you're going to test, why not test with a combo? It's hard to imagine not. There are some circumstances where one would want to just use a COVID test, and so we'll have product available for that.\n\nJohn Kim -- Bank of America Merrill Lynch -- Analyst\n\nGot you. Yes, that makes sense. Then in the quarter as well as going forward, if you're able to give us any thoughts on what the split was between the pre-procedural screening and B2B and consumer? I'd be curious to know that.\n\nDan George -- Chief Financial Officer\n\nYes. We -- you'll see in our 10-Q, I would say, close to 50% of our quarterly revenue came from direct-to-consumer. And then that was followed by our international B2B and then healthcare segments.\n\nJohn Kim -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you.\n\nErik Engelson -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd our next question coming from the line of Rahul Rakhit from LifeSci Capital. Your line is open.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nHey, guys. I guess just one for me, more housekeeping question. In terms of thinking about gross margin, I know you guys are kind of -- you said -- you mentioned that you're shifting manufacturing toward the combo test. I guess, directionally, can you comment on how you just think about gross margin moving forward? And what impact, if any, early manufacturing of the combo test could have?\n\nDan George -- Chief Financial Officer\n\nRahul, I think you're going to see a really similar impact on gross margin that we've seen in the past. So our gross margin is on [Inaudible] volumes. It impacts from overhead absorption to machine cost to our labor rates with our contract manufacturers. So I think when you think about the business, we're looking at being at gross margins north of 60% at volume.\n\nI think Q1 is a pretty good proxy for what it looks -- what our business looks like from both a gross margin perspective to a net margin perspective when we achieve even modest volumes.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nGot it. Appreciate that. And actually, one more, if I can squeeze it in. Just thinking about the combo testing, I know you kind of -- I appreciate kind of scares the breakdown of revenues across different channels given that the combo test is available in Canada and presumably will be available in the U.S.\n\nfor part, if not the majority of the season. Are you expecting to see an increase in B2B contracts with the entry of the combo test? Or do you still expect those sales primarily to be driven through the DTC channel?\n\nErik Engelson -- President and Chief Executive Officer\n\nSo, Rahul, it will be distributed among our four main channels, which you've named. And whereas in Canada, heavier healthcare/government and then DTC channels. So I think from a modeling point of view, I think you can look across the four channels in the U.S. and then a more focused government healthcare DTC in Canada.\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nGot it. OK. That makes sense. Appreciate it.\n\nThank you, guys.\n\nErik Engelson -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nI'm showing no further questions at this time. I would now like to turn the call back over to Mr. Erik Engelson for any closing remarks.\n\nErik Engelson -- President and Chief Executive Officer\n\nThank you, Olivia, and thank you all for your time this afternoon, for your interest in Lucira Health. We are building on significant achievements and greatly appreciate you, our investors. We are delivering the first and only fully disposable molecular flu A, flu B and COVID-19 multiplex test to market in Canada now and hope to do the same in the U.S., if and when approved. We look forward to leveraging our incredible technology to help drive a change in the future of healthcare and in so doing, to build value for our shareholders.\n\nThank you, and have a great evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLouisa Smith -- Investor Relations\n\nErik Engelson -- President and Chief Executive Officer\n\nDan George -- Chief Financial Officer\n\nGriffin Soriano -- William Blair -- Analyst\n\nJohn Kim -- Bank of America Merrill Lynch -- Analyst\n\nRahul Rakhit -- LifeSci Capital -- Analyst\n\nMore LHDX analysis\n\nAll earnings call transcripts"
}