{
  "companyName": "loanDepot, Inc.",
  "companyTicker": "LDI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/loandepot-inc-ldi-q3-2022-earnings-call-transcript/",
  "content": "loanDepot, Inc. (LDI 1.23%)\nQ3 2022 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon and welcome everyone to loanDepot's third quarter 2022 conference call. All lines have been placed on mute to prevent any background noise. [Operator instructions]. I would now like to turn the call over to Gerhard Erdelji, senior vice president, investor relations.\n\nSir, please go ahead.\n\nGerhard Erdelji -- Senior Vice President, Investor Relations\n\nGood afternoon, everyone, and thank you for joining our call. I'm Gerhard Erdelji, investor relations officer at loanDepot. Today, we will discuss loanDepot's third quarter 2022 results. Before we begin, I would like to remind everyone that this conference call may include forward-looking statements regarding the company's operating and financial performance in future periods.\n\nAll statements other than statements of historical fact are statements that could be deemed forward-looking statements, including but not limited to guidance to our pull through weighted rate lock volume, origination volume, pull through weighted gain-on-sale margin and expenses. These statements are based on the company's current expectations and available information. Actual results for future periods may differ materially from these forward-looking statements due to risks or other factors that are described in the Risk Factors sections of our filings with the SEC. A webcast and a transcript of this call will be posted on the company's investor relations website at investors.loandepot.com under the Events and Presentations tab.\n\nOn today's call we have loanDepot president and chief executive officer, Frank Martell and chief financial officer, Patrick Flanagan to provide an overview of our quarter, as well as our financial and operational results, outlook and to answer your questions. We are also joined by our chief capital markets officer, Jeff DerGurahian and LDI mortgage president, Jeff Walsh to help address any questions you might have after our prepared remarks. And with that, I'll turn things over to Frank to get us started. Frank.\n\nFrank Martell -- Chief Executive Officer\n\nThank you, Gerhard. On today's call I look forward to sharing my perspectives on the market conditions, our results and our outlook. The loanDepot team has made significant progress on many fronts over the past quarter as we executed against our previously announced Vision 2025 strategic program. As you may recall, Vision 2025 which we formerly launched in July has four pillars.\n\nPillar No. 1 focuses on transforming our originations business to drive purchase money transactions with an expanded emphasis on purpose driven lending. Pillar two calls for aggressively rightsizing our cost structure in line with current and anticipated market conditions and internally sets targets to achieve first quartile opting performance. Pillar three covers investing in profitable growth generating initiatives, which for this year focuses on launching our innovative digital HELOC solution.\n\nAnd finally, pillar four relates to optimizing our organizational structure. I will focus the balance of my prepared remarks today on significant progress we have made against each Vision 2025 pillar. Pat will provide additional context and related financial metrics during his remarks. In the third quarter we substantially narrowed our operating losses in line with our previously announced goals for Vision 2025.\n\nOur net loss of $137 million in the third quarter was down from $224 million in the second quarter as we aggressively lowered internal and third party expenses and exited the wholesale channel. For the quarter we reduced our sequential cost base by $126 million or 22%, which more than offset a $34 million or 11% decline in revenues. Despite this expected seasonal dip in housing activity as Pat will discuss a bit later, we expect to continue to narrow our opening loss in the fourth quarter as we realize the flow through benefits of actions already taken, as well as new actions planned during the fourth quarter. As we committed in our Vision 2025 plan, we're on pace to meet our expense reduction goal of an annual $400 million for the second half of 2022.\n\nWith market conditions likely to remain challenged for some time, we built our expense reduction plan to size the company appropriately for a mortgage market, which we believe will approximate $1.5 trillion in 2023. In addition to aggressive cost reduction, we've also been hard at work on profitable revenue generating opportunities which fit the strategic imperatives I outlined in Vision 2025. In May of this year we announced that we would launch a digital HELOC solution in the second half of 2022. I'm pleased to confirm that we have commenced our digital HELOC rollout in several important markets with a progressive launch across our footprint expected in the coming months.\n\nWe believe our HELOC solution will be a meaningful contributor to revenues in 2023. This unique digital solution provides our customers with an attractive option to access their home equity. With the value home equity at an all-time high, many homeowners would greatly benefit from an easy and fast, in some cases as fast as seven days, way to access cash while preserving their historically low interest rate on their first mortgage. Synergistically, our growing in-house servicing portfolio contains many borrowers with low interest rates today, providing us with a readymade opportunity to provide a HELOC solution to those customers.\n\nOur digital HELOC, backed by the strength of our national network of licensed loan officers, sophisticated lead generation capabilities and trusted consumer brand puts us in an outstanding position to help homeowners. The launch of our digital HELOC is an important step in advancing our goal of adding more products and services that will benefit our customers, diversify our revenues and generate profitable revenue growth. The HELOC launch also reinforces our commitment to continue being an innovative, technology driven organization at our roots. In addition to our HELOC launch, we are also making progress against our stated goal of building a purpose driven origination business.\n\nOne important demonstration is our recent partnership with National HomeCorp., a Georgia based homebuilder specializing in affordable single family homes. Together we launched NHC Mortgage which is loanDepots 10th joint venture partnership. We believe that this venture will advance our stated goal of increasing our purpose driven lending and providing credit to underserved communities. Our joint venture channel is a unique and differentiated business that generates high quality customers and we are going to continue to aggressively invest in this channel.\n\nIn addition to driving profitable growth and returning to run rate profitability, loanDepot is also making important and significant investments in our quality, delivery, compliance and risk management capabilities. In this regard, we recently completed the process of bringing virtually all of our loan servicing portfolios onto our in-house platform, which is expected to drive higher levels of customer satisfaction at a lower cost. In addition, we added Joe Grassi as our chief risk officer, and Gregory Smallwood as our chief legal officer to continue to help optimize our organizational structure and increase the effectiveness of our quality and compliance initiatives. Both executives have extensive industry and professional experience that are already making their marks as valuable additions to our senior management team.\n\nI want to conclude my prepared remarks today by thanking the loanDepot team and our other key stakeholders for their support. The past six months have been challenging no doubt, but they've also been a very important period of change and progress for the company. Against the backdrop of one of the most challenging housing markets in a generation, we have significantly reset our cost structure, which has resulted in a substantial narrowing of our operating losses. We have also aggressively shifted our revenue profile toward purchase transactions, developed an innovative digital HELOC solution and launched our 10th JV.\n\nWith $1.14 billion of cash-on-hand, approximately $400 million in run rate cost reductions identified so far and several new growth vectors in play, we believe we are increasingly positioned to navigate through the market downturn this year and next. With that, I'll now turn the call over to Pat Flanagan, who will take you through our financial results in more detail.\n\nPat Flanagan -- Chief Financial Officer\n\nThanks, Frank, and good afternoon, everyone. During the third quarter loan origination volume was $10 billion, a decrease of 38% from the second quarter of 2022. This was near the high end of the guidance that we issued last quarter of between $5.5 billion and $10.5 billion. Third quarter volume consisted of $7 billion in purchase loan originations and $3 billion in refinance loan originations, primarily cash out refinances.\n\nOur strategy to emphasize less interest rate sensitive mortgage products has resulted in an increase in the proportion of purchase transactions from 34% a year ago to 70% in the third quarter, as well as increasing the total cash out and purchase transactions from 71% to 98% during the same period. Our pull through weighted rate lock volume of $9 billion for the third quarter resulted in total revenue of $274 million, which represented an 11% decrease from the second quarter. Rate lock volume also came in within the guidance we issued last quarter of between $5.5 billion to $10.5 billion. The decrease in revenue is a result of lower volume driven by increasingly volatile interest rates.\n\nThe average 30 year mortgage rate increased 100 basis points during the third quarter from 5.7% to 6.7%. For context, we began 2022 with the average mortgage rate at 3.2%. Our pull through weighted gain-on-sale margin for the third quarter came in at 203 basis points, also within the guidance we provided. Turning now to our servicing portfolio, customer retention and revenue diversification remain key areas of focus.\n\nThe unpaid principal balance of our servicing portfolio decreased to $140 billion as of September 30, 2022 compared to $155 billion as of June 30, 2022. This decrease was primarily due to the sale of $19 billion in unpaid balances during the quarter. As of the end of the third quarter, we serviced substantially all of our portfolio in-house compared to 87% at the end of the second quarter, achieving our goal to bring all of our agency and Ginnie Mae servicing in house before the end of the year. By leveraging our in-house infrastructure for this highly scalable business, we can directly engage with our customers throughout the entire homeownership journey, better anticipate their needs for additional products and services and continue to lower our expenses.\n\nAs a result of the smaller portfolio, servicing fee income decreased from $117 million in the second quarter of 2022 to $114 million in the third quarter of 2022. We hedge our servicing portfolio, so we do not record the full impact of the increase in fair value in a rising rate environment in the results of our operations. We believe this strategy protects against volatility in our earnings and liquidity. Our strategy for hedging the servicing portfolio is dynamic and we adjust our hedge positions in reaction to changing interest rate environments.\n\nWe believe our servicing portfolio is well protected against potential rising defaults in the marketplace. As of the end of October, the average loan age was only 17 months; the average loan amount was 317,000; the weighted average FICO was 740, and the weighted average loan to value at origination was 71%. These characteristics should result in low delinquency and default rates and generate reliable revenue during these uncertain economic times. A major component of our Vision 2025 plan was to align our expense base with our expectations for a lower origination volume, and create efficiencies we believe will result in improved operating leverage and financial performance over time.\n\nAs Frank said, we believe that the mortgage market will total approximately $1.5 trillion and 2023 and we've been shrinking our expense base for this much smaller market. Our total expenses for the third quarter of 2022 decreased by $126 million or 22% from the prior quarter, driven primarily by lower personnel expenses, including both salaries and volume based commissions and lower marketing expenses. The Vision 2025 plan is demonstrating success as lower expenses more than offset lower revenues, significantly reducing our loss quarter over quarter. Our total expense reduction for the quarter included $69 million of non-volume related expense savings and $57 million of volume related expenses in the form of lower commissions and direct origination expenses.\n\nOne of the goals of the Vision 2025 plan was to reduce non-volume related expenses by an annualized $375 million to $400 million for the second half of 2022. We have realized $276 million analyzed or 75% during the quarter. Based on the actions that we already have taken or have identified, we expect to achieve at least $400 million of run rate expense reductions by the end of 2022. The third quarter included Vision 2025 related charges totaling $37 million, including $21 million of lease and asset impairment charges, $9 million of severance charges and $7 million of Vision 2025 related professional service fees.\n\nVision 2025 expenses incurred in the second quarter of 2022 total $55 million. We expect to incur at least $20 million of Vision 2025 related charges in the fourth quarter, including personnel related and additional asset impairment charges. We continue to aggressively reduce our cost structure to appropriately size the company for our expectations of the smaller mortgage market. We reduced our headcount from approximately 11,000 at year end 2021 to approximately 6,100 at the end of the third quarter, well below our stated goal of 6,500.\n\nWe plan to achieve our cost reduction goal by further reducing headcount, consolidating redundant operational functions and reducing marketing expenditures, real estate costs and other third party charges. We also continue to evaluate all aspects of our business for potential additional expense reductions as the market continues to evolve. Based on our projections, we believe that we'll continue to reduce expenses in the fourth quarter of 2022 continuing to narrow our loss. The plan is being executed against a backdrop of the strong balance sheet with $1.1 billion of tangible equity, ample liquidity with over $1.1 billion of unrestricted cash and what we believe are excellent relationships in the support of our financing partners, the agencies and other investors.\n\nLooking ahead to the fourth quarter, we expect origination volume of between $4 billion and $7 billion people. We expect pull through wages lost volume of between $3 billion and $6 billion reflecting current market conditions and the seasonality weighing in on demand. We expect fourth quarter pull through weighted gain-on-sale margin to increase to between 210 and 270 basis points reflecting the impact from exiting wholesale and the contribution from our higher margin products. With that, we're ready to turn back over to the operator for questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] Your first question comes from the line of Doug Harter with Credit Suisse. Your line is open.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nThanks. Can you talk about your outlook for cash and liquidity? You know you built it up the past couple of quarters. How are you thinking about MSR sales going forward? How are you thinking about debt pay downs? Just if you could update us on that that would be great.\n\nFrank Martell -- Chief Executive Officer\n\nSure, thanks Doug. As noted, we have a very strong liquidity position which we believe is helpful as we work through the resizing of the company and return to profitability, and we think that we remain – a lot of optionality to both invest and continue and invest in the pillars of vision 2025 and it also allows us the opportunity to really optimize the capital structure. At this point we're not anticipating selling any bulk MSRs in the fourth quarter. We think that the mix of servicing sales at the time of origination and retention are appropriate to maintain you know an exceptional amount of liquidity and allow us to take advantage of any opportunities that present us in the market going forward.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nAnd as you mentioned, you know sort of as you look to work on the capital structure, any thoughts about trying to repurchase some of the outstanding unsecured notes?\n\nFrank Martell -- Chief Executive Officer\n\nThat you know remains an option for us as I said. There's a lot of opportunity for us to manage the balance sheet. You know we are very focused on maintaining a substantial amount of liquidity as we work through the restructuring, but we'll take a look as we always do at the right, you know the right construct in the liability side of the management – of the balance sheet.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nOK. Thank you.\n\nOperator\n\n[Operator instructions] Your next question comes from the line of James Faucette with Morgan Stanley. Your line is open.\n\nBlake Netter -- Morgan Stanley -- Analyst\n\nHi, this is Blake Netter on the line for James. Thanks for taking my questions. So starting off with our new HELOC product, as you all know fixed income investors have been looking for some pretty decent spreads relative to a year ago. What I'm wondering is, how much demand is there for HELOC originations today and what kind of volumes do you think you can do? And if spreads tighten, would that increase your ability to originate more?\n\nJeff Walsh -- Chief Revenue Officer\n\nHi, this is Jeff Walsh. You know we see HELOC as a significant opportunity in 2023 based on a couple of factors, just as far as what we know from our already spent dollars on leads purchased through first mortgage origination and kind of sizing of the market in general. So yeah of course, narrowing would always help in terms of volume, but we do see it as a significant opportunity in 2023.\n\nBlake Netter -- Morgan Stanley -- Analyst\n\nGot it. Thanks. And then next, looking at your MSR portfolio, how should we think about the sensitivity of your servicing filter rising rates. It looks like you had a negative fair value mark during the quarter and I'm just wondering if you can talk about some of the drivers behind that?\n\nFrank Martell -- Chief Executive Officer\n\nJeff, can you get it?\n\nJeff DerGurahian -- Executive Vice President, Capital Markets\n\nYeah. This is Jeff DerGurahian. You know with the rise in rates and given the age of the portfolio and the coupon of the portfolio, there's not a lot of sensitivity right now in terms of price moves for given moves and rates, and so you know I think that's going to be a return game until we are able to add more originations at the current rate levels to the book.\n\nBlake Netter -- Morgan Stanley -- Analyst\n\nGot it. Thank you.\n\nFrank Martell -- Chief Executive Officer\n\nAnd I think there's a markup in the fair value in the fourth quarter, not a markdown.\n\nBlake Netter -- Morgan Stanley -- Analyst\n\nOK. Thanks for the clarity.\n\nFrank Martell -- Chief Executive Officer\n\nI'm sorry, in the third quarter – excuse me, in the third quarter.\n\nOperator\n\nYour final question comes from the line of Trevor Cranston with JMP Securities. Your line is open.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nHey, thanks. A follow-up question on the HELOC opportunity. You know I think about 30% of your volume in 3Q was refi and you said most of that was cash out. I guess where mortgage rates have moved up to today, you know do you expect sort of that cash out refi business to be sticky or should we sort of think about that as volume that likely moves over potentially toward the newer HELOC product? And I guess as a second part of that, could you give us any sort of sense of you know kind of roughly where you would expect margins to come in as you start bringing the HELOC product on? Thanks.\n\nFrank Martell -- Chief Executive Officer\n\nWe don't expect the first mortgage business to be materially impacted by HELOC. It is although a similar customer, a different customer from a credit standpoint and others. So there's still you know a significant opportunity for cash-out refinance. This is in the market, as well as HELOC.\n\nYou know we see that we have HELOC opportunity in the market that we're missing today. So we know that that's out there exclusive of our first mortgage business, so you know – well it might impact a small amount. We don't see it as significant in terms of margins pattern, OK.\n\nPat Flanagan -- Chief Financial Officer\n\nYes, on margins we're still looking at the market and we're early days in that. And as we expected gain on sale margins overall to increase in the fourth quarter, mostly due to focusing on higher margin products and annexing wholesales as we mentioned. That's a – that's the big determinant. We think that HELOC expands the conversion of our marketing dollar spent and they are generally smaller loan balances and the need for smaller amounts of cash out.\n\nSo we look at it as net – as a net gain, not cannibalizing the first morning side.\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nOK. Got it. Thank you.\n\nOperator\n\nYour next question comes from Kyle Joseph with Jefferies. Your line is open.\n\nKyle Joseph -- Jefferies -- Analyst\n\nHey. Thanks for having me on and I think you just kind of answered my question, but I was looking at your guidance and at the midpoint it looks like you're expecting margins to be you know even higher than they were on the retail side in the quarter. So is this just a mix shift and then a complete exit or correspondent that's driving that improved outlook there?\n\nFrank Martell -- Chief Executive Officer\n\nYeah, that's generally it, some mix shift and exiting a wholesale.\n\nKyle Joseph -- Jefferies -- Analyst\n\nAll right. That's it for me. Thanks for answering my question.\n\nOperator\n\nYour next question comes from Doug Harter with Credit Suisse. Your line is open. Doug Harter, your line is open. There are no further questions at this time.\n\nI will now turn the call back over to Mr. Frank Martell.\n\nFrank Martell -- Chief Executive Officer\n\nGreat. Thanks Brent. Just one quick comment on HELOC. I think you know we do expect it to be a significant contributor and a profit generator for us in 2023.\n\nWe're excited about the initial reaction we have in the market. I would just stress to say a digital solution, we think it's unique in terms of the engagement with the customer and we think the turnaround times are very fast and the access to capital is quicker than most of the competition in the market. So we are – we're excited about that product as a contributor to our financial results in 2023. I just want to close todays call by reiterating that our vision 2025 plan is having its intended effect.\n\nWe made tremendous progress both structurally and from an operational point of view. Our goal is to continue to narrow our operating losses through the reduction of expenses, but also importantly and increasingly investing in revenue generative and diversification strategies as we continue to skip the overall lending after the company toward purpose driven, where we can access the groups of homebuyers that will be the future of home buying. It's just a more diverse and a younger set of cohort that will be coming in and bidding the primary buyers in the future. So we think we are going to develop the products and services that fit their usage patterns as we go forward.\n\nWe will continue to drive the company forward and leverage our financial strength. We have plenty of cash to see us through the challenging time period over the next 12 to 18 months, and we think we're well positioned for the future, and so I want to just thank everybody on behalf of Pat and the rest of the team, and we look forward to continuing to keep everybody up-to-date on our progress, both in the short term and the longer term as we drive shareholder value.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGerhard Erdelji -- Senior Vice President, Investor Relations\n\nFrank Martell -- Chief Executive Officer\n\nPat Flanagan -- Chief Financial Officer\n\nDoug Harter -- Credit Suisse -- Analyst\n\nBlake Netter -- Morgan Stanley -- Analyst\n\nJeff Walsh -- Chief Revenue Officer\n\nJeff DerGurahian -- Executive Vice President, Capital Markets\n\nTrevor Cranston -- JMP Securities -- Analyst\n\nKyle Joseph -- Jefferies -- Analyst\n\nMore LDI analysis\n\nAll earnings call transcripts"
}