{
  "companyName": "Honeywell International",
  "companyTicker": "HON",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/honeywell-international-hon-q3-2022-earnings-call/",
  "content": "Honeywell International (HON -0.21%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:30 a.m. ET\n\nOperator\n\nThank you for standing by and welcome to the Honeywell third quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's call is being recorded. I would now like to hand the call over to Sean Meakim, vice president of investor relations. Please go ahead.\n\nSean Meakim -- Vice President, Investor Relations\n\nThank you, Liz. Good morning, and welcome to Honeywell's third quarter 2022 earnings conference call. On the call with me today are chairman and CEO, Darius Adamczyk; senior vice president and chief financial officer, Greg Lewis; and president and chief operating officer, Vimal Kapur. This call and webcast, including any non-GAAP reconciliations, are available on our website at www.honeywell.com/investor.\n\nHoneywell also use our website as a means of disclosing information, which may be of interest or material to our investors and for complying with disclosure obligations under Regulation FD. Accordingly, investors should monitor our Investor Relations website in addition to following our press releases, SEC filings, public conference calls, webcasts, and social media. Note that elements of this presentation contain forward-looking statements, which are based on our best view of the world and of our businesses as we see them today. Those elements can change based on many factors, including changing economic and business conditions, and we ask you to interpret them in that light.\n\nWe identify the principal risks and uncertainties that may affect our performance in our annual report on Form 10-K and other SEC filings. This morning, we will review our financial results for the third quarter of 2022, share our guidance for the fourth quarter and full year 2022, and provide some preliminary thoughts on 2023. As always, we'll leave time for your questions at the end. With that, I'll turn the call over to chairman and CEO, Darius Adamczyk.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nThank you, Sean, and good morning, everyone. Let's begin on Slide 2. Our outstanding discipline and rigorous execution enabled us to meet or exceed guidance for all third quarter metrics amid ongoing supply chain constraints and inflation headwinds. We exceeded the high end of our third quarter adjusted earnings per share guidance range by $0.05.\n\nWhile navigating a challenging backdrop, we delivered organic sales growth of 9% year over year or 10% excluding the impact of the wind down of operations in Russia led by strong double-digit growth in our advanced materials, commercial aerospace, and building products businesses, a testament to our ongoing resiliency and our rigorous operating principles. We expanded segment margin by 60 basis points year over year to 21.8%, exceeding the high end of our guidance range by 60 basis points, with margin expansion in all four segments as we remain ahead of the inflation curve through continued commercial excellence. Excluding the impact of our investment in Quantinuum, the margin expansion was 90 basis points year over year. Our backlog continues to be strong, up 9% year over year in the third quarter, led by aero, PMT, and HBT as our demand profile remains robust.\n\nOrders were down 1% on a reported basis, but up 2% organically year over year with aerospace and PMT orders up double digits signaling that these end markets continue to be resilient despite the risks of a broader economic recession. Excluding the impact of orders, which we have talked about extensively, orders in the remainder of the portfolio were up 8% reported or 11% organically year over year. Our record level 2022 orders in backlog will support our growth trajectory to the fluid operating environment. Cash was another bright spot with $1.9 billion of free cash flow in the quarter, more than double a year ago.\n\nA strong result that leaves us well-positioned to deliver our full year free cash flow commitment. In terms of capital, we deployed $1.2 billion to share repurchases, dividends, and capital expenditures. We leveraged the strength of our balance sheet to opportunistically purchase over 2 million shares throughout the quarter, reducing our average share count to 680 million shares and continue to execute on our commitment to buy back at least $4 billion in share in 2022. Looking forward, I remain encouraged by the strength we're seeing in many areas of our portfolio as we continue to execute our rigorous and proven value-creation framework underpinned by our accelerator operating system to drive outstanding shareholder value.\n\nI am proud of Honeywell's ability to overdeliver in another quarter amid a challenging macro backdrop. Now let's turn to Slide 3 to discuss recent senior leadership additions. In September, we announced that will succeed Vimal Kapur as president and chief executive officer of our performance materials and technology segment, enabling Vimal to transition to full -- to his new role as chief operating officer for Honeywell. Lucian joins Honeywell from Eastman Chemical Company, Global Strategy business operations and financial performance as executive vice president.\n\nLucian began his career at Eastman as a chemist and had a variety of leadership roles at the company. His diverse global experience building business both organically and inorganically and deep knowledge of the chemical process industry is valuable for leading PMT, which is in a unique position to enhance sustainable technologies portfolio to help drive the energy transition while also taking advantage of our strong position in traditional energy markets. We also announced a new addition to our board of directors in September. was elected to join the board as an independent director and will serve on our audit committee.\n\nRobin currently is an advisory consultant for, where he was CEO from 2016 to 2022. During his time as CEO, Robin led the transformation of Wood to an oilfield services company into an integrated engineering and consultancy company spanning a variety of growing end markets and geographies. He's extensive industry experience, including in sustainable technologies such as carbon capture and hydrogen. Robin's perspective will be instrumental as we further advance Honeywell's leadership in the energy transition and broader ESG transformation.\n\nWe're shocked and saddened to learn that our board member and friend, passed away on Sunday, October 23. He's provided invaluable contributions to our company over the last 14 years. His perspective, tenacity, and friendship will be greatly missed and of course, our heartfelt and deepest condolences are with this family. As part of his board service, George was chair of our audit committee.\n\nScott Davis, our lead director, will serve as the interim chair of the audit committee of the Honeywell board until his successor is named. Next, let me turn to Slide 4 to discuss our other exciting recent announcements. Earlier this month, we announced a new innovative ethanol to jet fuel processing technology that allows producers to convert ethanol-based feedstock to sustainable aviation fuel. The aviation industry is challenged by limited supplies of traditional feedstocks and ethanol offers producers a widely available, economically viable new feedstock.\n\nDepending on the type of ethanol feedstock used, Honeywell ETJ process can reduce greenhouse gas emissions by 80% on a total life cycle basis compared to petroleum-based fuel. In addition, we opened two separate capacity expansion for our Solstice business this quarter. We recently opened the first large-scale manufacturing site for Solstice Air, a near-zero global warming potential medical propellant for use in respiratory inhalers. Solstice's air technology is up to 99.9% less GWP than propellants currently used in inhaled respiratory medicine.\n\nAstraZeneca is currently working to incorporate our Solstice air technology into their full inhaler portfolio pending regulatory approval. Elsewhere in our Solstice portfolio, we opened a plant in India, has begun manufacturing our Solstice ZD solution, which uses in blowing agents for foam insulation and refrigeration liquid for chillers. Finally, last week, we published our first quarterly Environmental Sustainability Index, a global report showing sustainability decision-makers sentiment on progress, year ahead plan, and meeting 2030 goals. Two-thirds of the S&P 500 has set emissions reductions targets of some kind and the index sheds light on past progress and future expectations toward these goals.\n\nFor a long history of achievements of sustainability, Honeywell's unique position to provide this free public service. The initial survey found that approximately 97% of organizations plan to increase current-year budgets in at least one sustainability category, and Honeywell remains committed to helping our customers achieve their sustainability goals. Now let me turn it over to Vimal on Slide 5 to discuss our third quarter operating performance in more detail.\n\nVimal Kapur -- President and Chief Operating Officer\n\nThank you, Darius, and good morning, everyone. As Darius highlighted, we delivered strong third quarter results despite a tough operating environment. Disciplined adherence to our best-in-class Honeywell value creation framework provided us with operational agility to meet or exceed our guided financial metrics. Third quarter sales grew by 9% organically or 10%, excluding the wind down of our operations in Russia.\n\nThe performance was driven by double-digit organic growth in HBT, PMT, and aerospace. Demand trend remains strong with backlog near record levels. However, ongoing supply chain constraints continue to temper overall volume growth. We did see modest sequential improvement in volume causing our positive backlog to decrease in SPS, HBT, and PMT as we benefit from our reengineering effort to qualify alternative parts and our proactive partnering with distributors and alternative suppliers to ensure priority sourcing.\n\nOur readiness efforts in aero also enables single-digit sequential improvement in output. We continue to reap benefits of Honeywell digital transformation investments made over the past few years. We leverage these digital tools to drive commercial and operational actions, which enabled us to stay ahead of inflation curve and help us expand segment margin by 60 basis points year over year to 21.8%. We are also starting to see some benefits in inventory from our digital and process improvements in planning and sideline.\n\nNow let me share a few comments on third quarter performance by business. Aerospace sales for the third quarter were up 10% organically year over year as commercial aviation sales grew double digits for the sixth consecutive quarter despite ongoing supply chain challenges. In fact, if we had held past due backlog flat sequentially for the quarter, we would could delivered an additional 9% of organic sales growth. Commercial aftermarket demand remains robust with continued flight or recovery leading to increased payer shipment and repair and overhaul sales.\n\nBoth air transport aftermarket and business and general aviation aftermarket sales grew over 20% organically in the quarter. Commercial original equipment sales increased 30% year over year including approximately 50% growth in our air transport original equipment, driven by increased shipset deliveries to these customers. Defense volumes were down in the quarter, but we believe 2022 will be trough for this business as our elevated backlog position and an expected increase in defense spending support recovery in coming years. Aero segment margin expanded 40 basis points to 27.5% as our commercial excellence effort more than offset our cost inflation.\n\nBuilding technologies was our fastest-growing business in the third quarter with 19% organic sales growth. Sales of our fire products and building management system remains strong, resulting in 23% organic growth in building products portfolio, the third consecutive quarter of double-digit growth. In building solutions, the sales grew 13% as project volume increased despite ongoing part shortages. While supply chains have not fully unlocked and significant material constraints remain, we did see sequential improvement in volumes for the third consecutive quarter, a sign that supply chains are moving in the right direction.\n\nBacklog in our building projects and services business remains robust, roughly flat to the second quarter and 7% above third quarter 2022 levels. Orders were down 3% reported, but growing 3% on an organic basis, with continued strength in U.S. and China, somewhat diluted by softening in part of Europe and Asia. Our agile commercial actions were a net contributor to both top-line and bottom-line growth in the quarter and segment margin expanded 60 basis points to 24.1%.\n\nPerformance materials and technologies grew 14% organically in the quarter despite an approximately 3% headwind from Russia. Advanced materials grew 33% organically, leading PMT for the third consecutive quarter as we continue to see favorable demand, specifically in our Marine Products business. UOP sales increased 6% in the quarter, returning to growth and overcoming a 7% year-over-year headwind from lost machine sales. Growth in UOP were led by sales -- led by gas processing and refining catalyst demand and sustainable technology solutions offset sales growing triple digits year over year.\n\nProcess solutions grew 6% organically on continued demand for life cycle solutions and services and thermal solutions. Sparta Systems grew over 40% for second consecutive quarter and continues to be earnings accretive. Orders for PMT grew double digit in the third quarter, led by approximately 40% growth in orders in advanced materials and approximately 20% in UOP underpinned by strength in gas processing orders. Segment margin expanded 40 basis points in the quarter to 22.6%, driven by commercial excellence, offsetting cost inflation.\n\nAs expected, safety and productivity solutions sales decreased 4% organically in the quarter. We saw double-digit growth in advanced sensing and gas detection portion of our sensing and safety technologies business, and productivity solutions and services also grew organically in the quarter. However, this growth was offset by expected softness in warehouse automation and lower volumes in personal protective equipment. Intelligrated will be a key area of focus for me as we continue to improve our operations and drive margin expansion in that business.\n\nOur strategic pricing and productivity actions, along with favorable business mix, brought segment margins for SPS in its highest level since the fourth quarter of 2018, expanding 250 basis points year over year to 15.7%. Honeywell Connected Enterprises continues to underpin the growth we are seeing across our portfolio. Recurring revenue grew over 10% in the quarter and SaaS growth was approximately 40%. Part a system was once again stand out within CE, growing over 40% in the quarter with cyber and connected building also seeing double-digit organic growth.\n\nSo overall, this was a great operational result for Honeywell and our SPD performance was a key driver for our third quarter adjusted earnings-per-share growth. Adjusted EPS for the quarter grew 11% to $2.25, which exceeded the high end of our guidance range by $0.05. On cash dynamics, we generated $1.9 billion of free cash flow in the quarter, up 108% year over year. The increase was driven by a positive contribution from working capital due to strong collections and continued focus on matching our supply to our demand, which enabled us to reduce inventory for the first time in seven quarters, an encouraging example of the results that Honeywell is capable of delivering despite the supply chain challenges and expected lead times we have been battling in recent quarters.\n\nThe Honeywell playbook continues to deliver outstanding results and these operating principles, combined with our attractive end-market exposure and differentiated portfolio of solutions will allow us to maintain the resiliency for quarters to come. Let me turn it over to Greg to discuss third quarter earnings per share in more depth and provide an update on our 2022 outlook.\n\nGreg Lewis -- Senior Vice President and Chief Financial Officer\n\nThank you, Vimal. Let's turn to Slide 6, and we'll unpack our EPS story a little bit further. In the third quarter, we delivered GAAP earnings per share of $2.28 and adjusted EPS of $2.25, which was up $0.23 year over year despite a $0.05 foreign exchange headwind as the dollar continued to strengthen throughout the quarter. Increased segment profit, driven by our strong commercial execution provided an $0.18 uplift year over year.\n\nA lower effective tax rate, 22.1% this year versus 22.9% last year, provided a $0.03 benefit, including a $0.05 tailwind from a onetime discrete change in German tax law. Share count reduction, driven by progress toward our share repurchase commitment from our March Investor Day drove a $0.06 year-over-year tailwind to EPS. We saw a $0.04 headwind from below-the-line items, primarily due to lower pension income. EPS was $0.03 higher than adjusted EPS due to a positive adjustment related to our wind down of our business in Russia.\n\nSo overall, we delivered another strong quarter with results at or above our expectations, demonstrating our ability to operate seamlessly through challenging economic conditions. So now let's turn to Slide 7. We can talk about our fourth quarter and full year guidance. While a number of challenges persist in the current operating environment, we're entering the fourth quarter with a very strong demand profile.\n\nSince we provided our initial 2022 guidance in February, we have battled supply chain constraints, encountered unprecedented inflation, contended with geopolitical disruption and experienced rapidly rising interest rates. At each turn, our rigorous operating principles have enabled us to continue to deliver. As you saw from the 3Q bridge, the ongoing strengthening of the U.S. dollar has driven materially higher foreign currency impacts and has been a significant headwind to our guidance, which we have consistently offset at the EPS level.\n\nFor our 4Q sales guidance, we expect to be in the range of $9.1 billion to $9.4 billion, up 10% to 13% on an organic basis or up 11% to 14%, excluding the one-point impact of lost Russian sales. We now expect full year sales of $35.4 billion to $35.7 billion which represents a decrease of $100 million in the low end and $400 million on the high end from our prior guidance, incorporating greater foreign currency impact. However, we're raising the low end of our organic growth range now at 6% to 7%, increasing the midpoint versus our prior guidance and narrowing the overall range. Excluding a one-point impact of lower COVID-related mass demand and one-point impact of lost Russian sales, organic growth range would be 8% to 9%.\n\nThe difference between our reported and organic sales growth guidance is 3 points, driven entirely by foreign currency translation. To dimensionalize this further for the full year, on a year-over-year basis, we expect $1.1 billion of sales headwinds from foreign currency, which compared to our original guidance from February is approximately $750 million of incremental headwind, a substantial challenge, which, as I mentioned, we've overcome on EPS. Moving to our segment margin guidance. We expect the fourth quarter to be in the range of 22.8% to 23.2%, resulting in year-over-year margin expansion of 140 to 180 basis points due to timing of high-margin catalyst shipments in PMT, stable business mix and productivity in SPS and increased volume leverage in HBT.\n\nFor full year 2022, we are upgrading our segment margin expansion expectations by 30 basis points on the low end and 10 basis points in the high end to a new range of 21.6% to 21.8% or 60 to 80 basis points of year-over-year expansion. Our rigorous fixed cost management and disciplined price cost actions remain key elements of our operating playbook, helping us to drive margin expansion. Excluding the 30 basis point 4Q and full year headwinds from Quantinuum, we expect margins to expand 170 to 210 basis points in 4Q and 90 to 110 basis points for the full year. Now let's take a moment to walk through fourth quarter and full year expectations by segment.\n\nIn aero, we anticipate demand across our businesses to remain strong, leading to sequential sales growth in the fourth quarter. The growth trajectory will largely be determined by the -- of our supply chain recovery, which we anticipate will be modest. Both commercial aftermarket and commercial OE should see another quarter of double-digit sales growth year over year in 4Q as flight hours and build rates continue on their path to recovery. In defense, we view the third quarter as an inflection point, leading to sequential improvement in 4Q to close the year as demand remains strong and modest improvements in the supply chain will allow us to deliver greater volumes.\n\nOrders in defense and space are up approximately 5% year to date, including high single-digit growth in the third quarter. So we've built a very healthy backlog to support sales growth as we lap similarly supply impacted comparison period. Our full year expectations for aerospace are slightly improved on a stronger third quarter, and we now expect full year organic sales to be up mid-single to high single digits year over year, with modest declines in segment margins as a result of OE mix. In building technologies, we expect continued sequential improvement in volumes to lead to another quarter of double-digit organic sales growth year over year.\n\nOur backlog for building products remains well above normal pre-pandemic levels, supporting sales growth as the supply capacity improves. Modest improvement in supply chain enabled a sequential drop in pass-through backlog in the third quarter and we expect the same in 4Q. We anticipate strong growth in building projects for the fourth quarter as our projects business has grown sequentially each quarter this year, an encouraging indicator of post-pandemic recovery. For overall HBT, we still expect double-digit organic sales growth for the full year and increased volume leverage should allow for continued sequential segment margin improvement in the fourth quarter and healthy expansion for 2022 overall.\n\nIn P&C, the favorable outlook in our end markets supports a strong fourth quarter with sales up sequentially from third quarter and year over year. In process solutions, we expect growth to be supported by continued demand for thermal solutions and processes controls. In UOP, increased refining catalyst reload demand will support growth and provide margin benefit. However, the loss of Russia will continue to be a headwind in the fourth quarter.\n\nAdvanced materials will continue to outperform in the fourth quarter due to strong demand across the portfolio. Thanks to a strong third quarter, we now expect sales for overall PMC to be up double digits for the year, an upgrade from our outlook last quarter of up high single digits and we expect segment margin to expand both sequentially and year over year in the fourth quarter. Looking ahead for FPS, we expect to see continued growth in the advanced sensing and gas detection portion of our sensing and safety technologies business, where demand indicators remain favorable and our backlog is robust. Warehouse automation demand will remain soft in the fourth quarter as customers push new warehouse capacity and investments to the right.\n\nSo we continue to be encouraged by the bottom-line benefits of our improvements in operational efficiency and our focus on higher-margin aftermarket services, which we expect to continue growing double digits. We still expect demand for warehouse automation to trough in 2023 and our long-term outlook for the business remains positive. Our short-cycle productivity solutions and service businesses continue to deal with the impact of supply chain shortages and has seen some demand moderation, which may result in sequentially lower sales in 4Q, but we expect our differentiated technology to allow us to continue to outperform against our peers. While we remain confident in the medium-term growth rate in SPS, short-term headwinds persist, and we still expect SPS sales to decline mid-single digits in 2022.\n\nHowever, we expect to see strong margin expansion both sequentially and year over year in the fourth quarter as a result of shifting business mix and our continued operational improvements. Turning to our other core guided metrics for overall Honeywell -- net -- impact, which is the difference between segment profit and income before tax, is expected to be in the range of negative approximately $60 million to positive $40 million in the fourth quarter and negative $125 million to negative $50 million for the full year. This guidance includes a range of repositioning between $86 million and $136 million in 4Q at $375 million to $425 million for the year as we continue to fund attractive restructuring projects and properly position Honeywell for a good financial outcome in. We expect the adjusted effective tax rate to be approximately 19% in the fourth quarter at approximately 22% for the year, and the average share count to be approximately 676 million shares in 4Q and approximately 683 million shares for the full year, reflecting our commitment to repurchase at least $4 billion of Honeywell shares in 2022.\n\nAs a result of these inputs, our adjusted EPS guidance range is between $2.46 and $2.56 for the fourth quarter, up 18% to 22% year over year. For full year EPS, we are upgrading the low end of our guidance range by $0.15 to a new range of $8.70 to $8.80, up 8% to 9%, reflecting the confidence in our ability to more than offset foreign exchange headwinds of $0.19 year over year and $0.08 versus our initial guide from February as well as absorbing ongoing macroeconomic risk. We still expect to meet our original free cash flow guidance of $4.7 billion to $5.1 billion in 2022 or $4.9 billion to $5.3 billion, excluding the impact of Quantinuum. So in total, we are raising the midpoint of our full year 2022 organic sales growth, segment margin, and adjusted EPS guidance ranges while absorbing headwinds of $1.1 billion in sales and $0.15 in adjusted earnings per share versus our initial guidance from lost Russian sales and incremental FX, a strong indicator of our ability to successfully deliver results in a fluid operating environment.\n\nDetails on our full year 2022 guidance progression and FX impacts can be found in the appendix of this presentation. Before turning back to Darius, let's turn to the next page and discuss our preliminary thoughts for 2023. While the macro backdrop signals another year of volatility, we believe our historical execution through multiple downturns demonstrates our ability to move quickly and decisively to protect margins, drive growth, ensure liquidity, and position Honeywell to deliver in any environment. Our rigorous operating principles and favorable end market exposure will help us remain resilient with commercial aerospace recovery continuing, upcoming capital reinvestment in the energy sector, and increased sustainability and infrastructure spending.\n\nWe have a strong setup that will drive growth in sales, margin, and earnings in 2023. We expect organic growth in aero, PMT and HBT due to record level demand in backlog in 2022 in our long-cycle businesses. In fact, both of our largest businesses are seeing double-digit orders and backlog growth, which will headline growth and profitability in 2023. This will be offset by lower demand in warehouse automation volumes which we believe will trough next year.\n\nWe expect supply chain dynamics to improve gradually but remain constrained versus pre-pandemic levels. With these dynamics in mind, let's look at each of our businesses. In aero, we expect the demand picture to remain robust with increased flight hours, particularly a recovery in widebody and increased build rates among aircraft manufacturers, which will support growth in our commercial aviation business tempered only by the pace of supply chain healing. We also anticipate a return to growth in divestment space on increased defense budget and elevated backlog and an improving supply chain.\n\nIn HBT, stimulus-fueled investment in institutional markets as well as elevated backlog levels from this year's supply constraints should provide resiliency into 2023, regardless of the macro environment. Many of our offerings are aligned to key secular themes such as energy efficiency and decarbonization, and we expect the verticals we serve to remain strong on balance throughout next year. In P&C, we expect to continue to capitalize on the growth we have seen in 2022. Backlog built this year will drive growth in process solutions, LNG capacity expansion, and improved comps as Russia headwinds fall off will support growth in UOP and improvement in semiconductor supply among customers and continued demand for Solstice products will enable advanced materials to have another strong year.\n\nSustainable technology solutions should also provide growth as the Inflation Reduction Act supports new SaaS and carbon capture opportunities. For safety and productivity solutions, decreased investment in new warehouse capacity and potential recession impacts in our short-cycle businesses will provide headwinds in 2023. However, we have a strong portfolio with differentiated solutions that will allow us to compete regardless of the macro environment. Operational improvement actions that we've already begun implementing and shifting business mix will allow us to expand margins in '23, even if revenues decline year over year.\n\nSo overall Honeywell, 2023 margins will benefit from the continued volume recovery on a streamlined cost base, anticipated pricing tailwind, flight hour improvement in aero and mix shift in SPS toward higher-margin businesses. We'll continue our investments in R&D and growth-oriented capex as we remain keenly focused on creating uniquely innovative, differentiated, recession-proof technologies to address the world's toughest process technology, digital transformation, and sustainability challenges. We expect our spend on repositioning to begin to normalize lower. However, that EPS benefit will be more than offset by significantly lower noncash pension income in a rising interest rate environment, which likely results in a higher discount rate and lower asset base next year.\n\nThis accounting headwind is a noncash item as our overfunded pension status will ensure no incremental contributions are needed which is a great position to be in for our employees, both former and current, and our shareholders. We have significant balance sheet capacity for meaningful M&A and expect a favorable deal environment going into '23 which supports our commitment to accelerate capital deployment. Overall, the resiliency of our end markets and demonstrated ability to operate under dynamic circumstances gives us the confidence that we can deliver a strong financial performance in '23 including overall sales growth, margin expansion, adjusted EPS, and free cash flow growth despite the environment. We'll provide more specific inputs in our annual outlook call once we close the year.\n\nWith that, I'd like to turn the call back over to Darius to discuss our dedication to environmental excellence.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nThank you, Greg. Let's turn to Slide 9 and talk more about the aspirational approach we are taking to our ESG commitments. ESG is more than just an initiative for Honeywell. It is a common thread that ties our businesses together and help us shape the future of the company.\n\nAt a corporate level, we have set aggressive targets to reduce our impact and protect the environment. We've reduced our Scope 1 and Scope 2 emissions by over 90% since 2004. Committed to set a target for Scope 3 emissions, the science-based targets initiatives, we have pledged to be carbon neutral in our facilities and operations by 2035. Our world-class manufacturing sites go above and beyond our own strict requirements with 17 sites achieving ISO 50001, the global energy management standard for establishing, implementing, maintaining, and improving energy management.\n\nIn this segment, a broad portfolio of ESG solutions help our customers lower their environmental impacts as well. We're driving the next evolution of energy through sustainable aviation fuel, both through traditional renewable feedstocks, using our Ecofining process technology and now with ethanol feedstocks using our new ETJ process technology, reducing emissions at manufacturing sites and improving worker safety of gas cloud imaging technology that can quickly identify leaks. We're supporting the circular economy through our Honeywell aerospace trading business, which takes retired planes and recycles used parts, reducing landfill volumes and providing quality certified parts to customers. We're improving occupant well-being and energy efficiency in office buildings for our innovative indoor air quality offerings.\n\nYou can find out more information about Honeywell's environmental impact reduction and innovations in ESG technologies to our recently published 2022 ESG report, which is available on our Honeywell Investor Relations website. Now let's turn to Slide 10 for some closing thoughts before we move into Q&A. We're executing on our value creation framework with the rigor you can expect from Honeywell. We met or exceeded our third quarter guidance for all metrics despite ongoing external difficulties, and we raised the midpoint of our full year organic sales and adjusted earnings per share guidance as well as increased our segment margin range, fully absorbing a series of higher-than-previously anticipated negative impacts, including FX.\n\nI am encouraged by the strength we are seeing in many areas of our portfolio, and I remain steadfast regarding our ability to deliver differentiated results in 2023 and through this cycle. Thank you to my Honeywell colleagues for your unwavering drive to deliver in this challenging environment. With that, Sean, let's move to Q&A.\n\nSean Meakim -- Vice President, Investor Relations\n\nThank you, Darius. Darius, Vimal, and Greg are now available to answer your questions. [Operator instructions] Liz, please open the line for Q&A.\n\nOperator\n\nOur first question comes from the line of Steve Tusa at J.P. Morgan. Steve, your line is now open.\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nHey. Good morning.\n\nGreg Lewis -- Senior Vice President and Chief Financial Officer\n\nGood morning.\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nJust on aerospace. What is the outlook for margins in the second, maybe in the fourth quarter and then into next year? Pretty strong result despite OE picking up and defense hasn't really turned yet. So maybe just a little more color on aerospace margins as you head into next year from that perspective.\n\nGreg Lewis -- Senior Vice President and Chief Financial Officer\n\nYeah. I think our view on margins is pretty consistent. I think we'll -- fourth quarter will look similar. Could be up 10 or 20 basis points.\n\nCould be down 10 or 20 basis points, something like that in the quarter as we continue to unlock the supply chain. It's a bit early to be providing guidance for next year, but I would expect we're going to continue to be managing through the growth that we're seeing in OE. We have an investment portfolio. As you know, we talk a lot about the R&D investments we're making in the business.\n\nAero is not the biggest grower of our margin expansion, as we've talked about. And I think that's going to remain pretty consistent into next year, too.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nYeah. And maybe just to add a couple of things, Steve. I think it's always done a great job expanding margins in a very difficult environment. And frankly, they have the toughest pricing environment out of any of our businesses.\n\nSo they've done a great job. As we look forward to next year, there's a lot of puts and takes. I mean, the mix will get tougher, some credits that we have to issue. So the OE growth is not obviously a favorable mix scenario.\n\nNow to offset that, the miles travel in the aftermarket business, we don't expect as robust air miles next year as we do this year. However, it's offset by the fact that we do expect more wide-body miles next year. And as you know, the aftermarket opportunity of wide-bodies to narrowbodies are roughly 3:1. So all in all, we expect a solid year.\n\nThe backlog at all-time records continues to grow. I think aero is positioned for a great year in '23.\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nGreat. And then on SPS next year, you mentioned substantial margin expansion, but how do you kind of put that in the context of the long-term target? Thanks.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nYeah. I mean I think it's too early. We're certainly not changing our long-term target. If anything, next year will be helpful to get into our long-term target.\n\nI think we've signaled some of the softness in the warehouse automation and I do think '22 will be the bottom, and the business will grow from that going forward and show good margin expansion in '23. Exactly what it's going to be is difficult to -- at this point, but we're certainly not changing [Inaudible].\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nThanks.\n\nOperator\n\nThank you. Our next question comes from Jeffrey Sprague with Vertical Research. Jeff, your line is now open.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nHey. Thanks. Good morning, everyone.\n\nGreg Lewis -- Senior Vice President and Chief Financial Officer\n\nGood morning, Jeff.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nMaybe two questions for me. I'll just wrap into one. First, just on the comment about deal environment improving. Is that sort of a general comment, given just maybe bid-ask spreads kind of normalizing in this sort of tape? Or do you see it actually more active pipeline? And secondly, just on the whole pension dynamic.\n\nI get that it's noncash, but should we expect that maybe you dial back restructuring or something in 2023 to maybe offset some of that EPS headwind you're dealing with? Thank you.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nSo let me maybe kind of start with the first one and I'll turn over to Greg for the second one. On the first one, I mean, the short answer is a little bit of both as we do think sort of the valuation is becoming much more appealing which is driving an improved pipeline, which is driving more activity. Now I think reality does have to set in with sellers because obviously, everybody wants to value their business what it was 12 months ago, not what it is today. So sort of we're kind of fighting some tailwinds and headwinds.\n\nI don't think the environment is going to dramatically change in the next three to six months in terms of valuation. So that's why we think '23 could be still a very appealing environment. We're trying to and we are improving our pipeline. And I can tell you that we're out there, but we also have to acquire properties at the right value point, particularly given today's environment uncertain.\n\nI'll just tee up the second one. And I'll turn it over to Greg. I mean, yes, the pension headwinds will be substantially higher than they are this year. Whether or not we do more restructuring is a TBD item, frankly.\n\nBut I just want to emphasize something. We have an overfunded pension plan. We don't anticipate any cash contributions no matter what happens. And this is a bit of kind of a nothing item.\n\nSo that's sort of -- I just want to put in the right content.\n\nGreg Lewis -- Senior Vice President and Chief Financial Officer\n\nYeah. Yeah. No, that's right. And the pension headwind is large.\n\nI mean, it could be approaching $0.70. That, as you probably know, doesn't get finalized until the end of the year, and we'll snap the line on interest rates at that point and discount rates, and we'll know what the overall pension asset has done during the course of the year. But it's going to be meaningful, but it's, again, noncash, and as Darius mentioned, we think we'll probably come down a little bit in repo, but not nearly enough to offset the order of magnitude that noncash pension income will put out that.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nAnd one last comment here, Jeff. As you noticed in sort of our outline for Q4 and the year, we're going to be at the upper end of our repo number that we provided for guidance, which means we're really preparing the business for sort of a little bit rougher environment in some of our businesses, not all of them because of [Audio gap] well-positioned and HBT will do OK, and we've got some challenges that we talked about in SPS. So we're basically doing a lot of that kind of work ahead of time, and we're pulling in a lot of our restructuring activity to 2022. Q4 will be a robust quarter, and that's all meant to position the business for strong '23.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from Julian Mitchell with Barclays. Julian, your line is now open.\n\nJulian Mitchell -- Barclays -- Analyst\n\nHi. Good morning. Sorry, and maybe just a two-part question as well. First part, just on orders.\n\nI think you said they were up low single digit in Q3. So a decent slowdown from Q2. Any regional business to call out driving that? And then the second piece would just be your 2023 preliminary thoughts, margins are up 100 bps this year, ex-Quantinuum for the year as a whole. Doesn't look on Slide 23, like -- sorry, on Slide 8, like there's a big Quantinuum headwind in 2023.\n\nSo with easing supply chains and some top-line growth, do you think a similar sort of margin performance could be repeated next year?\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nYeah. I think I'll answer your second one first, which is we -- it's really to -- earlier to tell Julian, I think we're going to work through that. I think all I can tell you is we're going to expand margins. That, you can count on.\n\nHow much? Unfortunately, you're probably going to have to wait until the end of January or early February, whenever we issue our Q4 results and guidance for '23. On your former question, I just would like to point out a couple of things. If you exclude the impact of Intelligrated and was a very big bookings quarter last year, it's high single-digit growth for bookings. So just keep that in mind.\n\nSo I'm actually pretty happy with the outcome. That's a strong outcome and it's still up low single digits, inclusive of Intelligrated. So I think that's a good outcome. As I look at sort of regions and so on, as you would have expected, China was a little bit softer in Q3.\n\nThere were some spots in Europe on the bookings that were softer, particularly in HBT, not a big shock. Those were a couple of soft spots. On the flip side, North America was strong. Middle East was strong.\n\nThere was kind of a balanced mix, some puts and takes. So really nothing dramatically different than our expectations. Warehouse automation, we expect it to be down. It was.\n\nWe expect the North America to be strong. It was. We expected some soft spots in Europe. There were.\n\nSo all in all, generally pleased with not just the revenue outcome, but really the orders outcome as well.\n\nJulian Mitchell -- Barclays -- Analyst\n\nGreat. Thank you.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nThanks, Julian.\n\nOperator\n\nThank you. Our next question comes from Scott Davis from Melius Research. Scott, your line is open.\n\nScott Davis -- Melius Research -- Analyst\n\nThanks, operator. Good morning, guys. I just saw your Q. It said price was up 11%.\n\nIt's just literally twice the group average. Is there anything in your portfolio kind of thinking that would be skewing that a little bit on the higher side and maybe accounts for some of that? I'm trying to think like the project businesses, I would think are hard to get that type of a price. So maybe just a little bit of color on where you have the most price or the least price and maybe some of the puts and pulls there? Thanks.\n\nGreg Lewis -- Senior Vice President and Chief Financial Officer\n\nYeah. As Darius highlighted, I think the most difficult spot for us has been in aerospace for sure. And we actually -- we've done better than you probably would expect in the long-cycle businesses going and repricing the backlog because we have seen inflation there. So we have had some good success in our projects businesses going back and getting price.\n\nThe products businesses are definitely the bigger driver of all of that, as you would imagine. And so that's, I would say, PMT, HBT, SPS are all having very strong pricing power in the products businesses in particular.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nAnd I would just add, the algorithm going forward is probably going to be a bit different. I mean, as we look into '23, we're probably not going to enjoy this much of a change from price and we'll probably get Q3. Q4 still we expect to be relatively strong. But the algorithm kind of changes in '23.\n\nI mean, Q4 will probably gain some very, very modest volume leverage, that's what we're coming on and much more volume leverage next year, probably a little bit less from price. So kind of how we make the year and how we grow margin expansion for '23 is going to be different. That's -- the supply chain has been frustrating, but it is slowly improving. I mean, we dropped our pass-through backlog in HBT, SPS, PMT, granted in aero a bit of a tougher problem.\n\nBut even if you look at aero and if you look at our outlook in Q3, it was actually up slightly versus Q2. And normally, I'm kind of -- if you take a look at the averages over the last five years, Q3 output is about 4% to 5% lower in Q2. So there is some incremental benefit coming through in the supply chain. And we expect that to continue.\n\nSo our algorithm for value creation will be different next year.\n\nScott Davis -- Melius Research -- Analyst\n\nThat's great color. Good luck, guys. I appreciate. I'll pass it on to the next guy.\n\nThanks, guys.\n\nOperator\n\nOur next question comes from Andrew Obin of Bank of America. Andrew, your line is open.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nGood morning.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nJust my question on defense and space. Just relative to peers, just seems to be weaker. And just how should we -- what's the best correlation for this business? Is it a specific platform program, just how to model it versus the budget because I think it has been lagging the peers. And then part two for my question is, what's happening with R&D tax credit? I think there was talk that you could get some cash back.\n\nWhere did that end up? Thank you.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nYes. So let me kind of unpack both of those. Unfortunately, there's no simple rubric that I can give you for defense and space because we have --\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nWe tried, yeah.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nBecause we have such a broad scenario. And I think if you look at programs like hypersonics, T55, those are some of the helicopter engine programs. Those are obviously all good for us. You've got to remember, there's -- this obviously wasn't our best quarter in terms of defense and space.\n\nBut we do think this is the bottom. Our backlog went up and it went up substantially. Our orders were up high single digits in defense and space. And we actually think that this is the trough, and we expect growth in defense and space for '23, if you want some early color on that.\n\nSo we've kind of seen -- we've seen a bit of a turn in the corner in terms of defense and space. Our back -- long-cycle backlog was up double digits this quarter. So we're kind of optimistic in terms of what's going to happen in defense and space going forward. I've obviously been a disappointment this year, year to date, but we really believe this is the bottom.\n\nOn the R&D tax credits, until we see them, we're not going to call it. As you know, we've been probably the only or at least one of the very few companies that took that out of our cash outlook at the initial consensus back in January. I mean that hurt us to the tune of $400 million. We've stuck with that, and we've proven to be right so far.\n\nNow what's going to happen in the lane duck session in November and December, I think that's, frankly, anybody's guess. And anybody that thinks that now it's going to get through, I don't know. I think -- I personally think it's a coin flip. It could go either way.\n\nWe certainly hope it does. But if it does, our cash outlook for '22 is going to look a lot better. So that's kind of where we are.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nThanks so much.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Nigel Coe with Wolfe Research. Nigel, your line is now open.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nThanks. Good morning, everyone. Thanks for the question. Hi.\n\nJust so I'll keep it to one question. But maybe just clarify, the pricing very, very strong. Advanced materials being a disproportionate driver of that? Just curious on that. But on SPS next year, I think we all understand the word dynamics.\n\nYou called out project solutions is a bit weaker into fourth quarter. How do we think about weak warehouse, probably weak spending environment in '23 versus supply chain sort of pent-up demand as we go into '23 for the PS portion of the portfolio?\n\nVimal Kapur -- President and Chief Operating Officer\n\nSo let me start with the pricing in advanced materials. Absolutely, we got strong pricing because we have a differentiated product line. And that proves our focus on new products and differentiated position. But across the board in PMT, our pricing has been strong also in other segments, too.\n\nSo the PMT pricing growth is not only advanced materials story. It spreads across process solutions and UOP segment also. SPS question, Darius, I'll let you --\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nYeah. So for SPS, I mean, I think on the PS' portion, it's been softer. That's -- we're lapping some very, very difficult comps. We have been sort of record volumes and orders in Q3 last year, nothing unexpected.\n\nIt's probably a little bit better than the market. And it sort of dialed into our algorithm going forward. What I will tell you is that our backlog is still relatively strong. I mean, granted we've liberated some of that, but our backlog is still at an elevated position.\n\nThe other thing I would tell, which was also a good sign is that sort of the channel inventory days of supply in North America actually dropped in Q3, which is always a good sign. So all in all, it wasn't the most robust quarter there, but not different than our expectations.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nThat's great. Thank you.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Joe Ritchie with Goldman Sachs. Joe, your line is open.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nHey. Good morning, guys.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nHey, Joe. Good morning.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nDarius, you guys have talked about $20 billion, $24 billion to $27 billion of potential capital deployment opportunities. I'd be curious to hear, as you're kind of thinking through the M&A environment, size of deals that you're looking at or could be looking at for the portfolio? And then secondly, you did talk about Quantinuum as a potential like strategy to offload that piece of your business sometime over an 18-month period. I'm just curious whether the environment has kind of changed things at all just given the volatility that we've seen with stock action?\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nYeah. Let me maybe start with the second question because that one -- yeah, I mean the short answer is that the market is not particularly receptive to plays like Quantinuum right now. So when we will do something there really depends on the condition of the stock market. But I mean, look, the stock market is not having a great year.\n\nWe all know that. But it's -- that's not going to stay that way forever. So I don't know that I would necessarily back off some kind of an 18-month time frame where we might do something with -- different with Quantinuum. So -- because I do think the market is going to get better.\n\nI mean we're in a tough environment, if we believe the market is 6 months ahead of the economy. We do expect the market to get better going forward and the plan for Quantinuum hasn't changed. So I guess short story. And I think we've been an 18-month time frame from now.\n\nI still think that that's very much doable in terms of doing something different with that business. So I hope that fully that answers that question. What was your other question?\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nYeah. Just the other question just on the size of deals that you're working on at this point?\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nYeah. I would just say that probably the sweet spot for us continues to be sort of in that $1 billion to $5 billion purchase price. We're not wedded to it. I mean, one of the things that -- and I mentioned this on the prior earnings call is that I probably would stay away from sort of the tiny deals unless something is very, very, very strategic because it takes up a lot of energy, and I'm not sure it moves the needle.\n\nSo I think we're going to be probably inching up in terms of the size of the deal. I never say that mega deals are impossible, but they're probably not likely.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nMakes sense. Thank you.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Nicole DeBlase with Deutsche Bank. Nicole, your line is open.\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nYeah. Thanks. Good morning, guys.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nGood morning.\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nJust one follow-up on pricing, and then I'll ask my other question. Just kind of going back to Scott's point on how strong your pricing has been. I guess, it's been an unprecedented environment, obviously. And is there a risk that pricing in some categories would have to decline if deflation continues or moderation in commodity prices continues? And then secondly, what's the path back to free cash conversion of 100% plus? I suspect that this will probably take some time because it's taken some time for inventory to build.\n\nThank you.\n\nGreg Lewis -- Senior Vice President and Chief Financial Officer\n\nYeah. So in terms of the risk that pricing declines, I mean across a massive portfolio like we have, I'm sure there'll be spots where that may be true and what we keep looking at is our elasticity demand to make sure that we're not destroying demand. So -- but broadly speaking, we do expect positive pricing next year. As I said, inflation is not going down, it's moderating.\n\nIt's still at an elevated level. It's just kind of leveled off to some degree. So that's what I would say, not a risk that pricing declines broadly speaking, but I'm sure there'll be pockets where that may be true. In terms of free cash flow back to 100%, we've talked about that ratio, frankly, is not a very helpful one.\n\nWe think more about it as a free cash flow margin, and we talked about our mid-teen kind of a range, and we're confident that we're going to be able to deliver around that. So the 100% free cash flow, I mean, it's probably going to be some time before we get there, but that's not really our objective. We're really looking at a healthy mid-teens free cash flow margin as the right barometer for us as a company.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nYeah. I think you see it in our outlook for next year. We expect to grow free cash flow next year, roughly -- sort of roughly in line with EPS, excluding the impact of pension, which is going to be a major headwind. So -- and I think if you look at our performance this year, we are still retaining our original free cash flow despite substantial headwinds.\n\nBut I think that this is a really important point that I would like to just emphasize because I think we're one of the few, if not the only company out there that hasn't actually taken the free cash flow number down for the year. And we faced some substantial headwinds this year. I mean if you think about just since our consensus since our outlook call in January, we got about $0.15 in EPS between Russia and impact of FX on EPS. And about -- on a year-over-year basis, about one point -- $1 billion of revenue headwinds.\n\nSo -- and on a year-over-year basis, EPS impact between Russia and FX is closer to $0.30. So I think what we really need to be talking about is how much we're actually raising our outlook for the year that we're maintaining. And I don't know that that's widely understood. And I think it is differentiated.\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nGot it. Thanks, guys.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Sheila Kahyaoglu with Jefferies. Sheila, your line is open.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nHi. Good morning, guys. Thank you for the time. Darius, I wanted to ask you about PMT and Vimal as well.\n\nWe've seen some major reactions in oil prices with news around price caps in Russian oil and OPEC production cuts. Can you maybe talk about what the volatility in oil prices is doing to near-term order activity in PMT and as you think about the longer-term potential for the business across LNG, battery technology and the sustainability portfolio?\n\nVimal Kapur -- President and Chief Operating Officer\n\nYeah. So our business, as we mentioned during Investor Day and other events that we are much less linked to upstream. We are much more linked to downstream segment in PMT. So the volatility in oil price does determine customer decision on how they want to spend capital based on the returns they will get.\n\nWhat we have seen there is that investments are slowly getting better. We clearly see investments getting better in the sustainability side of the portfolio. We continue to roll more and more offerings in that segment. So that's how I will see linkage on the oil price.\n\nSpeaking more broadly of the PMT portfolio, look ahead, we remain confident of a good growth year for PMT in 2023. That is supported by the capital growth to a certain degree, sustainability investment, but also we're going to carry stronger backlog for process solutions. And as it's a long-cycle business, that will convert in 2023. So overall, we remain quite optimistic on the PMT performance for the next year.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Josh Pokrzywinski with Morgan Stanley. Josh, your line is open.\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nHi, guys. Thanks for putting me in here. Just a question on backlog. And Darius, you touched on it a few times in terms of this working down of past due.\n\nBut if I look on Slide 8, it does look like there was a tiny sequential downtick. I'm just wondering that as supply chains free up here, are you seeing any sort of air pocket where folks are realigning lead times to what they need versus needing to go out much further? And any comment on kind of maybe core backlog versus some of this past due stuff would be helpful.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nYeah. I mean you're right. I mean there was a tiny tick downwards in our path to backlog. It went down in PMT, HBT, and SPS but went up, it was offset in aero.\n\nAnd we are seeing some improvement in the supply chain in those three segments. But unfortunately, we -- when you combine robust order rates in aero, there's some substantial issues in aero supply chain. Aero went up and went up substantially. So I think lead times are still long.\n\nThey're getting better, especially in SPS and HBT. And frankly, the big unlock for aero as we look to '23 is actually labor. And that labor for Honeywell because we actually have labor, but from some of the Tier 3, Tier 4 suppliers. And if there is a recessionary environment in '23, that actually maybe not helpful for the aerospace industry in terms of labor.\n\nSo that's -- hopefully, that helps.\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nGot it. Thanks.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nThank you.\n\nSean Meakim -- Vice President, Investor Relations\n\nLiz, we have time for one more question.\n\nOperator\n\nOur last question will come from Deane Dray with RBC Capital Markets. Your line is now open.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nThank you. Good morning, everyone. Thanks for fitting in. And just for Vimal, want to first congratulate you on the new role.\n\nAnd it sounds like your initial focus is going to be on Intelligrated. Just could you share with us what your approach is and other areas of the firm that you'll be focusing on?\n\nVimal Kapur -- President and Chief Operating Officer\n\nYeah. So I think specifically in Intelligrated, as we mentioned that we are seeing a reduction in volumes there. So we are really focused on how to make the business processes more robust in this cycle. So we're taking a lot of actions on our process maturity digitization in the business so that we come out stronger in our margin rate expansion in 2023 in the times to come.\n\nOn your broader question, yes, I'm looking at opportunities across Honeywell, how we can drive our long-term commitments on organic growth and margin expansion and working with all my SPG colleagues and Honeywell Connector Enterprises, and we are committed to make run our operations better so that we can deliver our long-term commitments on earnings.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nGreat. Thank you. Best of luck.\n\nVimal Kapur -- President and Chief Operating Officer\n\nYeah. Thank you.\n\nOperator\n\nThank you. I would like to [Technical difficulty] Darius Adamczyk for closing remarks.\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nThank you. I want to thank our shareholders for your ongoing support. We delivered a strong third quarter results and continue to navigate effectively through multiple uncertainties of the typical level of operational rigor and agility you've come to expect from Honeywell, enabling us to drive superior shareholder returns. Thank you all for listening and please stay safe and healthy.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSean Meakim -- Vice President, Investor Relations\n\nDarius Adamczyk -- Chairman and Chief Executive Officer\n\nVimal Kapur -- President and Chief Operating Officer\n\nGreg Lewis -- Senior Vice President and Chief Financial Officer\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nJulian Mitchell -- Barclays -- Analyst\n\nScott Davis -- Melius Research -- Analyst\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nNigel Coe -- Wolfe Research -- Analyst\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nMore HON analysis\n\nAll earnings call transcripts"
}