{
  "companyName": "CEVA",
  "companyTicker": "CEVA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/ceva-ceva-q2-2022-earnings-call-transcript/",
  "content": "CEVA (CEVA -0.08%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the CEVA, Inc. second quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the conference over to Richard Kingston. Please go ahead.\n\nRichard Kingston -- Vice President, Market Intelligence, Investor and Public Relations\n\nThank you, Rocco. Good morning, everyone, and welcome to CEVA's second quarter 2022 earnings conference call. I'm joined today by Gideon Wertheizer, chief executive officer; and Yaniv Arieli, chief financial officer of CEVA. Gideon will cover the business aspects and highlights on the second quarter and provide general qualitative data.\n\nYaniv will then cover the financial results for the second quarter and also provide guidance for the third quarter and full year 2022. I'll start with the forward-looking statements. Please note that today's discussions contain forward-looking statements that involve risks and uncertainties, as well as assumptions that, if they materialize or prove incorrect, could cause the results of CEVA to differ materially from those expressed or implied by such forward-looking statements and assumptions. Forward-looking statements include statements regarding market trends and dynamics, including anticipated growth in the wireless component of the global semiconductor market are and our customer's gain in market share and the future of 5G and Wi-Fi; our market position and strategy, including the strength of our technology offerings and efforts with respect to our co-creation business proposition; impacts of global economic uncertainty and COVID on our business, including royalties; demands for and benefits of our technologies; and expectations and financial guidance regarding future performance, including for the full year and third quarter of 2022.\n\nFor information on the factors that could cause a difference in our results, please refer to our filings with the Securities and Exchange Commission. These include the scope and the duration of the pandemic, including continued restrictions in China, the extent and the length of the restrictions associated with the pandemic, and the impact on customers, consumer demand and the global economy generally; the ability of CEVA's IP for smarter connected devices to continue to be strong growth drivers for us; our success in entering new markets and maintaining our market position in existing markets; the ability of new products incorporating our technologies to achieve market acceptance; the speed and extent of the expansion of the 5G and IoT markets; our ability to execute more base station and IoT license agreements; the effect of enhanced industry competition and consolidation; global chip market trends, including supply chain issues as a result of COVID-19 and other factors; and our ability to successfully integrate Intrinsix into our business. CEVA assumes no obligation to update any forward-looking statements or information, which speak as of their respective dates. With that said, I'll now hand the call over to Gideon.\n\nGideon Wertheizer -- Chief Executive Officer\n\nThank you, Richard. Good morning, everyone, and thank you for joining us today. We will produce solid second quarter financial result despite the challenging macroeconomic backdrop and disruption in production schedule prior to the lockdown in major cities in China. Our strength in the wireless space, that according to a recent study by McKinsey would be responsible for 25% of the growth in the global semiconductor market over the next five years, continues to drive our business and enable us to expand our footprint in the growing market of 5G, wearable, hearables, automotive, aerospace and defense, and more.\n\nRevenue for the second quarter came at $33.2 million, up 9% on a year-over-year basis. The licensing environment continues to be strong, delivering $22.1 million in quarterly revenue at the back of '22 licensing agreement with customers targeting a multitude of wirelessly connected devices, AI-driven sensor, satellite communication, and more. We also signed a strategic agreement for our Bluebud wireless audio technology in the wearable space, which I will touch on later. Asia continues to be a major driver of our business, but our activities and scope of engagement with U.S.-based customers is picking up.\n\nRoyalty revenue came in $11.1 million, down 26% on a year-over-year basis. Second quarter 2021 royalty revenue included revenue of approximately $3.3 million following a resolution of the disagreements on royalty rates with a customer. Carving out the $3.3 million amount, royalty revenue for the second quarter of 2022 was down only 4% versus the second quarter of 2021. In handset, global economic uncertainty and the impact of COVID measures in China are causing consumers to adopt cautious approach with their disposable income, which adversely impact handset shipments, particularly in the low and the mid tiers.\n\nOur base station and IoT royalty category showed resilience as 5G RAN rollout continues in China and into countries with low 5G penetration rate today. Our cellular IoT and Bluetooth customers continues to gain market share with both categories delivering year-over-year unit growth. Let me spend the next few minutes to highlight recent dynamics in the wireless space and how we are addressing them. Unarguably, wireless continues to be a cornerstone in the proliferation of intelligent IoT product that brings together wireless connectivity, sensor, and AI into highly efficient SoC.\n\nAt the back of this trend, CEVA has become the wireless anchor to more than 300 semiconductor companies as they shape the intelligent IoT ecosystem by being at the forefront of wireless standards and offering it under IP business model, CEVA lowered the entry point for embedding wireless connectivity in SoC and enabling many semis to come out with more cost-effective and power-efficient chips than the repurposed smartphone connectivity chips that Qualcomm, Broadcom, and MediaTek are selling into these markets. In that sense, by leaving wireless IP alone with the critical wireless technology plays in IoT SoC, opens up opportunity for us to elevate our business engagement from a delivery of just the IP [Inaudible] position where we co-create with the customer its own wireless system. We are already experiencing very good interest with this business proposition and see this as a vehicle to grow our revenue base. In the quarter, we concluded the comprehensive agreement along the co-creation business model with a U.S.-based customer.\n\nThis agreement was driven by top tier OEM who will deploy our Bluebud-integrated wireless and audio IP platform across multiple SKUs for smartwatches, hearables, and other wearable devices. The wearables market is the second largest market after mobiles in terms of volume. And recent devices offer high-quality 3D audio, AI-based noise cancellation, voice recognition, and IM-based contextual elements. These are technologies that CEVA offers to customers in addition to our processors and hardware IP technologies.\n\nAnother discussion that we are having with wireless customers this day is about the coexistence of 5G and WiFi and whether one will eclipse the other. Our view is that they will continue to coexist and in many use cases. They are, in fact, complementary to each other. 5G offer robustness in the form of security and low latency with its ultra-reliable low latency standard.\n\nWiFi networks, on the other hand, is simpler as the IT department are more familiar with it than with 5G. At the Mobile World Congress MWC event earlier this year, an event that is historically dedicated to cellular, there were a number of major WiFi 7 announcement indicating that the cellular industry understand that 5G and WiFi coexistence will continue to play an important role. Cisco, a long-term and dominant Wi-Fi player commented at MWC that 5G and WiFi must coexist in private network. These market dynamics and our strengths, both in 5G and WiFi IP provide us with significant potential to expand our relationship with new customers by offering them a one-stop shop for both technologies.\n\nIn summary, we are satisfied with our financial performance in the second quarter at the back of a challenging and uncertain macroenvironment. Our IP portfolio is trying to address the most exciting and crucial technology trends. Our ability to step up and partner with customers for their wirelessly connected SoC design through our co-creation business model is compelling. We will continue to focus on driving our strategic vision of enabling semis to make the products smart and wirelessly connected.\n\nWith that said, let me hand over the call to Yaniv for the financials.\n\nYaniv Arieli -- Chief Financial Officer\n\nThank you, Gideon. I'll start by further reviewing the results of our operations for the second quarter of 2022. Revenue for the second quarter was $33.2 million, up 9% compared to $30.5 million for the same quarter last year. The revenue breakdown is as follows.\n\nLicensing NRE-related revenue was $22.1 million, reflecting 67% of our total revenue, up 42% as compared to $15.5 million in the second quarter of 2021. Royalty revenue was 11.1 million, reflecting 33% of our total revenues, down 26% from 14.9 million in the second quarter of 2021. Second quarter 2021 royalties included revenue of approximately $3.3 million following the resolution of a disagreement on royalty rates with the customer. After carving out the $3.3 million, royalty revenue for the second quarter of 2022 was down only 4% versus the second quarter of 2021.\n\nBase station and IoT royalty revenue contributed $7 million in the quarter, flattish from the first quarter and up 6% year over year despite the impact of the lockdown in major cities in China on some of our Chinese customers and the overall challenging macroeconomic environment. Gross margin was 79% on GAAP basis and 82% on a non-GAAP basis. slightly better on GAAP and in line with our non-GAAP expectations. Non-GAAP quarterly gross margin excluded approximately $0.3 million of equity-based compensation expenses and $0.5 million of amortization of assets associated with the Intrinsix acquisition and innovation investment.\n\nOur total operating expenses for the second quarter were $26.6 million, below the low end of our guidance of $27.1 million and the first quarter expenses of $27.5 million, mainly due to improved FX environment and the timing of the Israel Innovation Authority grant received in the second quarter. Opex also included an aggregated equity-based compensation expenses of approximately $3 million, amortization of acquired intangibles of $0.8 million and $0.3 million associated with the cost of the Intrinsix acquisition. Our total operating expenses for the second quarter, excluding equity-based compensation, amortization of intangibles, were 22.6 million, also below the low end of our guidance of 23 million and the first quarter expenses of 23.4 million due to the same reason I just stated. On the tax front, we continue to implement the tax regulations in France, named the IP Box tax relief, enabling our corporate tax rate to be lower than the statutory 25% on specific types of revenue.\n\nWe also recorded a benefit related to a true-up of the French 2021 tax return, which was partially offset by higher withholding tax expenses associated with future utilization in our Israeli subsidiary. GAAP and other income included $0.5 million net loss from the remeasurement of a marketable security associated with Cipia following Eyesight Technologies, a leading provider in in-cabin sensing solution in the automotive industry that went public on the Tel Aviv Stock Exchange in the fourth quarter of 2021. As we explained in the past, we continue to adjust our investment quarterly up or down based on the market valuation of those shares. GAAP net loss for the quarter was $1.1 million and diluted loss per share was $0.05 compared to a net income of $3 million and $0.01 for the second quarter of 2021.\n\nOur non-GAAP operating income was $4.6 million, down from $6.3 million for the second quarter of 2021. And our non-GAAP net income and diluted EPS for the second quarter of 2022 was $4.3 million and $0.18, respectively. Other related data. SiP units by CEVA's licensees during the second quarter of 2022 were 433 million units, down 18% sequentially and down 4% for the second quarter of 2021 reported shipments.\n\nOf the 433 million units shipped, 83 million units or 19% were for handset baseband chips, reflecting a sequential decrease of 17% from 100 million units of handset baseband chips shipped during the first quarter of 2022 and a 40% decrease from 138 million units shipped year over year. Our base station and IoT product shipments were $349 million in the quarter, down 19% sequentially and up 11% year-over-year. Of note, Bluetooth shipments were up 35% year-over-year to 255 million units and cellular IoT shipments were up 12% year over year to 20 million units. As for the balance sheet.\n\nAt the end of June 2022, our short-term and long-term cash and market and securities balances were approximately $146 million. With last quarter's share price level, we activated our buyback program and repurchased approximately 136,000 shares during the quarter for approximately $4.5 million. As of today, 362,000 shares are available for repurchase. Our DSO for the second quarter was slightly higher than the last two quarters due to the lockdown in China that caused slower collections and came in at 42 days for the quarter compared to 32 days in the prior one.\n\nDuring the second quarter, we used $8.1 million of cash from operations. Depreciation and amortization were $2 million and the purchase of fixed assets were $1.2 million. At the end of the second quarter, our headcount was 492 employees, of which 411 are engineers, slightly higher than the total of 487 employees at the end of March. As for the guidance.\n\nAs evidenced for the first half of the year, our licensing, NRE, and related revenues were strong. Also, as Gideon explained, our technology offering and co-creation business proposition resonates well with our customers and present new opportunities to grow our revenues. On royalties, despite the challenges in the macro environment, we continue to expand in the base station and IoT segment through the gradual rollout of 5G base stations, enabled by our technology and see continued share gains in wearable, hearable, and IoT products at large. With that said, we are monitoring the implications of the economic uncertainty that we experienced in the second quarter associated with the handset royalties, as we get closer to the holiday season and as the COVID restrictions in China are being lifted.\n\nSpecifically for the third quarter, gross margin is expected to be slightly better than the second quarter, approximately 81% on a GAAP basis and 83% to 84% on a non-GAAP basis. Excluding an aggregated $0.3 million of equity-based compensation expenses and $0.5 million of amortization of other assets associated with the Intrinsix acquisition, Merriman IoT, and Inovision business and assets. Opex for the third quarter of 2022 is forecast to be slightly higher than the first quarter of this year. GAAP-based opex is expected to be in the range of $27.6 million to $28.6 million.\n\nOf the anticipated opex for the third quarter, $3.4 million is expected to be attributed to equity-based compensation expenses, $0.8 million to the amortization of acquired intangible assets and $0.3 million associated with the Intrinsix acquisition. Our non-GAAP opex is expected to be in the range of $23.1 million to $24.1 million. Net interest income is expected to be approximately $0.4 million and the taxes for the third quarter are expected to be similar to the first quarter, approximately 25% to 27% of non-GAAP tax rate or about $1.7 million. Taxes generated from the new 10% lower tax rate on specific revenues from our China and French activities would be offset by tax expenses associated with withholding and the future utilization in our Israeli subsidiary.\n\nShare count for the third quarter is expected to be approximately 24.2 million shares for non-GAAP EPS calculations. Rocco, you can now open the Q&A session. Thank you.\n\nOperator\n\n[Operator instructions] Today's first question comes from Matt Ramsay at Cowen.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nGood morning, good afternoon, everybody. Thanks very much. Yaniv, I couldn't help but notice there in your guidance commentary for the third quarter and the back half of the year that you guys didn't really talk about revenue. So, I'd be remiss if I didn't ask the question.\n\nSo, if you could give us a little bit of help there on just the trends you're seeing in the different end markets and how you guys think about revenue trending. Obviously, there's caveats around the macro, but I think that's going to be the question that most folks want to ask here. So, let's just see what we have to say on revenue. Thank you.\n\nYaniv Arieli -- Chief Financial Officer\n\nSure. Good morning. I'll start and maybe Gideon will jump in as well. So, we are not giving guidance on a quarterly basis due to the fact for many years now that our customers under 606 revenue recognition rules, we report what our customers report in the same quarter itself.\n\nSo, we don't really get -- and you guys also don't get visibility from the cellphone manufacturers and OEMs and Bluetooth-enabled devices and a lot of other OEMs, how much they actually plan to sell. And therefore, giving guidance of a big portion of our royalty -- of our revenues, which are the royalties, under 606 has been very difficult. And we have stopped doing that because the data does not exist. And with that said, there are some very positive trends in our royalty business, and that's around base station IoT.\n\nWe managed with all the uncertainty that you asked and mentioned to grow that portion of the business, 6% with the lockdown and the rest of the macro concern. A lot of it this time around, every quarter it comes from a different market that's stronger than others. This time around, we saw growth in a very strong growth compared to Q1, for example, in the 5G base station land. We saw continued growth in Bluetooth devices on a year-over-year basis and cellular IoT devices on a year over year basis.\n\nSo, that trend continues. I think it should be there for a long period of time. Every quarter, a different market, a different segment could pull in or be the driver for those royalties. And I think because we are powering so many devices, 1.6 billion last year, and the numbers are looking quite solid for this year as well.\n\nThe weakest link in the other category of royalties is not coming from base station IoT but from the handset side. In handsets, many, many companies have come out and expanded the industry. We saw weakness in China and China-related countries, the low end and mid-tier type of phones, smartphones. This is where the uncertainty relies.\n\nIt could move in different directions, partially because of the lockdown, partially because of concerns that eventually there are needs for those low-end phones. We saw more resilience in the high end happen with Samsung's results. And we saw at least in the second quarter, less in the low end, which could fix itself in the later part of the year. So, those are the two moving pieces in the world.\n\nAnd, Gideon, happy for you to comment in a minute as well. And that's more of the uncertainty that we are seeing around us, and we have experienced this second quarter in specifically in handsets. When you look at the licensing environment, it's still robust. We came out with a strong second half last year with $21 million, $21.5 million.\n\nThis year for the first quarter of the year for the first time ever two quarters in a row, we're above $22 million. The shutdown in China, if they did affect consumer demand, as we said, it does not affect technology companies to continue to do design wins. After 2.5 years of COVID, companies know how to run their R&D site offline and from work from home. And we have continued to see very strong demand in licensing.\n\nAnd we don't see that, at least in the near future for the upcoming quarter slowing down and with new offerings. And I think that's the comments that we made. We haven't changed the annual guidance. We don't know exactly where we'll find ourselves with that.\n\nBut on the other hand, you saw the numbers for this quarter as well. The expenses are slightly better. FX environment is helping us, and that could offset some of the risk to the bottom line. Sorry for the long answer, but I try to cover all that basis.\n\nGideon Wertheizer -- Chief Executive Officer\n\nYes, let me just highlight two things regarding the royalties. Obviously, Q2 was a tailwind or headwind. I would say on handset revenue, onset royalties at the low, I would say, low end, concentrating on the lower end and beating the NIM. The way we see it is the OEMs are a bit prudent in piling up the inventories or prefer to clean up inventory in preparation.\n\nYou know, we are getting to the second half of the year, and we see more prudency there at the OEM level. When it comes to the market, we were in this position several times when there is some kind of macro events that affect the economy, the low end, the handset is the first thing that impacted, but it's the first thing to recover. And it could be a fast swing when this uncertainty goes. So, that's where we see it now.\n\nWe have the product. 5G is where the opportunity. In handset, 5G need low need is where our customers are focusing. And they have the product in place.\n\nWe have been discussing in prior calls design wins [Inaudible], and of course, there is the India side of things. So, as soon as this cloud of uncertainty will somehow clear up, we're going to see this coming back strong. When it comes to the base specialty, I think Yaniv covered it properly. We talked about a diverse product and a diverse market.\n\nAnd I would say, we see the [Inaudible] all over the place because we are coming -- our customers are coming every quarter with new products. It's share gain. It's growing. It's not just growing with the market but above the market because there are new product coming from our customers.\n\nSo, the handset is something that impacted that, but the rest is OK.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nOK. Thank you both, guys. I really appreciate all the commentary there. And we certainly appreciate the uncertainties that are out there.\n\nJust as my follow-up question, I'll keep it quick, and I'll get back in the queue. Yaniv, I think you guys gave some commentary in the script about the amount of smartphone units that were in your royalties. Could you also sort of quantify how much of the royalty revenue in the second quarter was in the handset market just so we can calibrate risks there? Thank you very much.\n\nYaniv Arieli -- Chief Financial Officer\n\nYeah. Sure, we continue to give numbers quarter after quarter. Out of the $11.1 million, $7 million were base station IoT and the $4.1 million were handset-related.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nThanks, guys. Appreciate it.\n\nYaniv Arieli -- Chief Financial Officer\n\nSure. Thank you.\n\nOperator\n\nAnd our next question today comes from Kevin Cassidy with Rosenblatt Securities. Please go ahead.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nYes. Thanks for taking my question. And congratulations in this tough market, having good numbers. But you showed 22 new IT deals and very impressive with that.\n\nAnd, you know, last quarter, it was only 14 new deals, but the revenue is about the same. Can you say, is there a trend there for smaller deals? Or, you know, maybe just give us a feel for what happened in that mix.\n\nYaniv Arieli -- Chief Financial Officer\n\nYeah, good morning. We answered that from time to time. I don't think that taking the revenue and divided by the number of deals gets you anywhere. Some deals that were signed are not delivered because if we don't know the customer, we don't know its financial background, we don't recognize and don't deliver the technology before we actually get paid.\n\nSo, there is a little bit more complexity around the number of deals that get signed versus the average amount. I would say that in every given quarter, we have one or two bigger deals for millions of dollars. And we could have smaller deals for a single user for some software elements or work in the hundreds of thousands of dollars. And we could have deals, and usually we do have deals, in the $2 million or $3 million type range.\n\nAnd I wouldn't take one -- you cannot from those numbers, we get to one answer. Rather, it's a combination of large deals, small deals, recurring customers, five new customers that we have never had any business with. Some, we deliver immediately and recognize. Some, we don't deliver because we don't know the customer's financial background yet, and we want to wait for the payment.\n\nAnd some are -- some work that we do, whether it's NRE or some special customizations, then that gets recommended or a few quarters without counting that in the new deal every quarter, obviously. So, it's a combination of all these three or four elements.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nOK. I understand. Just make sure it's not a trend. And the Intrinsix.\n\nYou didn't say much about some of the pipeline that you're working on there. Can you give us some feel for the Intrinsix opportunities?\n\nGideon Wertheizer -- Chief Executive Officer\n\nIntrinsix has a strength in the defense market. The defense market has its own dynamics. And usually, it's a long project. What we are having now when under the umbrella, I see what is our new customer base, we already signed few designs in respect to see the customer base that come to us and after understanding what Intinsix can contribute asking for such designs.\n\nAnd what we're discussing on the call about the co-creation business where we come to the customer and take the lead on the wireless system, Intrinsix has a significant role because those guys are the integration -- the integrator of IPs.\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nOK. Thank you.\n\nGideon Wertheizer -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd our next question today comes from Suji Desilva at ROTH Capital. Please go ahead.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nHi, Gideon. Hi, Yaniv. Gideon, you talked in the prepared remarks about having cellular and WiFi and the coexistence. Can you talk about the advantages of CEVA of being in both markets, along with just having a strong opportunity in each one? Maybe the synergy between them.\n\nGideon Wertheizer -- Chief Executive Officer\n\nWell, there is a lot of technology synergy between WiFi and 5G. They use the same -- especially WiFi 7 and 5G. They use the same modulation mechanisms. With that said, the way we deal with customers is that we see the Wi-Fi as the local area network and 5G is the one with broad network.\n\nSo, when we go to customer proposition, we basically -- it's two technologies that we put together these two components of our offering. And we do all the integration between the two. But customer -- we see more and more customers asking for both technologies, either in order to address larger markets or go to what is called access point or fixed wireless access, where on one hand, the internet is coming to the home through 5G and spread over the home through WiFi.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nAnd then on the 5G infrastructure base station side, can you talk about how many customers you're ramping today maybe versus 12 months ago? And is there any inflection in the upcoming quarters or maybe the macro would impact that? Any thoughts there on how 5G is going to ramp up from here?\n\nGideon Wertheizer -- Chief Executive Officer\n\nSo first of all, in terms of customers, we have two big customers that take us to the macro base station, the largest base station. We have several other customers that are -- expose us to different other markets like small cells and the 5G. And that's what we like and believe in 5G is extremely big use in one hand and also some new form factor of 5G. So, we have things like private networks.\n\nWe have MIMO antenna. So, only the strong -- we have OWAN, open WAN. So, these are all vectors that extend the TAM, the total available market of the 5G. And we approach all of them.\n\nI think I heard Nokia saying that outside of China, 5G network is only in 15% of the available market, 15%. So, think about the opportunity ahead of us in terms of geographies, in terms of India. It's a big market. And another thing, it's a high-entry barrier because if you have the relationship and experience, very difficult to create an alternative.\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nThat's helpful, Gideon. Thanks. Thanks, everybody.\n\nGideon Wertheizer -- Chief Executive Officer\n\nThanks, Suji.\n\nOperator\n\nAnd our next question today comes from Chris Reimer with Barclays. Please go ahead.\n\nChris Reimer -- Barclays -- Analyst\n\nHi. Thank you for taking my question. I wanted to ask about operating margin. You mentioned in your comments that you might be seeing some benefit or derisking.\n\nI was just wondering if you could give us a little color around what's going on there and what the moving parts are.\n\nYaniv Arieli -- Chief Financial Officer\n\nYes, sure. Great question. But when we added Intrinsix and added both NRE services and the co-creation of licensing both and offering both IPs and services and designs of chips or blocks, it obviously took our margins down from the 90s that we were for many years to the low 80s, anywhere between 80% to 84ish, 85%, that's where we -- sort of our sweet spot in our understanding of the existing market and until new royalty payers will come in from that new business model. With that said, the simple combination of the same level of licensing of 22-plus and higher royalties than where we are now with 11 million for Q2 gets you to slightly better margins.\n\nIt's just a technicality here. Nothing has changed in the business. It's just the mix of licensing versus royalties and the higher the royalties. Obviously, in the future as well, the higher the margin will be, but we don't see it going anywhere higher than that 83, 84 for the time being and [Inaudible] from this business kick in as well.\n\nSo, that's what's the merit and the understanding for the guidance for Q3.\n\nChris Reimer -- Barclays -- Analyst\n\nGot it. And just touching on M&A. Are you seeing any changes perhaps or any thoughts on pipeline now that we've seen some valuations come down recently?\n\nYaniv Arieli -- Chief Financial Officer\n\nSo, our barrier of not doing M&A is too frequent is not necessarily only from valuation or valuation at all, but it's more of what's the right next step for us, what is the new technology, the new markets, the new add-on that we could grow the business quicker and faster and add more offerings to the semiconductor industry, whether it's in hardware or software or IP, that's really where the merit is. There's no doubt that it's a little bit of an easier environment to look for ideas and better pricing. But our dilemma of what is the next step for CEVA to continue its growth and expedite it really comes from what is right and not how much it will cost. It's a factor, but let's find the right technology.\n\nWe have multiple ideas, by the way. We have multiple different projects that we're looking into. We have different collaborations and different ideas that we want to target, and we're actively looking. Nothing right now on the agenda, but that's something that we continuously want to add on to our offerings.\n\nChris Reimer -- Barclays -- Analyst\n\nGreat. Thanks for the color. That's it for me.\n\nYaniv Arieli -- Chief Financial Officer\n\nGreat. Thank you.\n\nOperator\n\nAnd our next question today comes from David O'Connor with Exane BNP Paribas. Please go ahead.\n\nDavid O'Connor -- Exane BNP Paribas--Analyst\n\nGreat. Good morning. Thanks for letting me ask a question. Gideon, maybe going back to the strategic agreement of co-creation with the customer.\n\nCan you just talk around the catalyst that drove that decision? Why now? And also maybe, Yaniv, related to that, can you talk around the impact on the model from the kind of co-creation relationship? And I have a follow-up. Thanks.\n\nGideon Wertheizer -- Chief Executive Officer\n\nSo, let me explain the rationale from a customer standpoint to go to this proposition and maybe Yaniv can add implication on the model. But the rationale for the customer is if you want, as a company, to get into the wireless space, and you are not MediaTek, Broadcom, and Qualcomm to some extent, it's a huge entry barrier because you need to deal with things that are not just complicated in terms of technologies and integration with RF. It's also skills that it scales. Now, we figure out the fact that we have all these technologies and abilities to do.\n\nAnd we bring in our other competencies, whether it's Intrinsix in design or whether it's software, and we come to the customer and say, we can create for you for you, that's the co-create. We can create for you your own wireless system. And the result of this one is it's a larger deal, a large amount of royalties. And in terms of the business model, it does not disrupt the business model because it's still IP.\n\nWhat we deliver is IP. We don't deliver chips or semiconductor to them, it's just the IP. But from the customer standpoint, this block has a huge value. I'll add one more thing to it that, you know, classical IP model, you license your IP and you wait until the customer finishes its design.\n\nIt could take one or two years, qualify the chip, test it, and then that goes to the OEM into the final product. Here, when we do a block lot or a whole chip from an IT and service, so that sort of move a bit the responsibility for the success of that blocker chip to us. So, we have more visibility into that. And didn't mention the key critical change in the business model is that as soon as that chip goes to production, hopefully or maybe could be a little bit shorter than two years in this type of consumer-based solution, we'll get royalties.\n\nAnd on a typical old school NRE service base, there is no royalties. It's a onetime deal, maybe recurring engineering efforts, but you don't get the royalty component. Here, as soon as that chip is ready out the door in production, that's going to add on to the volume and to the royalties from our perspective. So, it's a win-win, both from a little bit more involvement in R&D of our customers and the roadmap to come up with that chip into production.\n\nAnd on the other hand, it's the royalties.\n\nDavid O'Connor -- Exane BNP Paribas--Analyst\n\nThanks. And maybe, Gideon, going back to your prepared remarks, you talked about engagements with U.S. companies picking up, I think. Which technologies are these engagements picking up? And what are you doing a bit differently maybe to capture some of these U.S.-based opportunities?\n\nGideon Wertheizer -- Chief Executive Officer\n\nHearing technology in terms of the node?\n\nDavid O'Connor -- Exane BNP Paribas--Analyst\n\nWell, just -- is it hearables, wearables, is that on handsets, which kind of areas are these engagements picking up, the U.S.-based opportunities?\n\nGideon Wertheizer -- Chief Executive Officer\n\nYeah, so, the specific engagement that we talked about in the prepared remarks, it's wireless audio, meaning Bluetooth and audio. This combination also possess complexities. And the target market is wearables and and watches, smartwatch.\n\nDavid O'Connor -- Exane BNP Paribas--Analyst\n\nUnderstood. Thank you. And if I could just squeeze one last one in. Just on the handset base spend royalties, how would you split that out low end kind of midrange versus high end in your royalties?\n\nGideon Wertheizer -- Chief Executive Officer\n\nMost of our business is in the mid range these days, our customers business today. UNISOC is the biggest customer of ours. They are a strong presence worldwide, India, China, Latin America, in mid-range phones. You know, the low-end phones are almost disappearing, the 2G and 3G don't really exist that much anymore.\n\nSo, it's mainly the 4G bringing the volume and 5G, they have a good offering with some design wins. So, that's the potential over the next couple of years.\n\nDavid O'Connor -- Exane BNP Paribas--Analyst\n\nThanks so much.\n\nGideon Wertheizer -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd our next question today comes from Martin Yang of Oppenheimer. Please go ahead.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nHi. Thanks for taking my question. I have a question regarding your Bluetooth and WiFi portfolio. How much do you estimate that you have the exposure to consumer end markets through your direct customers? And do you foresee any upcoming weakness into the second half for Bluetooth and Wi-Fi shipments?\n\nGideon Wertheizer -- Chief Executive Officer\n\nWell, you know, when it comes to Bluetooth and WiFi, it's -- I cannot simply say exposure to consumer market. It's all over the place. We have people that use our technology for automotive. We have people that use our technology in industrial recently.\n\nWe see people are using it in [Inaudible] headset audio. So, there is not any concentration on specific market. And that's the reason that it's resilient because every quarter, somebody else [Inaudible] could be another company that faces difficulties. We saw it clearly in the report that we got in the quarter.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nGot it. Thank you. I have no more questions.\n\nGideon Wertheizer -- Chief Executive Officer\n\nThank you. And remember, I think that royalties for Bluetooth were up year over year with all these market uncertainties. So, this is part of the answer that we have seen in the second quarter as well.\n\nOperator\n\nThank you, sir.\n\nGideon Wertheizer -- Chief Executive Officer\n\nGo ahead, Rocco. Sorry.\n\nOperator\n\nNo problem at all. This concludes our question-and-answer session. I'd like to turn it back over to Richard Kingston for closing remarks.\n\nYaniv Arieli -- Chief Financial Officer\n\nRichard, maybe you're on mute?\n\nRichard Kingston -- Vice President, Market Intelligence, Investor and Public Relations\n\nApologies. Sorry. Thanks, Yaniv. Thank you, all, for joining us today and for your continued interest in CEVA.\n\nAnd as a reminder, the prepared remarks on the conference call today are filed as an exhibit to the current report on Form 8-K and accessible through the Investors section of our website. With regards to upcoming events, we will be participating in the following conferences. The Oppenheimer 25th Annual Technology Internet and Communications Conference being held virtually tomorrow, August 10th. We'll participate at the Rosenblatt Securities Technology Summit Age of AI Conference, August 23rd and 24th.\n\nWe will be in attendance at the Jefferies 2022 Semiconductor IT Hardware and Communications Infrastructure Summit, August 30th and 31st in Chicago; and the Jefferies Israel Tech Trek, which will take place September 21st and 22nd in Tel Aviv. Further information on these events and all events we will be participating in can be found on the Investors section of our website. Thank you, and goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRichard Kingston -- Vice President, Market Intelligence, Investor and Public Relations\n\nGideon Wertheizer -- Chief Executive Officer\n\nYaniv Arieli -- Chief Financial Officer\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nKevin Cassidy -- Rosenblatt Securities -- Analyst\n\nSuji Desilva -- ROTH Capital Partners -- Analyst\n\nChris Reimer -- Barclays -- Analyst\n\nDavid O'Connor -- Exane BNP Paribas--Analyst\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nMore CEVA analysis\n\nAll earnings call transcripts"
}