{
  "companyName": "II-VI",
  "companyTicker": "IIVI",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/ii-vi-iivi-q4-2022-earnings-call-transcript/",
  "content": "II-VI (COHR 1.50%)\nQ4 2022 Earnings Call\nAug 24, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the II-VI Incorporated fiscal year 2022 fourth quarter earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Mary Jane Raymond, chief financial officer.\n\nPlease go ahead.\n\nMary Jane Raymond -- Chief Financial Officer\n\nThank you, Catherine. Good morning. I'm Mary Jane Raymond, the chief financial officer here at II-VI Incorporated. Welcome to our earnings call today for the fourth quarter of fiscal year 2022.\n\nWith me today on the call are Dr. Chuck Mattera, our chair and chief executive officer; and Dr. Giovanni Barbarossa, our chief strategy officer and the president of the compound semiconductor segment. This call is being recorded on Wednesday, August 24th, 2022.\n\nFor today's call, the press release and the investor presentation are available on the Investor Relations tab of our website, ii-vi.com. Today's discussion includes certain non-GAAP measures. A detailed reconciliation of these non-GAAP measures to our GAAP results is included in today's documents. I remind you that during this call, we will be making certain forward-looking statements.\n\nThese forward-looking statements are based on current expectations, forecasts, and assumptions and involve risks and uncertainties that could cause actual results to differ materially from these statements made today. Our comments should be viewed in the context of the risk factors detailed in our most recent 10-K filing for the fiscal year ended June 30th, 2021, and our subsequent SEC filings. Our Form 10-K for fiscal year ended June 30th, 2022, is expected to be filed on August 29th. II-VI assumes no obligation to update the information discussed in this conference call, except as required by law.\n\nWith that, let me turn the call over to Dr. Chuck Mattera. Chuck?\n\nChuck Mattera -- Chief Executive Officer\n\nThank you, Mary Jane. Welcome, everyone, and thanks for joining us today. FY '22 was truly extraordinary in every conceivable way, starting with our financial results. We completed our fourth fiscal quarter of 2022 with revenue of $887 million, an increase of 7% over the third quarter in 2022, and an increase of 10% over the fourth quarter of fiscal year 2021.\n\nWe achieved operating income in Q4 FY '22 of $114 million and non-GAAP diluted EPS of $0.98. These results are new records for fourth quarter revenue, strong quarterly year-over-year growth numbers, and reflect sustained demand across our businesses. Our quarterly results reflect the resilience to a challenging operating environment, including the ongoing and profound in order impact caused by the pandemic a dynamic regulatory environment, and persisting supply chain challenges. In the face of these headwinds, our global team rose to the occasion every day with extraordinary effort and care for our employees and achieved an incredible success.\n\nThere is an undeniable plumb line running directly from the Finisar acquisition and our collective long and deep history of dedicating ourselves to excellence, including as reflected in the results we report today. We completed the Finisar acquisition on September 24th, 2019, right before the effects of the pandemic were first felt by the world. At the time, we believe that the depth and breadth of the technologies and manufacturing scale of the newly combined company would enable our growth by addressing the long-term mega trends in our markets, including cloud computing and the advent of 5G wireless networks. We were right in our beliefs and so we turned our intense focus to executing on our strategy leveraging our technology and worldwide manufacturing platforms, identifying and closing gaps, delivering against our synergy targets, and improving our operating leverage.\n\nAs a result of the acquisition, we became the largest component and subsystem supplier in the optical communications market as well as a leader in photonic solutions and compound semiconductors. All of these actions led to a truly stunning fiscal year with record $3.3 billion in revenue, 7% top-line growth, and record bookings of $4.3 billion. We also demonstrated our ability to generate strong operating cash flow results while investing strategically for the future and facing unprecedented operating challenges, closing the year with $413 million of operating cash flow. Putting a finer point on it, revenues from industry-leading customers in the communications market led the way, driving 13% growth in Datacom, thanks to a banner year of market share gains and exciting new product launches that serve the largest hyperscalers.\n\nThe award-winning photonic solutions segment, a business that had less than $100 million in annual sales when we acquired them in 2010, reached a phenomenal $2.2 billion in revenue this year, growing 9% year over year. This performance, despite our best efforts, was negatively impacted by $130 million due to supply chain issues. Its partner, the compound semiconductor segment delivered a record $1.1 billion in revenue, thanks to a 29% annual growth in sales of components for semiconductor capital equipment, including growth from differentiated and sole-sourced EUV components. The 26% growth in industrial applications across the board contributed as well.\n\nOur silicon carbide materials, devices, and modules business grew considerably our top and bottom lines while investing in the growth capacity required to meet the insatiable demand of customers for the best products that money can buy from a sustainable source of high-quality silicon carbide power semiconductors at scale. These materials, devices, and modules underpin a technological revolution, the electrification of transportation as well as critical components for renewable energy infrastructure and in the future, vital upgrades to an aging grid. Our strong performance throughout the year is the result of our deep customer relationships, decades of investments in technology, sophisticated manufacturing platforms, and leading-edge products. Our diversified global footprint has allowed us to operate resiliently and continue to capture expanding opportunities across all end markets.\n\nTurning now to Coherent after years of assessing the possible trajectories of a changing landscape. About 18 months ago, we announced our strategy to rebalance the diversification of the company. Our strategy, combined with our market and technology insights, pointed us to Coherent, a long-standing innovator and the gold standard for laser systems technology. Through a process of mutual discovery and our joint planning of the last year, which took place at a blistering pace.\n\nOur integration teams work collaboratively to make for a flawless day one experience, which occurred on July 1st when we began a new and transformative chapter. We were off to the races from the very first day. Now everywhere we turn across the company and with customers and employees alike, sparks of excitement are flying around this next chapter of a remarkable transformation. We have begun to engage with our new colleagues in earnest and are focused on executing on the synergies already.\n\nIt's an incredible team of people well suited to our culture, and I could not be more excited about the days ahead. We remain confident and committed to our cost synergy targets and time line. And over the next several quarters, expect to be able to say more about the revenue synergies. On September 8th, 2022, we will transition to our new name, Coherent Corp.\n\nWe'll launch our new brand and begin trading with a new ticker symbol, NASDAQ, COHR. We chose the name Coherent because it has the universal meaning of bringing things together, with an appeal that we believe will expand our brand recognition and create value. The broader meaning of the word coherent represents our diversity and thinking, distilled into a common purpose, our unity in action, and our broader sense of engagement a connection to our mission, vision, and values. Going forward, we will simplify our segment names and the description of the end markets we serve.\n\nThe new segments will be materials, networking, and lasers. In addition, we will report revenues by four end markets: industrial; communications; electronics; and instrumentation. The company now addresses a combined TAM of $65 billion. Our long-range plan anticipates that the markets we serve will have a composite CAGR of mid-double digits.\n\nSo I believe that we are very well-positioned in each of the end markets to take advantage of the opportunities available to us while delivering on the promise of our transformative acquisitions through sustained dedication to organic investments. The resulting depth and breadth of our team of dedicated employees, technology platforms, and manufacturing scale, now with the addition of Coherent, who will enable our growth by addressing the long-term mega trends in our targeted markets. Turning to Q1 FY '23. Our guidance anticipates that we will grow the top line by over 50% sequentially, including the acquisition, and over 10% organically for legacy II-VI.\n\nWe expect continued sequential growth from the consumer market due to both meaningful share gains in the sensing market, including 3D sensing, as well as continued demand in components for semiconductor capital equipment and communications overall. In FY '23, we will continue to prioritize our capital allocations to debt reduction, investments in capacity expansion and for next-generation technology and product development as we simultaneously drive deleveraging and continued leadership in sustainable growth across all of our markets. I will return to wrap up after Mary Jane's section. But for now, let me turn it over to Dr.\n\nGiovanni Barbarossa, who in his capacity as the company's chief strategy officer, will provide color for the quarter and about our emerging technologies. Giovanni?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nThank you, Chuck, and good morning, everyone. We had a great fourth quarter with meaningful growth in communications and industrial. Communications revenue grew 8% compared to Q4 of last year and 4% sequentially. Our Datacom business grew 14% compared to Q4 of last year, with strong growth in transceivers, modules, and photonic components.\n\nOur growth is a testament to our technology leadership supported by proactive supply chain management and collaborative long-range planning with a broad customer base. For the market studies we have done, the Datacom market is expected to grow in the next five years at a 12% compounded annual growth rate despite current macro sentiments. The double-digit growth is in line with recent analyst reports that forecast global data center capex spend to be quite robust, growing to over $370 billion by 2026, with hyperscalers accounting for more than half of that amount. Shipments to hyperscalers of our higher data rate transceivers at 200G and beyond were four times higher than in fiscal year 2021 and drove the majority of the growth of our Datacom business in fiscal year 2022.\n\nAs the cloud and hyperscale data center market transition to 25 and 50 terabits per second, which is the demand for our 800G transceivers is picking up. In fact, we are now shipping meaningful volumes of 800G transceivers. We are confident that our industry-leading 200G [Inaudible] lasers and detectors will become the components of choice for this upgrade cycle. Our 200G lasers and detectors will be needed in reducing cost and energy per bit and will serve as a solid foundation for our next-generation 1.6 terabits per second transceivers.\n\nWe are pleased to report that we had a record revenue for our Datacom VCSELs, which was driven by a successful ramp of the latest generation of our 50G VCSELs for PAM4 modulation format. Our telecom business grew 10% sequentially, driven by continued share gain in Coherent transceivers and the growth of our subsystems business. Last quarter, we unveiled our organic BSP platform, which in line with our vertical integration strategy, we have been investing in since 2019. Our purpose-built telethon DSP is a key enabler of our industry's first 100ZR QSFP28 pluggable coherent transceiver for the network edge, a market that analysts estimate to be $750 million by calendar year 2026.\n\nWith our DSP and our transceiver technology, service providers can now benefit from the simplicity and robustness of coherent technology in the access network and proceed to upgrade millions of NG Ethernet links to 100G seamlessly. Our Rota business, which was the most affected by supply chain over the past year was flat for full year, but grew 12% sequentially as we have made good progress in procuring components in shop supply. Our Industrial business achieved record revenues growing 6% in the quarter compared to Q4 of last year and 5% sequentially. Across the year and continuing in the fourth quarter, revenue was driven by consumables for both CO2 and fiber laser systems, a significant growth from optical components for short part lasers, a double-digit growth for our portfolio processing heads for cutting and welding, and a very solid year for our pump lasers.\n\nSales of many of our industrial products exceeded market growth as we continue to gain market share to our differentiated products, which are underpinned by very competitive cost structure and performance. Looking forward, this will only be enhanced with coherent acquisitions, particularly in the fast-growing market for electric vehicles, where the combination of our fiber lasers and processing heads provide uniquely differentiated solutions for battery welding. Revenues for the semiconductor capital equipment market grew 30% compared to Q4 last year and 9% sequentially. We had a record quarter and a record year with an annual growth of 29%, driven by strong demand for advanced materials for both the front and the back end of the line applications and some critical design wins as the envelope of our applications continue to expand.\n\nDemand for advanced lithography, including EUV, continues to grow, and our EUV business hit both annual and quarterly records in revenue, consistently with significant expansion plans announced by our key customers. Our consumer market revenues hit record in Q4, a quarter that is typically the lowest seasonally with 36% growth compared to Q4 of last year and 34% sequentially. The importance of short-wave infrared wavelengths for consumer electronics is starting to be well recognized. We recently announced a joint demonstration of a next-generation 3D camera with longer range and higher resolution than standard cameras operating at shorter wavelength that we greatly enhance the user experience in the metaverse.\n\nOur life sciences business had a record year, climbing over the $100 million mark in annual revenue. While carbon-related revenues are stabilizing, our optics and the electric sales into life sciences applications hit a quarterly revenue record. Finally, shipments of silicon carbide substrates in Q4 were 65% for power electronics and 35% for wireless communication, including our initial shipment of gallium nitride and silicon carbide devices and represent 4% of our revenue. We recently reported signing meaningful and long-term contracts to supply silicon carbide substrates to two leading customers, Infineon and Tiano.\n\nAs we continue to make progress with our devices for power electronics, silicon carbide grew 23% in Q4 over the same period last year. and our engagement with customers in the U.S. and Asia are expanding rapidly. We have now sampled our first automotive-qualified MOSFET devices, and we are working relentlessly to secure our first design wins.\n\nWith that, let me turn it over to Mary Jane. Mary Jane?\n\nMary Jane Raymond -- Chief Financial Officer\n\nThanks, Giovanni. For these entire remarks, I will speak about legacy II-VI results only unless otherwise noted. The quarterly and full year end market and geographic breakdown of our $887 million of Q4 revenue and $3.3 billion of fiscal year '22 revenue can be found on Page 20 to 24 of the investor presentation. We show you fiscal year '22 complete by the legacy II-VI market breakdown and then by the new market breakdown.\n\nWe also supply the mapping from the legacy markets to the simplified four end markets on Page 23. For legacy II-VI only networking and materials, Industrial was 21% of total fiscal year '22 revenue, communications was 65%, electronics was 10% and instrumentation was 4%. Including the form of Coherent, the laser segment, using their trailing 12-month revenue, the pro forma annual end-market fiscal year '22 breakdown is industrial, 38%, communications 45%, electronics, 7%, and instrumentation 10%. Returning to II-VI results.\n\nOur Q4 non-GAAP gross margin was 38.7%, and the non-GAAP operating margin was 19%. As a reminder, last quarter included $8 million of progress payments on development programs being partially supported by customers affecting the gross margin by $4.4 million and the operating margin by $8 million total with $3.6 million being an offset to R&D. Supply chain costs and COVID cost, a total of $8.6 million are not excluded to arrive at non-GAAP results. The margins are affected by the typical costs associated with the initial launch of new products.\n\nAt the segment level, the non-GAAP operating margins were 15.3% for Photonics and 26.6% for compound semiconductors. Our record backlog of $2.3 billion consists of $1.6 billion for Photonics and $0.7 billion for compound semiconductors. This increase in backlog at a function of demand in particular, from the industrial semiconductor capital equipment and communications end markets. GAAP operating expenses, SG&A plus R&D are $212 million in Q4, excluding $10 million of amortization, $13 million of stock comp $6 million in start-up costs, and $8 million of M&A and integration costs, non-GAAP opex was $176 million or 20% of revenue.\n\nFor the year, annual GAAP opex was $851 million and non-GAAP was $671 million or 20% of revenue. Quarterly GAAP EPS was $0.23 and non-GAAP EPS was $0.98 with after-tax non-GAAP adjustments of $90 million in total. The diluted share count for GAAP results is 117 million shares. And for non-GAAP, the share count was 126 million shares.\n\nThe GAAP and non-GAAP EPS calculations are in the ending tables of the press release. Pretax interest expense was $49 million, this includes $10 million of our underlying interest and $39 million of interest and fees on the debt for the coherent transaction. Cash flow from operations in the quarter was $137 million and free cash flow was $19 million -- free cash flow was $19 million, including capex of $118 million. For the year, cash flow from operations was $413 million and free cash flow was $99 million.\n\nThe strategic inventory build was $207 million and the capex was $314 million, an additional $53 million of capex has been committed. Capex for fiscal year '23 is expected to be $500 million to $600 million. Our net cash at June 30th was $282 million. on July 1st with the close of the Coherent transaction, our cash balance declined to $824 million from $2.58 billion, and we recorded $5 billion of total debt.\n\nOn the first of September, our 2022 convertible notes will mature. We have $324 million still outstanding as of today. The company expects to settle in stock. The effective tax rate in the quarter was 11% and 17% for the year.\n\nWe expect the tax rate in fiscal year '23 to be between 22% and 24%, assuming no adoption of new or additional tax rulings. The increase in the tax rate is largely driven by M&A costs that are not deductible. With respect to the Coherent transaction, our debt increased to $5 billion. Our net debt position immediately after the transaction was $4.2 billion, and our annual interest is expected to be 274 million, about $114 million above our expectations when the transaction was announced.\n\nApproximately 40% is hedged. Using the estimated pro forma trailing 12 months of both companies at June 30th, the closing leverage was 3.6 times gross leverage and three times net leverage, a total of 23 million new shares were issued to Coherent shareholders. The funding from Bain Capital, the Series B preferred shares is $2.15 billion and is equivalent to about 26 million common shares if converted. The income target for the entire Series B preferred shares to be dilutive is $189 million.\n\nDividends for the entire $2.15 or 5% or $116 million a year or $29 million a quarter, payable in kind for the first four years and thereafter in kind or cash at our option. Turning to the outlook for Q1 fiscal year '23. Our outlook for revenue for the first fiscal quarter ending September 30, 2022, is expected to be $1.3 billion to $1.4 billion, and earnings per share on a non-GAAP basis to be $0.77 to $0.90. This excludes any effects of purchase accounting, which are still underway other than the depreciation that is about $5 million in Q1.\n\nThe share count is 142 million shares for the low end of the guidance and 151 million shares for the midpoint and the high end of the guidance. The EPS calculation, including the dividend treatment is detailed on Table 8 of the press release for the low, mid, and high points of the guidance. This is at today's exchange rate and an estimated tax rate in Q1 of 25%. For the non-GAAP earnings per share, we add back to the GAAP earnings, pre-tax amounts of $265 million, consisting of $65 million in amortization, $30 million in stock comp, $122 million for M&A, including fees for the banking and financing and $48 million for the inventory step-up, which is preliminary.\n\nThe actual dollar amount of non-GAAP items, the tax rate, the exchange rate the purchase print accounting, and the share count are all subject to change. As a reminder, our answers today may contain certain forward-looking statements from which our actual results may differ due to a variety of factors, including, but not limited to, changes in mix, customer changes, supply chain shortages, both upstream and downstream, competition, changes in regulations, COVID-19 protocols and global economic conditions. With that, I'll turn it over to Chuck for a few final comments. Chuck?\n\nChuck Mattera -- Chief Executive Officer\n\nThank you, again, Mary Jane and Joanne. I would like to close our fiscal year '22 earnings call with some special recognition. First and foremost, I would like to recognize and thank each and every one of our worldwide employees for your hard work, dedication to excellence in everything due, and for caring so much for one another this past year. Without your daily dedication to excellence, we would not have been able to meet the extraordinary technical, operational and financial challenges and achieve the lofty goals we set for ourselves in FY '22.\n\nAnd while laying the foundation for an even brighter future. You are really making the world a safer, healthier, closer, and more efficient place to live. I would also like to thank our thousands of dedicated suppliers for your support over the past several years and especially this last fiscal year. It's been a truly challenging dynamic and unique business environment and we really appreciate your help in achieving our goal of serving our customers.\n\nAnd to our customers, thank you for your continued confidence and support. It's an honor to serve you and enable your continued success and to be an intimate part of building your future. I look forward to a tremendous future together, and we will do our absolute best to continue to serve you. Finally, I would also like to thank all of our shareholders and debt holders who have invested in us, entrusted us with your confidence and given us enormous opportunity and responsibility to succeed.\n\nWe take your trust and confidence and our responsibility very seriously. For those on the call, we welcome your questions, and we expect to win this call now at 10 a.m. Eastern Time this morning. Catherine, you may open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Paul Silverstein with Cowen. Your line is open.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nThanks for taking the questions. First off, again, the backdrop of what appears to be awfully broad strength. So what's the opportunity for great improvement from here with respect to revenue? And then if I could have a follow-up, and the follow-up would be with respect to coherent and industrial, in particular, what's the exposure to macro?\n\nChuck Mattera -- Chief Executive Officer\n\nPaul, I wasn't able to hear. Can you just summarize the two? Is it the greatest opportunity for revenue? Was that the first part?\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nGreatest opportunity for improvement. Obviously, you're discussing broad strength, but where is the greatest opportunity for improvement from a revenue perspective by product market? However, you want to frame it. And then what's the how much of the industrial business, how much coherent would be macro leverage versus how much of it is relatively independent from macro?\n\nChuck Mattera -- Chief Executive Officer\n\nOK. Maybe Giovanni will take the question.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nYeah. Paul, thanks for the question. So when we announced the combination with Coherent, there were four markets we thought that we're going to be very synergistic not only in general, for the cost structure of the two companies combined, but most about the revenue. That's what your question is about.\n\nSo we haven't really quantified those, but those four are really around industrial, the semi-cap and display markets, and then life sciences and aerospace and defense. We can go a little bit more in details in industrial. We think there is an opportunity on the cutting market, which we are now currently serving from a fiber laser standpoint, but I think there is an opportunity to gain share there, thanks to the combined cost structure of the company. In the semi-cap and display market standpoint, I think we have an opportunity to leverage a combined portfolio that is pretty unique in the industry from a laser system standpoint as well as part and component standpoint that we are supplying to similar customers.\n\nSo there is a tremendous portfolio synergies to be leveraged. And then life sciences, I think the most important of revenue opportunity really ultimately comes from the incredibly capillary and very well-positioned sales force of Coherent in the market, which is substantially larger than what we had II-VI before the combination. And last but not least, the speed in defense between energy, high-energy laser weapons, and other advanced application, I think the two companies have a portfolio of products that is pretty unique, particularly to serve the U.S. market.\n\nChuck Mattera -- Chief Executive Officer\n\nOK. Well, maybe for the second part of your question, for sure, more than half of it, I would say, about 70% perhaps, but I want to make clear that part, even the part which is connected to the macro, as you outlined, they've done a really solid job of even in some parts of the economy where there's been a slowdown, they still have been successful in penetrating with differentiated products. Their footprint is extraordinary. The service component is also a capillary component of the business.\n\nAnd I would look back and just point out that maybe 18 months ago when we modeled and had an expectation for what they could do in our fiscal year '22, they came in right in line with it. despite some softness in some parts of the economy. So leverage maybe 70%. That's a rough estimate, but very, very strong and differentiated within it.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nSure. Just to clarify, based on the press release that they were putting out your business obviously was trending significantly positive since the deal was first announced. Can you share any insight in terms of what you're saying with respect to orders that they were seeing on the industrial side? It doesn't sound like there's been a downturn relative to macro or otherwise, but that's the question.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nYeah. No, not really. I mean the only softness that we saw over the past 12 months was really in China, and that's picking up. So we were down year over year because of China.\n\nBut now Q4 is actually picking up as China as a market, about 7%, and it's distributed between industrial, mostly industrial and then some communications and life sciences. So that's -- it's very, very encouraging. And then with respect to Europe and rest of the world, North America, etc., I think the -- as we have said, inductors been very strong across the board at a component level, subsystem levels, consumable or aftermarket numbers are still very strong, which indicate a very strong lease utilization for durable good manufacturing.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nThanks very much. Appreciate it.\n\nChuck Mattera -- Chief Executive Officer\n\nThank you, Paul.\n\nOperator\n\nThank you. And we have a question from Ananda Baruah with Loop Capital. Your line is open.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nHi. Good morning, guys. Hey, congrats on getting this done on the strong June quarter execution, and thanks for all the great detail today. I really appreciate it.\n\nI just have one, if I could. Just with legacy Coherent, could you guys give us some sense of where they are in their microelectronics and display cycle since there have been comments around that for a while? And in that context, how we should think about where they are in their profitability cycle as well. Is it tracking with consistent cycles for where they are at this point in the cycle? And that's it for me, really appreciate it.\n\nChuck Mattera -- Chief Executive Officer\n\nThank you for your question. I would come back across the board and just reiterate what I said. The model that we had that we built during our diligence before the process settled down. We expected them to have a performance across the four market segments -- business market segments.\n\nThey delivered in line. despite the challenges that we all had in operating, they delivered in line with what we expected. I would say it's been very steady, very solid progress, and there have been no surprises. Then I'm expecting it to continue to be along that same plan line.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nThat's really helpful, Chuck. Any context on where in that cycle they are?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nWell, Ananda, this is Giovanni. Thanks for your question. I think definitely in the past, the leadership from an ale market standpoint was very very strong. And you can expect that relationship with display manufacturers continues -- has continued over the years.\n\nAnd the team is working on next-generation delays, which will likely be all at will probably be micro-driven and so forth. And so if you think about the timing of when those technologies will come to market will be a few years. And so we need to get ready for that market to pick up and create some strong demand for us. And I think from a development -- from a technology standpoint, from a product development standpoint, from a customer engagement, I think we believe that we'll still be the leader in the market, the strong interactions, strong technology platforms uniquely differentiated in many ways that will get ready the right hand for the ramp for the production of micro CDs.\n\nI mean, we said when we talked about Korea and we -- I used at least this way to characterize. We think that the -- ultimately, the laser platform as an offering is future proof. And displays are going to be around for a while. And no matter the technology, you still will rely on laser processes to manufacture displays, whether they're OLED, the micro EDs, etc.\n\nAnd I think the reference for quite some time will be the Coherent team that is part of the company, and we think very, very strong about the leadership market wise from that standpoint.\n\nChuck Mattera -- Chief Executive Officer\n\nThanks, Giovanni. Ananda, thanks for your question. I would only add, any such transitions when they happen, you can expect it will not only be there but that we expect to lead is part of it. OK.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nThat's great context. Thanks, guys.\n\nOperator\n\nThank you.\n\nMary Jane Raymond -- Chief Financial Officer\n\nCan we have the next question, please?\n\nOperator\n\nNext question comes from Dave Kang with B. Riley. Your line is open.\n\nDave Kang -- B. Riley Financial -- Analyst\n\nThank you. Good morning. Just a question on Infineon. I believe they have signed a two-year supply agreement with Showa Denko last year.\n\nJust wondering if you are splitting Infineon with Showa -- or any kind of color as far as the -- in terms of the contract?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nHi, Dave. It's Giovanni. Thanks for your question. We -- I can't refer to other agreements that our customers have.\n\nI only know that we signed a very very compelling long-term and large agreement with them to support the growth. That's all I can say.\n\nChuck Mattera -- Chief Executive Officer\n\nHey, Dave. I would add, Dave, thanks for your question, Dave. I would add the industry ecosystem includes companies who provide epitaxial wafers. And we are suppliers to -- even to that element of the ecosystem.\n\nI would only ask you to bear that in mind. Thanks for the question.\n\nDave Kang -- B. Riley Financial -- Analyst\n\nYeah. My follow-up on 3DS with this particular -- the lead smartphone customer, is it just still you and Lumentum, or has there additional supplier in the supply chain?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nThanks, Dave. It's hard to say. We definitely -- as the numbers kind of can tell you, we believe we've been gaining significant share year over year, quarter over quarter. And ultimately, what really counts is the -- in a world where the product has to be replaceable, it has to be able to be replaced by competition then the major differentiation really come down to cost and quality and then the road map that we have with the customers.\n\nSo we think that from a cost structure standpoint, given our complete level of vertical integration. And then from a quality standpoint, as we reported over the past several quarters, reporting quarter over quarter zero DPPM shipments. I think we welcome additional competition. But for now, our growth and our share gains, including some new design wins is demonstrated by the numbers that we have reported.\n\nDave Kang -- B. Riley Financial -- Analyst\n\nThanks.\n\nChuck Mattera -- Chief Executive Officer\n\nThanks, Dave.\n\nMary Jane Raymond -- Chief Financial Officer\n\nCan we have the next question, please?\n\nOperator\n\nWe have a question from Mark Miller with Benchmark. Your line is open.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nCongratulations on your record sales and closing the core acquisition. Your compound semiconductor sales were up, but operating income was down and so was margins. I was wondering if you give us some color on that.\n\nMary Jane Raymond -- Chief Financial Officer\n\nSemiconductors?\n\nChuck Mattera -- Chief Executive Officer\n\nThank you for your question, Mark. Let's give it a second.\n\nMary Jane Raymond -- Chief Financial Officer\n\nSo the operating margin for compound semiconductors was lower in the quarter because last quarter, which I imagine is your comparison, we had the $8 million of customer support of payments for new development were all in that segment. And if you look at $8 million on compound semiconductors third quarter, roughly $260 million in revenue, mid three points of margin. So it's a significant amount, almost four actually. But generally speaking, I would say that's one thing.\n\nAnd the second thing is that they, as Giovanni talked about, had launches of new products that -- for which you have seen the start-up costs in the past that launched in the quarter, and they usually that those volumes usually have a little bit of a dampening effect on the margin.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nJane, thank you. With companies like Western Digital and Micron significantly lowering our outlook for next fiscal year. Are you concerned data count has been very strong? Just was wondering about hyperscale capex over the next year. Are you worried about they're going to cut that because of weak consumer demand?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nNo. Definitely not, Mark. We -- as I said in the prepared remarks, demand for higher data rate transceivers, 200G and beyond is very strong. We said that that demand increased four times year over year.\n\nSo it's really strong. And we just don't see any of that in our customers' demand. So I can't comment on those two companies that you mentioned.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nThank you.\n\nChuck Mattera -- Chief Executive Officer\n\nThank you, Mark.\n\nOperator\n\nThank you. Our next question comes from Jim Ricchiuti with Needham. Your line is open.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nMary Jane, I know there are a lot of puts and takes with respect to gross margins, but I'm wondering if you can provide any way to think about gross margins for the combined company looking out in Q1, just given supply chain. And I don't know if you want to provide some color as to what kind of a revenue impact we might see from supply chain challenges.\n\nMary Jane Raymond -- Chief Financial Officer\n\nSo with respect to the margin, first of all, probably over the next few weeks, we'll put out a combined pro forma comparison for pet quarters. But I would say, going into Q1, so in this quarter, first of all, we had the kind of launch costs, so to speak, of newer products starting up. And we did have the absence of the lift we had last quarter, but that was always called out as a onetime. Going into fiscal year '22 for margins overall.\n\nI would imagine that the company still has a very good shot at that margin being over 40%. But in terms of having a finalized model on what we think to put out a new range. As I say, we'll probably have that over the next few weeks. But generally speaking, coherent is positive in our margins.\n\nAnd I think we look forward to the improvements that we'll see as we continue to go forward, especially with -- in Jamani segment, as his product launch, they have, as we've said many times before, the most ability to move the margin, whether that be any form of laser that we have or silicon carbide.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nGot it. And just a quick follow-up. When you talk about that 70% of that coherent business being macro related, Chuck, you're talking also the Excimer laser and the [Inaudible] business, the OLED portion of the business. And I wonder if you can characterize the line of sight you have to their bookings and backlog over the next two years, just given what we're hearing about new fab capacity additions, particularly in China.\n\nChuck Mattera -- Chief Executive Officer\n\nYes. We won't be able to comment or size of what you're looking for over the next -- for the next few years on this call today, Jim. But suffice it to say, we think there's still a very good and strong opportunity, and we're excited about it.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nOK. Thanks a lot.\n\nChuck Mattera -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Samik Chatterjee with J.P. Morgan. Your line is open.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking my question and congrats from my side as well. I just have one quick one. And I was hoping to dive a bit into the electronics market in which you're outlining the strongest growth process, although understand it's sort of a smaller portion of your revenue right now.\n\nBut if you can sort of help me think about the $11 billion TAM that you're outlining, how much of that is sort of the big buckets of electric vehicle sources, 3D sensing? And when I think about the 17% CAGR, is it going to be more back-end loaded because of electric vehicles? Or I would think 3D sensing is a bit more front-end loaded in that time horizon. So just trying to think about sort of how to think about the implication of that 17% to your business? So any help there would be helpful.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nThanks, Samik. Good morning. This is Giovanni. Thanks for your questions.\n\nSo OK, on the -- now the electronics includes what used to be the consumer electronics, and that's very much the largest portion of the growth that we've included in our guidance as well as generally speaking, for the future. And the reason is it comes down to what we talked about in the past, which is an expansion of our addressable market beyond the same thing into sensing. And so that's -- while we gained -- we continue to gain share on 3D sensing is a larger portion of the market, which is the sensing, which includes definition of 3D sensing. Where we are gaining share and having new design wins, all photonics related.\n\n-- thanks to a portfolio of products, which is second to none, between filters, optics materials, of course, lasers photodiodes, and fees there is an opportunity for us to grow in a much larger market than 3D sensing. And then on the automotive side, it's all driven primarily by our substrate sales, our silicon carbide substrate sales. And we continue to sign new contracts, long-term contracts. And right now, our growth is mostly limited by capacity, not by demand.\n\ndemand is very, very strong, and we'll keep eye. We are continuing to add capacity. As you remember, we announced a $1 billion investment over the next five years. We are spending capital to increase the growth year over year, and that's coming online fast but not fast enough to kind of saturate the market.\n\nSo we have room for growth from that standpoint as soon as we bring back -- we bring capacity online.\n\nChuck Mattera -- Chief Executive Officer\n\nI would only add, Samik, maybe an awkward way to put a really fine point on it. If you look in the second half of the decade, this opportunity that we see will really be driven by silicon carbide power electronics. As Giovanni said, the materials in the devices and modules will start to kick in and it will be driven in our model and then our forecast by the adoption of electric vehicles and other components that require high-voltage, high-reliability devices. We said that we expect to be at a level to offer into the marketplace and so in about five years from now, 1 million 6-inch equivalent substrates of silicon carbide per year beginning in about five years.\n\nSo it's that second half that we're looking at. And that's what we're investing for and getting organized for now in addition to growing in the short term because the market is supply limited, OK?\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you. Thank you.\n\nChuck Mattera -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Simon Leopold with Raymond James. Your line is open.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThanks for taking the question. I wanted to just maybe dig a little bit deeper on understanding the trends for coherent industrial exposure, specifically. And I think people maybe alluded to this earlier, but Applied Materials talked about some weakness in flat panels. And I don't presume that coherent really has much business from that market.\n\nI think Giovanni talked about this as an opportunity longer term, and I think it's more tied to smartphones. And so if you could help us understand maybe some of those key drivers for the industrial aspects of Coherent. I think I'm looking at what's coming, not what's happened over the past year. And then just a quick follow-up.\n\nIf you could share with us roughly the mix shift in your datacom transceivers as to how much of the revenue is 200 gig and above now versus, let's say, one year ago and how you see that trending? Thank you.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nSimon. First of all, I want to make sure that I clarify one point. We -- in our definition, industrial is about manufacturing of durable goods, not consumer electronics products. So that -- it's more on the -- what used to be called, I believe, microelectronics in the coherent kind of market classification.\n\nAnd now it is going to be called basically industrial in our classification. Just to assure it's not confused the two because we used to industrial like fiber laser cutting belies the CO2 lasers and so far. And now we are putting under the new industrial is including more, let's say, the larger portion of the market. So in terms of displays, I can't comment on what Applied Materials has reported.\n\nI can tell you that the demand is for those kind of parts, I would say, it's stable. I think that the -- as I alluded earlier, growth will come significantly when new technologies and new user cases will make into the market. And then I think your second question was it was about the consumer.\n\nSimon Leopold -- Raymond James -- Analyst\n\nNo. About your data conceiver get a better understanding of how your mix has shifted to the higher performance products, maybe a year over year, and if you have that handy?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nDo you understand you about this -- yes. So the vast -- so we like to divide the market in three buckets in terms of the hyperscalers, the, let's say, the average scalers and then the long tail we have about, let's say, our market. And that's important because the high data rates clearly, they're mostly going to hyperscalers. And then the long tail, it's all about 10G and above up to 200G.\n\nAnd therefore, so let's say that the hyperscale is about one-third of the Datacom number. The -- with about 20 to 30 mid-sized web-scale operators, it's another one-third. And then the last is actually almost customers, which probably 300 are the bulk. So that's the kind of the way they live.\n\nNow if you think about high data rate, I would say that -- I would call it like of the demand goes into hyperscalers. And again, the -- again, that's mostly by and the customer is driving the demand for 200, 400, and now, even 800G, which we are shipping already. So I hope that gives you enough color. It's all about hyperscaler driving higher data rates and the rest of the market driving, let's say, legacy 200 and below demand.\n\nSimon Leopold -- Raymond James -- Analyst\n\nGeneral. A fine point on your answer. It's the hyperscalers that are driving your growth. The rest of the market, you'd characterize as stable.\n\nIs that accurate?\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nNo, no, not at all. No. It's driving the growth of the high data rate.\n\nSimon Leopold -- Raymond James -- Analyst\n\nOK.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nYes. The hyperscalers are during the growth of the high data rate, but the low data rate also growing. It's just not necessarily a 200G in a pot.\n\nMary Jane Raymond -- Chief Financial Officer\n\nAnd I think similar to the answer in the past, I mean compared to the fourth quarter of last year, it was already starting to move to about 12% of the total transceiver business. The higher data rates now are --\n\nSimon Leopold -- Raymond James -- Analyst\n\nThank you.\n\nChuck Mattera -- Chief Executive Officer\n\nThank you, Simon.\n\nOperator\n\nWe have a question from Meta Marshall with Morgan Stanley. Your line is open.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nA couple for me. One, -- if you could just kind of speak to over the last 15, 18 months that you were kind of evaluating the Coherent acquisition. Just how you're view of what cross-sell opportunities or synergy opportunities have been? Are you more encouraged or kind of similarly encouraged as you were last March? And then -- maybe second question. Giovanni, you had mentioned last quarter that you were expecting 3D sensing business to grow, not necessarily from your lead customer, but from other expansion opportunities during the year.\n\nClearly, you're seeing expansion within your lead customer as well. But just are the other opportunities that you were expecting in 3D sensing kind of playing out as expected? Thanks.\n\nChuck Mattera -- Chief Executive Officer\n\nOK. Meta, I'll let Jon take the second part. As it relates to the first part of your question, compared to what we were thinking 18 months ago, with regard to opportunities for growth and we were not able to -- until the acquisition closed, we were not able to see or be exposed to any aspect of the details of their revenues. In the last few weeks, now that we've had that chance.\n\nYes, I would say that we're even more excited than what we were before then. -- the size of our largest customers and leading customers that are coming up in the marketplace who are investing to grow, they're all on the list. And the next phase of the integration will actually be a complete overhaul of our global sales organization, bringing the sales and service organization together. That will happen here in the next few weeks.\n\nAnd when that happens, we will be able to begin to tie our efficient standard operating procedures and processes with legacy Coherent together in a way that we -- the way that we both like to do and hit the road with and start talking to these large customers and the medium-sized ones that we've targeted to grow with. There's a -- it's a target-rich environment. I guess that's all I'd say.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nMeta, so I would say that the -- first of all, let me comment generally in the gold trajectory in our case, it's really -- it clearly comes down to three core names that I want to make sure that I explained them. First of all, we are broadening our technology footprint in the sensing and 3D sensing market. So in terms of actually the material that is being used to support those applications. That's very important.\n\nSo you not to say that you do have you obviously must have a broad portfolio of technology platforms to do that. That's one coordinated. The second coordinate is the level of integration that we are offering. We're partnering in some cases, in some cases, directly we try to offer a broader level of integration with packaging, including drivers, which we design ourselves for lasers and those kind of applications.\n\nSo that's also important. And the other one, as I mentioned earlier, is really around the expansion of the market that we are serving. So we are focusing only on 3D sensing, which we have demonstrated ability to be very cost and quality competitive in a market which is obviously very price sensitive. But we're expanding beyond that into sensing, which is a much larger market and where there is also -- I assume we see there is more competition.\n\nBut because of our integration, the port portfolio, and the VR offering. That it's not limited to chips, but it goes beyond semiconductor laser ships, as I said earlier, into optics, into materials, in packaged components so forth. We expect the growth to be driven in those three coordinates, as I said. So yes, the one customer is definitely driving most of the growth.\n\nOn the other hand, we're having significant new play in automotive and life sciences coming with us biometrics for wearables and the likes will eventually come. We're very engaged in that for those kind of applications, too. And so it's a very much broader market than we talked about in the past. And so there is more room for growth than just in the 3D sensing, even if I think the sense that we continue to gain share, as I said earlier.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nThank you, Meta.\n\nOperator\n\nOur next question comes from Harsh Kumar with Piper Sandler. Your line is open.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nYeah. Hey, guys. First of all, congratulations on the deal. huck, we're hearing from a lot of companies that the supply issues are now starting to get better -- so I guess my first question is you had a pretty big amount of revenue you left behind on the table last quarter.\n\nI would be curious to see what you're seeing at this point in time if you agree with the statement that I just made that we're hearing from other companies? Or is it still pretty tight?\n\nChuck Mattera -- Chief Executive Officer\n\nThere are -- we had a big opportunity, a bigger opportunity than what we could deliver in the fourth quarter and we talk about it. I mentioned it in my part of the script. But for sure, I also said we are seeing some moderation, but it's on a supplier by supplier, product line by product line basis, fab-by-fab basis. So it's not a comment that you can make as a broad brush across the whole of the market.\n\nThe other aspect is that once this problem became clear, we got busy working on second sources and redesigning and respinning and re everything that we needed to in close partnership with our customers. So part of the supply chain moderation is actually coming as a result of artwork and the deliberate strategy to dual source or triple source where we may have been only sold or double source. So it's a mix. And for sure, we can see some improvements coming in some quarters.\n\nAnd in other parts, the challenges that we're managing are about the same as they were 90 days ago.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nGot it. And for my next one, I know we can look at Coherent's model and sort of put together gross margin pro forma and opex number. But I'd be curious if you would be able to provide some color on how we should model those to the gross margin and the opex number. And if there's any difference now that you want it couple of -- I guess, a couple of weeks, any difference to what you expected? Anything plus and the unplug that you saw from the deal?\n\nMary Jane Raymond -- Chief Financial Officer\n\nFirst of all, the second part of the question, no. I mean, I think the more we work with our new colleagues it just becomes more and more exciting. We're very, very happy with the progress they're making in the market and the financial progress that they've made on their own from their own internal plans, which doesn't always happen in an acquisition once the company knows it's going to be acquired by somebody else. They sort of ignored that faction got on with their plan, and they did a very wonderful job.\n\nI would expect that -- but that said, over the next couple of weeks, we'll probably put out the combined backward model, first of all, and then you'll be able to see it from there. But I'd say, generally speaking, company is still expecting to have the margins in the 40s, I would expect that you should probably not do much above 40 at this point until we've really had some time to look at all the ways they report. And various things that they're seeing also on supply chain at this point, too. That's the first thing.\n\nWith respect to opex, we will continue to work on the combined opex between the two companies similar to as we have been doing. And the synergies, as we said, are very, very important to where we're going to be here. And I think conceptually, it's probably the same situation we have with Finisar, which is we'll say that we're going to try and get their numbers to the II-VI numbers, 20% of revenue for opex, etc. At the end of the three years of synergies and I imagine we would probably do that somewhat faster.\n\nSo my general sense is that it's very likely that we will continue to make the same sort of progress we have with II-VI. So generally speaking, we will make progress on not just taking the two companies and adding them up between the synergies. And I think the work that we'll be able to do together in leveraging both companies' sets of assets.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nThank you so much.\n\nOperator\n\nWe have a question from Sidney Ho with Deutsche Bank. Your line is open.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nHi. Great. Thanks for taking my question. Two quick ones, one on silicon carbide.\n\nFor the Infineon deal specifically, is there any way you can help us think about the size of the contract duration, the timing of the revenue ramp? And also curious if there is any commitment of time line to deliver 200-millimeter wafers. And I have a follow-up. Thanks.\n\nChuck Mattera -- Chief Executive Officer\n\nOK. Thank you, Sidney. We will not be able to say any more than what Infineon and we released in our press release. But I could add that in terms of the time line, the time line is not -- so it's not -- people are in need, we're ready, it's now.\n\nSo we're in the process of serving them. And as it relates to 200-millimeter, Well, we -- as we have announced in 2016, we came to the marketplace with the first 200-millimeter silicon carbide capability. Our -- we are ready, and we are serving it to the 150-millimeter will continue to be the dominant substrate for silicon carbide for some time to come.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nOK. That's helpful. Thanks, Chuck. Maybe a follow-up question is kind of related to this.\n\nBut if you look at the fiscal '23 guidance, $500 million to $600 million is up quite a bit. Obviously, you have coherent in there. But I'm curious how -- what are the different components in terms of the increase? How much of that is coming from selling carbide extension? And how much of that Instay Instar is coming from coherent and other items? Thank you.\n\nMary Jane Raymond -- Chief Financial Officer\n\nSo Coherent probably adds in the neighborhood of between say $70 $90 million, maybe $100 million, depending on what they see in terms of new opportunities. So that's the first part of the answer. And then the second part of the answer is we would expect to see silicon carbide continue in 2020. For very, very similar to what we -- 2023, very, very similar to what we saw in 2022.\n\nOf the $1 billion of investment that we discussed coming over the next 10 years, actually, it's rather concentrated in the first three as opposed to capex.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nGreat. Thank you.\n\nChuck Mattera -- Chief Executive Officer\n\nThank you, Sidney.\n\nOperator\n\nWe have a question from Tom O'Malley with Barclays. Your line is open.\n\nTom O'Malley -- Barclays -- Analyst\n\nHey, guys. Thanks for taking my question. You gave some guidance in terms of organic 26% sequentially. And with that guidance, it implies coherent kind of flat to slightly down.\n\nCould you just talk about what's going better, what's going worse than coherent? Is it the industrial laser side, you guys have seen some strength there despite the weakness in China? It on the OLS side, where it's the microelectronics. Any color on the moving parts, what's doing better, what's doing worse there? Thank you.\n\nMary Jane Raymond -- Chief Financial Officer\n\nI would say it's very, very steady. And actually, there is nothing going at works. You already heard Cohere's on comments last quarter about supply chain. So actually, they're delivering very steady performance, all things considered.\n\nTom O'Malley -- Barclays -- Analyst\n\nHelpful. And then in terms of the capex -- we heard a competitor talk earlier last week about their efforts to start going after DSP technology. Could you just give us an update on how that effort is going for you guys? And the strategic importance of having a DSP in both the coherent market at higher speeds in the future? Thank you.\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nHey, Tom. Good morning. Thanks for the question. So well, as I said in my prepared remarks, we started investing in 2019 that three years ago.\n\nWe realized the strategic importance of the ability to design our own DSPs. And we started -- we introduced dedicated DSP, as I said, for the 100G update or 10G Ethernet links, but particularly around the backhaul -- wireless backhaul and so forth is, as I said, almost like millions of ports that need to be upgraded from 10G to 100G, and that DSP is going to give us an incredibly competitive cost structure in addition, of course, to the lasers and detectors and the vertically integrated manufacturing lines that we have in China and Malaysia. So that DSP investment is continuing. We're obviously working on other functionalities, other reaches, other applications.\n\nAnd we will continue to beef up the team with talent to continue to support, particularly the Coherent side of the transceiver demand, where we will need to broaden the portfolio beyond what we already announced. So anyway -- so as I said, we recognized the importance, we decided to go with an organic investment and so far has been delivering according to plan, and we're very excited about it.\n\nChuck Mattera -- Chief Executive Officer\n\nI would add, Tom, that I would add that our current supply chain partners have really done a great job for us at the same time. So we have this dual approach here because we're thinking about the future. OK.\n\nTom O'Malley -- Barclays -- Analyst\n\nOK. Thank you, Chuck. Appreciate it.\n\nChuck Mattera -- Chief Executive Officer\n\nYou got it.\n\nOperator\n\nAnd that's all the questions we have. I'd like to turn the call back to management for any closing remarks.\n\nMary Jane Raymond -- Chief Financial Officer\n\nI want to thank all of you for being with us today. We hope you have a good day, and we look forward to seeing you in the future. See you soon. Bye-bye\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMary Jane Raymond -- Chief Financial Officer\n\nChuck Mattera -- Chief Executive Officer\n\nGiovanni Barbarossa -- Chief Strategy Officer and President, Compound Semiconductors\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nDave Kang -- B. Riley Financial -- Analyst\n\nMark Miller -- The Benchmark Company -- Analyst\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nTom O'Malley -- Barclays -- Analyst\n\nMore IIVI analysis\n\nAll earnings call transcripts"
}