{
  "companyName": "ZIM Integrated Shipping Services Ltd.",
  "companyTicker": "ZIM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/zim-integrated-shipping-services-ltd-zim-q2-2022-e/",
  "content": "ZIM Integrated Shipping Services Ltd. (ZIM -4.92%)\nQ2 2022 Earnings Call\nAug 17, 2022, 8:00 a.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Thank you for standing by. I'm Francy, your Chorus Call operator. Welcome, and thank you for joining the ZIM Integrated Shipping Service Q2 2022 earnings conference call.\n\n[Operator instructions] It's my pleasure, and I would now like to turn the conference over to Ms. Elana Holzman, head of investor relations. Please go ahead, ma'am.\n\nElana Holzman -- Head of Investor Relations\n\nThank you, Francy, and welcome to ZIM's second quarter 2022 financial results conference call. Joining me on the call today are Eli Glickman, ZIM's president and CEO; and Xavier Destriau, ZIM's CFO. Before we begin, I would like to remind you that during the course of this call, we will make forward-looking statements regarding expectations, predictions, projections or future events or results. We believe that our expectations and assumptions are reasonable.\n\nWe wish to caution you that such statements reflect only the company's current expectations and that actual events or results may differ, including materially. You are kindly referred to consider the risk factors and cautionary language described in the documents the company filed with the Securities and Exchange Commission, including our 2021 annual report filed on Form 20-F on March 9, 1922 -- sorry, 2022. We undertake no obligation to update these forward-looking statements. At this time, I would like to turn the call over to ZIM's CEO, Eli Glickman.\n\nEli?\n\nEli Glickman -- President and Chief Executive Officer\n\nThank you, Elana, and welcome everyone to today's call. I'm really proud of our execution and continued strong financial performance during the second quarter and first half of 2022, as you can see in Slide No. 3. Over the past several quarters, ZIM established itself as the leader in terms of EBITDA and EBIT margin in container shipping.\n\nOur first half results had record results for ZIM and we are pleased to continue delivering strong EBITDA and EBIT margins. Based on our solid performance in the first half, we are reaffirming our full year guidance for 2022 and are on track to deliver another year of record earnings and profitability. We are also announcing today the increase in our quarterly dividend payout from 20% to 30% of quarterly net income. This quarterly increase is based on our confidence in our ability to deliver long-term and consistent profitability while enabling our shareholders to benefit sooner from these strong results on a quarterly basis.\n\nAs you can see in Slide No. 3, in the first half of 2022, revenue grew by 73% compared to the same period in 2021. Adjusted EBITDA grew 115% and net income grew 106% as we further capitalize on elevated freight rates and resilient demand. We remain committed to profitable growth.\n\nIn the first half of 2022, adjusted EBITDA margin improved from 52% to 65% and adjusted EBIT margin improved from 45% to 56%. Our balance sheet continued to be very strong, with total equity of $5.25 billion at the end of the quarter after the distribution of $2.4 billion in dividends during the first half of 2022. In Slide No. 4, you can see that returning capital to shareholders has been and remains a top priority for us, given our confidence in our long-term profitability and got to reward long-term shareholders, we are increasing our quarterly dividend payout from 20% of quarterly net income to 30% of quarterly net income with the total dividend payout of 30% to 50% annual net income.\n\nAs such, starting this quarter, we intend to distribute approximately 30% of quarterly net income for each of the first three quarters of the year with possible step-up up to 50% of annual net income with the release of Q4 and full-year results subject to board approval. Accordingly, our board declared a Q2 dividend of $4.7 -- 75 -- $4.75 per share or a total of approximately $571 million. The Q2 dividend includes a 10% onetime catch-up from Q1 net income. In Slide No.\n\n4, you can see that the past several weeks have demonstrated the dynamic nature of our industry and the importance of staying focused on our core strategy and key strengths. Innovation, agility and excellence were the foundation of ZIM successful turnaround and they will continue to guide our commercial and operational strategy to further position ZIM as the top performer in our industry. We have established a track record of successfully identified attractive growth opportunities and adjusting our fleet size based on changing market conditions. This is a direct result of our operational and commercial agility, which has enabled ZIM to optimize vessel deployment, support high utilization level of vessels and exploit specific trade advantages driving our strong results and strong profitability.\n\nWe expect this approach to continue to be beneficial as the market expected to normalize from peak levels. Our global-niche strategy details that we operate in trade lanes where we have competitive advantage and can command meaningful market share. In Q2, we expanded our operating fleet capacity. We now operate 149 vessels to meet customer demand.\n\nWe open new lines and adjust our service to address changes in the business environment, so our vessels continue to sail full. I remind you that we have expanded our fleet over the past few quarters, partly in anticipation of the change in our collaboration agreement with the 2M. We transitioned to a full slot swap agreement on the Asia to U.S. East Coast and Gulf Coast and terminated the slot purchase agreement we had on the P&W and Asia-Med trades.\n\nAs a result of these changes, which went into effect in April 2022, we increased our operated capacity in order to best serve our customers. I would also like to highlight our car carrier business. As an example of ZIM mobility to identify profitable commercial opportunities since the beginning of the year, we grew the number of car carriage. We operate [Inaudible] as we take important steps to further capture growth in car cargo being exported out of Asia.\n\nOn the operational side, we remain committed to our strategy of relying primarily on chartered capacity while maintaining a high level of flexibility. This flexibility allows us to adapt our fleet size to changing market environment. Yet, we adapted our chartering strategy to reduce our exposure to the spot charter market due to shortage in capacity and rising daily rates. Instead, growth to charter newbuild vessels for our core operated capacity to improve our cost structure in the mid and long term.\n\nAs you know, during 2023 and 2024, we expect a delivery of 46 newbuild vessels, of which 28 are LNG-powered vessels. This newbuild capacity strengthened our commercial proposition and improved our cost structure by securing fuel-efficient newbuild capacity. The LNG vessels also serve our own ESG goals. We estimate that approximately a third of our capacity could be LNG- powered when we take delivery of these LNG vessels, and we will be the first planning to operate an LNG fleet from Asia to the U.S.\n\nEast Coast trade. We are excited that ZIM will be more carbon and cost efficient than it is today while improving our competitive position and supporting our customers in meeting their own ESG objectives. We are pleased to continue to position ZIM at the forefront of carbon intensity reduction among global liners. In Slide 6, you can see that as part of our strategy, we continue to leverage the Israeli high-tech start-up ecosystem to identify attractive -- attractive new innovative companies as growth engines.\n\nOur focus in digital initiative, technologies relevant to our core shipping activities and the broader logistics sector, our objective is to identify this opportunity at an early stage, which requires modest investment to establish our position and serve a strategic partner, implementing the technologies internally and assist these companies in the growth. We have been very active on this front and have recently completed full investment. We did two follow-on investments in WAVE BL and Sodyo and first-time investment in Data Science Group and hoopo Systems. Highlighting our most recent investment in hoopo, [Inaudible] provider of cutting-edge tracking solution for unpowered assets.\n\nThe solution is extremely durable, cost-efficient and power-efficient creating a tracking device that can last up to 10 years without changing the power source. Our investment in hoopo will be used in part to develop a solution suitable for the containers. While all these companies are young, we believe they hold significant potential in the future. Before turning the call over to Xavier, our CFO, I would like to briefly address the current market environment and outlook moving forward.\n\nAs I mentioned, the shipping industry is dynamic. Over the past several weeks, we've seen a decline in freight rates, particularly in the trans-Pacific despite persistent port congestion and overall positive demand trends driven by macroeconomic and geopolitical uncertainty. We, therefore, recognize that trades may help peak. However, we know the current freight rates, which are of historic high, remain elevated and, therefore, very profitable.\n\nWhile we anticipate some decline in rates for the remainder of the year, we expect the normalization to be gradual and support and reaffirm 2022 guidance, which, as I mentioned, will enable us to post another year of record earnings. Furthermore, we expect the new 2023 IMO regulation and the agenda to the carbonized shipping to partially offset growth in supply and support freight rates in the mid to long-term. I will now turn the call over to Xavier for his remarks on our financial results and additional comments on the market, please?\n\nXavier Destriau -- Chief Financial Officer\n\nThank you, Eli. And again welcome, everyone. On Slide 7, we present key financial and operational highlights. Our strong second quarter record first half 2022 financial performance reflects the historically high freight rates, which were significantly higher this quarter compared to the prior year period, resilient demand as well and the value of our differentiated approach.\n\nSpecifically, our average freight rates per TEU of $3,596 in the second quarter was 54% higher compared to the second quarter of 2021. During the first six months of the year, our average freight rate was 73% higher than in the first half of 2021. Our commercial strategy and our competitive positioning enabled us to identify better-paying cargo or more to TEU than that. Our carried quantities in Q2 were down 7% compared to the same period last year.\n\nLower volumes this quarter resulted primarily from continued congestion exacerbated by more congestion in the U.S. East Coast ports, which we call on our trans-Pacific trade. Over the 6 months period, our current volume was down 1%, compared to the 2% decline in market volumes in the first half of 2022. When we look at the full year, we still expect to grow our volume by 2% to 3% based on a higher operating capacity and assumed easing in port congestion going forward.\n\nOur free cash flow in the second quarter totaled $1.6 billion, compared to $851 million in the comparable second quarter of 2021, an increase of 93%. Turning now to our balance sheet, total debt increased by $1.2 billion since prior year end. The increase is -- and that is driven mainly by the increased number of vessel fixtures, long-term charter duration, as well as higher daily charter rates. In the first half of 2022, our cash position remained essentially flat even after having paid approximately $2.4 million in dividends.\n\nMaintaining flexibility in our fleet management strategy, so we can match our capacity with customer demand remains a core focus for us. The average remaining duration of our current chartered capacity is 27.7 months, slightly down from the 28.6 months in May 2022 and bridging our current operated capacity with the scheduled delivery of our chartered newbuild vessels. Also only nine of our chartered vessels are scheduled for renewal between now and the end of 2022. When we look into 2023 and 2024, 28 and 34 vessels are up for renewals, respectively.\n\nIn other words, we have a total of 62 vessels up for renewal compared to the expected delivery of 46 chartered newbuild vessels during this time period. Next, moving on to Slide 8, you can see that our earnings have continued to grow. Our net leverage has trended downward and is at 0.1 times as of June 30 this year. Moving on to the next slide, Slide 9, our differentiated and proactive approach continues to generate strong results.\n\nRevenue for the second quarter was $3.4 billion, up 44% compared to $2.4 billion in Q2 2021. Most importantly, we grew profitably with Q2 net profit of $1.3 billion, representing a 50% year-over-year increase. Adjusted EBITDA was $2.1 billion for the quarter, an improvement of 57%. Consistent with our focus on profitable growth, margins were 61% for adjusted EBITDA and 51% for adjusted EBIT.\n\nThat is to be compared to 56% and 49%, respectively, in Q2 last year. Our six months 2022 adjusted EBITDA margin was 65% and adjusted EBIT margin was 56%. These profit margins are among the highest in the liner industry and do reflect our outperformance during the first half of 2022. Margin contraction in Q2 versus Q1 was driven by higher staff costs resulting from the transition of the software to the grievance we have with the 2M, which was terminated on April 1 to our old operating capacity and also to higher end for brokering rates as well as lower average freight rate in Q2 versus Q1.\n\nMoving on to Slide 10, we carry 856,000 TEUs in the second quarter, compared to 921,000 TEUs during the same period last year. Lower volume on the trans-Pacific caused by the third and congestion on the East Coast was partially offset by growth in intra-Asia volume, another trade we see as a key focus. The growth in intra-Asia was driven primarily by the new e-commerce services we opened from China to Australia and New Zealand in the second half of 2021. Moving to Slide 11, regarding our cash flow, we ended Q2 2022 with a total cash position of $3.9 billion, which includes cash and cash equivalents and also investments in bank deposit and other investment instruments.\n\nDuring the first half of 2022, our adjusted EBITDA of $4.6 million converted into $3.4 billion cash flow from operations. Other cash flow items in the period included $248 million of net capex and $627 million of debt service. I will also remind you that during the second quarter, we distributed dividends totaling approximately $2.4 billion. Moving to our guidance, we are reaffirming our full-year guidance and are on track to deliver another year of record earnings.\n\nWe expect to generate adjusted EBITDA between $7.8 billion and $8.2 billion and adjusted EBIT between $6.3 billion and $6.7 billion. Our assumptions with respect to our guidance remain largely unchanged, except for lowering our expectations on volume growth from 5% to now 2% to 3% for the full year. Our guidance also includes the assumption that spot rate we have and that the gradual normalization in rates will continue through the second half of the year. In other words, on average spot rates in Q3 are expected to be lower compared to the other half of Q2 and the same for Q4 versus Q3.\n\nTurning to our view of the business environment, Slide 13. A combination of very strong demand, tight supply and port congestion were the main underlying drivers of freight rates reaching equity debt level in 2021 and early in 2022. We addressed [Inaudible]. Firstly, port congestion and supply chain bottleneck remains a significant challenge, especially in the United States as vessels avoided the heavily congested West Coast port and diverted cargo to East Coast and Gulf Coast ports, the queue outside those ports grew.\n\nWhile there have been some correction in port operation evidenced by the improvement of majors such as Flexport's Ocean Timeliness Indicator, 90 days of trans-Pacific, it is still double the 45 days pre-COVID level. There is today still a little expectation that port congestion will materially improve in the near future despite this correction at the ports. Drewry continues to estimate that 7% of effective capacity will be tied down in 2023 due to port congestion. Also given that port congestion is to a certain degree the outcome of landside bottlenecks, in other words, the efficiency in moving containers in and out of the port, some level of port congestion may become a lasting fixture in our industry.\n\nThis would result in the reduction of the effective capacity on the water. In the United States and elsewhere, there are signs that certain headwinds such as increased inflation and higher energy prices have resulted in softening of demand. Yet overall demand trend globally and possibly in the United States remain healthy. 2022 volumes are higher than pre-pandemic, i.e., 2019 levels.\n\nIn fact, for the first six months of 2022, volume was up 5.4% when compared to the same period in 2019. Going forward, the current inventory to sales ratio also supports this year. While it is up from lows of approximately 1.2% retail inventory to sales ratio is still below historical pre-COVID level of around 1.5%. In light of persistent congestion and landside bottlenecks, we believe that retailers cannot and will not maintain lower inventory to sales ratio compared to pre-COVID.\n\nMoving to Slide 15, starting in 2023, the outlook for the supply demand balance will also change with additional supply expected to be delivered and supply growth is anticipated to outpace growth in demand after a long period of tight supply. Yet, we believe that both short and long-term net effective supply growth may be smaller than is implied by the current order book. In 2023, port congestion will partially offset the expected 9% in supply growth, as well as possible slow steaming resulting from IMO 2023 regulation, are expected to go into effective January 2023. The growth in supply also grew above scrapping, which was essentially zero in the past couple of years.\n\nLonger term, we have indicated that the increase in order book is at least partially a response to the anticipated pressure to de-carbonized shipping and reuse aging fleet. As such, the motivation to scrap older less efficient vessels may grow resulting in lower growth in actual capacity that is currently implied by the order book. To summarize, these factors support our positive outlook on our business environment. And I also note that the recent consolidation in the industry and operationalizing also further support improved efficiencies in our industry.\n\nAnd with that, I will turn the call back for Eli -- to Eli, sorry, for his concluding remarks.\n\nEli Glickman -- President and Chief Executive Officer\n\nThank you, Xavier. Thank you. I'm incredibly proud of our team and ZIM ability to execute at the highest level and deliver on our commitment to profitable growth reflected in our second quarter and first half of 2022 performance. We generated our best ever first half-year results and are set to deliver another record year based on the guidance, which we reaffirmed today.\n\nWe believe this core strategy and key strengths will continue to serve us well as freight rates are expected to continue to gradually normalize from peak levels. We have taken proactive steps to improve ZIM commercial proposition and competitive position, both commercially and operationally. We anticipate the changing nature of the charter market and adapted our fleet strategy to secure our core fleet and reduce our dependence on the spot charter market. We entered into multiple mid- and long-term charter agreements to secure cost and fuel-efficient newbuild capacity.\n\nTo remind you, our first charter agreement for 10, 15,000 TEU vessels, which will be the largest vessel in our fleet was signed over 18 months ago. Going forward, we remain highly confident that our global-niche strategy and cost structure, strengthening of commercial prospects and investing in innovation and disruptive technologies positioned ZIM to be a top performer in our industry and deliver long-term shareholder value.\n\nElana Holzman -- Head of Investor Relations\n\nFrancy, we'll take questions now. Thank you.\n\nOperator\n\n[Operator instructions] The first question is from Sathish Sivakumar from Citigroup.\n\nSathish Sivakumar -- Citi -- Analyst\n\nI've got three questions here. So firstly, on the dividend payout ratio, right, the change in from 20% to 30%, what has actually like triggered this quarterly dividend payout ratio change given that going into H2 and then the next year, there's uncertainty around demand and also the rate as the rate starts to normalize. So could you actually explain the thought process why [Inaudible] ratio? And then secondly, on the vessel utilization, on the ships, can you give a context like that the vessel utilizations are today and this is what it used to be at the start of the year, especially out of Asia to trans-Pacific. And then the third one that's around the spot surcharges.\n\nObviously, last year, there was a big cushion of at least there's this second increase in volumes that were on spot premium surcharges. Have you actually add any spot premium volumes in Q2? And how does it actually look as we go into Q3 in terms of that part of the market? Those are my three questions.\n\nXavier Destriau -- Chief Financial Officer\n\nSathish, if I may, I will address your questions. The first one with respect to the dividend quarterly payout increase from 20% to 30%, you may remember that we, from the outset said that we intended to return significant capital to shareholders. And we have on already a couple of occasions tweak or change or updated our dividend policy. We started between 0% to 50% dividend payout once a year.\n\nThen we acknowledge that this was a bit too vague, and we wanted to clarify also for our investors our view on our market and our ability to continue to distribute dividends. So we switched from yearly to a quarterly, and we took the conservative view initially to only distribute 20% even though on a quarterly basis, even though we recommitted our intention to distribute between to 30% to 50% of our full-year net earnings. So that meant at the end of the day that we would always end up or very likely always end up with a significant higher dividend payment once a year when we release our full-year financials, if it is just only because we would catch up from 20% to 30%. As we feel confident in our ability to continue to generate quarter-after-quarter ongoing profit, then we serve there is no real reason to hold back for the first three quarters and to catch up to get to at least a 30% once a year.\n\nHence, why we've made that change today. Second, looking at taking your second question in terms of vessel utilization, up until today, most of our vessels, if not all, our vessels when we are focusing on the trans-Pacific trade lanes are sailing full. We did mention that despite the fact that this does not necessarily -- has not necessarily translated in terms of volume with the overall volume in terms of TEU that we initially expected due to congestion, but this is a congestion effect that the schedule is taking longer than anticipated, not utilization effect. So our vessels have been sailing full up until today.\n\nAnd for the remainder of the year, we are also assuming that the utilization will continue to be extremely strong. And this is why we think that we'll be able to catch up on our volume assumptions on a full-year basis because utilization will remain strong, and we will also assume some sort of easing in the current congestion or the bottleneck at the terminal at the receiving end. And the third, the way I think about our ability to add surcharges to our income, which has been a significant feature toward the end of 2021 and also to some extent during the first quarter of 2022. So this has failed clearly over the quarter, and we are not assuming that we will generate significant additional surcharge going forward.\n\nWe take the view when we talked about our guidance for 2022 on average that the rate normalization will continue albeit at a pace which is gradual, which has always been, by the way, our assumptions when it comes to the normalization agenda.\n\nSathish Sivakumar -- Citi -- Analyst\n\nI've got a couple of follow-ups, if I may. On the dividend, basically, right, why not share buyback, and that actually gives you flexibility, right, as you go into a potential downturn. Have you considered share buyback in the future? And then the second one, actually, on the volume normalization into -- for the full year. So if you look at your H1 this year versus last year, you've basically [Inaudible] proportion of volumes toward intra-Asia.\n\nSo do you expect that trend to continue and that's what would your volume recovery come through to H2?\n\nXavier Destriau -- Chief Financial Officer\n\nSo let me start with the second question that you raised. We -- yes, on the intra-Asia trade, we continue to be very active. We talked about lines that we recently opened between Southeast Asia also to Australia and New Zealand. And so we see a lot of growth -- opportunity growth on the intra-Asia trade lane and we are well-positioned to capture the volume growth in this region.\n\nGoing to your first question, why not share buyback and why dividend, we have up until today promoted returning significant dividend to our shareholders and it's good that we have and if we look at our 12 months into being a traded company, we've returned $21.5 per share to our shareholders, $2.4 billion in terms of dividend. We -- when we guide for 2022, the numbers that we are guiding suggests that they will still be more dividend to come in the future. So up until today, we have promoted returning capital to shareholders via dividend. And we continue again by updating our dividend policy in terms of interim payout that we just talked about from 20% to 30%.\n\nSo that's always a commitment that we made to the shareholders on day one, and we are delivering on that front. That doesn't mean that the share buyback is completely out of the table and until today, we haven't entertained such initiative. But the board and management will continue to always evaluate quarter after quarter what is the best avenue, the best way for us to continue to maximize shareholder value and share buyback is clearly one way to return capital to shareholders on top of the dividend.\n\nSathish Sivakumar -- Citi -- Analyst\n\nThat's quite helpful.\n\nOperator\n\nThe next question is from Omar Nokta from Jefferies.\n\nOmar Nokta -- Jefferies -- Analyst\n\nEli and Xavier, thanks for the update. Obviously, a very nice solid quarter and good to see the guidance reaffirmed, especially given spot freight rates have been coming off here the past several weeks. Having said that, some of your peers had actually been raising guidance this past -- or the past couple of weeks, this earnings season, which I think kind of set up expectations that we could see the same from ZIM. Is there anything that you could highlight that maybe separate you from the others in this respect? Is it higher relative spot exposure on the trans-Pacific or is it maybe a function of being too conservative?\n\nEli Glickman -- President and Chief Executive Officer\n\nI would like to begin. Xavier, you will comment. First is question to manage expectations. We began the year in very high expectations from 2022, and we share it with our analysts and investors.\n\nLooking on our EBITDA margin, EBIT margin the first six months, ZIM is doing and consider, let's say, one of the leaders compared to those comments and published a result. For sure, those on the Western side of the world, not by 1% or 2%. So in Q1, although it was very short time after the first guidance for the year, we increased our expectation for the year. And we set targets that 2022 will be a better year, speaking of EBITDA and EBIT bottom line compared to '21 was the best year ever for ZIM.\n\nWe believe that our responsibility is to be conservative as we seek gradual normalization of the rates, mainly in the trans-Pacific on the freight rates. So we would like to reaffirm our guidance for the year in the same -- this is real target for ZIM to deliver best result. Compared to the company that you spoke about, they have decided to begin the year with low expectation, mainly for the second half of the year, and they improved the guidance from the beginning low guidance. Xavier?\n\nXavier Destriau -- Chief Financial Officer\n\nNo. I think we need to look at things, Omar, in absolute terms when you look at things in absolute term, related to our size, we are a smaller company than some of the larger major players. Those are the ones you are referring to. Our operating capacity is less than 500,000 TEU to be compared to the other ones.\n\nAnd if you were to do a comparison in terms of EBIT per TEU that is being operated, you may come to a very different conclusion with respect to the relative performance of a liner versus another one.\n\nOmar Nokta -- Jefferies -- Analyst\n\nThat's helpful, and I appreciate those comments. And I guess maybe just about volumes, you've mentioned, I think, Eli, that you've taken the fleet up to 149 vessels. Volumes have been flattish here the past three or four quarters. How should we think about volumes going forward? You were thinking 5% growth before.\n\nNow it's maybe 2% to 3%. So far in the third quarter, are you seeing higher volumes that give you maybe some confidence that we are going to see a bounce here in volumes? Or is it still more of an expectation as we proceed to the rest of the year?\n\nXavier Destriau -- Chief Financial Officer\n\nNo. No. We clearly expect to deliver on increased the volume of carried quantity into Q3. For many reasons, again, it is not that the vessels have been not selling full over the past quarter.\n\nIt's been more that there's been there -- those issues in terms of congestion. And we think we'll need to go hand in hand, if we assume that the rate -- the freight rates will continue to normalize, it is -- it has to go with the -- also from a landside perspective aspect of things, that congestion should start to ease significantly because if that doesn't happen, then the scenario or the underlying assumption that freight rate will normalize might be challenged. So if we are taking the conservative view or the reasonable view on the freight rate level, then we also need to assume that we will be less penalized in terms of tariff quantity by the congestion. So that's one.\n\nSecond is also when we look at the capacity that we are operating, we are also taking delivery of more vessels in the third and fourth quarter. We are going to be taking delivery of a large capacity vessel as well that are going to be entering into Asia, U.S. East Coast, ahead of our big transition next year, which is around the corner, where we will start getting the first 15,000 TEU LNG vessels that will be delivered to us in February. So that's really a combination of us operating more capacity, if you will.\n\nAnd second, assuming that the congestion will ease and will improve, therefore, allowing us to move more and more cargo and therefore, increase our tariff quantities.\n\nOmar Nokta -- Jefferies -- Analyst\n\nGot it. And just final one on the new buildings, the 46 that are coming on starting next year that are going to be vastly much more fuel efficient. In terms of your existing footprint, how do you see these newbuildings joining dozen fleet. Theoretically, you have 149.\n\nIs it simply 46 come out of the existing chartering fleet and you bring in these new 46, so your overall fleet size stays the same? Or do you expect to add some of these a bit more permanently? And I guess that's sort of -- that's like the one question. The other one I have is on that, have you done sort of an analysis? Or are you willing to give maybe what these newbuildings will look like on a ship-by-ship basis? So if we were to replace ships on a one-to-one basis in terms of TEU cost, are you able to get how much they would reduce your unit cost by? I know that was a bit of a jumble question, but simply what does your cost go down by if you were to assume all 46 newbuildings come in and replace 46 existing ships that are currently in the fleet?\n\nEli Glickman -- President and Chief Executive Officer\n\nPresident & CEO The answer is not that simple because starting with the beginning of your question, we are not planning on replacing ship by ship. So we have, indeed, those 46 newbuildings that are coming our way for which we are committed to, and we are eagerly awaiting this capacity. And if we look at the vessels that out of the 140 container vessels that we operate today, we have 62 vessels that we cover for renewal over the same period. And we will decide whether we want to let those some or all of that capacity, depending on our reading of the market and whether we see options for us to grow or enter it into new trade lane.\n\nSo the determination will be made as we go. And as we are today, I'm sure you would assume that we are preparing for 2023. We are in the budget season as far as in those, so we are already looking into 2023, what is the fleet plan, what are the trade lanes that we intend to continue to grow in exit, enter. So this is very much in the process as we currently speak.\n\nSo it's not going to be one for one. And to give you an example, the first series of 15,000 TEU vessels, so the 10, 15,000 TEU vessel will clearly be deployed on our Asia, U.S. East Coast trade, the [Inaudible] line, all of them, and they will replace vessels that are currently of a capacity of between 9,000 to 10,000 TEUs. What we do with this capacity of 9,000 to 10,000 TEUs? We might trade some of that capacity into other trades, be it on the P&W, for example, or on a second stream on Asia to the Gulf or to the U.S.\n\nEast Coast. We are looking into that. This is also a discussion that may take place with our partner. As we know, we jointly operate with Maersk and MSC, our trans-Pacific trade base.\n\nSo there is a lot of potential scenario that may unfold, which will lead to a different conclusion when it comes to our fleet plan going forward. What we wanted to make sure is that we have the option to grow, not the obligation to grow. And that's very important in terms of fleet planning. The fact that as we committed to those policies newbuilding, that we have the ability to redeliver a significant portion of our current capacity going forward.\n\nOmar Nokta -- Jefferies -- Analyst\n\nThat optionality is key. I'll leave it there.\n\nOperator\n\nThe next question is from Sam Bland from J.P. Morgan.\n\nSam Bland -- J.P. Morgan -- Analyst\n\nI have two, please. The first one is, could you talk about, I think, the change in the 2M relationship started at the beginning of April. Could you talk about to what extent that increased your unit cost quarter on quarter, please? And the second question is I think you talked about in the opening remarks that maybe in the last few weeks, spot rates have been coming down quite sharply. I can't view, if anything, congestion seems to be possibly getting worse on a global basis.\n\nAnd I don't think demand is falling that quickly. I guess I'm interested in why you think spot rates are coming down so sharply given those two factors?\n\nEli Glickman -- President and Chief Executive Officer\n\nThank you, Sam. The first question with regards to the change in the relationship of the corporation, the partnership with the 2M, you're correct that we entered into this new network on -- or the changes were effective as of the 1st April this year. So in the first quarter, we were a net slot buyer from our partners who were jointly operating their capacity. But at the end of the day, we were also, in addition, buying slot from our partners, Maersk and MSC on the trans-Pacific trade lane and on the Asian market.\n\nAs from the 1st of April this year, we shifted completely to a full slot agreement, meaning that we are no longer buying any slots from Maersk and MSC and we are purely exchanging capacity on the vessels that we jointly operate on the trade that we continue to operate, which are mainly the Asia, U.S. East Coast and the Asia to the U.S. Gulf Coast. So as a result, what happened, we -- as you've seen that we anticipated that change in the collaboration in terms of the structure of the collaboration.\n\nSo we have to begin additional capacity in order to continue to be able to operate a similar tonnage at the end of the day. So that's what I've explained to some extent, the increase in vessels that we are operating today versus what we are operating a few quarters back. And in terms of -- and -- so we saw those vessels from the market at rate that obviously where the prevailing rates that tonnage providers were commending and that's where it's quite a different from the slot rate that we were purchasing from our partners. So in terms of impact, it's not easy to quantify but it's in a region, I would say, of a $100 million.\n\nSecond on the -- on your question with respect to the rate dynamic and why you need that we are assuming that the normalization of the rate of the spot market might continue to slide with the already experience already throughout the second quarter. How is that possible if indeed the congestion continue to be there or to worsen? You're right. This is -- there's a lot uncertainty ahead of us and it might ended in a different scenario. What we are just hearsaying is that it is -- we think it needs to go hand-in-hand if we assume continued normalization in the freight rate.\n\nThen at some point, congestion should ease. Otherwise, we would be in a situation which would be quite awkward where there would be no real reason to justify the rate adjustment. So that's why we are making that assumption. If we were to be wrong in the assumptions with respect to the easing in the congestion, it is very possible as the demand is still strong.\n\nIt's not as strong as it used to be. Let's be clear. There are signs of weakening in demand as well and that maybe weighed significantly in the explanation of why the rates are starting to normalize. But the demand is still there compared to pre-pandemic level, we are still very resilient.\n\nRemembering that last year was extremely strong. So when we compare year over year, yes, there might be signs of weakness but it's still a strong market. So that's an assumption we are making. We're thinking it's a reasonable one.\n\nThere might be other scenarios at the end of the day, we'll see which is which.\n\nOperator\n\nThe next question is from Alexia Dogani from Barclays.\n\nAlexia Dogani -- Barclays -- Analyst\n\nI also have three. Just firstly, on kind of recessionary scenario. Can you just kind of explain to us what kind of flexibility you have to adjust the network? And should you need to, I guess, kind of the reference of the number of vessels expiring would be helpful. Then secondly, am I correct in picking up that Eli, in his comments mentioned that you are reducing your spot exposure and you're entering in more contract agreements? If that's right, can you give us a rough indication of how spot versus contract is evolving? And then finally, in terms of the alliances and kind of the pros or cons of joining an alliance, have you -- is that a possibility or what do you think?\n\nXavier Destriau -- Chief Financial Officer\n\nThe -- with respect to your first question, what are the tools or what could we do in case of a prolonged recession beyond, I guess, your question is that even beyond the 2022 and 2023 and then maybe '24. The flexibility for us is key and critical, and we have 28 vessels that they will cover for renewal in 2023. So if we were to end up in a situation where the global economy is entering into a prolonged recession and as a consequence, in demand on the trade where we operate was to significantly drop, then we would obviously not renew those charters. We also have in 2024, another 34 vessels that will come up for renewal.\n\nWhat is very important because then you might say, but yes, but you have the 46 vessels that are coming in over the same period. What is very important, I think, for us to emphasize is that those vessels, yes, they are green and they are brand new. But as a result, they meet our ESG strategy and commercial positioning. That's one.\n\nBut also very importantly, when it comes to operating and the cost of operating those vessels, the charter costs that we will be paying for each of those brand new vessels, they are going to be far more competitive than the last vessels that we fixed in the spot charter market that, as we know, were very hot -- has been very hot for the past few quarters and that had some effect on our cost structure. So what it means, it means that as we enter into 2023 and every month when we set delivery of one of these brand new vessels, our cost of operation per TEU of stock costs will go down compared to the current cost of operation of the company. The second question you asked whether we were changing the mix between the contract and spot. No.\n\nWe are still where we were last quarter. You know that on the trades where we operate mainly, the trans-Pacific trade lane is the trade that is subject to a long-term contract discussions with the customers, the split orders for this year. We finalized those discussions toward the end of April for the new rates to kick in as of the 1st of May. We have concluded secured 50% of our volume on our trans-Pacific trade lane with the contract customers.\n\nWe are still remaining exposed to spot at 50%. What Eli was referring to is, today, the current situation is, by and large, spots and contracts are paying the same amount, so it doesn't make much of a difference for us to load a container that is on contract or the container that we source from the spot market. That is the two others today. And the last question that you raised with regards to alliances.\n\nFor them, the partnership that we entered into in 2018 with Maersk and MSC has been extremely beneficial to us, but not only to us, by the way. I think it has been extremely beneficial also to our partners, which is very important in a partnership. It has to be a win-win combination for it to last. And all parties have enjoyed significant improvements in the network, significant cost savings opportunity.\n\nAnd that's why this collaboration has lasted up until today. It is -- for us, we continue to always keep on evaluating our options in terms of partnering with an alliance or with a liner because on top of our partnership with the 2M on the trans-Pacific trade, we also have a partnership agreement or VSA agreement, Vessel Sharing Agreement with Maersk and MSC, by the way, separately from those trade lanes where we operate with the 2M, that we operate with the 2M. Same goals on the intra-Asia region where we partner with a lot of also a smaller shipping there. So this dynamic of sharing space at the end of the day and sharing operating capacity is a feature, I think, of our industry, which is -- and has brought a lot of benefits to the liners.\n\nAnd at the end of the day, I think a lot of benefit to the end customer as well, has allowed for the shipping industry to deliver improved input service at a lower cost.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nElana Holzman -- Head of Investor Relations\n\nEli Glickman -- President and Chief Executive Officer\n\nXavier Destriau -- Chief Financial Officer\n\nSathish Sivakumar -- Citi -- Analyst\n\nOmar Nokta -- Jefferies -- Analyst\n\nSam Bland -- J.P. Morgan -- Analyst\n\nAlexia Dogani -- Barclays -- Analyst\n\nMore ZIM analysis\n\nAll earnings call transcripts"
}