{
  "companyName": "Broadcom Ltd",
  "companyTicker": "AVGO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/broadcom-ltd-avgo-q3-2022-earnings-call-transcript/",
  "content": "Broadcom Ltd (AVGO 0.24%)\nQ3 2022 Earnings Call\nSep 01, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to Broadcom Inc.'s third quarter fiscal year 2022 financial results conference call. At this time, for opening remarks and introductions, I would now like to turn the call over to Ji Yoo, head of investor relations of Broadcom, Inc.\n\nJi Yoo -- Head of Investor Relations\n\nThank you, Sheri, and good afternoon, everyone. Joining me on today's call are Hock Tan, president and CEO; Kirsten Spears, chief financial officer; and Charlie Kawwas, president, Semiconductor Solutions Group. Broadcom distributed a press release and financial tables after the market closed, describing our financial performance for the third quarter of fiscal year of 2022. If you did not receive a copy, you may obtain the information from the Investors section of Broadcom's website at broadcom.com.\n\nThis conference call is being webcast live, and an audio replay of the call can be accessed for one year through the Investors section of Broadcom's website. During the prepared comments, Hock and Kirsten will be providing details of our third quarter fiscal year 2022 results, guidance for our fourth quarter, as well commentary regarding the business environment. We'll take questions after the end of our prepared comments. Please refer to our press release today and our recent filings with the SEC for information on those specific factors that could cause our actual results to differ materially from the forward-looking statements made on this call.\n\nIn addition to U.S. GAAP reporting, Broadcom reports certain financial measures on a non-GAAP basis. A reconciliation between GAAP and non-GAAP measures is included in the tables attached to today's press release. Comments made during today's call will primarily refer to our non-GAAP financial results.\n\nI'll now turn the call over to Hock.\n\nHock Tan -- President and Chief Executive Officer\n\nThank you, Ji, and thank you, everyone, for joining today. I feel -- we feel somewhat surreal here with what I'm about to report and go through in my screen. Let me start by saying while consumer IT hardware spending has been reported to be weak, very weak, from our vantage point, infrastructure spend is still very much holding. In our fiscal Q3 '22, consolidated net revenue was a record $8.5 billion, up 25% year on year.\n\nSemiconductor solutions revenue increased 32% year on year to $6.6 billion. And infrastructure software revenue grew 5% year on year to be $1.8 billion. In Q3, our semiconductor business was robust, with solid contributions from all our end markets. Cloud and service provider growth remained strong and, in Q4, is actually expected to accelerate year on year, driven by data center build-outs and infrastructure upgrades.\n\nYear on year, enterprise continued to grow for the sixth consecutive quarter on campus deployments and data center refreshes. Looking at Q4, we expect enterprise to continue to grow double-digit percent year over year. Meanwhile, in wireless, which is very much tied to our large North American handphone OEM, it was solid in Q3 and is expected to grow in Q4 as we ramp the new platform. Now, let me provide more color by end market, starting with networking.\n\nNetworking revenue was a record $2.3 billion and was up 30% year on year, representing 35% of our semiconductor revenue. As both cloud and enterprise data centers refresh, they continue to increase adoption of our Tomahawk, Trident, and Jericho switching silicon platforms. Importantly, we expect this trend to continue. In mid-August, Broadcom announced the Tomahawk 5 switch series, providing 51.2 terabytes per second of Ethernet switching capacity in a single monolithic device, double the bandwidth of any other switch silicon available in the market today.\n\nWe also announced the industry-first silicon photonics co-package with the Tomahawk, which will enable a new benchmark for low power and extend our leadership and innovation in hyperscale data centers. Networking remains strong given these drivers. And in Q4, we expect this segment to be up 30% year over year. Next, server storage connectivity revenue was a record $1.1 billion or 17% of semiconductor sales as growth of 70% year on year exceeded our expectations.\n\nA primary driver remained the growth of our next-generation server storage connectivity, where we benefited from high content and continued deployment of servers and storage in both cloud and enterprises. We anticipate this strong trend to actually continue. And in Q4, we expect server storage connectivity revenue to grow about 45% year on year. Moving on to broadband.\n\nRevenue of $1.1 billion grew 20% year on year, in line with our expectations and represented 17% of semiconductor sales. This steady growth was driven by major service provider continuing to deploy next-generation broadband fiber to the home globally with high attach rates of WiFi 6 and 6E. We are the industry leader in investing in the next-generation WiFi 7 and unlocking amazing wireless experiences across home gateways, enterprise access points, and smartphones. And we expect first deployments to occur in the second half 2023.\n\nIn Q4, we expect our broadband business to grow above 20% year on year. Finally -- next, moving to wireless. Q3 revenue of $1.6 billion represented 25% of our revenue in semiconductors. Sustained demand from our North American customer drove wireless revenue up 14% year on year, in line with our guidance.\n\nIn Q4, we expect wireless revenues to be seasonally up 20% sequentially and grow 10% year on year. Finally, Q3 industrial resales of $244 million declined 4% year over year, reflecting weakness in China, partially offset by continued strength in the U.S. and Europe. Nonetheless, for Q4, we forecast industrial resales to rebound to high-single-digit growth year on year.\n\nIn summary, Q3 semiconductor solution revenues was up 32% year on year. In Q4, we expect semiconductor revenue to remain strong at 25% year on year. Now, putting this in perspective and if we look at it on a sequential basis, Q3 grew 6% as did Q2, and Q4 will grow another 6%, largely driven by the seasonality of wireless. Turning to software.\n\nIn Q3, infrastructure software revenue of $1.8 billion grew 5% year on year and represented 22% of total revenue. In dollar terms, consolidated renewal rates averaged 128% over expiring contracts. And for strategic accounts, we averaged 140%. Within these strategic accounts, annual bookings of $461 million include $136 million of cross-selling of our portfolio of products to these core customers.\n\nNow, 95% of our renewal value represented recurring subscription and maintenance. And just to put all this in context, over the past 12 months, consolidated renewal rates averaged 122% over expiring contracts. And within strategic accounts, we averaged -- we actually averaged 137%. Because of these trends, our ARR and the indicator of forward software revenue at the end of Q3 was $5.5 billion, which was up 5% from a year ago.\n\nAnd in Q4, we expect our infrastructure software revenue to sustain around mid-single-digit percentage growth year over year. In summary, therefore, we're guiding consolidated Q4 revenue of $8.9 billion, up 20% year on year or 5% sequentially. Now, before Kirsten tells you more about our financial performance for the quarter, let me provide a brief update on our pending acquisition of VMware. We're making good progress with our various regulatory filings around the world.\n\nWe have an excellent team focused on these efforts, and we are moving forward as very much as expected in this regard. We continue to expect the transaction to be completed in Broadcom's fiscal year 2023. We remain excited about our acquisition of VMware and continue to be impressed by the world-class engineering talent, as well as strong customer and channel partnerships. We have tremendous respect for what VMware has built.\n\nAnd together, we will enable enterprises to accelerate innovation and expand choice by addressing the most complex technology challenges in this multi-cloud era. And with that, let me turn the call over to Kirsten.\n\nKirsten Spears -- Chief Financial Officer\n\nThank you, Hock. Let me now provide additional detail on our financial performance. Revenue was $8.5 billion for the quarter, up 25% from a year ago. Gross margins were 76% of revenue in the quarter and up 80 basis points year on year.\n\nOperating expenses were $1.2 billion, up 8% year on year, driven by investment in R&D. Operating income for the quarter was $5.2 billion and was 32% from a year ago -- was up 32% from a year ago. Operating margin was 61% of revenue, up approximately 320 basis points year on year. Adjusted EBITDA was $5.4 billion or 63.5% of revenue.\n\nNote that this figure excludes $129 million of depreciation. Now, a review of the P&L for our two segments. Revenue for our semiconductor solutions segment was $6.6 billion and represented 78% of total revenue in the quarter. This was up 32% year on year.\n\nGross margins for our semiconductor solutions segment were approximately 72%, up 220 basis points year on year, driven by favorable product mix and content growth in next-generation products across our extensive product portfolio. Operating expenses were $853 million in Q3, up 9% year on year. R&D was $765 million in the quarter, up 10% year on year. Q3 semiconductor operating margins increased to 59%.\n\nSo, while semiconductor revenue was up 32%, operating profit grew 44%. Moving to the P&L for our infrastructure software segment. Revenue for infrastructure software was $1.8 billion and represented 22% of revenue. This was up 5% year on year.\n\nGross margins for infrastructure software were 90% in the quarter and were stable year over year. Operating expenses were $375 million in the quarter, up 4% year over year. Infrastructure software operating margin was 70% in Q3, and operating profit grew 5%. Moving to cash flow.\n\nFree cash flow in the quarter was $4.3 billion, representing 51% of revenue. We spent $116 million on capital expenditures. Days sales outstanding were 29 days in the third quarter compared to 30 days a year ago. We ended the third quarter with inventory of $1.8 billion, up 10% from the end of the prior quarter, in large part due to higher material costs and the expected sequential revenue ramp.\n\nWe ended the third quarter with $10 billion of cash and $39.5 billion of gross debt, of which $304 million is short term. Turning to capital allocation. In the quarter, we paid stockholders $1.7 billion of cash dividends. Consistent with our commitment to return excess cash to shareholders, we repurchased $1.5 billion in common stock and eliminated $292 million of common stock for taxes due on vesting of employee equity, resulting in the elimination of approximately 3.2 million AVGO shares.\n\nThe non-GAAP diluted share count in Q3 was 436 million. In Q4, we expect the non-GAAP diluted share count to be 435 million, which excludes the potential impact of any share repurchases completed in the fourth quarter. We have not repurchased any of our shares since we announced the pending acquisition of VMware as repurchases are subject to regulatory rules. We maintain our commitment to return excess cash to shareholders, including buybacks, as soon as we can under SEC rules.\n\nBased on current business trends and conditions, our guidance for the fourth quarter of fiscal 2022 is for consolidated revenues of $8.9 billion and adjusted EBITDA of approximately 63% of projected revenue. That concludes my prepared remarks. Operator, please open up the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question will come from Ross Seymore with Deutsche Bank. Please go ahead.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nHey, guys. Thanks for letting me ask you a question. Hock, you started off your preamble talking about the disconnect between some of the macro data points on the consumer side versus the infrastructure side. Obviously, you have a limited exposure on the consumer side of things.\n\nBut in the networking broadband server, the enterprise and cloud businesses in general, are you seeing any changes? Because it's really hard for, I think, investors and even myself to reconcile the fact that everything is fine for you despite the macro data points seemingly are worsening for many of your peers.\n\nHock Tan -- President and Chief Executive Officer\n\nWell, no. The short answer is no. And by that, this is what I mean. And this is something I've been talking about -- we've been talking about in the earnings call and in sell-side analyst calls about true demand.\n\nWhat we are mentioning, what we are reporting revenues is in our minds, and we've been looking at it that way the past eight quarters, particularly, as we told you. We scrub through our backlog thoughtfully, carefully before we deliver products to customers, end users, is that that's true end demand. And what we reported to you today, and you see the numbers that we're presenting and the strength of the numbers, if I could say so myself, it's true end demand what we're seeing with respect to the various end markets and the infrastructure products we sell to -- into those end markets. That's as far as we can scrub through true end demand.\n\nNow, we also have a ton of backlog, and our lead time continues unchanged at 50 weeks. Now, whether bookings that are placed today are running at somewhat different thoughts, different rates, it's more a function of perception, psychology of customers trying to think one year out. But as far as what we reported in Q3 and expect to see in Q4, we believe to be true end -- we believe, and we're pretty clear about that, to be true end demand and consumption by our customers.\n\nOperator\n\nThank you. One moment for our next question. And that will come from the line of Stacy Rasgon with Bernstein Research. Please go ahead.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nHi, guys. Thanks for taking my question. I just wanted to follow up on that, I guess, Hock. So, I understand you guys are thinking you're shipping to true demand, but it feels like if this was the actual true demand situation that everybody was facing, that everybody else would feel stronger than they seem to be.\n\nSo, I guess -- I don't know what else you can say about trying to help us square that circle. But I guess, what gives you confidence that what you actually are seeing is indeed true demand? I guess the whole thing about trying to ship and pass your orders and everything else, but you don't think it's possible that your customers could be gaming you even within -- ever all the actions that you're taking? I guess just what kind of confidence, if anything, can investors get around that statement that you think you actually are shipping to true demand?\n\nHock Tan -- President and Chief Executive Officer\n\nWell, I mean, we put in a lot of checks and balances hugely before we put products out on aircraft or trucks to our customers. And we have been doing this now for two years. So, we're pretty good at doing it. And the question earlier answered -- asked by Ross was, have you seen any particular change in all that? In terms of consumption of our products, and I can only obviously talk about our products, and I can talk beyond our products, no, we don't see that.\n\nOperator\n\nThank you. One moment for our next question. That will come from the line of Vivek Arya with Bank of America. Please go ahead.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nSo, thank you. I just wanted to clarify and then ask a question. Hock, I just wanted to clarify if any of your products are directly or indirectly exposed to any China restrictions that have been in the press over the last handful of days. And then, Hock, I wanted to ask the growth question in a different way, which is, in the past, you described a sustainable kind of mid-single-digit growth rate for Broadcom.\n\nIs that still a good framework to use as we are looking out at the next year or so? Or if you could give us maybe by end market, hyperscaler versus enterprise versus telco or consumer, which markets just conceptually you would expect to kind of grow better or slower than that kind of broad growth rate for the company?\n\nHock Tan -- President and Chief Executive Officer\n\nThat second question is a very interesting question, but let me take care of the first. No, we have not been notified. None of our products are affected by any action that have occurred over the last week or a few days regarding restriction on shipments of China. We have not been affected, period.\n\nAnd we do not expect to be, OK? Now, in terms of what you're saying, now that calls for some degree of speculation, but it's more than that. I've always said the long-term sustainable demand in the semiconductor space is a mid-single-digit compounded growth rate, 5%, thereabout maybe 6%, 5%, 6%. And I still believe that no matter what all the -- I mean, the hubris, that marketing hubris that has occurred over the past 12 months, it always has been, and I think we will revert to that norm, eventually. Now, obviously, it's very interesting what we're seeing because it depends on when you start that compounded growth because 5% is what I said to be a long-term growth rate.\n\nIn the short term in this industry, and we've all experienced these cycles, you could have higher than 5% at the upcycle and clearly much lower in the down cycles to average that 5%. But your point is at some point, we'll have to get back to the norm. And I believe we will, not in this year, '22. The rate '22 is growing.\n\nNow, we -- assuming our forecast Q4 comes to play. We're talking about semiconductor growth rate for us of around 25% year on year. And that's way above the 5% norm. So, at some point, yes, things will turn around and revert back to that norm.\n\nNow it may take a couple of years before I get there.\n\nOperator\n\nOne moment for our next question, and that will come from the line of Harlan Sur with J.P. Morgan. Please go ahead.\n\nHarlan Sur -- J.P. Morgan -- Analyst\n\nHi. Good afternoon. Thanks for taking my question. You know, back in April, you guys did this really nice teaching of your customs look in ASIC business.\n\nAnd the business has been growing at a 20% CAGR over the past few years. You've got a pipeline of over 70 programs at 7, 5, and 3 nanometers. And then specifically, Hock, in your compute offload, right, you got some really nice programs like GPU, [Inaudible] video transcode. Is the team still on track to drive $2 billion in compute offload ASIC revenues this year? And then just given the strategic nature of these ASIC programs to your customers' future initiatives, like will this segment hold up better in a weaker macro environment, let's say, next year?\n\nHock Tan -- President and Chief Executive Officer\n\nWell, to answer your first question, yes, we're on track for this year to hit that $2 billion. We told you that, and we're getting there. As far as does this particular compute offload defy gravity, I don't know. I can't really answer that.\n\nI'd like to believe it's emerging, and it's a very emerging business. And so, like, all emerging business that have hit some level of critical mass as it appears to have in our case, it may pull up somewhat better than perhaps enterprise, as we are seeing. And so, you're not wrong in that regard. But that is actually calling for some level of speculation on our part because, I mean, in more than '23, right? I'm looking at '23, '24, '25, next three years, will it hold up better? That, I don't know the answer.\n\nFor '23, sure, it will hold up better.\n\nOperator\n\nAnd one moment for our next question. That will come from the line of Timothy Arcuri with UBS. Please go ahead.\n\nTimothy Arcuri -- UBS -- Analyst\n\nHi. Hock, I was wondering if you could update us on the semi's backlog number. I think it was $25 billion last call, which was a little bit more than a year. Can you update us on that backlog number? And then also within that, have you seen any movement in the backlog? I mean, I know probably, it's up.\n\nBut have you seen any customers cancel or push out? I mean, obviously, that was more than offset by incoming bookings, it sounds like. But sort of what's the fluidity within that backlog? Thanks.\n\nHock Tan -- President and Chief Executive Officer\n\nWell, as to clarify the first couple of points, our backlog and our terms are very clear. We do not allow cancellation on our backlog. We have not seen that and -- to answer your second question. And on the first part, keep in mind, our revenue continued to grow each quarter sequentially as our backlog continues to build up.\n\nAnd compared to the preceding quarter, our backlog at the end of Q3 increased to $31 billion. So, we are still shipping below our booking rate.\n\nOperator\n\nAnd one moment for our next question. That will come from the line of William Stein with Truist Securities. Please go ahead.\n\nWilliam Stein -- Truist Securities -- Analyst\n\nThank you for taking my question. Hock, sometimes, we forget that historically, we've been at an ASP eroding sort of industry at least on a like part-for-part basis. So, I know the mix changes over time, but I think that's changed significantly in the last year and a half or so. I'm wondering whether you're seeing that dynamic continue or revert and if you can comment as to how that influencing margins.\n\nYou're getting such tremendous contribution margins in the semi business. I would have to think pricing is playing some part in that. Thank you.\n\nHock Tan -- President and Chief Executive Officer\n\nActually, it isn't. I said that before in the previous earnings -- a couple of earnings calls. It's worthwhile for me to repeat. We have been able to raise prices, obviously, over the last past 12 months, but only because our material cost has gone up.\n\nAnd so, we're talking -- if we're talking percentages, not absolute dollars, if our cost -- material cost -- cost of goods sold, so expect increase 10% in order to keep our margin in percentage terms from being diluted with the raise the price no less than 10%. And just doing that, it's just staying -- it's just keeping the gross margin in percentage term staying neutral. So, I would say price increases has very little impact on our margin improvement. What is -- what has enabled our margins to accelerate or improve, as I said in the last earnings call, is in this environment of -- in some degree in the last couple of years -- last 12 months, in particular, of basically a pent-up level of spending, particularly in enterprise, somewhat in cloud as well and broadband as well, is the adoption of new next-generation products and technology.\n\nAnd that always enhances, as I've said that before, our gross margin. And it's just -- it's the basic fundamental of this semiconductor cycle. New generation of products improves, expands our gross margin. And the accelerated adoption is what expands this gross margin.\n\nAnd that's pretty much what has been the case here, but not price increase per se.\n\nOperator\n\nAnd one moment for our next question. And that will come from the line of Aaron Rakers with Wells Fargo. Please go ahead. Mr.\n\nRakers, your line is open if you would like to ask a question.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYeah, yeah. Thanks. Appreciate you taking the question. I wanted to ask about the wireless segment.\n\nYou know, solid results just last quarter. It sounds like you're guiding 20% sequential growth into this current quarter. But if I look back over the past couple of years, it's actually been solidly above the 20% sequential growth rate. So, I guess how are you thinking about the demand profile there? And I guess with that, your content expansion opportunity as we look at the next-generation product cycle going forward.\n\nThank you.\n\nHock Tan -- President and Chief Executive Officer\n\nOK. You know, it's -- on the wireless business, if I could try to clarify, when we take any particular three-month period like Q3 and going to be Q4 now and take a snapshot of it and compare it to the same period of time a year ago, it never quite replicate itself in all matters. In other words, it's not -- there's no normalization. So, it could be 20%.\n\nIt could be 25%. It could even be 30% changes. And I consider that all kind of in the same ballpark, simply because all it takes is a slippage of a couple of weeks in shipments in products being taken to make that particular difference. So, I would not put too much thinking behind that is 20% whereas it might have been closer to 30% two years ago or a year ago in the same period, if you don't mind, simply because nothing comes up so as to be solid plan year over year.\n\nIt changes. But in terms of overall volume, we do not see that much units dramatically different from a year ago. It's really the content increase that might give us the lift year upon year. And even on a lift year-on-year quarter when you compare to any three-month period, take it with a grain of salt that some volume might have shifted forward not be within these months.\n\nBut it's kind of in the ballpark.\n\nOperator\n\nOne moment for our next question. And that will come from the line of Harsh Kumar with Piper Sandler. Please go ahead.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nYeah. Hey, guys. First of all, congratulations for reporting, you know, very good guidance, very good results in such a turbulent market. Hock, I wanted to ask a quick one and then a main question.\n\nThere's been a lot of concerning sort of news coming out of China reported by company. So, I was curious, first of all, how much exposure do you have to China? And then for my main question, it's a question of sustainability. Somebody asked about revenues, but I wanted to ask about gross margins. You've got 90% odd margins in software that I think is the norm, but then you've got 72% gross margins in semis, which are sort of honestly abnormal compared to other companies.\n\nSo, when you think of sustainability of that semi business up in the 70s, what do you think are some of the drivers that keep it up there for you guys longer term?\n\nHock Tan -- President and Chief Executive Officer\n\nOK. Let me answer the second question first since it's a little more complex. But it isn't. Our semiconductor gross margin, by the way, we talk about sustainability, I would say it keeps expanding.\n\nIt doesn't stay still, as you probably know. If you look back to five years ago, we were more like 60% -- in the mid-60s or low 60s gross margin. Today, it's now over 70%. And it's simply the case that -- and that's the beauty of the semiconductor technology business.\n\nYou always have new generation of products, whether it's wireless, running -- creating a generation every 12 to 24 months, whether it's switching, that's every two, three years, our storage, every for five years. And every time you put in a new generation, you expand your margin because you're delivering more value, you're delivering much more value usually, and you are able to extract from the higher value a higher price and profitability. And that's the beauty of this industry. So, as we keep coming out with new generations, the margins of our portfolio keeps expanding.\n\nSo, we're now at the 70s. And you ask where will we be five years from now in this phenomena of constantly updating to next-generation products, I will see this gross margin expansion continuing. And empirically -- don't ask me for any mathematical formula behind -- physics behind it. But empirically, given our portfolio of about 16 semiconductor franchises, we have averaged close to 50 to 100 basis points expansion year after year.\n\nAnd that's pretty good, and we see that trend continuing. And as I responded to an earlier question, over the last two years, we've -- the rebound you might almost think -- feel by perhaps changes in IT spending based on, I guess, lockdowns, based on behavioral changes with COVID-19, we've seen accelerated adoption of next-generation products in many of our franchises. So, we have seen some level of accelerated expansion of our semiconductor gross margin. But things will revert back, my belief, to a more normalized 50 to 100 basis point expansion once all this excitement starts cooling off a bit, but we still see the sustainable expansion of our semiconductor gross margin.\n\nSoftware, you're right, we cannot stick there at 90%, and we're not going anywhere with it. But this -- but semiconductor will continue to expand. And last -- your first question, China, that's about 13% of our semiconductor revenue. That's our exposure to China.\n\nOperator\n\nOne moment for our next question. That will come from the line of Vijay Rakesh with Mizuho. Please go ahead.\n\nVijay Rakesh -- Mizuho Securities -- Analyst\n\nYeah. Hi, Hock. Just two questions here again. Sorry.\n\nOn the enterprise storage side, I saw you guys had a pretty good quarter guide. Just wondering what your exposure was between consumer and enterprise. And what are you seeing in terms of that strength going forward? And also, just my second question on the VMware side. I know you said you're still expecting that to close in fiscal '23.\n\nCan you give us some color? Have we gotten most of the approvals? Are you waiting on some, where that stands? Thanks.\n\nHock Tan -- President and Chief Executive Officer\n\nOK. Well, in terms of a breakdown, you're basically asking me -- asking us on our semiconductor revenues, what's our breakdown of our revenues? We would classify three ways, three groups, non-end markets, but groups. It cuts across all our end markets, except probably wireless. Wireless is on consumer.\n\nAnd so, no surprise, our consumer business within semiconductor represents about 23% -- just less than 25% of our revenues, just over -- between 20% to 25% is the best description. And on the balance, which could be anywhere from 75% to almost 80% is almost split evenly between enterprise, traditional enterprise, as we call it, and the final grouping we call as service providers, which is relate to the hyperscale guys and telcos, which we consider to be service provider. And that's -- and so between traditional enterprise and telcos, hyperscale, that's evenly split. Consumer, 20% to 25%.\n\nAs far as the regulator process through VMware, right now, I would say, when you think of it, and we're thinking it across several -- a few -- a couple of jurisdictions. And we're moving -- it's making good progress. And just to reiterate, and we fully expect to close on this within fiscal '23.\n\nOperator\n\nAnd one moment for our next question. That will come from the line of Joseph Moore with Morgan Stanley. Please go ahead.\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. With regards to the 50-week lead times that you talked about, what is your goal there over the next, say, 12 months? Do you want to get that down? And to the extent if you do want to, kind of what has to happen from the standpoint of foundry substrates, things like that, to get that number lower?\n\nHock Tan -- President and Chief Executive Officer\n\nI don't know. We haven't thought that hard about it, yes, seriously, Joe. No. I kind of like the 50-week lead time, to be frank, because it gives us great visibility.\n\nIt also pushes politely, gently about their demand out one year. So, it gives us great visibility. Meanwhile, between now to the end of 50 weeks, we all know where we stand with each other and we know where we stand now, which is pretty good visibility.\n\nOperator\n\nAnd one moment for our next question. That will come from the line of Toshiya Hari with Goldman Sachs. Please go ahead.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nHi. Thanks for taking the question. I wanted to follow up on Joe's question on the supply side. Hock, just based on the sequential revenue growth that you've been marking over the past couple of quarters, your guidance for the October quarter, it's pretty clear that supply continues to be kind of the key determinant of your revenue growth.\n\nBased on indications from your foundry supplier and key substrate suppliers, you know, from a modeling perspective, should we expect mid-single-digit growth to be kind of the normal cadence over the next few or several quarters? Or could there be a point in time where your rate of growth starts to accelerate given easing in some of the other end markets? Thank you.\n\nHock Tan -- President and Chief Executive Officer\n\nAnd that's a hell of a good question. So, let me try to answer that and -- which is this. We've always said, and we continue to say, it's not really supply that constrains our revenue. We look at -- as we said, we scrap through and trying to really get as closely as we can to what our customers truly need to consume.\n\nAnd we ship according to that. And that's as basic as all that. So, if you look at it that way, supply is not a true constraint. It's demand, a real demand, and -- getting to the real demand.\n\nJust October quarter Q4, you see us bump up to 8.9 from 8.4, 8.5. Believe me, this is all largely driven by the seasonal ramp of our North American handset manufacturer. That's really what drives that last increase. So, it's -- we're very, very tight to end consumption of products, and it's not really all about -- much about supply.\n\nAnd I've said that for the last four, five quarters, and we're still in that same behavior mode.\n\nOperator\n\nAnd one moment for our next question. That will come from the line of Pierre Ferragu with New Street Research. Please go ahead.\n\nPierre Ferragu -- New Street Research -- Analyst\n\nHi. Thanks for taking my question. Hock, you mentioned in your prepared remarks like your first co-packaged optics product in networking. And so, I was wondering if you can give us a slightly deeper overview of where things stand on this front.\n\nAnd first on your product portfolio. So, are you going to have, like, in parallel products with co-packaged optics and traditional products that are meant to be used with regular optics in parallel in the next few years? And then in terms of market adoption, can you give us a sense of how material co-packaged optics is going to become maybe in the next three, four, five years? And if it's going to be like a progressive adoption on specific use cases or it's going to be more like a hockey stick adoption from the certain bandwidths from which, like, co-package is going to make more sense than [Inaudible] optics.\n\nHock Tan -- President and Chief Executive Officer\n\nOK. Let me try to again talk through this. Basically, your question is about how is -- I mean, we constantly come out across all our product franchises in -- especially in semis new generation of products. And they're pretty cool, even though I say it myself.\n\nAnd adoption is never as quickly as we all like it to be. It tends to be much slower than we think. So, for instance, take switching Tomahawks, data -- top of the rank data center switching. I'm still selling Tomahawk 1, 2, Tomahawk 3, which was the generation before the current generation.\n\nAnd now we are selling Tomahawk 4. And just to give you a sense, Tomahawk 4 as a percent of my total Tomahawk volume, as I would estimate to be less than 30% in total. So, you can see they coexist, and that tends to happen. So, by the time we launch Tomahawk 5 two years from now, we'll probably maybe be getting our Tomahawk 1 to the point where it becomes de minimis.\n\nSo, there is this constant coexistence of multiple generations and apply it, by the way, to every product we have, server storage where we have two, three -- we have three generations running simultaneously because it's the way the world adopts new technology. And we will keep having a mix, which is probably why when you boil down to it at the end of the day, it's -- we have -- there's no hockey stick in any product adoption. There's no such thing as winners take all, whether it's part of a new product, or for that matter, a new player. That is always coexistence, a shared volume, and a shared mix of technologies.\n\nAnd we see that very clearly across. Now, consumer perhaps is less -- is more of a hockey stick. And even then, we see month two or three generations of our North American OEM running simultaneously. But of course, it's more of a hockey stick, I believe, than our infrastructure products.\n\nInfrastructure takes a while, and we would have -- but not very uncommon to have three generation running simultaneously. And that means any expansion of gross margin coming back where it drains down to because it's a reflection of product mix of -- in terms of product generation. That's why our gross margin grows much more steadily, but more -- not as rapidly as we would like to, but it's OK because it gets more sustainable. And as each year passes and the newer generation products get adopted more in a measured manner, our gross margin grows that 50 to 100 basis points each particular year that passes.\n\nI hope that answers your question.\n\nOperator\n\nAll right. Ladies and gentlemen, I would now like to turn the call back over to Ms. Ji Yoo for any closing remarks.\n\nJi Yoo -- Head of Investor Relations\n\nThank you, Sheri. Broadcom currently plans to report its earnings for the fourth quarter of fiscal '22 after close of market on Thursday, December 8, 2022. A public webcast of Broadcom's earnings conference call will follow at 2 p.m. Pacific.\n\nThat will conclude our earnings call today. Thank you all for joining. Sheri, you may end the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJi Yoo -- Head of Investor Relations\n\nHock Tan -- President and Chief Executive Officer\n\nKirsten Spears -- Chief Financial Officer\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nHarlan Sur -- J.P. Morgan -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nWilliam Stein -- Truist Securities -- Analyst\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nVijay Rakesh -- Mizuho Securities -- Analyst\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nPierre Ferragu -- New Street Research -- Analyst\n\nMore AVGO analysis\n\nAll earnings call transcripts"
}