{
  "companyName": "Overstock.com",
  "companyTicker": "OSTK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/overstockcom-ostk-q3-2022-earnings-call-transcript/",
  "content": "Overstock.com (OSTK 0.31%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the third quarter 2022 Overstock.com earnings conference call. [Operator instructions] I would now like to turn the conference over to your speaker today, Lavesh Hemnani, head of investor relations. Please go ahead.\n\nLavesh Hemnani -- Head of Investor Relations\n\nThank you, operator. Good morning and welcome to Overstock's third quarter 2022 earnings conference call. I'm Lavesh Hemnani, head of investor relations. Joining me on the call today are CEO, Jonathan Johnson; and CFO, Adrianne Lee.\n\nPresident Dave Nielsen will be available for Q&A. Next slide, please. Let me remind you that the following discussion and our responses to your questions reflect management's views as of today, October 27, 2022, and may include forward-looking statements. Actual results could differ materially from such statements.\n\nAdditional information about factors that could potentially impact our financial results is included in our Form 10-K for the year ended December 31, 2021, and in our subsequent filings with the SEC. A slide presentation accompanying today's webcast has been posted to our investor relations website and is available to download. Please review the important forward-looking statements disclosure on Slide 2 of today's presentation. During this call, we will discuss certain non-GAAP financial measures.\n\nThe slides accompanying this webcast and our filings with the SEC contain important additional disclosures regarding these non-GAAP measures, including reconciliations of these measures to the most comparable GAAP measures. Finally, to participate during our Q&A session, please use the registration link available under the Event section of our investor relations website. Next slide, please. During today's call, we will follow the agenda on Slide 3.\n\nWith that, let me turn the call over to our CEO, Jonathan Johnson. Jonathan?\n\nJonathan Johnson -- Chief Executive Officer\n\nThank you, Lavesh, and good morning, everyone. Let me begin by saying upfront that I'm not pleased with the top-line revenue results in any way or form. I believe we continue to spend amply on marketing and growth efforts. But this is a hard and highly promotional environment in which many of our competitors continue to liquidate products and/or ignore bottom-line losses.\n\nWe believe that we'll catch up to them. For some, perhaps, sooner than later, as vendors and their financiers worry about payment risk and even longer-term viability. That is not a concern with Overstock. We are profitable for the 10th consecutive quarter, and we are here to stay.\n\nIn today's environment, profits count. We believe profits are the right measure of the long-term winners versus losers in our industry. I believe that, over time, we are well-positioned to take market share from competitors, many of which are closing stores and/or are currently struggling with liquidity and distracted by debt management obligations. In the meantime, we will continue to navigate the near term, remaining confident that our longer term results will be better because of our efforts and our focus on profitability.\n\nSince its inception, Overstock is transformed from a small online liquidator to a general merchandiser and, more recently, a 100% furniture and home furnishings retailer with a differentiated asset-light model and a targeted customer base. I can confidently say that our updated business model and our disciplined execution over the last three years has enabled us to navigate the choppy waters of a pandemic and the difficult current economic challenges. With the economic environment expected to remain uncertain for the foreseeable future, the natural question is, how is Overstock positioned relative to our competition? Let me share some specific thoughts on that. The U.S.\n\neconomy and consumers remain unsettled. High interest rates and various other economic factors are causing considerable stress and putting pressure on the housing market, a market which influences purchase behavior among our customers. The Overstock team remains focused on controlling elements of our business that are within our control. Our business model is focused on growth, but not at the cost of profitability for us or our partners.\n\nWe provide an efficient channel for our partners to drive growth even during times of significant uncertainty, as we efficiently serve the evolving home-related needs of our customers. We pay on time, and on better and earlier terms than our competitors. We always have, and we always will. This, along with our exclusive focus on home, has allowed us to add new partners to our ranks and increase the breadth and depth of products we offer.\n\nOverstock partners and their financiers need not worry about payment risk. We have a strong net cash position with minimal debt with no meaningful payment obligations until 2030. And even that is an obligation we can easily cover right now. Overstock shareholders need not worry about erosion to our earnings from high interest rate debt, nor about ownership dilution to pay large debt with looming maturity.\n\nOur shareholders also stand to benefit from value within the Medici Ventures Fund portfolio that includes about 20 blockchain focused start-ups. Pelion Venture Partners continues to do an impressive job of managing this portfolio, allowing the Overstock management team to focus on our retail business. Several of the Medici Ventures portfolio companies have had have been busy this summer and early fall. I will provide a Medici update later in my prepared remarks.\n\nOur third quarter performance continues to be impacted by ongoing headwinds of high inflation, macro weakness and a shift in consumer spending preferences. The team managed at least to carefully stabilize the top-line decrease and, importantly, deliver another profitable quarter; as I mentioned, our 10th in a row. With the focus on profitability, we ended the quarter with a healthy balance sheet of nearly $4 million in net cash. And we -- as we plan around economic uncertainty, our balance sheet is a distinct advantage and is allowing us to focus on executing toward our strategic vision.\n\nWe will be opportunistic in evaluating future share repurchases, and we will diligently scrutinize M&A opportunities that might be a strategic and operational fit within our long-term business priorities and objectives. As an Overstock shareholder, I hope you will leave today's presentation feeling as confident as I am in Overstock's ability to navigate and eventually return to growth in the current business environment. Next slide please. The Overstock team continues to make progress to deliver on our strategic vision and targets.\n\nThis is evident in a 53% growth for Q3 home-only revenue compared to 2019 as shown on the left chart. This growth rate has outpaced the expansion in the total addressable market over the same period. While I'm certainly not pleased with another quarter of 30% plus year-over-year revenue decline, I am encouraged to see our home-only revenue decline seems to have at least leveled off. This is a good sign when you consider: one, of the pandemic drivers that were helping revenue last year; and two, the benefit we saw from the shift in our Customer Day event into Q3 last year.\n\nThis year, we held our two-day Customer Day in October, in conjunction with the launch of our new marketing campaign, and rebranded it as Overstock Day. We were pleased with the results of this annual event. The chart on the right illustrates our Q3 home-only revenue performance compared to the prior year. Our home-only revenue trend has stabilized sequentially since July for the quarter.\n\nAnd for the quarter, it declined just under 30%, an improvement in trend relative to Q2. Third-party data shows a sequential improvement in our retention trends. We continue to direct our focus to merchandising and marketing strategies to drive further improvement. Last quarter, I shared with you our plans to launch new brand marketing following completion of our move to 100% home-related assortment.\n\nWe are excited to have launched a new brand campaign earlier this month, centered around our refreshed vision of making dream homes come true. I'll discuss more on this shortly. Next slide. Now, for a brief update on recent corporate events.\n\nAs part of our continued efforts to identify efficiencies, we conducted a strategic review of our organizational structure and made changes that better align our teams to eliminate redundancies in fixed cost. We strengthened our leadership team with top talent over the past several months. We have assembled a best-in-class data and tech organization to drive cross functional synergies, operational excellence, and more automation. Each of these changes are important because they better position Overstock for short- and long-term success.\n\nIn October, Overstock employees came together for a semiannual event at our corporate campus in Utah. We discussed our refreshed vision and showcased our brand campaign including for the first time ever the use of brand ambassadors. We view this as a critical piece of our strategy to enhance Overstock's brand name association with home now that we've completed our exit from and removal of all nonhome products. Next slide.\n\nAs we've shared with you in the past, the Overstock name has very strong name recognition, but our association with home is low. Our measured journey to become an online furniture and home furnishings retailer took six quarters. As noted, in June, we exited the last of our nonhome categories and transitioned to 100% furniture and home furnishings retailer. With that transition complete, we strategically refreshed our vision from dream homes for all to making dream homes come true to emphasize our purpose and inspire our employees, partners, and customers.\n\nWith our new vision in place, we created a brand campaign, launching a new commercial titled \"C'mon, Get Comfy\" to coincide with our two-day Overstock Day customer event on October 2nd and 3rd. The ad spots, which reinforced our vision that Overstock makes dream homes come true at any budget, can be seen on broadcast and cable TV like HGTV, streaming TV, YouTube, and social media channels. An additional element of our campaign is a brand ambassador program. We partnered with six high-profile home-centric brand ambassadors you see on this slide.\n\nEach are experts in interior design, home decorating, and remodeling. Between them, they have approximately 12 million followers across multiple social media platforms, including Instagram, Facebook, Pinterest, YouTube, TikTok, and Twitter. These ambassadors are a diverse and talented group of home experts, whose host -- who host popular TV shows on interior design firms and create home and lifestyle content. Overstock's partnership with them will allow Overstock to reach new audiences and attract more new customers.\n\nThis new campaign marks the next step in our team's journey and a vision for the future. Over the coming weeks and months, you will see exciting content in social media posts from these brand ambassadors, highlighting how Overstock can make dream homes come true. Our chief marketing officer, Angela Hsu, and her team deserve a special shout-out for the rollout of this marketing and brand ambassador campaign. I believe I speak for everyone at Overstock when I say how excited we are with this new marketing campaign and the value it will add to the company over the long run.\n\nWe are finally in the social media game in a meaningful way. I will now hand over the call to Adrianne Lee to review our third quarter financial results in more detail.\n\nAdrianne Lee -- Chief Financial Officer\n\nThank you, Jonathan. Slide 9, please. Revenue declined by 33% year over year in the third quarter. We managed to near-term challenges and delivered an adjusted EBITDA of 15 million at a margin of 3.2%.\n\nOur reported EPS loss of $0.81 was driven by a noncash, nonoperating expense associated with a change in value of our equity securities. The change primarily reflects dilution to our direct and indirect ownership interest in tZERO following the Series B funding round, including the dilutive impact of tZERO-issued equity awards. We now hold approximately 29% direct interest in tZERO and approximately 25% indirect interest in tZERO through the Medici Ventures Fund. We reported adjusted diluted earnings per share of $0.13, a decrease of $0.41 versus 2021.\n\nThis excludes the impact from our proportionate share of the Medici Ventures Fund performance and changes in value of our direct investment in tZERO, including the change in value of our equity securities that I just referenced. The decline in adjusted EPS versus last year was driven by lower pre-tax income. Our balance sheet remain strong. We ended with a cash balance of 428 million even after funding 7.5 million for the second tranche of the tZERO Series B funding round.\n\nI will now speak to these quarterly metrics in greater detail in the following slides. Next slide, please. We posted revenue of 460 million in the third quarter, a decrease of 33% year over year. The third quarter was impacted by weak consumer sentiment and shifting spending preferences amid challenging macro dynamics, including high inflation.\n\nAdditionally, we faced headwinds from our strategic action to remove nonhome products from our site. Our business continues to perform well relative to pre-pandemic 2019 levels, illustrating the operational progress we have made. This was evident in the 53% home-only sales growth versus 2019 that Jonathan shared earlier. Our customers recognize our improved assortment of furniture and home furnishings and have strong engagement with our mobile app, both of which have been key elements of our strategy.\n\nRevenue performance was positively impacted by 13% year-over-year increase in average order value. I will discuss our key customer metrics in further detail later. Next slide, please. Gross profit was $107 million in the third quarter, a decrease of $49 million versus the prior year.\n\nGross margin came in at 23.3%, a 60 basis-point improvement versus the same period last year. The year-over-year increase was driven by operational efficiencies, partially offset by higher promotions and discounting. We expect this highly promotional competitive backdrop to continue through the fourth quarter. Our gross margin performance is a proof point of our asset-light model.\n\nWe are able to improve our margins during this challenging cycle while continuing to offer our customers smart value. In the quarter we navigated product cost inflation and significant liquidation from retailers with excess owned inventory. It's important to remember that our business model does not have an expensive logistics operation with a high fixed cost base or significant owned inventory. Next slide.\n\nG&A and tech expenses decreased $4 million year over year, primarily due to a reduction in our cash incentive compensation, which is based on financial performance. Also, we realized partial efficiency and automation gains related to organizational review Jonathan referred to earlier. It's important to note that our compensation and benefits expense increased versus last year, mainly driven by our enhanced equity programs. As a percent of revenue, G&A and tech expense was 10.5% in the third quarter, a deleverage of 290 basis points compared to the third quarter of 2021 due to weak top-line results.\n\nOur goal remains to be extremely disciplined in managing our expenses and finding efficiencies across the organization. We have taken actions to balance our G&A and tech spend with our top-line performance to set up Overstock for near- and long-term success. Next slide. In the third quarter, we delivered adjusted EBITDA of $15 million, which is a decrease of $21 million versus a year ago.\n\nAdjusted EBITDA margin was 3.2%, below our target of mid single digits. We control the controllables during a challenging macro backdrop with winning consumer sentiment and navigated through a highly promotional environment. We view these dynamics as transitory and remain focused on pursuing strategic initiatives that will drive long-term value. Next slide, please.\n\nThis slide shows active customers and order frequency. We measure active customers on a trailing 12-month basis. Our active customer base declined to 5.8 million at the end of the third quarter. This decline in active customers was driven by three key factors.\n\nFirst, consumer sentiment toward discretionary spend has been weak this year due to high inflation and consumer staples. The impact of this has been compounded by difficult comparisons from pandemic related shopping behavior last year. Second, consumers shifted spend to experiences and services. And third, our strategy to exit nonhome products.\n\nAs previously shared, this is the right long-term trade-off despite some pain in the short term. We are disciplined when customer acquisition costs are high. While this slows our pace of new customer acquisition, our year-over-year change in customer retention rate is comparable to the average of other online furniture and home furnishings retailers as measured by third-party data. Orders for active customer was 1.62x in the third quarter, a decrease of about 4% versus last year and a decrease sequentially.\n\nWe expect that, over time, our improved association with home, continued mix into mobile app, our platform with the highest frequency, and enhanced loyalty offerings will help improve this metric. While active customers have decreased, we have been able to strategically offset a portion of this decline with an increased average order value, which is more typical of the home category and which I will discuss in greater detail on the next slide. Next slide. Average order value improved 13% year over year to $243.\n\nOur AOV during this highly inflationary time was primarily driven by the mix within our home product assortment. AOV declined slightly compared to Q2 as we shifted out of seasonal outdoor patio furniture and into rugs and other furniture. Orders delivered were 9.4 million for the trailing 12-month period. This is a decrease of 36% compared to the prior year or 5.2 million orders.\n\nThe decline was primarily driven by weak consumer sentiment and a shift in their spending priorities, along with the cumulative impact of nonhome product removal from our site. Our AOV and revenue per active customer metrics continue to be a proof point on our purposeful focus on home. While orders are declining, the value of each order is improving. It's a strategic trade-off and reflects the purchase behavior of the customers we are targeting.\n\nHome customers who trust us with higher value items and have a higher propensity to make a repeat purchase. Next slide, please. This slide provides a recasted view of our business excluding nonhome sales, which allows for a more direct comparison to our peers. As you can see on the left chart, at the end of the third quarter, our comparable home-related active customer base declined 29% versus the reported 33%.\n\nThe chart on the right illustrates our comparable home-only revenue declined 30% versus the reported 33%. On a sequential basis, the impact of the nonhome category removal has increased due to the cumulative impact of nonhome customers exiting our ecosystem. Next slide, please. I will wrap up my discussion of the financial section by highlighting a few balance sheet and cash flow items.\n\nWe ended the third quarter with 428 million in cash and 35 million in long-term debt, a net cash position of 392 million with no significant debt maturities until 2030. Since the beginning of this year, we have returned 60 million to our shareholders via share repurchases and invested 50 million in tZERO Series B funding round alongside ICE and the Medici Ventures Fund. Our current share repurchase program is authorized through December 31, 2023. And we currently have about 40 million available under it.\n\nHaving minimal debt and a strong cash position in this uncertain macro environment is a great tactical advantage. It allows us to focus on improving our core operations and pursue strategic initiatives without relying on the capital markets. Additionally, in this increasingly volatile landscape, our balance sheet provides us an opportunity to lean into strategic market share opportunities, as new and existing vendor partners realize Overstock will be a reliable channel into the future. With that, back to you, Jonathan.\n\nJonathan Johnson -- Chief Executive Officer\n\nThanks, Adrianne. Our strong balance sheet certainly gives us more stability and flexibility. I continue to believe our shares are undervalued. However, given the revenue environment over the past three months, we conservatively chose to maintain a higher cash balance and pause repurchases.\n\nWe will be opportunistic in evaluating future share repurchases. In addition, we continuously evaluate strategic M&A opportunities to accelerate growth. During the second quarter, we were in advanced stages of such a deal, the deal that made a lot of business sense in our asset-light business model. However, after thorough due diligence, we ascertain that, while the business case was good, the target's operational model and its future investment needs were not currently aligned with our expectations.\n\nAs a result, we walked away from the transaction. Rest assured, we will diligently scrutinize M&A opportunities to ensure that any potential transaction will be a strategic and operational fit with our long-term business priorities and objectives. Know that we will continue to be prudent in capital deployment to deliver the best outcome for all shareholders. Next slide.\n\nNext, I'll provide some key insights into our business and our strategic brand pillars. Next slide, please. We've shared this slide in the past to illustrate the direction of third-party forecasts for online sales in the domestic furniture and home furnishings market. It is encouraging to see the projection for 33% of purchases to be transacted online, especially since the category is comparing against some strong growth from the prior two years.\n\nLonger term, we still believe that, as the market matures, there is sufficient room for online penetration to move higher. The furniture and home furnishings market is large and fragmented with a total addressable market of $419 billion based on third-party reporting. The large market provides us with additional opportunities to gain market share even if online penetration remains unchanged over the near term. As the fourth largest online retailer of home furnishings in the U.S., our smart value brand pillar and strategic focus and strategy focused on increasing the breadth and depth of our home SKU product assortment will help us capture market share.\n\nNext slide. We'd like to show this slide to remind the investing community that Overstock has significant white space available in the quadrant where home goods expertise meets smart value. This quadrant is the natural and right place for Overstock to compete. We've been strategic about choosing to focus on it.\n\nWe don't need to leverage outside debt and our capital-intensive business models to cast a wider net on either end of the customer value spectrum to drive sales. We believe such a strategy is unsustainable over the longer term, especially during volatile retail business cycles like the one we're in. We see evidence of this with some of our larger competitors who struggle with liquidity and debt financing. Our focus on the white space within our quadrant helps us generate the maximum return on investments.\n\nThis strategy also influenced our choice of our six brand ambassadors. They've been carefully selected for their home-related expertise to amplify Overstock's position in the marketplace. I will now talk to our three brand pillars each of which are key to our continued growth. Next slide.\n\nThe first brand pillar is product findability. Since the start of 2021, we have doubled our home-only assortment. We have been working with our partners to carry on-trend quality products to meet evolving customer needs. As the outlook for the housing market is blurred by rising mortgage rates, we see the potential for increased home-based products -- projects that should support spend in renovation and home improvement categories, like bathroom vanities where we have seen an uptick already this year.\n\nAs we look ahead to our first holiday season as a 100% home-based retailer, our customers will be able to find everything they usually look for during this period. This holiday season is expected to be highly competitive. I'm pleased with how the team has positioned Overstock to compete. We are strategically leaning into branded gifting categories like small appliances to capture market share from struggling competitors.\n\nWe are working with some of the top brands in the industry, such as Dyson, KitchenAid, Calphalon, Hoover, Mr. Coffee, and Wooster, and many others. We are doing this within our asset-light model and carefully managing inventory. We anticipate the relationships we build with these brands during the holiday season will open the door to partnerships with other prestige brands in the future.\n\nThese brands, like we, are now fully focused on home and are more willing to allocate inventory. Other key element of our efforts is the relationships we are building our customers. We expect that serving their shopping needs during this important time will help us win repeat business in the future. Next slide.\n\nThe second brand pillar is smart value. A critical element of our evolution has been the development of pricing competency. We have improved how we establish price assortment relative to competitors, and we have consistently delivered on our core pricing KPIs quarter after quarter. We continue to make steady progress in comparing -- to competitive page views and are now able to match up to 66% of those views.\n\nThis is the highest level since we embarked on our pricing initiative. Deep discounts, markdowns, and clearance activities by our competitors has not impacted our ability to deliver smart value to our customers and maintain our targeted gross margins. It is almost certain our revenue decline would have been worse if we did not have this capability. Something that gives us confidence in our smart value proposition is the growth in the order mix of customers and income levels above $100,000.\n\nThis change coincides with the increase in inflation this year. New customers acquired over the last few quarters are also exhibiting a similar trend. And in fact, the order mix of higher-income new customers is tracking at the highest level since 2019. Simply put, our value proposition is resonating.\n\nThese new customers are choosing to shop with us despite having the option to shop at other online and omni-channel home retailers. In a recessionary environment, real value on quality products becomes more important than ever. We are delivering that for our customers, while maintaining profitability, which in this economic environment is we think quite an achievement. I should point out that while we've seen growth in the mix of orders from higher income demographics, our smart value still resonates with our current customers.\n\nOur app made to customers skew younger. Importantly, we continue to see the mobile app grow as a percentage of sales and expect that to continue with the launch of our brand ambassadors. It is our best performing and fastest growing sales platform. Any way you look at it, as customers work to stretch their dollar, we are helping them make their dollars go farther.\n\nWe strive to offer the highest quality products at the best price. Our high-low promotional model is intentional and critical to attracting and retaining our customers. And our smart value proposition is something our customers depend on and what differentiates us in the marketplace. Successful execution of this brand pillar enabled us to deliver the second largest Labor Day company history and the largest single day of sales in year-to-date 2022.\n\nOur customers say that we deliver value across a broad and growing assortment of home products. Next slide. Our third brand pillar is easy delivery and support. As I've said time and again, our asset-light business model is good because we don't have an expensive internal logistics operation with a high fixed cost base or significant owned inventory on our balance sheet.\n\nWe are always looking for ways to delight our customers and elevate their shopping experience without incurring substantial costs. I'm excited to share that we are working closely with UPS on a digitally led strategy, starting with a pilot in Q4 that will elevate our customer experience. We are launching a pilot program in which returns will now be possible through simpler home pick-up options right from the customer's doorstep that don't require reboxing of the product by our customers. Through this pilot, both of our organizations will have the opportunity to better understand customer preferences and enable us to serve up options that align with their day-to-day lives.\n\nThese post-purchase performance metrics will help us evaluate the end-to-end shopping experience for our customers. Initiatives like this one with UPS can go a long way in generating repeat business from our customers. During the third quarter, we made progress on our logistics and customer care operations to further enhance the customer experience. By the end of Q3, we were able to reduce large item home delivery times by 18% since the start of the quarter.\n\nWe achieve this by diversifying our third-party large item carrier network, with each new carrier needing to meet our high standards and service levels, which we visually monitor and enforce. Another important aspect of post-purchase performance is customer's interaction with our customer care agents and the quality of services we provide. Our customer care productivity improved around 600 basis points during the quarter compared to the first half 2022. We still have room for further improvement in case closure rates and the quality of service we provide as we strive to deliver the best end-to-end purchase experience for our customers.\n\nNext slide. Our mantra is sustainable, profitable market share growth. Growth is a key component of our business. This slide shows several key drivers that are critical to support continued growth.\n\nOur differentiated business model is allowing us to pursue these growth drivers despite headwinds in the overall macro and competitive environments. These growth drivers are not capital or resource intensive. Other than limiting what we would be -- what would be inefficient marketing spend, our focus on profitability is not hampering the progress of any of our growth drivers. We are focused on these strategies while continuing to be disciplined in managing expenses.\n\nNext slide. We continue to direct our strategies to drive sustainable profitable market share growth within our financial recipe card targets, even as the online market contracts. Overstock has opportunities to gain market share as we increase our brand association with home. Our annual targets remain unchanged.\n\nThese include top-line outpacing the market to deliver market share growth under various macro scenarios, driven by our advanced technology, our unwavering focus on the customer and our inherently adaptable business model. Gross margins in the 22% [Technical Difficulty] so that we can deliver on smart value. Acknowledging these may fluctuate slightly from quarter to quarter and then Q4 is expected to be highly promotional, disciplined G&A and tech spending to deliver operational leverage. Note our ability to drive leverage on a year-to-date basis has been limited by the difficult sales environment.\n\nWe will, of course, continue to manage these expenses carefully. And we continue to do our best to deliver adjusted EBITDA margins in the mid single-digit range on an annual basis, something that will admittedly be difficult to do with the still hyper-competitive Q4 in front of us. Next slide. Now I will discuss a few updates on the Medici Ventures Fund.\n\nNext slide. Pelion Venture Partners has been a great choice to manage the Medici Ventures Fund as it actively helps advance the portfolio companies, respective businesses to create value for Overstock and its shareholders. I remind our shareholders that our -- that Overstock has met its financial obligations to the fund. Some recent developments in the Medici Ventures Fund portfolio include: first, tZERO.\n\nIn August tZERO completed its strategic funding round that was announced in February of this year. The round is led by intercontinental exchange. Overstock invested alongside ICE, the Medici Ventures Fund, and other investors. In February, Overstock committed to invest in aggregate an additional $15 million in Series B financing.\n\nWe funded the first tranche of $7.5 million in February and the second and final tranche in August. Our additional investment shows our commitment to tZERO and the belief in its leadership. Following completion of this funding round, Overstock's combined direct and indirect ownership in tZERO is now around 54%. In other tZERO news, in September, the tZERO platform listed the largest tokenized security offering for XY Labs.\n\nIn 2018, XY Labs raised $22 million. And with the tZERO listing, those shares are now available to trade in the secondary market. Second, Bitt. This leader in providing central bank digital currency or CBDC solutions, announced that it won the 2022 G20 TechSprint global CBDC competition.\n\nIDEMIA had partnered with Bitt in this competition that received over 100 submissions from leading fintech firms. Together, Bitt and IDEMIA were able to develop a CBDC solution for offline payments to ensure low-cost access with a variety of easy-to-use payment devices and the best identity management verification available in full compliance with regulatory requirements. This week, it has been a year since Bitt and the Central Bank of Nigeria completed the launch of the eNaira. The project is moving to the next phase of growth, which includes onboarding Nigerian trade and exchange platform, sector-specific tokens for grants and subsidies, and programmable payments.\n\nBitt has a bright future. Three, SettleMint. SettleMint has a high performance low-code platform for blockchain application development that empowers engineering games to build, integrate, and launch applications on Web3 infrastructure. The platform is a full-fledged blockchain platform-as-a-service solution.\n\nMedici Ventures first invested in SettleMint in January 2017. Last month, SettleMint closed and oversubscribed up round funding that was co-led by Molten Ventures and OTB and included other new investors. Closing an up round against today's difficult venture capital backdrop is an impressive feat. Medici Ventures Fund also participated in this funding round and now holds about 18% of SettleMint.\n\nOverstock did not directly invest in this round. GrainChain. In August, the company was named the ag tech solution of the year at the 2022 AgTech Breakthrough Awards. GrainChain pairs to security and traceability of blockchain technology with the efficiency and reliability of self-executing smart contracts to ensure producers get paid quickly, has received immediately tradable titles or commodities, and lien holders and other payees are paid first.\n\nThe GrainChain technology makes the entire supply chain process easier, faster, and safer for all. Recently, its CEO and founder, Luis Macias, was recognized as one of the top 100 CEOs in the ag tech space. Ripio. In August, Latin American marketplace, MercadoLibre, announced the launch of its own token, the Mercado token.\n\nRipio was the developer of this token. The coin rewards user further loyalty at MercadoLibre and can be used on the marketplace and is tradable via MercadoLibre's fintech platform. I remain confident that the Medici Ventures Fund will prove itself to be extremely valuable to Overstock. Next slide.\n\nI will now briefly recap the quarter and provide some final thoughts before moving to Q&A. To wrap up, during the third quarter, we remained profitable, stabilized our top-line decrease, and improved our home-only revenue trend despite a weak consumer backdrop. Our balance sheet is healthy, giving us real flexibility in the current macro environment. We continue to increase the breadth and depth of home assortment available on the site.\n\nWe've embarked on a national brand campaign supported by six home-focused brand ambassadors that should help us in our efforts to strengthen Overstock's brand association with home. Our focus on smart value is important, especially in times where consumers wallets are under pressure. We are successfully leveraging our mobile app to increase customer engagement. The Overstock business model is agile and resilient, reacts well to jolts in the market and consumer behavior, and can capitalize on opportunity to gain market share.\n\nBefore we take questions, let me note that I recently hit my 20-year anniversary at Overstock. During my tenure, I have worked with and learned from many talented colleagues. I'm thankful for the entire team for helping build a company that is strongly positioned for many years to come. Now, operator, let's take some questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Peter Keith. Your line is open.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nHi. Thanks. Good morning, everyone. And thank you for the detail on the call.\n\nYou know, I know it's a challenging environment out there with a lot of excess inventory and price competition. I wonder, Jonathan, if you can just comment kind of what you're seeing in terms of the intensity? You mentioned that the pricing environment is still tough. Is it gotten worse versus Q2 and maybe even getting worse as we're entering the holiday season? How's it shaping up for you overall?\n\nJonathan Johnson -- Chief Executive Officer\n\nPeter, the promotional activity is fierce. It stayed fierce through Q3. And you can see in Q4, we've already seen our competition have special promotional days. There were, you know, a second time day, second way day.\n\nWe had our Overstock Day. Target had its -- Target and Walmart had their special promotional days. The holiday promotion aren't waiting for Black Friday and Cyber Monday. They're happening now.\n\nSo, promotion is tough and fierce. But we're playing in this space, and we'll play well. And we'll play within the bounds of profitability.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nOK, thank you.\n\nOperator\n\nThank you. One moment. We have a question from Tom Forte with D.A. Davidson.\n\nYour line is open.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. So, Jonathan, Adrianne, thank you for taking my question. A real impressive job on the profitability. The question I have is the good news or the silver lining in a dark cloud is that you've seen material improvements in supply chain, including the related costs.\n\nHow is that showing up in your results? Is it having a positive impact in your gross margin as an example?\n\nJonathan Johnson -- Chief Executive Officer\n\nLet me talk briefly about supply chain, and then Adrianne can talk to, you know, how and if it's impacting gross margin. The supply chain is different than it was during different times of the pandemic. The cost in containers has come way down to pre-pandemic levels and even less. Factory usage in Asia is low.\n\nAnd that couldn't turn to be of concern in the future because I think factory workers are going home. And sometimes, in fact, your workers go home, and they don't come back. The ports are clear because there's not a lot of product on the water. So, there's nothing -- the backlogs that were in the past.\n\nDomestically, it's still tough with high fuel rates. There's accessorial surcharges to get product to warehouses and to get products from distribution centers to customers. So, parts of the supply chain have eased up and have become less expensive. Parts of them are still expensive.\n\nAdrianne, do you want to comment at all on what that means for what we're doing on gross margins, which, I should say, is continuing to maintain at a good rate?\n\nAdrianne Lee -- Chief Financial Officer\n\nYes. Jonathan, I will just add, you know, our gross margin improvement year over year generally, Tom, driven by those operational efficiency, which we've seen things like efficiencies in our customer care organization, returns, handling, you know, merchant activities with our partners in negotiations. And these have really helped us offset this increased kind of highly promotional time.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat, thank you.\n\nOperator\n\nThank you. We have a question from Anna Andreeva with Needham. Your line is open.\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nGreat. Thank you so much, and good morning, everyone. We had two questions. You guys have done a really good job managing the expenses.\n\nShould we expect EBITDA margins still maintained at that mid single-digit level next year if sales decline double digits again for the business? And then, secondly, you mentioned sales trends improved in late third quarter. Can you talk about what drove that? And what are you seeing in the business quarter to date? And thank you so much.\n\nJonathan Johnson -- Chief Executive Officer\n\nYes. Anna, thanks a lot for asking those questions. We're still in the planning phase for 2023. And, you know, it's highly promotional market with weird, you know, tough macro times.\n\nIt's tough to predict where we'll be 2023. I think you can -- we're in the planning process, I think you can expect us to give some more color on how we think 2023 to be when we announce our Q4 results. You know, I will say, well, I've said that our aim for the annual adjusted EBITDA mid single digits for the year, you know, that won't be the case this year, because we're not quite there now. And the fourth quarter is down.\n\nSo, I mean, that's the thought on EBITDA. Adrianne, do you want to answer anything more on this? And then, Dave, I look to you to maybe add some color. Dave?\n\nDavid Nielsen -- President\n\nYeah, on the sales trends, as we transition from the third to the fourth quarter, Jonathan mentioned earlier, it is extremely promotional, highly promotional. And we've got a full lineup ready with some new and exciting types of promotions. It's just time to pull out all the stops right now. We're competing for the customer out there.\n\nNothing further to add on that, JJ.\n\nJonathan Johnson -- Chief Executive Officer\n\nYeah, and as you know, the fourth quarter started tough, just like the second and third quarters where. There's still a lot of fourth quarter in progress. And there's still a lot of time when shoppers shop in front of us. So, it's hard to know how the fourth quarter is going to come.\n\nYou know, you mentioned what happens if we continue to experience the whole business shrink next year. That's certainly not the intention. The goal is to get back to growth. Like I said, we're in our planning process.\n\nWe're seeing where things are. More color on that in the future.\n\nOperator\n\nThank you. We have a question from Steven Forbes with Guggenheim. Your line is open.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nGood morning, Jonathan, Adrianne. I wanted to explore customer demographic and engagement trends given your commentary about the higher0income customer. So, curious if you can break down the customer base by household income level, just general percentages and discuss if you're seeing any difference, right, in loyalty engagement and/or just what the conversion drivers are right among those different income levels.\n\nJonathan Johnson -- Chief Executive Officer\n\nYeah, Steve, I appreciate the question. We typically haven't, and we won't provide detail on customer demographics, you know, on a more granular level. We are seeing more 100,000-plus income demographics shop at us. We don't think that's a trade-down because we don't think we're a trade-down.\n\nWe think it's a trade-to-value. We have that quality product. And customers at all income levels are looking for it. We think upper income, the upper income demographic is becoming more value-conscious, but not necessarily trade-down at this point.\n\nDave, anything you'd add on customers?\n\nDavid Nielsen -- President\n\nI would just add that our mobile app continues to grow in the mix of our total business. That is a customer base, that is in that category that Jonathan mentioned, the 100,000 plus. That is also driving that. And they proved to be a more loyal customer on the app.\n\nJonathan Johnson -- Chief Executive Officer\n\nYeah, I would say mobile brings two customers. It brings the higher income demographic, and it brings the younger demographic. I think those are not necessarily overlapping, but those are two demographics become through mobile. I'm excited about this brand ambassador campaign.\n\nI think they're going to help our mobile app continue to be strong, and it's already our fastest growing channel. So, really exciting, I think.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nMaybe just a quick follow-up on the brand ambassadors as it relates to the customers you're targeting, curious if you can comment, if you have any insight into their follower base in terms of who they are, right, their income levels? I mean, are the -- do the brand ambassadors have reach across a broad demographic profile? Or are you sort of targeting some subset of the U.S. consumer?\n\nJonathan Johnson -- Chief Executive Officer\n\nThey have pretty broad reach. These were carefully selected ambassadors. We think they appeal especially to the savvy shopper, who we go after. But the focus in choosing them was more to get home-centric ambassadors that would appeal to folks that are already in the home shopping market, the decorating market, the home improvement market.\n\nThat was the focus in picking these six. I got to tell you as I met with them individually, they are -- not only are they just good, good people, they know their stuff. And their followers do love them. I'm a fan boy now.\n\nI'm really excited to have them on our team.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nThank you. Best of luck.\n\nJonathan Johnson -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. And our last question comes from Rick Patel with Raymond James. Your line is open.\n\nRick Patel -- Raymond James -- Analyst\n\nThank you. And good morning, everyone. Just a follow-up on the gross margin question. Great to see the continued expansion there despite the elevated inventory and discounting pressure.\n\nCan you talk about your confidence in continuing to realize operating efficiencies as we think about the fourth quarter and 2023? I guess I'm curious to what extent you expect this progress to be sticky and, perhaps, create a stronger foundation for gross margin to expand from once the discounting normalizes. Because it seems like the 22% long range target could have some upside potential in a more normal environment.\n\nJonathan Johnson -- Chief Executive Officer\n\nYeah, Rick, that's a great question. One thing that I think helps us maintain these gross margins even in a highly promotional period is our asset-light model. We own almost no inventory. And so, we are not liquidating our own product.\n\nAnd when our partners have excess inventory, they're able to take the cost down that we pay them. And that allows us to keep this same gross margin. So, while some of our competition that owns inventory when they liquidate and impact their gross margin, wherever we compete it's the same gross margin level. We've been asked a lot about where gross margins go in the future.\n\nHow we've always answered and how we still answer is, as the market continues to penetrate -- to penetrate into online, migrate into online, we think it's important to keep our gross margins roughly where they are, so that we get these new customers that are becoming online purchasers. We also think it's important to keep gross margins roughly where they are to provide smart value. When the market matures and that online penetration matures, we think that will be the time to take a look to determine whether it's time to do something with the gross margins. But don't expect that, you know, post this highly promotional period, we're going to start jacking up gross margins.\n\nThe 22%, 23% range is really what helps us with our customer base. And we -- you know, we're in the chart, we're in the quadrant with a lots of white space. There's a lot of room to grow there. And that gross margin helps us do that.\n\nRick Patel -- Raymond James -- Analyst\n\nThe C'mon Get Comfy campaign looks really great. I know it's only been a short period since it launched. But any initial reads on the uptick in demand since it went live? And I know you have some really big hitters among the brand ambassadors along those lines. I guess, what's the right way to think about the outlook for sales and marketing expense going forward?\n\nJonathan Johnson -- Chief Executive Officer\n\nYeah. So, the C'mon Get Comfy ad has been out less than a month. It's hard to add super reliable numbers on it. But I will say the initial numbers are good.\n\nAnd the traction, it's getting, particularly where it's a little easier to track. YouTube and other online channels has been really encouraging. I'm pretty excited. Second part of the question?\n\nRick Patel -- Raymond James -- Analyst\n\nYeah, just the brand ambassadors. You have some pretty big names. So, I'm just curious how to think about the sales and marketing line.\n\nJonathan Johnson -- Chief Executive Officer\n\nSales and marketing spent, yeah. So, our goal is to keep our sales and marketing spend where it is. And it's moving marketing dollars from one channel to another and monitoring that carefully. Now, we'll note, when the fourth quarter gets highly promotional, sometimes our marketing percentage kicks up just a bit.\n\nBut we monitor that carefully because we don't have a lot of points in gross margin to spend more in marketing to maintain profitability. So, our marketing spend is about -- it's high as a percentage of sales as I'd like to see it. And that's, you know, kind of what we're trying to maintain right now.\n\nRick Patel -- Raymond James -- Analyst\n\nVery helpful. Thank you, and all the best for holiday.\n\nJonathan Johnson -- Chief Executive Officer\n\nThank you, Rick. And thanks to everyone who participated in today's call. We appreciate your interest in and ownership of Overstock. We are in an industry that is going through a rough patch, but we believe we are navigating it well.\n\nWe believe our strategy of spending for growth, while focusing on profits is the right long-term and winning strategy. I wish all of you and your families a happy holiday season, and remind you to shop early and often on Overstock. The deals are great. We'll talk to you on next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLavesh Hemnani -- Head of Investor Relations\n\nJonathan Johnson -- Chief Executive Officer\n\nAdrianne Lee -- Chief Financial Officer\n\nPeter Keith -- Piper Sandler -- Analyst\n\nTom Forte -- D.A. Davidson -- Analyst\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nDavid Nielsen -- President\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nRick Patel -- Raymond James -- Analyst\n\nMore OSTK analysis\n\nAll earnings call transcripts"
}