{
  "companyName": "Signet Jewelers",
  "companyTicker": "SIG",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/06/signet-jewelers-sig-q3-2023-earnings-call-transcri/",
  "content": "Signet Jewelers (SIG -0.07%)\nQ3 2023 Earnings Call\nDec 06, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, everyone, and welcome to the Signet Jewelers fiscal 2023 third quarter earnings call. My name is Emily, and I'll be coordinating your call today. [Operator instructions] I will now hand the call over to our host, Vinnie Sinisi, senior vice president of investor relations. Please go ahead.\n\nVinnie Sinisi -- Senior Vice President of Investor Relations\n\nGood morning, and welcome to our third quarter earnings conference call. On the call today are Signet's CEO, Gina Drosos; and chief financial and strategy officer, Joan Hilson. During today's presentation, we will make certain forward-looking statements. Any statements that are not historical facts are subject to a number of risks and uncertainties, and actual results may differ materially.\n\nWe urge you to read the risk factors, cautionary language, and other disclosure in our annual report on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K. Except as required by law, we undertake no obligation to revise or publicly update forward-looking statements in light of new information or future events. During the call, we will discuss certain non-GAAP financial measures. For further discussion of the non-GAAP financial measures, as well as reconciliation of the non-GAAP financial measures to the most directly comparable GAAP measures, investors should review the news release we posted on our website at www.signetjewelers.com/investors.\n\nWith that, I'll turn the call over to Gina.\n\nGina Drosos -- Chief Executive Officer\n\nThank you, Vinnie, and thanks to all of you for joining us today. I want to begin by thanking the entire Signet team for a standout quarter in a challenging retail environment. Their passion for rising to every challenge and opportunity is inspiring. I'm particularly pleased that our Signet team was recognized this quarter by Fortune as one of the top 20 Best Workplaces in Retail.\n\nThis is a great reflection of the purpose, pride, and excellence our team members bring to our customers every day. I'm proud to lead this exceptional team. There's one core message that I want you to take away from today's call. Signet is uniquely positioned to deliver consistent market share growth and value creation, given our No.\n\n1 and growing leadership position in jewelry, an industry that tends to grow steadily from year to year and is more resilient to economic cycles than other parts of retail. We've established our strong position in this attractive industry over the past five years by making significant strategic pivots that are now creating a virtuous flywheel effect with compounding advantages that are accelerating positive momentum and growth. First, we've created a differentiated portfolio of banners that appeals to a broad, diverse, and growing mix of customers. Second, we've established a connected commerce presence that is resetting customer expectations for the experience they want to have when shopping for, buying, and owning fine jewelry.\n\nThird, we've built a flexible operating model that gives us multiple levers to pull so we can deliver our commitments even when faced with challenging economic or market conditions. And fourth, we are executing a disciplined capital allocation strategy that is delivering meaningful value creation. It's focused first on expanding market share, growing the top line, and consistently delivering double-digit annual operating margin. Since the beginning of our transformation in fiscal 2019, we've invested nearly $700 million in capital and over $900 million in acquisitions, far beyond any company in the industry.\n\nOn the strength of these investments, we've accelerated growth and returned more than $1.3 billion to shareholders through share repurchases and dividends. We saw the benefits of this flywheel effect again in the third quarter. We beat expectations and are now raising full year guidance, inclusive of Blue Nile. Revenue was nearly $1.6 billion, up 2.9% versus a year ago and up 33% compared to pre-pandemic levels.\n\nWe generated non-GAAP operating income of $58 million, a strong result in a quarter that saw one-time COVID- and supply chain-induced benefits last year, but consistently lost money prior. In fact, Q3 fiscal '20 suffered operating losses of nearly $30 million. And we delivered non-GAAP operating margin ahead of expectations for the quarter. This improvement was largely driven by the positive impact of services, the health of our inventory, and strategic assortment choices, including tearing up value engineering and balanced pricing.\n\nWe achieved this despite Blue Nile losses, which we anticipated and more than covered without impacting our core businesses or distracting us from disciplined execution. Now, even in a challenging environment, we're heading into holiday with multiple points of strength. First, we're well stocked with significant newness and great value at all price points. And most importantly, we are not overstocked like much of retail.\n\nIn fact, our inventory was down 2% in the quarter, excluding acquisitions. And with clearance at the lowest levels in recent history, it's healthier than it's done since our transformation began roughly five years ago. We've cleared up our assortment, and nearly 30% of our assortment is new for holiday. Since Q3 fiscal '20, our inventory is down 17%, excluding acquisitions, with sell-down and clearance penetration down 13 points.\n\nIn addition to being well stocked, we're well staffed. A key driver of our staffing strength is retention. At Kay, for example, staff turnover is 17% lower than it was last year. This ensures we have more experienced consultants on the floor, an important factor because consultants with at least two years of experience in our stores sell two times more than consultants who've been with us for six months or less.\n\nAnd we're able to optimize labor costs by adjusting staffing plans dynamically in response to changing retail traffic. Using our proprietary store level data, we can flex to optimize coverage by hour when and where we need it without being under or overstaffed. As a result, our sales per labor hour are up more than 70% versus fiscal '20. We're still facing macroeconomic headwinds, and consumers behaviors can be somewhat volatile.\n\nBut we're prepared for this. Our flexible operating model is designed to sustain our financial commitments even in the face of these challenges. We're ready for strong holiday execution. Now, I'd like to provide perspective on where we're headed longer term and why Signet is so well positioned to deliver consistent market share growth and value creation year over year.\n\nMy confidence in our long-term growth is grounded in both the attractiveness of the jewelry industry itself and in Signet's strong leadership position within the industry. Jewelry is different from the rest of retail. For example, cyclical industries, like apparel, are more sensitive to economic volatility, carrying inventory with a relatively low residual value and sell products that consumers see as more discretionary. Conversely, customers place a higher value on jewelry.\n\nThey see jewelry purchases as less discretionary because they're tied to special occasions and people in their lives. And jewelry retains its value or appreciates over time. In addition, jewelry doesn't go out of style from season to season. This makes jewelry more resilient and, as a result, more attractive than many other retail industries.\n\nIt's an industry well designed for sustainable long-term growth. And Signet has an advantageous position in this attractive industry. Jewelry rewards the flywheel effect I described, which is a point of difference for Signet. Inventory is a good example.\n\nOver the past five years, we have transformed the way we plan, manage, and optimize inventory. We operate today with a disciplined, tightly integrated approach. First, we leverage our vendor relationships in purchasing scale to ensure quality and availability while managing cash and protecting margins. Second, we consumer test our assortments with the most advanced AI and data analytics capability in the industry.\n\nWe believe our proprietary product concept testing capability is improving our new product success rate, enabling us to bring bigger ideas to market with greater confidence and speed. Third, we provide unrivaled inventory depth and transparency to both customers and our jewelry consultants. Customers can work with our virtual and in-store consultants to find, see, and purchase individual pieces across our multi banner ecosystem. And finally, we provide a full range of flexible fulfillment options, including buy online, pick up in store; ship to store; curbside pickup; same-day delivery; and now, more than 25,000 secure consumer access points.\n\nAfter launching the program just two years ago, customers are opting for a flexible fulfillment option in over 38% of online orders. These capabilities not only benefit our customers but also minimize stranded inventory across our fleet. Taken together, this holistic approach to inventory, design, management, and delivery is a significant competitive advantage. And it has driven significant inventory productivity gains with our core terms of 1.5 times, now nearly twice what they were when we began our transformation.\n\nI'd like to turn now to progress we've made in the quarter on our four where-to-play focus areas. Let's start with winning in big businesses. A good illustration is how we are growing market share and winning in bridal. It's the most important segment in fine jewelry, not only because of its high relative value, but also because bridal is the point of market entry for jewelry lifetime value.\n\nIt's the emotional and financial moment when long-term relationships are established between couples and with their jewelry consultant. Thirty-five percent of new customers during Q3 made their first purchase of Signet through bridal. And over the past three years, roughly a third of bridal engagement customers have returned for subsequent nonengagement purchases, wedding bands, fashion jewelry, statement pieces, and gifts. This is a more than 40% higher repurchase rate versus nonbridal customers.\n\nAnd the average transaction value of their second purchase has increased, up 23% compared to three years ago. We've also continued to widen our customer funnel with Diamonds Direct and Blue Nile, two very strategic acquisitions that focus in bridal and have brought younger, more affluent, and more diverse customers to our business. The good news is that over time, bridal is not cyclical. Engagements, weddings, and anniversaries happen consistently year in and year out.\n\nCOVID is preventing what is the first meaningful blip in engagement ring purchases in the past four decades. Calendar year 2021 represented a 40-year peak in engagement, which is being somewhat offset in 2022 and 2023. Both expected to be down low double digits. We anticipated this blip in consumer dynamics and positioned ourselves to increase our share of bridal and lean into fashion and gifting.\n\nAs engagements returned to more normalized levels, we will be especially well positioned, given that maximizing lifetime value is an ongoing priority for us and a playbook that we are running across our entire business. Accelerating services is our second strategic focus area. As we said, we see services as a billion-dollar business over time, and we're continuing to make steady progress toward that goal. The success of our loyalty program, Vault Rewards, is a good example.\n\nWe already have 1 million Vault Rewards members in just the first year of the program. Our program is especially powerful because we're the only jewelry retailer that can offer this type of holistic loyalty approach across multiple banners. And versus other specialty retail, we provide high value, given the very nature of what we sell, particularly for the engagement and bridal experience. Jared was the first to roll this out in the first half of fiscal '23 and now has more than 30% of sales coming from its loyalty members.\n\nKay and Zales followed with rollouts during the third quarter and are already seeing more than 25% of sales coming from loyalty members. In addition, loyalty members are spending 40% more for repeat purchase than nonloyalty customers on average, and they are making second purchases 25% faster. In repair, we simplified our offerings with bundles that combine typical repair services. This improves both the customer and the employee experience by simplifying the offer and the operation.\n\nEarlier this year, bundles represented about 15% of our repair business. Today, 65% of repairs are part of a bundle. This is encouraging because bundles drive margins through AUR, which was up 18% versus a year ago. With this success, we have further opportunity for growth.\n\nOur research indicates that only 40% of people who shop in malls even know that our banners do repairs. We see upside potential and have doubled our marketing spend on services versus a year ago, which is helping drive growth and customer awareness. Our third where-to-play strategy is to expand accessible luxury and value. Accessible luxury continues to grow in importance.\n\nThis top end of our market now represents approximately 30% of our business, up nearly 10 percentage points versus the pre-pandemic period. The shift toward higher-priced products is being driven by a combination of factors: our database ability to attract higher income customers, the appeal of our high-value assortment and the ability to trade customers up the value chain, and our price architecture. We've also added Diamonds Direct and Blue Nile, both of which have a strong presence in accessible luxury, contributing to the increase. These factors are working.\n\nWe're seeing spending at higher price points in all our categories: engagement, anniversary, and wedding bands, and fashion. Overall, North America average transaction value increased 8% compared to last year and is up 27% versus pre-pandemic. We are equally committed to serve customers at the value end of the market. This is the cohort that is most impacted by economic pressures, and we want to ensure we are providing them with superior value as part of our portfolio strategy.\n\nTo do this, we continue to innovate within our assortment to cut costs customers don't see or care about and to provide a breadth of financing options for every budget. Leading in digital is our fourth strategy. We are now delivering a digital, data-driven, connected commerce experience that is unrivaled in jewelry. One of the biggest differences in Signet today versus five years ago is the mix of customers we serve.\n\nWe've added 22.5 million new customers since fiscal '19. As a result, our customer base is significantly stronger today than it was five years ago. It's younger, more multicultural, more affluent, more digitally savvy, and more demanding in terms of total customer experience. No other jewelry company is as well positioned as Signet to meet these expectations.\n\nIn recognition of this shift, we are continuing to enhance our digital capabilities and offerings. We introduced two-way SMS just over a year ago, for example, and it now represents 14% of our digital support contacts here today. In Q3 alone, 23% of all contacts were through our SMS channel. This matters.\n\nAfter texting with a jewelry expert, conversion is more than 15 times higher than a typical e-commerce purchase. Interestingly, 60% of these purchases are made online, and 40% are made in store. We also know that net promoter scores are typically 15 points higher when a customer shops with one of our virtual consultants. We've enabled social selling by equipping our jewelry consultants to curate personalized digital style guides and use them as a way to reach out to customers with clienteling support, driving both digital sales and store traffic.\n\nCustomers can browse and buy directly from the style guides that connect directly via chat, SMS, or social platforms. We also know that virtual appointments booked online have more than doubled since last year, and sales attributed to virtual JCs have grown 150%. Customers who engage in a virtual appointment convert 12 times more than those who don't, and AOV is nearly three times more. We're also adding enhancements specifically focused on mobile conversion because 87% of our website traffic is now coming from mobile devices.\n\nWe see digital as much more than a stand-alone e-commerce capability. The power of digital is the ability it gives us to create a seamless, connected commerce capability that no one in jewelry can match. The final point I want to underscore is the strength of our financial position, which enables so much of the progress we're making. Disciplined cost management and our flexible operating model allow us to invest strategically in our core business and in acquisitions to expand market share, maintain appropriate levels of leverage, and return cash to shareholders through repurchases and dividends with a goal of becoming a dividend growth company.\n\nSo, to recap, jewelry is an attractive industry, and we're in an advantageous position within this industry. It's analogous to being the best house in a great neighborhood. And given our compounding advantages, we're growing share and investing in growth well ahead of the industry, which positions us for sustainable value creation. As important as our financial health is, it's only part of our story.\n\nAs I said at the outset, the most important part of our success and as my confidence in our future is our culture of innovation and agility, powered by rigorous executional discipline. Our team continues to rise to every challenge and to go after every opportunity to serve our customers, grow our business, and lead our industry. We've built many advantages that set us apart in the jewelry industry and in retail, but none is as important as the caliber of our people and the culture in which they're thriving. On that note, I'll turn it over to Joan.\n\nJoan Hilson -- Chief Financial and Strategy Officer\n\nThanks, Gina, and good morning, everyone. Our key message is that Signet is uniquely positioned among retailers to deliver consistent returns. We're doing this by growing market share, expanding margin, and optimizing our balance sheet, all of which lead to long-term value creation. We are committed to delivering double-digit annual operating margins, which we're able to do with our flexible operating structure even when the top-line environment is challenging.\n\nAnd we are continuing to take advantage of our balance sheet strength to consistently invest in our growth while returning cash to shareholders. Before turning to the quarter, I'd like to share some additional perspective on our recent acquisition of Blue Nile. This acquisition is a great example of our ability to be agile as market share growth opportunities emerge. Our balance sheet strength and our ability to generate cash enables us to step in at the right time for the right asset at the right price.\n\nWe've now been working with the Blue Nile team for just over 90 days. We see significant opportunities to maximize value by bringing together Blue Nile and James Allen, our two digitally native banners. This combination is driving higher synergies that we anticipated at the time of acquisition. We also see top-line and margin opportunities by leveraging assortment, price architecture, data analytics, and the integration of our merchandising capabilities.\n\nImportantly, Blue Nile enables us to grow our share in bridal with a slightly higher price mix and a demographic that is different and additive to the top of our customer funnel. With all of this in mind, we are reaffirming our full year non-GAAP operating margin of 10.8%, even with the dilutive impact of Blue Nile, which is offset by a greater line of sight into the efficiencies we see in our core business. Now, turning to the quarter, we exceeded the high end of our revenue guidance, excluding Blue Nile, despite a more than $20 million drag on the top line from the sharp decline of the pound and the Canadian dollar. On the bottom line, we exceeded the high end of guidance even with the impact of Blue Nile, which operated at a loss during the quarter.\n\nWe delivered profitability during a historically challenging quarter and despite negative high single-digit comps. In the two years prior to the pandemic, we had losses in Q3. We've reset that trend. Our results are a meaningful shift from pre-pandemic levels and reflect the impact of our always-on marketing, rigorous cost discipline, and even earlier preparation for holiday.\n\nFor the quarter, we delivered total sales of $1.6 billion, up 2.9% year over year. On a constant currency basis, we were up 4.2%. Same-store sales were down 7.6%, which was attributable to consumer behavior shift and macroeconomic pressure. Roughly half of the comp decline was attributable to lower price points, including Banter, which was down roughly 30%.\n\nWe saw our strongest performance at higher price points. Our average transaction value in North America was up 8% in Q3, which reflects our mix shift to higher price points, as we broaden our reach into accessible luxury with more targeted customer acquisition, pared-down assortment, and price architecture. We also raised prices selectively as needed in response to inflationary pressures by working closely with our vendors to ensure we can deliver the best pricing and value in the industry. Our fleet reflects our transition to higher price points as well.\n\nSales this quarter were up 33% compared to Q3 of FY '20, with roughly 450 fewer stores, which translates into a 45% increase in sales per square foot versus the pre-pandemic period. This is a result of the much stronger footprint we've established over the past few years. We have decreased our exposure to C malls by almost 20 points, and we've increased the optimal source to almost 40% of our fleet. Turning now to services, North America revenue in Q3 increased roughly 8% on a year-over-year basis and nearly 16% versus FY '20.\n\nThis growth was driven by increased awareness of our services offerings and the success of service bundles. As we continue to improve attachments on quarantine and repair, we are seeing both a meaningful margin contribution and an increase in return visits. Even better, services margin is over 20% higher than merchandise margin. Non-GAAP gross margin in Q3 was 35.2% of sales, down 220 basis points on a year-over-year basis.\n\nThis reflects the expected impact of Diamonds Direct and Blue Nile, both of which carry a lower relative margin due to their higher bridal mix. Merchandise margin in our organic banners improved versus last year. This is a direct result of our disciplined inventory management, flexible fulfillment capabilities, and higher margin services, partially offset by the deleverage of store fixed cost. Non-GAAP SG&A in Q3 was roughly $500 million or 31.4% of sales, deleveraged by 80 basis points compared to last year but 215 basis points better than Q3 FY'20.\n\nThis was primarily driven by strategic investments in IT and digital. And our flexible operating model enabled us to partially minimize the impact of a negative high single-digit comp on labor and other variable costs under our control. Non-GAAP operating income was 58 million or 3.7% of sales. We continue to demonstrate the positive impact of the structural changes in our business.\n\nOur Q3 non-GAAP operating margin is more than 600 basis points higher than it was during the third quarter of FY '20, when we had an operating loss of 2.5%. Now, let's turn to the balance sheet. We ended the quarter with approximately $330 million in cash and equivalents on hand. Since the end of Q2, we returned cash to shareholders through December 2nd of $52 million in share repurchases or nearly 1 million shares, along with common dividends of $80 million.\n\nAnd we completed the cash purchase of Blue Nile. Further, our leverage ratio on a trailing 12-month basis currently stands at approximately two times EBITDAR, well below our previously stated goal of below 2.75 times and down 50% from Q3 of FY '20. Our capital investments are also an important differentiator. As an example, since we began our transformation, we have spent more than $300 million in strategic, digital, and technology investments, a significant part of the $700 million of capital that we've invested in total.\n\nWe have also invested in banner differentiation through the continued expansion of boundaries and the freshness of our fleet. Looking forward, we expect capital investments this year of up to $250 million, down from our previous expectation, reflecting the impact of external supply chain constraints. We continue to buy back shares and have $570 million remaining in our authorization as of December 2nd. This reflects our belief that Signet stock is significantly undervalued.\n\nThe resilience of the jewelry industry and the disciplined execution of our strategy give us confidence that the market will soon recognize our unique ability in the jewelry industry to generate consistent shareholder return. I'll close with our financial guidance for fiscal '23, which reflects current business trends and the inclusion of Blue Nile. Black Friday weekend was encouraging and met our expectations with our biggest Cyber Monday in our history. We are seeing a shift in consumer purchasing patterns that indicate many consumers are waiting until later in the season to complete their shopping.\n\nWe anticipate the strength in our assortment newness will persist. Customers will continue to purchase at higher price points, and our holiday readiness will enable us to be there for customers with the products, fulfillment options, and value they expect. At the same time, we know that economic pressures and concerns will continue to exist. Foreign currency is expected to remain a headwind, and our digitally native brands are likely to continue seeing the consumer shift back to stores through holiday.\n\nWe're approaching Q4 with a healthy balance of confidence and conservatism, confidence driven by our overperformance in Q3, the inclusion of Blue Nile, our readiness for holiday, and the strength of our operating model, and an appropriate level of conservatism that reflects consumer and macroeconomic variables beyond our control. Keeping this in mind and reflecting current business trends, we are raising fourth quarter revenue guidance in the range of $2.59 billion to $2.66 billion, partially offset by the expected headwind related to the sharp decline of the British pound and Canadian dollar. We expect non-GAAP operating income guidance for the quarter in the range of $363 million to $404 million. Our guidance does not include the worsening of macroeconomic factors.\n\nCompared to last year, Q4 guidance includes merchandise margin expansion, reflecting strength in our assortment architecture and inventory health. In addition, we continue to leverage efficient labor and advertising models, along with the flexibility to support further Q4 promotion. We are raising fiscal '23 diluted EPS guidance to $11.40 to $12 per share, including the Q3 fee and the impact of share repurchases through December 2nd. Quarter after quarter, I continue to be inspired not only by our team's dedication to customers, but also by their strong sense of accountability to shareholders.\n\nThey are both agile and disciplined, which shows up time and again in our results, no matter the environment we're in. With that, we're happy to take your questions.\n\nOperator\n\n[Operator instructions] Our first question today comes from the line of Mauricio Serna with UBS. Please go ahead, Mauricio. Your line --\n\nMauricio Serna -- UBS -- Analyst\n\nHi. Sorry. Can you hear me? I think I got cut off for a second.\n\nVinnie Sinisi -- Senior Vice President of Investor Relations\n\nHey, Mauricio. Good morning.\n\nMauricio Serna -- UBS -- Analyst\n\nGood morning, everyone. Great. Thanks for taking my question. I guess I wanted to ask if you could provide a little bit more context and how do you get to the fourth quarter sales guidance.\n\nMaybe you could break it down. Like, what does that imply for same-store sales growth? And then, like roughly, the contribution from Blue Nile and Diamonds Direct. And also, maybe on the fourth quarter gross margin, I recall last year there was an impact on inventory -- an inventory adjustment on the 4Q '21. So, I was just wondering if you could provide like what was that impact that we should keep in mind for, you know, as we model the 4Q March gross margin.\n\nThank you.\n\nGina Drosos -- Chief Executive Officer\n\nHi, Mauricio. Let me give you just some big picture context and then Joan will jump in on some of the more specific details that you just asked about. I think -- you know, first, let's start with the Q3 beat. It was broad based.\n\nOn the top line, we beat both on the core and on our pure play banner, inclusive of James Allen and Blue Nile. And what I think is important is that this punctuates that Signet is not a COVID story. We're successfully executing on a multi-year turnaround of this company, which also led to outperformance on the bottom line in the sense that our core outperformed sufficiently to more than cover the anticipated Blue Nile losses. On the guidance, we're, I think, appropriately encouraged by the trends that we saw Black Friday weekend.\n\nOur omni traffic was up strong double digits. We saw strong AOV margin, in line with our expectations. But probably the most encouraging sign was Cyber Monday, where we have record visits to our sites, low double digits in purchases, and the strong single digits. So, I think customers are beginning to shop.\n\nWe think this holiday will come in later than usual. Customers at every income tier are looking for value. And so, they're waiting a bit later to shop. But it's encouraging to see so much online traffic because we know that -- we see that first before we see purchases happening online and in store because people in the jewelry category tend to browse first before they buy.\n\nSo, I think, you know, that's the positive side. Obviously, we're still very mindful of the macroeconomic environment that we're in. Customers, especially in the value tier, are the most challenged. And so, our expectations are that we continue to drive purchase at higher price points in the accessible luxury tier more so than value.\n\nJoan Hilson -- Chief Financial and Strategy Officer\n\nAnd then to respond to the guidance question, Mauricio, our top-line guidance for sales implies a 2.1 to two-point change in the comp for our core businesses. And that largely relates to the impact of foreign currency exchange and, to Gina's point, the impact on the lower price point performance in our business. And then, you know, basically, as we think about the gross margin for Q4, remember, we have some inventory charges. So, there's a few puts and takes.\n\nWe have inventory charges related to one-time accounting adjustments that we're not anniversarying this year, as well as the positive impact of our services business, as well as other benefits that we're seeing come through are related to our inventory and the cleanliness of our inventory in terms of, you know, scrap and other inventory-related charges. So, really a good margin story. On top of that, I would say our merchandise margin mix itself is improving. And it's really structured around this higher price point assortment, value engineering our product to support our lower-value price point customers, and really, just the overall health of the inventory.\n\nThe impact of clearance sales is far less negative than it had been in the past. And to Gina's point, over the Black Friday weekend, even while promotions were, you know, occurring within our business, we had a margin performance that met our expectations. So, we're very pleased with the overall view.\n\nOperator\n\nOur next question comes from Lorraine Hutchinson with Bank of America. Please go ahead, Lorraine.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good morning. Can you provide some further details on Blue Nile? Maybe what you're projecting for sales over the next several years. And then, also, is it loss-making in the fourth quarter? Was that folded into the 4Q operating income guidance?\n\nGina Drosos -- Chief Executive Officer\n\nSo, with respect to Blue Nile and the guidance, we folded our view of Blue Nile, and we -- it incurred a loss in the third quarter. We folded in its view for our view of that for the fourth quarter, which, in fact, is a slight loss. And as well as, when we think about Blue Nile, we think of it in combination, Lorraine. So, it's a combination of our digitally native banners.\n\nAnd as we are addressing synergies, we're seeing greater synergies than we had at the time of the acquisition. We see opportunity at the top line as we reset assortments, integrating our merchandise capabilities. We see opportunity and margin expansion, merch margin expansion, as well as the backlog for synergies through SG&A. So, all of that thinking is included within our guidance for the year.\n\nAnd you know, as we progress for this year, we'll come back to you on our view for -- in the later years. But we see it all as a positive.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThanks. And then, just one follow-up. Joan, would you be able to quantify the inventory reserve that you'll be going up against in the fourth quarter this year?\n\nGina Drosos -- Chief Executive Officer\n\nWe haven't quantified that, Lorraine. It was, you know, a reasonably large reserve that we don't need to anniversary this year all about, you know, given the health of our business. And I just remind you that we're also -- you know, the implied guidance is there's a negative, you know, comp on the top line when you're thinking about that cost leverage.\n\nOperator\n\nOur next question comes from Jim Sanderson with Northcoast Research. Please go ahead, Jim.\n\nJim Sanderson -- Northcoast Research -- Analyst\n\nGood morning. Thanks for the question, and congratulations on a great quarter. I wanted to dig into the commentary you provided about your long-term outlook, talking about engagement and bridal. If bridal is about 40% of your sales mix and you're expecting some softness post-COVID, should we start to look at maybe mid to high single-digit sales declines related to that segment in 2023 calendar year? Is that the right way to kind of look at that category?\n\nGina Drosos -- Chief Executive Officer\n\nYeah, I think what I was trying to provide was some perspective on the stability actually of bridle over time. It's a very consistent part of the jewelry business. I mean, year in, year out, you have, you know, engagements, weddings, anniversaries. And if you look back pre-COVID, it was very, very steady.\n\nSo, about 2% growth of engagements and weddings year in, year out. COVID has caused a bit of a blip in the sense that, last year, we saw an uptick in engagements. This current year that we're in, we've seen a downtick in engagements, but it's the peak ever -- or peak in the last 40 years, anyway, of weddings. So, we shifted.\n\nWe saw that coming, and we've shifted, and we've really been working to own the wedding. So, two wedding bands purchases, earrings for the bridesmaids, watch for the groom, gifts for the mother of the bride, that kind of thing, as an offset to the slight downtick that we see in engagements. Next year, we expect to see a slight downtick again in engagements, but then it normalizes all -- actually grows to get back to normal the year after. And we think normalize is ongoing after that.\n\nSo, it's really the first meaningful, I would call it, a temporary blip that we've seen in how engagement and weddings have been working. But the great news is that with our consumer insight work, we predicted that and came around that so that we're really working on lifetime value. Our loyalty program, and I gave a lot of stats in the call, has been a fantastic addition in that context because we're seeing most people come into the loyalty business through engagement. We're contacting previous engagement customers to bring them into the loyalty program.\n\nAnd then, we're working on lifetime value with them. So, I think the fact is that there will be less engagements next year. Signet would expect to grow share within the engagement category, and we expect also to grow our fashion and gifting business as we surround the wedding.\n\nJim Sanderson -- Northcoast Research -- Analyst\n\nOK. So, a little bit of offset to maybe some slight tick down in the segment related to just the timing of the impact of COVID. Is that the message I want to take away?\n\nGina Drosos -- Chief Executive Officer\n\nYeah, it's really just a demographic fact. But what we do is leverage all the different aspects of our business to understand those and then offset that as we put together our business plans for the year ahead.\n\nJim Sanderson -- Northcoast Research -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nThe next question today comes from Will Gaertner with Wells Fargo. Please go ahead, Will.\n\nWill Gaertner -- Wells Fargo Securities -- Analyst\n\nHey, guys. Thanks for taking my question. Look, I understand you're not going to be guiding here. But maybe can you just give us some color on the puts and takes of gross margin, operating margin into next year? You know, how to think about Blue Nile and Diamonds Direct, how their impact on the business from a gross margin and then operating margin perspective.\n\nGina Drosos -- Chief Executive Officer\n\nSo, Blue Nile carries a profile similar to Diamonds Direct and James Allen because it's largely, it's predominantly in the bridal business, which carries a relative lower margin, Will. So, as you think about Blue Nile and its merchandise content, that will affect its merchandise margin rate. When we think about, you know, integrating that with James Allen, we believe that we can continue to expand the operating margin as we influence the assortment architecture of Blue Nile. So, the other point that I really make is that as we continue to grow our services business, which can attach to all of our businesses, all of our banners, that also carries a higher gross margin profile.\n\nI mentioned in my prepared remarks, that is 20% higher than other merchandise margin categories. So, that's a positive. The other -- you know, we have sourcing opportunities that we continue to explore, and these always give us room to be positioned, to be flexible with our promotional strategy into Q4 and, you know, as well as into the next year. So, you know, that's really the gross margin story.\n\nAs we think about Blue Nile going forward, you know, we've said in the past that it would, you know, it would be accretive, you know, as early as Q3 of next year. And as we look at it, we're really viewing this as a combined banner with James Allen. So, if you look at our 10-Q, you'll see digitally native banners. What we're really presenting to you is that this is a combined entity that really drives and -- two commercial banners that play off of each other, attracting different customers with Blue Nile being slightly higher and slightly younger, more affluent, which really opens up the top of the funnel but brings with it a different, you know, margin profile.\n\nSo, overall, really positive about Blue Nile, its impact on our business, our ability to manage its performance within the guidance that we've provided for this year. And as I said earlier, you know, we will come back to you on our fourth quarter call with respect to looking into next year.\n\nOperator\n\n[Operator instructions] Our next question comes from Paul Lejuez with Citi. Paul, your line is open.\n\nPaul Lejuez -- Citi -- Analyst\n\nHey, thanks. Two questions. One, I think you mentioned encouraging results over Black Friday weekend expectations, but you also said that you were seeing signs that the consumer was waiting for later in the season to complete their shopping. So, just kind of curious how to square those.\n\nThose two things. And then, curious if you could talk a little bit more about transactions versus ticketing and which categories you're seeing the higher rewards versus seeing them where you might be seeing some pressure.\n\nGina Drosos -- Chief Executive Officer\n\nSure. So, I'll take the Black Friday and later in the season. So, both of those things are true. We saw encouraging results over Black Friday.\n\nAs I mentioned, we saw omni traffic up double digits. So, a lot of people in stores but a lot of people online. And we saw our online revenue up mid single digits. So, that was great that we see people buying at the time.\n\nBut a lot of people, we see browsing, and they'll be waiting, we think, until later in the season, making sure they get the very best value that they can. We're well positioned for that. We're positioned with, I think, very strong merchandise offers, great newness, noncomps in digital experience, marketing, all of those things to drive closure of those customers. But the beginning of our holiday season, especially with our highest ever Cyber Monday, was encouraging.\n\nAnd as we think about the sales equation, Paul, our conversions were, you know, relatively flattish. We mentioned we had a higher average transaction value. But on the lower traffic, our transactions were down.\n\nOperator\n\nThose are the questions we have time for today. So, I'll now turn the call back to management for any concluding remarks.\n\nGina Drosos -- Chief Executive Officer\n\nWell, thanks, everyone. The point that I want to ensure that Joan and I have made this morning is that Signet is uniquely positioned to deliver consistent market share growth and value creation, given our strong and growing leadership in jewelry, an attractive industry that tends to grow steadily from year to year and is more resilient to economic cycles than other retail industries. We've established our leadership position by strategically creating a virtuous flywheel effect that is building positive momentum and growth that no other company in our industry is achieving. We're raising this year, integrating Blue Nile ahead of plan, continuing to deliver annual double-digit operating margins, and maintaining the flexibility that comes with a strong, healthy balance sheet.\n\nWe're ready for holiday and confident we can deliver the long-term growth to which we're committed. Thank you very much and happy holidays.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nVinnie Sinisi -- Senior Vice President of Investor Relations\n\nGina Drosos -- Chief Executive Officer\n\nJoan Hilson -- Chief Financial and Strategy Officer\n\nMauricio Serna -- UBS -- Analyst\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nJim Sanderson -- Northcoast Research -- Analyst\n\nWill Gaertner -- Wells Fargo Securities -- Analyst\n\nPaul Lejuez -- Citi -- Analyst\n\nMore SIG analysis\n\nAll earnings call transcripts"
}