{
  "companyName": "Diamondback Energy",
  "companyTicker": "FANG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/diamondback-energy-fang-q3-2022-earnings-call-tran/",
  "content": "Diamondback Energy (FANG 0.37%)\nQ3 2022 Earnings Call\nNov 08, 2022, 9:00 a.m. ET\n\nOperator\n\nHello, and thank you for standing by. Welcome to the Diamondback Energy third quarter 2022 earnings conference call. [Operator instructions] It is now my pleasure to introduce vice president of investor relations, Adam Lawlis.\n\nAdam Lawlis -- Vice President, Investor Relations\n\nThank you, Andrew. Good morning, and welcome to Diamondback Energy third quarter 2022 conference call. During our call today, we will reference an updated investor presentation, which can be found on Diamondback's website. Representing Diamondback today are Travis Stice, chairman and CEO; Kaes Van't Hof, president and CFO; and Danny Wesson, COO.\n\nDuring this conference call, the participants may make certain forward-looking statements relating to the company's financial condition, results of operations, plans, objectives, future performance, and businesses. We caution you that actual results could differ materially from those that are indicated in these forward-looking statements due to a variety of factors. Information concerning these factors can be found in the company's filings with the SEC. In addition, we will make reference to certain non-GAAP measures.\n\nThe reconciliations with the appropriate GAAP measures can be found in our earnings release issued yesterday afternoon. I'll now turn the call over to Travis Stice.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nThank you, Adam. And before we start with my prepared remarks this morning, I want to encourage each of you to please take advantage of one of our greatest privileges we have as Americans, our freedom to elect our representatives. Please take the time off your busy schedules today to go vote, if you've not already done so. Welcome to Diamondback's third quarter earnings call.\n\nA Diamondback, we pride ourselves on our execution. Our commitment to being the lowest-cost operator in the Permian Basin has and will continue to position us for success through the cycle. The third quarter was no exception. In the quarter, we produced over 224,000 barrels of oil per day and generated approximately $1.7 billion in operating cash flow.\n\nOur capex was once again within our guidance range, leading to free cash flow of nearly $1.2 billion. As we previously announced, we increased our return of capital commitment and stated that beginning this quarter, we would return at least 75% of free cash flow back to our shareholders, up from at least 50% previously. At 75%, total capital return was nearly $875 million, with dividends totaling $403 million or $2.26 per share. The remaining $472 million went toward our opportunistic share repurchase program, where we bought back nearly 4 million shares at an average price of approximately $120 a share.\n\nTo date, we've spent approximately $1.2 billion of our $4 billion buyback authorization, repurchasing nearly 6% of our shares outstanding since September of last year when we initiated our program. In October, we announced the pending acquisition of the assets of FireBird Energy, a company with a large, contiguous position in the Midland Basin. We feel FireBird has right balance of cash flow and inventory and the acquisition is immediately accretive on all relevant per-share financial metrics while providing a long runway of high-quality drilling opportunities. With over 350 locations, we expect to have well over a decade of run room at our projected one-rig development phase.\n\nIn conjunction with the acquisition, we announced that we would sell at least $500 million of non-core assets by the year-end 2023, with net proceeds primarily used to pay down debt. Since then, we closed on a $155 million sale of non-core assets in the Delaware Basin, jump-starting our program and ensuring continuous improvement to our investment-grade balance sheet. We will continue to pursue strategic divestitures, including the sale of certain assets within our Rattler portfolio, generating unrealized value for our shareholders. In closing, we know our business.\n\nWe know we have some of the best inventory in the United States with our low-cost operational machine in place. We have the unique ability to generate significant repeatable returns through the drill bit for decades to come. In 2019, we began co-developing our primary targets. Since then, we've learned how to optimize our development patterns and spacing, and as a result, are seeing material improvement in well productivity over the past 36 months.\n\nIn fact, our well performance this year is back at 2019 levels, when we were primarily targeting one-off wells in our -- zones, which while having great performance and economics and the potential to withstand significant components of our inventory, leading to material parent-child concerns down the line. Fortunately, we are well-positioned for the future. We expect to close on the FireBird transaction at the end of November and slow the development pace on that asset from three rigs to one. We are working with our service providers to ensure that we have the most efficient and cost-effective personnel and equipment in place for next year, including the two e-fleet simul-frac crews we've secured from Halliburton, the first of which is already in the field and performing well.\n\nAll of this will provide operational momentum as we move into 2023 we expect to deliver the same operational results you've come to expect from Diamondback. While we won't be giving detailed for the 2023 guidance today, we believe that we'll be able to generate low single-digit pro forma oil production growth next year by maintaining our current stand-alone activity levels plus the one additional FireBird rig. It's not easy to operate in this environment, but our size, scale and quality of the inventory uniquely position us to deliver differentiated results and create meaningful value for our shareholders. Before I open up for questions, I want to address all the Diamondback employees that are on the phone.\n\nAt Diamondback, we've just celebrated our 10 years as a public company, growing from a $500 million market cap to almost $30 billion today. The people around me this morning and sometimes me individual get too much credit for the success. It's you, the men and women of Diamondback that deserve the credit. It's your pursuit of excellence, your desire to be the very best version of yourself, your dedication to integrity that is responsible for our success.\n\nIt remains my privilege to represent you. Thank you for all that you do. Operator, please open the line for questions.\n\nOperator\n\nCertainly. [Operator instructions] And our first question comes from the line of Neal Dingmann with Truist.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nThanks. Good morning, Travis and team. Travis, my first question is on your developmental strategy, specifically, could you all discuss if you have or will continue to develop, you mentioned, I think it's Slide 7, you've gone to the co-development, you all went there really, I think, before a lot of others did. And I'm just wondering, are you going to do that is that pretty much on all the assets included when you take over FireBird, and I'm just wondering the second part of that, are there parts of this process that you believe you still have an advantage over peers.\n\nIt just seems to me when I'm looking at sort of margins in the perm, you all still are leading. So I'm just wondering, if there are some things you're doing when looking at that Slide 7 that you still think are leading as sort of the pack.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYeah, Neal. Good question. This is Kaes. I think generally, we obviously had a tough earnings call at the end of 2019, when we made this shift to co-development.\n\nI think we learned very, very quickly from that as well as moving more of our capital to the Midland Basin. And I think just generally, the teams have done a really good job on not only spacing within each zone, but the intra-zonal spacing given that these zones talk to each other. And the result is better overall assets here over the last couple of years. So nothing is going to change there.\n\nI think we're going to keep co-developing. And in fact, in some ways, we'll end up doing some larger pads, and we even have prior given the amount of virgin rock we have in that sale of Robertson Ranch area that is kicking off in a real way right now. I think generally -- on the other -- on the other question, well costs are certainly the biggest advantage we have as a company at Diamondback, and that's a cultural thing from top to bottom. We're very focused on cost, very focused on keeping costs down in this inflationary environment.\n\nI think that gives us an advantage, particularly in looking at stuff like FireBird, right? FireBird we're going to co-develop a lot of zones up in the north at a low-cost structure and that central position. There's opportunities for upside, if we bring the Wolfcamp B into the Lower Spraberry development. And that, I think the testament that we can drill them cheap, the returns make sense to compete for capital.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nYeah. It really sounds encouraging. Then turn to my second question, well, I guess, I'd call it the topic your and that's on shareholder return and capital allocation. Travis, for you or Kaes, I mean, do you see any scenario where you all would back off that 75% payout and maybe turn to more growth or something else? And then on the capital allocation, obviously, you all had a nice stock move.\n\nHow do you feel about the buybacks versus it is?\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nLook, we've seen the volatility in the market that every quarter, we've had the opportunity to buy shares back. And when that opportunity presents itself, we'll do so aggressively. I think the key to any of those questions is the ability to generate free cash flow. And that's certainly what our focus is, and then maintaining the flexibility on how the return of that free cash flow gets prosecuted.\n\nI will say that in conversations with our long-only shareholders. A lot of those guys prefer to get the cashback. But again, we believe that we'll have opportunities to repurchase shares back.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYeah. And then no change to the 35% of free cash flow, while it's certainly a restrictive amount of cash to be giving back to the equity holders, we feel that our balance sheet is in a position to be able to do that. And we're still going to reduce debt through non-core asset sales or free cash flow generation and our debt structure is significantly better than it has probably ever been in our company history. So generally, we feel that, it's time for our equity holders to get their cash back after this company has matured from a high-growth company to a high-returning company.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nYeah. I would agree. Your total shareholder return certainly speaks for itself. Thanks, guys.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nThanks, Neal.\n\nOperator\n\nThank you. And our next question comes from the line of Neil Mehta with Goldman Sachs.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYeah. Good morning, team, and congrats on 10 years that pass by very fast. So, well done here, my first question is on 2023 capital spending and any early thoughts here as we bridge from your 2022 levels to next year? And talk about all the moving parts ranging from inflation activity?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYes. Good question, Neil. I think while we're not ready to throw in the towel that well costs are going to keep going up next year, we do have some things coming our way from an efficiency perspective. But I'll kind of lay it out two ways.\n\nBased on the $1.9 billion that Diamondback is going to spend on capital this year, pre FireBird. I would assume we're probably up 10% to 15% from that number gone ahead if we had to make that decision today on well costs. I think another way to think about it is basically in Diamondback today is pre-FireBird at a $500 million run rate of capital, I would say, somewhere below 10% increase off of that makes sense. And then in both scenarios, adding the $250 million of capex for FireBird, we ran that deal on current well costs.\n\nSo those current well costs are running through that the capital-free cash flow numbers that we put in for that deal. So that's how we're thinking about it. I think certainly, there are some things that could go our way. Casing has been a massive headwind for us and for the industry.\n\nMidland Basin, casing is now $110 a foot, that is a huge number of -- on a fixed cost that we can't really control here.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nOK. And then we'll look for a little more clarity, but that's a helpful starting point. And then Travis, a question for you is just on your outlook for U.S. shale growth.\n\nI think a number of industry participants have been surprised by how flat the U.S. production profile has looked here over the last several months. And so curious on your thoughts on shale maturity? And is the lack of growth that we're seeing relative to expectations a function of service bottlenecks, or is it a function of also asset maturity?\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nA lot to unpack in that question, Neal, but I think it's really all of the above. I think there is asset maturation. I think certainly, supply chain constraints are also limiting growth. I think for public companies, the continued discipline that we've all been demonstrating on shareholder returns versus a commitment to growth.\n\nI think all of those factors weigh into more of a muted production growth from U.S. shale going forward. That said, out here in the Permian, I think we're still continuing to hit production records every month, somewhere close to 5.3 million to 5.5 million barrels a day. But that's going to be challenged to continue to grow that into the future.\n\nDo we have the assets out here? Yes, we do. But some of those other topical constraints that I mentioned are going to be impediments to efficient growth assume we'll probably see at higher commodity prices some people try to grow, but they're allocating capital if they're very trailing into of efficiency. So those also create headwinds as well for shareholders.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nThanks, guys.\n\nOperator\n\nThank you. And our next question comes from the line of Arun Jayaram with J.P. Morgan.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nGood morning, gentlemen. Kaes or Travis, I was wondering if you could talk a little bit about the evolution of your co-development strategy, which you shifted in 2019. You highlighted how your well productivity now has returned to 2017 levels. I wondered to see if maybe you could also maybe compare and contrast how Diamondback's development looks like relative to many of your peers, because you highlighted how you believe you're completing the most number of zones per pad in the Midland Basin?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYeah, Arun. I'll focus more on what Diamondback is doing. We certainly do a lot of competitor analysis and learn a lot from our competitors on what to do and what not to do in the basin. So generally, we have a data analytics team that looks at inter-lateral and reserve spacing, and how many wells are completing per pad and per zone and how close the nearest wellbore is.\n\nAnd our math tells us that we're finding a striking a good balance here between IRR and NPV. We may not have the highest oil per foot, but certainly spacing wells a little tighter, as well as co-developing more economic zones together and I expect that trend to continue to head our way. In some ways, these higher commodity prices bring more zones into the equation and maybe even one or two wells per zone. But generally, spacing has stayed fairly consistent here for the last couple of years.\n\nSo credit to the team for looking at what we've done, what's gone well, what's gone poorly and adjusting accordingly. And I think we're set up now for a few years of very solid development, particularly in the Midland Basin side.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nGreat. Great. And then maybe just my quick follow-up. As you guys have now started to develop some of the assets you bought from Guidon and QEP in Central Martin County, can you give us a sense of how the early wells have been trending? And what type of mix should we expect in Martin County on a go-forward basis over the next couple of years?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYeah. I mean, certainly, when we go back to that deal, we basically said we did these two deals to get better and not bigger. And I think that's proving out in the performance of the wells and the performance since then. We're just getting started in the main block.\n\nThere's probably a 24-well pad coming on here in early 2023, and we'll continue to develop that sale in Robertson block very aggressively with probably a three-rig run rate until it's drilled up in three or four years. And that should drive the lion's share of operational performance. Not to be outdone by that, though, we have seen very good well results up in the Northwest portion of Martin County this year due to some adjustments on spacing and landing targets, and I'm proud to say certainly some of the shallower zones, Middle Spraberry has looked very, very good up there relative to prior expectations.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks a lot.\n\nOperator\n\nThank you. And our next question comes from the line of Derrick Whitfield with Stifel.\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nGood morning, all.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nHey. Good morning, Derrick.\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nTravis, with the understanding that you guys have limited exposure to Waha in 2023 and the recent weakness was really driven by maintenance. Could you speak to your macro views on gas ingress over the next few years? And how you plan to mitigate your exposure over time?\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nYeah. Certainly, it's going to be tight. I'll let Kaes give some specifics on that. But I think gas takeaway is going to be talked really certainly most of next year, probably well into 2024 as well until we get some of the major pipes on.\n\nSo we do think -- we do opportunistic hedging, particularly against the -- on the Waha side. And we've committed to some of these pipes that are help making sure we get gas not only that doesn't go to Waha, but goes directly to the Gulf Coast.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYeah. I mean, basically, next year, two-thirds of our gas goes to Waha, and that's all been hedged today, actually hedged a while back. And the other third gets Gulf Coast exposure on the Whistler pipeline. And then as you think about 2024, we think there's going to be pockets of weakness in 2024, certainly easing in the back half of the year when the big pipe Matterhorn comes on, but it's going to be tight from now until then, because some of these expansions, yeah, there are 500 million a day expansion, but I think they're going to be full right away.\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nTerrific. And as my follow-up, I wanted to focus on your operational efficiency. Given the improvements you've experienced in D&C efficiency metrics really over the last couple of years, most would expect efficiency to ply to due to the law of diminishing returns and the dilution of experienced crews. As you guys look forward in time, what are the levers you're hoping to pull to improve or at least maintain your operational efficiency?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYeah. Good question. I think the biggest thing that's going to help us next year from a cost perspective are the two Halliburton e-fleets that one has just started and one is picking up. I think generally, on the horsepower side, we get charged a little bit less.\n\nThey make more margin on that particular piece of business. On top of that, we're not spending money on diesel, right? So we're fueling that fleet with cheap Waha gas for the next couple of years, and that could be anywhere from $10 to $15 a foot of savings depending on what the price of Waha is. And we just opened our first mobile mine or mini mine that's going to be right offset some of our Martin County position. So I think generally, while we're not drilling wells to TD faster than we were last year, we're still best in class in that area.\n\nNow, it's time to work on the other pieces of the cost equation as inflation heats up here.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nYeah. And Derrick, there's a lot of conversations always when you see activity levels increase in the Permian Basin about the impacts of the inexperienced or green hands, we call them. But I don't follow that line of thinking, because it's our job as supervisors of those activities to make sure that even the least experienced individual has the right supervision to perform this job not only safely, but efficiently. So they almost actually transfers not to the service companies, within experienced hands, it transfers to our operations organization and our field supervisors to make sure they can provide the oversight to prosecute our plans effectively, efficiently, and safely.\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nGreat update. Thanks for your time.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nThank you, Derrick.\n\nOperator\n\nThank you. And our next question comes from the line of David Deckelbaum with Cowen.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nThanks, everyone for taking my question today.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nYou're welcome, David. Good morning.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nGood morning. I wanted to follow up just on the $500 million non-core asset divestiture program, $155 million achieved already on some PDP. Travis, you highlighted in your prepared remarks, some of the Rattler assets. I kind of feel like Diamondback isn't getting credit for us.\n\nShould we think about that as representing the bulk of the remaining non-core targets? And could you give us a little bit more detail about the scope of that asset?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYeah. I mean really, David, it's all value, right? But generally, internally, we see that an E&P business trades at four, five times, and a pipeline or a gathering system trades at eight to 10 times. So it's logical for us, with us not getting any credit for it in our valuation to look at some of the JVs that we invested in alongside contributing volumes to those businesses over the last five years. And now, I think they're in kind of a harvest mode where it might make sense to sell, particularly given our buying of Rattler and renewed focus on the upstream business, which is what we're so good at.\n\nSo, I won't commit to certain projects, but there are certainly some of our JVs were sitting on big wins, and you could expect us to try to monetize those appropriately over time.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nI appreciate the color on that, and good luck with those. Maybe just a second one for me. I know we talked a lot about well productivity, but obviously, it's on that Slide 7, you guys highlight continued well productivity improvements in the Midland Basin. I guess as we think about going into 2023, I think you guys have highlighted you'll continue to allocate more activity toward some of the virgin rock areas like Robertson Ranch.\n\nAlso seems like the overall Midland productivity is benefiting from high grading into Martin and Midland. With FireBird, I guess you're putting one rig on there. I guess when you look out, how long does this mix be -- how long is this mix maintains with this sort of intense high-grading within Martin and Midland where we might expect that productivity per well or on a per foot basis to be sustained at these levels are perhaps improving?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYes. I mean I think it's going to be around for a while, certainly longer than the market can see today, which I think is important, right? We have two well-timed deals in 2020 that that we're benefiting from today. I think generally, our job is to allocate capital to the best returning zones and projects first. So, we won't be able to keep this up forever.\n\nBut I think as the shale cost curve goes up, which is likely to happen over the next decade, our job is to maintain a cost structure and an inventory that keeps us at the low end of that cost curve. And that's what we've built this business on. And I think we have both the inventory and definitely the cost structure to be able to keep ourselves at the low end of that cost curve longer.\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nAppreciate that. Thank you, guys.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nThanks, David.\n\nOperator\n\nThank you. And our next question comes from the line of Jeoffrey Lambujon with TPH.\n\nJeoffrey Lambujon -- Tudor, Pickering, Holt and Company -- Analyst\n\nGood morning, guys, and thanks for taking my questions.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nGood morning, Jeoffrey.\n\nJeoffrey Lambujon -- Tudor, Pickering, Holt and Company -- Analyst\n\nJust a couple for me on the FireBird acreage, in particular, a little bit on productivity, but also a bit on inventory. I saw in the deck that you highlighted some small results on that acreage. I just wanted to get your thoughts on if there are any potential implications there from an inventory standpoint? If you could maybe speak to how the locations you've spoken to, to this point that asset are distributed across the position? And secondly, what sort of upside you might contemplate in terms of inventory based on some of these results?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYes, Jeoff. Great question. When we announced the deal, we got one with a lot of people, but we haven't been on a big call like this. We basically said the northern prospect, which you can see on Slide 8 in our deck, competes for capital right away, and that's the game plan is to allocate that rig to that northern prospect for the first few years of the deal.\n\nI think generally, recent well results in the Central prospect would bring in the Wolfcamp A upside into co-development. We underwrote six across in the Lower Spraberry across that block, and that's what we paid for. But, recent well results of co-developing the LSE looked pretty promising today. We have some time to kind of test that out before full field development, but that's kind of the underwritten upside of the trade.\n\nJeoffrey Lambujon -- Tudor, Pickering, Holt and Company -- Analyst\n\nGot it. Thanks, guys.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nThank you, Jeoff.\n\nOperator\n\nThank you. And our next question comes from the line of Jeanine Wai with Barclays.\n\nJeanine Wai -- Barclays -- Analyst\n\nHi. Good morning Travis, Dan, and Kaes. Thanks for taking my question\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nGood morning, Jeanine.\n\nJeanine Wai -- Barclays -- Analyst\n\nFirst, question, maybe just going back to the 2022 guide. The updated guidance for wells drilled, it's now a little bit lower at 260 for the year versus 270 to 290 before, I think. Can you talk about what's driving that number lower now? And how that really impacts operational momentum into next year?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYes. Jeanine, I won't say it interrupts operational momentum into next year because it's our job to not have those issues. We are running a couple of extra intermediate rigs today to get ahead of these large pads where the big rig follows. So I think the message is nothing to see here from operational momentum.\n\nThat's what you expect us to do, and that's what we do best. Just -- I would just say, we probably completed a couple of more wells in the Delaware than we originally expected this year, and we ran probably one less rig than we thought for the year. So -- on the other side of the equation, we're completing probably 15 less wells than we went into the year expected to complete. So your capital efficiency is certainly looking good and momentum feels very good going into 2023.\n\nJeanine Wai -- Barclays -- Analyst\n\nOK. Great. Definitely, I stand out these days in E&P. Wonderful.\n\nThank you for clarity. Maybe our second question is just a quick housekeeping one. In your prepared remarks on 2023, you talked about low single-digit growth on a year-over-year adjusted basis. What baseline oil number should we be using or assuming it's like 220 a day for legacy FANG, but we're not quite sure what to assume for FireBird since we only have commentary for 4Q, and that's only for like a month.\n\nSo just a housekeeping question on that. Thank you.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYes. Good question. I think we did release 19,000 barrels of oil a day net for FireBird in 2023 and that is not changing. The base business FANG, we went into 2022 saying we're going to keep 220,000 barrels of oil a day flat.\n\nWe've kind of outperformed that a little bit this year. But basically, you can take that 220, complete the same number of wells as we expected at the pre FireBird Diamondback level, and that should spit out a couple of percentage points of low single-digit growth. And then add that FireBird 19 on top of that, and nothing's changed here from our perspective. You think that what you expect us to do, be transparent and hit these numbers.\n\nJeanine Wai -- Barclays -- Analyst\n\nGreat. Thanks, gentlemen.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nThank you, Jeanine.\n\nOperator\n\nThank you. And our next question comes from the line of Tim Rezvan with KeyBanc Capital Markets.\n\nTim Rezvan -- KeyBanc Capital Markets -- Analyst\n\nHi. Good morning, folks. Some of my questions have been addressed. So I think I'll just ask one.\n\nObviously, you opened the door a bit talking about election day today. And I'm just curious if you could talk about if either Diamondback or any of your industry trade groups have had any discussions with the Biden administration in DC about these perceived oil shortages in the U.S.? And any context you can provide would be helpful.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nYes. Certainly not specifically inside Diamondback. But yes, aggressively so with the trade organizations that Diamondback is a part of. At the federal level, API, APC we have a lot of sweat equity invested in both of those trade organizations that we lean in alongside all of our industry peers to provide some clear strategies into the White House and the current administration.\n\nSo -- and that will continue regardless of how the results of the elections turn out today. That's our advocacy arm, and we think it's important for our shareholders to be a dynamic part of that advocacy.\n\nTim Rezvan -- KeyBanc Capital Markets -- Analyst\n\nOK. And then I guess the follow-up is, do you believe that anybody do you see is listening to the sort of the domestic group of producers?\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nYeah. It certainly seems like the rhetoric has turned decidedly against the industry again in the lead up to these elections. We can only open pray for that our citizens continue to elect morally and ethically excellent representatives, so that we can send people to Washington, D.C. that do a will of the people.\n\nAnd Diamondback is going to continue to do our part like I said, through advocacy, both locally and at the state and federal level as we navigate this very difficult rhetoric that's being addressed or pointed at our industry.\n\nTim Rezvan -- KeyBanc Capital Markets -- Analyst\n\nOK. Thank you. I appreciate the comments.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nYou bet. Thanks, Tim.\n\nOperator\n\nThank you. Our next question is Doug Leggate with Bank of America.\n\nJohn Abbott -- Bank of America Merrill Lynch -- Analyst\n\nGood morning. This is John Abbott for Doug Leggate. Again, thank you for taking our questions.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nHey, John.\n\nJohn Abbott -- Bank of America Merrill Lynch -- Analyst\n\nOur first question is on capital allocation. Approximately 80% of your capex is to the Midland this year, 20% to the Del, and you sort of look over a multiyear horizon. At what point would you anticipate that the Delaware would become a better or a larger percentage of your overall capex?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nHonestly, quite frankly, we look at all our inventory of keep that 80-20 steady for a long time. So I don't think there's any plans to change it. In some ways, with the FireBird acquisition, some more wells completed there will probably be closer to 85-15 Midland, Delaware. And I think the curves that we posted on Slide 7 proved out that our Midland Basin is certainly top notch, and that's where we're going to be focused.\n\nJohn Abbott -- Bank of America Merrill Lynch -- Analyst\n\nAppreciate it. And then our second question is on sustainable free cash flow. So, the wells you're drilling this year are over 10,000-foot laterals. Looking at your slide, I think it's about two-thirds of your inventory is about 10,000-foot laterals while the one-third is less than that.\n\nSo over a multiyear horizon, how do you think about your ability to sustain free cash flow?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nI think generally, we have a significant amount of long lateral development ahead of us. At some point, naturally, if we can't get trades done block up acreage, we're going to have to reduce our lateral lengths. But I think on the other hand, you have a lower decline production allowing you to maintain capital efficiency for a longer period of time. So we look at it every quarter, total inventory, total development.\n\nAnd as far as we can see, things look very good for Diamondback's capital efficiency for the next few years.\n\nJohn Abbott -- Bank of America Merrill Lynch -- Analyst\n\nAppreciate it, guys. Thanks for taking my questions.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nThanks, John.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nThank you, John.\n\nOperator\n\nThank you. And our next question comes from the line of Charles Meade with Johnson Rice.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nGood morning Travis, Kaes and the rest of the Diamondback group.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nHi. Good morning, Charles.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nTravis, I'd like to ask a question back to the FireBird asset. You guys laid out this view along the North-South axis. But can you give us some of the, I guess, how the prospectivity changes West or -- East to West? And my understanding is, you're starting to approach or get up onto the Central Basin platform on -- particularly on the western side of that central prospect, and I think it even your Limelight prospect there. So, are there any promising puzzles you're working on, on that side, or is that something we should be thinking about for -- in the near future, or is that a project its way down the line?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYeah. Good question. I don't think it's anything in the near term. There certainly are some results further West that early time look promising.\n\nWe didn't underwrite kind of two-mile buffer on the West side for LS prospectivity, but certainly did -- there's certainly some untapped upside with some Barnett and Woodford results nearby, including our Limelight prospects. So that play is getting a lot of attention. But at the end of the day, our investors expect us to underwrite what we're going to develop. And right now, that's all on unvalued upside, which technology and costs work out, it will be certainly prospective into the next decade when we get to drilling it.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nAnd you'll see our development strategy, Charles, as we've moved to that central block, as Kaes laid out as kind of our Phase 2 drilling, but we'll start East and work West. And I think the two wells that are labeled E and F on Slide 8 are good examples of what that early development scenario look like. While we didn't complete those wells, the results are really promising. And we're excited about them.\n\nBut Phase 1 will be up to the North, which is very akin to our Spanish Trail development, and then we'll start on the East side of the central prospect and work our way to the West before you get up, as you pointed out, before you get to the Central Basin platform.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nGuys, that's good detail. Kaes, when I was listening if you answered, maybe think of a word, I don't think you've ever heard before. I was expecting you say something like that Western side is underwritten or something like that. But anyway, on underwritten, and then maybe just one more following up on this, FireBird deal and Travis in case.\n\nI think this is kind of whether we should think about this as a new mode or a pattern for you guys. As I look at the different pieces of your business where you're not committing to 75% cash return -- free cash return to shareholders. That leaves a smaller piece, the 25% piece available to fund the cash portion of any future A&D. And then we look at the FireBird deal, you guys -- it was -- it looks like a good deal.\n\nBut equity was a big component of it. So is that something we should be thinking about for you guys? Is that as you're retaining less cash and equity is going to be a meaningful chunk of future A&D, or is the -- is that the wrong iteration?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nWell, I think generally, there's not a ton of A&D left to do in the basin, right? It certainly -- there's not random 200,000, 30,000-acre blocks in the middle of Martin County or Midland County that are available. So A&D is certainly evolving over the next couple of years in the Permian as consolidation continues. I think generally, with the 75-25 commitment to equity versus non-equity on cash returns that makes looking at deals even more -- put deals under the microscope, right? So in this deal, we're very focused on not levering up the balance sheet in a meaningful way because we work so hard to get the balance sheet where it is. And the sellers had an asset that was early in its development and believed in the upside and wanted to take Diamondback's stock to execute on that upside.\n\nIt's not -- we're not giving up 10% of the company to these guys. They have a 3% position and hopefully, they're long-term happy shareholders. But I think we've used equity to grow this business for the last 10 years. And it's proven out to be the right way to fund deals.\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nThanks for that details, Kaes. Appreciate it.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nThanks, Charles.\n\nOperator\n\nThank you. And our next question comes from the line of Leo Mariani with MKM Partners.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nHi, guys. I wanted to jump back into kind of capex. Certainly, I noticed that capex has kind of been trending up a little bit in the last few quarters and into the fourth quarter guidance. I assume that's mainly inflation.\n\nI think your activity levels have been pretty flattish. Can you just provide any more color around the pace of inflation right now? I know you talked about tubulars continuing to sort of go up? Are you starting to sense that any other items are maybe starting to ease a little bit where they're not rising as quickly, and have you locked in any major portions of your 2023 budget at this point? And if so, can you provide some details on that?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nYes, Leo. Good question. I would say this is, kind of, why we're not looking to give 2023 guidance officially today because I think some things will come to us versus this year where everything just went up. We do have a couple of frac fleets locked in and the two fleets that we talked about.\n\nAll of our sand is locked in with a large contract with a local provider. You know, the rigs, we continue to roll our rigs on a rolling 6-month basis. And while we're running 15 rigs today, I bet you 12 of them are different rigs that we're running this time next -- this time last year because of cost and efficiencies. So there's a lot going on behind the scenes to keep pushing well costs down or stopped them from going up, and that's what you'd expect us to do.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nOK. That's helpful. And I just wanted to ask a clarification question. I know it's too early for exact specifics on 2023.\n\nBut if I heard you guys right, I mean, the base level thinking is, sort of, flattish year-over-year activity and then basically would just add in -- in FireBird, essentially. So the operated plan for this year, FireBird is relatively intact for next year?\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nThat's right. I think FireBird, we're going to drop a couple of rigs drop them down from three rigs to one rig, generate a little more free cash on that business and hit 19,000 net barrels a day of production. We forecasted for that business. I think we'll complete around 30 wells there.\n\nSo you can basically take Diamondback base business from this year plus the 30 wells from FireBird plus the production that we laid out today to get an early look at 2023.\n\nLeo Mariani -- MKM Partners -- Analyst\n\nOK. Thanks, guys.\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nThanks, Leo.\n\nOperator\n\nThank you. And I'm showing no further questions. So with that, I'll hand the call back over to CEO, Travis Stice, for any closing remarks.\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nThank you again for everyone to participate in today's call. If you've got any questions, please contact us using the information provided.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAdam Lawlis -- Vice President, Investor Relations\n\nTravis Stice -- Chairman and Chief Executive Officer\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nKaes Van't Hof -- President and Chief Financial Officer\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nDavid Deckelbaum -- Cowen and Company -- Analyst\n\nJeoffrey Lambujon -- Tudor, Pickering, Holt and Company -- Analyst\n\nJeanine Wai -- Barclays -- Analyst\n\nTim Rezvan -- KeyBanc Capital Markets -- Analyst\n\nJohn Abbott -- Bank of America Merrill Lynch -- Analyst\n\nCharles Meade -- Johnson Rice and Company -- Analyst\n\nLeo Mariani -- MKM Partners -- Analyst\n\nMore FANG analysis\n\nAll earnings call transcripts"
}