{
  "companyName": "Zuora",
  "companyTicker": "ZUO",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/zuora-zuo-q2-2023-earnings-call-transcript/",
  "content": "Zuora (ZUO -0.62%)\nQ2 2023 Earnings Call\nAug 24, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Zuora's second quarter fiscal 2023 earnings conference call. [Operator instructions] With that, I would like to turn the call over to Luana Wolk, head of investor relations, for introductory remarks.\n\nLuana Wolk -- Head of Investor Relations\n\nGood afternoon, and welcome to Zuora's second quarter fiscal 2023 earnings conference call. On the call today, we have Tien Tzuo, Zuora's founder and chief executive officer; and Todd McElhatton, Zohr's chief financial officer. Robbie Traube, our president and chief revenue officer, will also be joining us for the Q&A session. During today's call, we'll make statements that represent our expectations and beliefs concerning future events that may be considered forward-looking under federal securities laws.\n\nThese statements reflect our views only as of today and should not be relied upon as representative of our views as of any subsequent date. We disclaim no obligation to update any forward-looking statements or outlook. These statements are subject to several risks and uncertainties that could cause actual results to differ materially from expectations. For further discussion of the material risks and important factors that could affect our financial results, please refer to our filings with the SEC.\n\nAnd finally, our discussion today includes non-GAAP financial measures. You can find the details in today's press release, which includes a reconciliation table of selected GAAP to non-GAAP measures that reflects the adjustments made to both our current and prior year's results. Our results, press release and a replay of today's call can be found on Zuora's investor relations website at investor.zuora.com.Now I'll turn the call over to you, Tien.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nThank you, Launa, and thank you, everyone, for joining us today. Welcome to Zuora's second quarter fiscal 2023 earnings call. Q2 was another solid quarter for Zoura. We exceeded guidance across all of our key financial metrics, including subscription revenue, total revenue and non-GAAP loss from operations as we continued to execute against the long-term plan that we have laid out.\n\nThere's a lot to cover this quarter. We've got an exciting acquisition that we've just announced. The first step in adding acquisitions to our land and expand strategy side by side with the organic innovation machine that we have built. There is the impact of foreign exchange rates, especially on cash flow.\n\nAnd I know there are general questions on how the macroeconomic environment is affecting us. Later in the call, Todd will walk through how we're thinking of all this from a financial impact perspective, so let me start with the big picture. The net-net is that we have built a very resilient business, and I feel confident in our ability to navigate the current macroeconomic climate. Not only do we have a recurring revenue business, our customers do as well.\n\nBut the recurring revenue is a resilient business model, we actually have a double layer of recurring revenue protection. But more than that, what we do is mission-critical for our current customers. So it's an area that they are continuing to invest in. And finally, the shift to the subscription economy continues on and is strategic to the growth prospects of companies in a variety of different industries.\n\nAnd so the forces driving demand for what we do continue to be intact. Against that backdrop, the strategy that we laid out 18 months ago is proving to be the right strategy. First, we said that we would focus on the best companies in the subscription economy, enterprises north of $1 billion in revenue as well as the fastest growing companies who are on track to become billion-dollar companies. Our experience told us that this segment of the market has lower churn and the resources needed to invest in growing the subscription businesses, which ultimately are scaled businesses, and this has been the right choice.\n\nIn Q2, we saw our lowest churn rate as a percentage of entering ARR since going public in 2018. In Q2, we saw our customers doing even more with us, adding more products and driving more volume through our system. In fact, if you look at our cohort of customers a year ago with annual contract value above, this cohort has grown by over 40% in ARR year over year. And so you see our biggest customers are going all in with us.\n\nAnd today, we have over 60 large enterprise names with annual contracts of $1 million or more. In Q2, we continue to land more of these companies and take them live, including leaders like BNP Paribas with over $46 billion in revenue, Santander with over 200,000 employees, and Sodexo with over 400,000 employees. Second, two years ago, we said that by fiscal 2025, we expected to be driving our business to 25% plus ARR growth, with 112% to 115% dollar-based retention rate, while bringing down professional services to 15% of our revenue mix. In the last few quarters, we've made great progress against those goals, and we did so again in Q2.\n\nDollar-based retention rate ticked up one percentage point from 110% in Q1 to 111%, up from 108% from Q2 of last year. ARR grew 20% on a reported basis, that would have been about 21%, if not for the headwind due to the continued strength of the dollar. And we've already hit our professional services revenue target mix of 15% as a percentage of total revenue ahead of plan. And as a result, we saw improvement in blended gross margins to 67%, an increase of over three percentage points year over year as our subscription gross margin also continued to improve by over 100 basis points year over year.\n\nThird, we said that we would focus on global system integration partners to give us relevance and scale. And in Q2, our partners continued to deliver. We saw our SI partners participate in over 70% of new business transactions, and the size of these deals have been trending higher each quarter. In fact, in Q2, deals that were sourced by our SI partners were more than twice as big as they were just one year ago.\n\nThese partners are also helping drive go-lives where SIs involved -were involved with over 60% of go-lives in Q2. Importantly, our partners are providing key leverage to our model. In fact, one of the big four now had salespeople dedicated to looking for opportunities to sell Zuora into their customer base, showing their investment and commitment to us. Finally, we said the key thing that underpins all of this is our multiproduct land-and-expand strategy.\n\nWith our focus on large companies, we wanted to have multiple paths to get in the door and then different paths to expand as we delivered more value. Let's take one of the world's largest auto manufacturers, who, after being a customer for many years, came to us for their leasing division to power all payments through our Zuora Collect product, and they substantially expanded their footprint with us in Q2. [inaudible] is one of the world's largest media publications, which shows Zuora in Q1 to manage payments with Zuora Collect, and they came back in Q2 to add or billing as a second major product when it was clear that their previous in-house solution could no longer support the scale they needed to monetize their millions of subscribers. Zuora revenue also continues to be a differentiator for us, with leaders like Microsoft, expanding their investment with Zuora revenue on Azure just this past quarter.\n\nIn fact, in Q2, we more than doubled our Azure revenue bookings year over year and almost half of our new business deals included our Zuora revenue products, and we're continuing to innovate. We're building even more ways to drive value and growth with our customers. In Q2, we launched Zuora Secured Data Share for Snowflake. This extends Zuora's data into Snowflake Data Cloud any custom integration needed, making it easier for our customers to analyze their monetization and subscription data with leading data platform on the market.\n\nAnd this brings us to our big announcement for today. It's our first acquisition since the investment from Silver Lake back in March. Our internal innovation machine is cranking, as you know. But we continue to see a strong appetite in our customer base that exceeds even what we can develop.\n\nAnd so we've been building our inorganic innovation machine. In this quarter, we're excited to announce our acquisition of [inaudible] and is expected to close in early September. [inaudible] is actually an existing partner. It's a team.\n\nWe've gotten to know well over the years. We've always been impressed with our shared vision, their people and the technology and the feedback from joint customers who are using our pre-integrated solutions. -- and what effort offers is a leading subscription experience platform, and they work with some amazing brands across industries. Particularly, they've had a lot of traction in the media and digital publishing industries, which has been one of our core focus areas as well.\n\nAnd their customers include companies like News Corp, McClatchy and Bower. So what is happening in the media industry that has created this opportunity for Zephyr? Why is the focus on the subscriber experience so important? Well, if you look at the success that this industry is having, specifically companies like Disney, who just overtook Netflix in subscriber growth, or the New York Times who exceeded 10 million subscribers this year and is ahead of the subscription growth plans, what you see is the winners in the media industry are the ones we have been able to consistently experiment with new services, new bundles, new offerings, and they're figuring out new ways to connect these services to the right subscribers at the right time. This is what it means to deliver an optimal subscriber experience. And this is exactly what [inaudible] helps companies do.\n\nThey offer capabilities like identity management, intelligent trials, dynamic payrolls and entitlements and access management. But most importantly, all of these capabilities is backed by a decision engine that helps deliver experiences personalized for every subscriber. So for example, Zephyr will now that this is an anonymous user and to throw a promotion for its free trial, for that, that user is an existing subscriber but is prime for an upsell offer. And all this is already working at scale.\n\nThis technology is already handling nearly eight billion requests a month for some of the biggest publishers in the world. Now imagine this decision engine, powered by data from Zuora's Building, Collect and Revenue products, tens of billions of transactions each quarter. Now you've got an incredible platform that can help companies understand their subscribers, formulate the right digital offerings and optimize the digital experience, which we believe will drive up for them, conversion, retention and growth. And finally, here's a rough where the media industry goes, other industries will follow from software to financial services to retail and more companies in the subscription economy are ultimately going to have the same need to nurture the subscriber experiences and monetize these relationships over time.\n\nIn the near term, for Zuora, this means we will have additional path to both land new customers and expand within our existing customers in the media and publishing space. But we also see the potential of this platform to go beyond this vertical with additional new products and platform enhancements that we expect to be able to monetize in the coming quarters. So to wrap it up, we had a solid quarter. We are mindful of the macroeconomic conditions, but we continue to be confident in our ability to navigate those conditions because of the resiliency of the subscription model and because our technology is mission-critical.\n\nWe have the right customer base. We have the right product. We're confident that our land and expand strategy is working. We continue to innovate organically, and now through acquisitions, and all of this while making steady progress toward our financial goals.\n\nThank you to our [inaudible] for their continued focus from putting our customers at the center of everything we do and for driving another quarter of strong results. Now I'll turn it over to Todd to review our financials.\n\nTodd McElhatton -- Chief Financial Officer\n\nThank you, Tien, and thanks to everyone for joining our call today. Our second quarter financial results were solid. We continue to see the largest companies in the subscription economy doubling down on Zuora. This reinforces the long-term opportunity we see despite the macro environment and foreign exchange volatility.\n\nWe once again [inaudible] expectations for the quarter across the board and are pleased with our results. Let's start with top line. Subscription revenue ended at $83.8 million, growing 19% year over year in constant currency and 17% as reported, exceeding the high end of our guidance. This was driven by continued go-to-market execution.\n\nProfessional services revenue was $15 million, flat year over year. As you recall, our midterm objective was for professional services to represent 15% of our total revenue mix. As Tien mentioned, we're pleased we've reached this goal ahead of plan. Going forward, PS revenue will be at or slightly below 15% of our total revenue.\n\nThis will result in stronger overall gross margins. Total revenue ended above the high end of guide at $98.8 million, up 17% in constant currency and 14% as reported year over year. Non-GAAP subscription gross margin was 80%, an improvement of more than 100 basis points year over year. Non-GAAP professional services gross margin was negative 3%, in line with our goal to run at or near breakeven.\n\nWe continue to see SI partners increased capacity, allowing us to move more implementation services to that. This growing partnership with SI have also created additional margin leverage. Our non-GAAP blended gross margin saw an improvement of 345 basis points year over year, ending the quarter at 67%. We will maintain a disciplined approach when managing our expenses in the second half, while accelerating investments in product development and quota-carrying sales capacity.\n\nNon-GAAP operating loss was $0.2 million compared to an operating loss of $3.9 million in the prior year. This was driven by continued top line growth and disciplined investment in the business. This resulted in a non-GAAP operating margin of negative 0.2%, a 440-basis-point improvement over last year. Our fully diluted share count as of the end of the quarter was approximately 162 million shares using both the treasury stock and if converted methods.\n\nNow let me walk you through some of the key metrics for the quarter. In Q2, we increased our double-based retention rate to 111% despite FX headwinds. This was an improvement of one point sequentially and three points year over year. Our multi-product land-and-expand strategy has accelerated within our installed base.\n\nCustomers are coming to us for a full monetization platform. At the end of Q2, we had 745 customers that spend at or above $100,000 in ACV, a decrease of one sequentially. In Q2, the $100,000 cohort represented 95% of our business. More importantly is the success we're seeing from our strategy of moving up market and lending expanding with our large customer cohort.\n\nThe number of customers with ACV at or higher than $500,000 grew over 25% year over year, and we closed seven deals with an ACV of $500,000 or more, up from two a year ago. In the past, we also talked about the investments we've made in customer success, and this has led to the lowest churn as a percent of entering ARR since we went public. To close off of this metric, we do expect the number of customers at or above $100,000 to increase in future quarters. Our strong product portfolio is also unlocking larger and longer duration deals.\n\nIn fact, this quarter, the average contract term was the longest since our IPO. This drove our total remaining performance obligations to grow $32 million from prior quarter and 41% year over year.Turning to building transaction volume. Our systems processed $21 billion of volume in the quarter, representing 18% growth in constant currency and 16% growth as reported year over year. As we've noted before, process building transaction volume is not indicative of our revenue growth because our customers gain cost efficiencies as they scale.\n\nThis metric is helpful as it highlights the level of scale we offer our customers, another key differentiator for our solutions in the enterprise space. Now looking at ARR and free cash flow. At the end of Q2, ARR was $337.6 million, and grew 20% as reported, with about one point of headwind due to FX. We continue to make progress toward the goals we've laid out by fiscal 2025 of reaching ARR growth of 25% to 30%.\n\nFree cash flow was negative $7.6 million for the quarter. As a reminder, free cash flow may fluctuate on a quarterly basis due to the timing of cash collections and seasonality.We believe best to assess our cash flow performance over a longer term. As I'll discuss later, during the month of July, we observed some collection timing pushing up by a few days on average. Total capex for the quarter was $2.8 million.Turning to the balance sheet.\n\nWe ended the quarter with $449 million in cash and cash equivalents, a sequential decrease of $4 million. Before we turn outlook, let me give you some color on our pending acquisition of Zephyr. As Tien noted, this acquisition adds to great customers and strengthens our position in media and publishing, one of our key verticals. This addition to our product portfolio also gives us a holistic solution to establish, nurture and monetize subscriber relationships.\n\nBeyond the media vertical, we believe this technology will bring value to our wider customer base with other expanded solutions that we will be able to bring to market in coming quarters. Under the terms of definitive agreement, Zuora will acquire Zephyr for $44 million in cash, with a potential earnout of an additional $6 million if certain ARR growth objectives are achieved by the end of our fiscal year. This transaction is subject to customary closing conditions. Zephyr's current ARR is approximately $5 million.\n\nWe expect [inaudible] to add approximately $2 million for our subscription revenue in the second half of fiscal 2023. When the transaction closes, we don't expect a material impact on our consolidated non-GAAP operating loss. We're committed to managing our bottom line and plan to absorb the incremental opex in the second half of this year. Now let's turn to our financial outlook.\n\nWhile we continue to see double-digit growth in our pipeline for our solutions, we believe it's prudent to derisk our second half given the current macro environment. We will continue to be nimble and disciplined on how we invest for growth while working toward our long-term financial targets. Our revised full-year outlook assumes an impact to subscription revenue due to FX and macro uncertainty and a $2 million benefit from Zepper. For professional services, we are accounting for both FX impact and our strategy of moving implementation services to our SI partners.\n\nLooking ahead, our professional services revenue mix will represent 15% or slightly less of our total revenue mix. Turning to Q3. Our outlook is we expect the following: subscription revenue at $85.5 million to $86.5 million. Professional services revenue of $14 million to $15 million.\n\nTotal revenue of $99.5 million to $101.5 million. A non-GAAP operating loss of $2.5 million to $1.5 million. We have yet to finalize the purchase price accounting, including tax impacts for [inaudible]. Excluding these impacts, we expect a non-GAAP net loss per share of $0.06 to $0.05, assuming a weighted average shares outstanding of approximately 132.7 million.\n\nSubsequent to the close of the acquisition, we will provide any adjustments. For the full year, we are revising our revenue outlook. We now expect subscription revenue of $337 million to $341 million. Professional services revenue of $57 million to $59 million, total revenue of $394 million to $400 million, a non-GAAP operating loss of $2 million to breakeven.\n\nAnd excluding the potential purchase price accounting and tax impacts of Zephyr, we expect non-GAAP net loss per share of $0.18 to $0.14, assuming a weighted average shares outstanding of approximately 131.6 million. Next, let me review our free cash flow outlook for this year. We're revising our outlook based upon two trends we're currently seeing. First, approximately 35% of our revenue mix is international, which is more heavily weighted versus other companies of our size.\n\nWe believe this global footprint is an advantage. However, this year, our FX mix exposes us through the strength of the dollar. We're seeing FX impact from our international customers at the time of renewal and to a lesser extent, from net new bookings. Based on current trends, we anticipate the foreign exchange impact to be approximately $16 million.\n\nSecond, the timing of collections is impacting our free cash flow. In the most recent quarter, we saw a few days increase on our average collection time. We believe it's prudent to expect this trend will continue for the balance of the year. Note, this appears to be simply a delay in payments as we have not seen an impact on overall collectability of our receivables.\n\nAs a result, our free cash outlook assumes that $4 million will be pushed into next fiscal year. These are the primary two factors impacting the guidance. Our prior guidance for free cash flow was $6 million to $9 million. We now expect free cash flow for the year to be between negative $16 million to negative $13 million.\n\nThis does not include the impact of acquisition-related expenses associated with the Zephyr transaction. We expect these expenses to be approximately $4 million. If it weren't for the impact in FX and collection timing of $20 million, we would have been cash flow positive and within our guided range for the year. We're managing the business based on the current trends we are seeing and are committed to running a disciplined business.\n\nWe're maintaining our goal to drive toward a Rule of 40 by fiscal year 2025. As a reminder, the Rule of 40 is defined as a sum of year-over-year subscription revenue growth rate, plus free cash flow margin. For the full year, we're maintaining our previous targets out, dollar-based retention rate of 112% and better and ARR growth of 21% or better. To close off, Q2 demonstrates the strategy we laid out to focus on the enterprise is working.We continue to land and expand with our customers, offering them a differentiated monetization platform.\n\nOur mission critical technology is transforming business and allows us to be very [inaudible]. We believe it puts us in a position to deliver strong top line growth with an eye toward profitability. We are confident in the strength of the subscription economy. Before moving to Q&A, I'd like to send a big thank you to all of our employees around the world for their incredible dedication and commitment.\n\nWith that, team, Robbie and I are happy to take your questions, and I'll turn it over to the operator.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Chad Bennett with Craig-Hallum Capital. Your line is open.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks for taking my questions. So just maybe a point of clarification first for Todd. Just on the FX impact, you laid it out in the press release the impact in the quarter, both on subscription revenue and overall revenue is two points to subscription and three overall.\n\nAnd then you gave a $16 million free cash flow impact for the year. I guess just in your guide because you didn't give it in the release, what is the FX impact on your revenue guide subscription and overall for the second half?\n\nTodd McElhatton -- Chief Financial Officer\n\nHey, Chad, so thanks a lot for the question. So I think what you see on the overall guide, we took revenue on a subscription piece to $3.37 to $3.41. And I think if you take a look at what we did, as we said, there was $2 million that we went ahead and we added in for [inaudible]. And then the balance would be what we de-risked to get to that guide of $3.37 to $3.41.\n\nSo you've got a couple of million dollars-worth of risk there, and then we didn't flow through the extra $1 million that we beat on the top end for subscription revenue in Q2.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nBut is that -- when you talk about de-risk, is that FX impacted risk? Or is that actual business getting done risk in the second half? Because the FX is a pretty big headwind. And I assume you didn't think rates...\n\nTodd McElhatton -- Chief Financial Officer\n\nI'm sorry, go ahead.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nI assume you didn't -- rates are dramatically different from when you reported last quarter. So FX is a real headwind. So is it purely FX? Or you're seeing a slowdown in the business?\n\nTodd McElhatton -- Chief Financial Officer\n\nIt's almost all FX.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nOK.OK. And then just in terms of new logos, it sounds like the SIs are certainly more impactful, more influential on deals, and obviously, deal size is up significantly year over year. But from a new logo deal count standpoint, are we actually kind of volume-wise, doing more new logo deals year over year? Or are we kind of replacing direct deals with SI deals and it's a net-net wash?\n\nTodd McElhatton -- Chief Financial Officer\n\nYes. So I think what I would go ahead and tell you is, I'm not overly concerned about the metric, and let me walk through why. We talked and I think you just hit on it. We talked about the transformation that we've gone through over the past few years.\n\nThe biggest companies are companies that we are focused on. And if you take a look at what we've done over the past couple of years is we're focusing on these larger customers. You've seen year over year our ASPs doubled, number of customers over $1 million ARR is not 60, and that SIs are doing more and more of the integration. And so we're bringing in much larger companies.\n\nAt the same time, some of the companies that we had focused on in the past, weren't a great fit, and those are washing out. And those were companies that maybe haven't had a successful business launch with subscription or they just put very minimal business through. So as these companies are kind of transitioning out, we're replacing them with much larger companies in the platform, and these are the companies that we believe will grow a whole lot faster. And Tien referenced the fact that if you take a look at our customers that cohort of revenue over $500,000, you'll notice that, that actually grew 40% year over year.\n\nSo look, as we go through this transformation, I think you're just seeing the end of it of some of the customers that we have brought on a couple of years ago that aren't a good fit, they're going out. So I think in future quarters, you're going to have a little bit of noise in this metric. But in general, the bottom line is, I see this being a really natural evolution to our customer base and feel good about it.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nGot it. And then maybe one last one real quick on Zephyr. Just in terms of -- it seems to me more like kind of a B2C-focused subscription experience offering, maybe less so B2B, but I could be wrong. But just in terms of kind of how they price, and nature of contracts there and kind of the growth of the business? Obviously, it's a small business, but do we expect that business or has that business kind of doubled year over year? Any kind of color there? Thank you.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nSure. This is Tien. I'll jump in there. The company has been around for three to four years.\n\nThey've gone to, call it, $5 million of ARR with the vast majority of the company in the media space. Look, it's -- as of many companies, start-up companies, sub-$10 million, they're looking to get traction in the marketplace, but not necessarily optimizing their pricing or their revenue potential. We're really excited about it because they're bringing to us 70 new logos. We now have the opportunity to sell our product into their base since media has always been a big focus of ours that we have an opinion to sell what they have into our base, the products are very, very complementary.\n\nOur data set into their decision engine to drive that subscriber journey, their subscriber experience is really a no-brainer for many of these companies. And so we're pretty excited about it. And I think the big picture is, we've always talked about how our key part of our strategy is this land and expand strategy. We're going to continue to sign on new logos.\n\nThe key for us is to sign on the right logos, the right type of companies that continue to invest in a subscription economy that can be worth, call it, $1 million or more, and then continue to expand our footprint within those companies by delivering more innovations, more value. You've seen us execute that strategy really, really well over the last, call it, two years. And what we said at the start of the year, especially with the investments in Silver Lake is we wanted to add an acquisition vector, if you will, side by side with our organic innovation vector. And this is really the first step in that journey.\n\nWe're pretty excited about it, but we do see this as an opportunity for us to continue to drive the growth that we've been delivering over the last two years.\n\nTodd McElhatton -- Chief Financial Officer\n\nI'd give you, Chad, is they do come to us about $5 million of ARR, and they have been growing at a very healthy clip. You think about that over 60% annually.\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Thanks for the color. Seems like a good fit.\n\nTodd McElhatton -- Chief Financial Officer\n\nWe're excited about it. Thanks.\n\nOperator\n\nYour next question comes from the line of Brent Thill with Jefferies. Your line is open.\n\nLuv Sodha -- Jefferies -- Analyst\n\nThis is Luv Sodha on for Brent. Maybe just to clarify on the previous question around the guidance, Todd. So are you saying that no macro headwinds have been embedded into that guide?\n\nTodd McElhatton -- Chief Financial Officer\n\nWe've derisked the numbers. The vast majority of that was FX, so we've proven as we thought about what the second half looks like, and we've got pretty good visibility into what the pipeline looks like and how we're putting our deals together. So we think we've got an appropriate guide for half two based on the current environment.\n\nLuv Sodha -- Jefferies -- Analyst\n\nGot it. So that's -- you're assuming that the current environment stays as is or gets a little bit worse?\n\nTodd McElhatton -- Chief Financial Officer\n\nWe're assuming it as is.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nI would say that, look, what we're seeing is the demand for what we do continues to be strong, both in our customer base and in the broader market at large, right? That being said, look, you know as well as I do, reading the press out there, people are talking about possible recession and so on and so forth. And so we're going to be smart and prudent in this. But what you're seeing is FX definitely is a big impact for us with 35% of our customers being international. We're taking that into account.\n\nWe're being cautious about the future and trying to make sure that we're doing our best job guiding you all.\n\nLuv Sodha -- Jefferies -- Analyst\n\nGot it. In terms of the current pipeline, have you seen any deal pushouts? Or is it taking longer to get deals done given the current environment?\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nYes, we're seeing a mixed picture there. And maybe Robbie can jump in here. But we're seeing both deals go longer, but we're also seeing a lot of deals actually have shorter sales cycles. So it really is a mixed picture for us.\n\nAnd I would say the root of that is what we do is important. So our customers are continuing to invest in this area. You're seeing that in the numbers, right, an increase in dollar-based retention rate and the decrease in churn, but it's also still relevant for all companies moving to the subscription economy.\n\nRobbie Traube\n\nTien, I agree on that side. I think the only other add I would say is, we continue with the sort of multi-products, right? It allows us some more avenues that we can go into and Zuora Collect, as we talked about in terms of large auto organization. We look at a large publisher that's also come in, in the second quarter after with another product. So again, I can land in many different places around that.\n\nSo absolutely, we can see good positive momentum there. For a certain macro environment, we're just going to be operationally a lot more bigger and that we focus on that side, and we'll continue to do so.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nYes. That last point I would emphasize, right? Robbie runs a tight ship. He runs a tight operations and that discipline in the organization certainly is something that is incredibly important when there is macro level noise or macro level uncertainty.\n\nLuv Sodha -- Jefferies -- Analyst\n\nGot it. And one last one, if I may, on [inaudible]. Any lessons team from the Leeyo deal back in the day that you're bringing to bear here in terms of the integration plan?\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nYes. So absolutely. I mean, look, this is a modern technology the company which founded four years ago with Leeyo. There's something that was on-premise software, single-tenant software that we had to sort through made the integration much more challenging.\n\nWe're not going to have a lot of those problems here, right? They've already built an integration. We're going to deepen that integration now that it's under one umbrella. You do have joint customers. And so -- look, we learned a lot.\n\nI would also say it's a brand-new team here, right, with Todd, with Robbie, with Andy Cohen and our General Counsel side that drove a whole bunch of acquisitions at EMC. So we're feeling pretty good, not just about what we've learned, but our ability to do a good job of bringing on this asset. And the last thing I would say is, one of the reasons we picked Silver Lake as a partner and have joined the Board is they've got a deep bench of experience in this area as well. So look, you always want to be smart.\n\nYou always want to be careful. You always want to make sure that you do a good job, but I've got a lot of confidence in our ability to execute.\n\nTodd McElhatton -- Chief Financial Officer\n\nMaybe the only thing I would add, Luv, is we have built capacity to specifically work on integrations. I think we've got a very good plan that goes out literally all the way through every step that needs to happen over the next 18 months. We'll have pretty good integration of the two organizations at the beginning of next -- our next fiscal year, but it's been really well thought out, put together and the team that's running it has experience doing it in the past and successful experience.\n\nLuv Sodha -- Jefferies -- Analyst\n\nPerfect. Thank you.\n\nOperator\n\nYour next question comes from the line of Joseph Vafi with Canaccord. Your line is open.\n\nJoseph Vafi -- Canaccord Genuity -- Analyst\n\nHey, guys. Good afternoon. Nice to see the acquisition. Maybe just one more follow-up on [inaudible] here.\n\nI know you're really focused on the land and expand, and I know you had a good media presence -- these guys have a good media presence. Do you see kind of the forward playbook here early would suffer more as a cross-sell or perhaps kind of a bigger sales effort on new logos? And then related to that, how well does your product set fit into kind of a [inaudible] go-to-market -- how do your products on a cross-sell basis fit with them? And then I have a quick follow-up.\n\nTodd McElhatton -- Chief Financial Officer\n\nYes. I would say, look, if you look at the big picture, the media space is certainly an explosive space. And, in many ways, is moving into a new phase. If you just look at streaming, for a long time, Netflix was a one horse race, if you will.\n\nBut now competition is increasing in the companies that are winning, the way Disney has caught up with Netflix and exceeded them is pricing, it's offering, it's bundling. It's not having one-size-fits-all strategy that saying, \"Look, we've got Hulu. We've got ESPN. We've got various [inaudible] bundled.\n\nWe can bundle the whole thing together.\" If you look what the New York Times has done, their ability to exceed 10 million subscribers when they started this journey, they weren't even sure they were going to get to a milling. It's the same thing. It's pricing and bundling, it's the athletic, it's word it's cooking. It's all these other offerings that they have.\n\nAnd so in order to execute those strategies, which every media company is going to do -- that you're going to need to do is you have to have both things. You have to have what I'll call the monetization engine which is certainly what we do. And you have to have well called the experience engine, the customer journey engine, which is what [inaudible] brings to the table. And you have to have these two things working really closely together.\n\nAnd so we're pretty excited that this is the offering that can help companies have the same type of success that you're seeing in the leaders of the space. And so cross-selling us into their customer base, cross-selling their product into our customer base, taking both products into brand new logos, those are all things that we're going to be focused on. And the last thing I'll say is, there's nothing specific here to the media industry. I think they're just a little bit further ahead, but any B2C company, and I think the previous caller had questions about B2B.\n\nThis thing is also applicable to B2B as well as far as we like the technology. But really, any company in the subscription economy is going to have to do the same type of things. And so we're pretty excited about this acquisition. We think it really broadens our footprint.\n\nIt gives us a unique offering to continue to lead in the subscription economy. And I think this is going to be a big, big game changer.\n\nJoseph Vafi -- Canaccord Genuity -- Analyst\n\nGreat. And then just a follow-up, kind of a higher level picture just kind of where the business is today versus a year ago or so. Things are kind of humming along pretty well these days. If you kind of looked at new logo wins as kind of enterprise businesses versus kind of, I guess, maybe more subscription native businesses.\n\nIf you look at the mix now versus a year ago, and then if you thought about points of growth on upsell, where you're seeing that? Is it in more in the kind of enterprise segment or maybe -- or the mix between enterprise and kind of subscription-native businesses? Just trying to get a feel for where the faster current is for you these days? Thanks a lot.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nI would say the big changes you've seen us in -- starting about two years ago is we really took our experience working with a whole set of customers and really figured out who are the best customers, right? And so we have a sense of which company is going to be the winners in the subscription economy that can build $1 billion subscription businesses because we believe that, that is where the growth is going to be. And so we're doing a good job taking and choosing the right companies to land, and then our expand strategy will take over. In terms of which companies of land, you're going to see both. You're certainly going to see -- continue to see subscription native companies, the best SaaS companies, best media companies as an example.\n\nBut look, with our unified monetization, we've been saying that while we want to be subscription first in terms of where the world is going, we don't want to be subscription only. And so the unified monetization module, for example, already has upwards of 60 customers that are using us to go beyond subscriptions. And you're going to see us really be able to broaden our focus and sign up companies that are committed to the subscription economy, but perhaps have a mixed business model that we can bring them along for the journey.\n\nJoseph Vafi -- Canaccord Genuity -- Analyst\n\nThanks.\n\nOperator\n\nYour next question comes from the line of Joshua Reilly with Needham & Company. Your line is open.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nHey, guys, thanks for taking my questions. Nice execution here in the quarter. Maybe just starting off, what are you seeing in terms of demand in Europe? And how should investors think about your mix of pricing of international contracts in local currencies versus the U.S. dollar? And then do you ever move all of that pricing just to U.S.\n\ndollars? Does that make sense? Or would there be an issue with that?\n\nTodd McElhatton -- Chief Financial Officer\n\nYes. So let me take the first question here from a standpoint of a waiting of contracts that are outside. So we talked about 35% of the business is outside. A very high percent of that is contracted in local currency.\n\nWe're a global company. And frankly, what we've seen is the expectation of our customers is that they want to contract in their local currencies. And so that's how we have done business because that gives us an advantage to playing in the market and acting more like a global type company. So that was your question there.\n\nI forgot what your first question was.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nI would say, look, overall, we see that as a strength, right, that a company of our size and scale typically is going to be almost U.S.-only, but we started focusing on international or global marketplace. The subscription economy is a global trend, certainly is not a U.S. trend. So overall, we see our [inaudible] mix of our business as a strength.\n\nNow certainly, this year, with the strength of the dollar, the admirable strength in the dollar is making it a little bit more work on our side and assure we manage the business well. And I think Todd is doing a good job with that. But we see that as a strength, and I don't know that I want to over-index, right, push customers or do anything unnatural and push, into a U.S. currency when currencies tend to go up one year, down another year, it's not something that we want to -- we want to manage the business in a smart, healthy way to do the right thing for the customers.\n\nTodd McElhatton -- Chief Financial Officer\n\nAnd Josh, I guess going back to your first question on what we're seeing in EMEA. I think Robbie hit it earlier, we're continuing to see really good demand there is some noise out there. Europe is probably the place where we're seeing the most not, but we do feel really good about the demand generation that we're seeing and the pipeline is up in nice double digits year over year. So we're still seeing that.\n\nWe're having good interactions with customers. And as we thought about the second half guidance, we took that into account.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nGot it. And then a couple of other quick ones. You mentioned the free cash flow is down on the extended collection times with some customers. Is there any particular vertical or customer size with the delayed payments? And then I got one other quick one.\n\nTodd McElhatton -- Chief Financial Officer\n\nSure. So let me take you through what we're seeing on the free cash flow. So as I mentioned, we're seeing about -- we've got a $4 million worth of risk there. And I want to take you through what we're seeing, and I would start first off is, this is not any concern that I have on collectibility.\n\nWe have a really good base of solid enterprise customers. And in fact, if I take a look at my ARR that's over 60 days, it's less than 2%. So I don't have any collectability issues. What we have seen is a couple of things.\n\nOne is, we have a group of customers that have pretty consistently paid early, and we've seen a big slowdown in that. And the second thing is, we've seen from customers, especially some larger customers, seem to be pushing things out a few days at the end of the quarter, and that's sliding for us. So those are the two primary things that we're seeing. I believe that it's prudent to project that, that's going to continue, and that $4 million will get pushed into next year.\n\nBut again, no concerns about the overall health of the business or our ability to overall collect. And the last thing I'd say is, we've really got a fantastic collections team, and they've stayed on top of this. And so I feel good.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nIf you simplify it down, Todd is basically saying the last few weeks of the fiscal year, as some of those collections get pushed out, right? We want to make sure we set expectations that we did you guys in the right place. But operationally, it's not -- there's no ability [inaudible] the business.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nGot it. And then last quick one. Is there anything to note on the calculated billings? I have it at about 14.5% in the quarter, any moving parts there that we should be aware of either this quarter or the rest of the year?\n\nTodd McElhatton -- Chief Financial Officer\n\nSo a couple of things, Josh. One is, I hate going to the calculated billings because of all the noise in and out. We talked about ARR, which I think is probably the best way to look at the business. We had 20% growth there.\n\nIf you take a look at headwinds with FX, that would have been closer to 21%. Now, on the calculated billings because you brought it up and you'll see it when you see the contract assets, we're having about 17% growth there. If you look at that in constant currency, it 22%. And then I think if you look at the...\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nsubscription calculated.\n\nTodd McElhatton -- Chief Financial Officer\n\nSubscription calculated billing. And then if you take a look at the first half, we're about 24% growth on the calculated billings. But again, a lot of noise on that. And the real thing that we're really trying to get people focused on is that ARR.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nThe other thing you might want to point to is RPO.\n\nTodd McElhatton -- Chief Financial Officer\n\nYes, I should have hit RPO, too. Look, we had a really fantastic quarter on the RPO, up 41% year over year.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nSo what you can see is, look, FX is an impact on our business. We certainly are managing it. We're simply -- we're going to adjust a lot of what we do based on it. We're not going to any abnormal.\n\nWe're still in a mode where we want to invest in the business. We want to build technology, you want to hire more quota capacity in our sales organization. We see the demand there. But look, we're going to be smart.\n\nWe're going to assume that the FX environment is going to continue, we're going to build that into our plan, but we also want to be transparent to you all in terms of what the financial impact is of FX through the end of the year.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nGot it. Thanks, guys.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nThanks, Josh.\n\nOperator\n\nYour next question comes from the line of Andrew DeGasperi with Berenberg. Your line is open.\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nHi everyone. Just wanted to ask a question on the M&A side, mostly big-picture strategy. I mean, now they acquired [inaudible]. Just wondering, given some like gave you a lot more dry powder behind that, do you still see potential for M&A activity in the near future? Or do you expect to focus a lot more on integration of this asset?\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nI would say, as you know, we took $400 million from Silver Lake this transaction, call it $50 million. And so we still have a lot of dry powder. We're not -- we don't have any specific time lines to do that. We're seeing this as a long-term gain.\n\nBut we spun up an M&A machine that is in gear right now. It's certainly looking at other opportunities all the time. We're going to make sure our priority is to make sure we do a good job integrating [inaudible] folks. We're already starting down that path.\n\nWe want to make sure that we optimize this acquisition and the benefits that we see from it, we're pretty excited about it. But we do have an M&A machine that is spun up that's making sure we've got our year on the ground looking for future opportunities as well.\n\nTodd McElhatton -- Chief Financial Officer\n\nYes. I think, as Tien said, this is the first 1 that we've done, and you'll certainly see other things, and we'll do it on the time line that makes sense. We find the right opportunity that can add value for our shareholders.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nLast thing is you can see us being really thoughtful here, right? [inaudible] was a partner. It was certainly a company that we knew. Feel free to dig into it, but the idea for [inaudible] was actually one of our subscribed events years ago where James and Chris, two founders, were talking to some of our customers in the media space. And so we're looking to make sure we do everything to derisk our first transactions as we get more of a success under our belt with this new strategy.\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nThat's helpful. And then maybe on the -- some of your peers have announced a slowdown in the pace of investment or at least I'm looking at it. Just wondering if given the current environment has changed since a few months ago, have you taken a look at your strategy? And do you see any changes on the horizon?\n\nTodd McElhatton -- Chief Financial Officer\n\nYes, I'll take that, Andrew. We've absolutely taken a look at the second half of the plan. We've been thoughtful about how we're going to invest, and we have made some adjustments to it. But that being said, we are going to continue to invest and quota-carrying assets and development.\n\nWe're still a growth business. And so we will continue to do that. And the other thing that you've also noted is, we're going to absorb the operating expense from [inaudible] acquisition into our hiring plan.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nYes. I mean I want to make sure that he get lost. Look, we're still a growth company. We're still in a marketplace that we believe is growing, that we know is growing.\n\nThat being said, right, you've seen how Todd manage the business over the last two years. He's certainly very prudent. We took the prudence as his middle name. And so the decision, for example, to make sure that we absorb [inaudible] into our existing operating plan versus having it be additive to expenses was a smart decision, and you're going to see us continue to be disciplined in our approach.\n\nOperator\n\nThere are no further questions. Now I'll turn the call over to Tien Tzuo, CEO, for closing remarks.\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nWell, thank you for joining us. Thank you for joining our Q3 call. Q2 call. We look forward to talking to you in 90 days.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLuana Wolk -- Head of Investor Relations\n\nTien Tzuo -- Founder and Chief Executive Officer\n\nTodd McElhatton -- Chief Financial Officer\n\nChad Bennett -- Craig-Hallum Capital Group -- Analyst\n\nLuv Sodha -- Jefferies -- Analyst\n\nRobbie Traube\n\nJoseph Vafi -- Canaccord Genuity -- Analyst\n\nJosh Reilly -- Needham and Company -- Analyst\n\nAndrew DeGasperi -- Berenberg Capital Markets -- Analyst\n\nMore ZUO analysis\n\nAll earnings call transcripts"
}