{
  "companyName": "Coupang, Inc.",
  "companyTicker": "CPNG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/coupang-inc-cpng-q3-2022-earnings-call-transcript/",
  "content": "Coupang, Inc. (CPNG 0.34%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Paula, and I'll be your conference operator today. At this time, I would like to welcome everyone to the Coupang third quarter 2022 earnings conference call. [Operator instructions] Now, I would like to turn the call over to Mike Parker, vice president of investor relations.\n\nYou may begin your conference.\n\nMike Parker -- Vice President, Investor Relations\n\nThanks, operator. Welcome, everyone, to Coupang's third quarter 2022 earnings conference call. I'm pleased to be joined on the call today by our founder and CEO, Bom Kim, and our CFO, Gaurav Anand. The following discussion, including responses to your questions, reflects management's views as of today's date only.\n\nWe do not undertake any obligation to update or revise this information, except as required by law. Certain statements made on today's call include forward-looking statements, actual results may differ materially. Additional information about factors that could potentially impact our financial results is included in today's press release and in our filings with the SEC, including our most recent annual report on Form 10-K and subsequent filings. During today's call, we may present both GAAP and non-GAAP financial measures.\n\nAdditional disclosures regarding these non-GAAP measures, including reconciliations of these measures to the most comparable GAAP measures, are included in our earnings release and our SEC filings, which are posted on the company's investor relations website. And now, I'll turn the call over to Bom.\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nThanks, everyone, for joining us today. I'm excited to share with you some highlights from our third quarter operating results. Revenues increased to $5.1 billion, growing 27% year over year on an FX-neutral basis and over 10% year over year on a U.S. dollar basis.\n\nThis was driven by an increase in both active customers and revenue per active customer. We generated over $1.2 billion in gross profit, with a record 24.2% gross margin, representing over $3.4 billion in gross profit recorded year-to-date. Our adjusted EBITDA was $195 million for the quarter at a 3.8% adjusted EBITDA margin. Our cumulative adjusted EBITDA year-to-date is positive $170 million.\n\nAnd in Q3, we achieved positive net income of $91 million for the consolidated business, improving $415 million year over year. First, on product commerce. While the macro environment remains uncertain around the world, the Korean retail market in Q3 grew at a strong pace of 7% year over year. Even as the world reopens post-COVID, our growth has been resilient; our FX-neutral revenue recorded a robust 27% year over year growth.\n\nOur active customers for product commerce grew even faster than the 7% year-over-year active customer growth for the consolidated business. The spend of our customer cohorts, even our oldest, continues to compound at a fast rate, and that strong spend growth can be seen across all categories, even our most mature. We still don't know the entitlement spend of our customers in any category, much less in aggregate, in a total commerce market projected to exceed $600 billion by 2025. That momentum positions us well to support merchants, suppliers, and consumers to succeed in the current economic environment.\n\nOver 70% of our merchants are small-and-medium enterprises, or SMEs, with less than $2.5 million in annual revenues. Those merchants generated growth on Coupang that was multiples of the overall retail market. We believe we've become the No. 1 source of growth for our SMEs.\n\nQ3 marked the third quarter in a row of significant profitability improvement. While we continue to see positive impact from increasing economies of scale and margin-accretive offerings, most of the recent improvement has been the result of investments in technology, infrastructure, supply chain optimization, and process innovation, including automation. For instance, typically inventory loss grows as you increase the breadth of selection in fresh, especially across multiple regions. We set out to break this trade-off and provide customers with the widest assortment of fresh at the lowest cost.\n\nOur teams found ways to leverage machine learning, among other means, to better predict changes in customer demand by region and optimize inventory orders and placement. That was a key driver of the over 50% year-over-year reduction in fresh inventory losses in Q3 alone. There are numerous such efforts across the company to improve efficiency, many of which have been ongoing for years. The rate of improvement won't be consistent or as dramatic each quarter, but we're excited about the potential ahead.\n\nAbove all, the results of the quarter reflect our accelerating flywheel that is powered by our relentless focus on customer experience and operational excellence. We obsess about how to make experiences richer and prices lower for our customers, and our unique e-commerce network's scale and design enable our superior customer service and efficiency. Over the past seven years, we invested billions of dollars to build a network that integrated from inception fulfillment and last-mile logistics. Today, we have built the largest fulfillment infrastructure in the market.\n\nWe also believe we have the largest last-mile network of directly employed drivers. And from order to delivery to returns, virtually every aspect of our customer experience is orchestrated by our technology. Our home-grown technology directs the movement of our goods and tens of thousands of drivers and staffers seamlessly across our integrated network of over 40 million square feet of infrastructure. Stacked side by side, that would be the equivalent of 500 soccer fields, or an area larger than that of Central Park in New York.\n\nThat distinct integration of technology, fulfillment infrastructure, and last-mile logistics, allows us to break traditional trade-offs between selection, service and price for our customers. Because of it, we are able to deliver millions of items via Dawn Delivery, ordered as late as midnight and arriving at the door before 7 AM, with unlimited free shipping. Because of it, our customers can leave items for return outside their door without the hassle of packaging it in a box or even printing a label. And because of it, we are able to eliminate box packaging for over 85% of our Rocket deliveries, as well as deliver most of our fresh orders in Ecobags.\n\nthat we pick up and reuse. Much of the efficiency gains we've captured are exclusive to a network of our design. We customize processes upstream to generate efficiencies downstream and alter design downstream to optimize processes upstream. The integration also allows us to deliver fresh products in the same last-mile trucks with our general merchandise deliveries, without a separate cold-chain delivery network.\n\nBoxless and ecobag deliveries make customer lives easier and drive significant reductions in packaging waste and the number of trips our trucks make to complete deliveries, which results in lower emissions. Our increasing scale will help us fulfill our potential, but we will also continue to invest in automation, including machine learning and robotics. This will make work even easier for our workers and prices even lower for our customers. In addition to better service and low prices, we'll continue to expand both first-party and third-party selection for our customers.\n\nThat includes new selection on Rocket enabled by Fulfillment & Logistics by Coupang, or FLC. FLC provides hundreds of thousands of merchants access to the speed, efficiency and convenience of Rocket delivery and returns. We're excited to share the benefits of billions of dollars of investment in infrastructure and technology with tens of thousands of small and medium enterprises, that have traditionally been excluded from shelves in offline stores. This will help them capture the growth and savings generated by our end-to-end integrated operations.\n\nIn turn, they'll help customers gain access to even wider selection with the experience of Rocket and build an even richer ecosystem that benefits both small businesses and customers alike. Finally, let me touch on developing offerings, where revenues increased 10% year over year on a constant currency basis, driven by our Eats offering. As we've stressed recently, our focus in Eats has been on creating a profitable foundation, and the dramatic improvements in economics over the last few quarters are reflected in the gross profit improvement of nearly $42 million year over year. We are also excited by the Customer engagement that we're seeing in our initial efforts in Coupang Play, fintech, and international.\n\nWe're in the very early stages of these offerings, but we believe they have the potential to expand the TAM for Coupang and extend our innovations to customers in new sectors and new markets. We'll continue to invest with discipline, in keeping with our operating tenets, starting with small investments, testing rigorously, and allocating more capital in opportunities that maximize our long-term cash flows. As you have seen with our execution in product commerce, we will be disciplined and long-term oriented in our investments in developing offerings. Overall, the results of Q3 despite the challenging environment reflect the focused execution of our teams and the fruits of significant investment over many years.\n\nWhile we remain vigilant about the persistent short-term pressures in the macro environment, we also continue to be excited by the strong underlying trends that we are seeing in the business. Now, I'll turn the call over to Gaurav to review the financials in more detail.\n\nGaurav Anand -- Chief Financial Officer\n\nThanks, Bom. As a reminder, we continue to look at our business through the perspectives of product commerce segment, representing our general merchandise and fresh offerings, and our developing offerings segment, which includes our investment in nascent initiatives like eats, play, Fintech and international. Our teams have executed remarkably over the last three quarters, reaching notable milestones in each quarter. We hit positive adjusted EBITDA for product commerce in Q1, achieved positive adjusted EBITDA for the consolidated business in Q2, and delivered a positive net income of $91 million for the consolidated business in Q3.\n\nWe are really proud of our teams and their execution. At the start of the year, we provided guidance for 2022 that we expected to achieve adjusted EBITDA of minus $400 million for the total company for the full year, and that our product commerce segment would be profitable by Q4 of this year. As of Q3, our adjusted EBITDA YTD for the entire business is over $170 million. We continued to see strong demand again this quarter.\n\nOur total net revenue grew 10% year over year on a reported basis, or 27% year over year and 8% quarter over quarter in constant currency. And more importantly, we continued the trend of growing at a multiple of the eCommerce segment growth. Our topline growth was driven by both strong customer adoption and deeper penetration with existing customers. Active customers grew 7% year over year.\n\nThe active customers in product commerce grew even faster. Our net revenue per active customer increased 19% year over year and 7% quarter over quarter on a constant currency basis, reflecting greater engagement by our customers. Our customers come to us every day for our unrivaled customer experience, low prices, and vast assortment and we strive to exceed those expectations with each interaction. We continued to invest hundreds of millions of dollars into our customers this quarter, through investments in free Rocket shipping and returns, discounted pricing, and free video content for our WOW members.\n\nQ3 marked another record quarter for gross profit margin. We generated over $1.2 billion of gross profit, a 64% year-over-year improvement. Our gross profit margin was 24.2%, an increase of nearly 800 bps year over year and 130 bps quarter-over-quarter. Product commerce continued the trend of strong gross profit margin expansion, increasing by over 720 bps year over year and 150 bps quarter-over-quarter, ending this quarter at 24.6%.\n\nThe drivers for this improvement remain consistent with the factors we have highlighted throughout this year, benefits from investments in technology, infrastructure, automation, supply chain optimization, and scaling margin-accretive offerings. This quarter we showed a large improvement in OG&A expenses as a percentage of revenue, improving 160 bps of revenue quarter-over-quarter, despite additional investments in fulfillment and headcount. Our operating margin performance demonstrates our ability to leverage our scale while we continue to invest with discipline for future growth. We do want to note that the reduction of OG&A expenses in absolute dollars was affected by the higher FX rate.\n\nWe also had a record $195 million of adjusted EBITDA, which is 3.8% of revenue. Product commerce generated an adjusted EBITDA of $239 million or 4.8% of revenue, driven by the gross margin expansion and leverage in other operating and general expenses. This level of adjusted EBITDA margins in our product commerce, reinforces our belief that we're on track to deliver our entitlement margin over the long term. In the short term, revenue remains hard to predict in these uncertain times, but we are pleased with our track record of growing at multiples of the Korean e-commerce segment and expect that trend to continue.\n\nAnd while we don't expect profitability improvement every quarter, we do expect to generate meaningful profit expansion over time. We are committed to maintaining discipline in our investments in nascent, long-term opportunities. We invest in these offerings, because we're excited about the opportunity to expand the TAM and generate greater cash flows over the long term. Earlier this year we communicated that we expected these investments in fintech, Coupang Play, and international would not exceed $200 million in 2022.\n\nOur year-to-date results thus far are consistent with that expectation. Operator, we are now ready to begin the Q&A.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Eric Cha of Goldman Sachs.\n\nEric Cha -- Goldman Sachs -- Analyst\n\nHi. Thank you for the opportunity to ask questions, and congrats on the great set of results. I have two questions. First, on the product commerce gross profit margin.\n\nAnd I understand that there were commentary around this in your early presentation, but would you give us bit more details around what this quarter leverage were for the product commerce gross profit margin to yet again go up as much as it did? And a bit of a near-term outlook would be helpful. And then, also, does this change your long-term target or outlook in any way? And the second question is the revenue seems to be up 7% sequentially, constant currency, but your opex seems to be flat, also adjusted for FX. It would be great if you can let us know where this operating leverage came from? Was there any specific efforts from the company this quarter, or can we consider this as being structural going forward? That's it.\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nThanks, Eric, for the question. On gross profit margin, you are seeing benefits from continuous improvement programs and many years of investment in technology, infrastructure, supply chain optimization, among others. These are consistent with the drivers that we've mentioned in the last few quarters, and you are seeing gains in the past few quarters, the gains won't come every quarter, but we expect to continue to see benefits from these improvements over time. This past quarter, process improvements, including automation were also big drivers.\n\nI mentioned the inventory waste challenge in fresh, offering wide selection creates the risk of inventory waste, in fact, increases the risk of inventory waste. Our teams were able to leverage machine learning, greatly improve forecast accuracy and inventory placement, helped reduce fresh inventory waste by over 50% in Q3 alone. Those are the kinds of initiatives that we continue to invest throughout the company. There are many such efforts currently ongoing.\n\nWe understand the drivers that are -- that we believe will get us to that long-term margin opportunity, which as we've stated before, is 7% to 10% or higher EBITDA. Those are the drivers that have led to 830 bps of gross profit margin improvement year-to-date. We are all excited about that long-term potential, but it is important to note that they will not happen overnight. And as you can imagine, Eric, we won't realize gains every quarter.\n\nGaurav Anand -- Chief Financial Officer\n\nYes. On the OG&A expenses, Eric, you're right to note that in constant currency, it was flat quarter-over-quarter. We generated efficiencies with process improvements and innovative projects in our fulfillment costs, which are in those numbers. While we continue to increase headcount, we also generated a few points -- a few bps of leverage with our scaling there.\n\nSo you're right to note, we believe it's structural as we continue to invest in both these areas in a disciplined way.\n\nEric Cha -- Goldman Sachs -- Analyst\n\nYep. Thank you.\n\nOperator\n\nYour next question comes from Stanley Yang of J.P. Morgan.\n\nStanley Yang -- J.P. Morgan -- Analyst\n\nThank you very much for your great result and congratulations again. The OP count -- and net profit counting positive was much lower than I think our expectation. And I think that's a big milestone of Coupang's financial history, and a meaningful step forwards your long-term EBITDA margin guidance. Can you please guide the next financial milestones, such as free cash flow turning positive point and your EBITDA margin guidance, achieving timing? And second question is, what will be the key strategic changes, once you turn free cash flow positive in the future? Are you going to pursue a more aggressive development -- developing business investments? Related to this question, you seem to ramp up rocket delivery and cross-border product in Taiwan, do you plan to enter Taiwan market with a sizable investment like in Korea, or do you have a different approach in Taiwan or other international market expansion?\n\nGaurav Anand -- Chief Financial Officer\n\nYes, regarding the -- Stanley, I'll take the first part of your question. So as you pointed out, Stanley, we are really excited about the milestones we have hit this year. In Q4, we got to adjusted EBITDA positive for product e-commerce. In Q2, we got to adjusted EBITDA positive for the entire company.\n\nAnd Q3, we got to positive net income for the entire company. So our next milestone that we are focused on is being free cash flow positive. Historically, prior to 2021, our free cash flow was roughly equivalent to or better than our adjusted EBITDA. This year, specifically, we have made some strategic investments, including onetime capex in owning facilities and building facilities, large inventory buys in areas of growth.\n\nBut over time, we expect this relationship between free cash flow and adjusted EBITDA to normalize. That's our next milestone to deliver.\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nStanley, thanks for the question. And just I think Gaurav meant Q1, not Q4, but on the product commerce adjusted EBITDA positive. I think to your question about whether there will be strategic changes in our investment approach in the future, whether Taiwan, other markets will be sizable investments. First of all, we're excited about the long-term opportunity in markets beyond Korea.\n\nWe do believe that we -- we're confident that we can be intelligent and disciplined in our execution. We also believe we have opportunities to leverage many strengths that we've already built, including technology, processes and even selection. And as you've seen us demonstrate in our core offerings, we execute in keeping with our operating tenants. We communicated earlier this year, that we expected our investments in fintech and play and international would not exceed $200 million in 2022.\n\nOur year-to-date results thus far are consistent with that expectation. Our investment approach is not dependent on our financial results from our core offerings. It's always been in keeping with our disciplined approach, our operating tenants that we shared, shortly after we went public last year. We test and iterate.\n\nWe make sure that we're confident of long-term cash flow potential, before we invest more. And when we do invest more, it's a reflection of that confidence. So we don't expect our philosophy, our culture to change. We hope to continue to show and show you that we can execute in an intelligent and measured fashion.\n\nStanley Yang -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from Seyon Park of Morgan Stanley.\n\nSeyon Park -- Morgan Stanley -- Analyst\n\nHi. Good morning. I guess good evening to some of you. Thank you for the opportunity.\n\nTwo questions from my side. As you look into the fourth quarter, which is seasonally strong for Korea. But then I think in the past, you've also seen that the fourth quarter tends to be a little bit more promotional and competitive. Does that imply that we should be expecting some of that promotional activity to impact your gross margin in the fourth quarter is my first question? Second question is, can we get some kind of color on how much advertisement revenue you are generating, what's the kind of run rate that we could expect for the year, and what kind of potential you see from ads? I think if we look at some of the international benchmarks like Amazon or I think JD, 5% plus of GMV apparently is being generated in terms of advertisements.\n\nWould that be some kind of a benchmark that we could also look forward to, as you grow your advertising business?\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nI think to your question about quarterly guidance, we expect to -- we intend to share annual guidance at the beginning of the new year as we did this year. I think while we're excited about our progress to date, we exceeded our adjusted EBITDA guidance for the year. These are uncertain times, and we'd like to refrain from making specific revisions. I think in general, if you look at our business on the -- our growth and our customer spend growth in particular, is really driven by the experience that we've built over many years.\n\nThe constant everyday low price, fast delivery, vast assortment, it really isn't dependent on any short-term or periodic promotions -- and as we pointed out, the spend of our customers continues to compound at a fast rate. We're seeing strong growth across all categories, even our largest. And that everyday promise selection of low prices, fast delivery is what we're focused on. That continues to be the driver for growth.\n\nAnd certainly has been the driver for growth over the last few quarters, we can expect it to be the driver of growth in quarters and years to come. On ads, we're pleased with the progress that it's making. It has been a positive story over the last year, and it's still far early and far from where we want it to be. We have opportunities to improve that service and expand functionality, and I think it's also important to note that, we've seen synergy between ads in not only our product commerce with many offerings, beyond that as well.\n\nAnd it will continue to benefit from the continued growth of our overall business. So it's still very early in that journey, and we're excited about the potential to come.\n\nSeyon Park -- Morgan Stanley -- Analyst\n\nThank you and congrats again on the great results.\n\nOperator\n\nYour next question comes from Susie Lee of Bank of America.\n\nSusie Lee -- Bank of America Merrill Lynch -- Analyst\n\nThank you for the opportunity for a question. I have one quick question regarding your labor cost and operating expenses. So in Korea, as you are aware, those headline and core inflation are rising rapidly. And then, do you expect to see any incremental burden on your labor cost, especially for those working in either logistics center or those working in last-mile delivery, especially your Coupang fresh? And if there is any upward burden on your labor cost? How would that potentially impact your overall operating expenses and the margin? So that will be all.\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nThere are inflationary headwinds. But our results this quarter, again, were net positive because of our investments, our disciplined execution that we continue to see benefits from throughout the year. At least so far, we don't believe that these factors will create a material disruption to our business. While the macro conditions are uncertain, we continue to be confident about our ability to drive the inputs that we control in our business.\n\nSusie Lee -- Bank of America Merrill Lynch -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nYour next question comes from James Lee of Mizuho.\n\nJames Lee -- Mizuho Securities -- Analyst\n\nThanks for taking my questions. Two here, first one on consumer behavior. In the U.S., we saw a mix shift to services and offline. And just curious what you're seeing? Whether you're seeing a similar trend? And also with inflation in Korea, are you seeing any sort of consumer trade down? And second question is on EBITDA guidance, any adjustment to your prior kind of indication? Should we assume that your disciplined approach in investment will kind of carry over in FY '23, how should we think about maybe puts and takes on the profitability levels heading into FY '23?\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nJames, as I mentioned our guidance, I think we'll reserve that for the beginning of the new year, as we did this year. You're right that the underlying strength of the business that we're seeing today, we're encouraged by it. But I think any adjustments to guidance or revisions, we'd like to -- we look forward to sharing that at the beginning of the new year. And your first question was about?\n\nJames Lee -- Mizuho Securities -- Analyst\n\nConsumer behavior, any mix shift?\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nConsumer behavior. Perhaps it's a reflection of how early we are, the stage of our journey that we're at, but we're seeing strong growth across all categories. Our customer cohorts are compounded. We're still a very small percentage.\n\nWe're a small percentage of the overall commerce market, that's projected to exceed $600 billion by 2025. The overall retail market in Korea is also showing signs of strength, growing 7% year over year this past quarter, which is reminiscent of the strong growth it had displayed in the years leading into -- prior COVID. So the overall market is growing. We're still a small percentage of it.\n\nWe're seeing compounding cohorts still across all categories, even our oldest -- even our largest. We still don't know what the full potential spend is for our customers in any category, much less in aggregate. What we do know is that we're still early in the journey, and customers want selection, low prices, that has delivery in all categories, we have yet to find an exception to that simple truth.\n\nJames Lee -- Mizuho Securities -- Analyst\n\nIf I can squeeze in a follow-up question, and I get a lot of questions from investors in general. In the U.S., Amazon has been raising its Prime membership monthly pricing or yearly pricing. I think they did that early in the year. Just wondering, from your perspective, do you have any -- do you feel like you have any room to increase your pricing? And if that's the case, why do you think that's the case?\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nOur focus in WOW, continues to be on creating extreme value surplus for our members. We want the benefits to vastly exceed the price they pay. We've added seven services to WOW since launch. We're still looking to invest in more.\n\nWe'll keep expanding the value proposition so that it is in excess of the price they pay for WOW members for years to come. That's our strategy and that's our plan.\n\nOperator\n\nYour next question comes from Josh Levin of Autonomous Research.\n\nJosh Levin -- Autonomous Research -- Analyst\n\nHi. Good morning. I have two questions. The first question is, so net revenue per active customer was up quite a bit year over year on a constant currency basis.\n\nCan you provide some more granular color as to what is driving that and how sustainable that trend might be? How much of that trend is greater frequency of purchase versus a wider diversity of goods purchased? And second, active customers were up just a bit quarter-over-quarter, but how much would active customers be up, if you excluded Coupang Eats customers?\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nThe net revenue per active, as I mentioned, it's a reflection of the stage of growth that we're at. We're still a small percentage of the overall commerce market. We are seeing greater frequencies, [inaudible] from all the variables that you mentioned. We're seeing customers spend compound in existing categories and new categories, even our oldest -- even our most mature even [inaudible].\n\nOperator\n\nYou are muted. You can unmute yourself by pricing six.\n\nJosh Levin -- Autonomous Research -- Analyst\n\nSignificant spend growth in our cohorts. And what's driving that is selection, low prices, fast delivery, the convenience of rocket delivery and returns among other services. It's what our integrated end-to-end integrated network delivers. It's what we invested billions of dollars to build a technology and infrastructure and processes around, we continue to optimize that.\n\nSo the experiences get better, more reliable, faster, cheaper for our customers. We believe that will continue to drive our customers spend growth, as well as our active customers. On active customers as you mentioned -- sorry, can you repeat the [inaudible]\n\nYes. The question was how much our [inaudible].\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nNo, it was about product commerce. That's right. You're right to observe that active customers grew 7% year over year for the consolidated business, and product commerce, active customers grew even faster. So you're absolutely right to observe that difference.\n\nSo we're still seeing great momentum in both active customer growth. [inaudible] Should we move to the next question?\n\nOperator\n\nYes. Your next question comes from the line of Junhyun Kim of HSBC.\n\nJunhyun Kim -- HSBC -- Analyst\n\nThanks for your opportunity to [inaudible].\n\nOperator\n\nYou may proceed with your question.\n\nJunhyun Kim -- HSBC -- Analyst\n\nCan you hear me?\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nApologies to everyone. I think we're having some technical problems.\n\nJunhyun Kim -- HSBC -- Analyst\n\nSorry for this. Could you -- can you hear me?\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nYes, we can hear you. OK.\n\nJunhyun Kim -- HSBC -- Analyst\n\nSorry for this. Thanks for your opportunity to ask, could you please share any data for -- any operating ratio [inaudible].\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nI think we are having trouble with the operator. So I'm not sure exactly how we can hear the questions. Hi operator, could you unmute? OK. Unfortunately, I think we have to end the call.\n\nThank you, everyone, for your questions today and for your time. We really appreciate your time and questions. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Parker -- Vice President, Investor Relations\n\nBom Suk Kim -- Founder and Chief Executive Officer\n\nGaurav Anand -- Chief Financial Officer\n\nEric Cha -- Goldman Sachs -- Analyst\n\nStanley Yang -- J.P. Morgan -- Analyst\n\nSeyon Park -- Morgan Stanley -- Analyst\n\nSusie Lee -- Bank of America Merrill Lynch -- Analyst\n\nJames Lee -- Mizuho Securities -- Analyst\n\nJosh Levin -- Autonomous Research -- Analyst\n\nJunhyun Kim -- HSBC -- Analyst\n\nMore CPNG analysis\n\nAll earnings call transcripts"
}