{
  "companyName": "CorMedix Inc Common Stock",
  "companyTicker": "CRMD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/cormedix-inc-common-stock-crmd-q2-2022-earnings-ca/",
  "content": "CorMedix Inc Common Stock (CRMD 6.30%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGreetings, and welcome to the CorMedix Inc. second quarter 2022 earnings call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to your host, Dan Ferry from Life Science Advisors.\n\nPlease go ahead.\n\nDan Ferry -- Investor Relations\n\nGood morning. And welcome to the CorMedix second quarter 2022 earnings conference call. Leading the call today is Joe Todisco, chief executive officer of CorMedix. And he is joined by Dr.\n\nMatt David, executive vice president and CFO; Dr. Phoebe Mounts, EVP, general counsel; and head of technical operations, Erin Mistry, SVP of commercial. Before we begin, I would like to remind everyone that during the call, management may make what are known as forward-looking statements within the meaning set forth in the Private Securities Litigation Reform Act of 1995. These statements are subject to certain risks and uncertainties and include, but are not limited to, any of the following: any statements other than statements of historical fact regarding management's expectations, beliefs, goals and plans about the company's prospects, including its clinical development program, manufacturing activities and marketing approval, for DefenCath in the U.S.\n\nand other product candidates; future financial position; future revenues and projected costs; and potential market acceptance of DefenCath, Neutrolin and other product candidates. More specifically, forward-looking statements include any statements about our clinical development plans and the timing, cost, progress, results, estimates and interpretations thereof, projections as to the company's future capital raising and spending and cash position; expectations as to the timing and nature of anticipated regulatory actions; possible product licensing, business development or other transactions; any commercial plans and expectations, market projections for our product candidates; and expectations as to manufacturing and product component costs. Actual results may differ materially from these projections or estimates due to a variety of important factors, including, but not limited to, uncertainties related to clinical development, regulatory approvals and commercialization. These risks are described in greater detail in CorMedix's filings with the SEC, copies of which are available free of charge at the SEC's website at www.sec.gov or upon request from CorMedix.\n\nCorMedix may not actually achieve the goals or plans described in these forward-looking statements, and investors should not place undue reliance on these statements. Please note that CorMedix does not intend to update these forward-looking statements, except as required by law. At this time, it is now my pleasure to turn the call over to Joe Todisco, chief executive officer of CorMedix. Joe, please go ahead.\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Dan. Good morning, everyone. And thank you for joining us on this call. Today's call marks my first full quarter at the helm of CorMedix, and I remain as excited about the future potential for the company and our lead product to DefenCath as I was the day I joined.\n\nOver the last three months, the company has made progress on all fronts working diligently in support of our CMO as they underwent a critical FDA inspection as well as undertaking multiple steps to be ready for commercialization as quickly as possible following a potential FDA approval. Unfortunately, as CorMedix announced on Monday, FDA informed us that the DefenCath NDA cannot be approved until satisfactory resolution of deficiencies at the CMO and at our manufacturing facility of our heparin supplier. While I'm disappointed that the application received a complete response letter I believe the actions we are taking in support of our existing CMO and heparin supplier as well as adding another CMO in the U.S., Alcami, and adding another heparin supplier. Give the company multiple pathways toward obtaining FDA approval of the NDA.\n\nAs Phoebe will explain in more detail, the FDA conducted a pre-approval inspection at the existing CMO and the CMO submitted full responses and corrective action plans in a timely manner. Unfortunately, there was not sufficient time between the close of the inspection and our original PDUFA date of August 25, and to the CMO to fully implement all corrective actions and obtain FDA's verification thereof. In addition, our API side, we issued a warning letter for deficiencies unrelated to heparin, and although they are working aggressively to remediate the issues they were also unable to fully implement corrective actions and obtain FDA verification prior to our PDUFA date. I am optimistic that both organizations have the capability to remediate these issues in the ensuing months ahead, clearing the way for a potential FDA approval of the product.\n\nNotably, the CRL cited no other deficiencies related to DefenCath or requirements for NDA resubmission. While CorMedix works with the CMO to resolve the deficiencies and resubmit the NDA, it is also working to be prepared to commercialize as early as the first quarter of 2023. In addition, FDA has also notified the company that although the trade name defend cats had been conditionally approved previously, the agency has now identified a potential confusion with another pending product name with a market application under review. The ultimate acceptability of our proposed trade name is dependent upon which application is approved first.\n\nAs a precaution, CorMedix has already submitted an alternative proprietary name to the agency, which we'll undergo review. From a commercial standpoint, on Monday, August 1, the Center for Medicare and Medicaid Services, or CMS, published in the Federal Register, the conditional new technology add-on payment or NTAP reimbursement for DefenCath of $4,387.50 per average hospital stay, which assumes three vials of DefenCath utilized for catheter locks following three dialysis sessions. As we discussed on the last earnings call, the NTAP is conditioned upon DefenCath obtaining final FDA approval of the NDA prior to July 1, 2023, and will take effect in the first calendar quarter following FDA approval of the NDA. NTAP reimbursement would be specific to hospital inpatient utilization of DefenCath and the $1,462.50 per vial reimbursement is derived from an expected WAC price of $1,950 per vial.\n\nThe WAC price of a pharmaceutical, which is the wholesale acquisition cost is essentially the gross list price for a drug product and not necessarily representative of the ultimate net price charged to a hospital institution or clinic. As we have stated previously, we expect to have a higher net price in the hospital inpatient setting where utilization is lower and less frequent than in the outpatient dialysis setting where utilization is expected to be much higher. Due to the nature of our healthcare reimbursement system, we are required to have only one WAC price regardless of setting of care but the net price in each setting may be different. The company intends to submit a duplicate NTAP application to CMS this October in order to preserve our ability to obtain a new NTAP should final FDA approval not be obtained prior to July 1, 2023.\n\nWhile our NTAP is specific to inpatient reimbursement, we continue to take a two-pronged approach with respect to outpatient reimbursement. First, we remain committed to our efforts to secure a transitional drug add-on payment adjustment or TDAPA as soon as practicable after securing our anticipated FDA approval. TDAPA is an incremental payment to the renal dialysis service bundle allocated by CMS to outpatient dialysis clinics. While we do see TDAPA as a viable reimbursement pathway to drive utilization of DefenCath, we believe there are compelling arguments that DefenCath does not fall within the scope of products and services calculated as part of the dialysis bundle under the current statute and therefore, should be reimbursed separately by CMS.\n\nAnd as an outpatient drug product with a unique J code. We believe a unique J code and separate reimbursement better incentivizes dialysis operators to utilize the product for the betterment of patient outcomes. To be clear, any decision to separately reimburse DefenCath or to grant DefenCath TDAPA is ultimately at the sole discretion of CMS but we will be working diligently over these next few months, along with other key stakeholders such as hospital systems, dialysis clinics and patient advocacy groups to make these arguments to CMS. Final FDA approval of DefenCath is required before we are able to submit a formal application for TDAPA or a unique J code and the estimated timing to a decision from CMS is approximately six months from submission of the application in both instances.\n\nAt this time, I'd like to turn the call over to Phoebe who will provide an update on regulatory affairs and manufacturing. Phoebe?\n\nPhoebe Mounts -- Executive Vice President and General Counsel\n\nThanks, Joe. And good morning, everyone. As Joe mentioned earlier, the FDA has issued a second complete response letter for the DefenCath NDA. As part of the NDA review process, FDA conducted a pre-approval inspection at two locations for our CMO that are listed in the NDA as being utilized in the manufacture, testing and release of the product.\n\nThis was the first physical inspection conducted by FDA at the CMO for the NDA review as FDA conducted only a dust review of documents following the original NDA submission. The primary site received four inspectional observations related to overall quality systems, standard operating procedures or SOPs and operating equipment. Our CMO developed a robust corrective action plans and submitted responses to FDA within the required 15-day period. As part of the response and corrective actions, our CMO has committed to providing the agency with ongoing periodic reports outlining progress on corrective actions and also requested a meeting with FDA to discuss the implementation of the corrective actions.\n\nFDA has not yet responded to the meeting request. The CMO laboratory facility, which is utilized in testing and release of DefenCath also received inspectional observations. As these observations did not involve any equipment or processes supporting our NDA and included the confidential information of other third parties, we do not have any visibility into the specific observations, but our CMO has informed us that responses have been committed to FDA in a timely manner. Our CMO has also committed to the agency to engage external consultants who are very experienced in FDA's requirements for CGMP compliant.\n\nThose consultants have been identified, and the CMO is in the process of finalizing agreements with them to accelerate implementation of appropriate corrective actions. FDA's procedures require classification of inspectional observations as either voluntary action indicated or VAI or official action indicated or OAI. A classification of VAI does not block new approvals from a facility and would not be expected to have any impact on the approval timing of the NDA. However, classification as OAI may result in compliance action by FDA in certain circumstances and may block any pending product approvals, listing the facility in the application.\n\nWe have not been informed of a classification determination for the inspectional observations at the CMO. Unrelated to any pre-approval inspection for the NDA. CorMedix was informed by our current heparin API supplier that FDA conducted an inspection of its manufacturing facility. The inspection was unrelated to the manufacture of heparin and resulted in inspectional observations that culminated in a warning letter due to deviations from current good manufacturing practices for an unrelated API.\n\nOur API supplier utilizes multiple sites in the manufacturing process for heparin and the warning letter is specific to a site where only early stage processing of heparin is done and involves buildings, equipment and personnel that are not utilized in the manufacture of heparin. The classification of the inspectional observations was official action indicated. When FDA issued a warning letter, we sought guidance from the agency as to whether the warning letter would impact the approval timing of DefenCath. We worked with our heparin API supplier to submit to FDA or a robust package outlining the facilitiesm, personnel and quality systems utilized in the manufacture of heparin as being distinct and separate from those utilized to manufacture the unrelated API.\n\nAnd that we do not anticipate any impact to heparin quality as a result of the cited deficiencies. By way of the CRL, the FDA has now informed us that resolution of the warning letter deficiencies will be necessary to obtain NDA approval of DefenCath in its present form. Our heparin supplier has also engaged an independent CGMP consultant to help the company expedite resolution of the deficiencies communicated in the warning letter. We intend to continue to work collaboratively with our manufacturer, API suppliers, and the agency to obtain NDA approval as quickly as possible from the existing CMO facility.\n\nWhile at the same time, we believe it is important to establish an alternative supply chain to mitigate any long-term risk should these compliance concerns take longer than expected to resolve. In this regard, we recently announced that we have finalized an agreement with Alcami Corporation, a U.S.-based contract manufacturer with proven capabilities for manufacturing, commercial, sterile parenteral drug product. Alcami will function as an additional manufacturing site for DefenCath for the U.S. market.\n\nWe have been working diligently over the last several months to transfer the final manufacturing process into an Alcami site, and CorMedix expects to be able to submit a supplement with Alcami data to its NDA application around the end of the first quarter of 2023. As part of the technology transfer and validation of the manufacturing process at Alcami, CorMedix has procured and is planning to qualify an additional supplier of heparin API sourced from a major U.S. manufacturer, Alcami as well as the new supplier of heparin API have robust history of U.S. FDA CGMP inspections and approvals.\n\nJust to be clear, from a timing perspective, our fastest pathway to market remains FDA clearance of the compliance deficiencies at our existing CMO and API supplier because the CRL does not require any additional work by CorMedix for resubmission of the NDA. On the other hand, the submission with Alcami requires validation of the manufacturing process and generation of information, including stability data which we expect to be available by the end of the first quarter of 2023. While I am, too, disappointed to have received the second CRL, I am gratified that there were no product-specific issues for CorMedix to address before resubmission and proud of the hard work and the progress that we have made. CorMedix will continue to work with our existing CMO and heparin supplier in parallel with Alcami to secure marketing approval for a novel antimicrobial catheter lock solution to address an unmet medical need for dialysis patients.\n\nI would now like to turn the call over to Matt, who will provide a financial update for the quarter. Matt?\n\nMatt David -- Executive Vice President and Chief Executive Officer\n\nThanks, Phoebe. Good morning. I'm pleased to be here today to provide an overview of our second quarter and first half of 2022 financial results as well as an update on our cash position. The company has filed its report on Form 10-Q for the second quarter ended June 30, 2022.\n\nI urge you to read the information contained in the report for a more complete discussion of our financial results. With respect to our second quarter of 2022 financial results, our net loss was approximately $7.6 million or $0.19 per share compared with a loss of $4.6 million or $0.12 per share in the second quarter of 2021. The higher net loss recognized in 2022 compared with 2021 included an increase in both SG&A expenses and R&D expenses versus the second quarter of 2021. Operating expenses in the second quarter of 2022 increased approximately 41% to $8.3 million compared with $5.9 million in the second quarter of 2021.\n\nR&D expense increased by approximately 28% to $3.2 million, driven by an increase in costs related to the manufacturing of the DefenCath prior to its potential marketing approval partially offset by net decreases in personnel expenses, consulting fees and clinical trial expenses. SG&A expense increased approximately 50% to $5.1 million compared with $3.4 million in the second quarter of 2021. This increase was primarily attributable to an increase in costs related to market research studies and prelaunch activities in preparation for the potential marketing approval of banca, a net increase in personnel expenses and increases in legal fees and noncash charges for stock-based compensation. With respect to our first half of 2022 financial results, total operating expenses during the first half of 2022 amounted to $15.3 million compared with $13.1 million in the first half of 2021, an increase of 17%.\n\nR&D expense increased 6% to $5.5 million, driven primarily by an increase in costs related to the manufacturing of DefenCath prior to its potential marketing approval, partially offset by net decreases in personnel expenses, clinical trial expenses and consulting fees. SG&A expense increased approximately 23% to $9.8 million compared with the first half of 2021, primarily driven by an increase in legal fees, an increase in personnel expenses and an increase in costs related to market research studies and prelaunch activities in preparation for the potential marketing approval of DefenCath. We recorded net cash in operations during the first half of 2022 of $12.2 million compared with net cash used in operations of $9.8 million in the first half of 2021. The difference was primarily driven by an increase in net loss primarily attributable to an increase in operating expenses as compared to the same period in 2021.\n\nCorMedix remains in a good position from a balance sheet perspective. The company has cash and equivalents of $64.6 million as of June 30, 2022. Includes approximately $11.4 million raised during the first half of 2022 through our ATM program and approximately $0.6 million from the sale of unused New Jersey NOL. We believe our cash and equivalents gives the company flexibility to fund its operations at least through the third quarter of 2023.\n\nAfter taking into consideration costs related to manufacturing activities and costs related to the potential commercial launch for DefenCath. As Joe and Phoebe have discussed today, we remain optimistic about our progress toward an anticipated FDA approval for DefenCath. We believe that our current cash and equivalents as well as the potential mechanisms available to us for capital raising allow us to be prepared for the future, given we are facing what we hope and believe will be a pivotal time ahead for CorMedix as we seek to bring to DefenCath to patients in the hemodialysis setting. I will now turn the call back over to Joe for closing remarks.\n\nJoe?\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Matt. As I look toward our next few months, I remain excited about the opportunities and optimistic about the challenges that lay ahead. DefenCath has the potential to address a critical unmet medical need and if approved by FDA. And can significantly improve patient outcomes while also having an impact on the health equity disparity that is pervasive in our healthcare system.\n\nCatheter-related blood stream infections, or CRBSI, place a heavy financial burden on the U.S. healthcare system, estimated at roughly $2.3 billion per year of incremental cost. Hemodialysis patients with the CRBSI have doubled the rate of hospitalization as noninfected HD patients with an average duration of stay that is four times longer and a three times higher fatality rate. In addition, African Americans represent under 14% of the U.S.\n\npopulation but account for more than 35% of patients undergoing hemodialysis. To that extent, African Americans are disproportionately at risk for catheter-related blood stream infection compared to other demographic groups. DefenCath in clinical trials, reduced CRBSI occurrence by 71% in hemodialysis patients compared to the existing standard of care, heparin. Taken in totality, the strong clinical profile of DefenCath and potential to significantly improve patient outcomes and health equity, while also potentially decreasing the overall cost burden on the healthcare system.\n\nI continue to see DefenCath as a critical drug product and strong platform asset for growth from which CorMedix can build. While the CRL is an unfortunate speed bump, our quickest pathway to market remains resolution of deficiencies at our existing CMO and API supplier, and CorMedix is committed to mobilizing all resources to achieve that objective. I remain confident in our ability to bring this product to market in order to address a significant unmet medical need. Thank you for your continued support of and interest in CorMedix.\n\nOperator\n\n[Operator instructions] The first question is from Jason Butler of JMP Securities. Please go ahead.\n\nUnknown speaker\n\nHi. It's Roy for Jason. Thanks for taking our question. I had a few on the manufacturing bit first.\n\nI guess, can you just tell us the location of the current heparin supplier? Is Alcami -- just so I'm clear. Is Alcami we going to work with that supplier as well or just a new supplier? And then conversely, is the current contract manufacturer also going to begin work with the new heparin supply source? Or are they going to stick with the old source?\n\nJoe Todisco -- Chief Executive Officer\n\nOK. Thanks, Roy. In terms of the API player, I think we're comfortable saying it's in Europe. Alcami will only be working with the new heparin supplier for the time being.\n\nThat's the work stream that we are focused on. And the existing CMO will remain with the existing heparin supplier. And that's the current way we've set up the work streams.\n\nUnknown speaker\n\nOK. Great. And then if you submit the supplement at the end of 1Q next year, what do you expect to get for a review period, assuming it's accepted and then on the reimbursement bit for the outpatient part, do you guys have any examples of companies that have argued to CMS for the J code and now the TDAPA have been successful? Thanks.\n\nJoe Todisco -- Chief Executive Officer\n\nWell, to address the first question first on time lines, I'm going to turn that over to Phoebe. If you want to comment on review period.\n\nPhoebe Mounts -- Executive Vice President and General Counsel\n\nCertainly. Thanks for the question, Roy. It depends on what you're referring to is the submission in the first quarter of 2023. If as we hope the deficiencies can be addressed quickly, then the submission that would be in place would be a resubmission of the NDA with the current CMO, and we would expect that to properly be a Class I, which has a shorter review period of two months because, as I said, there's nothing on the product side that needs to be submitted in the NDA.\n\nAnd we will presumably have the go ahead from FDA for resubmission. So we would expect that to be a quick review. If however, the resubmission is -- involves the new CMO then we obviously have manufacturing information that will need to be reviewed by FDA for the facility, and that should properly be a Class II resubmission and that would be a six month review period.\n\nUnknown speaker\n\nOK, thanks.\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Phoebe. And on the reimbursement question, look, TDAPA is a relatively new program. So there's not a whole lot of history there in terms of what arguments companies have made with respect to TDAPA or separate reimbursement. In addition, those discussions with CMS are fairly confidential between the companies and CMS.\n\nSo we don't have any -- there's no public record I can point to with an example. So it's possible. We are unique in making this argument as our product is somewhat unique.\n\nUnknown speaker\n\nOK. Make sense. Thank you.\n\nOperator\n\nOur next question is from Joon Lee of Truist. Please go ahead.\n\nUnknown speaker\n\nGood morning. This is Lez on for Joon. Thank you for taking my question. Joe, I guess we'll start on the pricing.\n\nThank you for that color that you provided. Can you provide a little bit more detail, I guess, on how this -- how do you expect to play out closer to approval -- and when do you think you'll be in a position to announce finalized pricing. Thank you.\n\nJoe Todisco -- Chief Executive Officer\n\nWell, look, we've listed WAC as part of our NTAP application. Certainly, we are not bound to list at that WAC. As we said in the prepared comments, we have to set one WAC even though we do expect to have different net pricing across different settings of care, we're not going to comment at this time on net pricing in those specific settings other than to say we do expect outpatient to be lower, right, than what we see on the inpatient side. I think in terms of net pricing, I don't know that we're going to be publishing specific pricing by setting of care or -- the customer, but we'll try to give some guidance as we get closer to commercialization.\n\nUnknown speaker\n\nGot it. That's helpful. And then in regards to the APA supplier, what kind of time frame is appropriate for resolution of the warning letter and then do you think the warning letter needs to be closed out before the NDA can be refiled?\n\nJoe Todisco -- Chief Executive Officer\n\nSo your -- the question was only specific to the API supplier?\n\nUnknown speaker\n\nCorrect.\n\nJoe Todisco -- Chief Executive Officer\n\nOK. Phoebe, do you want to address that?\n\nPhoebe Mounts -- Executive Vice President and General Counsel\n\nSure. Thanks, Les. It is a time line for resolution of warning letters totally depends on the interactions between the facility and FDA. And we're obviously not part of that process.\n\nAnd we are aware of information provided by the API supplier that they are working as fast as possible to get the issues resolved. And we have been told by FDA that the DefenCath NDA needs to have those issues resolved before we can resubmit. So I think we intend to monitor the situation as closely as possible but there's no statutory time for resolution of issues in a warning letter is up to the agency's discretion.\n\nUnknown speaker\n\nThat is helpful. On the with Alcami than you have similar capacity to the current EU CMO. And also, it sounds like you've identified the alternate source for heparin API supplier. How quickly could that be put into place? And will they just work alongside of Alcami at the same time?\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Les. So in terms of capacity, Alcami has sufficient capacity to handle our commercial needs should we need them to. In terms of the alternate -- or the additional API source, the time line would be similar to -- or identical to the time line of getting Alcami approved. Those would work in tandem.\n\nThat submission would go in. with the new API and or if that submission is approved, the new API would be approved with it.\n\nUnknown speaker\n\nGot it. Thank you. And then last one for me would be on the -- you mentioned the trade name issues. Can you just clarify that a little bit more? What are your options here? Is there a potential for renaming? And has that affect any impact that you already have completed on your marketing efforts? And is there any issue in refiling on the NDA for that, too? Thank you.\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Les. There's really no issue here. It's not unusual what happens periodically when applications are under review. When they go in, there may not be any names that have sounded like complex.\n\nBut over time, as new names get submitted, the FDA identifies the source of confusion, notifies both application holders that there's a potential conflict and you have the ability to submit an additional name. The application that gets approved first gets the original name and the application that gets approved second, we get an alternative name. We've identified an alternative name. I think both names are adequate for our marketing purposes and which every name we move forward with, I'm confident there's no change in value.\n\nUnknown speaker\n\nGot it. Thank you.\n\nOperator\n\nOur next question is from Rohit Bhasin Needham & Co. Please go ahead.\n\nRohit Bhasin -- Needham and Company -- Analyst\n\nHi. This is Rohit on for Serge. Thank you for taking our question. In terms of the NTAP reimbursement, there's a conditional approval by July 2023.\n\nAre you able to extend the date if the state can't be met and talk about the options there.\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Rohit. As I said in my prepared remarks, we're going to submit a duplicative application this October to get into the next NTAP review cycle with the expectation that we would still be eligible for approval as we were this year. So to the extent that we did not get final NDA approval by July 1, 2023, and this NTAP did not take effect. We would have that application hopefully approved by that point in time.\n\nRohit Bhasin -- Needham and Company -- Analyst\n\nThanks. And then another one regarding the prefilled syringe product. Just based on where we are now, how much of a priority is that? And then, I guess, how do you expect to move that forward? Thanks.\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Rohit. So I mean, I really see the PFS as more of a life cycle management. Obviously, it's nice to have. It's not critical to approval or to launch.\n\nWe are focused on getting approval of the NDA. And we will continue to move PFS forward, but once we have final approval of the NDA.\n\nRohit Bhasin -- Needham and Company -- Analyst\n\nThank you.\n\nOperator\n\nI will now hand the call over to Dan Ferry for any recent questions. Dan?\n\nDan Ferry -- Investor Relations\n\nThank you, operator. We do have a few written questions here, Joe. The first one is, given the CRL and continued delays on the regulatory side, could you walk us through what the commercial team is focusing on? What can we expect over the coming months?\n\nJoe Todisco -- Chief Executive Officer\n\nSure. Thanks, Dan. So there's a lot of, I'll call it, pre-commercial activities that still need to take place Certainly, on the infrastructure and systems side as we're preparing to be able to warehouse, distribute, ship product, collect cash. Those work streams all continue unimpeded.\n\nThen there's also a large number of activities on the, we'll call it, the true marketing side. I'm going to let Erin comment a little bit, but there's certainly a lot of disease state awareness with respect to CRBSI that needs to take place. Erin, do you want to add some commentary?\n\nErin Mistry -- Senior Vice President, Commercial\n\nSure. Thanks for the question. The commercial team, we're going to continue to focus and refine the inpatient and outpatient markets. There's a lot of market dynamics, specifically going on with the Medicare Advantage plans and the evolving risk share arrangement from both settings of care.\n\nAnd those risk share arrangements are both financial and outcomes based. So we've got continued segmentation there. We also will work with conversations with hospital P&T committee members and key opinion leaders. And as Joe mentioned, there's heavy marketing efforts around the disease awareness campaign and our engagement with some of those key conferences.\n\nRegardless of that, there's a lot of advocacy and political support for the reimbursement in the outpatient setting. We'll continue to work with those key stakeholders as well.\n\nDan Ferry -- Investor Relations\n\nThanks, Joe. Thanks, Erin. I have another one here. What is factored into the current cash guidance when you say through 3Q of 2023?\n\nJoe Todisco -- Chief Executive Officer\n\nThanks, Dan. I'm going to let Matt comment on that.\n\nMatt David -- Executive Vice President and Chief Executive Officer\n\nSure, no problem. In terms of the cash guidance we give today. This includes ongoing manufacturing activities, commercial launch supply and other commercial prep. Clearly, we would plan to moderate our cash burn to align with the time line for a potential regulatory approval, for example, the hiring of the field force and other larger items.\n\nDan Ferry -- Investor Relations\n\nAll right. Matt I have another one here for you. Does the company need to do a large financing to fund ongoing spend?\n\nMatt David -- Executive Vice President and Chief Executive Officer\n\nOK. Thanks for the question. We don't need to do a significant amount of financing given our cash runway takes us at least through the third quarter of 2023. As we have said in the past, CorMedix is always looking at a range of opportunities to fund our ongoing business and we have both the shelf on file as well as an ATM in place if needed.\n\nDan Ferry -- Investor Relations\n\nThanks, Matt. Operator, this concludes the written question portion of the Q&A session. You may now close the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDan Ferry -- Investor Relations\n\nJoe Todisco -- Chief Executive Officer\n\nPhoebe Mounts -- Executive Vice President and General Counsel\n\nMatt David -- Executive Vice President and Chief Executive Officer\n\nUnknown speaker\n\nRohit Bhasin -- Needham and Company -- Analyst\n\nErin Mistry -- Senior Vice President, Commercial\n\nMore CRMD analysis\n\nAll earnings call transcripts"
}