{
  "companyName": "Tuya Inc.",
  "companyTicker": "TUYA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/tuya-inc-tuya-q2-2022-earnings-call-transcript/",
  "content": "Tuya Inc. (TUYA 1.60%)\nQ2 2022 Earnings Call\nAug 29, 2022, 8:00 p.m. ET\n\nOperator\n\nGood morning, and good evening, ladies and gentlemen. Thank you for standing by, and welcome to Tuya Inc. second quarter 2022 earnings conference call. [Operator instructions] I will now turn the call over to the first speaker today, Mr.\n\nReg Chai, capital market associate director of Tuya. Please go ahead, sir.\n\nReg Chai -- Associate Director, Investor Relations\n\nOK. Thank you. Hello, everyone. Welcome to our second quarter 2022 earnings call.\n\nJoining us today are founder and CEO of Tuya, Mr. Jerry Wang; and our CFO, Ms. Jessie Liu. The Second quarter 2022 financial results and webcast of this conference call are available at ir.tuya.com.\n\nA replay of this call will also be available on our website in a few hours. Before we continue, I refer you to our safe harbor statement in our earnings press release, which applies to this call as we will make forward-looking statements. With that, I will now turn the call to our founder and CEO, Mr. Jerry Wang.\n\nJerry will deliver his remarks in Chinese which will be followed by corresponding English translation. [Foreign language] \n\nJerry Wang -- Founder and Chief Executive Officer\n\nHello, everyone, and thank you for joining us on our second quarter 2022 earnings call. This is also our first earnings call after our dual-primary listing in Hong Kong. In the second quarter, our total revenue was $62.5 million, in line with the midpoint of our previous guidance range. Sequentially, we grew our total revenue by 13.1%.\n\nHowever, on a year-over-year basis, we recorded a 26.1% revenue decline as we lapped a period of robust growth across the IoT industry in 2021. In particular, our IoT PaaS business revenue increased to $47.6 million, up 13.9% sequentially but down significantly year over year. During the second quarter, global inflation continued to rise while the Russian, Ukrainian conflict regional triggering the tsunami dramatically impacted the world economy. Although the latest CPI from the U.S.\n\ncame in at 8.5% in July, lower than June and better than expected. The number itself was still high. High inflation impacts the economy, the industrial value chain, and consumers' wallets, changing people's lifestyles and consumption habits. These changes have a long-term impact on the consumer discretionary sector.\n\nA recovery in consumer electronics will take an extended period. Meanwhile, we note that the downstream players in the IoT device industrial chain, including IoT device brands, OEMs and the distribution channels faced massive inventory pressure from supply mismatches, which are expected to take longer to fix. As a result, our IoT PaaS business, DBNER as of the end of the second quarter declined to 84%. However, our other core business, the 2B-focused SaaS and other segments remained strong for the sixth consecutive quarter since we completed our public listing with revenue reaching $7.2 million, up 114.3% year over year.\n\nOur SaaS and other segment has sustained the year-over-year growth rate of over 110% for 10 consecutive quarters, despite the recent turbulence in the global economy. Our gross margin in the second quarter was 42.8%. Our IoT PaaS gross margin was 42.5%, representing a slight improvement over the same period last year and remained at a healthy level despite the headwinds. Since the beginning of the second quarter, we have implemented several operational and business optimizations, as well as product and technology iterations, I will share some highlights here.\n\nWe also expanded our global brand customer base. For example, we added a Fortune 5 German business group whose DIY retail channel private label shipments cover a wide range of segments, such as electrical, lighting, outdoor, and small appliances. Another customer is a leading U.S. consumer platform and the listed company that offers more than a dozen consumer brands.\n\nWe also partnered with a top-tier Korean HVAC manufacturer with distribution in Europe, America, Asia, and the Middle East. In Mexico, we worked with the leading Mexican air conditioner brand that has integrated its suppliers and the product system to develop smart home appliances. The number of our IoT PaaS premium customers, mainly existing customers, was 267 in the second quarter, down from 285 in the same period last year. The decrease was due to the issues I mentioned earlier, as well as seasonality.\n\nThis resulted in certain customers reducing their orders, thus falling below the premium customer revenue contribution threshold, which is $100,000 in the last 12 months. However, we also have new customers qualified, including the top brand from North America that we announced in the fourth quarter last year, whose primary business is outdoor travel. The new customer has completed the product development and the testing processes for various products started trial production and shipments in the first quarter and completed hundreds of thousands of units in the second quarter. Next, I will share some updates on our SaaS and other segment.\n\nDuring the first half of 2022, our commercial lighting and property SaaS achieved a year-over-year growth of around 100% in the number of new brand owners acquired, new customer projects served, and a new device interfaced. The addition of these partners has effectively complemented our business further. For example, the factory of Aptiv, a leading global supplier of mobile electronics and automotive system completed an intelligent transformation through our commercial lighting SaaS. The transformation saves Aptiv at least 900-kilowatt hours of electricity per day with an energy-saving efficiency of over 70%.\n\nIn addition, it enabled the factory to refine its lighting management in accordance with the different needs and working hours of each workshop. As such, the factory was able to improve the productivity of its production lines while saving energy. The commercial lighting segment itself has significant energy-saving potential. Going forward, carbon accounting, theoretical energy consumption analysis, events hub, and other similar functions will be in our products and the business key development direction.\n\nNow, let's turn to the progress of our hotel and apartment subsector. In the second quarter, we developed a baseline version of our domestic hotel SaaS that integrates voice and central control. On the foundation of the baseline version, we expanded our business to the new digital commercial circuit vertical and optimize our products with more cost-effective features, such as room monitoring, e-gaming hotel, and advanced construction. For the overseas hotel SaaS, we started to scale our SaaS coverage, adding over 1,000 new rooms.\n\nThe hotel and rental segment is a market with clear industrial leaders that is otherwise highly fragmented. Looking ahead, we will focus on industrial leading service providers and hotel groups, improve our product offerings, expand model use cases and continue penetrating the industry leaders. The real estate downturn in China during the second quarter affected our smart office and smart community SaaS solutions. However, by leveraging our solid software products and hardware device ecosystem, the intellectualization projects being implemented by various through [inaudible] group customers that signed contracts with us before maintained smooth operations.\n\nMoreover, we achieved solid progress in the smart industrial vertical. One of our new customers, [inaudible] Group is a large enterprise specializing in the production of high- and low-voltage electric control sets has been a long-term material supplier and a high-quality partner of large-scale industrial enterprises. [inaudible] utilized our industry equipment management system to monitor and collect equipment operation data, such as temperature, current, and the voltage of power distribution equipment, in order to assess electrical stability and safety and receive timely malfunction warnings. We also help [inaudible] develop the power distribution energy efficiency management platform that can analyze the power distribution equipment's current, voltage, power factors, active energy and other operating parameters.\n\nBased on the analysis, the joint developed platform established a distribution, energy-efficient model to conduct statistical analysis of the electricity consumption for various purposes to improve the electrical parameters, in fact, saving 60% to 15% of electricity. Recently, when serving customers in factories and industrial pubs, [inaudible] also developed the need for managing new energy sources, such as photovoltaic, in addition to utility power management. With our access and application expansion capabilities, we are currently helping [inaudible] build a full-suite energy management platform. As for value-added services, our 2C VAS maintained a solid performance in the quarter.\n\nAt the same time, demand for 2B VAS is also on the rise. For example, our OEM app and value-added services, such as the app function enhancement and related services, as well as voice capability generation and services, grew more than 100% or even higher year over year. In addition, services, such as IoT certification and the cloud development framework product have also delivered solid performance. Such results indicate that in the current macro environment, customers and brands are still investing and are confident in the smart business.\n\nMoving on to our smart product cloud product. As of the second quarter, we have acquired exemplary private cloud customers, such as a prominent Chinese integrated industrial investment group and multinational electrical, electronics, and automotive brand headquartered in Southeast Asia with one of the world's most extensive manufacturing and R&D facilities. The IoT project with China Gas that we previously announced is also progressing steadily as planned. Since its launch, we have achieved several milestones, such as completing the building of the Things Model for gas solution, rolling out a demo version, and introducing the development standards and instructions.\n\nAs we expand our customer base, we see tremendous business opportunities from these industrial customers in their pursuit of smart solutions, and we will strive to convert them to our customers. As one of our core long-term strategies, Cube smart private cloud unwinds a series of product technology upgrades in the second quarter. We completed the optimization of the MB IoT protocol for Cube. The protocol will help us better serve our industry customers as it features lower power consumption and higher coverage.\n\nIt has been widely used in over 10 industries, including public utilities, logistics, warehousing, properties, and manufacturing. We also packaged the UI business into the SDK of the Cube app, which significantly accelerated the customer's new app development process. We are currently replicating the capabilities of the nine major categories under the Tuya public cloud system to the Cube solution to further enrich customers' device ecosystem choices and solution diversity. We completed the independent operation and maintenance system, which fully covers the IoT infrastructure, meet operations and business operations under the Cube solution, enabling the technical staff to better understand Cube's operations to quickly locate and solve problems.\n\nAs a cloud-neutral product, we have the advantage of addressing and optimizing the complex architectural adaptability for cross-cloud deployment and the standardization process. In addition, the security of setting up a cloud platform on different isolators is also a challenge. In this regard, we replicated our experience with the Tuya cloud systems and further enhance the WA app and the JVM reinforcement capabilities to give our customer a world-class security experience. Lastly, it is worth noting that on July 12, ioXt, along with various authoritative experts, released the 2022 global IoT security white paper, in which Tuya was nominated as the best security practice in the IoT industry.\n\nThis nomination illustrated the industry recognition of our ongoing efforts in security compliance and further highlighted security compliance as one of the core competitive advantages of our platform. Our business progress and strategy developments in the second quarter. Overall, the severe challenges throughout the quarter are persisting, and we do not expect the economic downturn, high global inflation, supply chain inventory, and other issues to improve soon. However, our mission is unchanged to actively leverage Tuya's technology and product strength to explore new opportunities.\n\nFinally, on our internal management, the efficiency-centric initiatives we previously announced are already having a positive impact on our financial results, which our CFO, Jessie, will discuss in more detail.\n\nJessie Liu -- Chief Financial Officer\n\nOK. That concludes the remarks by Jerry. Before I begin, please note that all amounts are in U.S. dollars and all comparisons are on a year-over-year basis, unless otherwise stated.\n\nAs Jerry just mentioned, we continue to face a series of unprecedented challenges, specifically global inflation, COVID resurgence in Mainland China caused significant business disruption and inconvenience and the macroeconomic headwinds further exhibited downstream inventory backlog issues. Despite the challenges, we continue to focus on executing our efficiency improvement strategies toward our goal of prioritizing profitability and leverage our competitiveness to explore new long-term opportunities in the IoT industry. Now, I will provide a closer look into our financial results. For the second quarter of 2022, our total revenue was $62.5 million, within our previous guidance range and down 26.1% year over year.\n\nThe decline was driven by a 38.1% year-over-year decrease in our IoT PaaS revenue, which was down to $47.6 million for the quarter. Based on our own estimate glean from downstream and the consumer discretionary industry sources, broad-based demand declined in a consistent trend with our revenue decline. Major markets, notably the U.S. and Europe slowed significantly, whereas China grew slightly versus last year.\n\nThe smart consumer electronics sector is subject to fast-changing short-term demand, which is thus more susceptible to a slower economy versus other sectors, such as industrial, agriculture, automobile, and new energy, in which companies, especially those with large scale or in the electrical vehicle sector are more resistant to short-term downside risk. We are actively exploring opportunities to enter a wider range of the stable industries by leveraging our competitiveness and existing technology and ecosystem advantages. Total gross margin and IoT PaaS gross margin for the quarter were stable at 42.8% and 42.5%, respectively, as we effectively implemented a series of business management and efficiency improvement initiatives. Now, let's focus on our operating activities and related expenses.\n\nPlease note that we are presenting our operating expenses on a non-GAAP basis by excluding share-based compensation expense from our GAAP numbers to provide better clarity on the trends of our actual operating base expenses so that you can review performance in the same way as our management team. During the quarter, non-GAAP total operating expenses decreased by 21.1% to $49.1 million from $62.2 million in the same quarter of 2021. Specifically, non-GAAP R&D, sales and marketing, and G&A expenses decreased to $33.8 million, $13.2 million, and $5.3 million, respectively, and other operating income net was $3.2 million. The significant improvement in the non-GAAP operating expenses was mainly due to the large decrease in the basic employee-related costs, such as payroll and benefits, partially offset by one-off additional costs arising from, for example, headcount optimization and restoration and indemnification related to rental termination.\n\nOur average salaried employee headcount during the quarter decreased by approximately 23% year over year. Dynamic adjustments will be made based on the current scale and overall organization objective to achieve further improvement, if any. We optimized operations during the quarter, especially with two major initiatives to improve our technology research and the development efficiency. Let me give you some examples.\n\nFirst, we established an R&D Project Review Committee to carefully reevaluate each of our R&D projects and develop an itemized evaluation system to conduct value management on the aspect of internal efficiency improvement, key and the core capability construction and opportunities and the revenue generation. Approvals from the Committee led by our CTO and Head of Business Units, along with their refined budget models are required for projects to be executed. Second, we complete classification of R&D team resources into four types in order to allocate resources by type to our R&D objectives, does manage R&D more efficiently. We also optimized other aspects of operation.\n\nFor example, in terms of inventory, we retired more than 1,000 redundant material codes, improving the speed of system processes and laying a good data foundation for further in-depth operating analysis. We also launched a system function to collect services fees to recover the internal time costs incurring in executing less cost-effective, many others, so as to promote order bundling and improve customer service efficiencies. Regarding employees, we launched an action plan named 100-day sprint in Chinese, we call it [Foreign language] to encourage our employees to make accelerated progress. We also launched a Project 360 evaluation project to help most potential employees to achieve outstanding improvement in workplace.\n\nNow, turning to bottom line. Our non-GAAP loss from operations narrowed by 15.9% to $22.3 million in the quarter from $26.5 million in the same period of 2021, and our non-GAAP net loss narrowed by 19.1% to $18.7 million in the quarter from $23.1 million in the same period of 2021. Our non-GAAP operating margin and non-GAAP net margin in the quarter were negative 35.6% and negative 29.9%, compared to negative 31.3% and negative 27.3% in the same period of 2021, respectively. If we further exclude one-time additional expenses related to operating efficiency improvement initiatives and expenses that were irrelevant to daily business operating activities.\n\nOur non-GAAP operating margin and non-GAAP net margin for the quarter would improve to negative 31.2% and negative 22.7%, respectively, after a sequential decrease during last three quarters. That indicates that our measures to address market headwinds are showing early success. Moving on to the cash, you can refer to our earnings release of operating cash flows during this quarter. Our operating cash flow, excluding the cash received from ADS sharing program, has improved greatly to an outflow of $1.5 million in this quarter, compared to the outflow of $7.2 million, $46.1 million, $53.2 million, and $57.4 million for each quarter since last Q2 to this Q1.\n\nAs of June 30, 2022, cash, cash equivalents and short-term investments were $951.5 million. We believe this balance is sufficient to meet our liquidity and working capital needs for the foreseeable future. The sufficient capital reserves are one of our greatest advantages, giving us resilience to navigate adverse macro environment. Finally, turning to our share repurchase program.\n\nDuring the second quarter, we repurchased approximately 11.2 million ADS on the open market at a cost of approximately $30.0 million. Today is the end date of our share repurchase plan authorized on August 30, 2021. We have totally bought back 23.1 million of ADS with total cost of $109 million, which represents our commitment to shareholders and the market and shows our high confidence in Tuya's long-term growth prospects. Before I close, I would like to emphasize that the global consumer discretionary industry and the consumer spending are expected to be challenging in the second half, due to softening economy conditions, high global inflation, the downstream inventory glut, and a greater competition brought on by technology iteration in the IoT industry or other factors that are outside of our control.\n\nYou can refer to business outlook section in our earnings release for more details. Despite these challenges, we are confident in our long-term growth prospects and are committed to iterating our products and services, further enhancing our software and embedded hardware capabilities, expanding our customer base, diversify our revenue streams, and further optimizing operating efficiency. With that, operator, we are now ready to take questions. Thank you.\n\nOperator\n\n[Operator instructions] We have our first question from Liu, Yang from Morgan Stanley.\n\nYang Liu -- Morgan Stanley -- Analyst\n\n[Foreign language] Let me translate my questions. It's all about the demand. The first question, what is the management outlook in terms of the demand inflection point based on the conversation with key customers and their inventory -- their business plan inventory level? And another related question is, given the overall demand currently is weak, is there any chance for Tuya to see a better demand helped by the market share gain? Thank you.\n\nJessie Liu -- Chief Financial Officer\n\nOK. Thank you. Liu, Yang. So to address your question, first, we have not seen signs of a turning point of overseas demand for IoT device -- consumer electronics devices yet.\n\nAnd we feel the turning point will only come when the inflation has significantly improved. And the inventory backlog is cleared at the retailer and the brand side. So let's take an overall look at the global economy and the feedback from our customers. In the United States, for example, according to the latest, our brand customers' feedback, consumer electronics retail quantity is currently down about 30% year over year at the retail side.\n\nThe decline, combined with the retail channel and brand inventory backlog push the brands to a more conservative approach. So they place a few orders to OEMs. So it wasn't surprising to see OEM purchase orders from brand by quantity shrink as much as 50%. In Europe, the European Central Bank raised interest rate by 50 basis points in late July to curb high inflation.\n\nThis is Europe's first-rate hike since 2011, just as Europe struggles with record inflation triggered by COVID and the war and the rising food and energy prices. According to Eurostat, Europe's annual inflation rate jumped to 8.9% in July, more than four times the ECB's inflation target of 2%. So we have seen Europe is experiencing a significant weakening demand of discretionary product, which include IoT consumer electronic devices. So basically, our European customers are giving similar feedback as U.S.\n\ncustomers. In China, one of the more representative figures of Chinese consumer spending is the number of smartphone shipments. Based on IDC report shipment in the Chinese smartphone market declined by around 15% year over year in the second quarter. Also based on numbers from the National Bureau of Stats, total retail sales of consumer goods nationwide fell 4.6% year over year in the second quarter.\n\nSo overall, the global economic environment is becoming more complex and challenging, energy and commodity prices were rising and the imbalance between supply and demand is increasing, adding more downward pressure on the global economy. We think the weakening of demand for IoT consumer electronic devices will continue until inflation showed significant improvement. We will continue to work to improve our efficiency and continue to set breakeven as one of our core priorities. Regarding our business in China, we have highlighted several business opportunities earlier.\n\nCompanies nationwide are facing challenges due to the resurgence of COVID during the second quarter. However, we still added many like-minded partners. For example, we helped the leading portable power energy storage brand, Hello Tech Energy developed an outdoor portable power supply. We partnered with World-renowned smart energy system solution provider, CHINT Group, to develop the prepaid electricity meter and the management system.\n\nThis partnership will enrich our energy-saving-related product capabilities from both software and hardware aspects. We believe these capabilities will further complement our core IoT business. To fight against this quite negative environment of inflation and downward consumer demand, our strategy is more to expand young consumer electronics. In terms of IoT PaaS, we are making progress in developing the business of, for example, energy-related equipment, IoT, or commercial and industrial environment.\n\nIn Q2, close to 2% of our current IoT PaaS shipment went through industrial segment. So it's outside of consumer electronics, including like industrial sensors, professional lighting or commercial lighting, industrial energy reservation products and the commercial and the industrial security products, and also like central HVAC equipment for the large commercial buildings. At the same time, we are expanding our customer base beyond the consumer electronics devices industry through our multiple SaaS offerings. So we believe that expanding the young consumer electronics are a good strategy for the company for the long-term.\n\nSo I hope this answer your questions, and we can go to the next one.\n\nYang Liu -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nSure. Thank you. Next question we have from [inaudible] CICC. Go ahead.\n\nUnknown speaker\n\n[Foreign language] Let me translate it quickly. So in July, Tuya and Amazon launched the Matter solution and expected to complete some operating capital with other products. From a Matter perspective, do you see the Matter salaries and how do you see the potential impact on the industry? Thank you.\n\nJerry Wang -- Founder and Chief Executive Officer\n\nOK. Thank you, [inaudible], for the question. We can look at Matter from both a commercial and the technology development perspective. As an early adopter, Matter and also a key Board member of the Connectivity Standards Alliance, Tuya have officially launched to enabled solution this year.\n\nMatter is the connectivity protocol that connects local smart home common functionality. Simply put, using the Matter protocol, devices can be directly shared with the Apple HomeKit or connected to different brands of smart speakers, such as Alexa and Google Assistant without having to be interfaced in the development process to achieve basic local interaction. This will be very convenient for developers of IoT products. We believe such technology progress will further promote IoT penetration rate for -- especially for smart home devices.\n\nFrom a business and market perspective, there have been no significant technology or perception changes in the market over the past two years regarding connectivity protocols. Matter belongs to local general control, which cannot realize the cloud control and exclusive special function with multiple device interaction. This experience differs greatly compared to the mature and mainstream Wi-Fi products nowadays. So it is estimated that after the release of the first solution, it will take a period of time for adjustment and adoption to evaluate its actual performance.\n\nSome of those IoT products with very simple limited functions, they chose direct connection as the path to ship IoT. Both products will have increasingly rich IoT capabilities and personalized demand, but cloud service will still be a rigid demand. Overall, we will -- Tuya will incorporate Matter into our technology system based on one-stop capabilities, including Wi-Fi threat and especially gateway and central controller, as well as our product-level solutions across all categories. While adjusting the need for standard local connectivity features, our cloud-based IoT capabilities, software algorithm, and app capabilities will help make devices within Matter protocol smart.\n\nIn addition, our Matter solution will enable customers to achieve information transfer and OTA upgrades with smart device directly through the Tuya IoT PaaS without having to rebuild DCL servers. Overall, with the Matter as a complement remaining protocols in the IoT industry, we have participated in various tests of project measure and brought first-time installation to our customers. We believe our customers will make the best choice for their products and the business which we can totally support. So this is our answer to the Matter question.\n\nOperator, you can go to the next one.\n\nOperator\n\nSure. Thank you. Next question, we have John Wang from Goldman Banks. Please go ahead.\n\nJohn Wang -- Goldman Sachs -- Analyst\n\nHey. [Foreign language] We have been able to now the net loss under the macro pressure. What's your plans on headcount in the second half of this year and the cost control measures? And also maybe refresh road map and target for the margin this year? Thanks.\n\nJessie Liu -- Chief Financial Officer\n\nOK. Thank you, John. So in today's report, we highlighted the impact of Q2 expenses on our non-GAAP operating margin and non-GAAP net margin. Our efficiency and optimization initiatives in Q2 positively impacted income statement and cash flow.\n\nTherefore, in the second half, we will use the same approach to manage our operations and driving expense control while exploring measures that can more efficiently support our operations, sales, product and R&D systems. Basically, our organizational structure and internal adjustments are centered on the strategy we adopt at the beginning of 2022 to first, the upgrade of product and research centered on Cube smart private cloud offer. Second, the expansion of business in China. Third, we formed Tuya Plus Triangle team structure to support our initiatives to focus and get more KA customers.\n\nWe have different goals and strategies for each stage of development. We are also actively transforming and upgrading from a developed platform based on consumer electronic products to using the accumulative experiences and the technical advantages of IoT PaaS, platform that serves the industrial commercial and industrial fields are targeted to implement key customer strategies. In the early stage of team restructuring and scale up, we matched our personnel with precision based on general principles of suitability. After comprehensively evaluating factors, such as business demand, stage of development and the demand characteristics, we assign teams and members with characteristics that provide targeted support and expansion.\n\nFor example, with the private cloud, many customers need to combine many technical details with complex market needs. So we used our experienced sales manager, product manager, and project manager together to systematically provide a service from the perspective presale solution and delivery breaking from the traditional conflict between personnel. We're following the same approach to R&D. So more detailed efficiency measurement have been discussed before, so I will not repeat.\n\nAs for managing the other business unit, the functions and teams of DNA are relatively simple to adjust. So improvements in human efficiency will, in turn, lower cost. On the other hand, because of our listing in Hong Kong this quarter, professional fees, such as compliance auditing will increase slightly in the future. In general, in the future, we strive to achieve an appropriate team size by operating and managing more efficiently and through fine-tuning adjustments while supporting our new strategies, develop a platform product, basic capabilities, and the R&D tasks.\n\nAt our current scale, we will dynamically evaluate the demand -- the market demand, and the business expectations to ensure that efficiency output and the financial results are in line with our goal. So we will dynamically evaluate the size of the company's employee number. So at present, we still see a lot of room to further optimize our operational efficiencies through different initiatives. And our goal to make the breakeven a top priority of the company remain the same.\n\nSo we will still work on all the different means to be able to achieve this goal as early as possible. So that's the answer to John's questions.\n\nJohn Wang -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nThank you. I will now hand you back to the management team for the closing remarks. Please go ahead.\n\nJerry Wang -- Founder and Chief Executive Officer\n\nOK. So, thank you again for joining our call today. If you have any further questions, please feel free to contact us through our IR website. We look forward to speaking with everyone on our next earnings call.\n\nHave a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nReg Chai -- Associate Director, Investor Relations\n\nJerry Wang -- Founder and Chief Executive Officer\n\nJessie Liu -- Chief Financial Officer\n\nYang Liu -- Morgan Stanley -- Analyst\n\nUnknown speaker\n\nJohn Wang -- Goldman Sachs -- Analyst\n\nMore TUYA analysis\n\nAll earnings call transcripts"
}