{
  "companyName": "AeroVironment",
  "companyTicker": "AVAV",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/07/aerovironment-avav-q2-2023-earnings-call-transcrip/",
  "content": "AeroVironment (AVAV 0.29%)\nQ2 2023 Earnings Call\nDec 06, 2022, 4:30 p.m. ET\n\nOperator\n\n[Operator instructions] Good evening, and thank you for standing by. Welcome to the AeroVironment fiscal year '23 second-quarter conference call. At this time, all participants are in listen-only mode. After the speakers' presentations, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now turn the conference over to your speaker for today, Jonah Teeter-Balin. Please go ahead.\n\nJonah Teeter-Balin -- Senior Director of Corporate Development and Investor Relations\n\nThanks, and good afternoon, ladies and gentlemen. Welcome to AeroVironment's fiscal year 2023 second-quarter earnings call. This is Jonah Teeter-Balin, senior director of corporate development and investor relations for AeroVironment. Before we begin, please note that certain information presented on this call contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nForward-looking statements include, without limitation, any statement that may predict, forecast, indicate, or imply future results, performance, or achievements and may contain words such as believe, anticipate, expect, estimate, intend, project, plan, or words or phrases with similar meaning. Forward-looking statements are based on current expectations, forecasts, and assumptions, which involve risks and uncertainties, including, but not limited to, economic, competitive, governmental, and technological factors outside of our control that may cause our business, strategy, or actual results to differ materially from the forward-looking statements. For further information on these risks, we encourage you to review the risk factors discussed in AeroVironment's periodic reports on Form 10-K and other filings with the SEC, along with the associated earnings release and safe harbor statement contained therein. This afternoon, we also filed a slide presentations with our earnings release and posted the presentations to the Investors section of our website at avinc.com in the Events and Presentations section.\n\nThe content of this conference call contains time-sensitive information that is accurate only as of today, December 6, 2022. The company undertakes no obligation to make any revision to any forward-looking statements contained in our remarks today or to update them to reflect the events or circumstances occurring after this conference call. Joining me today from AeroVironment are chairman, president, and chief executive officer, Mr. Wahid Nawabi; and senior vice president and chief financial officer, Mr.\n\nKevin McDonnell.We will now begin with remarks from Wahid Nawabi. Wahid.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nThank you, Jonah. Welcome to our fiscal year 2023 second-quarter earnings conference call. I'll start by summarizing our performance and recent achievements, after which, Kevin will review our financial results in greater detail. I will then provide a summary of our expectations for the remainder of fiscal year 2023 before Kevin, Jonah, and I take your questions.\n\nLet me first emphasize a few key messages, which are included on Slide number 3 of our earnings presentation. First, second-quarter and first-half results were largely in line or slightly better than our expectations, while we continue to experience solid demand across nearly all our product lines. Second, solid first-half performance, coupled with growing order volume, gives us confidence to increase our revenue guidance for fiscal year 2023. We're also slightly reducing our profitability outlook for fiscal year 2023 due to increased R&D investments to capture additional growth opportunities and accelerated Medium UAS or MUAS asset depreciation related to a shift in U.S.\n\nDOD funding priorities. And third, we experienced funded backlog of $293 million at the end of the second quarter and record funded backlog of $388 million through November. With this record backlog, revenue visibility, and increasing order flow, we are well positioned for profitable double-digit top-line growth in fiscal year '23 and beyond. Now, let me summarize our financial results for the second quarter.\n\nWe delivered second-quarter revenue of $111.6 million, compared to $122.0 million last year, a decline of approximately 9% year over year. This decrease was primarily due to lower SUAS sales, although we posted higher revenue within our tactical missile systems or TMS product line related to increasing international demand for our Switchblade loitering munitions. Gross profit for the quarter was $25.9 million, compared to $42.5 million in the prior-year period. Our gross margin decreased to 23% from 35% last year, primarily as a result of unfavorable product mix and accelerated depreciation charges related to the anticipated reduction in MUAS service revenue due to changing U.S.\n\nDOD budget priorities. We expect gross margins to increase during the remainder of the fiscal year 2023 and anticipate a return to historical levels in fiscal year 2024. We reported adjusted EBITDA of $6.8 million, compared to $21.9 million in the second quarter last year. Finally, non-GAAP EPS was $0.00 per diluted share as compared to $0.78 per diluted share for the second quarter of fiscal year 2022.\n\nThe decrease in adjusted EBITDA and non-GAAP EPS were primarily driven by lower revenues, unfavorable product mix, and higher R&D investments. Non-GAAP EPS decrease was also due to accelerated depreciation of MUAS assets as I explained earlier. Looking ahead, recent contract awards and increasing demand for our portfolio of intelligent multi-domain robotic solutions gives us confidence that we are positioned for strong long-term performance and value creation. While the budget for the government's fiscal year 2023 has yet to be finalized, we maintain broad bipartisan support for our innovative solutions across the U.S.\n\nDOD and our allies. In addition, we remain diligent in managing the ongoing global supply chain constraints, inflationary pressures in a tight labor market. While the entire industry is dealing with these issues, we believe AeroVironment has taken the right actions to minimize their impact. So far this year, our companywide continuous improvement initiatives have delivered significant cost savings, while positioning us for growth and scale.\n\nThe flexibility of our manufacturing operations has enabled us to meet the planned and unplanned needs of our customers. We continue to work directly with the office of the U.S. Secretary of Defense and key suppliers, when possible, to expedite customer shipments and are optimistic about improving industry fundamentals in the quarters to come. Based on this recent progress, we now feel confident that we will have sufficient supply and labor to meet this year's financial objectives.\n\nNow, I would like to switch gears and provide an update on current developments within each of our product lines. Let me begin with our small UAS or SUAS product line, where we recently received the largest foreign military sales or FMS award in our company's history. This contract award has a maximum ceiling value of $176 million with an initial funding of $86 million and includes deliveries of Puma LE, Puma 3 AE systems, spare parts packages, and associated training and logistics support. Shipments are set to begin later this quarter and will continue for six months to 12 months thereafter.\n\nLet me emphasize, our Puma systems have proven to be very critical to Ukraine forces, and its ongoing conflict with Russia, particularly when combined with our highly effective Switchblade loitering munitions to scout enemy targets and provide battle damage assessments. This award is an amazing testimony to our entire Puma small UAS platform. That said, and as indicated earlier, while such a significant order strengthens our outlook in reaching our goals, it was largely anticipated. We have carefully planned for this contract award and the requirements to execute it.\n\nThese shipments also incorporate our latest anti-jamming software enhancements to enable successful operation in a highly contested battle space. In addition to this large FMS award, we announced in September that AeroVironment had received two additional firm-fixed-price FMS awards totaling nearly $21 million for Puma 3 AE small UAS, initial spares packages, training, and support for two allied nations. There is an urgent need for such systems, and we are proud to continue helping the people of Ukraine and our allies abroad. Now, I would like to highlight some of our SUAS team's recent new product introductions.\n\nIn September, we announced the introduction of our next-generation VAPOR unmanned helicopter, the VAPOR MX 55. VAPOR MX 55 is a more rugged, reliable, and capable platform and includes a completely redesigned modular autonomy framework, enabling 25% increased endurance and 20% expanded payload capacity. Also in September, we announced the introduction of the Puma VNS, a visual-based navigation system for Puma 2 AE and Puma 3 AE. Puma VNS enables operators to navigate in highly contested GPS-denied environments using onboard computer vision algorithms and visual terrain information.\n\nCustomers will also be provided with navigation capabilities, features, and functionality through future software and hardware updates. This solution provides unprecedented advantages in a contested battlefield environment. This is yet another example of how our investments in R&D and especially in artificial intelligence and computer vision further enhances our solutions capabilities to -- for our customers. And finally, we introduced a new Raven gimbal called Mantis i23 D.\n\nThe solution will be offered as an upgrade to Raven's existing large global installed base of customers who will benefit from this new state-of-the-art sensor suite. It is also important to note that we have already secured initial customer orders from many of these innovative solutions already. As anticipated, we're seeing improving demand for our Small UAS product line, while we continue to prudently invest in product advancements and features positioning us for continued future growth. This year will certainly prove to be one of the best ever for our small UAS product line, and we are confident we will build on this strong foundation for years to come.\n\nMoving to our tactical missile systems, or TMS product line, we are experiencing solid demand and nearly doubled revenue this quarter versus fiscal year 2022. Our TMS product line performance this quarter largely reflects shipments of the Switchblade 300 and 600 to the U.S. Army in support of the Ukraine Security Assistance Initiative, or USAI, and to backfill depleted U.S. DOD stockpiles.\n\nGiven Switchblade's strong applicability to current conflicts, we expect order activity to remain heightened for the foreseeable future, and we are now pursuing multiple opportunities with a wide range of domestic and international customers. Domestically, we are working with the U.S. DOD to backfill and expand existing Switchblade inventories. Overseas, we're seeking additional contracts to supply Ukraine, while pursuing orders with new international customers that U.S.\n\nDOD recently approved for sale. We continue to receive positive feedback that AeroVironment solutions are highly effective and best-in-class. Our family of loitering munitions continues to expand through multiple strategic partnerships such as with Northrop Grumman. This Switchblade variant called Jackal is a turbojet-powered loitering munition with a range of more than 100 kilometers, supporting multiple warheads and payloads, and can be launched from ground or air.\n\nThis long-range precision munition or LRPM is meant to provide flexible, durable strike options for the U.S. Army's next-generation helicopters. The program is under a three-year to five-year development cycle and could result in significant new awards for AeroVironment over the long term. We're making solid progress on this new variant of Switchblade and have recently received initial funding to demonstrate this new disruptive capability.\n\nGoing forward, we anticipate healthy bipartisan support for our solutions as funding priorities are laid out for the government's fiscal year 2023. In addition, with the approval of Switchblade 300 and 600 sales to over 20 allies, there is ample opportunity for continued double-digit growth across our TMS product line for the foreseeable future. Just like with our SUAS product line, there is the potential for much larger orders going forward, and we're proud of developing such innovative solutions that help defend our country and our allies worldwide. I will now switch gears and discuss our medium UAS or MUAS product line.\n\nAs announced last quarter, we were awarded Increment 1 of the U.S. Army's Future Tactical UAS, or FTUAS program, which was greatly anticipated and is now fully underway. We continue to train U.S. Army personnel in Germany, while activities are ongoing at Redstone Arsenal in Huntsville, Alabama, with flight testing expected to start in 30 to 60 days.\n\nWe're pleased to be deepening our partnership with the U.S. Army, and we're working hard to prove our advanced capabilities on this next-generation program. For government fiscal year 2023, the U.S. Army's proposed funding for FTUAS is approximately $100 million.\n\nWe expect the next phase of FTUAS, or Increment 2, to be awarded in the next six months. While FTUAS is an exciting $1 billion potential program of record, our current fiscal year is now expected to be flat in terms of MUAS growth. Ukraine has been the near-term priority for the U.S. DOD spending and programs outside of Ukraine that typically utilize the JUMP 20 aircraft are not seeing as much activity.\n\nAs a result of this, we have recorded some accelerated depreciation expenses, which are now reflected in our revised financial outlook for the fiscal year. In addition, we have completed the integration of our most recent acquisition, Planck Aerosystems, into our MUAS organization. Regarding our unmanned ground vehicles, or UGV product line, we have secured a contract to provide ground robots to Ukraine with deliveries this calendar year. Overall, UGV proposal for activity remains solid, and we expect additional positive developments in the months to come.\n\nWithin our HAPS product line, as announced last quarter, we're successfully executing against our current contract with SoftBank for the next-generation Sunglider. Both AeroVironment and SoftBank remain fully committed to the vision of developing and commercializing stratospheric-based telecommunication services. At the same time, we're engaged with the U.S. DOD in multiple fronts, which could lead to a new incremental contract in the coming quarters.\n\nThere is an emerging and growing need for stratospheric, ultra-long endurance persistent ISR capability for defense applications against near-peer adversaries. HAPS solutions are ideal for these applications and the performance capabilities of our Sunglider UAV stand well ahead of competitors. Overall, we remain on track for HAPS revenue to be between $30 million to $35 million this fiscal year. And finally, I'll share some exciting developments at MacCready Works Advanced Solutions.\n\nAside from the well-known contributions we're making to NASA with the Ingenuity Unmanned Mars Helicopter, MacCready Works continues to experience growth and customer-funded R&D. These efforts are focused in the areas of artificial intelligence, machine learning, and contested environment logistics. Recently, we received contracts from the U.S. Navy to continue R&D testing and evaluation of certain advanced image and video analytics capabilities and biometric target recognition.\n\nWe've also completed several field experiments with customers to explore AI and machine learning-based solutions for GPS-denied environment operations. At the same time, we remain actively engaged with NASA's Jet Propulsion Laboratories or JPL on their next important Mars mission, now in the preliminary design phase. In summary, AeroVironment remains on track for another year of profitable double-digit top-line organic growth and improved underlying results. I'm especially proud of how effectively and efficiently our team has executed so far despite ongoing supply chain constraints.\n\nWe are well prepared to deliver on the second half of our current fiscal year, while positioning AeroVironment even more -- for even more growth beyond fiscal year 2023. With that, I would like to now turn the call over to Kevin McDonnell for a review of second-quarter financials. Kevin.\n\nKevin McDonnell -- Chief Financial Officer\n\nThank you, Wahid. Today, I will be reviewing the highlights of our second-quarter performance, during which, I will occasionally refer to both our press release and earnings presentation available on our website. Let me start by saying that the second-quarter results were in line with expectations, and with the strength of our order bookings, backlog, and subsequent large FMS order, we are positioned for a very strong second half of the year. As a result, I will try to provide increased visibility to the second half during my remarks.\n\nRevenue for the second quarter of fiscal 2023 was $111.6 million, a decrease of 9%, compared to the second quarter of fiscal 2022 revenue of $122 million. Slide 5 of the earnings presentation provides a breakdown of revenue by segment for the quarter. Our largest segment during the quarter was tactical missile systems, or TMS, which contributed 31.1 million of revenue compared to 18.4 million during this -- during Q2 of last year. This increase was driven by a higher level of TMS manufacturing activity in the quarter, which was recognized based upon revenue over time accounting.\n\nOur small UAS business finished the quarter with 26.7 million of revenue, down from last year's 54.7 million. The lower revenue in the quarter result of order timing, and we expect a very strong second half of the year for SUAS given the large FMS order received after the end of the quarter. We also continue to see growing demand for upgrades and add-on products from both U.S. and international customers.\n\nThe medium UAS segment finished the quarter with revenue of 27.3 million, a 3% increase compared to the second quarter of FY 2022. We expect increased product sales of the MUAS JUMP 20 in the second half of the year. However, we do anticipate a reduction in COCO sites service revenue as overall MEUAS program is reducing the number of sites operated. Our HAPS segment contributed 9.1 million in Q2, a decrease from 10.3 million in the prior-year second quarter.\n\nRevenue from the other segment increased year over year to 17.5 million versus 12 million in last year's second quarter. Most of the growth in other came from our MacCready Works business, which has seen strong demand for both classified and unclassified DOD customers, as well as Jet Propulsion Labs. Turning to gross margins. Slide 5 of the earnings presentation shows the mix of product versus service revenue.\n\nFor Q2, we saw a product mix of 56%, compared to 58% in the second quarter of last year. We anticipate a shift back to the 70% product and 30% service mix during the second half of the year based upon expected significantly higher SUAS product sales and a shift of medium UAS -- the medium UAS business to increase product sales. Slide 6 of the earnings presentation shows the trend of adjusted product and service gross margins, while Slide 12 reconciles the GAAP gross margins to adjusted gross margins, which excludes intangible amortization expense and other noncash purchase accounting items. For the second quarter, GAAP gross margins decreased from 35% to 23% year over year, and overall adjusted gross margins decreased from 39% to 27%.\n\nThe decline in both GAAP and adjusted gross margins is a result of lower overall revenue, reduced small UAS product mix, and accelerated depreciation of Medium UAS COCO assets impacting service gross margins. However, we still expect adjusted gross margins for the year to be in line with fiscal 2022 as indicated previously. I'll now provide some additional detail on adjusted gross margins during the quarter. Adjusted product gross margin for the quarter were 38% versus 48% in the second quarter of the last fiscal year, primarily due to lower SUAS product mix.\n\nIn terms of adjusted service gross margins, the second quarter was at 12% versus 27% during the same quarter last year, primarily as a result of lower MUAS margins following the accelerated depreciation charges of 4.5 million due to the anticipated site reductions mentioned earlier. We also expect additional accelerated depreciation of approximately 2.5 million in Q3. I want to reiterate, we expect annual gross margins to be in line with FY '22 and additional depreciate -- and the additional depreciation expense will be more than offset by higher product sales as a percentage of total revenue in the second half of the year, driven by higher small UAS product sales. Further, we expect product gross margin for the second half of the year to be in the low to mid 40% range.\n\nNow, turning to GAAP earnings. We had a net loss for the second quarter of 6.7 million, compared to a net income of 2.5 million in last year's second quarter. The $9.2 million year-over-year decrease in net income was due to 16.6 million in lower gross margin due to lower sales volume, unfavorable product mix, and MUAS accelerated depreciation. In addition, R&D investments increased 2.3 million in the second quarter of fiscal 2023 versus the same period last year.\n\nInterest expense was 0.9 million higher over last year, and equity investment losses were 1.6 million higher versus last year. These items were partially offset by a decrease in SG&A expense of 1.2 million and a $10 million reduction in other expense. As a reminder, in last year's second quarter, we recognized a $10 million litigation settlement charge that was recorded as other expense. In terms of adjusted EBITDA, Slide 13 of our earnings presentation shows a reconciliation of the GAAP net loss to the adjusted EBITDA.\n\nThe adjusted EBITDA for the second quarter of fiscal 2023 was 6.8 million, a decrease of 14.1 million, primarily due to the 13.8 million lower adjusted gross margins from decreased revenue and unfavorable product mix. Given the strong revenue and gross margin outlook for the second half of the year, we expect that our adjusted EBITDA in the second half of the year to be significantly higher than the first half in the same period last year. As a consequence, we are narrowing our adjusted EBITDA outlook to the upper end of our previous guidance range. Slide 10 shows the reconciliation of GAAP and adjusted or non-GAAP diluted EPS.\n\nThe company posted adjusted earnings per share -- diluted share of $0.00 for the second quarter of fiscal 2023 versus $0.78 per diluted share for the second quarter of fiscal 2022. Turning to the balance sheet. Total cash and investments at the end of the quarter was 123.9 million, which is essentially the same as last quarter. We had a good working capital quarter as the combination of accounts receivables and unbilled receivables decreased during the quarter, partially offset by increasing inventories.\n\nWe expect inventories to continue to increase as we ramp up to meet demand. I'd also like to note that we paid down $20 million of our long-term debt during the quarter. We continue to have a strong balance sheet with over 120 million in cash and investments and approximately $100 million available under our working capital facility. I'd like to conclude with some highlights of our backlog metrics.\n\nSlide 8 of the earnings presentation provides a summary of our current fiscal 2023 visibility. As Wahid mentioned, our funded backlog at the end of the second quarter of fiscal 2023 was $293 million. However, in November, we were awarded a large FMS contract with an initial value of $86 million, resulting in a November ending backlog of $388 million. Our visibility as of today to the midpoint of the revised guidance range is 92%.\n\nWe also expect orders to continue to be strong for the remainder of 2023. Now, I'd like to turn things back to Wahid.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nThanks, Kevin. As I noted earlier, we now have greater line of sight on our fiscal year 2023 financial performance, given the overall robust demand environment and recent contract awards, especially our record FMS order for Puma systems. As such, we are now raising our revenue guidance for this fiscal year. Our new outlook for fiscal year 2023 is shown on Slide number 7 and is as follows: We anticipate revenue of between $505 million and $525 million, which is higher than our prior guidance; net income of $8 million to $17 million, or $0.33 to $0.65 per diluted share; non-GAAP adjusted EBITDA of between $84 million and $92 million; and non-GAAP earnings per diluted share, excluding acquisition-related costs, amortization of intangible assets, and other one-time expenses of between $1.26 and $1.58.\n\nWhile we are raising revenue guidance and narrow guidance for adjusted EBITDA, we have reduced some earnings metrics given greater-than-expected depreciation of MUAS assets and higher R&D investments necessary to capture future business opportunities. However, we believe adjusted gross margins will increase sequentially going forward, driven by favorable product mix and higher volumes. We expect to deliver adjusted EBITDA between 17% and 18% of revenue and R&D investments between 11% to 12% of revenue for the full fiscal year. We continue to anticipate roughly 60% of full-year revenue will be recognized in the second half of this fiscal year.\n\nOf that second half total, approximately 60% of it will occur in Q4 as we deliver on orders now in the production stage. In summary, with 92% visibility to the midpoint of our revised revenue guidance range, we are confident in our ability to achieve, not only these objectives in fiscal year 2023, but also position AeroVironment for another year of strong profitable growth in fiscal year 2024 and beyond. Before turning the call over for questions, let me once again summarize the key points from today's call. First, we're performing according to our plan with second-quarter and first-half results largely in line or slightly ahead of expectations.\n\nSecond, we have confidently raised revenue guidance for this fiscal year even as we continue managing through several challenges, including supply chain constraints and inflationary cost pressures, while making the investments necessary to capitalize on future growth opportunities. And third, we are positioned for strong organic double-digit growth this year as evidenced by our solid visibility, record backlog, and continued growth across nearly all our product lines. We expect margins and backlog to increase throughout the second half of this fiscal year, laying the foundation for strong profitable double-digit organic growth in fiscal year 2024 and beyond. I would again like to thank our employees for their hard work and dedication to our success.\n\nThey and our loyal shareholders have made AeroVironment what it is today, a global leader in intelligent multi-domain robotic solutions, which help to protect our country and our allies around the world. And with that, Kevin, Jonah, and I will now take your questions.\n\nOperator\n\nThank you. [Operator instructions] Please stand by while we compile our Q&A roster. We respectfully ask you to stick to two questions limited and return to the queue to ask further questions. One moment, please.\n\nOur first question comes from the line of Peter Arment of Baird. Your line is open.\n\nPeter Arment -- Baird -- Analyst\n\nGood afternoon, Wahid and Kevin.\n\nKevin McDonnell -- Chief Financial Officer\n\nYes, Peter.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nHi there, Peter.\n\nPeter Arment -- Baird -- Analyst\n\nWahid, I guess, just to comment on the backlog, maybe you could just give us an expectation of kind of how you see things progressing here from here with TMS? Obviously, it sounds like a lot of the small UAS is really ramping up based on the order. But maybe if you could just walk us through kind of some of the demand signals that you're seeing on TMS just given the growing list of countries there.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nSure. So, Peter, we're very excited about the prospects of growth this year, as well as next year. Yes, for this quarter, at this time, our small UAS have booked some very significant international FMS orders and domestic orders that have really propelled it. But we expect similar demand and growth in our tactical missile systems business, if not greater.\n\nIt's purely based on the timing of the quarter and our customers' ability to execute the contracts. The U.S. DOD is really, really backed up in terms of resources to be able to execute on these contracts. The Ukraine conflict is obviously priority No.\n\n1 for a lot of the customers of ours and folks that we deal with, but we expect strong order growth in the next second -- two quarters for, not only our small UAS, but absolutely also for our TMS business. Similarly, we expect some strong growth in our other product lines such as our MacCready Works, which really is constrained primarily not by contracts but by resources, the top talent that we need to execute to work. So, overall, I see very, very positive signs in terms of our prospects for growth in the future. And I expect the order activity to continue to be in this momentum that we are today, and it will even pick up toward the latter part of this second half of this fiscal year.\n\nPeter Arment -- Baird -- Analyst\n\nOK, great. And just as a follow-up, just thinking about like the bottom line, adjusted EPS, so you're still expecting quite a big range to come in in the second half of the remaining two quarters of the year. You know, that range still with only two quarters is still pretty wide. Is that just the mix driven, or are there any other puts and takes we should be thinking about within that EPS range? Thanks.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nThat's great, Peter. Glad you asked that question because really, the range has to do with the timing of these orders, the mix obviously is the No. 1 driver there. Given the different product lines that we have, the profitability profile of each and every single one of these contracts vary.\n\nAnd depending on which contract is able to come in first and what takes priority versus the other, it really makes a big difference on the profitability. Overall, though, we expect profitability significantly increase in the second half, especially in the fourth quarter, and we also expect our gross margin to pick up. And since volume is going to be up, all of that ends up being a better profitable outcome for the second half of the year for us as we have forecasted.\n\nOperator\n\nThank you. [Operator instructions] One moment, please. One moment. Our next question comes from the line of Austin Moeller of [Inaudible] Your line is open. \n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nHello, Wahid and Kevin.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nHello, Austin.\n\nKevin McDonnell -- Chief Financial Officer\n\nHi there.\n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nHi. So, a nice outlook in the quarter here. Your Puma delivery outlook over the next couple of quarters would seem to imply that CPU and GPU supply chain is improving. Is this because of softer consumer demand, you're able to get your hands on some of these CPUs and GPUs now?\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nSo, Austin, the supply chain picture is really a mixed bag if you look at the entire spectrum of parts, CPUs, GPUs, composites, etc. I believe that our team has done a fantastic job navigating through those challenges last couple of years, as well as this year. For this year, we have very strong visibility on our booking and backlog as you saw from the numbers. And we have pretty much addressed vast, vast majority of the supply chain risks related to the execution and delivery of products within the second half of the year.\n\nBy no means is the supply chain constraints overall completely done and gone. It's actually improving, but it's improving slowly. And we don't see risk on our fiscal year '23 forecast as much, although there's always some uncertainty. But beyond that, it's still a day-to-day, week-to-week challenge of addressing them.\n\nThe other thing that has really helped us is we really plan our supply chain many quarters out and upfront. And since we actually have been building up inventory and buying material at risk and building product, it allows us to execute on these orders and respond to the U.S. government in Ukraine conflict very, very quickly. These orders that we received, we were expecting these orders before.\n\nThe timing of which was not really very firm. We have built ahead of that, many of the modules, and we were able to ship some of that -- majority of that this fiscal year. So, it is a great testament to our team's ability to execute and also plan for the growth that we expected this year and the years after this.\n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nOK. That's super encouraging. DOD, I don't know if you've seen the news, but they're running out of HIMARS rockets, and now they're trying to stick small diameter bombs onto artillery rockets to send to Ukraine. Can you do the same with Switchblade 600's warhead just given the Javelin production delays and supply chain issues? Could you put a different explosive on there and still make to work?\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nSo, the short answer is yes, but there's a big but on that response. We are -- definitely the No. 1 supply chain constraint for Switchblade remains the warhead for Switchblade, both 300 and 600. We have tackled all the other supply chain issues, and we're getting those two from two major primes, primarily General Dynamics and Northrop Grumman.\n\nAnd both of them have constraints in terms of the capacity of producing that warhead. We are actively not only working how we can secure more warheads for Switchblade 300 and 600 but also to put in new warheads as you indicated on your comment. Now, the challenge with substituting the warhead is that it has to go through a safety confirmation test and approval by the U.S. Army.\n\nAnd that process is not only nontrivial, but it also takes time because they're backed up in a lot of other requests and activities related to this. Nonetheless, we're focused on multiple fronts. We feel very confident about our forecast for this fiscal year. We're really working on issues beyond this fiscal year because we believe that the demand for our Switchblade is going to continue to grow.\n\nWe're going to have one of the best years for our small UAS and TMS this fiscal year, and I am confident that we're going to be positioned extremely well for the next year as well. The order activity and demand is pretty robust both domestically and internationally, and I expect that to continue and those to transition into orders and leave us this fiscal year with a pretty healthy strong backlog going into next year.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Pete Skibitski of Alembic. Your line is open.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nHey, good evening, guys.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nGood evening, Pete.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nYeah. So, sorry, if you addressed this already. I got on the call a little bit late, guys. But on the $86 million small UAS contract with the, I guess, $176 million ceiling, the FMS contract, what's the time frame for both of those portions, the $86 million portion and the larger portion? And then also, is that the one country or multiple countries?\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nSo, Pete, that order is the -- historically, the largest FMS order we've ever recorded in the history of our company is an exciting big order for our Pumas. It includes Puma LEs and Puma AE systems and spares and logistics. $86 million of that contract is funded today. The total ceiling value of that contract is approximately $176 million.\n\nBecause it's a contract that involves delivering hardware and logistics support and training, the tail of that will continue for another six to 12 months even. But majority of the hardware will be delivered between the second half of this fiscal year starting this quarter and the beginning of next fiscal year. The -- in response to how many countries, that is specific to one country, one country. And it just shows the power of our systems and the value that our customers place on our systems as part of their battle rhythms in their conflicts.\n\nAs you know, Switchblade has received a lot of notoriety and success in Ukraine and also have sort of attention, but Pumas are equally as effective and vital to the Ukrainian forces and their conflict against Russia. And we believe that it's going to continue to be the case for, not only Ukraine, but many of our other allies around the region and around the world.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nOK. That's an extraordinary contract. Congrats on that.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nThank you.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nAnd then just last one for me. On the Medium -- on the MUAS segment, the steep loss there this quarter on gross margin and operating margin. I was just wondering, was there some strategic reason there for that loss? Was there a surge in R&D or some unusual mix or -- I'm just wondering what -- because revenue was good this quarter in MUAS, but the loss was, you know, the largest since you acquired the firm. So, I was just wondering what's going on there?\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nSure. Sure, Pete. So, let me shed some light onto that. This is a one-time really accounting thing that took place, and the math is pretty straightforward.\n\nWe operate all these sites as a COCO, contractor-owned, contractor-operated sites for the U.S. SOCOM. Because of the attention to Ukraine and the conflict with Russia, many of the other activities around the world is getting less attention and less focus. So, if the sites in the other parts of the world are reduced or the OPTEMPO is shrunk, then by accounting GAAP rule -- accounting rules, by definition, it means the inventories that we carry as -- the assets -- I'm sorry, the capital assets that we carry to operate those sites get accelerated in terms of its depreciation on our books.\n\nThat charge is directly a result of that. We still feel very solid and confident about our MUAS business in the long run. As I said in my remarks, we won Increment 0 and Increment 1 contract for FTUAS. We're performing well against that contract.\n\nWe've already started training the U.S. Army forces on those. We have shipped the product to them, and we're looking forward to Increment 2 award, which there is close to $100 million in the U.S. DOD budget for government fiscal year '24.\n\nSo, long term, we feel very strong about our MUAS business and its process for growth, both domestic and internationally. That was a one-time depreciation -- accelerated depreciation that resulted as a result of the slight reduction in [Inaudible]\n\nKevin McDonnell -- Chief Financial Officer\n\nRight. It was 4.5 million in case you missed it in our comments of accelerated depreciation in the quarter. And even with that, we still believe we're going to hit our gross margin targets for the year.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nYeah.\n\nPete Skibitski -- Alembic Global -- Analyst\n\nOK. That's great. Appreciate the color, guys. Thank you.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nYou're welcome. You're welcome.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Brian Ruttenbur of Imperial Capital. Your line is open.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nYeah. Thank you very much. Just a couple of follow-ups real quick. In terms of operating expenses, can you give us a little bit of guidance for third quarter and fourth quarter, how they look versus second quarter in terms of R&D and SG&A, maybe give us directionally flat, up, down from the second quarter levels?\n\nKevin McDonnell -- Chief Financial Officer\n\nWe don't normally give that level of guidance, but as Wahid indicated, I think we're at 11% to 12% R&D for the year.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nAnd generally, we usually try to level load our -- in R&D throughout the year because of capacity of headcount and resources. So, you don't usually see a major increase or decrease on a quarterly basis in our R&D spend, Brian, in general.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nGreat. You talked about 11% to 12% R&D. SG&A as a percentage, it should drop from second quarter levels to --\n\nKevin McDonnell -- Chief Financial Officer\n\nYeah.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nOK. Great. Thank you very much.\n\nKevin McDonnell -- Chief Financial Officer\n\nI mean it's the same -- it's the same situation. You know, your SG&A expenses aren't going to bump way up with revenue in the next couple of quarters. We're going to get a lot of leverage with that increase in revenue. They will continue to increase primarily because there are some commissions and things like that, and we are expanding our sales force activities.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nAnd the [Inaudible] business and proposal activity has been high and will continue to be high, but those are very positive signs, Brian. Because it means that there's a demand for our solutions, and we're competing for projects, and our win rate generally is quite high.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nRight. Thank you.\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. I'm showing no further questions at this time. And let's turn the call back over to Jonah Teeter-Balin for any closing remarks.\n\nJonah Teeter-Balin -- Senior Director of Corporate Development and Investor Relations\n\nThank you once again for joining today's conference call and for your interest in AeroVironment. An archived version of this call, all SEC filings, and relevant news can be found on our website at avinc.com. We wish you a good evening and look forward to speaking with you again following next quarter's results.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJonah Teeter-Balin -- Senior Director of Corporate Development and Investor Relations\n\nWahid Nawabi -- Chairman, President and Chief Executive Officer\n\nKevin McDonnell -- Chief Financial Officer\n\nPeter Arment -- Baird -- Analyst\n\nAustin Moeller -- Canaccord Genuity -- Analyst\n\nPete Skibitski -- Alembic Global -- Analyst\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nMore AVAV analysis\n\nAll earnings call transcripts"
}