{
  "companyName": "Williams-Sonoma",
  "companyTicker": "WSM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/williams-sonoma-wsm-q2-2022-earnings-call-transcri/",
  "content": "Williams-Sonoma (WSM -1.40%)\nQ2 2022 Earnings Call\nAug 24, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Williams-Sonoma, Inc. Q2 2022 conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the conclusion of the prepared remarks.\n\nToday's call is being recorded. I would now like to turn the call over to Jeremy Brooks, chief accounting officer and head of investor relations. Please go ahead.\n\nJeremy Brooks -- Chief Accounting Officer and Head of Investor Relations\n\nGood afternoon, and thank you for joining our second quarter earnings call. I'd like to remind you that during this call, we will make forward-looking statements with respect to future events and financial performance, including guidance for fiscal '22 and our long-term outlook. Although we believe these statements reflect our best estimate and all available information, we cannot make any assurances that these statements will materialize, and actual results may differ significantly from our expectations. The company undertakes no obligation to publicly update or revise any of these statements to reflect events or circumstances that may arise after today's call.\n\nAdditionally, we will refer to certain non-GAAP financial measures. Those measures should not be considered replacements for and should be read together with our GAAP results. A reconciliation of non-GAAP measures to the most directly comparable GAAP measure, along with an explanation of how and why we use those measures, appears in exhibit one to the press release we issued earlier today. This call should also be considered in conjunction with our periodic and annual filings with the SEC.\n\nThe call is being recorded, and a replay will be available on our investor relations website. Now I'd like to turn the call over to Laura Alber, our president and chief executive officer.\n\nLaura Alber -- President and Chief Executive Officer\n\nThanks, Jeremy. Good afternoon, everyone. I'm excited to share our second quarter earnings today. Q2 marked another quarter of strong performance, delivering an 11.3% comp on the top line and earnings growth of over 19% to $3.87 per share.\n\nThese impressive results reflect the strength of our multi-brand portfolio, the success of our growth initiatives and the ongoing execution of the team. We continue to demonstrate our ability to perform by offering high-quality, differentiated and sustainable products that our customers know and love. Our performance was driven by three factors: strong order fulfillment, positive demand comps and our successful continued elimination of sitewide promotions. I'm very proud of this performance, especially given the macroeconomic backdrop and the strong compares we are up against, all while delivering an impressive 41.1% comp on a two-year basis.\n\nAnd it is this continued outperformance that gives us the confidence to reiterate our 2022 guidance and longer-term outlook today. Our positioning in the industry is a competitive strength. Our industry is large and fragmented with more than half of sales from small brick-and-mortar retailers that do not have sophisticated e-commerce capabilities. And with the arrival of the millennial generation for the household creation stage, this is a huge opportunity for ongoing market share gains for us, while the rest of the players try to catch up.\n\nAt the same time, our digital-first but not digital-only channel strategy provides a competitive edge in scaling the business into the future compared to both retail and marketplace only players. All of this creates an environment that is ripe for disruption and for us to take market share. We continue to win because of our key differentiators, which include our in-house design capabilities with inspirational, exclusive, sustainable and high-quality products at compelling price points. Our digital-first but not digital-only channel  strategy and our values rooted in sustainability, diversity, equity, and inclusion, which are becoming even more fundamental to purchasing decisions for many customers.\n\nThese differentiators set us apart as a leader in the industry. And now I want to highlight one of our opportunities, business to business. Our B2B business had another terrific quarter driving a 32% increase in demand in Q2 and it is well on track to becoming a $1 billion business this year. We continue to grow in this space by focusing on diversifying our product pipeline across a range of industry verticals.\n\nIn sports and entertainment, we are excited to service our first collegiate sports facility at San Diego State New Snapdragon Stadium. In hospitality, we continue to gain market share through renovations and new builds, leveraging our diverse fleet of brands. And in our commercial office pipeline, we are encouraged to see the momentum continue as companies return to the office and workspaces are reimagined. To drive the B2B growth, we are focused on the continued development of our sales team and expansion of our contract-grade product assortment.\n\nWe remain optimistic and excited about the potential of this business as there is no one else providing the full suite of services and offerings that we do. Moving to sustainability. We are thrilled to announce the recent publication of our 2021 impact report highlighting the progress and fulfillment of our industry-leading ESG goals. We remain committed to prioritizing sustainability, diversity, philanthropy, and worker well-being as key differentiators for our business.\n\nIn the report, we detailed progress on our long-standing commitment, including responsibly sourced cotton and wood, waste diversion, and increased fair trade premium. We are also one of the first home furnishing brands to set a science-based target for reducing our emissions across our company, and we have made progress decreasing our carbon intensity. Now I'd like to talk about our global business. We continue to believe that global expansion represents a sizable opportunity, and we are focused on a multichannel strategy in key markets.\n\nIn Q2, we continued building momentum with our franchise partnerships. Our presence in Mexico continues to drive growth, and we launched the Pottery Barn and Pottery Barn Kids websites in India with stores beginning in Q3 of this year and further expansion into 2023. And in our company-owned business in Canada, we continue to expand our family of brands with the launch of our Pottery Barn Teen website and the relaunches of Williams-Sonoma West Elm in our Pottery Barn Kids website in the market, all with great customer response. Before we get to the strong results of the brand, I want to update you on the supply chain.\n\nUnfortunately, this is an area where we continue to see significant disruption, inefficiencies and cost pressures. Although our in-stock position has improved, we have still room to improve our on-time shipments to customers. Also, we continue to incur higher distribution center costs to support our growth as well as higher ocean freight. And we are still incurring added costs to ship out of market and multiple shipments to service our customers.\n\nWe expect this pressure will continue in the second half of this year and the first half of next. This is reflected in our guidance and our outlook. Now let's turn to the performance of our brands. Pottery Barn delivered another extremely strong quarter with a 21.5% comp or 51.1% on a two-year basis.\n\nAll channels and product divisions contributed to driving incremental demand. Our high-quality proprietary furniture business continues to lead the growth. Pottery Barn continues to innovate with product and incremental growth initiatives. For example, in July, Pottery Barn launched the accessible home, an exciting new concept designed to enhance the quality of life at home with aging in-place community and people living with disabilities and injury.\n\nOur customers have responded enthusiastically about our efforts to address this underserved market, and we believe this could be a significant opportunity across our portfolio of brands. Moving to West Elm. West Elm delivered a 6.1% comp in the second quarter on top of 51.1% last year or 57.2% on a two-year basis. We're excited about our new businesses in kids and bath, which continue to drive outsized growth for the brand.\n\nAnd we launched our dedicated B2B e-commerce experience and expanded assortment there. Looking forward to Q3, we are focused on three key areas of growth at West Elm. One, improving furniture in-stocks and lead time reductions; two, expanding our depth in seasonal decorating, hosting and entertainment categories; and three, launching innovative collaborations across the brand. And with the ongoing success of our strategic initiatives, we remain confident in our ability to drive West Elm to become a $3 billion brand.\n\nNow I'd like to update you on our Pottery Barn children's home furnishing business, which delivered a sequentially stronger quarter with a 5.3% comp in Q2. During the quarter, we benefited from improving inventory receipts out of  Vietnam, which filed factory closures that occurred in the back half of 2021. Also, we successfully launched our biggest ever back-to-school collection, and we enabled functionality to ship dorm products in any store in any brand in our fleet across the country. Early results also indicate the seasonal holiday business will be a success given the early positive reaction to Halloween.\n\nIn the Williams-Sonoma brand, I want to highlight our recently announced change in leadership. Felix Carbullido, previously our chief marketing officer, has assumed the role of president of the Williams-Sonoma brand. Felix brings incredible talent to the position through his experience in strategy and operations in addition to a breadth of merchandising, e-commerce and marketing expertise. Felix is only three weeks into the role, but sees clear opportunities for the brand, particularly in key areas, including: one, leaning further into the brand's heritage of inspiring those who love to cook at home with relevant and useful storytelling across all channels; two, the importance of offering the best product and ensuring customers can rely on Williams-Sonoma to be in stock across the key essentials of a great home kitchen.\n\nAnd finally, there are white space opportunities not only in our core offering, but also in new categories that have clear adjacencies to the kitchen. In Q2, Williams-Sonoma came in at a positive 0.5% comp with accelerating comps throughout the quarter. This was driven by an improved in-stock position, newness in the assortment as well as higher conversion on the site driven by our ongoing e-commerce initiatives that improved imagery and shop path. In stock continues to improve, and we believe we will see further recovery in the back half.\n\nAs part of the Williams-Sonoma brand, our Williams-Sonoma Home business, we had a high double-digit comp again this quarter and continues to be an opportunity. Given the strength of the Williams-Sonoma brand name, our expertise in the furniture category and the clear opportunity in the high-end home market, we believe that Williams-Sonoma Home is destined to be a product leader of distinctive design-led, high-quality home furnishings. In summary, we are proud of our performance and we remain committed to executing on our growth initiatives and operational improvements to drive market share gains and strong long-term financial returns. I want to thank our customers, our employees and our shareholders.\n\nWe are committed to delivering for all of you. And with that, I'd like to turn the call to Julie to go through all the financials in more detail.\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nThank you, Laura, and hello, everyone. We had another outstanding quarter with revenues, operating margin and earnings all exceeding expectations. Our performance and execution remains strong. Our comps outperformed due to positive and healthy demand comps and accelerating order fulfillment.\n\nOur growth strategy has continued to build momentum and our operating margin continued to grow above expectations due to running a more regular priced business and another quarter of advertising and employment leverage. These factors enabled us to outperform on both the top and bottom line with double-digit comps and another quarter of operating margin expansion. Our results this quarter further validate that we are one of the best positioned to succeed in the short and long term with strong profitable growth. Moving to our second quarter results in more detail.\n\nNet revenues grew to $2.1 billion with comparable brand revenue growth at 11.3% on top of 29.8% last year for a two-year stack of 41.1%. This includes double-digit growth in both channels. In retail, we delivered an 11.4% comp despite retail traffic down almost 19% in 2019. And in e-commerce, we delivered an 11.3% comp and grew our e-commerce penetration 60 basis points year-over-year to 65.4%.\n\nMoving down the income statement. Our gross margin continued to hold near historic highs at 43.5%, which was 60 basis points below last year's record Q2. Our merchandise margins remained strong with another consecutive quarter of merchandise margin expansion year-over-year as we continue to preserve our pricing integrity by remaining committed to our decision to no longer offer sitewide promotions. The gross margin decline was driven by higher freight costs from our strong furniture demand, higher back order fulfillment and global supply chain disruptions, driving freight rates higher for all.\n\nWe also incurred incremental freight costs in order to best serve our customers, to get product to them timely by shipping from out-of-market distribution centers and in some cases, shipping multiple times for multiunit orders, which typically would have been done in a single shipment. Occupancy costs at 9% of net revenues were flat to last year, with occupancy dollars increasing 9.6% to approximately $193 million, which includes incremental costs from our new distribution centers on both the East and West Coast. These new distribution centers will allow us to support our ongoing growth, optimize service times for our customers and drive efficiencies in cost over time. And given our ongoing retail real estate optimization efforts, we were pleased that we were able to help mitigate these incremental costs and hold the occupancy rate flat.\n\nOur SG&A rate continues to be at a historical low at 26.4%, leveraging 90 basis points over last year, driven by advertising and employment leverage from our strong topline performance and ongoing operational efficiency. Across the company, we continue to operate with a disciplined approach, challenging all expenditures to maximize the return from our spend. These results once again led to a record quarter of earnings with our most profitable Q2 ever, including operating income growth of 12% to $366 million, and an operating margin at 17.1%, expanding 40 basis points over last year. This resulted in diluted earnings per share of $3.87, up 19.4% from last year's record second quarter earnings per share of $3.24.\n\nOn the balance sheet, we ended the quarter with a cash balance of $125 million with no debt outstanding and year-to-date operating cash flow of $384 million. This year-to-date cash flow allowed us to fund the operations of the business and to almost double our capital investments to support our growth. In addition, we returned excess cash year-to-date of almost $880 million to shareholders, through $113 million in dividends and $766 million in share repurchases, a significant increase over last year at this time. These elevated share repurchase levels reflect the confidence we have in the long-term strength of our business and demonstrate our commitment to maximizing shareholder returns.\n\nMoving down the balance sheet. Merchandise inventories, which include in-transit inventory, were $1.542 billion, increasing 32% over our reduced levels last year. Inventory on hand increased 28% over last year, but was only up 1% to 2019 versus sales up 56% over the same time frame. In the quarter, back order levels decreased.\n\nHowever, they continue to be too high in total. We are working hard to get these goods in to fulfill our customer orders. We believe that we will be able to return to normalized back order levels next year. Turning to our expectations for the remainder of the year and beyond.\n\nWe are reiterating our fiscal year '22 and long-term financial outlook of mid- to high single-digit revenue growth, growing revenues to $10 billion by 2024 with operating margins relatively in line with fiscal year 2021. Our reiteration of our outlook simply acknowledges that the economic backdrop remains uncertain with currently unknown outcomes surrounding spending trends, inflation, interest rates, supply chain pressures and global unrest. The fundamentals of our business remains strong, evidenced by our first half outperformance and the accelerating demand comps we are seeing as we enter the third quarter. Our confidence to achieve our revenue outlook is rooted in three tangible drivers.\n\nOur year-to-date trends, which continue to outpace the industry and reflect market share gains, our continued improvement in our inventory receipts expected through the back half, which will enable us to fill prior orders and lower our elevated back order levels and our ongoing strength in our growth initiatives, which continue to build momentum. From a profitability perspective, we expect cost pressures to continue in the back half and into the beginning of 2023, particularly across our supply chain, from the incremental distribution centers and related costs to support our growth plus higher ocean freight and other freight-related costs resulting from the global supply chain disruptions and our efforts to best serve our customers by delivering product to them as timely as possible. Despite these pressures, we remain confident in our ability to achieve fiscal year operating margins relatively in line with our fiscal year '21 rate at 17.7%, which was an all-time high, given our strong start to the year and our culture of strong financial discipline. In summary, we are very proud of the results we continue to deliver for our customers, associates and shareholders.\n\nThese results further validate our ability to deliver sustainable strong growth and profitability. As we continue to navigate the dynamic changes in the macro environment, we are confident that our strong foundation of differentiators and our operating model as well as the momentum of our growth initiatives will continue to keep us ahead of the competition. And this, combined with an environment where consumers are shifting increasingly online and are prioritizing value and sustainability in their purchases now more than ever, leave us uniquely positioned to continue to take market share and profitably. Finally, I would like to thank all our associates for their hard work and relentlessness in driving these great results.\n\nI would now like to open the call for questions. Thank you.\n\nOperator\n\nThank you. [Operator instructions]. We'll take our first question from Max Rakhlenko with Cowen and Company. Please go ahead.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGreat. Thanks a lot. Nice job in the quarter. So first, just on topline, can you share what demand was in the quarter and then just provide any more color on early 3Q trends? And then just bigger picture, what do you attribute the outperformance to and ways that you can play offense from here as the environment does get tougher?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nMax, it's Julie. So as we said in our prepared remarks, our demand comps remained positive and healthy and, in fact, accelerated as we entered into the third quarter. They are lower than our double-digit net comps. We had alluded to that in our last call that we had seen the demand comps start to moderate.\n\nBut they are nothing like what we've heard others indicate or report. And so we're pleased to see that we were able to deliver accelerated comps this quarter both driven by healthy demand and our accelerating net bill, and we're seeing both of those accelerate into the third quarter.\n\nLaura Alber -- President and Chief Executive Officer\n\nAnd, Max, to your question about why we're winning, and how come we're outperforming. First of all, thank you for the great question. We think it's a couple of reasons. First, we've said over and over what our key differentiators are and they're truly setting us apart.\n\nLet me just talk about the first one first in more detail than I have in the past. We talk about in-house design, which allows us to have proprietary products that is of high quality and at the best value. It also happens to be sustainable. But it also allows us to innovate and bring in collections that no one else has and see the white space.\n\nThis culture of innovation that we have is driving a lot of the great wins for our business. And truly, I don't believe we have these results have we not continued to deliver these important points. And each one is a seed that grows and some into very large brands. But in Pottery Barn, Example A is accessible home, really obvious and sizable business opportunity.\n\nWe just got started. They also have in Pottery Barn a bunch of great collaborations that they've been launching my favorite one with Hailey Bieber, which is really fun if you want to check that one out. On Pottery Barn Kids has always had really wonderful, exciting collaborations in different licenses that kids love from Beatrix Potter, Disney to Emily Meritt, Harry Potter, and those continue to drive relevancy for the brand and delight the trial. For West Elm, in terms of innovation, we've talked about B2B, we've talked about kids and bath.\n\nBut we also had some collaborations that really are working there like just Sarah Sherman Samuel. I don't know if you've had a chance to see that that's also in -- it's in Pottery Barn kids too. And this has really, really set us apart and gotten us more attention on our kids growth in our West Elm business. And we're still really low awareness that we even have a West Elm kids business.\n\nSo those are just some of the examples when we say innovation, we say that it's a differentiator that we design our own products. It's this culture of innovation that really, I think, is what's making us outperform.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGot it. That's very helpful. And then just on promotions, bigger picture. Can you speak to the strategies ahead? We've seen the debt increase, but maybe not suppressed, and you obviously haven't returned sitewide promos.\n\nSo just ahead, what should we expect from you? And I guess, ultimately, would you be willing to leave some topline on the table to maintain margins even if the industry does get very promotional in some of the quarters ahead?\n\nLaura Alber -- President and Chief Executive Officer\n\nYes. So first of all, the industry is already very promotional, particularly with the big box retailers faltering. There's a lot that they're flushing through, and that's been going on for more than just a couple of weeks here, you've been watching this happen most of this year. I believe, Julie, you did detail the difference between our MMU and our --\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nNot financially, but yes, MMU has expanded. And the delta is on our gross margin is simply just the shipping cost. But the MMU still remains strong. It's another quarter of expansion that we're seeing.\n\nAnd so even with the promotional environment, we're still able to drive that.\n\nLaura Alber -- President and Chief Executive Officer\n\nI think that's the key point that I want to make sure that no one confuses when they just do the quick read of the gross margin that you understand where it came from and where it didn't come from. We are committed to the elimination of sitewide promos. We believe this is absolutely the healthiest way to run our business for long-term success. And it's a function of the products that we sell that have great design, as I said, and great quality and are sustainable.\n\nAnd as long as we continue to maintain that value equation in the product and the innovation, I believe we're really equipped to maintain this posture because no one else has the same product out there in the market. That said, this commitment doesn't mean that we're not going to use markdowns to manage our inventory. We are very aggressive about managing our inventories and markdowns are part of any retail business, and we will take markdowns particularly in seasonal products and slow-moving SKUs, but we have not expanded the amount of promotions that we're running.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGot it. Thanks so much. [Inaudible].\n\nLaura Alber -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe'll take our next question from Cristina Fernandez with Telsey Advisory Group. Please go ahead.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nHi. Good afternoon, and congratulations on another good quarter. I wanted to ask about inventory receipts for the back half. I mean inventory has been tight, but it seems like it's improving.\n\nSo do you expect better inventory flow in the second half of the year as what you've seen so far in the first half?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nYes. I mean I would say we do. We certainly expect it to improve as we move throughout the back half. I think what's important to remember is that, I mean, first of all, as far as our growth to date, it's 32%, but it's still 1% on a three-year basis versus 56% up on sales.\n\nAnd we are dealing with a lot of -- we're shifting more to furniture and bigger cube items, and we're dealing with inventory coming in both to fill back orders but also to fill our current demand. And so that creates a lot of inventory coming in at the same time. And yet at the same time, we still need to get more inventory in to be in stock. And we still, as Laura mentioned, need to be thoughtful about the inventory that's aging to be able to get it pushed out.\n\nSo we have more room in the distribution center. So as we move to the back half, we do expect our inventory levels to get better but we'll still have elevated backorder levels into the first half of 2023.\n\nLaura Alber -- President and Chief Executive Officer\n\nYes. I think just to add to that, the good news is as we've gotten back in stock, which is really important to our customers, we have seen backorder crate rates come down. Back order levels have decreased even though they are still too high. Our cancel rates have moderated.\n\nAnd also just another thing under the covers is that, we have industry-leading lead times in our domestic in-house upholstery. Nobody else is shipping custom upholstery faster than we are. And as much as our on-time shipments are not where we want to be, we are extremely focused on getting back in stock and every day  working to serve our customers the best we can in this environment. And I do believe as we go through the balance of this year and next -- early next, we should be in a much better position.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nAnd then just a quick follow-up. On the merchandise margin, it seems like promotions are say, flattish year-over-year. So what are the other drivers that are allowing you to expand the operator -- the merchandise margin?\n\nLaura Alber -- President and Chief Executive Officer\n\nThat's an interesting question without giving too much competitive information away. We -- I think you know that we have taken some price raises. We've been very selective. We don't pass those costs on unilaterally to our customers.\n\nWe look to see where we're underpriced and where we can still offer value to this customer. And at this point, we are sort of plateauing on raising our prices. We're also starting to see that certain raw materials and fuel has come down in price. So over time, honestly, this should allow us to get price reductions from our vendor partners that we -- that could help our margins, and that would also potentially allow us to lower some of the prices to our customers.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nThank you, and best of luck this quarter.\n\nLaura Alber -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe'll take our next question from Adrienne Yih with Barclays. Please go ahead.\n\nAdrienne Yih -- Barclays -- Analyst\n\nGreat. Thank you very much. Good afternoon. Congratulations again.\n\nYou just keep the trend going. So, Laura, there's been a lot of discussion about household income brackets and kind of the lower end, obviously, feeling much more of the pain and having that creeped into kind of the median household income in the second quarter. You guys stayed pretty high up, but I'm curious, the strength that you saw at Williams-Sonoma Home seek to really hire in. West Elm would seem to me to be maybe more median-ish in terms of household income.\n\nCan you talk about what you're seeing with regard to these different target income brackets and how they're behaving?\n\nLaura Alber -- President and Chief Executive Officer\n\nSure. First of all, Williams-Sonoma home for us is still very small, coming off a small base. So I wouldn't read much into that for the total high-end industry. In terms of customers, I'm always looking at this data to see what we can see.\n\nI mean we don't see a ton of inconsistency across even location, slightly better, Southwest, Southeast, slightly better, but it's not material. Gen Z and millennials do continue to be our fastest growing segment, which is awesome. There isn't much differentiation with the income levels, except not based on income, it's about how much they spend. We're seeing people who spend more than $1,000 accelerate and people who spend less than $200 decelerate.\n\nBut that's also not surprising given that furniture is a strong growth vehicle for our business that you would see that they're buying more furniture from us versus anything else. So I don't -- I'm sharing this with you to share that we are looking at all these factors, and we're not seeing it, although one could conclude that we're more insulated because our customer is in a better situation from an income perspective. I think the bigger thing about the macro is that although there's been some slowing of the housing market, most of our customers have seen significant house appreciation, OK? And our customers love their homes, and it's one of the largest assets. And they are engaged with improving that asset.\n\nAnd this -- I think we all know, we're all spending more time in our homes, working, entertaining and investing in them, of course. And we also know that home furnishing always lag the home sale and the home remodel. Therefore, the current period metrics on home sales and interest rates don't necessarily align with the home improvement journey. And as a result, we continue to believe there's significant runway ahead for home furnishing sales.\n\nAnd while I'm talking too much, I might as well just add, although there's a lot of smart people out there predicting a recession, we're also seeing consumer sentiment improve as inflation cools. So there's a lot of reasons, I think -- believe we're gaining share and that we're in the right business. We've looked at a lot of different data sources, and it is really in a couple of data sources is very clear that we're gaining share, significant share.\n\nAdrienne Yih -- Barclays -- Analyst\n\nOK. And then for Julie, my follow-up is custom orders versus in-stocks. I know in-stocks have been hard to keep in stock. So I'm wondering if people have -- have you seen any noticeable difference in the movement to custom orders, those are obviously stickier and than non-cap cancellations because of the deposit, so any trends in that would be super helpful?\n\nLaura Alber -- President and Chief Executive Officer\n\nI'll take that, Adrienne. So custom orders, most of our upholstery business is custom, OK? People always want to choose their own fabric and their own frame. We don't do much stock upholstery at all. So there's no dynamic there really that's changing.\n\nWhat's stocked is our bedroom furniture, dining furniture, all those wood pieces. But most of our upholstery business is custom.\n\nAdrienne Yih -- Barclays -- Analyst\n\nOK. Thank you very much. Best of luck.\n\nLaura Alber -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe'll take our next question from Seth Basham with Wedbush Securities. Please go ahead.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot. Good afternoon. Congrats on a great quarter. My first question is just thinking about the outlook for the back half of the year, if 2022 operating margins are in line with 2021, that implies some modest yearly decline in the second half operating margins after a strong performance in the first half.\n\nWhat's driving that slight decline? Is it some of the additional supply chain pressure? Or is there anything else that might get work here?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nYes. So there's two things there. First of all, I mean, we are obviously reiterating our strong guidance giving a nod the fact that the environment is uncertain. So we're being cautious on that, but there is definitely some pressure that we're going to feel on the op margin line, particularly associated with these ongoing supply chain costs.\n\nSo we're going to continue to have incremental distribution center costs. We've got ocean freight costs that are higher along with dray and demurrage costs. So there's all the costs that are increased to get the goods to us. And then incrementally, we are doing the right thing by our customer to accelerate getting the goods to them.\n\nAnd so there'll be incremental cost for out-of-market shipments and for multiple shipments that we typically would have done in a single shipment. The one thing from a modeling perspective to make sure you're aware, if you remember last year in Q3, we had higher spot rate charges, and so that will help us to partially offset some of that incremental cost in Q3, but Q4, we didn't have that last year. And so you'll see that the Q4 is going to be a bigger impact than the Q3. But at the end of the day, of course, we will do everything we can to mitigate it as we always do.\n\nAnd thankfully, with the strength that we've had in the first half of the year, we are very confident in our ability to hit our operating margin in line with '21, which, as you know, is a 17.7% and the highest we've ever had.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThat's really helpful. And then relatedly, as your inventory start to normalize, you'll have more clearance and need to mark down slow-moving SKUs. How much has that been benefiting you for the last two years? And what kind of reversion do we see an impact on margins over the next year or two?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nI mean I wouldn't assume that that would go up per se. I mean we've always had inventories that ages, and we've always had to clear it. We've had warehouse sales for a while now. So I don't think there's anything there that is a significant shift, it should be concerning from a promotional stance or a margin perspective.\n\nRemember, most of what we sell is core. And so we're different than the apparel companies and so forth. And so as you get more inventory and you come back in stock, if it comes in late, there's a lot more pressure for them to push it out and get it out of the distribution center. For us, it's just a space play.\n\nAnd so we'll continue to have markdowns and things like that where we need to get rid of aged inventory, but there's no substantial shift that should occur.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGreat. Thanks a lot, and good luck.\n\nOperator\n\nWe'll take our next question from Anthony Chukumba with Loop Capital Markets. Please go ahead.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGood afternoon. Thank you so much for taking my question. Congrats as well on a great quarter, particularly given the tough sort of macro environment. So just a real quick question, just more of a clarifying question.\n\nIn prior calls, and I don't mean to nitpick particularly given the fact that you had a really great quarter. But in prior calls, you talked about the emerging brands and gave us updates there in terms of comps and your thoughts there. And I was just wondering if you -- if there's any color you would provide on the emerging brand performance in the second quarter? Thank you.\n\nLaura Alber -- President and Chief Executive Officer\n\nYes. I'm so sorry, I didn't do that just absolutely because we are being more additive in our prepared remarks, we have more time for Q&A. But they're both really driving profitable growth. So Mark and Graham, let's see, Julie won't want me to give the specific -- can I give them a specific comp? I can tell you double digit, OK? Same with Rejuvenation, double-digit comp on both these brands.\n\nAnd in rejuvenation consumer and B2B business are both performing consistent to each other and seeing strong performance across DTC and retail and Rejuvenation. We still would love to have a few more stores because stores are really good in driving brand awareness for Rejuvenation. And in Mark and Graham, we're really -- we're pushing the trends that are post pandemic trends like travel, social sports, home entertaining as primary drivers of incremental brand growth. And we're seeing particularly resurgence of tennis and golf, pickleball, fueling this business.\n\nIt's a really fun gift business, and we're starting to see people really noticed us and come to us for their stuff. We're excited about both Mark and Graham and Rejuvenation as growth vehicles for our company.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGot it. No, that's really helpful. And yes, I appreciate you adding your comments, but don't edit your comments just so you can hear more questions from the likes of sell-side analysts like me. Anyway, just second real brief question.\n\nI mean, obviously, very strong free cash flow in the first half of this year. I would expect to see continuous strong free cash flow in the second half, you've been very aggressive about buying back stock. Obviously, you have the dividend. But how do you think about just near term about capital allocation, particularly like in the back half of this year?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nYes. I mean we're going to continue with buybacks and our dividends, of course, maybe not to the same degree we'll see. Certainly, we still believe our stock is undervalued. It has recovered nicely.\n\nWe're pleased that we were able to buy the stock back on average for about $138, and obviously, stock is much higher now, but it's still undervalued. And so we're going to continue as long as we have some really strong free cash flow and are generating this kind of earnings and cash that we are, we think the right thing to do is to return it to our shareholders. So we're still committed to doing that.\n\nLaura Alber -- President and Chief Executive Officer\n\nAnd I think also the buyback signals also the confidence we have in our guidance.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGot it. Very helpful. Keep up the good work. Thank you.\n\nOperator\n\nWe'll take our next question from Chuck Grom with Gordon Haskett. Please go ahead.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey, guys. Good afternoon. Nice quarter. On our math, it looks like your backlog release continues to gain steam, which is obviously a good thing for your customer.\n\nBut is it possible to size up where you are today on the backlog versus maybe where you were last year? And is there a banner where the backlog levels are more severe than others?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nYes. I mean we haven't disclosed the total amount, as you guys know, but it has come down, but it's still incredibly sizable. I think we may have said before that most of the back orders associated with furniture. So certainly, Pottery Barn and West Elm have a sizable amount of back orders, but every brand has them.\n\nAnd the good news is we are starting to bring that balance down, and certainly, that's a tailwind for the back half and as we move into 2023.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. And is there a banner that is higher? Would you say PB is higher than maybe Sonoma or West Elm?\n\nLaura Alber -- President and Chief Executive Officer\n\nWell, Sonoma is obviously lower, less furniture.\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nPottery Barn is our largest brand.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. And then on the 9% or so increase in occupancy dollars year-over-year. It sounds like the distribution center openings are an incremental spend on that line item. I guess is there a way to think about the occupancy line over the next couple of quarters given those openings?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nYes, it will be a little bit higher, kind of similar to where it has been now because of those incremental distribution centers. At the same time, we've had some offsite that should be coming off. We've got some incremental hubs that over time will come off. But I think the bigger play, as you know, is our retail real estate optimization strategy, and most of our stores that we plan on closing close at the end of the year.\n\nAnd so as you start to lap into the new year, you'll get the benefit again from that reduced occupancy costs associated with those stores. So -- but in the shorter term, yes, there will be pressure on that line.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nAll right. Great. Thank you.\n\nOperator\n\nWe'll take our next question from Jonathan Matuszewski with Jefferies. Please go ahead.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nGreat. Thanks for taking my question. Nice quarter. First one was just on supply chain.\n\nLaura, you mentioned challenges still persist there. Just curious where you guys are from a diversification standpoint? I think a while ago, you mentioned reducing China exposure by half. So just curious how much there is to go on that initiative? That's my first question. Thanks.\n\nLaura Alber -- President and Chief Executive Officer\n\nYes. I think that's an ongoing journey. We have significantly reduced the China exposure. What we're working on now is just having multiple high-quality vendors who can make some of our high-risk furniture for kids.\n\nit's been harder to find multiple vendors who can do that and to also do the -- yes, this has hit the sustainability mark that we're looking for. So we're really always looking for additional high-quality suppliers would be what I would say to that.  And the continuation out of China has happened, but it doesn't mean you're moving it to a place that is free of any other issues. There's a lot of different issues in all these places around the globe, including the domestic market. So we just have to have more options in terms of where we are.\n\nI think this is going to be a continued issue for a while because these factories are skittish to open to -- much further than they are and to accelerate given the recessionary fears that everyone has out there. So I think we're going to continue to see pressure on flow from some of the highest quality vendors.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nThat's helpful. And then my follow-up question, Laura, you mentioned millennials and Gen Z, the fastest-growing cohorts you're seeing. So a question on marketing strategy for you. It feels like you guys are leaning in a bit deeper into brand ambassadors, influencer marketing from what we see on social media.\n\nYou launched the West Elm collective not long ago. I never really thought about Gen Z as really a core demo for your business, but it is a group that leverages some of those channels. So just your thoughts on how you've been leaning in more to that channel, how impactful it's been? You guys have always done a good job with digital marketing. But it seems like you guys are making a bit more of a pivot at least from what we see.\n\nSo any thoughts there in terms of the impact?\n\nLaura Alber -- President and Chief Executive Officer\n\nIt's interesting. Felix is just there with me and since he's still doing two jobs. I'm going to make a few comments, too. But video is very engaging.\n\nSo whether it's video on TikTok, on our sites, on Insta, we're doing more video. And as much as a lot of millennials and Gen Z get credit for liking video, don't we all like video. The stuff we're doing for that generation, I think, is appealing to all, and we're certainly always pushing to try these new channels, whether it's Pinterest or TikTok, Snapchat. Pinterest, has been much better than I expected, frankly.\n\nAnd I think there's still a lot of room to go there. And the TikTok, Snapchat, YouTube group is also showing that their engagement is multilayered and different than just a product ad on Google. Felix, do you want add anything to that?\n\nFelix Carbullido -- Chief Marketing Officer and Executive Vice President\n\nNo, I think it's undeniable, the impact that TikTok has on customers of all ages, particularly those demographics to what you talked about. But they also -- they bring a couple of things. They extend the reach of our brand, they introduce our brand to new customers, but some of the design collaborations also bring new aesthetics. So it's about offering a diverse point of view or expression of our brands to customers so we can acquire more and introduce our customers to some of these new looks and some of these new influencers.\n\nSo it's -- you're correct, we've leaned more into that because society has. And we're -- we want to make sure we're as relevant as we always have been.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nThat's helpful. Thanks, guys. Best of luck.\n\nOperator\n\nWe'll take our next question from Brad Thomas with KeyBanc Capital Markets. Please go ahead.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nLet me add my congratulations as well. Great first half of the year here. It's a little early probably to talk about the holiday season, but that's obviously your most important quarter of the year. So wondering, Laura, Julie, if you could just comment a little bit about maybe from a merchandising standpoint, how you plan for this year, how you're thinking about the consumer and any differences in how it may show up here for the holidays? And any nuances of how the mix is a little bit different during that quarter?\n\nLaura Alber -- President and Chief Executive Officer\n\nWe love the holidays. And frankly, we have a great lineup, and it's always good to see the Halloween off to a good start, as I alluded to, in the kids business also off to really good start in PD and Williams-Sonoma, I should have said that. But we built on last year's great sellers. We sold out very fast last year of a lot of our key holiday products.\n\nAnd so we're going to get a chance to fully leverage those ideas that barely made it before last year. And we're excited about Williams-Sonoma. The Williams-Sonoma holiday season was disrupted last year by COVID. Let's remember, Thanksgiving was not exactly easy.\n\nI had many -- my family not be able to make Christmas because of COVID.  So this year, it should be a much easier celebration for people to come together, and we're really looking forward to being a part of that and giving our customers great experience and great products to celebrate the holidays with and Felix and his team are really working on holiday preparedness right now on the website. And in fact, Felix, I think you had a meeting today with our district managers?\n\nFelix Carbullido -- Chief Marketing Officer and Executive Vice President\n\nYes. I mean before this meeting, I spent four hours with our district managers across the country to come in and look at holiday because it is such an important part of our business, but it's critically important for retail. And so we walked through the assortment. I think everyone is super excited about it.\n\nLaura mentioned a number of things I'm excited about, but seasonal holidays are another one because there's always -- every single month, there's a reason to celebrate. And I can't -- there's no better brand to celebrate with than Williams-Sonoma. So I'm super optimistic about this holiday and holidays going forward for this brand. So stay tuned.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nThat's great. Thank you so much.\n\nOperator\n\nWe'll take our next question from Simeon Gutman with Morgan Stanley. Please go ahead.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHi. Good afternoon, Julie and Laura. I wanted to ask about the tone of the consumer. Last quarter, there was some mentioning of, I think, some choppiness coming into this quarter.\n\nAnd it sounds like things have picked up and the sentiment has gotten better and demand comps have gotten better. I want to make sure that that's the right read and you're not seeing the tentativeness that maybe you were at the early part of the quarter?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nNo, that's exactly right. I mean as we said in our last call, as we started that call or that quarter, we saw demand comps moderate. And we're really pleased and excited to see them coming back and accelerating and being strong, heading into third quarter. And so we haven't seen, again, what others are mentioning out there.\n\nSo it's really different for certain retailers. And thankfully, we're one of those that are seeing real strength in our business.\n\nLaura Alber -- President and Chief Executive Officer\n\nI remember, we're only three weeks into the quarter, don't overread this, but this is -- this is what we meant to signal to you is exactly what Julie just said.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAnd B2B, the growth, I'm assuming, is outpacing the house average in terms of comp. Can you share at least the spread? Is that spread widening? Is it narrowing? And is B2B concentrated among any of your brands?\n\nLaura Alber -- President and Chief Executive Officer\n\nYes. It's a consistent beat to last year in growth. And we're seeing also a lot of innovation from the brands to see B2B. So as we mentioned, bring in products that we can offer is a big part of the strategy and more contracts means more sales for B2B because they can do even more in the project.\n\nIn terms of penetration, Rejuvenation by nature, a small business, but a large percent B2B, has always been. Trade has been a big part of that as people furnish hotels with their custom-configured lighting. But West Elm and Pottery Barn are really very strong in B2B and Williams-Sonoma has a lot of opportunity. We started.\n\nYou've heard us talk about the gifts that we do with wins from the holidays, the business and there's a lot more room particularly as we expand the assortment in Williams-Sonoma Home because right now the assortment is so small, it's hard to do large-scale projects Williams-Sonoma Home, lots of opportunity across the board.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThank you. Good luck.\n\nOperator\n\nWe'll take our next question from Oliver Wintermantel with Evercore ISI. Please go ahead.\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nHi, guys. I have a follow-up question for the B2B question from Simeon. Can you maybe give us a little bit more details what the margin is on the B2B business versus the rest of your business?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nYes. We said -- I mentioned this to you in the past, but it's accretive to our total company operating margin at this time. So as that business continues to grow, we get the incremental benefit on the bottom line.\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nPerfect. And then on the -- with now the success and also the -- not just the e-commerce but also in new stores, have you reconsidered closing what you disclosed before? I think it was 25% of your store base. Is that something that you're having a different look at now with your success over the last few quarters?\n\nLaura Alber -- President and Chief Executive Officer\n\nGreat question. We continue to reassess and review our real estate strategy. And while we have been closing stores, we've also had incredible success in repositioning and relocating stores in their current market. A perfect example in our backyard, we moved our Williams-Sonoma Corte Madera storage in a small space and they are off to a very strong start in that store.\n\nAnd then as I look at the other Williams-Sonoma stores that we've repositioned, they are outperforming their forecast too as customers embrace the new design that provides an improved inspirational shopping experience. So we look at this as an opportunity to improve our retail fleet, not to just think of it as a line item on the P&L. But of course, there are some stores that underperform or are in areas that are not as vibrant and we are always going to look for the best location in town.\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nGot it. Thanks very much, and good luck.\n\nLaura Alber -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nWe'll take our next question from Marni Shapiro with Retail Tracker. Please go ahead.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nCongratulations. I do want to take again on the B2B, not to beat it up, I'm actually asking on the positive. Can you just talk a little bit about how the expense structure works there? I'm assuming you have a sales team. But it sounds like the products are coming from the brand.\n\nSo is the design and R&D part coming from the brands? Because that feels like a really reliant way to leverage what's already done. And then could you just touch a little bit on the relaunch of Holds Everything because I thought the timing of it was interesting. And I always liked that brand? So I'm curious about that as well.\n\nLaura Alber -- President and Chief Executive Officer\n\nOK. Great. So you're absolutely right, Marni. The structure is we have a dedicated sales team.\n\nAnd then we have Jose who runs it, who's powerhouse looking and working with the brand presidents to identify opportunities for categories that appeal to our clients. So if she sees white space, she says, \"Hey, let's work on this area.\" And then the brands work together and they develop new products or we have to get products contract grade approved, which most of them are, they were already and then some we had a test and then some we actually had to change to make them more durable, which, by the way, I think is pretty good for consumers to make something more durable. But as I'm looking at this incredible list of client examples, she's got not just the ones I mentioned. But whether it's Marriott headquarters hotel, Waldorf Astoria, Marriott Vacations, Hilton Boston, New Orleans, Charlotte Ceria Scottsdale, IHG Kimpton, InterContinental San Antonio, Hotel Indigo, Hyatt Regency, Huntington Beach, I mean, I could just go on and on and read you all these projects that we are doing that are so exciting.\n\nAnd it's just new space for us to be in, and it is that we want  to furnish any space with new furniture. And so this has been just a wonderful partnership between the B2B team and the brand team. And then the question on Hold Everything. So we only have [Inaudible] everything back of the day, and then we close it, wasn't doing so well.\n\nBut we saw an opportunity to distort just a relevant to bring it back really under the Williams-Sonoma banner. And we've designed and housed beautiful, high-quality products. And we just made it more visible on the site. And we have, I think, up to 50 products now.\n\nMy favorite being the expandable storage organizer for your drawer, which if you check out, you'll see why it's great because there's versions of that online, but they really break and it makes your kitchen look like a custom kitchen and who doesn't want to be more organized. So it's been a very successful initiative and it's gaining steam, and it's real volume for us.\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nThat is really exciting. Best of luck. [Inaudible] look fantastic.\n\nLaura Alber -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe'll take our final question from Kate McShane with Goldman Sachs.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nThank you so much. Thanks for taking our question. I'm just going back to a previous question that was asked with regards to the freight cost. I just wondered if there was any way you could compare the cost between what you're experiencing in Q1 versus Q2? And how you expect that to change just because you have been dealing with backlogs and multiple deliveries for some time? I just was curious what the change was between quarters and going forward?\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nYes. I think the bigger change is in the ocean freight side of things and the dray and the demurrage as we're getting these big volumes of inventory coming in, there are containers that need to be moved around, need to be stored accordingly. And ocean freight rates, as has been the case for everybody, have gone up. And so that happened sort of I think it was May or June, and then as you know, those sort of charges get capitalized on the balance sheet as part of inventory, and so you don't recognize those until you make sales.\n\nSo it's a function of turn, which is why we're starting to feel some of those more toward the back half. But that's the reason.\n\nOperator\n\n[Operator signoff]\n\nLaura Alber -- President and Chief Executive Officer\n\nThank you. Appreciate your support. Happy shopping.\n\nDuration: 0 minutes\n\nJeremy Brooks -- Chief Accounting Officer and Head of Investor Relations\n\nLaura Alber -- President and Chief Executive Officer\n\nJulie Whalen -- Executive Vice President and Chief Financial Officer\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nAdrienne Yih -- Barclays -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nFelix Carbullido -- Chief Marketing Officer and Executive Vice President\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nMarni Shapiro -- The Retail Tracker -- Analyst\n\nKate McShane -- Goldman Sachs -- Analyst\n\nMore WSM analysis\n\nAll earnings call transcripts"
}