{
  "companyName": "Malibu Boats",
  "companyTicker": "MBUU",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/malibu-boats-mbuu-q4-2022-earnings-call-transcript/",
  "content": "Malibu Boats (MBUU -0.17%)\nQ4 2022 Earnings Call\nAug 25, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Malibu Boats conference call to discuss fourth quarter and full fiscal year 2020 results. Please be advised that reproduction of this call in whole or part is not permitted without written authorization of Malibu Boats. As a reminder, today's call is being recorded. On the call today from management are Mr.\n\nJack Springer, chief executive officer; and Mr. Wayne Wilson, chief financial officer; and Mr. Ritchie Anderson, chief operating officer. I will turn the call over to Mr.\n\nWilson to get it started. Please go ahead, sir.\n\nWayne Wilson -- Chief Financial Officer\n\nThank you, and good morning, everyone. On the call, Jack will provide commentary on the business, and I will discuss our fiscal fourth quarter and full year 2022 financials. We will then open the call for questions. A press release covering the company's fiscal fourth quarter and full year 2022 results was issued today, and a copy of that press release can be found in the Investor Relations section of the company's website.\n\nI also want to remind everyone that management's remarks on this call may contain certain forward-looking statements, including predictions, expectations, estimates or other information that might be considered forward-looking, and that actual results could differ materially from those projected on today's call. You should not place undue reliance on these forward-looking statements, which speak only as of today, and the company undertakes no obligation to update them for any new information or future events. Factors that might affect future results are discussed in our filings with SEC, and we encourage you to review our SEC filings for a more detailed description of these risk factors. Please also note that we will be referring to certain non-GAAP financial measures on today's call, such as adjusted EBITDA, adjusted EBITDA margin, fully distributed net income and adjusted fully distributed net income per share.\n\nReconciliations of these non-GAAP financial measures to GAAP financial measures are included in our earnings release. I will now turn the call over to Jack Springer.\n\nJack Springer -- Chief Executive Officer and Director\n\nThank you, Wayne, and thank you all for joining the call. Fiscal year 2022 was another record for Malibu Boats, which included fantastic fourth-quarter results that surpassed expectations. Despite persistent supply chain and inflationary headwinds impacting the broader marine industry, our differentiated operating model, vertical integration capabilities and strategic leadership continues to shine through, helping us persevere and be the market leader. For fiscal year 2022, net sales increased nearly 31% to a record $1.2 billion.\n\nGross margin remained strong at 25.5%, and adjusted EBITDA grew 30% to a record $247 million, while adjusted EBITDA margin remained relatively consistent at 20.3%. During the fiscal year, we have met unwavering demand by amping up our production capabilities through our vertically integrated model. As a result, we supported strong order volumes and ultimately exceeded our full-year guide. Malibu continues to set the tone, led by our operational excellence, premium brands and unmatched manufacturing capabilities across our differentiated portfolio.\n\nWe look to carry this momentum forward into the 2023 fiscal year supported by our new Malibu products. Retail demand remained very strong and has continued to support extremely robust ASPs across all brands. During the fiscal year, we did a masterful job of optimizing price in a difficult supply constrained environment compared to the broader marine industry. With many competitors across our segments raising prices into the double digits year over year, we are proud to deliver our industry-leading innovation with minimal price increases comparatively, which will be a competitive advantage.\n\nAs many boat manufacturers experienced, we did see a slight pause with the delayed spring. However, retail demand bounced back with a dealer seeing a quick recovery around Memorial Day that carried through the quarter end. As a result, we have orders extending well into the first half of fiscal year 2023, and they show no signs of slowing. The strength of the Malibu consumer has proven resilient.\n\nWith our tried and proven experience successfully navigating through challenging market cycles, we are confident in our strategic and operational capabilities, coupled with our ability to execute in any macro environment. Across all of our brands, we are performing at very high levels. Led by Malibu and Cobalt, we have consistently increased production volumes to keep pace with strong retail orders and have already begun to build back inventory in the channel in these segments. At this time of the year, in the freshwater environment, that is important because buyers want the boat right away to enjoy the last few weeks of the season before cold weather.\n\nWe believe this will give us an advantage over the first and early second quarters of fiscal 2023. While Malibu and Cobalt have begun to build back some of our channel inventory, our saltwater brands, which are still seeing higher-than-normal number of retail sold orders, have yet to make the same step forward and channel inventories remain very low. Although marinewide supply chain issues continue to limit the channel build across our brands and especially in the saltwater brands, we now believe that as the supply chain cooperates, we will see inventory begin to build at a better pace in the second half of fiscal year 2023. We and other marine experts continue to believe that channel inventories will not reach normal levels until the end of calendar 2023 or the beginning of calendar 2024.\n\nThis provides us with a great ramp-up opportunity despite any macroeconomic conditions that may exist. Headwinds driven by supply chain disruptions continue to be the limiting factor to normalizing production, with the biggest issues continuing to come from engines across all manufacturers, windshields, electronics and imports from Asia driven by continuing port congestion on the West and East Coast. As we have stated in the past, we maintain that any real improvement in the supply chain will not begin until the first half of calendar year 2023, and we are in an optimal position to execute as these headwinds improve and customers start coming back into dealerships looking for stock boats. Despite these headwinds, our production capabilities have never been stronger.\n\nOur recent acquisition of Malibu Electronics represents just another example of our strategic leadership and foresight in managing our supply chain. Importantly, we would not have been able to shift the volume that we did at Malibu and Cobalt without the addition of Malibu Electronics to our vertically integrated model. We will only continue to see the benefits compound as we ramp up production in the quarters to come. Turning to our market performance, we continue to hold our own in every brand.\n\nAnd particular, I couldn't be prouder of the team at Cobalt. As you know from past calls, Cobalt was late to the game in the outboard market when we acquired them. It was an immediate product focus for us, and we have since expanded the number of models from three to seven with more to come. For context, in June of 2018, Cobalt's outboard market share was approximately 4.4% in our competitive segment.\n\nBased on the early June 2022 numbers released last month, Cobalt's outboard share is now up to 18.1% year to date. In just the last year alone, we have increased our outboard market share by 600 basis points and look to maintain this trajectory in the quarters to come. Whether it be Malibu, Axis, Cobalt, Pursuit or Maverick, no one has a track record of success in designing and bringing new products and innovations to market. We win hands down on product and are very excited to release our incredible 2023 product lineup.\n\nFor Malibu and Axis, we are again introducing four new boats, which is far more than any other competitor. This includes the all-new Malibu 22 LSV and 26 LSV, and the Axis A25 and T235. We are especially excited about our new Malibu 26 LSV. This 26-foot monster of a wave and wait machines is the largest boat ever built by Malibu and will serve a market that is growing in demand at every turn.\n\nThere are also compelling new features which will debut on this model and extend across our other Malibu models. While there is a plethora of new and compelling features, I will give you a taste of three in particular. For several years, our focus on features has been around functionality, what makes the customers experience more convenient and ergonomics. Case in point, we are introducing the MAX Pivot seat, which smoothly changes between multiple physicians and functional uses, and it now includes a bench seat, a bed and a fully functional table.\n\nOur new Malibu stereo system now features amplifiers that are 70% smaller, subwoofers, speakers, improved DSP tuning capabilities and a transform remote, which will take the user into the next stage of sound. And lastly, for Malibu, our redeposition sensor, which displays on the command center's main screen, will help enable ease in docking, slow-speed maneuvering and takeoffs with riders. Turning to Cobalt, building on our R-33 series with the sterndrive boat release in fiscal year 2022, we have recently announced the R-33 outboard version for our coastal customers. The hunger for these two boats has been loud and clear, with demand exceeding what we had initially projected by a large margin, which is a nice problem to have.\n\nIn just three weeks at the Cobalt dealer meeting, we will be unveiling our new R-35-stern and R-35 outboard boats for a first look by our dealers. There is no doubt that these two exceptional boats will also be in high demand as we make them available to the public after the first of the year. Two features for Cobalt that I'm excited to talk about are the new seat keeper options that eliminates up to 95% of boat roll. The marine industry has seen this feature become a must-have for boats over 30 feet in the saltwater environment, and we will make this feature available on our two new R-33s as well as the two new R-35s.\n\nSecondly, we are introducing a side boarding door option for the R-33 standard and the R-33 outboard as well the R-35 standard and the R-35 outboard. This option provides effortless side entry and access to the boat and is very similar to the version offered on many Pursuit models. At Pursuit, during the beginning of our fiscal year in July, we introduced our largest boat ever built at Pursuit with the OS 445. This offshore boat, which features massive living accommodations, first-in-class bounce feeding and an incredible amount of storage, has already amassed orders for the next year and a half despite just now being seen in the wild.\n\nIn next couple of months, we will introduce a new boat on the other end of the link spectrum, the brand-new S248 which will capture that smaller saltwater market. There will be a third boat introduced in the second half of the model year that is a whitespace vote that we expect will drive significant volume over the next few years. For Maverick Boat Company, we are launching our first new product since we acquired the company, with the unveiling of the new 2023 Pathfinder 2400 TRS, which will be introduced at the MBG dealer meeting next week. Our team at Pathfinder was given full rein to build both of their dreams and beat the competition to their return.\n\nThey have done just that, and we expect the line to buy this boat to be longer than a Sunday after church at a Golden Corral buffet. As we end another record year, I am proud of the significant progress our team continues to make. We are the best, and we continue to get better every single year. We have set ourselves in a unique position to continue our pace of ramping production.\n\nHeading into fiscal year '23, we are on track to start our channel build, and we remain confident in the outlook as demand remains high. As we have stated over the past 18 months, even if there is a downside scenario, our previous experience, best-in-class operations and battle-tested strategic leadership will mitigate these potential headwinds, allowing us to maintain strong margins in the quarters to come. Overall, our team's hard work, commitment to excellence and agility in the midst of a challenging supply chain environment has delivered superior results, allowing us to cruise pass the competition, deliver more boats to our customers and maintain our track record of success. As we embark on fiscal year 2023, we believe our future remains exceptionally bright.\n\nWe have a winning playbook, demonstrated by over a dozen years of continuing success. From unprecedented consumer demand, the introduction of our new model year 2023 products, historically low dealer inventories, our unbeatable culture of operational excellence and vertical integration, we are extremely well positioned to drive substantial growth and profitability all the while delivering long-term value for our shareholders. I will now turn the call over to Wayne for further remarks on the quarter.\n\nWayne Wilson -- Chief Financial Officer\n\nThanks, Jack. In the fourth quarter, net sales increased 27.6% and to $353.2 million, and unit volume increased 10.3% to 2,596 boats. The increase in net sales was driven primarily by year-over-year price increases, a favorable model mix and increased unit volumes, primarily in our Malibu and Cobalt segments. The Malibu and Axis brands represented approximately 56.9% of unit sales or 1,478 votes.\n\nCobalt represented 22.7% or 588 boats and saltwater fishing represented the remaining 20.4% or 530 boats. Consolidated net sales per unit increased 15.7% to approximately $136,000, primarily driven by year-over-year price increases and a favorable model mix. Gross profit increased 29.5% to $89.6 million, and gross margin was 25.4%. This compares to a gross margin of 25% in the prior-year period.\n\nSelling and marketing expense increased 1.7% or $0.1 million in the fourth quarter As a percentage of sales, selling and marketing expense decreased by 40 basis points. General and administrative expenses increased 2% or $0.3 million. The increase was driven primarily by an increase in compensation and personnel-related expenses, increases in information technology expenses and travel, which were slightly offset by a decrease in professional fees. As a percentage of sales, G&A expenses, excluding amortization, decreased 120 basis points to 4.9%.\n\nNet income for the quarter increased 42.1% to $49.7 million. Adjusted EBITDA for the quarter increased 28.3% to $73.9 million, and adjusted EBITDA margin increased 10 basis points to 20.9%. Non-GAAP adjusted fully distributed net income per share increased 32.1% to $2.43 per share. This is calculated using a normalized C-corp tax rate of 23.8% and a fully distributed weighted average share count of approximately 21.3 million shares.\n\nFor a reconciliation of adjusted EBITDA and adjusted fully distributed net income per share to GAAP metrics, please see the table in our earnings release. As Jack mentioned earlier, we delivered another record-setting year in fiscal 2022, further cementing our position as the most innovative and efficient operators in the industry. Our feature-rich boats continue to be highly sought after by our customers, and we have further enhanced our ability to deliver despite persistent headwinds affecting the broader marine industry. We are just beginning to see the benefits of our timely strategic acquisition of Malibu Electronics, which has helped us successfully improve our volume output across Malibu and Cobalt through the back half of the fiscal year.\n\nWe are also still in the early innings of realizing the potential of our Maverick plant expansion, which will add even more production capacity to our saltwater segment. Looking at full-year numbers. Net sales increased 31.1% to a record $1.2 billion, and unit volume increased 13.1% to a record 9,255 boats. Consolidated net sales per unit increased 16% to just over $131,000, driven by higher sales of new, more expensive models and optional features higher year-over-year prices.\n\nGross profit increased 31.1% to $310.1 million. Net income for the year increased 43% to $163.4 million, and adjusted EBITDA increased 29.7% to a record $246.5 million for the full year. For the year, non-GAAP adjusted fully distributed net income per share increased 31.6% to a record $7.91 per share. As mentioned in prior quarters, we believe that heading into fiscal year 2023, our continued ability to produce more units will build channel inventories, setting our dealers up to win the retail battle.\n\nOur agility in managing supply chain issues has given us a significant competitive advantage, helping us continue to efficiently produce the best and most innovative products, while fortifying our industry-leading fiberglass boat manufacturing capabilities. We are excited to showcase our new model year line, highlighting our unmatched innovation, quality and feature-rich boats. Based on our current operating plan, expectations for fiscal year 2023 are as follows. We anticipate net sales growth in the mid- to high single-digit percentage growth year-over-year.\n\nIn terms of cadence, we see higher year-over-year growth in the first half and nearly double the annual rate in the first fiscal quarter. Consolidated adjusted EBITDA margin is expected to be down slightly. However, we believe there will be a modest increase year over year in the first fiscal quarter. In closing, fiscal year 2022 was a massive success as we set numerous records for operational and financial performance.\n\nWe've proven that no matter the environment, from supply chain disruptions to inflation, we have the teams and capabilities to push the throttle forward and capitalized on continued strong retail markets. Our differentiated best-in-class portfolio continues to perform at the the top of marine industry, and our fiscal year 2023 lineup will push the boundaries as we continue to drive long-term value for our customers and shareholders. With that, I'd like to open the call up for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Brett Andress with KeyBanc.\n\nBrett Andress -- KeyBanc Capital Markets -- Analyst\n\nI was hoping to get your thoughts on the July SSI data, or really any of the data we follow for the last few months. You did mention that spring pause. Has there been any difference there in that data versus how you guys were expecting it to play out? Or are you seeing anything different in your own warranty registrations? Just trying to kind of make sense of some of it.\n\nJack Springer -- Chief Executive Officer and Director\n\nYes. We're trying to make sense of it, too, Brad. The SSI data is more problematic than it's ever been. And the caution I'll give is that we have said, since we went public, that if you look at any one given month, it's going to be wrong.\n\nFirst of all, it's -- at best, it's 55%, 60% of the states that are reporting. It's not until it matures over that quarter that it begins to have some semblance of truth to it. And so we really wait for that. The thing I'll point out, though, and this even goes back to the June data that came out, there were three states that were missing.\n\nAnd so the disarray right now that's going on with SSI just doesn't give us any confidence. We are looking very closely at our internal warranty numbers, which do indicate a different story.\n\nBrett Andress -- KeyBanc Capital Markets -- Analyst\n\nGot it. And then if you want to elaborate on that story, that would be helpful. But my second question is just on the channel restock opportunity. I think you've given us some numbers in the past, the total units needed to restock channel.\n\nWhere are we with that today? And if you're 2023 guide plays out like you expect, how much progress would you expect to make there?\n\nJack Springer -- Chief Executive Officer and Director\n\nI think from the standpoint of the channel inventory, we always talk in weeks on hand, and it's still double-digit weeks on hand that's low across the board, more so in the saltwater than the freshwater as we talked about. I think as the year progresses, we will continue to see a better channel inventory build, first of all on Malibu, secondly and cobalt, to that freshwater segment. And then it will follow in saltwater. But that won't even -- I don't think began taking place until the second half of the year.\n\nSo if we look at cumulatively all of our brands, it's easily -- when we get within that three to five weeks on hand, I believe, easily, it's going to be the end of fiscal year '23, and then fully getting up to speed on channel inventory is going to be the end of '23 or the beginning of '24.\n\nOperator\n\nOur next question comes from Jaime Katz with Morningstar.\n\nJaime Katz -- Morningstar -- Analyst\n\nSo I'm curious to hear what you guys are seeing from an economic perspective. Obviously, the demand from a shipment perspective is pretty good. But is there any cutting back anywhere? Accessories, obviously, we see the ASP numbers. Is there any weakness that can be alluded to or anything different maybe in the new boat buyers relative to the historical buyers that would indicate any sort of trend shift?\n\nJack Springer -- Chief Executive Officer and Director\n\nYes. Jaime, that's a good question. It's something that we're following very closely. And I'll talk about it on two different planes.\n\nFrom a standpoint, I'm talking a lot to dealers, anybody that I can talk to, Wells Fargo, whoever it may be. And this is a great time of the year for me because we have four dealer meetings in a period of three months. And so I'm able to communicate directly one-on-one with the dealers and get an understanding of what's happening. Speaking to our brands and what we have, we are not seeing any type of a shift change.\n\nWe've continued to see people come out and buy the larger boats. I think the last year's brand-new T250 model is a great example of that. The largest access ever built, it outperformed expectations. So they continue to buy the larger boats.\n\nThey continue to auction up boats and buy every conceivable feature that would make sense for a given customer, and that's across all of our brands. And I'll point that to really one thing, and that's our demographic. We have a unique, very strong demographic that, in my opinion, is the last demographic that's ever affected by economic conditions. Our -- if you look at our annual income across the board of our demographic, it's very, very high.\n\nThe net worth is very, very high. And when you combine that with the fact that over the last three years, $43 trillion of additional wealth have been created, actually I use the term resilient. I think it makes our consumer very resilient. Now moving to the second plane.\n\nWhat we are seeing is that across the marine industry, those smaller units, call it, 22-foot and under, are being impacted. Last year, as an example, for the full year calendar 2021, that 22-foot and under market was down 13.8%, whereas the rest of the industry was pretty well flat versus 2020, which we know was a humongous year. So I think our demographic is extremely strong and is carrying forward. And then it's that smaller demographic, that less expensive demographic, that is probably feeling some pain at this point in time.\n\nJaime Katz -- Morningstar -- Analyst\n\nExcellent. And then just as a follow-up. I guess given the cadence of acquisitions you've had, historically, I'm curious where you guys are seeing valuations in the boat space, whether there could be opportunities or if it seems like maybe interest is too high across the board where valuations are running a little bit heated.\n\nJack Springer -- Chief Executive Officer and Director\n\nYes. Since the first of the year, there's not been a lot of assets come to market. It's been a pretty slow time. I do believe as the economy potentially wanes, that's going to pick up some.\n\nI will say that what we have seen has not been necessarily assets that we would want to pursue, and they have been at higher multiples. But again, if we're entering any type of a softening phase, I think that more assets will come to market, number one. And number two, I think it will be not as frothy and people will be more realistic in their expectations.\n\nOperator\n\nOur next question comes from Gerrick Johnson with BMO.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nI have two questions, please. First, in the past, you've given us the percent of production as dealers sold and retail presold. Wayne, maybe if you could give us those numbers.\n\nWayne Wilson -- Chief Financial Officer\n\nI actually don't have those specific numbers. The amount of presales that are occurring in the saltwater segment is higher at this time. Jack, you may have some more specifics and have been the source of that in the past.\n\nJack Springer -- Chief Executive Officer and Director\n\nNo, not in terms of presales. I would say it's still, in the saltwater, remains in that 80% to 90% range at a minimum. We're just not creating any channel inventory. Whereas, we talk in terms of historical trends and it's normally in that 50% level for the freshwater market.\n\nIt's still elevated a little bit, but it's coming back more toward normal, maybe 60% or so, but that's just really a guess on my part, Gerrick.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nOK. Great. And perhaps you could give us a retail demand expectation for your fiscal year.\n\nWayne Wilson -- Chief Financial Officer\n\nYes. So we haven't necessarily given forecast of the specific number. We obviously, Gerrick, are modeling that out and looking at different scenarios, especially in the environment that we're in today where there's a channel inventory opportunity. What I would tell you is that that the primary model or scenario we used to come to our forecast was a down high single-digit percentage for our fiscal year and a modest amount of channel inventory.\n\nOperator\n\nThe next question comes from Joseph Altobello with Raymond James.\n\nJoe Altobello -- Raymond James -- Analyst\n\nDo you hear me OK?\n\nJack Springer -- Chief Executive Officer and Director\n\nYes, Joe. Good to have you.\n\nJoe Altobello -- Raymond James -- Analyst\n\nFirst question, just a couple of questions on the guidance. First, EBITDA margin you expect to be down this year, it's definitely up in the first quarter. Help us understand some of the puts and takes there and maybe why that would get worse over time.\n\nWayne Wilson -- Chief Financial Officer\n\nYes. So look, the EBITDA margin down -- I'll talk specifically about just the down slightly guide. The reality is our plan calls for increased mix in in saltwater and businesses that are a little less mature than Malibu. And so on a mix adjusted basis or a mix neutral basis, we're actually seeing margin expansion, and so that's kind of the aggregate view what's going on, on margin for the year.\n\nIn terms of the cadence, if you look at the timing of when that mix change is impacting the P&L, it's more in the second half of the year. And so you're seeing better performance in the first half. There's actually more of a -- less of an impact of that mix in that first quarter. And that's what we're trying to let you all know is going to happen as opposed to surprising you later on.\n\nJoe Altobello -- Raymond James -- Analyst\n\nOK. That's helpful. And just as a follow-up, you got mid to high singles. Can you just break that down between units and pricing? And I ask that only because if I look at your website, it says no price increase on model year '23.\n\nSo maybe if you could break that number down for us and maybe you're thinking on why no price increases.\n\nWayne Wilson -- Chief Financial Officer\n\nYes. We haven't been giving a big breakout in terms of the volume versus ASP. You're going to see a number that -- it's going to be split pretty evenly between volume and ASP.\n\nJack Springer -- Chief Executive Officer and Director\n\nGo ahead, Joe.\n\nJoe Altobello -- Raymond James -- Analyst\n\nNo, because the ASP increase is going to be all mix and just take it sounds like, mostly.\n\nWayne Wilson -- Chief Financial Officer\n\nWell -- so keep in mind, Joe, that what you're comparing something that's, hey, this is what's happening with prices between a date certain and another date. There are embedded as prices have risen throughout the fiscal year '22, there is -- we took into account there is absolutely a natural uplift that's going to be happening relative to that. So if you go back to the midyear and how we modified prices. And so not all boats in the year were at the price that we ended the year at, and so there is a modest uplift that's associated with that.\n\nActually, we would -- we think we would see a little bit higher uplift on ASP, but for some of the mix that we've talked about.\n\nJoe Altobello -- Raymond James -- Analyst\n\nOK.\n\nJack Springer -- Chief Executive Officer and Director\n\nThe only thing I'll point out, Joe, a couple of things -- and you cut out a little bit. But a couple of things I do want to point out is you're looking at the website relating to Malibu, so that is specific to the Malibu and Axis products and not necessarily for the other brands. The thing is that is the beginning of the year from a price increase standpoint, so that does not say we want to do that, we think that gives us a competitive advantage. But that doesn't say we will not reevaluate that at the beginning of the calendar year.\n\nOperator\n\nOur next question comes from Brett Andress with KeyBanc.\n\nBrett Andress -- KeyBanc Capital Markets -- Analyst\n\nYes, just a follow-up. Is there any way -- I think, Jack, you mentioned this earlier, to frame up how much price your competitors have taken since, I guess, COVID and how much you've taken? I'm just trying to frame up what you think that gap is right now going into model year '23.\n\nJack Springer -- Chief Executive Officer and Director\n\nIt's a little bit more unclear when you get to companies that are not public. But generally, we believe that we are at the -- I'll put it in a framework that we're at the lower end of the spectrum, regardless of whether it's public or private. We are aware of some public companies, as an example, that 12.9% price increase came out. So a pretty staggering price increase on top of all the COVID price increases that occurred.\n\nSo we're really confident that regardless of what brand we're dealing with, what segment with, we're at the lower end of the spectrum the price increases.\n\nOperator\n\nI'm not showing any further questions at this time. I would now like to turn the call back to Jack Springer for any further remarks.\n\nJack Springer -- Chief Executive Officer and Director\n\nThank you very much. In summary, we had a massive quarter and a massive year that we're very proud of. Malibu Boats continued this domestic run, delivering another great quarter and outstanding year. Our dealer backlog remains exceptionally strong, supported by the unprecedented consumer appetite for larger feature-rich boats, and it will drive ASP growth across the board.\n\nWe are capitalizing on the strong demand environment and taking advantage of the attractive trends that have materialized over the past few years. We are the boating leaders, offering the finest, most modern products in the marine industry. From Malibu and Axis, to Cobalt to Pursuit the Maverick brands, we are in a unique and favorable position with our suite of premium brands and boats, our model year 2023 lineup is sure to make waves among consumers. Our recent acquisition of Malibu Electronics has already proven to be a critical differentiator, enabling us to increase volumes at Malibu and Cobalt, all the while generating a significant return on investment.\n\nWe managed price increases masterfully in fiscal year 2022, and we have continued to cover inflationary cost to this today. This will provide increased competitive advantage and further stretch our industry dominance. Lastly, channel inventory remains at historic lows, providing an incredible opportunity for the continued success for the next two to three years as the supply chain normalizes. As always, I would like to thank you for your unrelenting support, and I look forward to our continued victories together as we strive to make fiscal year 2023 the best year yet for Malibu.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nWayne Wilson -- Chief Financial Officer\n\nJack Springer -- Chief Executive Officer and Director\n\nBrett Andress -- KeyBanc Capital Markets -- Analyst\n\nJaime Katz -- Morningstar -- Analyst\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nJoe Altobello -- Raymond James -- Analyst\n\nMore MBUU analysis\n\nAll earnings call transcripts"
}