{
  "companyName": "Illinois Tool Works",
  "companyTicker": "ITW",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/illinois-tool-works-itw-q3-2022-earnings-call-tran/",
  "content": "Illinois Tool Works (ITW -0.75%)\nQ3 2022 Earnings Call\nOct 25, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning. My name is Rob, and I will be your conference operator today. At this time, I would like to welcome everyone to the ITW third quarter earnings conference call. [Operator instructions] Thank you.\n\nKaren Fletcher, vice president of investor relations, you may begin your conference.\n\nKaren Fletcher -- Vice President, Investor Relations\n\nOK. Thank you, Rob. Good morning, and welcome to ITW's third quarter 2022 conference call. I'm joined by our chairman and CEO, Scott Santi; and senior vice president and CFO, Michael Larsen.\n\nDuring today's call, we will discuss ITW's third quarter financial results and our updated guidance for full year 2022. Slide 2 is a reminder that this presentation contains forward-looking statements. We refer you to the company's 2021 Form 10-K and subsequent reports filed with the SEC for more detail about important risks that could cause actual results to differ materially from our expectations. This presentation uses certain non-GAAP measures, and a reconciliation of those measures to the most directly comparable GAAP measures is contained in the press release.\n\nPlease turn to Slide 3, and it's now my pleasure to turn the call over to our chairman and CEO, Scott Santi.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nThanks, Karen, and good morning, everyone. In what remains a very dynamic and challenging operating environment, we were pleased with our Q3 performance. On the top line, we delivered 13% revenue growth with 16% organic growth from our base businesses. While we did see some softening in channel inventory reduction actions in our businesses serving the construction, auto aftermarket, commercial welding and appliance markets, five of our seven segments delivered double-digit organic growth, led by automotive OEM up 25% and food equipment up 23%.\n\nWith regard to margins, we were glad to see our incremental margins in Q3 return to our normal 30%-plus level for the first time in five quarters as the impact of volume growth, enterprise initiatives, pricing actions and some moderation in the pace of input cost inflation drove incremental margin of 39% and a 130-basis-point improvement in operating margin in our base businesses. We've lost roughly 250 basis points of margin due to price cost during this period of rapid inflation, which we fully expect to recover over time once the current inflationary environment stabilizes. And it was certainly good to see a nice solid first step in that direction in Q3. On the bottom line, strong growth and margin performance resulted in GAAP EPS of $2.35, up 16% versus Q3 of last year.\n\nAnd that 16% growth includes $0.13 of negative impact from currency. Excluding currency, earnings per share were up 23%. Looking at our current performance, our decision to stay invested in our long-term strategy and in our people during the pandemic and the quality of our team's execution of our win the recovery strategy coming out of it are fueling the strong organic growth and financial performance that we are currently delivering. While the economic outlook is becoming increasingly uncertain, demand remains solid across the majority of our business portfolio.\n\nAnd as a result, the company is well positioned to deliver a strong finish to what has been a very strong year. With that, I'll now turn the call over to Michael, who will provide more detail on the quarter and our updated guidance. Michael?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nThank you, Scott, and good morning, everyone. In Q3, revenue grew 13% to $4 billion with strong organic growth of 16%. The MTS acquisition contributed 3% to revenue. Foreign currency translation was a 6% headwind compared to a 4% headwind last quarter.\n\nAnd despite $0.13 of year-over-year EPS headwind from foreign currency translation, GAAP EPS was $2.35, an increase of 16%. Excluding MTS, incremental margin in our base business was 39%, which as Scott said, was a welcome return to our normal historical incremental margin rates. As a result of our strong revenue and margin performance, operating income increased 16% to $983 million, which was an all-time quarterly record. Operating margin was 24.5% with operating leverage of almost 300 basis points and 110 basis points of enterprise initiatives.\n\nExcluding 60 basis points of margin impact from the MTS acquisition, operating margin expanded 130 basis points to 25.1%. Free cash flow was solid at $612 million, an increase of 46% versus Q2 and 12% year over year. The conversion rate of 84% is lower than our typical Q3 performance as we remain committed in the near term to intentional working capital investments to support double-digit organic growth, mitigate supply chain risk and sustain service levels to our key customers. Finally, share repurchases in Q3 were $500 million, and our effective tax rate was 24% versus 21% in the prior year.\n\nWith that, let's turn to Slide 4 and starting with organic growth by geography. We delivered growth in the mid-teens across all major geographies, led by North America, up 17%. Europe, which represents about 23% of our sales, grew 14%, led by automotive OEM, up 26%, and food equipment, up 15%. China grew 15%, led by test and measurement and electronics, up 32%, and automotive OEM was up 29%.\n\nprice cost was accretive to income in Q3 and slightly dilutive by 40 basis points to margin. As we've said before, our business teams around the world have done an exceptional job of adjusting price to offset cost increases throughout the most significant inflationary cycle in over 40 years. And should the pace of raw material cost inflation continue to moderate, we expect price cost to be accretive to income and slightly accretive to margin in Q4. As Scott mentioned, throughout this unprecedented two-year inflationary cycle, the company has absorbed as much as 250 basis points of margin dilution impact from price cost, which we expect to fully recover on the succeeding six to eight quarters after input prices stabilize.\n\nMoving on to the segments. automotive OEM delivered strong organic growth of 25%, with North America up 21% and Europe up 26%. China was up 29%, which included some sequential recovery from the lockdown impact in Q2. When looking at these year-over-year growth rates, keep in mind that the comparisons are against the Q3 last year when the chip shortage led to a low point for auto production.\n\nWe continue to make good progress on our content per vehicle growth as evidenced by our year-to-date organic growth rate of 9% compared to auto builds of 7%, in line with our long-term market outgrowth target of 2 to 3 percentage points. Consistent with our guidance all year, we do not expect a meaningful improvement in the chip shortage situation impacting automotive production until next year. And we continue to take a more conservative approach to our guidance, which assumes that automotive production essentially remains around current levels through the balance of this year. And as we've said before, as supply chain issues eventually get resolved down the road, we remain confident that the automotive OEM segment is well positioned to be a very meaningful contributor to the overall organic growth rate of the enterprise for an extended period of time.\n\nAnd as that plays out, we also expect that the automotive OEM segment returns to its typical historical operating margin rates in the low to mid-20s. Turning to Slide 5. food equipment delivered strong organic growth of 23% as North America grew 30% with double-digit growth in every major category and end market. Growth in institutional markets was 50%-plus with strength across several categories, most notably lodging.\n\nRestaurants were up around 40% and retail growth was in the mid-teens. International revenue grew 14% with Europe up 15% and Asia Pacific up 9%. Test and measurement and electronics revenue grew 29% with organic growth of 17% as test and measurement grew 20% and electronics was up 14%. Growth was broad-based with continued strength in semiconductor and capex spending as evidenced by organic growth of 13% in the Instron business.\n\nMoving on to Slide 6. Welding grew 14% organically with equipment up 13% and consumables up 15%. Industrial was the standout with organic growth of 32%. The commercial side of the welding business, which sells to smaller businesses and individual users, was down 10% due to lower demand and inventory de-stocking in the channel.\n\nHowever, due to the strength on the industrial side, North America still grew 14% and international grew 12%. Sales to oil and gas customers were up 12% in the quarter. Operating margin improved 150 basis points to 31.5%, which was a new record for the welding segment. Polymers and fluids grew 8% organically with polymers up 21% on continued strength in industrial applications.\n\nSoftening demand due to higher gas prices and the impact on consumer discretionary spend impacted the automotive aftermarket business, which was up 2%. Fluids was up 5% and overall North America grew 5%, international was up 14%. construction delivered organic growth of 17% with continued strength in North America, which was up 35%. U.S.\n\nresidential grew 42% and commercial was up 17%. That said, we did see some signs of slowing toward the end of the quarter, and we expect that to continue in Q4, which we have reflected in our updated guidance. The international side of construction is slowing with Europe down 1%. Australia and New Zealand was up 7% against an easy comparison.\n\nSpecialty growth was essentially flat as product line simplification activities resulted in the elimination of a product line in one of our consumer packaging businesses. Excluding PLS, the segment would have been up 3%. Demand in our appliance components division slowed, which we have reflected in our updated guidance. On a geographic basis, North America was down 2% and international grew 4%.\n\nLooking at the start of Slide 8 for an update on the year and starting with the top line, we're raising our full year organic growth guidance to 11% to 12% due to the strength of our Q3 organic growth performance and projecting current levels of demand, which remains strong across most of our businesses. But we are also anticipating further slowing in the end markets we talked about, including global residential construction, automotive aftermarket, commercial welding and appliance components, that combined, represent about 20% of total company revenue. The MTS acquisition is expected to add 3% to revenue. And at current exchange rates, currency translation will reduce revenue by 5%, resulting in total revenue for the year up 9% to 10%.\n\nFor Q4, we're well positioned to deliver a strong finish to a very strong year with organic growth of approximately 10% and GAAP EPS growth of about 40%. In Q4 and consistent with our previously announced plan to divest certain business units, we completed the sale of a division within the polymers and fluids segment, with an estimated after-tax gain of $0.45 per share. We have included this Q4 gain in our updated full year guidance. And per our usual process, we have narrowed the range for the year with one quarter to go and updated our guidance to reflect current foreign exchange rates, which results in additional foreign currency headwind versus our prior guidance.\n\nSo as a result of including the gain on sale and updating guidance with current foreign exchange rates, our updated full year GAAP EPS guidance range is $9.45 to $9.55. We're projecting operating margin of approximately 24% for the full year, which includes approximately 100 basis points contribution from enterprise initiatives, about 200 basis points contribution from volume leverage and estimated 100 basis points of negative margin impact from price cost and about 50 basis points of margin dilution from the acquisition of MTS. We expect free cash flow conversion of approximately 80%, which, as we've talked about, is below our typical 100%-plus conversion rate due to the intentional near-term working capital investments that support the company's double-digit revenue growth, mitigate supply chain risk and sustain customer service levels. And finally, share repurchases are now expected to be $1.75 billion for the full year, an increase of $250 million versus prior guidance.\n\nLooking forward, we're obviously not immune to the macro challenges and uncertainties that may lie ahead. But through the execution of our enterprise strategy, we've positioned this company to deliver top-tier results in any environment, as reflected in our differentiated performance at the depth of the pandemic and in the very dynamic and challenging conditions that have characterized the recovery over the last two years. We remain confident that the combination of the powerful competitive advantages we derive from ITW's proprietary business model, our high-quality business portfolio and our team's proven ability to consistently execute at a very high level have us well prepared to continue to outperform in whatever economic conditions emerge in 2023 and beyond. With that, Karen, I'll turn it back to you.\n\nKaren Fletcher -- Vice President, Investor Relations\n\nOK. Thanks, Michael. Rob, let's open up the lines for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Scott Davis from Melius Research. Your line is open.\n\nScott Davis -- Melius Research -- Analyst\n\nHey. Good morning, Scott, Michael and Karen.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nGood morning.\n\nScott Davis -- Melius Research -- Analyst\n\nI'm not very good at math, but just thinking through this with your guidance on the full year on price cost, I think it implies that you're actually going to be in meaningful positive territory on price cost in Q4. Is that -- am I reading that right?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nThat is correct. So we are going -- we're expecting that if inflation stays where it is, and so based on the known increases and decreases and based on the price that we expect to realize in the fourth quarter, that price cost will be accretive on an EPS basis and also, for the first time in a while, accretive on a margin basis as well.\n\nScott Davis -- Melius Research -- Analyst\n\nOK, that's super helpful. And how do you -- I mean, it seems like we're walking into a construction recession. But how do you guys -- I mean, are you planning -- how do you plan for that, given 80/20 and just the business model that you have? It's not like you're going to go do a bunch of restructuring. But how do you get ahead of that so that you can limit the impact of it?\n\nScott Santi -- Chairman and Chief Executive Officer\n\nWell, we've talked about this before, but one of the fundamental elements of 80/20 is that we are -- that we have a very flexible cost structure. So we are -- we do a lot of outsourcing upstream. We want to assemble. We want to control the manufacturing elements that really matter from the standpoint of control of quality-controlled delivery.\n\nBut we don't necessarily have to bend all the metal. We don't have to necessarily do all the upstream work. And so what that gets us fundamentally, in fact, we prefer not to, and what ultimately that gives us is a relatively flexible cost structure. So we are a read-and-react company.\n\nOur businesses are going to respond to whatever the demand is that sits right in front of them. We've talked about that before. We don't do a lot of forward forecasting. We are producing today what our customers bought yesterday.\n\nAnd as demand rates start to decline in places like construction, then those adjustments will take place real time.\n\nScott Davis -- Melius Research -- Analyst\n\nOK, that's a helpful reminder. Thank you, guys. I appreciate it and good luck.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Tami Zakaria from J.P. Morgan. Your line is open.\n\nTami Zakaria -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning, how are you? \n\nScott Santi -- Chairman and Chief Executive Officer\n\nGood. Good morning.\n\nTami Zakaria -- JPMorgan Chase and Company -- Analyst\n\nSo I have two quick ones. The first one is, can you comment on which end markets you're anticipating further slowdown? Meaning the 10% implied fourth quarter organic growth, are you currently run-rating above that but you're anticipating further slowdown and hence, you're guiding to about 10%?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYeah, that's correct. So this is not our typical run rate. This has been adjusted with some anticipated further slowing in the end markets that we talked about.\n\nTami Zakaria -- JPMorgan Chase and Company -- Analyst\n\nAre you able to share like what the current run rate is?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nIt is higher than the 10%.\n\nTami Zakaria -- JPMorgan Chase and Company -- Analyst\n\nGot it. Got it. OK, that's helpful. And then the second one, can you comment on the price versus volume you saw in the third quarter? Because the last time you raised organic growth guidance earlier this year, I think you had mentioned that you saw some volume pickup.\n\nDid that sustain? Like what's the expectation for price versus volume in the fourth quarter?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYeah. So as you know, Tami, we don't report price and volume separately. But what I think we can tell you is that we are seeing, in Q3, we saw meaningful volume growth across the company, including particularly in -- if you look at the strength in auto, food equipment, test and measurement, you're not going to put out numbers like that without a meaningful contribution from volume.\n\nTami Zakaria -- JPMorgan Chase and Company -- Analyst\n\nGot it. And you expect volume to sort of sustain in most of these end markets in the fourth quarter as well?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYeah, I think that's the reason. Obviously, this is a very dynamic environment but there is a lot of strength in the businesses that I just talked about that more than offset some of the slowing we're seeing at about 20% of the company. So I think we're really well positioned for a strong finish here in Q4. And if you look at the implied guidance, we're looking at organic growth, like we said, double digit.\n\nWe're looking at margin improvement of more than 100 basis points, GAAP EPS growth of 40%, 15% excluding the divestiture gain that we talked about earlier. So a really strong finish to what's been a very strong year for the company.\n\nTami Zakaria -- JPMorgan Chase and Company -- Analyst\n\nOK, perfect. Thank you so much.\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nSure.\n\nOperator\n\nYour next question comes from the line of Andy Kaplowitz from Citigroup. Your line is open.\n\nAndy Kaplowitz -- Citi -- Analyst\n\nGood morning, everyone.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nHi, Andy.\n\nAndy Kaplowitz -- Citi -- Analyst\n\nScott or Mike, maybe just focusing on construction for a second. Last quarter, you mentioned some potential incremental weakness in Europe and Australia. It seems like those are hanging in there. Obviously, North American residential, up 42%, you talked about a little bit of weakening.\n\nSo is this just strong share gains for ITW that have held up these businesses within construction? I know you mentioned you saw some slowing late in the quarter. Maybe give us more color into the rate of that slowing going forward.\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nWell, I think what we've seen is primarily a slowdown on the residential side, which is about 80% of our business. And we talked about some softening on the international side here on our call last quarter. And so we did see Europe down 1%. I think that's pretty broad-based, U.K., Continental Europe at this point, given some of the challenges, that's probably what you would expect.\n\nAustralia and New Zealand is also slowing here. And as the comps get a little more difficult, you're going to see those growth rates start to come down. I think in North America, there's still a fair bit of, obviously, strength in the business. And then late in the quarter, we're really starting to see the order rates starting to come down on the residential side.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nYes, I think the only thing I would add is that it is among the most interest rate-sensitive end markets that we serve. And so you're seeing in the housing start data and a lot of other things that the rapid pace of interest rates rising is certainly starting to bite in the housing market. It's -- I'll just point to the fact that it remains a very strong, very profitable business for us, and it points to just the value of the diversified portfolio. So we're going to see some pressure in some places, but we've got plenty of other places that are more than picking up and that's really by design.\n\nThat's how we're trying to position the company ultimately to outperform in any environment.\n\nAndy Kaplowitz -- Citi -- Analyst\n\nI totally understand. And then maybe just backing up, what you're seeing across your industrial businesses, I mean, you talked a lot about the consumer businesses. Obviously, most of those businesses in the 20% are consumer facing. Have you seen any incremental weakness in your capex-type businesses? Are they generally holding up?\n\nScott Santi -- Chairman and Chief Executive Officer\n\nNot yet.\n\nAndy Kaplowitz -- Citi -- Analyst\n\nShould be enough. Thanks, guys.\n\nOperator\n\nYour next question comes from the line of Joe Ritchie from Goldman Sachs. Your line is open.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nThanks. Good morning, everyone.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nGood morning.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nSo nice to see the incremental margins ex MTS come back. Just given the comments that you're making around price cost and turning positive, if inflation kind of holds at these levels and we're closer to peak inflation, would you expect to continue to achieve the same type of incremental margins going forward?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nI think it's reasonable to assume that our incremental margins will be a little bit higher than our normal range, just given the recovery on price cost that we talked about. So assuming again, Joe, that from an inflation side that things stay where they are or continue to moderate, then that would be a reasonable expectation.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nOK. OK, great. And then you mentioned, Michael, that 23% of your business in Europe, obviously, there's a lot of concern out there as we head into the winter on rising energy costs and potential recession in the region. I know that you guys have given already some color around trend, but just maybe anything else that you can kind of tell us about that region and then specifically from a cost perspective, how that impacts your business?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nWell, I mean, I think there's certainly a reason to be a little bit more concerned about Europe, just if you look at the macro picture. I think the fact is our businesses are performing at a really high level right now. And so if you just look at Q3, I'll just go back to a little bit of commentary on Europe specifically. We had six segments growing between 9% and 26%, and so double-digit growth in five of the seven segments and only construction was down 1%.\n\nAnd it's not all Auto. If you take out Auto, Europe still grew 10%. I think obviously, we expect those growth rates to moderate here in the fourth quarter. But I think we're really well positioned in Europe to deal with, just like the rest of the company, deal with whatever that's ahead.\n\nAnd if we have a little bit more softness maybe in Europe, maybe we have a little more strength in other parts of the world, and that's kind of how the company is set up, as Scott said. So we'll read and react. We'll deal with whatever is ahead of us, but we're confident that we'll continue to outperform on a relative basis.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nYour next question comes from the line of Jamie Cook from Credit Suisse. Your line is open.\n\nJamie Cook -- Credit Suisse -- Analyst\n\nHi. Good morning, and congrats on a nice quarter. I guess my first question, I know on the top line, you addressed the trends that you were seeing in construction. I was surprised a little bit on the margin in the quarter.\n\nSo if you could first provide a little color around that, that would be helpful. And then...\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYeah, yeah, Jamie, it's all price cost in construction so a little bit more headwind here than in some of the other parts of the company. And so I will still say that 25.7% operating margin in construction is not too shabby at this point. So -- but still, you're right. Relative to prior year, we're down due to the price cost dynamic.\n\nJamie Cook -- Credit Suisse -- Analyst\n\nOK. And then I know you didn't want to answer in terms of as we're thinking about the organic growth, which surprised on the upside. I know you don't want to answer what you're seeing in terms of price versus volume, but is there any update you can provide on which segments you're seeing the most success in terms of gaining market share and how sustainable you think this market share is going forward?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nWell, I think from the beginning in terms of the -- so one, we're confident that we are gaining market share across the portfolio and the kind of -- the guidance was only strategic long-term market share gains and not opportunistic kind of onetime orders from new customers. So we've really focused on serving our 80 customers, as we call them, our best customers better than anybody else. And because of our win the recovery positioning, we are doing that and as a result of that gaining market share. I mean, it's hard to -- we have 83 divisions so it's hard to point to specific areas.\n\nBut if you just look at our overall at the enterprise level, organic growth of 16% in the third quarter, I think relative to other industrial companies, that will probably compare pretty well.\n\nJamie Cook -- Credit Suisse -- Analyst\n\nOK, thank you.\n\nOperator\n\nYour next question comes from the line of Joe O'Dea from Wells Fargo. Your line is open.\n\nJoe O'Dea -- Wells Fargo Securities -- Analyst\n\nHi. Good morning. \n\nScott Santi -- Chairman and Chief Executive Officer\n\nGood morning.\n\nJoe O'Dea -- Wells Fargo Securities -- Analyst\n\nCan you talk about the raw materials and sourced components waiting within COGS? And then sort of what you anticipate in terms of the timing of seeing each of those start to sort of flow through with maybe a more favorable situation in the P&L?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYeah, so if I understand your question, so we're currently running at about three months on hand. We're typically running at two months on hand in terms of inventory. And as supply conditions here begin to normalize and we're going to see a return to normal levels in that two months on hand. When exactly that happens is difficult to predict, but we are starting to see some signs that supply chain is improving.\n\nSo I think it's reasonable to assume that once conditions normalize, that it will take us about six to eight quarters to get back to two months on hand. And obviously, just like our conversion rate is below our historical typical levels at this point, they're going to be above for that period of time as we benefit from significant working capital release. When exactly that plays out is difficult to say. It's not all going to come back in one quarter.\n\nI mean, we've built this up over two years. It's going to take some time to get it back out again. But we're confident we've added the right level of inventory, and it's really put us in a great position to serve our customers, mitigate supply chain risk and, like we said, take market share.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nI think just -- I think the question was more in terms of our cost of goods, what percentage of those are material costs. Correct me if I'm wrong.\n\nJoe O'Dea -- Wells Fargo Securities -- Analyst\n\nYeah, and just kind of -- yeah, so all of that was helpful. And I guess related to this is just with raw mats coming, right, will raw mats flow through? With the components that you source, will you get cost down on that or do you think that's a trickier dynamic?\n\nScott Santi -- Chairman and Chief Executive Officer\n\nWell, there's a lot of factors that go into the last part of your question. I think the simple answer on your first one is that the percentage of material as the -- material cost percentage as an overall versus the overall COGS is going to vary. But let's just say, roughly 60%, 65%, 35%, freight, labor, other elements of the cost structure if that helps.\n\nJoe O'Dea -- Wells Fargo Securities -- Analyst\n\nYup, OK. And then I wanted to ask one about the fourth quarter margin, excluding the divestiture. I'm getting something like a 50-basis-point sequential decline from 3Q to 4Q. If that's accurate, can you just help with the bridge? I assume there's a little bit of sort of sequential decremental on lower revenue, but then price cost should be more favorable.\n\nJust any other items to kind of consider in that bridge?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYes. I think if you look at it historically, we typically -- Q3 is our highest quarter and we go down in Q4. The primary driver is that there is just less shipping days in the fourth quarter. So I think this year, there are 61 shipping days in Q4.\n\nThere were 64 in the third quarter and so that's really the main driver here. On EPS, obviously implied, it's slightly lower than what we just did in Q3. And the delta there is the foreign exchange piece.\n\nJoe O'Dea -- Wells Fargo Securities -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nYour next question comes from the line of Steven Fisher from UBS. Your line is open.\n\nSteven Fisher -- UBS -- Analyst\n\nThanks. Good morning. Just wanted to clarify on the construction side of things, you mentioned the slowing in Q4 on the U.S. residential piece.\n\nBut I didn't hear any follow-up comments on the commercial piece. Is that expected to slow too?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nWell, usually, residential is kind of the leading indicator so we just haven't seen it yet.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nOn the commercial side?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYeah.\n\nSteven Fisher -- UBS -- Analyst\n\nOK. So maybe that would be something more like a 2023. I guess related to that, have you done any analysis to kind of look at the various stimulus programs that have been put in place and kind of to assess how that might end up flowing through your businesses?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nNo, we haven't really. If you have any great ideas, send them over. But we are a short-cycle company. We read and react to what's in front of us.\n\nAnd trying to predict what the government is going to do, I think, has not really been a winning equation for us anyway. It may work well for others but not in our case.\n\nSteven Fisher -- UBS -- Analyst\n\nOK. And then just one clarification maybe on the last question about the margin in Q4. I guess, are there any particular segments that you anticipate margins actually improving in the fourth quarter or any that stand out kind of one direction or the other?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nI think the fourth quarter looks a lot like the third quarter, except the organic growth rates are coming down. And so from a margin standpoint, it's pretty close to the third quarter.\n\nSteven Fisher -- UBS -- Analyst\n\nOK, thank you very much.\n\nOperator\n\nYour next question comes from the line of Stephen Volkmann from Jefferies. Your line is open.\n\nSteve Volkmann -- Jefferies -- Analyst\n\nGood morning. Sorry, maybe beating a bit of a dead horse here, but I just wanted to make sure I get this right because it feels like there's a lot of declining prices in various inputs from commodities to transportation, even energy. Are you seeing any of your input costs actually declining yet?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYes, we are. I mean, we saw a meaningful decline here in Q3 from Q2, and we expect to see the same thing in Q4.\n\nSteve Volkmann -- Jefferies -- Analyst\n\nOK, that makes sense. Thank you. And then just curious, can you update us on where you are with the various divestitures? Is there -- should we be expecting more here? Are you kind of ramping that back up or is it just kind of whenever it happens?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nI think there is maybe one more potentially here in the near term. And then we'll have to assess the remainder and whether now is a good time to move forward with those. But I think our views haven't changed in terms of the portfolio and the raw material that we need in order to continue to deliver the type of results that we're delivering. And so we have about a handful of businesses that we had flagged for potential divestiture.\n\nWe just completed one. Maybe one more to go and then the balance, we'll kind of reassess in the new year.\n\nSteve Volkmann -- Jefferies -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nYour next question comes from the line of Julian Mitchell from Barclays. Your line is open.\n\nJulian Mitchell -- Barclays -- Analyst\n\nThanks very much, and good morning. Maybe one element I just wanted to dial into again was around sort of inventories and the cash flow outlook. So the conversion only around, I think, 80% now this year, which is obviously somewhere below your very high standards. I think, Michael, you were quite guarded as to the pace of when that cash flow conversion comes back up.\n\nSo maybe help us understand how you see inventories at the customer level, the pace of your own inventory liquidation and how you're thinking about capital spending within the cash flow.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nYeah, I'll maybe start on the first part with regard to inventory, and that is that we haven't seen enough stability yet on the supply chain side to make us comfortable that we can start backing off. So our first priority is to preserve our ability to serve our customers. And so at this point, we are still in the mode of keeping the inventories where they are. As we start to see things become more, let's call it, reliable and consistent there, then we'll certainly start making a move.\n\nBut as of right now, we have -- we are not in the mood of -- or in the mode of starting to reduce inventories.\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYeah, so it's not a matter of whether or not we're going to benefit from working capital coming back down to normal levels. That we are sure of, we just don't know when. And in the near term, we're absolutely committed to what Scott talked about, which is intentional working capital, including inventory to support double-digit growth and significant market share gains. So we'll update you if and when that changes.\n\nAnd then we'll let you know what we think exactly the -- how it might play out from a free cash flow standpoint.\n\nScott Santi -- Chairman and Chief Executive Officer\n\nAnd there was a question on capex.\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nWell, capex, I mean, I think we've always funded every good project inside of the company, including during the pandemic, and I think that's going to continue. We're really fortunate that we are not a capital-intensive business, not -- we're a pretty asset-light business model, as Scott described earlier. And so at maybe less than 2% of sales, capex doesn't suck up a significant amount of our total cash flow. So we're very comfortable with continuing to invest in the business as we have done for many years, including throughout the pandemic.\n\nJulian Mitchell -- Barclays -- Analyst\n\nThank you. And then just my follow-up would be on the demand outlook in test and measurement and electronics. Very good growth there in Q3. There's obviously a lot of noise at different customers on electronics in particular within that division, but you're still putting up mid-teens organic growth.\n\nSo maybe sort of help us understand some of the exposures in that piece. And do you think strong growth is sustainable, again, given what's going on in terms of a lot of customers in consumer electronics, semicon equipment, semiconductor devices, how you're managing to grow at this rate?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nWell, yeah, so we think that the growth is sustainable. We've not seen anything to suggest that it's slowing down. We're obviously a big beneficiary from all the growth on the semi side of things. But also on the capex side with our Instron business, which I think you're familiar with, we're seeing double-digit growth.\n\nOn the -- everybody's electronics business, I think, is a little bit different. I think when I just look at the businesses in there, including electronic assembly, contamination control, the pressure-sensitive adhesives, we're still showing really solid double-digit growth. North America up 18%, international up 16%. So there's still some supply chain issues, but I think the team is doing a great job staying on top of those and gaining share.\n\nAnd so we feel very good about the outlook for the test and measurement and electronics business.\n\nJulian Mitchell -- Barclays -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nYour next question comes from the line of Mig Dobre from Baird. Your line is open.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nYeah. Thank you. Good morning, everyone. Michael, just wanted to go back to make sure I have this correct.\n\nThe implied fourth quarter guidance, you said it was going to be down sequentially relative to Q3. Can you be a little more specific as to what the midpoint implies? And then I'm kind of curious, as we're thinking about the year-over-year bridge relative to '21, I mean, last year in the fourth quarter, we had a 200-basis-point hit from price cost. This year, it seems like we're going to be soundly positive. So I'm sort of curious how we bridge that, and then think about the incremental volume and also whatever is going on in terms of your internal initiatives that are flowing through.\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYeah. I don't know, Mig, that I can tell you something I didn't say already. I think if you take our full year guidance and the fourth quarter kind of implied, as we said, organic growth of about 10%, solid incrementals in our normal range, maybe a little bit higher than that. Operating margins improved more than 100 basis points on a year-over-year basis.\n\nWe would expect another 100 basis points from enterprise initiatives. Price cost goes from negative to slightly positive from a margin standpoint and also positive accretive to income, as I said. So those are kind of the high-level view on the fourth quarter. And again, we're not -- we've adjusted our run rates on the top line, which is a little bit different than in prior years.\n\nWe are just wanting to be a little conservative, hopefully, and account for some of the softness we're seeing in about 20% of the company but also incorporate a lot of strength in the businesses that we talked about, including Auto, food equipment, test and measurement, welding. And so that's maybe -- those are kind of the key elements of the fourth quarter.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nNo, I appreciate that. I ask because I'm also not very good at math. As I'm kind of looking at your guidance here, to me, it looks like you've raised your revenue by, call it, $300 million. You've reduced your operating income margin by 50 bps.\n\nNet-net, that's more or less neutral to operating income, yet EPS came down $0.15 on a core basis. So I'm trying to understand if there's something below the line that's going on here that we don't have full appreciation for.\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nI think I said this earlier, Mig. The reason why we're taking the EPS number down is incremental foreign currency headwind by incorporating current foreign exchange rates like we always do. So that's what's accounting for the EPS adjustment.\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nAll right. Well, I'll leave it there. Thank you.\n\nOperator\n\nAnd your final question comes from the line of David Raso from Evercore ISI. Your line is open.\n\nDavid Raso -- Evercore ISI -- Analyst\n\nHi. You mentioned earlier your capital spending businesses are not yet seeing a slowdown. I assume we're getting close enough to where you've had some conversations with those customers about their '23 planning. Are you getting capital budgets for '23 that are also very supportive of solid growth? Or is that very much a 90-day type comment, even though you would think capital-intensive businesses must give you better visibility than a quarter at a time?\n\nScott Santi -- Chairman and Chief Executive Officer\n\nYeah. I was just going to say, David, we don't -- it's a little early in the planning cycle for us in terms of '23, number one. Number two, I would say, given our sort of traditional delivery and lead times, which are relatively short, we don't get a lot of forward visibility even in our capex businesses. So regardless of what anybody has to say in terms of their outlook for the year, that's going to certainly be a number that's going to move around.\n\nAnd our sort of core operating MO is that we're going to produce what -- based on what orders we're getting today, we're not going to sort of buy down our forecast no matter how optimistic or pessimistic, and we have the flexibility in our systems to do that. So I don't have a lot of forward -- we don't -- coming back to our businesses and our customers, we don't have a lot of input in terms of strong points of view one way or the other at this point.\n\nDavid Raso -- Evercore ISI -- Analyst\n\nI appreciate that. And quick follow-up on the M&A environment, the divestiture, obviously, a nice gain there. Can you just give us an update on how you're looking at further divestitures and M&A versus obviously bumped up the share repo?\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nYeah. So I think I said earlier, we have one more potential divestiture that we're working through. And then we have three that are kind of in the pipeline that we're going to spend a little bit more time on next year and determine whether now is the best time to sell those businesses. They're all performing at a high level, significantly better than obviously pre-enterprise strategy.\n\nAnd so it's just a matter of timing on those divestitures. On the other side of this, we talked about the M&A pipeline on most of these calls. I mean, nothing has really changed. I mean, I think to the extent we find acquisitions that are a good fit for us strategically, which really means that they can grow at 4% to 5% organically over a sustained period of time, we have significant margin improvement through the implementation of the business model.\n\nAnd we can -- and their valuation is reasonable in the sense that we can generate a rate of return that makes sense for the company, then just like we did with MTS, when those opportunities come along, we're definitely going to lean in. And I think we've called our posture kind of aggressively opportunistic. So when those come along, we don't have a lot of those, but when we do see them, we're definitely going to lean in hard just like we did with MTS. And there's nothing in the pipeline here in the near term is what I can offer.\n\nSo.\n\nDavid Raso -- Evercore ISI -- Analyst\n\nThat's helpful. Thank you very much.\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nAll right. Thanks, David.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKaren Fletcher -- Vice President, Investor Relations\n\nScott Santi -- Chairman and Chief Executive Officer\n\nMichael Larsen -- Senior Vice President and Chief Financial Officer\n\nScott Davis -- Melius Research -- Analyst\n\nTami Zakaria -- JPMorgan Chase and Company -- Analyst\n\nAndy Kaplowitz -- Citi -- Analyst\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nJamie Cook -- Credit Suisse -- Analyst\n\nJoe O'Dea -- Wells Fargo Securities -- Analyst\n\nSteven Fisher -- UBS -- Analyst\n\nSteve Volkmann -- Jefferies -- Analyst\n\nJulian Mitchell -- Barclays -- Analyst\n\nMig Dobre -- Robert W. Baird and Company -- Analyst\n\nDavid Raso -- Evercore ISI -- Analyst\n\nMore ITW analysis\n\nAll earnings call transcripts"
}