{
  "companyName": "EPAM Systems",
  "companyTicker": "EPAM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/epam-systems-epam-q3-2022-earnings-call-transcript/",
  "content": "EPAM Systems (EPAM -0.91%)\nQ3 2022 Earnings Call\nNov 03, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the EPAM Systems third quarter 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, David Straube, head of investor relations.\n\nPlease go ahead.\n\nDavid Straube -- Head of Investor Relations\n\nThank you, operator, and good morning, everyone. By now, you should have received your copy of the earnings release for the company's third quarter 2022 results. If you have not, a copy is available on epam.com in the investors section. With me on today's call are Arkadiy Dobkin, CEO and president; and Jason Peterson, chief financial officer.\n\nI'd like to remind those listening that some of the comments made on today's call may contain forward-looking statements. These statements are subject to risks and uncertainties as described in the company's earnings release and SEC filings. Additionally, all references to reported results that are non-GAAP measures have been reconciled to the comparable GAAP measures and are available in our quarterly earnings materials located in the Investors section of our website. And now I'd like to turn the call over to Ark.\n\nArk Dobkin -- President and Chief Executive Officer\n\nThank you, David. Good morning, everyone. Thank you for joining us this morning. Let me begin today with a simple statement that we are very proud of everything EPAM achieved over our nearly three decades and that we are very thankful to the people of EPAMers for their tremendous contribution over those years.\n\nAnd I would like also to add one more thought, which feels very important to bring to the top of our conversation. While we all know that the war in Ukraine is still dominating global headlines and we are seeing this ripple effect across many sectors and geographies, for us at EPAM and many people around us, this war continues to be a very central part of our lives, deeply personal and a constant priority. With that, I would like to start with an update on our progress across our four-phase approach, which we shared with you six months ago back in May, as well as an update on some adjustments we are making as a result of newly available information. Our first phase, the safety of our employees and stabilization of our operations in Ukraine.\n\nThe work has been ongoing for eight months already. Last time we met, we indicated that we thought that it was going to be longer than anybody was thinking when it began. And we all understand the situation continues to be very serious, and also the safety is a very relative term for people within Ukraine border today. With all of that, we are constantly and proactively helping our employees, their families and the people of Ukraine as much as we can by providing the right range of support, including regional allocations and all forms of local assistance, making it possible for our people, their families and often industry colleagues to continue to live and work in Ukraine.\n\nWe are also continually developing ways to address new and unpredictable just-yesterday challenges and we are trying to also think proactively about what we can do today to make it easier and safer for tomorrow. And with all of that, we are working together across our own locations to maintain the highest level of service possible for our customers across all of our delivery locations within Ukraine. Even with the recent level of infrastructure instability, the productivity of our teams in country remains high, which make us believe that we can count on this level of resilience in our delivery operations when we are sharing our guidance with the market today. Thank you to our Ukrainian team and all EPAMers for making this possible.\n\nIt's simply just incredible. Thank you. Moving to our second phase, the acceleration of our global diversification efforts and continued growth of our diverse capabilities. Over the last eight months, we have accelerated key parts of our global strategy, in many ways a completion what we had planned to do over several years.\n\nOur delivery location geographies become more and more balanced. Last quarter, we reported that impacted regions accounted for 40% of our talent, while today, this practically related from Russia. Approximately 30% of our talent remains in the immediate regions. Something we plan to achieve closer to the end of this year.\n\nSo our presence in Europe outside of those regions, in Central and Western Asia, India and Latin America are growing proportional. In short, the adaptation of our business as a position of our delivery organization is moving forward at unprecedented pace. We are very thankful to the many thousands of EPAMers and their immediate families for their loyalty, trust and their decision to move to new country locations while staying resilient and continue to work at EPAM. While it has been accomplished undertaken, we are encouraging by our overall levels of engagement and productivity we have seen in our many new hubs and satellite locations.\n\nMany of those employees bring in years of experience, skills and knowledge with them and are key to our global expansion efforts. And we further see, integrate and scale a globally resident workforce, now operating in more than 50 countries. Please note that during the time, we practically doubled the number of locations, which should enable us to establish additional lives, for us means over 5,000 people, talent hubs during the next few years. And some of those hubs didn't even exist at EPAM in February of 2022.\n\nAs you can see, we are passionate about creating technology hubs and expanding our investment in many of the geographies. As a result, our global delivery platform and new ways of working should position us to become one of the most geographically balanced and value-added services company in the market. Moving to phase three of continuing to serve and expand demand for our services for our growing global customer portfolio and place for our focus on profitability. Those two are very connected.\n\nWe are working closely with our customers to reposition sizable portions of our program portfolio with our disruption and in part on quality. And while our business continue to progress have been necessary to plan for contingencies and enable uninterrupted services quality. Our customer portfolio is now better diversified and more resilient, giving them a new level of engagement and new talent options that should establish a broader, more valuable partnership framework for us post war. Today, we are staying close to our customers and working through different project plans and contingencies and what has begun for us a new normal.\n\nThat also includes our efforts around coming back to the profit levels that are in line with our historic numbers. As you can see, we have some intermediate success in that direction already. While it is still too early to say that we have overcome the challenge to make it sustainable. On that type of navigation and unpredictable, I would like also to share here that during the recent Gartner Symposium on October, EPAM was a future case study on labor and global talent resiliency exactly based on our efforts over the last eight months to adapt, to provide safety to our people and assistance with relocations and for continually investing in our capabilities and future growth while navigating the unpredictable.\n\nWe believe that most of the efforts highlighted by Gartner have put us onto a new trajectory or establishing foundation, if you will, that will position EPAM for continued future growth and market differentiation. Here, I would like to mention three more on top of what we have already shared. Progressing EPAM continuing our integrated consulting portion, which opens new market entry points and extend the depth and breadth of our existing relationship with customers to cover even more strategic set of buyers in our portfolio, also reflected by our increased on-site production headcount ratio, which is now 13.6%, the highest in our history, furthering our ecosystem partnerships enabled by our product and platform engine heritage and new scale and market to bring them in relevant solutions to customers facing increasingly corporate business and technology environments. Lastly, significantly investing on our educational platforms, which keeps our employees on the cutting edge and allow us to attract and work to develop and deploy global talent for EPAM, as well as offer compossible education services to our customers.\n\nIn a more simple way, with all above efforts, we are very focused on maintaining our engineering and technology advantage and reputation across all our new and already established locations. Yes, we do understand that it is exactly one of the key questions you, as investors, and all our clients are asking today and also probably about our ability to continue moving higher in the value chain, something we started 10 years ago and what we are very eager to continue doing now and in the future, proving to the market that we would be able to navigate the next transformation of EPAM to be able to offer to our clients something, which is rare in the market: strategy and competition simultaneously and at scale and doing that better than most of our competitors can. With that, let's talk a bit about our Q3 results. While Jason will share as always the full level of detailed write-up.\n\nIn the third quarter, EPAM delivered $1,230 million in revenues, a 24% year-over-year growth and non-GAAP per share of $3.10, a 30% increase over Q3 2021. I think it's important to mention that in constant currency terms and with proper adjustment on discontinued revenue in Russia, that growth would be about 35%. Also during this quarter, the company generated $234 million of free cash flow and now has approximately $1.5 billion of cash on hand. We are proud and grateful to all our teams for continuously managing the business at this level while responding to constant pressure to plan and execute a large number of tactical adjustments in an increasingly complete geopolitical and economic environment and especially thankful to our teams in Ukraine.\n\nAs you have likely heard during the last month, some of our partners and customers have been messaging the expectation for a global slowdown in demand, and they result in actions to better align their businesses to this new environment. So for us, while the demand environment continues to be active across a number of our end markets, including client second transformational programs, products, platform development and modernization efforts in addition to the opportunities triggered from the recent acquisitions, we can confirm that there has been an increasing focus for programs that are tied to driving the short-term cost savings, other opex efficiencies and growth range of optimization programs. [Inaudible] EPAM is also properly positioned today. Still, even with all confidence that our services remain highly relevant and in demand we are beginning to see signs of growth level for the -- so while we are taking steps to moderate our high-income spending and response, we are also reminded of previous downturns, out of which we grew at unprecedented rate.\n\nAs such, we are working to carefully collaborate our supply and demand outlook to capture the demand up since -- when it returns as we did it in the past. As we wrap up 2022, we believe that we will have contained the initial impact of the work within the fiscal year, including the discontinuation of our operations in Russia. But overall, we know that we are still in the middle of ongoing crisis in Ukraine. And unfortunately, it doesn't seem that right now it will be possible to contain the full part of the world just within 2022 as we have previously called.\n\nWhat has changed over the past two quarters is that when we say we can and will adjust our operations, we are confident that under circumstances we can do so reliably and quickly. And exactly that for us is a very important confirmation, that after almost 30 years of our existence after 10 years of being a publicly traded company and after becoming a S&P 500 member, we still can demonstrate our strong entrepreneurial DNA and we still can benefit from it by acting as a start-up as it ensures our ability to adapt and to grow further while for the current time, we are still playing for different types of mitigation scenarios in response to ongoing war events to protect EPAM and our employees who remain in the region. Nevertheless, we are confident that the steps we have taken to reposition and diversify the company have created an even stronger foundation for future growth as we focus on EPAM as a $10 billion company, very much in line with what we shared with you in early 2022 before the word we go. Now let me turn the call over to Jason, who will talk about our Q3 results and additional perspective as we look at Q4 and beyond.\n\nJason Peterson -- Chief Financial Officer\n\nThank you, Ark, and good morning, everyone. Before covering our Q3 results, I wanted to remind everyone that in addition to our customary non-GAAP adjustments, expenditures related to EPAM's management and commitment to Ukraine, the exit of our Russian operations and costs associated with accelerated employee relocations have been excluded from non-GAAP financial results. We've included additional disclosures specific to these and other related items in our Q3 earnings release. In the third quarter, EPAM delivered another set of strong results across both top and bottom line in addition to strong cash flow generation.\n\nDuring Q3, EPAM generated revenues of $1.23 billion, a year-over-year increase of 24.1% on a reported basis and 29.8% in constant currency terms, reflecting a negative foreign exchange impact of 570 basis points. Additionally, the reduction in Russian customer revenues resulting from our decision to exit the market had a 470 basis point negative impact on revenue growth. Adjusting for the exit of our Russian operations, reported revenue growth would have been approximately 29%. Looking at the performance of our industry verticals in geographic regions in the quarter.\n\nGrowth was negatively impacted by the ongoing exit of our Russia operations and the effect of foreign exchange on our U.S. dollar reported results were helpful. I'll provide an adjusted year-over-year comparison. Beginning with our industry verticals, travel & consumer grew 41.9%, driven by strong organic growth, primarily from our retail customers, as well as revenue contributions from recent acquisitions.\n\nLife sciences & healthcare grew 35% with strong growth coming from the healthcare industry in addition to growth in life sciences. Financial services grew 10.4%, with growth coming from asset management, banking, and to a lesser extent, in insurance. Excluding our Russia customers, growth would have been 25.4% and 29.9% in constant currency. Business information & media delivered 20.8% growth in the quarter, driven primarily by customers in the business information industry.\n\nSoftware & Hi-Tech grew 17.8% in the quarter. And finally, our emerging verticals delivered 26.6% growth driven by clients in energy, manufacturing and automotive. Excluding our Russia customers, growth was 29.5% or 39.4% in constant currency. From a geographic perspective, Americas, our largest region, representing 61% of our Q3 revenues, grew 26.3% year over year or 27.7% in constant currency.\n\nEMEA representing 36% of our Q3 revenues, grew 35.3% year over year or 50.3% in constant currency. EMEA performance was driven by strong organic growth, combined with an incremental contribution from recent acquisitions. CEE representing 1% of our Q3 revenues contracted 77.2% year over year or 80.2% in constant currency. Revenue in the quarter was impacted by our decision to exit Russia and the resulting ramp-down of services to Russia customers.\n\nAnd finally, APAC grew 10.5% year over year or 15.4% in constant currency terms and now represents 2% of our revenues. In Q3, revenues from our top 20 clients grew 22% year over year while revenues from clients outside our top 20 grew 25%. Moving down the income statement. Our GAAP gross margin for the quarter was 32.6% compared to 33.9% in Q3 of last year.\n\nNon-GAAP gross margin for the quarter was 34.4% compared to 35.1% for the same quarter last year. Compared to Q3 2021, gross margin in Q3 2022 reflects the negative impact of lower utilization, as well as a benefit from foreign exchange and the positive impact of a more normalized expense related to variable compensation. In Q3 2021, expense related to variable compensation was unusually high based on the strong bottom line and extremely strong top line performance during that year. Q3 2022 was also negatively impacted by the timing difference associated with EPAM's ongoing efforts to align bill rates based on employee relocations.\n\nHowever, we have made better progress adjusting rates than originally anticipated. As a result, the negative impact on profitability was more limited than originally expected. GAAP SG&A was 16.1% of revenue compared to 17.1% in Q3 of last year. And non-GAAP SG&A came in at 14.1% of revenue compared to 15.3% in the same period last year.\n\nSG&A performance in the quarter reflected a lower level of costs related to both variable compensation and facilities and also includes a positive benefit of foreign exchange. GAAP income from operations was $180 million or 14.7% of revenue in the quarter, compared to $144 million or 14.6% of revenue in Q3 of last year. Non-GAAP income from operations was $232 million or 18.9% of revenue in the quarter, compared to $180 million or 18.2% of revenue in Q3 of last year. Q3 non-GAAP income from operations reflects a lower level of variable compensation and a positive impact from foreign exchange, offset by a lower level of utilization.\n\nOur GAAP effective tax rate for the quarter was 18.4% primarily driven by excess tax benefits related to stock-based compensation. Our non-GAAP effective tax rate, which excludes excess tax benefits, was 23.1%. Diluted earnings per share on a GAAP basis was $2.63, reflecting a $0.68 or 34.9% increase year over year. GAAP EPS includes the impact of Ukraine humanitarian expenditures, expenses related to accelerated staff relocations and costs related to the planned exit of our Russian operations.\n\nOur non-GAAP diluted EPS was $3.10 and reflecting a $0.68 increase or 28.1% growth over the same quarter in 2021. In Q3, there were approximately 59.4 million diluted shares outstanding. Turning to our cash flow and balance sheet. Cash flow from operations for Q3 was $252 million, compared to $206 million in the same quarter of 2021.\n\nFree cash flow was $234 million, compared to free cash flow of $185 million in the same quarter last year. We ended the quarter with approximately $1.5 billion in cash and cash equivalents. At the end of Q3, DSO was 69 days and compares to 71 days for Q2 2022 and 70 days for the same quarter last year. In Q4, we traditionally experienced a further improvement in DSO and expect a similar result this year.\n\nMoving on to a few operational metrics. We ended the quarter with more than 53,900 consultants, designers and engineers, a year-over-year increase of 14.5%. Our total head count for Q3 was more than 60,250 employees. Compared to Q2, we saw a net decrease of approximately 1,000 head count.\n\nThe net decrease in head count is a result of the reduction in Russia-based head count, combined with a lower level of hiring across the organization due to better-than-expected productivity in Ukraine and with a focus on moving utilization toward higher levels. Utilization was 73.5% compared to 77.1% in Q3 of last year and 78% in Q2 2022. Utilization continues to be impacted by the war in Ukraine. Now let's turn to our business outlook.\n\nAs we've done in previous quarters, let me provide some context that is informing our guidance for the fourth quarter. We expect a solid demand environment, including demand for programs, helping clients drive additional revenue, modernization and optimization. In a few cases, in the retail and consumer space, we are seeing signs of moderation in demand due to delays in decision-making or additional scrutiny on program budgets as certain customers become more cautious regarding shifting demand in their end markets. As a reminder, the exit of our Russian operations and the reduction in Russia customer revenues produces a tougher year-over-year revenue comparison, particularly in Q4, which has generally been a seasonally strong quarter in Russia.\n\nTo date, our operations in Ukraine have not been materially impacted by the recent escalation of the tax. And our teams remain highly focused on maintaining uninterrupted production. Our guidance assumes that we will continue to be able to deliver from our Ukraine delivery centers at productivity levels at or somewhat lower than those achieved in Q3 and consistent with our experience in the month of October. Through September 30, EPAM spent more than $39 million as part of the company's $100 million humanitarian commitment to our Ukranian employees and their families.\n\nWe expect further humanitarian expenditures will be made in Q4 and during 2023. Now moving to our Q4 2022 outlook. We expect revenues to be in the range of $1.220 billion to $1.230 billion, producing a year-over-year growth rate of approximately 11% on a reported basis and 15% in constant currency terms, both at the midpoint of the range. Included in these growth rates is approximately 100 basis points of revenue contributed from acquisitions closed over the last 12 months.\n\nAdditionally, the ramp-down of Russian customer revenues due to our decision to exit this market has a negative impact, reducing our expected revenue growth rate by approximately 500 basis points. For the fourth quarter, we expect GAAP income from operations to be in the range of 12% to 13% and non-GAAP income from operations to be in the range of 16% to 17%. We expect our GAAP effective tax rate to be approximately 21% and our non-GAAP effective tax rate, which excludes excess tax benefits related to stock-based compensation to be approximately 23%. For earnings per share, we expect GAAP diluted EPS to be in the range of $2.02 to $2.10 for the quarter and non-GAAP diluted EPS to be in the range of $2.62 to $2.70 for the quarter.\n\nWe expect a weighted average share count of 59.6 million diluted shares outstanding. Finally, a few key assumptions that support our GAAP to non-GAAP measurements in the fourth quarter. Stock-based compensation expense is expected to be approximately $33 million. Amortization of intangible sales is expected to be approximately $5.7 million.\n\nThe impact of foreign exchange is expected to be negligible. Tax effect of non-GAAP adjustments is expected to be around $9.6 million. And finally, we expect excess tax benefits to be around $4.3 million in the quarter. In addition to these customary GAAP to non-GAAP adjustments and consistent with the prior quarters in 2022, we expect to have ongoing non-GAAP adjustments in Q4 resulting from Russia's invasion of Ukraine.\n\nPlease see our Q3 earnings release for a detailed reconciliation of our GAAP to non-GAAP guidance. Our fourth quarter outlook reflects a solid demand environment, combined with improving operating performance, allowing EPAM to return to its traditional 16% to 17% adjusted IFO range sooner than anticipated. Although we still face ongoing challenges, this is a significant achievement given the amount of disruption that the company is managing through as a result of the war in Ukraine. We will continue to closely manage the operations of EPAM while remaining attentive to any changes in the demand environment.\n\nLastly, I'd like to thank our employees for their continued dedication and focus on our customers. Operator, let's open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Bryan Bergin with Cowen. Your line is now open.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nHi, guys. Good morning. Thank you. I hope your colleagues remain safe here.\n\nJust first, I was hoping you could just dig into more on the detail on how you're forecasting that 4Q growth just as we consider a 30% adjusted rate of growth on a constant currency organic basis this past quarter and we try to bridge that to the implied level in 4Q. Can you just talk about some of the puts and takes you factor there? Is it really just a combo of lower utilization and some macro uncertainty on demand?\n\nJason Peterson -- Chief Financial Officer\n\nYeah. I mean I think there's a few things. Firstly, there is a decline in revenues associated with build days. So it's just the natural algebra as there are fewer build days in Q4 than there are in Q3.\n\nAnd that would net-net would kind of actually reduce revenue by 2% between Q3 and Q4, if all things elsewhere held equal. At the same time, I think that we continue to feel good about the growth that we generated in Q3. And I think the other thing, Bryan, to point out is that we have the same impact on our growth rate from the exit from Russia. So we had a $50 million Q4 last year, and we'll have a single digit -- mid- to low single-digit Russian revenue contribution in Q4 of this year.\n\nSo it's a combination of those two things. And then again, we continue to see growth -- we continue to see spending and investments on the part of our clients, but it's probably at a somewhat lower growth rate than we have experienced earlier in the year.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nOK. OK. And then on the delivery footprint, understanding you had the Russia exit this quarter that really impacted that workforce level. Can you just comment on your comfort levels ramping in these other regions? Have there -- and are there any notable changes in the delivery mix plan that you expect to exit this year at?\n\nArk Dobkin -- President and Chief Executive Officer\n\nSo I think we are kind of illustrating that we were talking like a couple of quarters ago about our rebalance in our delivery capacity. We actually exactly on the plan or progression a little bit. And I think by the end of the year, probably a couple more percentage points will be down from impacted regions, which means that we're continuously building our operations in Western, Central Asia, India and Latin America as well. But right it's all balanced out.\n\nAgain, inside of the company, probably we will go from current 30%, 31% to 27%, 28% trends [Inaudible].\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nAll right. Thank you, guys.\n\nOperator\n\nThank you. Our next question comes from the line of David Grossman with Stifel. Your line is now open.\n\nDavid Grossman -- Stifel Financial Corp. -- Analyst\n\nGood morning, and thank you. Just a couple of quick follow-up questions about some of the comments that you made about the dynamic between if you look at the quarter, you had a sequential decline in head count. You beat the revenues modestly yet margins performed with utilization down. You mentioned rate.\n\nIs there anything else that kind of helps to reconcile all those different variables with the outcome?\n\nJason Peterson -- Chief Financial Officer\n\nYeah. There's a couple of different ways to look at this from a pricing standpoint associated with the realignment of pricing for the relocation of employees. We did better than we expected. So we had expected that to have a more negative impact on profitability in Q3 than it actually did.\n\nHowever, on a year-over-year basis, that wouldn't really show up as a benefit. What we saw was a couple of things. We are getting some benefit from foreign exchange, so foreign exchange is obviously having a negative impact on revenue growth rate. But we have a number of countries in which we deliver from where the currencies obviously have devalued more substantially than the devaluation of the euro or the pound, and so that's had a somewhat positive impact on profitability on a year-over-year basis.\n\nThen the other thing, which I tried to call out in the script is that we had an enormously successful year last year relative to expectations, which drove a higher variable compensation costs. And this year, where we're effectively sort of booking a bonus, if you will, at 100%. It's lower than it would have been last year. And so last year, I guess you could say we would have been even more profitable.\n\nAnd this year, we're sort of booking at a more consistent level of variable compensation based on our performance. So I'm not certain if that gets to the heart of it, but foreign exchange would definitely be one of the things that's a positive.\n\nDavid Grossman -- Stifel Financial Corp. -- Analyst\n\nRight. And you had said, Jason, I think last quarter that you expect to get to more normalized margins in the first quarter obviously, next year, you've obviously kind of exceeded that this quarter. As you think about next year and you kind of eliminate some of this noise, is kind of a 17% -- I know you don't want to give guidance earlier in the year, but I guess I'm just trying to get a sense, are you still comfortable with that? Comment of getting back to normalized margins and sustaining that next year? Has anything changed?\n\nJason Peterson -- Chief Financial Officer\n\nYeah. So I think that if I remind, I said we get -- we expect to get back toward, right, which is -- and right now, I feel actually that the company has done a phenomenal job with not only the profitability in Q3, but also the guide getting back to the 16% to 17% in Q4. And part of that has to do with all the work we've done on the geographic transformation and the realignment of rates. But I think it's too early right now to talk about what profitability could be in 2023 just because there's still a lot of moving pieces with what's going on in -- with the war and some other things.\n\nBut I definitely -- I am encouraged by the fact that we've generated such a strong level of profitability in Q3. And again, our confidence in being able to guide to 16% to 17% in Q4.\n\nDavid Grossman -- Stifel Financial Corp. -- Analyst\n\nRight. And just one last one, if I could. In the demand environment, you give us a good insight into kind of how that informed your fourth quarter guidance. And you called out, I thought, consumer.\n\nAny other verticals that you're seeing similar dynamic? Are you just anticipating based on qualitative commentary from your customers that they're planning for a slowdown beyond the consumer vertical? Just any more color you can give us there would be very helpful.\n\nArk Dobkin -- President and Chief Executive Officer\n\nDavid, you're wishing and reading exactly what we do. And in general, I think I don't know if you use noise as kind of qualifier, but there are enough messaging on the market that many industries are very careful right now and seems like, of course, saving priority becoming No. 1 versus transformation. That's at least what we've seen.\n\nIt's not necessarily seen in the market from specific actions across the industries. But I think it would be fair to assume that retail probably usually reacting much faster, sometimes much faster recoveries as well. That's what we saw in 2021, but some other fall and I think it wouldn't be surprised. So I think everybody much more careful, obviously, compared to just several quarters ago.\n\nDavid Grossman -- Stifel Financial Corp. -- Analyst\n\nAll right. Great. Very helpful. Thank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of Darrin Peller with Wolfe Research. Your line is now open.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nThanks, guys. When thinking about where we are now in terms of the transformation you wanted to be in by this time in the year around Russia and all the sourcing and the labor side and the relocating, can you just give us a quick update in terms of the percentages more you still have to go to finalize plans on that front? And when we think about the new geographies, obviously, you talked about how pricing in those new markets is helping the revenue side to some degree versus the head count growth. But I'm curious what you expect your head count growth capabilities to be from here just being in some of these new markets.\n\nArk Dobkin -- President and Chief Executive Officer\n\nSo I think in terms of plans, we kind of shared pretty detailed plans during our Investor's Day. I think we're very much on target with this plan. At the same time, as you understand, each month, not even talking about quarter but sometimes each week making some adjustments to this. So at this point, we do believe that we do it a recent possible based on the real-time information happening and at large our plans still stays the same.\n\nSo we're going to become probably the most balanced from a delivery perspective company in our sectors. And we very strongly looking how we grow it and going to develop talent market across new for us location. So it's all in plan, and that's very much moving forward. So what else we will be necessary we'll be doing if different type of scenario will be developed, we have answers for this.\n\nI don't think we will be saying in all details, but we have plans for this. But again, right now, we're going practically with the same plan, which we shared and we're very much on target for this, which we share at investors day.\n\nJason Peterson -- Chief Financial Officer\n\nSo we feel quite good about our ability to add head count in the regions in which we're currently expanding in Latin America and India and in other geographies outside of what we call the impacted region. And so I think we very much can respond to future upticks in demand and again, feel comfortable with our ability to continue to generate growth in excess of 20% based on available demand. OK, right now, there's a little bit more focus on taking up utilization again. And so that's kind of what you see around the head count additions.\n\nArk Dobkin -- President and Chief Executive Officer\n\nSo the question was comfortable that we will be able to find the right talent in new locations. Then the short answer, yes. Right now, we even more comfortable than we were a couple of quarters ago because now we have much more experience in terms of how to do it as we understand how to reapply the experience, which we developed during our growth in our kind of comfortable zone in Eastern Europe that is very much applicable to new locations as well.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nJust -- thanks. Just very quickly, when you think of the macro and the demand environment for a minute, I mean, it's pretty clear that companies are taking a little bit longer to make decisions, but for the right technology, the demand is still very high. Have you seen a shift to cost takeout plans or efficiencies by your clients yet? Or is it still very much focused on like digitization and differentiation competitively and other projects like it?\n\nArk Dobkin -- President and Chief Executive Officer\n\nI would characterize this like if two, three quarters ago, the growth and -- it's always been caught for me whatever people means by digital transformation and broad sense of this. It was absolutely No. 1 priority. I think right now, it's very much balanced with cost savings and what will be tomorrow.\n\nI think it's visible. So it's pretty balanced from our point of view. Digital transformation is still there and is still one of the two priorities, but it's now one of the two.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nUnderstood. All right. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from the line of Ashwin Shirvaikar with Citi. Your line is now open.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you, and good quarter, guys. I wanted to just kind of take a peek at the planning assumptions as you're going through that process for next year and as we think in terms of granular modeling. Again, not asking for guidance, but how are you thinking of the setup for next year in terms of the underlying demand for digital transformation. Obviously, Q1 is a tough comp or things like that.\n\nCould you just walk through your thought process as you do your own budgeting?\n\nJason Peterson -- Chief Financial Officer\n\nWe're in the midst of it today. And so we -- the standard process that we would use where we've got kind of an aspirational model and then a very detailed account level planning, and we're beginning to get feedback from each of the business units as to kind of what they're expecting at the account level. Then as you can imagine, we sort of consider investment priorities and all of that, and we come back with a guide in terms of both revenue growth and profitability. And so clearly, we're not at a stage yet where I can talk about that based on where we are in the planning cycle and we're also not guiding to 2023, but I will provide some color on the revenue growth.\n\nAnd so as we've talked about, we do expect that we will return to a rate of growth greater than 20% at some point in the future. At this time, based on what I'm seeing with our numbers, I would not expect that to occur in the first half of the 2023 fiscal year. And instead, I think that would be more likely to occur sometime in the second half.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nUnderstood. Got it. And thank you for that. The other question I had was, obviously, as we see everybody else's results coming through, a lot of weakness in the high-tech vertical.\n\nHow does that affect sort of your thinking in terms of -- thinking or expectations in terms of your own client base and the work you're doing? And are you beginning to see any specific impact in that or other verticals?\n\nArk Dobkin -- President and Chief Executive Officer\n\nI think that you already kind of brought color on this, that in general, everybody much more cautious than before. And I think I don't think like to loudly say this like you open any media everybody talking about it. And there is no very clear sign what would happen, but again, everybody much more careful in making decisions. And it's not only in the retail.\n\nRetail reacted much weaker than consumer reaction as well. The rest of this, pretty stable right now, but again slower from a gross point of view, definitely slow.\n\nJason Peterson -- Chief Financial Officer\n\nSo we still see spending. We still see investment on the part of clients. Just the rate of growth appears to be somewhat slower and some of the decision-making is a little bit slower.\n\nArk Dobkin -- President and Chief Executive Officer\n\nAnd if you ask in like broader longer-term, then I think -- as any other relatively large company, we have a history of going through difficult times and we definitely analyze this. And in our specific case, we know that each time after this, it was time of big growth. And again maybe quiet situation was the closest illustration if considered as a quiet or slowdown. Again, it was for several quarters, we don't know.\n\nBut then it was big kind of come back. Similar was in 2008, 2009 for us. And we'll learn our lessons how to navigate through this and how to go through this to make sure that we save, and in Western is the very right part of the company to come back correctly, and that's what we're focusing. And in short, we talked about it already multiple times.\n\nConsulting integrated with engineering. We are building up this piece no matter what, and we understand how to scale up the talent. That's another area which we keep intact all the time. Even if the numbers of head count is slowed, the whole machine how to bring talent back, it's still running and retuning this very carefully.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you. Appreciate that. Thanks.\n\nOperator\n\nThank you. Our next question comes from the line of Ramsey El-Assal with Barclays. Your line is now open.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nThank you for taking my question this morning. I had a question on the pricing environment. And it seems like there's some puts and takes. On the one hand, you have a lot of inflation, which might give you some air cover to pass pricing through.\n\nOn the other hand, you're talking about some softening macro, maybe some caution on the side of your clients. Can you talk about the puts and takes in pricing and whether you're seeing any changes in the environment?\n\nJason Peterson -- Chief Financial Officer\n\nI think what I would just comment on, on what we've seen, let's say, over the last maybe five months and then it's a little harder to predict as to what you might see in the future, but I could talk to kind of what we're expecting for Q4. One of the things that was a positive surprise from both a revenue standpoint and profitability in Q3 was that we were able to execute on our realignment of rates for all of the relocations that we've done to higher-cost geographies. And so we made better progress than expected. Already, I think that as we end Q3, we think that we've already gotten realignment of about two-thirds of the positions that have been shifted to other geographies.\n\nWe still have ongoing work to do there. And also, we still are relocating people from countries to higher-cost countries, but we do expect to continue to see price improvement associated with realignment. And then in addition, there probably is some additional pricing kind of going on in the second half of the fiscal year. Hard to postulate kind of what could happen next year.\n\nCertainly, in the environment that we've been in where there's been very high demand and some disconnect between supply, that's supportive of pricing discussions and we'll have to see what pricing discussions look like in 2023.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nOK. Great. And one last one for me, a question on M&A and similar overlay with the sort of macro cycle. In past cycles, do you guys pull back on deal activity as the macro environment gets a little choppier? Or instead is it the opposite where you maybe see some opportunities that weren't around when times were better? How do you think about M&A in that context?\n\nArk Dobkin -- President and Chief Executive Officer\n\nI don't think we were like adjusting our M&A activities based on specific like economic climate environment. I think we were looking for the right additions all the time and we continue doing this today as well. And I think it might be a better opportunity for us in a couple of quarters from pricing point of view. But in general, we consider to be working on this and it's not happening right now mostly because we don't see the right things.\n\nBut definitely, we have -- maybe with everything else, yes, we have some other priorities before this. But again, there is no specific slowdown on the M&A.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGot it. All right. Thanks so much. Appreciate it.\n\nOperator\n\nThank you. Our next question comes from the line of James Faucette with Morgan Stanley. Your line is now open.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThanks very much. A couple of follow-up questions for me. Jason, going back to kind of your outline for 2023, I think it makes sense, particularly given the comps that you faced with Russia and its contribution at least in the early part of the first half of this year, are there other drivers or things that we should keep in mind as you think about like that kind of return to 20%-plus growth in the second half of the year? And kind of what are your planning assumptions? Are you looking at new capacity coming online, delivery capacity coming online? Or just how you're thinking about kind of the evolution of the current demand environment. Just any incremental color on what's leading you to kind of think about that cadence.\n\nJason Peterson -- Chief Financial Officer\n\nYeah. So you're right that we would have still generated significant revenues from Russia, particularly in Q1 of 2022. So that will be a tougher comp. We still think foreign exchange is going to have some headwind associated with it.\n\nAnd then I think there's -- right now, we continue to sort of evaluate the demand environment, as we've talked about. But I just think the other thing is that if you look at our head count additions over the last couple of quarters is that oftentimes you need to have sort of ongoing sequential growth to then continue to sort of produce strong year-over-year growth two or three quarters out. And so we feel very comfortable with our ability to add head count over time. And again, as Ark talked about, we feel that we've got increasing sort of operational experience in the newer geographies.\n\nAnd right now, I just think as I kind of look at the numbers and the likely head count adds this quarter, it just appears that your trajectory would sort of give you the opportunity for a greater than 20% growth in the second half rather than in the first half. And I think you guys probably do the same type of math that we do, and you likely could see that as well.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGreat. Appreciate that, Jason. And then the second part of my question is like -- and then I think it ties a little bit into what you were saying around employees and where you're adding heads geographically. But I think you had made the comment about wanting to increase utilization, etc.\n\nIs it right to assume that you're probably running higher utilizations in your more established geos including maybe those that are impacted still by the war in the Ukraine and that the improvements in utilization are likely to come primarily from the newer geographies? Or is there more nuance than that?\n\nJason Peterson -- Chief Financial Officer\n\nIt would be mix. So we're definitely running with lower utilization in what I'll call the impacted sort of geographies. But there's also some opportunity for us to tighten up utilization in some of the newer geographies that we've expanded into. And so again, the goal in Q4 would be somewhat improved utilization, but still maybe a little below our target.\n\nAnd then as we enter the first half of next year is to make certain that we're continuing to focus on improved utilization.\n\nArk Dobkin -- President and Chief Executive Officer\n\nBut in general, what you asked, James, it is correct because in new locations we have new people and utilization at the beginning of this area is still below. And in quarter two, it will be improved because it will be stable up, I guess.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThat's great. Thanks, Ark. Thanks, Jason.\n\nOperator\n\nThank you. Our next question comes from the line of Surinder Thind with Jefferies. Your line is now open.\n\nSurinder Thind -- Jefferies -- Analyst\n\nThank you. I'd like to start with a question about just kind of the delivery footprint that you have at this point. Can you maybe talk about the level of comfort that clients actually have with the current exposure to the region? So are they expecting you to maintain backup in case of further disruptions? Are they taking on some of the risk? How should we think about that balance that you have with clients at this point?\n\nArk Dobkin -- President and Chief Executive Officer\n\nSo basically question how well the making happening between what locations clients leading to consider and where we're growing right now from a talent point of view, correct?\n\nSurinder Thind -- Jefferies -- Analyst\n\nWell, more about the idea that right now, I think the target is to have 30% of your delivery from the exposed regions where the war is, right? Is there an opportunity to further reduce that? Or it seems like clients are comfortable with that level of risk. And so how should we think about -- do you have to make feedback in terms of clients if there is further disruption? Or how should we think about you guys managing to this new global delivery footprint, like why not reduce it further?\n\nArk Dobkin -- President and Chief Executive Officer\n\nThat's a very dynamic parameter. And I think clients -- because the risk is a very dynamic parameter. And in general, clients comfortable with it, but as soon as the risk will elevate, that this distribution will be happening. That's some way -- that's the main challenge that's what we're living through.\n\nAnd at this specific point, I think there is a kind of status quo is some concern and what will be one month from now or two months from now, it's a little bit different things. Again, that's exactly the challenge on hand. But another side, we have multiple new locations, and we have, as we mentioned, a significant number of EPAMers who move from one location to another and came to new locations, which kind of seems to accelerate the EPAM knowledge and quality standards and growing new locations and also make clients comfortable in these new locations because some good concentration of people they already know moved there. So from this, we manage the whole as a rebalancing of the talent.\n\nBut right now, we have 30% and it's people with pretty good level of utilization right now.\n\nSurinder Thind -- Jefferies -- Analyst\n\nThank you. And then as a follow-up, can you maybe talk -- I understand there's been a lot of questions about demand. But can you maybe talk about the level of visibility that you have with customers? And what I'm trying to get here is can you maybe talk about the rate that maybe projects are being delayed or canceled relative to historicals? And is there incremental risk in the sense that once 2023 budgets get established, it's really then that clients have to make decisions. So maybe current conversations may be productive, but when it really -- the rubber hits the road, they're more hesitant to start projects.\n\nSo just kind of trying to understand the risk in the numbers as it seems like some commentary from everyone else, things are just slowing faster than anticipated. And so the question is, why can't that continue?\n\nArk Dobkin -- President and Chief Executive Officer\n\nI think our typical answer at this stage it's too early to say because it's kind of not even middle of Q4 and this is very, very true in any very normal year. With a kind of not what is a normal year, probably when I'm looking to our revenue trends or the results of normal year the last time we saw probably at the end of 2019, which was a long time before COVID and before -- then it was like big slow down and then huge acceleration. Then in our case was started, but then the whole general economic trend like going different than we saw just six months ago probably, OK. So that's why like you're asking a question, but even the normal year, we're not commenting on this.\n\nAnd this specific year, I don't think we can say like, it is very dynamic.\n\nSurinder Thind -- Jefferies -- Analyst\n\nThat's helpful. Thank you. That's it for me.\n\nOperator\n\nThank you. Our last question comes from the line of Jamie Friedman with Susquehanna. Your line is now open.\n\nJamie Friedman -- Susquehanna International Group -- Analyst\n\nHi. Ark, in your prepared remarks, you called out the increase in the on-site composition, the highest in the company's history. So I just want to get some context on that, why now? And then -- well, let me just start with that, any perspective. And then I had a question about the $10 billion comment as well.\n\nBut how about the on-site first?\n\nArk Dobkin -- President and Chief Executive Officer\n\nI think we're talking about EPAM continuing development as a brand. It practically didn't exist three years ago. Now that's a name which started to be recognized on the market and consultant field. So -- and with everything, specifically acquisition during 2019 -- oh sorry, 2021 -- during the 2021, end of 2021, we were increasing this and to support the new type of engagements, which we anticipate in and which we are doing already.\n\nSo we actively were hiring in the market. So it's not specifically why now, it's just continuation of what's happening.\n\nJamie Friedman -- Susquehanna International Group -- Analyst\n\nOK. Thank you. And then in terms of your comment about the $10 billion, I don't want to point to a specific time, but how are you thinking about that journey in light of everything that's going on, the $10 billion target.\n\nArk Dobkin -- President and Chief Executive Officer\n\nSo probably it maybe sounds a little bit strange, especially taken exactly in account what's going on right now. But at the same time, while this is a very, very special situation and we will understand it, so all our experience from the past quarters is going to end -- is going to ramp in one quarter and three quarters. On top of this, there is a potential economic slowdown. I'm actually talking about it.\n\nIf you think about our numbers during the last several quarters, based on economic environment, based on our competitors, if war wouldn't happen, these numbers might be considered even normal. Not very much different from what others are showing, that I'm just bringing all [Inaudible] just to confirm that we're definitely looking into what's going to be with the next couple of quarters, so six months. But we're definitely looking at what we'll be here in two years or three years. And from this point of view, $10 billion looks like a very realistic goal for us.\n\nStill aspirational, but realistic. Three years ago, probably $10 billion would be sound very much aspirational. Right now, it's just a pragmatic target for us. That's all.\n\nJamie Friedman -- Susquehanna International Group -- Analyst\n\nGot it. Thank you. I'll jump back in the queue.\n\nOperator\n\nThank you. I would now like to hand the conference back over to Arkadiy Dobkin for closing remarks.\n\nArk Dobkin -- President and Chief Executive Officer\n\nAgain, thank you very much for joining us today. Thank you for your support, which we are hearing from everybody. I think it's important to one more time state that EPAM as a company, we're supporting Ukraine 100%. So we're very committed to our people in the country.\n\nWe do believe that Ukraine would be part of our operation for many years. And while we're going through the difficult part, I think we're still seeing a very bright future for EPAM and the growth. And we understand that it's a challenging time. So we'll talk in three months, and we'll see what's happening.\n\nAnd thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid Straube -- Head of Investor Relations\n\nArk Dobkin -- President and Chief Executive Officer\n\nJason Peterson -- Chief Financial Officer\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nDavid Grossman -- Stifel Financial Corp. -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nSurinder Thind -- Jefferies -- Analyst\n\nJamie Friedman -- Susquehanna International Group -- Analyst\n\nMore EPAM analysis\n\nAll earnings call transcripts"
}