{
  "companyName": "JD.com",
  "companyTicker": "JD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/18/jdcom-jd-q3-2022-earnings-call-transcript/",
  "content": "JD.com (JD -1.68%)\nQ3 2022 Earnings Call\nNov 18, 2022, 7:00 a.m. ET\n\nOperator\n\nHello, and thank you for standing by for JD.com's third-quarter 2022 earnings conference call. At this time, all participants are in listen-only mode. After management's prepared remarks, there will be a question-and-answer session. Today's conference is being recorded.\n\nIf you have any objections, you may disconnect at this time. I would now like to turn the meeting over to your host for today's conference, Sean Zhang. Please go ahead.\n\nSean Zhang -- Director, Investor Relations\n\nThank you, Ruckel. Good evening, and good day, everyone. Welcome to JD.com's third quarter 2022 earnings conference call. For today's call, CEO of JD.com, Mr.\n\nLei Xu, will kick off with opening remarks. Our CFO, Ms. Sandy Xu, will discuss the financial results. After that, we'll open the call to questions from analysts.\n\nI'd like to remind you that during this call, our comments and responses to your questions reflect management's views as of today only and will include forward-looking statements. Please refer to our related safe harbor statements in the earnings press release on our IR website, which applies to this call. We will discuss certain non-GAAP financial measures. Please also refer to a reconciliation of non-GAAP measures to the comparable GAAP measures in the earnings press release.\n\nAlso, please note that unless otherwise stated, all figures mentioned in this call are in RMB. With that, I will turn the call over to Mr. Xu, our CEO. Mr.\n\nXu.\n\nLei Xu -- Chief Executive Officer, JD Retail\n\n[Foreign language] Hello, everyone. This is Xu Lei. Thank you for joining JD.com's third-quarter earnings call. [Foreign language] 2022 has been a year full of challenges, a year both momentous and extraordinary.\n\nWe have withstood nationwide COVID resurgences, challenging macro conditions, flattish consumption demand, as well as supply chain disruptions. Facing the complex dynamics, JD has been making full use of our supply chain capability and a resilient business model, which we built over the years as we strive to provide best possible service to customers, create operating certainty for real economy participants while, at the same time, delivering steady business growth of our own. Moreover, we are delighted to see substantial improvement in our growth quality this year. Given the evolving economic and industry environment, since the beginning of the year, JD made pre-emptive position to focus on our core businesses while reinforcing quality operations and management and attaching great importance to business health.\n\nWe believe this is the best way to maintain operating stability in times of external stress and ensure rapid regeneration while the economy recovers. As a result, along with our steady business growth, we have also experienced better operating quality, stability, and profitability. This validates what we have communicated with investors many times before about the potential for margin improvement in our unique business model. It also builds a solid foundation for sustainable development through our different economic cycles.\n\n[Foreign language] We welcome and support the government's recent move to further optimize COVID control measures with a more science-based and a targeted approach. We believe this is important to contain virus threat and maintain the stability of economic and social development. There are also supporting policies for companies like JD that play an indispensable part in supporting the industrial belts and people's livelihood. We will fully cooperate with and implement the authority's relevant decisions and arrangements.\n\nIt is true that COVID conditions will continue to post challenges to the economy and consumption in the near term. That said, we remain confident in the continuous refinement of the COVID control measures, the resilience of the Chinese economy, and the long-term prospects of the consumption market here. We also see growth opportunities amid all the challenges. [Foreign language] As we made proactive adjustments and focus on our operating quality, we always put the essence of the retail business at the center of our core competences and business model, namely customer experience, cost optimization, and operational efficiency.\n\nWith this long-held business philosophy in mind, we continue to achieve great progress in increasing customers' mindshare and supply chain efficiencies. In Q3, JD's annual active user base reached 588 million, mainly driven by the net addition of over 10 million active users from our core retail business. Our DAU also recorded a double-digit year-on-year growth. In addition to user base expansion, we also saw better user structure and user quality.\n\nIn particular, both the number of old users and Plus members delivered higher growth rates than other groups of users and made up a larger proportion of total users. This helped to drive increases in overall average shopping frequency and ARPU. For Plus members, along with the scale expansion, we also saw that each of them, on average, spent over eight times as much as a non-Plus member, demonstrating their high degree of loyalty, engagement, and purchasing power. During the latest Singles' Day Grand Promotion, JD highlighted the grand theme of cost effectiveness and value for money, which helped us to onboard an increasing number of high-quality merchants and products.\n\nThe promotion achieved a solid growth, with a meaningful increase in the number of shopping users and a record number of participating brands, merchants, and offline stores. In addition, the promotion Singles' Day growth for many agricultural households and areas with nearly 10,000 SKUs of agricultural products sold over 100,000 RMB. JD is committed to promoting the virtuous cycle of rural revitalization from direct sourcing of high-quality agricultural products to consumption upgrade to increase income performance. During the promotion, we are also proud to see that over 500 million users clicked the best-price-guaranteed program in the app, an after-sales service that JD has provided for many years.\n\nThis reflects JD's supply chain capabilities and showcases our commitment to providing the best possible user experience, helping users to feel reassured at all times when they shop on the platform. This service has become a hallmark of JD's premium user experience and also pushes the boundaries of what the industry can do to advance user experience. [Foreign language] The continuous improvement of operating quality also makes a solid foundation for us to make further progress in our long-term strategies, namely our online marketplace ecosystem, omnichannel businesses, and supply chain capabilities to empower the real economy. Our online marketplace ecosystem made solid progress in Q3 with the number of third-party merchants recording over 20% year-on-year growth for the seventh quarter in a row.\n\nFashion, home goods, sports, and outdoors categories all outperformed the industry. Notably, with the onboarding of the Italian fashion brand, Fendi, JD has become the first platform to establish an all-brands partnership with the nine luxury brands under the LVMH Group. A collection of fashion, cosmetics, and sportswear brand also joined JD in Q3, such as Christian Louboutin, LaPrairie, and lululemon, further expanding our brand base. In addition, our supermarket business, JD Super, continue to roll out its National Pavilion program, providing consumers high-quality specialty products worldwide.\n\nIn addition to the 70 National Pavilion already in operation, we welcomed nearly 20 countries to open to our National Pavilion on JD.com during the latest Singles' Day Grand Promotion. Overall, JD is dedicated to build an online marketplace ecosystem where merchants can thrive with lower entry barriers and operating costs, better traffic allocation and the marketplace room, as well as higher operating efficiency driven by the best of JD's supply chain, logistics, and the technical capabilities. All these efforts have contributed to a sustainable growth of merchants and SMEs in times of uncertainty. During the latest promotion, merchants on our platform reported stellar performance with higher sales contribution, both on a year-on-year basis and compared to this year's 618 Grand Promotion.\n\n[Foreign language] JD's omnichannel intercity business maintained strong growth momentum in Q3. In particular, Shop Now, our one-hour delivery service, recorded a triple-digit year-on-year GMV growth with the services covering the vast majority of supermarket chains in China. Shop Now has forged close collaborations with brands and offline stores and generated incremental growth through omnichannels for brick-and-mortar partners. During the latest promotion, as the only on-demand retail platform selected by Apple for the presales of new iPhone 14 series, JDDJ worked together with Shop Now and sold hundreds of thousands of new iPhone models, making a record for new iPhone sales using on-demand retail model.\n\nIn addition, JDDJ and Shop Now also partnered with over 200,000 offline stores during the latest promotion, covering a wide range of categories, such as supermarkets, mobile phones and electronics, cosmetics, home goods, baby and maternal, and pets and provided hourly delivery services in over 1,800 cities and counties. [Foreign language] Despite the challenging environment, JD Logistics continue to provide up and downstream industry partnering with reliable integrated supply chain solutions, supporting enterprise customers to mitigate risks, respond to rapid external changes, and optimize cost and efficiency. In Q3, JDL also expanded the depth and breadth of collaborations with a variety of leading players in FMCG, home appliance, furniture, apparel, 3C, automobile, and fresh produce industries. As a result, JDL maintained a resilient revenue growth in this quarter.\n\nNotably, both the number of JDL's external customers and external revenue delivered double-digit year-on-year growth, with the latter -- with the latter contributing nearly 70% of its total revenue in Q3. Moreover, JDL continued to expand its logistics infrastructure around the world. As of the end of Q3, JDL operated over 1,500 warehouses with an aggregate gross floor area of over 13 million square meters. It is also worth highlighting that JD Logistics Airlines, an affiliate of JD Logistics, commenced operation in Q3.\n\nIn the future, JD Logistics Airlines will strengthen JDL's integrated supply chain services and help drive lower cost and higher efficiencies along the supply chain. [Foreign language] To conclude, amid evolving external environment this year, JD had the foresight to double down on operating quality and the core business. This has enabled us to constantly deliver high-quality growth, generate healthy margins and cash flow, and accumulate strength for long-term development down the road. As I mentioned last quarter, as we mitigate through the cyclical economic adjustment, amid short-term challenges, we expect to see the momentum of [Inaudible] and the tremendous growth opportunities ahead of us.\n\nAs a company that is rooted in and services the real economy, JD supports the expansion of the demand side and the structural reform of the supply side in China, helping the real economy to achieve better quality and sustainable growth. Looking ahead, our well-established supply chain infrastructure, technical capability, and the social responsibilities we are committed to will enable us to create a more important role in China's new development space. We believe that only through unwavering determination and perseverance can we live up through the times. With that, I'd like to give the floor to Sandy.\n\nSandy Xu -- Chief Financial Officer\n\nThank you, Lei, and hello, everyone. As many of you can see here on the ground, the COVID situation is still evolving and may add complexities to consumer sentiment and the operational environment from time to time. Nevertheless, in the third quarter, we recorded a set of improving metrics and encouraging milestones across our financial and business operations. Our solid results in the quarter demonstrated our ability to cope with difficult external dynamics while improving our core competencies to support a more sustainable growth trajectory going forward.\n\nIn the third quarter, our net revenues grew by 11% year on year to 244 billion RMB, returning to a healthy growth track. We navigated through a challenging time, impacted by COVID resurgence and macro uncertainties. Our annual active user base also returned to growth and reached 588 million in total, representing a net addition of 7.5 million customers sequentially, despite a partial drag due to our Jingxi business adjustments. More encouragingly, we saw more customers staying with us for a longer time, and average spending per customer has been consistently increasing as well.\n\nAll of these improving metrics demonstrated deeper user engagement and enhanced customer trust. Looking down the revenue mix, product revenues were up 6% year on year, a recovery compared to 3% year-on-year growth in Q2. Service revenues grew by 42% year on year to 46.5 billion RMB, achieving a historic high of 19% of total net revenue. Logistics and other services revenues grew by 73% year on year in Q3.\n\nExcluding the consolidation effect of Deppon, it still delivered a year-on-year growth rate of 36%, continuing the momentum from Q2. I will elaborate more on the underlying drivers later. Marketplace and marketing revenue grew by 13% year on year, up from 9% year-on-year growth in Q2. In order to drive recovery, we saw merchants becoming more active again, and invested additional advertising budget on our platform which helped to accelerate our advertising revenue growth.\n\nAlso, thanks to our relentless focus in improving the 3P ecosystem, we successfully onboarded an increasing number of merchants onto our platform, including a few notable wins in the apparel category. This brought our merchant base to a new height, laying a solid foundation for our open ecosystem. Now, let's turn to our segment performance. JD Retail maintained solid top-line growth with a healthier business mix and a continued margin improvement on a year-on-year basis.\n\nJD Retail's revenues reached 212 billion RMB in Q3, growing at a solid 7% year on year. Electronics and home appliance category returned to an impressive 8% year-on-year growth, up from flat growth in Q2. During the quarter, as a result of our supply chain capabilities and strong consumer mindshare, we swiftly match the demand side for air conditioners due to the unusual weather pattern, driving double-digit revenue growth in the home appliance category. Meanwhile, the launch of the latest mobile phone models in September helped to lift consumer demand and sales.\n\nGeneral merchandise revenues were up 3% year on year in Q3. COVID situation and a hard macro continue to dampen spending in consumer discretionary products, such as cosmetics, beverages, and partially contributed to the soft growth of general merchandise. Meanwhile, we started to proactively optimize our product mix, particularly in the supermarket category, to improve operating efficiency and profitability, which we expect to impact its growth rate for a transitionary period. However, we believe it is important for us to stay focused on our core categories and capabilities in order to establish a healthier and more sustainable growth trajectory for the long term.\n\nThat said, for the emerging categories, such as healthcare, home goods, pets, and sports and outdoor, we continue to experience double-digit top-line growth in the quarter, demonstrating our expanding user mindshare across a wide range of categories. We are seeing the results of our business optimization. JD Retail's fulfilled gross margin was up 80 basis points compared to the same quarter last year, mainly driven by our optimization efforts and the improving economies of scale. Also, as we continue to expand gross margin for most categories and remained disciplined in opex, JD Retail's operating margin was up 115 basis points on a year-over-year basis to 5.2% in Q3, above the 5% mark for the first time since the founding of the company.\n\nJD Logistics, or JDL, maintained a solid top-line growth in Q3 and has achieved breakeven for two quarters in a row. JD Logistics' Q3 revenue grew by 39% year on year to 36 billion RMB, partially because JDL acquired a majority stake in the Deppon, which was consolidated since the end of July. Excluding the impact from the consolidation of Deppon, JDL's revenues were up 16% year on year, mainly driven by the resilient growth in revenues from external customers, which also saw acceleration on a sequential basis. As a result, revenues from external customers once again achieved a record high revenue contribution of nearly 70%.\n\nMore encouragingly, as JDL relentlessly focused on improving customer mix optimizing operations and realizing the economies of scale, this operating margin was up 350 basis points, from a year ago, to 0.7% in a seasonally low quarter. These results demonstrate JDL's ability to maintain a resilient growth. Even in a challenging environment, we are remaining well on track of improving its profitability. Dada reported revenues of 2.4 billion RMB, and its operating loss [Inaudible] sequentially to 300 million RMB.\n\nDada continues to work closely with both internal and external business partners. Notably, JD Super, our supermarket business within JD Retail, has been collaborating with Dada to broaden product portfolio that offers intra-city on-demand retail services. The Shop Now service to consumers achieved a triple-digit GMV growth in Q3. This initiative also contributed positively to the margin of supermarket category.\n\nDada also established a collaboration with a variety of external brands. For example, Dada Now has been expanding instant delivery services to the coffee and the beverage category, which is now available in over 2,000 cities and counties nationwide. As you can see, with a broader spectrum of use cases offered by Dada, JD is in a much better position to serve our customers anytime anywhere. Finally, as I shared in the last quarter, we continued to pursue rational development across our new business segment.\n\nIt reported revenue of 5 billion RMB and operating profit of 280 million RMB, with a positive operating margin in the quarter. This was mainly due to the gain from the first tranche closing of JD Properties third property core fund in Q3 and the narrowing loss from Jingxi business. As JD Property has a well-proven business model with total transferred AUM surpassing 27 billion RMB, we remain committed to further expanding this business in line with our prudent investment philosophy. In the space of the complex macro conditions, both domestically and internationally, we have also been pursuing strategic realignments in other noncore business, such as the Jingxi business.\n\nThese measures resulted in a more moderate revenue growth but continued to narrow the operating loss sequentially even after excluding the gain from JD Property. Moving to the consolidated bottom line, as we proactively adopted measures to focus on our core businesses and improve operating efficiency, our bottom line reached a new milestone in Q3. Non-GAAP net income attributable to ordinary shareholders surpassed the 10 billion RMB mark for a single quarter for the first time in history. Non-GAAP net margin was 4.1%, representing an impressive year-on-year improvement of 180 basis points and reaching a historic high.\n\nOn a GAAP basis, net income attributable to ordinary shareholders also improved to 6 billion RMB, with GAAP net margin of 2.4%. Our free cash flow for the trailing 12 months this quarter was 25.8 billion RMB. This was mainly driven by our improving operating cash flow -- were partially offset by the increased capex in our infrastructure expansion that would position us well for the future growth. By the end of Q3, cash and cash equivalents, restricted cash, and short-term investments added up to a total of 218 billion RMB, up from 207 billion RMB last quarter.\n\nTo close my remarks, the solid set of Q3 results demonstrated JD's business resilience in the face of rapidly evolving macro conditions. There may be no better time than now to rebuild the progress across our business initiatives and make positive changes where needed. We believe it's vital, especially in our time of uncertainty, to stay focused on delivering better operating efficiency, lower cost, and best-in-class user experience, which represents the essence of the retail business and the bedrock of JD's long-term success. Our focus on building resilient business means that we are well positioned to help our users and business partners to cope with external challenges and make meaningful contributions to the society.\n\nAll of these factors will make sure we are well prepared to benefit the next phase of great growth opportunities, which we believe won't be too far ahead. With that, let's open the call to the Q&A. Thank you.\n\nOperator\n\nThank you. The question-and-answer session of this conference call will start in a moment. [Operator instructions] Today's first question comes from Ronald Keung with Goldman Sachs. Please go ahead.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\n[Foreign language] Thank you, Xu Lei, Sandy, and Sean, and congratulations on the strong third-quarter results. I want to ask about the investment phase and mix growth drivers. As we could see from the third quarter that Logistics, Dada, and new businesses are no longer dragging the group earnings. So, where are you thinking on mix, investments, and growth areas.\n\nAnd then within JD Logistics, we've seen that the general merchandise supermarket growth had moderated, while margin level for JD Retail reached a new high. So, heading into next year, how are we thinking about balancing growth, price advantage, and stable margins? Thank you.\n\nLei Xu -- Chief Executive Officer, JD Retail\n\n[Foreign language] This is Xu Lei. Let me start the question by sharing with you our long-term health philosophy to do business. This has remained unchanged for the 17 -- for the 19 years of JD.com. We will always put great importance to the users experience and the cost and efficiency no matter what kind of growth and new business we do.\n\nWe will stick to these three points. And in terms of our customer businesses, we attach great importance to the quality of our product and prices and good prices and premier services. So, many of our investors know, this is very difficult to always speak to these philosophies and concept through 19 years of JD's development. [Foreign language] And in terms of some changes this year, I would say that we make more concentration and focus on our core businesses.\n\nThis is based on our analysis early this year, and we have made some proactive measures according to our early analysis, which, to date, we think it's very timely adjustments we have made and also taking the leading actions among this industry. [Foreign language] And we are certain that even though many enterprises are facing challenges, we do see a brighter future, and there's some obvious signs on the economic recovery. Even though the sign is very clear, but we are still not very clear about how fast the speed of the recovery. So, from the management perspective, what we want to do is that we stick to our current strategies, and we should have a very clear view on the future in terms of which direction and what will be changing in this industry, in this market and how strong is this momentum so as to make our resources investment in a more clear pace.\n\n[Foreign language] And in terms of the strategies for JD Retail, we will continue to stick to the big four strategies, which are the building of the supply chain capability and expansion into the lower-tier markets and being in open ecosystem and the interest at retail. We will stick to these four. [Foreign language] And in terms of the supermarket business, indeed, mainly affected by the COVID resurgences, its growth is going in the down way. However, many progress is made in these categories, including its healthiness, its profitability, and its ability to manage categories.\n\nSo, it's overall for the JD Super users account for over -- accounts for 50% of the overall JD.com platform, and we are confident for the future growth of this category. And we also made some new experiments in this category for our intra-city and lower-tier market expansion this quarter. Thank you.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\n[Foreign language]\n\nOperator\n\nThank you. And our next question comes from Thomas Chong at Jefferies. Please go ahead.\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language] Thanks, management, for taking my questions, and congratulations on a very solid set of results. My first question is about the logistics disruption due to the pandemic recently. How should we think about the impact to consumer sentiment, user experience? And on that one, how should we think about the short-term impact to GMV and revenue growth momentum? And my second question is about the latest product category trend, of course smartphones, consumer electronics, FMCG, and apparels. Thank you.\n\nLei Xu -- Chief Executive Officer, JD Retail\n\n[Foreign language] And, indeed, as you pointed out that the logistic fulfillment has been severely impacted by the COVID situation, actually, in the past three years, this year is the most heavily affected. I want to share with you a bit of data here that in September to present, in terms of our logistic fulfillment, 17% of our customer home addresses have been affected by this COVID control measures. And this doesn't mean that it affects the order amount and the sales on JD. But indeed, this is the worst year in terms of fulfillment.\n\n[Foreign language] And indeed this situation -- difficult situation will affect sales and fulfillment. But also, I'm proud to share with you according to China's Post Bureau service, recently, in terms of the service experiences, JD Logistics stands No. 1 among this industry, which once again validated our efforts made in our supply chain capability-building to help us stand up and gain consumers' trust in this difficult time. [Foreign language] And just also basing our data from the Singles' Day Grand Promotion, we do see a higher rate of order cancellations.\n\nIt's a higher cancellation rate than the past years because of the fulfillment difficulties and the longer waiting times. However, I want to emphasize here that people come to JD.com for more brand shopping. So, we believe the cancellation rate for these platforms with more impulsive shopping or shopping based on their interest, the cancellation rates should be higher. [Foreign language] And another group of people has attached great importance on our brand partners and merchants.\n\nAnd based on JD's shopping features with more brand shopping and premier shopping experiences, this can translate to the better operating cost and the profitability for merchants and brands and make us stand out among all the other e-commerce platforms. [Foreign language] And in terms of the faster-growing categories, in Q3, we've seen that home appliances, fresh goods, health, sports, and pets are doing a good job, also including our Shop Now services for the intra-city retail and of our other offline business, 5STAR appliance stores. [Foreign language] And for this, the last idea performing categories include cosmetics and mobile phones. And -- but also, we see that since September, some new mobile phone model releases, the situation is getting better, and this will continue in the lead up to Q4.\n\nAnd for this apropos category, it's affected by the limited shopping scenarios due to the COVID. And also, the baby and the mother category is affected due to the reduced newborns. And there are many [indiscernible] categories on JD.com. And we are regularly reviewing those loss-making categories and make dynamic adjustments to maintain the healthiness across all categories.\n\nAnd we have seen improvements on the performance of all categories and better satisfaction among brands and merchants. And despite of all the offs, we see their market share all continue to increase. [Foreign language] Thank you.\n\nSandy Xu -- Chief Financial Officer\n\nThis is Sandy. I can add more color on the short-term GMV trends. So, as Xu Lei just mentioned, we are still facing some short-term challenges due to the COVID control measures. And also, we view the 20 new rules guiding COVID control policies to be very positive and constructive for the recovery of domestic supply chain and consumer confidence.\n\nBut it will take some time to actually see the positive impact on consumption data, given the current situation. So, in the short term, we recommend analysts to be more conservative in modeling the top line performance. But we are more confident in the long-term strategies and the growth next year. Specifically for JD Retail, yes, we see that the recircling of the COVID situation affects more regions in the country at this time.\n\nAnd also, there are disruptions to logistics and fulfillment, resulting a decrease in the successful procurement rate as Xu Lei just mentioned, as well as an increase in the order cancel or return rate compared to prior years. So, the consumers also become more conservative or rational under the current macro environment. And in fact, the demand was good during the major promotions but softer before and after the promotion. So, in Q4, we see that different categories performed differently.\n\nBut in general, you know, the essentials, daily necessity products performed stronger than the discretionary products. In particular, for apparels and other discretionary products remained relatively soft. So, we are -- the management team is paying more attention to operating quality this year, taking proactive initiatives, including making some structural adjustments to the SKUs or subcategories with heavy investments. So, we still have some negative impact on the short-term top-line growth, but we believe it will build very good foundation for our long-term top-line performance.\n\nSo, with all these factors considered, the category trend will continue in Q4 but may slow down a bit moderately from Q3. And then for JD Logistics, its organic top-line growth will be similar in Q3 -- to Q3 and the internal revenue will again be affected by the decrease of the orders of Jingxi business. And JD Logistics' external revenue growth will significantly outpace that of the internal revenue again in the fourth quarter. Deppon was consolidated at the end of July.\n\nAnd it will contribute more to external revenue in Q4. On the new businesses segment side, so the revenue growth of Jingxi Pinpin will still be negative, will be adjusted for our overall revenue performance. And international business strategy has also been adjusted and put in plan to improve the operating efficiency, and while our JD Property maintains a relatively high growth momentum. Thank you.\n\nOperator\n\nOur next question comes from Eddy Wang with Morgan Stanley. Please go ahead.\n\nEddy Wang -- Morgan Stanley -- Analyst\n\n[Foreign language] My question is that we have already witnessed a part of signal in terms of the COVID policy relaxation, as well as the potential reopening in early next year. So, I just want to hear your view that, assuming that this reopening will gradually to happen in next year, what kind of preparation or strategy changed in our -- based on our current strategy in this year? And the follow-up question is that we have seen very strong margin improvement in terms of the JD retail business and the other business. So, if assuming that there will be a very strong recovery in terms of consumption next year, are we able to achieve both strong margin improvement together with the top-line reacceleration? Or it will be a balance between the margin improvement with -- and the top-line growth? Thank you.\n\nLei Xu -- Chief Executive Officer, JD Retail\n\n[Foreign language] And let me answer the first question. And firstly, I want to make a bit of correction. There are certainties and uncertainties. By the certainties I mean that we do see there are some new signals, and we are getting ready for the good things to come.\n\nI believe that the worst time has been passed, and we do receive some signals and some good information and factors for a brighter future. However, for the rebound, the question is when and how strong? So, these are the uncertainties. We are not quite sure how strong and what's the time the recovery will come. So, for JD.com, we are such a large company that covering the whole country from the first- to fifth-tier cities.\n\nAnd we believe the recovery will come in different formats and different times on different groups of people in different regions. And since our -- based on our communications with our brand partners, they all expressed to -- their strategy to focus on profit this year, and this also coupled with their concerns on the supply chain impact made by the Ukraine war. So, whether or not next year, they will focus more on profitability or on the growth, it's really hard to tell at this moment. So, we will also make our dynamic evaluations and to make the investment decisions at the right time next year.\n\nHope this answers your question. [Foreign language] And on the profit, I want to make a further explanation here. For JD's growth throughout the years, there are two main drivers. One is for the product structure changes.\n\nWith a higher percentage of certain products, their gross margins will improve steadily and also the increase in revenue from the services we provide. So, throughout the years, you can hear that all the companies are talking about lower the cost and improve efficiency. And for JD.com, this year, we focus more on lower the cost and to improve stability for the internal management. And I believe in next year and the year -- in the next two years, we will focus more on the improvement of the efficiency.\n\nI can see there's many areas we can continue to improve efficiency. That's what I wanted to add. Thank you.\n\nSandy Xu -- Chief Financial Officer\n\nAnd this is Sandy. I want to emphasize that our long-term margin target hasn't changed, which is based on the industry-level margin and the operating efficiency we can generate through technology and the scale of our business operation. If the consumer confidence is largely recovered, we will add more investments to drive growth in users and the market share. However, at the same time, we will also gain additional operating efficiency, as Xu Lei just mentioned, due to spillover benefit, due to technology and due to the increased contribution of our service income.\n\nSo, this is the beauty of retail business. Although we achieved a very important milestone for net income this quarter at the group level, but on an annual basis, our margin is still below the industry level for almost all business segments. So, we always -- so, there's still room for us to continue to improve our bottom-line performance. JD always pursue sustainable growth.\n\nAnd we will try to deliver stable margin with steady improvement year-over-year until our long-term margin target is met. Of course, during that journey, we will make dynamic adjustments based on the market situation.  Thank you.\n\nOperator\n\nAnd our next question today comes from Lingyi Zhao with SWS Research. Please go ahead.\n\nLingyi Zhao -- SWS Research -- Analyst\n\n[Foreign language] Good evening. This is Lingyi Zhao from SWS Research. I would like to congratulate the management team on the great results. My first question is about on-demand retail.\n\nWhat is the long-term vision we see in on-demand retail market? And after Dada's integration, what adjustments have been made? And which fields will be summarized? We all see the article by Mr. Xu Lei in People's Daily, which talks about promoting the deep integration of digital and real sectors of the economy. My next question is could you please introduce JD's measures in these big trends? Thank you.\n\nLei Xu -- Chief Executive Officer, JD Retail\n\n[Foreign language] Thank you for the question. And I have shared a lot about the intra-city retail before. And now, I want to give you some update on our thoughts and observations. So, first, I want to say that for JD.com to enter into the intra-city retail business, it's purely based on the need drive of the users, if not some opportunity, business opportunities, we jump in.\n\nIt's based on the users' demand. And we're looking at this business. And our understanding is based on the perspective of supply chain -- I don't want to like think in other people's brain about how they think about intra-city retail. This is where we start from.\n\n[Foreign language] And in terms of the entry point, different companies adopt different dimensions. For JD.com, we entered this market by building a relation with the big supermarket chains as our KA. And in terms of the categories, we start with our 3C and supermarket category. And for other players, they might start with some SME stores.\n\nSo, we are entering in different directions. [Foreign language] And our resources and relationships with brand partners is one of the key strengths for us in this intra-city business. And this has been based on our longtime collaboration with our already existed B2C models. We have been collaborating with our partners in many directions, in many dimensions on the supply chain cooperation, on marketing and sales, the release of new products, etc.\n\nAnd altogether, we are forging three-party winning situations among JD, brand partners and the offline supermarkets. [Foreign language] Let me make one example about the intra-city retail cooperation with Apple. As you know that in the September, Apple released its iPhone 14. And, you know, a lot of companies are taking this opportunity to do marketing.\n\nAnd according to the data we collected on this market during the same period of time, JD.com and our intra-city retailing business topped in terms of the sales. And we are seven times to nine times higher in terms of sales of iPhone 14 series as opposed to the second place, the runner-up retailer platform. However, we did not want to brag about it. Because our starting point to do this collaboration is to provide more convenience for consumers to buy the new series of iPhone.\n\nAnd we believe the value to collaborate with the official brands and to improve efficiency for this new phone release. [Foreign language] And as opposed to traditional B2C model, this intra-city retail is a new type of supply chain we are building. There's still a big improvement room for us to improve, such as on users' experience, the synergies we formed with our brand partners, the LBS-based services and then optimize the fulfillment and the transportation power improvement. So, for now, we will focus on several indicators for this business, including user experience, their repurchase rate, improvement -- the number of orders, etc.\n\nSo, still, we focus on the efficiency and experience to develop this business. [Foreign language] And in terms of the integration with the real economy, I want to share that JD is building a responsible supply chain. And this does not only provide more stabilities and reliabilities for our own supply chain. We also opened ourselves with this capability to support our partners upstream and downstream to help in their digital transformation and improve cost and efficiency and to promote a high-quality real economy development.\n\n[Foreign language] And for JD's supply chain services, we are now serving over 8 million active enterprise customers. This includes over 90% of Global 500 companies who operate in China and nearly 70% of the so-called specialized and sophisticated SMEs. And we also provide some specialized supply chain services to the manufacturing and energy fields. [Foreign language] At the same time, JD's supply chain has been connected with millions of small and medium/small stores across China in over 300 cities.\n\nThere are many forms, I won't just elaborate. And we are not only providing the last-mile solutions on their sales and services but also helping them on the first mile of the supply chain in upstream. This has been a very effective support for them to drive more traffic and lower their cost and improve their business efficiency. [Foreign language] And here, I just want to add that JD.com generates rational profits.\n\nAnd we're running based on the low cost. And we fully understand the difficulties for the SMEs. They work -- they do their business in the offline scenarios. So, while we are doing the supply chain support for them, we don't want to eat their profits.\n\nWe want to form synergies with them. And together, we build rational profit. So, this will not make us as some other companies who are entering the entering this offline market and generate also profit. This is not something I think rational.\n\nThank you. [Foreign language] And lastly, I want to mention that in 2020, JD has launched our rural revitalization initiatives named -- called March to Rich Plan. And this plan has driven tens of billions of industrial output in the rural areas and helping millions of farmers to increase their income. And we do feel confident that -- we set a goal to achieve trillions of yuan of industrial output under this program in rural areas within three years' time.\n\nAnd we can accomplish this ahead of the schedule. And so, all of these are our understanding as a new type, real economy company. However, we know we are not doing enough. We are still improving ourselves, improving our capabilities.\n\nHowever, this is the goal we set, and we will stick to it. Thank you.\n\nOperator\n\nThank you. We are now approaching the end of the conference call. I will now turn the call over to JD.com and Sean Zhang for any closing remarks.\n\nSean Zhang -- Director, Investor Relations\n\nThank you for joining us on the call today and for your questions. If you have further questions, please contact me and our team. We appreciate your interest in JD.com as always and looking forward to talking to you next time again. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSean Zhang -- Director, Investor Relations\n\nLei Xu -- Chief Executive Officer, JD Retail\n\nSandy Xu -- Chief Financial Officer\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nThomas Chong -- Jefferies -- Analyst\n\nEddy Wang -- Morgan Stanley -- Analyst\n\nLingyi Zhao -- SWS Research -- Analyst\n\nMore JD analysis\n\nAll earnings call transcripts"
}