{
  "companyName": "MeridianLink, Inc.",
  "companyTicker": "MLNK",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/meridianlink-inc-mlnk-q2-2022-earnings-call-transc/",
  "content": "MeridianLink, Inc. (MLNK 0.07%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to MeridianLink's second quarter 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I now would like to turn the conference over to your first speaker today, Eric Schneider. Eric, please go ahead.\n\nErik Schneider -- Head of Investor Relations\n\nGood afternoon, and welcome to MeridianLink's second quarter fiscal year 2022 earnings call. We will be discussing the results announced in our press release issued after the market closed today. With me are MeridianLink's chief executive officer, Nicolaas Vlok; chief financial officer, Sean Blitchok; and president, go to market, Chris Maloof. Before we begin, I'd like to remind you that today's conference call will include forward-looking statements based on the company's current expectations.\n\nThese forward-looking statements are subject to a number of significant risks and uncertainties, and our actual results may differ materially. For a discussion of factors that could affect our future financial results and business, please refer to the disclosure in today's earnings release and the other reports and filings we file from time to time with the Securities and Exchange Commission. All of our statements are made based on information available to us as of today. And except as required by law, we assume no obligation to update any such statements.\n\nDuring the call, we will also refer to both GAAP and non-GAAP financial measures. You can find the reconciliation of our GAAP to non-GAAP measures included in our press release, which is posted to the Investor Relations section of our website. With that, let me turn the call over to Nicolaas.\n\nNicolaas Vlok -- Chief Executive Officer\n\nThank you, Erik. Good afternoon, and thank you, all, for joining us. We rang the opening bell today at the NYSE to mark the anniversary of our Initial Public Offering last July. Over the last year and a half, we have acquired four businesses that strengthened and expanded our platform.\n\nSince going public, we have exceeded financial guidance every quarter and have made significant progress in our cloud transition. We also refinanced our debt and continue to generate significant cash flow, positioning us to embark on our next phase of growth. I want to recognize the entire MeridianLink team for helping us achieve another strong quarter and delivering the performance we will discuss today. Sean will walk through our Q2 financial performance in more detail.\n\nBut I'd like to focus on the resilience of our business today and where we are investing for the future. The current macro environment highlights the benefits of our multifaceted business. First, our non-mortgage-related lending businesses remained strong, growing 16% year over year in the quarter, led by particular strength in personal and other non-vehicle loan types. Diversification within our mortgage-related businesses benefits us as well, driving our outperformance versus the broader market.\n\nAlthough fewer mortgages are being originated, we are increasing wallet share as our customers leverage more on the MeridianLink platform. MeridianLink exceeded expectations in Q2, with GAAP revenue up 7% year over year to $73 million and 39% adjusted EBITDA margins. We are continuing to see strong demand from both new and existing customers who are investing in the digital transformation of their businesses in order to provide better and faster consumer lending and broader data verification experiences. There is a significant market opportunity for us, and we will continue to invest to capture a disproportionate share of our $10 billion TAM, while maintaining best-in-class margins.\n\nIn order to drive accelerated growth, we have outlined three key areas of continued focus. First, engaging more deeply with our customers; second, expanding the capabilities of our platform; and third, empowering our customers to grow more quickly and better serve their communities. Our top priority is engaging meaningfully and frequently with our customers, understanding their goals and pain points provide us with a real-time view of market opportunities. Not only do these conversations give us a real-time view of market opportunities and inform our near and long-term product road map, but they also meaningfully drive our cross-sell motion.\n\nFor example, in Q2, we engaged with nearly 1,000 customers and partners for three days at our in-person user forum. The event was so well attended that we will have to expand to a larger venue in 2023. This engagement led directly to an increased pipeline for both new logo and cross-sell opportunities. The launch of a product administrative certification program, so that customers are able to optimize the use of our software and increase the efficiency of their organization's workflow, and customer excitement about future MeridianLink innovations that will help our customers and partners win in their market.\n\nWe believe that continuous engagement with our customers ensure that MeridianLink is focused on the right investments to provide both immediate and long-term value to the market. Our next focus area is to continue expanding our platform's capabilities by delivering new innovative functionality. MeridianLink One is our cloud-based multi-product platform, which uniquely spans the digital consumer lending journey from account opening through marketing, loan origination and decisioning. Particular highlights in our cloud transition includes the following.\n\nFirst, we are ahead of schedule to complete the full public cloud migration of MeridianLink One, initiated in 2019 by the end of this year. Second, our patented debt optimization solution, which helps our customers look across their clients' portfolio and identify where they can save money and improve their purchasing power continues to gain traction with customers. And third, we have rolled out our modern experience for home equity, so our customers can more efficiently serve the surging demand for home equity lending. We are focused on increasing the value of the platform by expanding its capabilities, which attract new logos and fuels our cross-sell motion, in turn driving revenues.\n\nAs our final focus area, MeridianLink empowers our customers to compete, grow and succeed in any market. Our track record of providing best-in-class functionality, flexibility and automation as customers move to a digital environment has allowed our customers to win more clients, capture a greater share of their wallet and more fully meet their needs. This is why we are winning more customers and our existing customers are expanding their use of the platform. Like other companies exposed to the mortgage space, we have been adversely impacted by the historic turn in the mortgage market.\n\nUnlike others, however, we benefit from the resilience of our business model and product mix. We are seeing an accompanying increase in non-mortgage activity that more than offsets the headwinds in mortgage refinancing. I know I have said this before, but I want to emphasize this point. The diversity of our business and strong unit economics enables sustained investment in critical growth and scale initiatives across the economic cycle.\n\nNow let me discuss our key highlights of the second quarter. This quarter, we completed the migration of our mortgage lending module to the cloud. This milestone is critically important. As we migrate more of our products to a cloud-native environment, we are strengthening the MeridianLink One platform and are better serving our customers.\n\nOur enhanced security, flexibility and new capability delivery speed increases cross-sell and upsell demand. One Credit Union customer who has been leveraging MeridianLink opening and consumer since 2017, recently selected MeridianLink Mortgage to take advantage of the synergies of combining MeridianLink products. Their MeridianLink One footprint now includes mortgage, multiple consumer modules, and our unified point-of-sale solution. Additionally, our market-leading home equity lending capabilities were selected in the quarter by a top-15 national mortgage lender to facilitate their launch into this new category of lending.\n\nThis election was based on the combination of the unique depth and breadth of functionality we provide and MeridianLink's ability to facilitate a swift market entry and provides another example of our ability to serve higher value customers. Finally, MeridianLink's success is tied to a strong team. As we prepare for the next phase of growth at MeridianLink, we strengthened our executive team by elevating Chris Maloof into a newly created role, President of Go to Market. Where he now has direct ownership of all phases of the go-to-market engine.\n\nThis will further increase the power of our go-to-market organization, leveraging Chris' deep expertise and operating experience and increase our capacity for strategic initiatives. To conclude, MeridianLink is focused on engaging with customers to help prioritize investments that expand our platform capabilities and revenue opportunity and empower customers to better serve their clients and communities. MeridianLink is a customer-focused business. As we improve customers' revenue generation, they improve ours, creating a powerful virtuous cycle.\n\nI will now turn the call over to Sean to talk a little bit about his background and then review our financial results and guidance. Sean and I are aligned on the values and vision of the future of MeridianLink, and I have appreciated Sean's early insights and his quick assimilation into the business.\n\nSean Blitchok -- Chief Financial Officer\n\nThank you, Nicolaas, and thank you again to everyone for joining us on the call today. Being seven weeks in the chair, let me start with a brief introduction, including why I joined MeridianLink. Then I'll review our results for the quarter and provide guidance for the third quarter and full year 2022. I've spent more than 25 years in senior leadership roles that span a diverse set of markets, functions, and business models.\n\nThroughout my career, I've relied on four key pillars with a specific mission to increase the velocity of growth and innovation in the business. Those pillars are one, a laser focus on customer success; two, driving strategic clarity to create value for our customers; three, creating operating scale and leverage in the business model; and four, and perhaps most importantly, an intentional focus on having a positive impact on people and relationships, the result of which is high performing, highly engaged teams, customers, and partners. These pillars are in my DNA and are exactly why I chose MeridianLink, a strong alignment with Nicolaas, the management team and the board on our mission and values. With a vast largely untapped market opportunity ahead and a clear focus on our customer journey and experience, we have an incredible opportunity for market expansion and acceleration of growth to drive this company to $1 billion and beyond.\n\nAs for results, as Nicolaas mentioned, in the second quarter we generated total revenue of $73 million, up 7% year over year. MeridianLink's ability to grow in both a rapidly expanding and rapidly contracting mortgage market speaks to the balanced strength of the business, which is part of what attracted me to this company. In the second quarter, lending software solutions revenue accounted for nearly 71% of our total revenue and grew 14% year over year. Excluding the impact from the anticipated slowdown in mortgage-related revenues, our lending software solutions revenue grew 16% year over year.\n\nFor the mortgage loan market, second quarter revenue generated 24% of overall revenues, roughly in line with our expectations, but down from 30% in the prior year. More specifically, 7% of our lending software solutions revenue and 64% of our data verification software solutions revenue were tied to our mortgage-focused products. While the majority of our data verification software solutions revenue is tied to mortgage, this part of our business continues to meaningfully outperform the market. The 7 points of the year-over-year revenue growth in the quarter came primarily from increased transaction volumes and product go-lives at both new and existing customers.\n\nWe expect to continue to drive accelerated growth as we bring additional capabilities to our customers. Moving to profitability. Adjusted gross margin in Q2 was 70%, in line with expectations. Accounting for stock-based compensation, GAAP gross margin was 63%.\n\nOur non-GAAP operating income was $14.4 million, and our GAAP operating income was $8.9 million. Adjusted EBITDA for the quarter was $28.2 million, representing an EBITDA margin of 39%. This reflects ongoing cost discipline, but more importantly, the significant value our solutions provide in the market, our EBITDA margins are near the level of the largest banking technology providers and clearly distinguish us from most of the smaller providers who have yet to achieve a positive EBITDA. In response to market demand, we spent 21% more in sales and marketing and 28% more in R&D adjusted for stock-based compensation compared to the second quarter of last year.\n\nImportantly, we will continue to invest in our sales and marketing and R&D efforts across the balance of the year as we have enormous potential for further market penetration of our existing solutions and have clear line of sight to expand our offering. Now turning to the balance sheet and cash flow statement. We ended the second quarter with $100.3 million in unrestricted cash and cash equivalents, down $46 million from the end of the first quarter but primarily driven by the closing of the StreetShares acquisition at the start of the quarter. Operating cash flow in the second quarter was $12.8 million, and free cash flow was $10.2 million or a 14% free cash flow margin.\n\nIn the trailing 12-month period ending in the second quarter, operating cash flow was $87.6 million and free cash flow was $80.1 million or 29% free cash flow margin. MeridianLink's current cash position and ongoing cash generation provides a wealth of allocation opportunities for us to most efficiently build value for our customers and shareholders. We did initiate stock repurchase activity in the quarter, but at low volumes, as we see a number of strategic opportunities potentially being unlocked by the current capital raising environment. I am personally very excited to be part of MeridianLink at this point in its development.\n\nNon-mortgage revenues comprised more than three quarters of total revenue in the second quarter, the highest level since at least the start of 2019 and grew in the mid-teens. With the restructured management team focused on accelerating growth and a number of high-return investment initiatives, both in place and in queue, it is a great time to be part of this company. I'll now pivot to guidance for Q3 and an update for full year 2022. Despite the rapid rise in mortgage interest rates since the start of the year and the associated decrease in expected market volumes, we continue to see strong demand momentum overall, and our pipeline remains robust.\n\nFor the third quarter, estimated total revenue is expected to be between $73 million and $75 million, compared to $67.4 million for the same period in 2021. This represents an estimated increase of 8% to 11% year over year and is above market expectations. For the full year 2022, we are reaffirming guidance for total revenue between $289 million and $293 million, compared to $267.7 million for the same period in 2021. This represents an estimated increase of 8% to 9% year over year.\n\nI want to emphasize this point, irrespective of macroeconomic uncertainties, we are confident that we will continue to add new customers and increase module penetration among our existing customers across the remainder of the year. We remain committed to our previously stated guidance. For a bit more context on our expectation of mortgage-related revenues, we've reflected the incremental decline of the market in our guidance. In the third quarter of 2021, the mortgage market contributed $19.6 million of revenue to MeridianLink or nearly 30% of our revenue.\n\nComparatively, we expect the mortgage market to contribute less than 20% for the third quarter of 2022 as rates continued to rise across the second quarter. Overall, the mortgage-related percentage of our revenue in 2022 is still expected to decrease to the low 20%s, down from 30% in 2021. With our current mortgage revenue forecast, we anticipate ending the year with our potential exposure in the high teens as a share of our overall revenue. On a non-GAAP basis, our third quarter estimated adjusted EBITDA is expected to be between $25 million and $27 million, representing EBITDA margins of approximately 35% at the midpoint.\n\nOur reported Q2 adjusted EBITDA came in above our guidance, which is a great result. This is while partially catching up on hiring plans to facilitate our investment initiatives during the quarter. Our expectation is for those plans to be fully funded through the remainder of 2022. As we've discussed on prior calls, this also includes in Q2 and for the remainder of the year, approximately $1 million dilution per quarter to bring the StreetShares Solution fully to market as part of MeridianLink One.\n\nFor full year 2022, our estimated adjusted EBITDA is expected to be between $112 million and $116 million, representing EBITDA margins of approximately 39% at the midpoint. Again, holding to our committed guidance, our investment priorities this year include services capacity to convert existing bookings to revenue and development capacity to complete the movement to the cloud and enhancements to our platform. In summary, we are successfully managing a turbulent macroeconomic environment. We will continue investing in our business, adding new clients, and driving incremental revenues to our customers, and we are confident we will continue to outperform the market in both our mortgage-related revenue and in our non-mortgage solutions.\n\nThat concludes my prepared remarks. With that, Nicolaas, Chris, and I are happy to take any of your questions. And I'll turn it over to the operator.\n\nOperator\n\nThank you, sir. [Operator instructions] And your first question will be from Koji Ikeda at Bank of America. Please go ahead.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking the question. Nicolaas, good to see you again. Sean, congrats on the new seat, looking forward to working with you in the future.\n\nFirst question here is, just thinking about the guide, with the guide being reiterated out there, I actually think that's pretty good considering the mortgage side of the business is really turning out to be a bigger headwind than maybe previously thought entering this year. But the non-mortgage side, it is growing mid-teens. I think that's what you said, and that's really great. And it sounds like that that growth is coming in even all the volatility, that's there, too.\n\nSo what's driving that consumer strength, even when consumer sentiment is not that great out there?\n\nChris Maloof -- President, Go To Market\n\nThis is Chris Maloof. One thing to -- I think everyone on the call would benefit from looking at how mid-market institutions, credit unions and banks have fared across the economic cycles over the last 10 years to 20 years. In both up cycles and down cycles, consumers have demonstrated a strong interest in credit, and which particular aspects of credit go up and down depending on their specific needs, whether it was the liquidity crisis or more recently, the supply chain challenges. But despite any of those elements, it's remained strong.\n\nAnd that's something we're seeing in our volumes now, we're seeing in vehicles despite the supply chain challenges. And I have yet to see anything that would change my view on that, which is also reflected in economic forecasts from organizations such as CUMA. Thank you again for the question.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nChris, I forgot to mention congrats on your new seat too, so congrats on that. And just one follow-up for me. I noticed in the press release, you guys won the top-15 national mortgage lenders with the home equity lending product. That's pretty huge in our view, and it shows the scalability of the product.\n\nSo I guess, can you talk a little bit about how that deal came about? And does this imply or maybe mean that you might be leaning into that part of the market more in the future?\n\nChris Maloof -- President, Go To Market\n\nYeah. Again, I think, first of all, I'll answer the question of, are we going further upmarket? We continue to see success drifting up market, but it's typically when customers come to us, and we meet their needs, and they look at our products and our platform. And see the scalability of our platform across volume environments and their needs. What, from my perspective, really stand out about our platform is its ability to be configured as a highly configurable platform through integrations in our partner marketplace, and that benefits the go-to-market for these folks who want to rollout our solution at a pretty fast clip and speed, specifically as it relates to HELOC.\n\nSo from my perspective, exciting times. We're seeing traction when folks come to us, but it hasn't changed our go-to-market motion where we are still highly focused on that $100 million to $10 billion of assets under management.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Nicolaas. Thanks, guys, for taking the question.\n\nOperator\n\nNext question will be from Saket Kalia at Barclays. Please go ahead.\n\nSaket Kalia -- Barclays -- Analyst\n\nOK, great. Hey, guys. Thanks for taking the question here. I echo my congrats for Sean and Chris.\n\nNicolaas, maybe I'll start with you. Coming into this year, it sounded like we needed to build out the services organization a little bit to really implement the strong bookings that you were seeing. Maybe the question is, how is that process going? And what are you seeing on sort of the implementation or drawdown or whatever the best word is for that backlog that you've built up, does that make sense?\n\nNicolaas Vlok -- Chief Executive Officer\n\nYeah, it does. Thank you for the question. And I do want to break that in two parts and first speak to, yes, we entered Q2 a little bit behind in hiring, but we largely caught up in Q2 by the end of Q2 in hiring services resources that we were budgeting and planning for in the Q2 time frame. We're now in that ramping phase.\n\nSo there's a fair bit of training and mentoring taking place before these folks can really engage on implementations on their own. But very excited, feel we found some great talent in the market in the second quarter that we would bring online as folks who will be out of the field here late this year into next year. Remember, we kind of guided you, it takes us four to five, six months to get folks on to projects. Then in terms of backlog, we continued to build backlog through Q2.\n\nOur goal is still to kind of crash late in the second half of the year and to start driving backlog down. But at this point in time, we've seen a sequential increase of backlog from Q1 to Q2.\n\nSaket Kalia -- Barclays -- Analyst\n\nThat's very helpful. Maybe for my follow-up for you. Understanding it's still only seven weeks in, and maybe, Chris touched on this a little bit, but I'm curious how you think about the growth algorithm for the lending software business, excluding mortgage? And whatever that Lend is, whether that total growth rate, components of customers and volume, open-ended, I'm curious how you kind of think about that growth framework?\n\nNicolaas Vlok -- Chief Executive Officer\n\nYeah. Good question. So the balance of the portfolio, I guess, is diverse, number one. But I do think of it in separate components.\n\nI think there is a component that's new logo. And I want to drive new logo as much as I can. There's a component of it that is just pure volume-based growth. And then there's a component that's cross-sell.\n\nAnd I want -- and in that cross-sell, by the way, is price increase as well. And so really, there are four components that we're driving. All -- we're looking at all of them. I want to drive healthy growth in all of them, but that's kind of the outline or the framework of the algorithm, if you will, and then we get into kind of the details of the specific product lines.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. Very helpful. Thanks, guys.\n\nOperator\n\nThe next question will be from Nik Cremo at Credit Suisse. Please go ahead.\n\nNik Cremo -- Credit Suisse -- Analyst\n\nHey. Thanks for taking my question. I was hoping that you could talk about what sort of protection your contract minimums provide if consumer loan applications were to slow at some point down the line in a recessionary scenario with higher interest rates, just given weakness in mortgage originations and auto loans?\n\nSean Blitchok -- Chief Financial Officer\n\nYeah. This is Sean. I'll take it. So part of what we call resiliency or part of the insulation is baked into our contracts.\n\nMost of our contracts have a tiering system where as volume decreases the prices increase. And so we're able to deflect a lot of that -- the volume decreases is based on the contracts that we have with our customers. So hopefully, that answers your question.\n\nOperator\n\nAny further questions, Nik?\n\nNik Cremo -- Credit Suisse -- Analyst\n\nNot at this time.\n\nOperator\n\nThank you. Next question will be from Cris Kennedy at William Blair. Please go ahead.\n\nCris Kennedy -- William Blair -- Analyst\n\nYes. Good afternoon, and thanks for taking the question. I echo the congrats there. Can you talk a little bit more about MeridianLink One and how you think that could help accelerate growth of the business over the next couple of years?\n\nChris Maloof -- President, Go To Market\n\nThis is Chris. I'll take this one. So Nicolaas already highlighted that we're ahead of schedule on MeridianLink One, which is very exciting for the business and laying that out into a few components. The first and foremost is we've made a concerted multi-year investment to set up our platform for the next decade.\n\nSo what that means to me is that we have a software platform that's on the latest infrastructure, leveraging the latest tools from a cloud vendor on the latest architecture. So the way that benefits us is, we can focus on what we do best. We are not going to be a data center provider. We will not be building data center tools.\n\nWe will leverage what's best in class out there. And then most exciting for me personally is, as all of those development resources free up as we finish the last stage of this project, we can focus the remaining on extending our position in the marketplace and on future innovations.\n\nCris Kennedy -- William Blair -- Analyst\n\nOK, got it. And then I guess, Chris, just a follow-up. MeridianLink has done a lot of -- has made a lot of changes on its go-to-market over the last couple of years. I guess, what's your key focus going forward from here?\n\nChris Maloof -- President, Go To Market\n\nMy key focus going from here is helping -- we've added a lot of people to the organization, which is very exciting. That's the foundation of how we grow our business faster. To be able to maintain that pace, we need to educate every new person, as well as the last 10, were educated on how our solutions help our customers succeed and ultimately win in their respective markets. So that training, coaching and organizational infrastructure to make that possible is my central focus.\n\nCris Kennedy -- William Blair -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nNext question will be from Alex Sklar at Raymond James. Please go ahead.\n\nUnknown speaker -- Raymond James -- Analyst\n\nHi. This is Jessica on for Alex. I've got a quick question about MeridianLink One, a further follow-up on it. I just want to double click on the progress on MeridianLink One's rollout? And specifically, how is cross-selling manifesting for some of the early adopters?\n\nChris Maloof -- President, Go To Market\n\nSo this is Chris again. So from a progress perspective, all of our mortgage clients are in the cloud. We are -- again, we are routinely and monthly moving more and more of our customers. So we're doing it in a staged approach to minimize the interruption.\n\nAnd what I want to call out here is, it's really a tremendous effort by the team in transitioning so many clients with minimal interruptions, especially given the breadth of integrations that our customers are using from our third-party marketplace. That's a tremendous achievement. Now when you think about from a cross-sell perspective, where you're seeing the enablement and the acceleration of the cross-sell is in areas such as where -- where Nicolaas called out about the debt optimization. By having all of our solutions in the cloud on a common stack, we're able to create that with various solutions or loan types, create more value together than apart by having them in one place in a highly responsive location.\n\nUnknown speaker -- Raymond James -- Analyst\n\nGreat. And a follow-up question. What are recent changes in your management, what are you expecting around your strategy to with go-to market? And have there any been any changes to your guidance policies?\n\nSean Blitchok -- Chief Financial Officer\n\nWell, this is Sean. I think from a go-to-market perspective, I don't think we're just -- we're going to continue to build out the management team. I don't think that affects our guidance policies at all. I think our guidance is strong.\n\nAnd I don't have -- we will continue to look at it, but I don't think go-to-market restructuring affects our guidance policy.\n\nOperator\n\nAny further questions?\n\nUnknown speaker -- Raymond James -- Analyst\n\nNo. That's it for me. Thank you.\n\nOperator\n\nThank you. [Operator instructions] And your next question will be from Matt VanVliet at BTIG. Please go ahead.\n\nMatt VanVliet -- BTIG -- Analyst\n\nYeah. Good afternoon, guys. Thanks for taking the question. Maybe, Chris, I wanted to dig in a little bit more on one of the answers you gave before.\n\nAnd I'll also echo my congrats on sort of the new expanded role there. But in terms of the four biggest drivers, obviously, price increase you're trying to implement through. So maybe any updates on just sort of how much of the installed base continues to see price increases roll through? Is that consistently on an annual basis? Or do we -- are we looking at just sort of certain tranches of the customer base for now? But maybe more importantly on the other three key areas there, what do you feel like is maybe the biggest drivers likely in the second half of the year? And then as you look out toward '23 and beyond, where do you expect to add, whether it's more resources or expect greater sales efficiency to win across new logos, expansionary deals, and some of the other components?\n\nChris Maloof -- President, Go To Market\n\nI want to answer that clarifying question first, if you don't mind. When you talk about the levers, are you referring to Sean's illustration of consumer lending growth?\n\nMatt VanVliet -- BTIG -- Analyst\n\nI think you outlined to one of the questions earlier, the sort of four key areas of driving growth across the business. I think it's new logos, cross-sell module [inaudible]?\n\nChris Maloof -- President, Go To Market\n\nThank you for the question. So we'll look to answer this in two parts. I'm going to answer the pricing component, and then Sean is going to talk about the levers that were just outlined. From a pricing perspective, we have an annual pricing cadence that we have where we pursue a willingness to pay model and what's happening in the marketplace.\n\nAnd we consistently drive that lever. And in a high inflation environment, that's more important than ever and a central part to our operating law as usual.\n\nSean Blitchok -- Chief Financial Officer\n\nYeah. And I think perhaps this is getting to the last question, maybe connecting the dots a little bit. But I did outline kind of the model and how I was thinking about the growth algorithm, value, new logo, cross-sell, and price. And so if I just talk to the balance of those, I do think it relates to kind of Phase 3 of MeridianLink, right? We are turning a corner when it comes to go-to-market, what our focus areas are.\n\nWe have a new chief sales officer, who is starting -- has already started, actually, and he's going to be focused more heavily on new logo. And so we'll be focused there more intently than we have been in the past. From a cross-sell perspective, the opportunities for cross sell are -- they exist tremendously within our existing portfolio. So we're, on average, penetrated into four of our 13 modules as an example.\n\nWe have a lot of opportunity for cross-sell, and we're constantly looking for new opportunities, peripheral opportunities to add to the portfolio, to add to the platform. So I think we're constantly looking at our customers, what our customers need to drive that cross-sell, upsell motion. And then volumes, we're -- volumes, we are -- when you talk about mortgage volume, as an example, I think it's largely driven by the market as is a lot of the other products that we have. But we're seeing kind of offsetting, we have seen, and I looked at five years of history and the product volume is a piece that consistently grows.\n\nIt just -- and Chris talked about this a little bit earlier. But if -- even if mortgage levels soften, this is the new normal. I think we're very well prepared for that to be the new normal and to continue to put up our growth trajectory, which is the mid-teens grower.\n\nMatt VanVliet -- BTIG -- Analyst\n\nAll right. Very helpful. And then just following up on Nicolaas' comments that you sort of entered second quarter a little behind on hiring, but it seems like you've catch up or you caught up nicely and are sort of exiting the quarter back on plan. Curious, from a margin perspective, should we expect to see a little bit of pressure or compression through the end of the year and maybe into next year as that hiring continues to pick up and you sort of have a full run rate of headcount expenses? Or is that already sort of contemplated, and the expansionary and cross-sell components are offsetting those new headcount?\n\nSean Blitchok -- Chief Financial Officer\n\nI think it's a little bit of both. Even in Q2, you saw margin pressure from a number of things. One, the StreetShares acquisition, I want to point that out again, but also because of the hiring in Services. That will continue, but I think it becomes -- as we catch up with backlog, and that's one of my key focus areas is to create velocity with the backlog and move implementations faster.\n\nI think we will catch up to that and the margin pressure will relieve over a period of time.\n\nMatt VanVliet -- BTIG -- Analyst\n\nAll right. Great. Thank you for taking the question.\n\nOperator\n\nThank you. Next question would be from Parker Lane at Stifel. Please go ahead.\n\nMax Osnowitz -- Stifel Financial Corp. -- Analyst\n\nHi, guys. It's Max Osnowitz on for Parker. Just one for me. Thinking about the transition of all of the solutions to the cloud and MeridianLink One being ahead of schedule, can you kind of remind us what the cost benefits are there and when we should really start to see those in the model?\n\nSean Blitchok -- Chief Financial Officer\n\nYeah. So I think in general, the answer is, our gross profit decreases by about 3% year over year and a large portion of that is data center. And we -- it decreases to 2% for future years, and we -- but the offset really starts to build in as we get exit our existing data centers, which is end of next quarter. So I think the payoffs began sometime next year, it's basically a wash for FY '23, but has been a drag on gross margin for a while now.\n\nNicolaas Vlok -- Chief Executive Officer\n\nSo I'd like to add something there, Parker, if you don't mind me saying that this isn't a margin story, this is a future-proof platform investment. And while we will be exiting a data center, where Sean highlighted some savings, given the fact that we have a very decent backlog and seeing clients continuing to existing clients continuing to expand. You should expect to see us spend -- increase our spend and card year over year over year. And from my perspective, yes, the data center cost would disappear.\n\nBut from a longer-term standpoint, this is where we should be. This is how we drive cross-sell. This is how we're going to provide a higher level of security to our clients. This is also how we will be in a position to implement and install clients a lot faster than doing it in our own data center.\n\nAnd that -- those are the benefits that I'm personally excited about. I get Sean on the gross margin and everything. But I'm excited when I speak to clients and kind of connect with folks that these are the real benefits.\n\nOperator\n\nAny further questions?\n\nMax Osnowitz -- Stifel Financial Corp. -- Analyst\n\nNo, thanks.\n\nOperator\n\nThank you. Next question will be from Andrew Schmidt at Citi. Please go ahead.\n\nAndrew Schmidt -- Citi -- Analyst\n\nHey, guys. Thanks for taking my questions here. I wanted to dig in on a smaller part of the business. The non-mortgage data verification side, where you have employment verification and other aspects like that.\n\nCan you just talk about the strategy there and potentially growing that as a piece of data verification? And what else you could add to data verification to support the growth? I know you've had a few pickups there historically. So any comments on strategy there would be helpful.\n\nChris Maloof -- President, Go To Market\n\nThis is Chris. Thank you for the question. So I'm going to talk about it in two different lenses. So the first is what's the benefit to the consumer mortgage aspects of the business.\n\nAnd the benefit there is increased integrations and scale for third-party verifications that are important for decisioning. So that is the foundation of our partner marketplace, and it's a major contributor that the verification data business overall provides to the lending portion of the business. So, we have at scale hundreds of partners that are running through these pipes and those same data types are used across all of our products. So that's one.\n\nThe other aspect of our strategy is, part of our customer promise is providing our clients with the software tools they need to run and grow their business. Our credit reporting agencies operate even one or multiple verticals. So the vertical is mortgage, tenant, or employment. And for them to maximize their success and run a business that reduces -- that has less volatility than just running on mortgage, they require all three.\n\nAnd we're now able to provide that within our solution set. Thank you for the question.\n\nAndrew Schmidt -- Citi -- Analyst\n\nChris, I appreciate that perspective. That's helpful. And apologies, this has probably been asked. But just, and if you talk about just the consumer LOS side of the business in terms of sort of confidence, meaning, in current rates of growth.\n\nAnd then with the kind of the backlog that you're seeing, as you put more resources into absorbing that backlog, if we can see sort of a step up into 2023 as we get all the implementation resources into place. Apologies if I missed that, but any color would be helpful.\n\nChris Maloof -- President, Go To Market\n\nI think with the declines elsewhere, guidance kind of proves out that we are seeing a step-up. And so because we're holding guidance, I think, I'd say, I would look at that as a positive. I think the services -- look, backlog is a -- we want more backlog. I've said this.\n\nWe -- but we want velocity in clearing the backlog, and so we're working on that. I don't know, there's another piece of this, which is, we're not just in an environment of macroeconomic uncertainty. It's also a very interesting time socially with the great resignation, people back to work, a shift in markets. So we're seeing even customers' capacity to implement as an issue.\n\nAnd so, we'll work -- we'll continue to work the services piece. We'll continue to work the velocity. But I will point out that the backlog itself, we have a long runway of backlog, and it is reasonable -- to specifically address your question, it is reasonable to think that we can sustain or even do better in terms of growth rates based on that backlog alone.\n\nAndrew Schmidt -- Citi -- Analyst\n\nHelpful. Thank you very much.\n\nOperator\n\nThank you. And at this time, it appears that we have no further questions. Please proceed.\n\nNicolaas Vlok -- Chief Executive Officer\n\nThank you. I'd like to close by recognizing the great work of our team. What we accomplished together is truly remarkable. In fact, we were recently selected as the winner of the Association for Corporate Growth Orange County Spotlight Award.\n\nThat spotlight on our performance inspires us to continue reaching high, and I'm confident in our continued success. Thank you for joining us today, and we'll be in touch. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nErik Schneider -- Head of Investor Relations\n\nNicolaas Vlok -- Chief Executive Officer\n\nSean Blitchok -- Chief Financial Officer\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nChris Maloof -- President, Go To Market\n\nSaket Kalia -- Barclays -- Analyst\n\nNik Cremo -- Credit Suisse -- Analyst\n\nCris Kennedy -- William Blair -- Analyst\n\nUnknown speaker -- Raymond James -- Analyst\n\nMatt VanVliet -- BTIG -- Analyst\n\nMax Osnowitz -- Stifel Financial Corp. -- Analyst\n\nAndrew Schmidt -- Citi -- Analyst\n\nMore MLNK analysis\n\nAll earnings call transcripts"
}