{
  "companyName": "CarGurus, Inc.",
  "companyTicker": "CARG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/cargurus-inc-carg-q2-2022-earnings-call-transcript/",
  "content": "CarGurus, Inc. (CARG 0.79%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, and welcome to the CarGurus, Inc. second quarter 2022 earnings results conference call. [Operator instructions] As a reminder, this conference is being recorded. I will now turn the call over to Ms.\n\nKirndeep Singh, vice president, investor relations. Please go ahead.\n\nKirndeep Singh -- Vice President, Investor Relations\n\nThank you, operator. Good afternoon. I'm delighted to welcome you to CarGurus second quarter 2022 earnings call. We will be discussing the results announced in our press release issued today after the market closed and posted on our investor relations website.\n\nWith me on the call today are Jason Trevisan, chief executive officer; Scot Fredo, chief financial officer; and Sam Zales, president and chief operating officer. During the call, we will make statements regarding our business that may be considered forward-looking within applicable securities laws, including statements concerning our outlook for the third quarter 2022, management's expectations for our future financial and operational performance; our business and growth strategies; our expectations for our CarOffer business and acquisition synergies, as well as our potential acquisition of additional equity interest in CarOffer. The value proposition of our current product offerings and other product opportunities, the impact of the semiconductor chip shortage and other macro-level industry issues, and other statements regarding our plans, prospects and expectations. These statements are not promises or guarantees and are subject to risks and uncertainties, which could cause them to differ materially from actual results.\n\nInformation concerning those risks is available in our earnings press release issued after market close today and in our most recent reports on Forms 10-K and 10-Q which, along with our other SEC filings can be found on the SEC's website and in the investor relations section of our website. We undertake no obligation to update forward-looking statements, except as required by law. Further, during the course of today's call, we will refer to certain non-GAAP financial measures. A reconciliation of GAAP to non-GAAP measures is included in our press release issued today, as well as in our updated investor presentation, which can also be found on the investor relations section of our website.\n\nWith that, I'll turn it over to Jason.\n\nJason Trevisan -- Chief Executive Officer\n\nThank you, Kirndeep, and thank you to all those joining us today. We achieved exceptional results for the second quarter of 2022. The strength in our performance was driven by the acquisition of new dealers and reengagement of returning dealers to our foundational listings business, operational improvements for our CarOffer business and launch of our innovative Digital Retail product offerings. Combination of our foundational listings business, coupled with digital wholesale and digital retail allows us to create a transaction-enabled platform that holistically serves both our dealer partners and largest consumer audience.\n\nBefore I dive into the detailed results that were driven by this performance, I'd like to highlight the factors that continue to impact our customers and the broader global economy. In past quarters, we discussed the challenges the automotive industry faced as a result of the semiconductor chip shortage. However, with inflation, rising interest rates, concerns of a recession and changing consumer sentiment, dealers are further challenged with the reduction in demand for vehicle purchases. In addition to these factors, retail sales seasonality declines typically occur in the second half of the year.\n\nWhile we continue to closely monitor the impact of these macro factors, we feel confident that we have built a resilient platform geared toward providing our partners the highest ROI, the greatest flexibility and the most comprehensive product suite that is continuously innovating to support their unique business needs, which is paramount in both upward and downward trends. Despite these challenges facing our industry, we've achieved exceptional results and looking ahead to the second half of 2022, we're marching toward fulfilling our vision of creating the only platform where dealers can source, market and sell, and consumers can shop, finance, buy and sell. For dealers, we will continue to focus on growing engagement on the CarOffer platform and pioneering the digitally enabled automotive market with our Digital Retail offerings. For consumers, we will continue working to provide choice, trust and transparency to our listings business and expand the awareness of CarGurus' Instant Max Cash Offer or Instant Max, for short, as consumers look for the best value for their vehicle sales.\n\nWe're excited for the near- and long-term trajectory of our end-to-end transaction-enabled platform, and we will continue to adapt quickly and innovate to support both sets of customers. With that, let me walk through our second quarter results. As we highlighted at our Investor Day at the end of May, CarOffer's tremendous growth and sustained profitability is an incredible accomplishment for a company that is only two and a half years old. While still in its infancy, CarOffer has already captured 2% of the wholesale market and continues to gain share of the $400 billion addressable market.\n\nThis quarter, CarOffer continued to yield strong results as total revenue inclusive of our dealer-to-dealer and Instant Max Cash Offer businesses was $347.3 million in Q2, an increase of 506% year over year. CarOffer's profitability increased in the second quarter with total CarOffer adjusted EBITDA of $19.1 million in Q2, up 51% year over year, highlighting the strength and success of CarOffer's Matrix technology an asset-light model. Gross Merchandise Sales, or GMS, for the combined businesses, inclusive of dealer to dealer and Instant Max Cash Offer, was approximately $1.9 billion for the second quarter, up 101% from the previous year and remaining relatively flat quarter over quarter. Nevertheless, the CarOffer platform continues to gain traction among the dealer community with strong adoption in the second quarter.\n\nThe combined CarGurus and CarOffer sales team enrolled approximately 1,550 rooftops in Q2, bringing the total number of enrolled rooftops on the platform to approximately 12,400. However, increasing rooftops is only one vector of growth. And while we will continue to enroll dealers on the platform, we're applying greater focus to increasing each enrolled dealers usage of the matrix. We believe this will be achieved by further optimization of our operations and growth of our dealer sales manager team.\n\nDealer sales managers are an integral component to the setup of the matrix and evolve to be personal advisors, guiding dealers toward the most effective matrix rules, enhancing their experience and driving increased sales for them, which ultimately leads to increased utilization on the platform. While we are still in the early stages, our strategy has resulted in an increase in the number of dealers actively transacting on the platform month over month in Q2 and continuing in Q3, as well as an increase of over 20% unique buyers in the month of June compared to the month of March. As evidenced with each passing month, we are seeing nonfleet or non-rental company activity rise. As rental fleets experienced challenges of the chip shortage and consumer demand seasonality, we have witnessed unique trends quarter over quarter.\n\nIn the fourth quarter and into Q1, rental fleet leveraged our platform aggressively to grow their fleet sizes. However, as rental fleets continue to remain nimble to changing demand requirements, and prudent during times of macroeconomic uncertainty, we witnessed a change in buying patterns. As a result, when rental fleets quickly enter and exit our platform, we observed price swings, which can cause an imbalance and the prices dealers are willing to sell a vehicle and what a buyer is willing to pay. It takes time for the imbalance to normalize.\n\nAnd during this period, we tend to see more cautious dealer behavior. So while rental fleets will come on and off the platform based on their needs, we are acutely focused on the fundamental drivers of dealers transacting more and at scale, allowing us to build the business for the long term. Over time, we have seen dealers continue to adopt modern wholly digital ways of operating, replacing the historic and time-consuming physical see in-person approach to auctions. Our platform is helping to drive this shift, which is evidenced by the increased adoption and second quarter dealer-to-dealer revenue of $97.1 million in Q2, up 69% year over year.\n\nThis increase in revenue is attributable to an approximate 48% increase in transactions compared to the prior year, further highlighting the power of the CarOffer matrix as more dealers begin to transact at scale. Compared to the previous quarter, dealer-to-dealer revenue declined 8%, mostly due to an expected decrease in transportation revenue, as well as a slight decline in transactions. As we previously mentioned, last quarter's transportation revenue was higher than usual as we had assumed transportation for a large customer experiencing a material backlog of vehicle pickups. Accordingly, with less low-margin transportation revenue relative to transactions and reduced arbitration losses per vehicle, non-GAAP gross margin for our dealer-to-dealer business grew to 33.7% in Q2.\n\nIt's only been three quarters since we launched Instant Max Cash Offer, a direct-to-consumer channel for dealers, and we could not be more pleased with its results thus far. Since the launch, Instant Max has seen exceptional growth into new regions and product optimization. We now service over 85% of the U.S. population with a national rollout and brand campaign planned for later this year.\n\nInstant Max Cash Offer generated $250.2 million of revenue in the second quarter an increase of 55% quarter-over-quarter. This increase in revenue was driven by an overall increase in transactions tha t resulted from expansion into new geographies, as well as growth in existing geographies. Non-GAAP gross margin for Instant Max grew to 4.1% in the second quarter. Improvement in margin was driven by enhancement measures put in place to reduce arbitration losses per vehicle and offer optimization.\n\nWith Instant Max Cash Offer, we have the ability to test our offer competitiveness and transaction volumes and determine an efficient frontier in terms of growth and margin. As we scale the business, we will continue to test and analyze the relationship between margin and growth to gain market share in a prudent manner. Beyond operational enhancements, we're also acutely focused on delivering an excellent customer experience. Here is what our happy customer, Mike had to say about their recent experience with Instant Max Cash Offer, I would recommend this experience over and over.\n\nIt is so easy and you literally never have to leave home. They also offer direct deposit, which means no waiting for a check or a bank to clear funds. I had my funds within 24 hours after pickup. They come to your house and drive the car, truck away.\n\nYou're sent to all the paper via FedEx ahead of time, and they follow up with you, the whole experience was incredible in a time when customer service for most is not good. They went out of their way to make sure it was great. Easiest way to sell your vehicle out there hands down. As we leverage our marketing efforts, we're able to reach more consumers like Mike, and tap into the 95% of consumers who do not already view us as a primary place to sell their vehicle and are working to grow Instant Max to be the first choice for consumers nationwide.\n\nTurning to our foundational listings business, we're pleased that results were above our expectations for the quarter. The resilient high-margin listing business supports growing initiatives, which enable us to expand our capabilities for our dealer partners while remaining profitable. As we continue to focus on offering a platform that best serves our dealer partners, we're seeing greater adoption as total paying dealers grew to 31,143 in the second quarter, up 416 from the prior year and up 276 from the previous quarter. In the U.S., paying dealers were 24,488, up 538 compared to the prior year and 269 compared to the previous quarter.\n\nOf the total approximate dealer rooftops in the U.S., we have about 80% on the platform. And of those dealers, only approximately 72% are paying dealers, which gives ample runway for our sales team to not only expand our paying dealer base, but also increase the number of additional products per paying dealer. Second quarter performance was the result of dealer adds, existing dealers adopting additional products and improved retention throughout the quarter. While consumer demand softening, we reported an increase in monthly revenue from both new enrollments and upgrades of digital advertising products packaged as real-time performance marketing or RPM, for short, in comparison to the previous year.\n\nAs a result, U.S. quarterly average revenue per subscribing dealer or QARSD for short, grew approximately 4% year over year to 5,771. Internationally, total paying dealers for the second quarter were 6,655, up seven dealers compared to the prior quarter and down 122 dealers compared to the previous year. Dealer adds quarter over quarter primarily consisted of higher-paying franchise and independent dealers.\n\nAs we mentioned in the previous quarter, we launched our digital display product, otherwise known as RPM in the U.S. in both the U.K. and Canada, and we're thrilled to see a quarter-over-quarter increase in dealers adopting multiple products. Compared to the previous quarter, we saw an increase of 32% in dealers utilizing multi products in the U.K.\n\nand Canada. As a result of adding and retaining higher paying dealers and the increased product adoption, our international listings revenue increased year over year, validating that dealers in both markets find value across our offerings. The increase in revenue resulted in international QARSD for the quarter of 1,533, a slight increase of 3% compared to prior year. Our listings performance in both the U.S.\n\nand international markets is indicative of our team's success in establishing increased adoption of our additional offerings, while providing superior service and ROI to our current dealer partners, ultimately improving retention and growing monthly recurring revenue. As macro headwinds will eventually subside, we are poised for even greater success with our dealer partners as we expect that our improvements in retention, product innovation and ROI will only further strengthen our foundational listings business. With 90% of dealers expecting to continue or accelerate digital retailing at their dealership, we will continue to focus on product innovation, which enables dealers to service consumers who are looking to do more online. Our Digital Retail products not only service dealerships that have different needs and capabilities but also enable dealers to compete more effectively.\n\nFrom the consumer perspective, our Digital Retail offerings serve those who are looking to do more online and cater to each consumer's preferences so they can pursue a self-selective journey for their vehicle purchase. Not to mention, consumers utilizing our Digital Retail offerings have a two times greater satisfaction than a traditional lead. The launch of digital deal in Q2 was a critical step on our rapid path to fully digital retail transactions to meet the needs of our customers. Digital deal allows the consumer to do even more online with trade-in estimates, prequalification or hard full financing and deposits.\n\nConsumers can build a near penny perfect deal with dealer or vehicle-specific finance and insurance products and then place a deposit on their vehicle of choice, all while customizing their online to in-person experience. Digital deal is a dealer aligned way for consumers to transact providing both dealers and consumers flexibility in the car shopping process. Consumers are seven times more likely to make an appointment with a dealer if they go through an online checkout process and 60% of consumers who place a deposit purchase their vehicle through the digitally enabled dealer, providing dealers with the efficiency and ability to sell more with less investment. As this program is highly customizable, dealers can sign up for what works well within their specific market and consumer base.\n\nSince our formal launch of digital deal in May, we've enrolled 435 dealers across 47 states, representing a two times faster product adoption rate when compared to the average of other CarGurus listings and digital retail product launches. Dealers utilizing digital deal drove a greater than 75% increase in digital deal leads quarter over quarter. Of those leads, nearly half for high-value leads, meaning the lead included prequalification hard pull deposit and/or an appointment with the dealer. With over 400,000 digitally enabled listings on our platform today, over 60% of all CarGuru researches now include digital deal results and dealers have seen a two times increase in digital deal leads as a percentage of their total CG email lead volume.\n\nMore notably, shopper sentiment demonstrates increased satisfaction for consumers utilizing Digital Deal with an 81 Net Promoter Score year-to-date. As such, dealers are embracing a newer way of attracting consumers through online offerings and consumers are becoming more accepting of transacting online with dealers through our digital retail products. Further, Digital Deal allows CarGurus to power more steps of a dealer consumer transaction, setting the groundwork for multiple monetization paths forward in a capital-light way. Partnering with dealers as opposed to competing with them provides no inventory risk or servicing requirements, growing our monetization potential for Digital Retail and allowing us to both build upon and expand accessibility nationally.\n\nOverall, it's been an outstanding year so far for our business, and we're pleased with our results. Despite ongoing macro challenges, we demonstrated the excellence of our business model through our ability to create a listings platform that continues to attract paying dealers, continued innovation with the launch of Digital Deal, increasing unique dealer activity on the CarOffer platform and our ability to enhance and optimize our business operations, resulting in improved margins. Moreover, the strength of our profitable foundational listings business enables us the flexibility to build out our new transformative growth vectors while continuing to maintain strong unit economics. While it's easy to focus on the business quarter over quarter, we are creating a platform for our customers that will serve them over the long term as evidenced by our increased focus on dealer relations, continuous optimization and investment in consumer awareness.\n\nWe are concentrating on growing our newer businesses economically in their own right, while focusing on maintaining overall profitability. Like many others in the tech industry, we're closely monitoring our growth and profitability. Moreover, we continue to have remarkable control over our spend and like our ability to adjust marketing spend during the pandemic, we will be quick to adapt. Our thoughtful and judicious approach gives us confidence in our plan, but we remain prudent as we monitor the potential changes in the macro economy and are prepared to adjust our strategy and outlook, if necessary.\n\nIt is through the combination of our foundational listings, digital wholesale and digital retail offerings, we have created an automotive ecosystem that serves both our dealer partners and the largest consumer audience through nearly every aspect of the automotive buying and selling journey, a platform where the sum of the parts are greater than the stand-alone for not only us but also our customers. Now before we review our financial results, I would like to share some news. Scot Fredo, our chief financial officer, has made a difficult decision to pursue another opportunity. Scot's been with CarGurus for six and a half years and has been instrumental in leading us through our IPO, as well as being a thought leader in our financial and strategic growth as we've scaled and acquired new businesses.\n\nIt's been an honor and privilege to work with Scot all these years and I greatly appreciate the impact Scot has had in our business and community and the tremendous work he and his teams have done to set CarGurus up for an exciting road ahead. While the decision to move on was a difficult one for him to make. I know he'll do so as a continued supporter of CarGurus, proud of the successes we've celebrated and confident in our bright future. Please join me in thanking Scot for his leadership and contributions.\n\nWe wish him all the best in his next chapter. With that, I'll turn it over to Scot to discuss our financial results.\n\nScot Fredo -- Chief Financial Officer\n\nThank you, Jason. It's been amazing working with you, Sam, Langley and so many incredible CarGurus colleagues over the last six and a half years, and the future is bright for CarGurus. I'm so grateful for everything I've experienced during my CarGuru's tenure, and I'm excited to see the continued evolution and growth of the company. And now I'll provide a detailed overview of our second quarter performance, followed by our guidance for the third quarter of 2022.\n\nTotal second quarter revenue was $511.2 million, up 135% year over year and within our most recent updated guidance range provided during our Investor Day in May. Marketplace revenue was $163.9 million for the second quarter, up 2% from $160.5 million in the prior year and up slightly from the prior quarter. The increase in marketplace revenue compared to the prior year was primarily due to the increase in U.S. paying dealers utilizing our subscription listings products.\n\nAs a reminder, marketplace revenue also includes revenue from our digital retail products such as Area Boost and Consumer Financing as well as OEM advertising. While we did see tremendous success with the launch of Digital Deal this quarter, macroeconomic conditions may reduce the amount of consumer loan originations and may impact OEM advertising on our platform, creating potential offsets to our listings revenue that has been growing and which we expect to grow in the second half of the year. Wholesale revenue was $75.9 million for the second quarter of 2022, up 42% from $53.5 million in the prior year. A meaningful portion of the year-over-year growth in wholesale revenue is attributed to an increase of dealers transacting on the car for platform as they become more comfortable using the car for matrix.\n\nCompared to the previous quarter, wholesale revenue declined 17%. The decrease in wholesale revenue is mostly due to the decline in transportation revenue that Jason discussed earlier. Lastly, product revenue generated $271.4 million for the second quarter, up 7,087% from $3.8 million in the prior year and up 54% from the previous quarter. The increase in revenue from the prior quarter is primarily due to transaction volume growth associated with Instant Max Cash Offer, which generated $250.2 million in revenue, roughly $3 million ahead of our most recent updated guidance range.\n\nI will discuss our expenses and profitability on a non-GAAP basis, which backs out our stock-based compensation expense, amortization of acquired intangible assets, acquisition-related expenses and net loss or net income attributable to redeemable noncontrolling interest. Second quarter non-GAAP gross margin was 38% compared to 77% in the year-ago quarter and 44% in the prior quarter. The change in non-GAAP gross margin quarter over quarter is primarily due to Instant Max Cash Offer transactions, which are accounted for on a gross revenue basis. Despite the contraction in non-GAAP gross margin on a consolidated basis, we are extremely pleased with the improvements in margin in our digital wholesale businesses.\n\nNon-GAAP gross margin for our dealer-to-dealer business was 33.7%, up 340 basis points from 30.3% in the previous quarter. And similarly, non-GAAP gross margin for our Instant Max Cash Offer business was 4.1%, up 120 basis points from 2.9% in the previous quarter. Total second quarter non-GAAP operating expenses were $135.6 million, up 38% year over year. Non-GAAP sales and marketing expense increased 46% year over year to $91.5 million and 9% compared to the previous quarter.\n\nNon-GAAP sales and marketing expense represented 18% of revenue, down from 29% of revenue in the year ago period. The increase in marketing spend in comparison to the previous year is primarily a result of our increase in performance marketing spend year over year. We also increased our brand marketing spend in the first half of 2022 as we develop and release new content to increase awareness for our collective offerings. We remain thoughtful with both our performance marketing and brand spend as we continue to grow the business and increase brand awareness.\n\nAs such, we do not anticipate material incremental marketing spend increases for the second half of the year. We continue to monitor marketing investments carefully and adjust real time as we have done in the past evaluating the effectiveness of each additional dollar spent. Our second quarter non-GAAP product, technology and development expense grew 18% versus the year ago period to $25.2 million. Similar to previous quarters, the increase is primarily due to an increase in employee-related costs as a result of 70% increase in headcount and continued investment in our technology to grow digital wholesale and digital retail.\n\nWe generated non-GAAP operating income of $57.7 million, representing a non-GAAP margin of 11% and we generated $61.2 million consolidated adjusted EBITDA for the quarter. Both figures were roughly $2 million ahead of the high end of our most recent guidance range. Non-GAAP diluted earnings per share attributable to CarGurus, Inc. was $0.32 for the second quarter, $0.02 above the high end of our most recent guidance range.\n\nOn a GAAP basis, we generated second quarter gross margin of 37% compared to 77% in the year ago period. The contraction in gross margin is primarily due to the growth of Instant Max Cash Offer. We incurred total operating expenses of $164.3 million, up roughly 27% year over year. The increase in operating expenses was primarily driven by additional headcount and associated expenses from the CarOffer acquisition.\n\nSecond quarter GAAP operating income decreased 39% year over year to $23.5 million. Second quarter GAAP net income attributable to CarGurus, Inc. totaled $18.1 million and second quarter GAAP net loss attributable to common shareholders was negative $10.3 million. We ended the second quarter with $368.2 million in cash and investments, a slight decrease of $6.8 million from the end of the first quarter.\n\nWe used $5.5 million in cash from operations in the second quarter and $9.9 million of non-GAAP free cash flow, which includes capital expenditures and capitalized website development costs of $4.4 million. Cash used in operations in the second quarter was primarily driven by an increase of $52 million of accounts receivable compared to the previous quarter, which offset cash generated from profitability in our operations. As Jason touched upon at the beginning of our prepared remarks, there are several macroeconomic challenges impacting the automotive industry coupled with typical wholesale seasonal softness, which is a leading indicator for retail sales seasonality occurring in the second half of the year. As a result, we are forecasting headwinds to our dealer to deal with business.\n\nSimilarly, despite the tremendous growth to date for Instant Max Cash Offer, we remain prudent balancing growth and profitability. With these factors in mind, we expect our third quarter total revenue guidance to be in the range of $460 million to $490 million, third quarter revenue guidance for Instant Max Cash Offer to be in the range of $225 million to $245 million. Third quarter non-GAAP consolidated adjusted EBITDA in the range of $44.5 million to $52.5 million, and third quarter non-GAAP earnings per share in the range of $0.25 to $0.28. This past quarter saw increased profitability from both positive performance and cost savings as planned second quarter expenses shifted into the second half of the year.\n\nAs a result, we now anticipate that the third quarter will likely be the trough for our profitability guidance figures and while we will prudently reinvest in our business for future growth and expansion, we expect to see continued improved margins. Finally, in the coming months, we will be determining our next steps in our acquisition with CarOffer. As a reminder, we have the ability to purchase up to an additional 25% at seven times CarOffer's trailing 12 months gross profit as of June 30, 2022. We are in the process of making this decision in partnership with our board of directors and CarOffer and look forward to sharing the decision at the appropriate time.\n\nWhile macroeconomic challenges faced by our dealer partners and consumers continue to be at the forefront of our minds, we are proud of the excellent financial results for the quarter. We continue to intelligently invest in our technology, products and customer service, which enables us to be the only full transaction-enabled platform and a stronger, more robust partner to our customers in challenging economic times but even more so in better times. As always, our path forward would not be possible without the extraordinary efforts of our employees globally. I would like to thank them for their continued dedication and commitment as we innovate and transform the automotive industry.\n\nI am grateful and honored to have worked alongside our talented employees for six and a half years as we grew and transformed our business. And while it's not easy to leave CarGurus, I know this team will continue to drive our vision forward to create an end-to-end transaction-enabled platform for dealers and consumers. With that, we'll open up the call for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Chris Pierce from Needham. Please go ahead.\n\nChris Pierce -- Needham and Company -- Analyst\n\nHey, good afternoon. How are you guys doing? Just a quick question on the wholesale revenue. You talked about Q2 revenue down versus Q1 because of the increased transportation revenues in Q1. But can you kind of talk about how Q2 versus Q4 2021 because it's down versus that mark as well.\n\nAnd then the rental car part of it, does that play a part in the Instant Max Cash Offer guide as well because they were buyers because that's backed by CarOffer as well. So they were buyers there as well. And there's -- they were kind of higher bidders. So there will be less of that bid going on right now.\n\nSo that kind of informs Instant Max Cash Offer guide as well? Thanks.\n\nJason Trevisan -- Chief Executive Officer\n\nSure. Hey, Chris, it's Jason Trevisan. I'll start, and then I'll probably have Sam add a little bit. So yeah, we -- in both Scot's comments and mine, we listed a few of the reasons for some of the sequential trends in D2D, and one, as you pointed out, was the transportation revenue.\n\nOther factors were around fleet activity, which we mentioned, as well as some seasonality and some other things related to revenue mix. Fourth quarter in particular, which you referenced, did have across the industry very high levels of fleet activity. And so that's specific to that comp. One of the factors at play there, and that's also why the comments we made about the value of active dealers being on the growth trajectory that they are is so germane and relevant.\n\nAnd to your second question, and then I'll offer Sam to add anything. Yeah, the -- any time you have active bidders, that's going to create a more liquid C2D environment. So when a dealer completes a bid matrix to buy a car, they're not specifying if they want to buy a C2D car or D2D car, but they are obviously putting in a price. And so if the fleets per your question or if any set of dealers were to come in and put in very high bid matrix offers, and that's going to allow us to make hire, more compelling offers to consumers in Instant Max, which will lead to more transactions.\n\nSo there is a flow-through in that, although it's sort of a rising water level, it's not a group saying, I only want to buy a C2D. Sam, would you add anything on either of those?\n\nSam Zales -- President and Chief Operating Officer\n\nI think you hit it, Jason. I think, Chris, the only thing I'd add to it is how do we diversify in the future. And I think that's a really important strategic effort for our business going forward. The last four months, more and more buyers have transacted on the platform each month.\n\nAnd I think we quoted the 20% increase from June versus March. So even into July, we're seeing that increase. That helps you when the rental fleets go in and go out, become diversified and allow you to continue to grow both the D2D and C2D business. The challenges in the macro environment when buyers and sellers are a little more skittish.\n\nThey're doing less transactions per dealer than they did previously. And so our effort is continue to diversify, get more and more of that buy side activity on the platform so that the rental fleet doesn't become a concentrated position for you and their ins and outs of the market when you know that they fulfilled their fleets for the big seasonal transactions in the travel industry in the summer, they slow down their purchases, you're diversified and have more of those buyers and we're happy to see that number growing every month for the last four months.\n\nChris Pierce -- Needham and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Brad Erickson from RBC Capital Markets. Please go ahead.\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nYeah, thank you. So first up, just on the wholesale weakness, maybe if we could set aside the transportation comp you mentioned. Just curious if you feel like you're maybe getting squeezed out during this period versus some of your larger competitive channels the dealers already worked with. And maybe like what factors are in your control to retain and potentially recapture some of that volume from these dealers if we set the industry headwinds aside?\n\nJason Trevisan -- Chief Executive Officer\n\nThanks, Brad. I'll speak to the first part you mentioned, and then Sam can talk in much more depth about how we're retaining and growing customers, which you just shared some of the data on. No, I don't think we're getting squeezed at all. I mean I think if you look at the factors in the market as retail demand comes down, that puts pressure on wholesale activity.\n\nAnd over the course of the last couple of months, you've seen SAAR estimates continue to tick down on weaker consumer demand from higher prices. The fleets were very active buyers in the winter and into the spring and have pulled back a bit because of their own seasonality and their own fleet aspirations. And the other thing, too, that it's an important part of that is when any exogenous factor raises prices in market like a wholesale market, whether it's platform agnostic, it takes a little while for that balance to then readjust. Because you had other sellers who were used to certain high prices, and they don't adjust as quickly as a big group that may move quickly.\n\nAnd so it takes a while for them to lower their prices to meet the bid ask spread and get transactions flowing. And then the last one would be seasonality as we are in the summer here. So no, I mean, we continue -- we measure NPS. I'm sure Sam will get into that, so I won't go into it.\n\nBut we continue to have every signal in saying that from a customer level perspective, engagement and satisfaction and with our platform is very high. Sam?\n\nSam Zales -- President and Chief Operating Officer\n\nJason, I'd just add -- and Brad, thanks for the question. I think you see that in enrollments, but now the number I just mentioned beforehand, more and more buy activity from more and more buyers. So what you've got to do when you've got an opportunity to serve more of your customers is give more of your buy base a chance to participate and transact. And that's what we've seen over the last four months.\n\nThe sell side has always been diverse, obviously, because of bringing in the C2D inventory, you're bringing in inventory that's gold to the dealers. They've never seen that consumer inventory to get more and more buyers to have a C2D transaction, you have to have more buy activity. And so that's what we're -- I think we're bringing in a differentiated offering to those dealers not just on the instant trade platform but bringing in that C2D volume in thousands of transactions that they're never seeing before. And I think that's what's leading to that diversification.\n\nIt's not just making buyers, onetime buyers, but ongoing buyers and more of them being able to transact on the platform. So we're thrilled with those numbers. We've got to keep that growing. So the concentration doesn't hit us as it does in some of those cases with the rental fleet.\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nGot it. That's great. Thanks. And then maybe just a follow-up.\n\nI guess when you think about the volume headwinds that are going on right now in the D2D business, do you think those are sort of disproportionately going on at dealers where you added more recently? Or are you seeing it in the more mature part of your book of business? Or are you just seeing it sort of broadly across the dealer customer base?\n\nSam Zales -- President and Chief Operating Officer\n\nI think I'd tie that more to the macro environment, Brad. Wholesale and retail pricing at all-time highs. It makes a buyer or seller skittish, as Jason said, it takes a while to recalibrate that. Consumer demand is softening.\n\nInterest rates are at the highest they've been, recession looming or recession concerns looming. And so I think you're just seeing it in general, we're getting more buyers to transact but each of them doing a little less transaction activity, which means it's a macro environment issue, and they're just being cautious about that transaction volume.\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nYeah. That's helpful. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Marvin Fong from BTIG. Please go ahead.\n\nMarvin Fong -- BTIG -- Analyst\n\nGood evening. Thanks for taking my questions. [Inaudible] I drill down a little bit more into what you're saying about the rental car agencies and their impact on CarOffer. So -- as far as you're looking into 3Q, I know there's now seasonality and that we're trying to get our arms around.\n\nBut how would you just characterize their activity in the second quarter and what you're expecting in the third quarter? Is this kind of the -- are they now at a normalized level? Or are they perhaps pulled back more than you think they would in a normal environment. Perhaps you could just help us just get our arms around what's implied in the guidance? And then I have a follow-up.\n\nSam Zales -- President and Chief Operating Officer\n\nThanks, Marvin, it's Sam Zales. Thank you. I think you're seeing, if you're watching the rental fleets and how they're thinking about things, some have fulfilled a small bit of demand from the OEMs, from new distributions. They hope for that, but that's going to be a depressed state, I think, over the next period of time.\n\nThey fulfilled a lot of that demand through us in the earlier stage of the year, which prepares them for the travel season. And yes, seasonally, that will slow down. I think that happens in the market traditionally over the next set of months. And so we're cautious on that front.\n\nAnd I think they're balancing their approach to new versus used to see if anything breaks through on the new side. Certainly, with pricing as high as it is, there's some caution there on that front. And -- so we're being thoughtful that if we keep growing the buyer base in the nonrental arena, we're in good shape, and we can continue to grow the transaction volume long term. And so we don't want to be caught in a concentration scenario.\n\nWe fulfilled very nicely over the past year, but we will continue to look to more and more of these buyers getting on the platform to fulfill that volume that we want long term. So I hope that answers your question. It's new, used. It is seasonal, and it is an environment with wholesale pricing as high as it is all those factors impact the wholesale arena, and we think we're in better shape when we have more and more of those buyers coming on the platform and transacting.\n\nMarvin Fong -- BTIG -- Analyst\n\nRight. Gotcha. And then -- my follow-up is probably a related question. The enrolled dealers, the count, I guess, or the net additions grew a little slower than prior quarters.\n\nSo should we attribute that also the sort of seasonality and that this is something we should get used to where in the second quarter, they're already sort of gearing up for a weaker or seasonally slower second half of the year? Is that how we should imagine the pace -- the cadence of dealer additions on a year-in year-out basis? Or should we think about being a little more linear in normal times? Thanks.\n\nSam Zales -- President and Chief Operating Officer\n\nYeah. Thanks, Marvin, for the question. It really allows us to distinguish enrolled versus active dealers. And you're seeing a strategic shift in us just to the point of diversification of the buyer activity from enrolling more and more dealers on the platform, I'm not saying it will be -- it will stop.\n\nIt will slow down because we have moved toward dealer engagement. That is -- how do you get more and more of those dealers once enrolled on the platform to start the buying process. We've said that it's a completely new and innovative capability with our matrix. It's a purchase process that works like a stock market.\n\nIt's buying products, site unseen, and that takes an effort in those first 25, 30 days to get those accounts to activate their matrix, start the buying or selling process and have that great success, Jason talked about in IMPS that we have with those customers to get them engaged and activated in the program. So you see the shift from just acquiring customers to now the focus on engagement, what we call our dealer sales managers to focus on getting each of those dealers who were enrolled on the program active and purchasing and transacting to see the incredible benefits of sourcing and selling vehicles through this platform. So you'll see us shift that effort to the diversification of activity and transactions, both buying and selling inside that base rather than saying how can we get 30,000 dealers onto that platform. There are many small dealers who wouldn't find value because they're not -- they don't have the sophisticated technology to do that.\n\nSo you're seeing a move from enrollment to engagement and transaction volume, and I think you'll see that as we go forward.\n\nJason Trevisan -- Chief Executive Officer\n\nAnd I think I'll just add one thought. I think that's a very common exercise in this industry and a lot of other companies in the wholesale arena have large field forces that are out trying to engage dealers and it's just the nature of wholesale. So we're doing it in a very efficient way. It's very similar to how CarGurus has grown up, CarOffer does it in a very efficient way rather than having a big field sales force.\n\nBut it's engagement that you see needed from most of the providers, if not all.\n\nMarvin Fong -- BTIG -- Analyst\n\nGreat. That's very helpful. Thanks, Scott and Sam -- I mean, Jason and Sam. And I did want to say Scott, good luck on your next endeavor.\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from the line of Tom White from D.A. Davidson. Please go ahead.\n\nTom White -- D.A. Davidson -- Analyst\n\nGreat. Thanks for taking my questions. Maybe just a quick follow-up on the last one. Can you just give a little bit more color on how you're going to get the enrolled dealers to use the matrix more? Is it purely just kind of outreach and communication? Or do you guys need to add new product features that will maybe make it more attractive for dealers to use it for different types of inventory.\n\nAnd then just as sort of a follow-up. Any like sense you can give us like of your average customer in that business like what percent of their total wholesale buying and selling do they do through CarOffer? And where do you think you could hopefully get to that percentage in the next few years?\n\nSam Zales -- President and Chief Operating Officer\n\nThanks, Tom. Sam Zales here. I'll take it and see if Jason wants to follow up. There's both a technology and an account management process that we focus on.\n\nSo you heard the investment in what we call a dealer sales manager as a CarOffer. They're experts in knowing the wholesale arena, they're speaking to experienced buyers on the -- buyers and sellers on the other side, merchandisers on the other side of the dealer equation. And quite honestly, our ratio of accounts to reps was not quite aligned over the last several months of the incredible growth of the business. I want to take a minute just to stop and remind everybody, we're a two and a half-year-old business at CarOffer.\n\nThe only pure-play profitable digital wholesale business in the market and a company that's grown in two and a half years to this incredible size it is. So you're asking a great question, which is -- how do you focus on the people side of that. We almost outgrew the operational capabilities we had in that period of time, and we've rightsized that with more investment in those dealer sales managers because their job is to analyze the performance and the opportunities those dealers have of taking a look at what price they can sell those vehicles for on the CarOffer platform and what profit they make on those versus keeping it in a retail environment and hoping in a depressed consumer activity period, whether a consumer will buy that vehicle for a slightly higher price. So they are doing that, analyzing an engagement process to move and enroll dealer to an active, aggressive user of the matrix.\n\nAnd as I said before, that does take a bit of time to utilize this new system and a different kind of purchasing process to get used to that matrix buying process that typically takes the first 30 days of an onboarding in the training and use of that tool set. And so we're investing on that front. Second is sort of the technology, as you said, yes, a constant investment in this incredible matrix capability, there's a matrix analyzer function that allows a dealer to see through the machine learning, what better bids they should be making, what they're missing out on, on buying certain vehicles in their market. Think of combining that with our consumer data at CarGurus to say we're seeing more interest in this type of vehicle that make and model in this geography.\n\nHere's something you can use and it's downloading that data in a way that makes it very easy for the dealer to use it, a wizard to use their technical capabilities more effective on the matrix. So it's a combination of those two. And we think those are the right investments to make, and that's why you see this balance of growth and profitability where we saw a better gross margin to the CarOffer business in the second quarter. We're going to keep investing in the right way to optimize that kind of revenue and profit growth to the business.\n\nWe'll continue to look at share of wallet. To your other question, we haven't shared that data. We're researching it. We're very proud of how quickly we've become an important part of the buying and selling activity for our dealers, and we're doing that through our own research and we'll be looking at that more thoughtfully on a gross basis for the market as we get out of 2022.\n\nTom White -- D.A. Davidson -- Analyst\n\nOK. That's great. Sounds --\n\nJason Trevisan -- Chief Executive Officer\n\nSorry. Go ahead.\n\nTom White -- D.A. Davidson -- Analyst\n\nOh no. [Inaudible]\n\nJason Trevisan -- Chief Executive Officer\n\nI was just going to say to add on the wallet share point. If you just -- if you think about it back of the envelope, digital wholesale is in the very early days, and the share shift from physical is growing, continues to grow and will for some time. And in the last two years or two and a half years within digital, needless to say, we've gained a lot of share, but it's still early. And so if we're low -- if digital is still single digits of the market.\n\nAnd so we as a platform are some fraction of that that among the adopters that we have, our share of wall with them is above that low single digits, but it's still got an extraordinary runway because we're such early days. And what gets us particularly excited is that we have a lot of examples where we are a really compelling material percentage of dealers, wholesale purchases or wholesale sales and we even have some dealers who are changing their strategy to leverage the flexibility and the capability of the matrix and seeing tremendous growth as a result of it. So we see both the potential of the heavy users and what they can accomplish with it, but we also have a relatively low starting point that we have right now because of the early days of the market, we see a huge runway.\n\nTom White -- D.A. Davidson -- Analyst\n\nGotcha. Appreciate it.\n\nOperator\n\nThank you. Our next question comes from the line of Naved Khan from Truist Securities. Please go ahead.\n\nNaved Khan -- Truist Securities -- Analyst\n\nHi, thanks a lot. A couple of questions for me. Maybe just on the dealer sales manager. You guys mentioned you were understaffed, and I'm thinking if I look at the expense line, is that fully -- is that additional hiring that you need to do? Is it contemplated in the back half guidance of sales and marketing kind of being flat with the Q2? Or how should we think about the allocation between hiring versus ad spend? So that's one.\n\nAnd the other question I have is just on the gross margin for IMCO non-GAAP, I think gross margin was 4%. How sustainable is that going forward? How should we think about that? Thank you.\n\nJason Trevisan -- Chief Executive Officer\n\nSam, do you want to take the first part, and then I'll speak to Instant Max gross margin?\n\nSam Zales -- President and Chief Operating Officer\n\nSure. Yes, Naved, thanks. I don't think I said understaffed. I just said the ratios we wanted were not optimized.\n\nAnd I think this is to the point earlier on enrollment versus engagement, we -- with that shift to enrolling thousands of dealers on the platform to now recognizing the work goes into the engagement on the platform and utilizing it. We have tremendous, tremendous opportunity to turn those folks who are more of the hunters into farmers and we're doing that right now and making it a tremendous success for us. So without adding any resources at all and then to make sure the ratios as we use those technical tools I talked about earlier and the time in that early engagement to optimize we're doing so. I think I'll remind everybody, this is the lowest least capital-intensive digital wholesale player in the market.\n\nWe're profitable and extremely so at CarOffer. I'm really thrilled to see that and getting more so as we talked about our results in second quarter. And we're going to continue to do that with this low expense base and crank of what we're doing. I'll let Jason talk a bit about margins, but I couldn't be more proud of coming out of first quarter saying there was some work we needed to do on gross margin in those two -- in the second quarter.\n\nAnd both on IMCO and D2D our work to focus on profits and improve the gross margin of both of those businesses by hundreds of basis points was a really thrilling result of great and focused efforts. So Jason, I'll let you share it in detail and I can add on if necessary.\n\nJason Trevisan -- Chief Executive Officer\n\nYeah, thanks. You touched on some of the things. But yes, we do think it's sustainable. I think the better way to think about it or the better adjective is that it's controllable.\n\nWe're nine months into Instant Max or nine to 12 months in into Instant Max Cash Offer and any real volume. The market is evolving during that time. Unit prices have probably had more flex and volatility than normal during that period. And so every day, we're testing and conversion rate and offer price are two of the things of the many that we're testing.\n\nAnd as Sam said, we're so proud that we went into this quarter saying that we felt we could control it and that we could improve it, and we did exactly that. And in future quarters, as we learn more, we may decide to toggle slightly differently on the margin and growth targets because those two things are inextricably linked. But all the while in the background, we're improving conversion and just making it a more efficient machine.\n\nNaved Khan -- Truist Securities -- Analyst\n\nMaybe just on the first question that you answered. Can you maybe share with us some of the improvements you see through the dealer sales manager in the accounts that they touch and they have more sort of -- they spend more time on how much improvement you've seen? And what percentage of accounts do you see where the opportunity exists to kind of optimize engagement or drive it higher?\n\nSam Zales -- President and Chief Operating Officer\n\nYeah, I think I can point to a couple of general approaches on that, Naved. I think, one, the use of the hunting team to go back and initiate work with accounts that have been enrolled but not yet fully activated their accounts. Remember, in this process, when you sign 12,000-plus dealers to a platform, in many cases, it's a large, large group or a national account where purchasing happens decentralized. So you're going to get one or two stores that might test the platform first and have great success with it, but getting to the rest of the group and getting the rest of the stores involved and active on the program, you need to make the outreach and make sure that happens.\n\nSo we converted a set of our hunting team, the enrollment team to going back after those accounts and saying, look at your other stores that are already having that success, let's start that process of training, initiating the use of the platform, getting used to the matrix buying process to get your program up and running. And that has sustained exactly what I talked about earlier, the last four months, an increase in number of buyers transacting on our platform every single month for the last four months. So that tells me the results of an attack plan that focus on both the enrollment, engagement, training and activity these dealer sales managers can do to optimize the platform for those customers. I hope that makes sense.\n\nOperator\n\nThank you. Our next question is from the line of Ralph Schackart from William Blair. Please go ahead.\n\nRalph Schackart -- William Blair -- Analyst\n\nThanks for taking the question. Last call you talked about increasing price on the buy and sell fees, I think also in inspection and as well. Just curious how those -- these were absorbed on the platform? What you've learned from that and sort of thoughts about your ability to continue to think about price going forward? Thanks.\n\nSam Zales -- President and Chief Operating Officer\n\nThanks, Ralph. I think the -- I don't think we saw any impact to any dealers not using the platform. That fact that more and more buyers are transacting on the platform tells me our price point is where it should be in the market. I don't think we're going to continue to rise it at any point in the near term.\n\nI think it's exactly where it should be. I think we're creating tremendous success in a very efficient way. We're an efficient business because we're profitable, and our customers are making more and more money on these transactions, certainly from the D2D side, but also because we're bringing in the Instant Max inventory that they've never seen before. On inspections, it's a pass-through cost.\n\nIt's not a margin process for us. I will tell you that, as Jason alluded to, we are improving the margin of those businesses. We're very proud of those results -- to gross margin improvement in both D2D and C2D in the last quarter. That happens because we're improving our inspection processes.\n\nWe're adding more and more of these partnerships in the light capital model likewise on transportation -- and arbitration was a huge success for us last quarter. We knew we needed to attack it. We brought in an industry leader to focus on arbitration and that led to percentage of transactions arbitrated decreasing. We're already at -- we think is the market low rate on that front, and we continue to decrease it over time.\n\nThe loss per vehicle in arbitrated vehicles went down. So all of that leading to the margin improvements. Inspection is one that we'll continue to invest in, but I don't think we'll overcharge a price point for it. We just want to have great customer satisfaction, get more and more dealers to transact on the platform.\n\nI think if you look at our average selling price, these vehicles are $25,000 and up, the high 20. We think our price point is probably extremely competitive and the transaction fee we're charging. But all in, this is this balance Jason said, of growth and profitability. We want to be good to our customers on a long-term basis and run the continued tremendous profitable business at CarOffer.\n\nRalph Schackart -- William Blair -- Analyst\n\nGreat. Thanks, Sam.\n\nOperator\n\nThank you. Our next question is from the line of John Colantuoni from Jefferies. Please go ahead.\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nThanks for taking my question. I just have one. I had a question about arbitration. It looks like it grew about 50% sequentially in the quarter despite flat GMV and units.\n\nCan you just walk through the puts and takes driving that expansion in arbitration? And when we should expect the measures that you're implementing to help mitigate some of the unnecessary arbitrations starting to materially drive that lower over time? Thanks.\n\nSam Zales -- President and Chief Operating Officer\n\nJohn, thanks. What we look at, and I think this is really important is the arbitration as a percent of transactions. And that is at a low point in the business. It's gone down three consecutive months through second quarter, continues to go down overall and that's the critical factor to our business is, one, it's shrinking over each month, which is really important.\n\nNumber two is our loss per vehicle in our arbitration. This is important because we do some spec buying when you think a consumer comes in, we talked about IMCO, there are times that we'll say, let's take a shot at the purchase on this vehicle if we don't yet have a buyer. We'll create a transaction out of that as well. And our loss per vehicle has gone down over this quarter versus last.\n\nAnd I think that's what the measure is when you look at our overall profitability of those two businesses, D2D and Instant Max Cash Offer, that's why you see the percentage gross margin improving from first quarter to second quarter. So that's how we look at the numbers. And the best I can answer for you, we're really happy with our percent of transactions and arbitration. As I said, we brought in an industry leader to lead that for us.\n\nAnd I think you're going to see continued focus on a good gross margin to those businesses, which drives our overall profitability at CarOffer and really pleased with what we did from first quarter to second quarter.\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question is from the line of Nick Jones from JMP Securities. Please go ahead.\n\nNick Jones -- JMP Securities -- Analyst\n\nThanks for taking the questions. I guess on the listing business is expected to grow in the back half, how should we be thinking about the traffic declines? I mean how much of this is kind of a function of really kind of targeting qualified leads versus kind of softness in demand?\n\nJason Trevisan -- Chief Executive Officer\n\nYup. Thanks for the question, Nick. It's Jason. It's a function of -- it's a continuation of what you've heard us talk about for the most part, which is our focus on targeting low funnel lead, low-funnel consumers who are high-quality leads.\n\nAnd yeah, there's certainly some element, which is in a lower demand -- consumer demand environment, you're going to have less lookers, browsers, and the people who are engaging with our platform are probably going to be more serious. And so especially as we move to launching things like digital deal where I mean that's a step function change in the quality of the lead, as you heard us give some stats around that. And we don't need a lot of -- you can replace a lot of lower quality leads with a much smaller number of digital deal leads and you're still going to have the dealers better off. I think another good indicator of sort of the proof of that is that we've had extremely low dealer churn, and we even had positive dealer counts.\n\nAnd so both of those are I think, indicators that dealers are valuing what we're delivering to them, and that's not just lead volume, lead quality. And I think as dealers embrace digital retail more and all of the features associated with digital retail more. As we've talked about, they've gotten hooked on this idea that they can sell just as many cars with fewer salespeople, be much more profitable dealers. And so they love the notion that we would have higher quality leads that we're sending to them.\n\nNick Jones -- JMP Securities -- Analyst\n\nGreat. And a follow-up on Digital Deal, you're getting kind of insight into how consumers are thinking about the price point of [Inaudible] buy a car. I mean, we saw some data come out last week, household debts up, autos are big culprit of that. I mean is there a risk that consumers are essentially don't have the money and the pull-through can really, I guess, cars is going to shrink rapidly particularly as the auction market is challenged as well, potentially keeping prices higher.\n\nIt seems like potentially kind of a tough macro setup from the consumer standpoint. I mean how are you thinking about that in terms of how it impacts the listings business?\n\nJason Trevisan -- Chief Executive Officer\n\nYup. Great question. I mean any consumer who has a car and it's going to get -- replace it, they're probably going to get quite a bit of money for their existing car as we all know. So a lot of it depends on if they're trying to upgrade or if they're just looking at a car that could be an even swap in which case, they wouldn't have to put much money down.\n\nYou are, though certainly seeing lower auto finance conversion rates and accept rates as an industry. So it is, I think, undeniably harder for a consumer to get the same loan that they would have gotten -- would have tried to have gotten six months ago or a year ago. And so we are seeing some of that, too. But once they've qualified for it, then they're just as likely and capable to convert as they were when they had qualified for it in the past.\n\nSo -- but again, that's all of these factors, which right now, as you just gave a few data points that point to a tougher environment for consumers. All of those factors in good times and in bad are what make digital retail such a win-win and Digital Deal. And that consumers more for dealers, it allows the consumer to spend less time in the dealership to accomplish the same thing that they were before. And as you pointed out, in tougher times, the dealership doesn't want to waste a lot of time on a consumer that simply can't afford it.\n\nAnd likewise, a consumer doesn't want to get four hours into a visit and then realize that they're not going to get the funding. So we certainly -- we built Digital Deal and are investing in Digital Retail for good times and bad, but we're also seeing that it's really having a huge impact in what feels like relatively tougher times now.\n\nNick Jones -- JMP Securities -- Analyst\n\nGreat. Thanks, Jason.\n\nOperator\n\nThank you. Our next question comes from the line of Doug Arthur from Huber Research. Please go ahead.\n\nDoug Arthur -- Huber Research -- Analyst\n\nYeah, thanks. I'll try to make this quick. Scot, in terms of your guide for Instant Max in Q3. Are you seeing slowness already in July? Or is this just orderly cautious? Thanks.\n\nScot Fredo -- Chief Financial Officer\n\nThanks, Doug. Yeah, any of our guidance on this is relative to recent trends that we've seen. So we've got one month under the belt. So any time we're forecasting for the transactional businesses, it's -- we're sort of one-third of the way there, market can move quickly as we've seen in prior quarters, but it's indicative of some of the seasonal slowness that we alluded to in the call.\n\nDoug Arthur -- Huber Research -- Analyst\n\nOK. I appreciate that. Thank you.\n\nScot Fredo -- Chief Financial Officer\n\nYup.\n\nOperator\n\nThank you. Our next question is from the line of Jed Kelly from Oppenheimer. Please go ahead.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nHey, thanks for taking my question. You mentioned how CarOffer, your wholesale platform has the highest margins in the industry. I mean do you think you have to have any investment around sort of getting around, I guess, inspection or anything to kind of get more buy-side activity from dealers? Thank you.\n\nSam Zales -- President and Chief Operating Officer\n\nHey Jed, Sam Zales. Thank you. Yes, I do. We're proud of the profitability of CarOffer and how capitally efficient they run the business.\n\nBut if you look at each area of the operation and how to optimize it. If you look at inspections, as you've said, we're working with new partners, broadening the capabilities there, doing things in mechanical that we may not have in the past as we examine things like that and aggressively focus on optimizing that transaction and NPS for the customer. The arbitration process, I talked about focusing on it, improving the process that your margin goes up overall. That's an investment that improves the business result overall.\n\nTransportation, more partners, doing things to improve the speed with which we get a vehicle to the customer, both from a C2D, taking it from the home to the dealers location. Those are things that are really important for us, and we've optimized and focused on more investments to make that work the way we want it to and creating technology to create portals in each of those areas that optimize our national coverage. So those are all investments and even the focus that I made on how we look at our human resources to ensure the optimal account to DSM ratio. Those are investments that we make from a profitability standpoint to keep growing and staying profitable.\n\nSo I think you'll see us continue to focus on innovation and optimization so the customers are thrilled and we're still running a scaling and profitable business.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of the question-and-answer session. And now I would like to turn the conference over to Mr. Jason Trevisan for closing comments.\n\nJason Trevisan -- Chief Executive Officer\n\nThank you very much, operator. So I would just like to echo some of the comments made in the script. We really would like to thank all of our team members for their outstanding work on a really terrific quarter. And I also like to thank everyone for your interest in our business and your really thoughtful questions today.\n\nSo thanks so much, everyone. Have a great evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKirndeep Singh -- Vice President, Investor Relations\n\nJason Trevisan -- Chief Executive Officer\n\nScot Fredo -- Chief Financial Officer\n\nChris Pierce -- Needham and Company -- Analyst\n\nSam Zales -- President and Chief Operating Officer\n\nBrad Erickson -- RBC Capital Markets -- Analyst\n\nMarvin Fong -- BTIG -- Analyst\n\nTom White -- D.A. Davidson -- Analyst\n\nNaved Khan -- Truist Securities -- Analyst\n\nRalph Schackart -- William Blair -- Analyst\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nNick Jones -- JMP Securities -- Analyst\n\nDoug Arthur -- Huber Research -- Analyst\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nMore CARG analysis\n\nAll earnings call transcripts"
}