{
  "companyName": "Magnite, Inc",
  "companyTicker": "MGNI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/magnite-inc-mgni-q3-2022-earnings-call-transcript/",
  "content": "Magnite, Inc (MGNI -2.40%)\nQ3 2022 Earnings Call\nNov 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Magnite Q3 conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Nick Kormeluk, head of investor relations. Please go ahead.\n\nNick Kormeluk -- Head of Investor Relations\n\nThank you, operator, and good afternoon, everyone. Welcome to Magnite's third quarter 2022 earnings conference call. As a reminder, this conference call is being recorded. Joining me on the call today are Michael Barrett, CEO; and David Day, our CFO.\n\nI would like to point out that we have posted financial highlight slides on our investor relations website to accompany today's presentation. Before we get started, I will remind you that our prepared remarks and answers to questions will include information that might be considered to be forward-looking statements including, but not limited to, statements concerning our anticipated financial performance and strategic objectives, including the potential impact of macroeconomic factors on our business. These statements are not guarantees of future performance. They reflect our current views with respect to future events and are based on assumptions and estimates and subject to known and unknown risks, uncertainties and other factors that may cause our actual results, performance or achievements to be materially different from expectations or results projected or implied by forward-looking statements.\n\nA discussion of these and other risks, uncertainties and assumptions is set forth in the company's periodic reports filed with the SEC, including our third quarter 2022 quarterly report on Form 10-Q and our 10-K. We undertake no obligation to update forward-looking statements or relevant risks. Our commentary today will include non-GAAP financial measures, including revenue ex-TAC or less traffic acquisition costs, adjusted EBITDA and non-GAAP income per share. Reconciliations between GAAP and non-GAAP metrics for our reported results can be found in our earnings press release and in the financial highlights deck that is posted on our investor relations website.\n\nAt times, in response to your questions, we may offer incremental metrics to provide greater insights into the dynamics of our business. Please be advised that this additional detail may be one-time in nature, and we may or may not provide an update on the future of these metrics. I encourage you to visit our investor relations website to access our press release, financial highlights deck, periodic SEC reports and the webcast replay of today's call to learn more about Magnite. I will now turn the call over to Michael.\n\nPlease go ahead, Michael.\n\nMichael Barrett -- Chief Executive Officer\n\nThank you, Nick. We are very pleased with our Q3 performance that surpassed our guidance, as well as our continued ability to grow even with a tougher macro and more challenging ad spend environment. Our growth in revenue ex-TAC exceeded our expectations across the entire business and in CTV, specifically, and adjusted EBITDA margin also came in strong at 35%. These results were encouraging, and David will provide greater detail on Q3 results and Q4 outlook.\n\nOur CTV business continued to be a growth driver in the quarter, as revenue ex-TAC grew 29% year over year, a trend improvement from the first half of the year, driven by new and ramping Magnite partnerships. We grew and deepened our relationships with industry leaders in streaming. We want to highlight three key client wins in the quarter with Fox, VIZIO and Kroger, and give ongoing commentary to three partnerships that continue to grow with time and engagement, LG, Disney and GroupM. All of these partnerships serve as future drivers of our CTV business, and I want to touch on each individually.\n\nFirst, we recently announced a partnership with Fox where we will serve as the SSP launch partner to power programmatic campaigns for OneFOX video inventory across the company's leading entertainment, sports, streaming and news portfolio. Together, Fox and Magnite will build custom technology solutions that further streamline the buying process and enable advertisers to create one simple and unified plan to deliver their private marketplace and programmatic guaranteed campaigns across the entire Fox portfolio of video inventory. SpringServe, our CTV ad server, is becoming an increasingly important component of many of our wins and represents a true differentiator for Magnite. As we have highlighted on previous calls, the integration between our ad server and SSP is incredibly powerful.\n\nIt reduces complexity, improves inventory management between multiple parties, enhances functionality, and most importantly, drives yield for customers that have both a direct sales force and programmatic sales channel. In fact, our win with VIZIO was driven by the unique relationship between our CTV ad server and SSP. VIZIO used SpringServe to manage their entire video ad serving business while also relying on our SSP to power their programmatic channel. In the quarter, we announced that VIZIO would also be using our newly released CTV Tiles product across its entire footprint.\n\nTiles are our proprietary native ad unit that are presented on the home screen of connected TVs and represents an exciting area of growth for us as a new ad format. OEMs can use Tiles to highlight content recommendations, deliver personalized experiences and simplify the search and discovery process for millions of users. As the retail media network space has gained momentum recently, we are very pleased to have been selected as one of the inaugural CTV platforms to support Kroger's retail media advertising business, Kroger Precision Marketing. This partnership will allow advertisers, regardless of what DSP they work with, to package Kroger's proprietary first-party data with Magnite's premium omnichannel inventory with an emphasis on CTV but spanning all formats, including display and online video.\n\nLast quarter, we announced a multiyear partnership with LG Ads Solutions, which in addition to serving as the preferred SSP in ad server, provides us access to their automatic content recognition or ACR data for planning, activation, measurement and advanced analytics. This data can be leveraged across our entire streaming publisher footprint to deliver more personalized ad campaigns at scale. We are very encouraged by the early progress with this initiative with a number of brands and agencies already utilizing this data to help optimize spend. Our preferred partnership with GroupM is continuing to scale, gaining momentum as we move into 2023 and the new season of upfronts.\n\nWe are starting to see new advertiser demand across OTT as a result of the partnership and expect it to be one step in our supply path optimization, or SPO strategy, as we work with agencies and brands to consolidate spend on Magnite. And lastly, a quick update on Disney. We continue to be a strategic programmatic technology partner with Disney, positioned at the forefront of their advertising stack. We are excited to partner with Disney and their industry-leading efforts to shift more streaming inventory into a biddable programmatic environment.\n\nOur relationship is continually growing in scope as we work across ad formats on their properties globally. Our CTV platform integration is also moving forward very nicely, and we are on track to have our next-generation platform substantially complete by year-end and ready for client transition starting in Q1. We are excited about the industry-leading features and functionality, and intend to share more details after the launch. On the DV+ side, we have begun implementing some key initiatives that have returned the business to growth this quarter, with growth acceleration expected in ensuing quarters.\n\nThis quarter, DV+ grew 1% year over year, although we estimate this would have been closer to 5% when considering the effect of the strengthening dollar in the quarter. Stepping back, our broader perspective remains very positive heading into 2023 despite macro concerns. In challenging ad environments, publishers tend to have greater difficulty selling ads directly to agencies and marketers, and therefore, rely more heavily upon partners like Magnite to monetize this inventory through programmatic channels. We have already seen a record number of ad impressions this quarter and expect this trend to continue into 2023.\n\nAnd specifically in CTV, we are seeing the launch of more AVOD services and consumers switching from higher-priced subscriptions to ad-supported tiers, which will result in additional ad inventory. As we look to 2023, we expect to grow our top line and generate very healthy free cash flow as we judiciously manage expenses and balance investments in the business. With that, I'll turn the call over to David.\n\nDavid Day -- Chief Financial Officer\n\nThanks, Michael. Our team at Magnite performed well during the third quarter, and we are very pleased with results that surpassed our guidance. Total revenue for Q3 was $146 million. Revenue ex-TAC was $128 million, up 12% from Q3 2021.\n\nRevenue ex-TAC attributable to CTV was $56 million, up from $43 million or 29% from last year. DV+ revenue ex-TAC was $72 million, an increase of 1% compared to Q3 last year. On a sequential basis, Q3 total revenue ex-TAC grew 4% over Q2, CTV grew 7%, and DV+ grew 1%. Political spend represented less than 2% of our revenue ex-TAC for the quarter.\n\nOur revenue ex-TAC mix for Q3 was 44% CTV, 35% mobile and 21% desktop. Total operating expenses, which includes cost of revenue for the third quarter increased 7% to $167 million compared to $156 million in the same period a year ago. Adjusted EBITDA operating expense was $83 million, up 2% sequentially from Q2 and up from $74 million from the third quarter last year. Costs for the third quarter were lower than expected, primarily due to a reduction in the pace of hiring, lower office and facilities costs, lower technology and cloud costs and deferral of marketing costs into Q4.\n\nNet loss was $24 million for the quarter, the same as the net loss for the third quarter of 2021. Adjusted EBITDA was $44 million, an increase of 11% versus $40 million for the same period last year. Adjusted EBITDA margin was 35%, consistent with the 35% reported for the third quarter of 2021. Note that we calculate our adjusted EBITDA margin as a percentage of revenue ex-TAC.\n\nGAAP loss per basic and diluted share was $0.18 for the third quarter of 2022, consistent with a loss of $0.18 per share in 2021. Non-GAAP earnings per share in the third quarter of 2022 was $0.18, which was up compared to $0.14 per share in 2021. There were 133 million weighted average basic and diluted shares outstanding for the third quarter of 2022. Fully diluted weighted average shares utilized for non-GAAP earnings per share were 142 million for the third quarter.\n\nCapital expenditures, including both purchases of property and equipment and capitalized internal use software development costs, were $16 million for the quarter, in line with our expectations. Operating cash flow, which we define as adjusted EBITDA less capex, was $29 million. Our net interest expense for the quarter was $7 million. At the end of Q3, we had $254 million in cash on the balance sheet.\n\nRegarding debt, we continue to reduce our net leverage ratio, which was approximately 2.6x at the end of Q3 as compared to 2.8x at the end of Q2. This demonstrates further progress toward our ultimate target of 2x or less. We did not repurchase any shares under our share buyback program during Q3, and $28 million remain in the program, which was extended through December 2023. During the quarter, we continued to utilize the withhold to cover method to cover employee taxes for our regular RFP vesting.\n\nWe withheld 257,000 shares for approximately $2 million. We started the year with a balanced goal between share buybacks and reducing debt leverage. As previously discussed, our current plan is cash accumulation to maximize flexibility, with the goal of continuing to reduce our net leverage ratio. That being said, we will continue to evaluate share repurchases as part of our capital allocation strategy, as we believe repurchases at our current share price would represent a very attractive use of capital to buy our shares at a discount to intrinsic value.\n\nMoving on to guidance. I will now share our expectations for the fourth quarter and a very high-level view into 2023. Our approach to guidance continues to be conservative and assumes a continued challenged economic environment. For the fourth quarter, we expect revenue ex-TAC to be in the range of $151 million to $157 million.\n\nWe expect revenue ex-TAC attributable to CTV to be in the range of $63 million to $65 million. Now that election day is over, we can provide an update on our political spend. Based on what we've seen, we expect political dollars to roughly double from Q3 to Q4, or 3% of revenue ex-TAC. We expect adjusted EBITDA operating expenses to be $88 million to $90 million, implying an adjusted EBITDA margin of approximately 42% at the midpoint.\n\nWe anticipate capex to be approximately $9 million for the quarter, consistent with our 2022 expectations. For the full year, we expect revenue ex-TAC to be over $510 million, and that we will generate over $105 million in free cash flow. As for 2023, we expect to grow revenue even with more challenging market conditions and recession risks. It should come as no surprise that we are increasing our focus on managing costs.\n\nWe do expect some slight margin compression with the higher tech stack costs in the first half of the year as we complete our CTV platform client migration. However, we believe that the impact will subside over the second half as the migration is completed. And longer term, we expect to achieve adjusted EBITDA margins in the 35% to 40% range. We also expect that our capex will be similar or potentially lower than in 2022.\n\nWe are encouraged by the progress made during the quarter. We're also optimistic regarding our strong position, both from a financial and operational perspective, as we close out 2022 and move into 2023. With that, let's open the line for Q&A.\n\nOperator\n\n[Operator instructions] The first question is from Shyam Patil of Susquehanna. Please go ahead.\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nHey, guys. Good job on the quarter. I had a couple of questions. Michael, just curious.\n\nWith Netflix AVOD, I'm just wondering what kind of impact you've seen in the industry in terms of inventory and CPM? I know it's early, and do you expect Disney+, the AVOD option launch there to be a catalyst? And then I had a follow-up. David, in terms of your commentary for next year, I know you didn't comment on the top line per se. But should we be looking at the fourth quarter kind of year-over-year growth rate guide as kind of a starting point as we look at next year? And then on the margin point you made about a little bit of pressure in the first half subsiding in the second half, will that lead to overall pressure for the year, or are you suggesting that the second half would offset the pressure in the first half? Thank you.\n\nMichael Barrett -- Chief Executive Officer\n\nGreat. Yeah, so I'll jump on the Netflix and Disney+. As you stated, it is early. And most of those campaigns -- all the campaigns, and Netflix were kind of sold direct to a handful of advertisers, and so we're not seeing much of a ramification in the market.\n\nCertainly, it wasn't cannibalistic for other AVOD services at stream. It didn't come from budgets that were allocated for, say, TV, for instance. It more than likely came from linear ad dollars, which I think is a good sign for the whole industry. So our kind of belief on that is that it's a rising boat that will lift up the industry.\n\nMore dollars will be focused on streaming AVOD, and that's a good thing. And from a CPM standpoint, there's other premium CPMs out there. Obviously, Disney has premium CPMs, HBO Max has premium CPM. So the CPMs that they were able to achieve in the market pretty much mirror maybe on the north side, pretty much mirror what are the premium services they are getting in the market today.\n\nAnd as it relates to Disney+ as being a driver for our business, Disney+ is part of the Disney portfolio. And as we said, we're elated to continue to work with them strategically. And obviously, as they get into more ad-supported tiers long term, it's meaningful for our business.\n\nDavid Day -- Chief Financial Officer\n\nAll right. And on a -- from a 2022 revenue perspective. First, a couple of general thoughts. I'll talk about DV+ and CTV business.\n\nSo in DV+, entering 2023, while we're not nearly where we want to be, we are seeing some growing momentum and we think we can continue to gain share. And so we have some real positive developments in the DV+ area heading into next year. In CTV, we also have growing momentum. And even in the case of recession, we think that we have some -- or we would expect some countercyclical support that could be beneficial.\n\nIn particular, potential acceleration in cord cutting and growth of AVOD as households perhaps move down from the higher tiers on the streaming subscriptions. And so stepping back on that, we're confident that even in a more recessionary environment, we expect to grow. From a margin perspective, yeah, so we have two dynamics going on. We've got -- for the first half of the year, we'll be running two separate CTV platforms as we transition our clients into our new streaming platform.\n\nAnd so as we hit the middle of the year, you'll see a reduction in those costs. Also, the new platform will have some cloud leverage, and we'll have optimization just on our usage of the cloud as we go through the year. So we have a couple of drivers that will reduce those costs over the course of the year. We could get close to compensating back to current margins by the end of the year, although that will depend on top line, obviously, on any recession impacts.\n\nBut at a minimum, we'll be exiting the year in a position going forward to achieve the margin targets that we've set, the 35% to 40%.\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nGreat. Thank you, guys.\n\nOperator\n\nThe next question is from Jason Kreyer of Craig-Hallum. Please go ahead.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nHey. Thanks, guys. It was a really nice quarter and kind of different than where we've seen elsewhere. And I'm just wondering if you can maybe talk a little bit about where you've seen a little bit more resilience in your business or where you think maybe you're outperforming?\n\nMichael Barrett -- Chief Executive Officer\n\nWe're hoping you could do that for us, Jason. Yeah, I think that it's really hard to get read-throughs, right, in this market in terms of everyone -- every company reporting and some having macro challenges, some having just inherent business challenges. I think what we have seen is certainly market share gains, that the story of Magnite, this independent, largest omnichannel, CTV-first focused player with ad serving capabilities is starting to reap benefits. And as you kind of saw the examples that we shared on the call, certainly, we don't have DV+ anywhere near where we want it to be from a growth standpoint.\n\nBut getting it back to growth is kind of what we signaled that we've been working on all along, and more to come on that. And certainly in a stronger environment, it would have been even more impressive. But I do think that our exposure to CTV probably sets us apart. Our meaningful exposure to CTV revenue sets us apart, I think, from our peer set in the SSP world that being able to anchor on that growth rate in that TAM, I think was what drove us to create Magnite and I think what's going to be the wind behind our sails, if you will.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nThat's helpful. You highlighted a number of wins like Fox, VIZIO, things like that in the quarter. Just as the economic climate has changed, are you seeing any slowdown in those conversations like top-of-funnel interactions with customers, either there are initial engagements or moving them through the cycle or have those continued to persist at the same pace?\n\nMichael Barrett -- Chief Executive Officer\n\nYeah, I think that same pace or perhaps slightly accelerated. We kind of talked about in the script that historically, and for good or for bad, have been at this for a while. On the SSP side and in other dips, when it becomes more difficult in the ad environment to sell your inventory directly, publishers lean very heavily on their programmatic partner. And so in this case, with Magnite, we're seeing record impressions, record inventory.\n\nAnd even in a depressed buyer market, we're never sold out, obviously, and there's always essentially a buyer even if the price is lower. But we can sell 10 units at a depressed price versus, unfortunately, some publishers has run out of inventory to be able to do it. And so I think that is really accelerating talks, particularly in -- with publishers or platforms that were almost exclusively direct sold their interest in seeing how programmatic, and help their bottom lines is actually something that is a good guy in this tough economic cycle for us.\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nPerfect. Thank you, Michael.\n\nOperator\n\nThe next question is from Laura Martin of Needham. Please go ahead. Is your phone muted, Laura?\n\nLaura Martin -- Needham and Company -- Analyst\n\nYeah, it is. Thank you for telling me. So Michael, I was at a Disney -- speaking at a Google event, and on stage, Disney said that they only had two SSPs. And I believe you're one of them, I guess, Google's SSPs is the other.\n\nMy question is as they roll out this ad-driven tier, should we expect that to help drive your revenue next year?\n\nMichael Barrett -- Chief Executive Officer\n\nYeah. Hey, Laura. Most definitely, but let's put this in perspective, I think we've been pretty clear in the past about our concentration or lack thereof of accounts. And so in other words, I don't think a read-through should be Disney represents 20% of our CTV business, and it will go from there.\n\nWe don't really have a material CTV client by financial definition. And as we've talked about, Laura, in the past, there are several buckets and take rates differ associated with which bucket. And so if you're dealing with the publisher and they're doing all the heavy lifting of selling and they're creating the packages and they're just using you as the plumber, that's dramatically different take rate, much more along the lines of ad serving than it would be if we pipe in the demand. So as we've talked about, I think there's this evolution that's occurring where as a company and an industry, we're at the lower end of our take rates just given the prevalence of the bigger platforms to want to sell direct and be in control.\n\nAnd we believe over time that they'll rely upon Magnite more for demand stimulation which will carry the higher take rate, which would have a bigger bump to the revenue line.\n\nLaura Martin -- Needham and Company -- Analyst\n\nVery helpful. And then my follow-on is leverage. These leverage numbers are excellent. And do you have a leverage target you're moving toward or 2.6 times? How much lower do you want to go before you're ready to start making acquisitions again or doing something like buying in shares with the cash instead of repaying debt?\n\nDavid Day -- Chief Financial Officer\n\nYeah. Our current target, we want to get that leverage ratio below 2x. So that's our No. 1 priority right now, and we're making good progress.\n\nSo when we get there, then yeah, we'll be rethinking other priorities.\n\nLaura Martin -- Needham and Company -- Analyst\n\nThanks, guys.\n\nDavid Day -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThe next question is from Matt Thornton of Truist. Please go ahead.\n\nMatt Thornton -- Truist Securities -- Analyst\n\nHey. Good afternoon, guys. Congrats on the quarter and I think you know I rarely say that. I'd say that the read-throughs from peers are somewhat useless.\n\nMichael, obviously, you put up a good quarter. You're guiding \"conservatively\" for 4Q despite a tough macro, and you're guiding for growth next year despite a tough macro. And so you've touched on a little bit of this already, but my question is what has you most confident about that path? There's a lot of initiatives here that we've talked about, I guess, what has you most confident and kind of underpins that outlook? And then conversely, where do you think maybe you're most conservative and could get some upside surprise? That's my first question. And then one for David.\n\nDavid, if we fast forward to second half of next year and into '24. On a like-for-like basis, as you roll out CTV platform 2.0, would there be a step change in margin there, again, like-for-like revenue, like-for-like macro? Would there be a step change in margin there?\n\nMichael Barrett -- Chief Executive Officer\n\nYeah, Matt, I'll hit the first step and then David will jump in. Yeah. So listen, confidence probably with a small see, not a capital see. But listen, we're pretty deep into the quarter, and so we had some sight lines into Q4.\n\nAnd we're always in the marketplace and talking to our clients, and of course, there is concern about a worsening economy and a tightening ad market. But there's some bright spots, some bright verticals that had been dormant for a while throughout the pandemic that are kind of kicking back in. So again, I think largely, we have seen historically, and we are seeing today, that folks really start to lean in on their programmatic sales channel. And if your choice is serving a page or not serving an ad during a streaming show or serving one that's slightly less at a CPM and served by us, most publishers are going to take the latter.\n\nAnd so we think that with the record inventory that we're processing, that will just give us more at bats and again, enable us to generate more revenue and yield for our clients. And in the CTV in particular, there's quite a few ad-supported tiers that are coming to line next year. So we think there's just going to be more inventory opportunity for programmatic capabilities, and so that kind of gives us confidence. And I guess I would assume that the upside surprise for us would be similar to everyone, and that is it isn't as tough a macro climate.\n\nIt isn't going to be a deep long-lasting recession, and you see a quicker rebound in terms of consumer spend and advertising spend commensurate with it.\n\nDavid Day -- Chief Financial Officer\n\nYeah. On the margin front, with the combination of our platforms, launch of our new platform, I don't think there'll be a step function change in our margin profile. I think what you'll see is the initially higher costs will be substantially compensated for by the end of the year, right? What I think it does is it sets us up to grow at even a more effective unit cost basis going forward. And so I think it sets up nicely for continued growth and momentum in our margins in 2024.\n\nMatt Thornton -- Truist Securities -- Analyst\n\nAnd David, maybe one follow-up, if I could. Would you expect the new platform to have more impact from a revenue perspective or more impact from a cost perspective or not much either? I guess, any thoughts there?\n\nDavid Day -- Chief Financial Officer\n\nWell, initially, I don't think it will have much of a revenue upside. I think, in the initial phase, the first six months, it's a little bit more of just the cost impact because you're running the two platforms. You've got some elements that are going to be a little heavier indexed from a cloud perspective. But as you go forward certainly, having unified interface, ease of use, the new functionality obviously, into 2024, I think you'll have really interesting revenue uplift potential and same on the cost side.\n\nMatt Thornton -- Truist Securities -- Analyst\n\nVery helpful. Thanks, guys.\n\nDavid Day -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nThe next question is from Matt Swanson of RBC Capital Markets. Please go ahead.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYeah. Thanks for taking my question. I'll add my congratulations on the quarter. Something we've touched on, a bunch of the answers to this question kind of had me thinking.\n\nBut we're talking about maybe going into a year that has a suppressed demand environment. We talked a lot about the influx of premium supply coming in through AVOD. If we got to an environment, right, where that equilibrium of supply demand start to shift and people wanted to move faster to biddable or a programmatic bidding environment, can you just kind of talk us through how fast a publisher can turn that on? Like if Disney or Netflix decided to go 100% biddable tomorrow, is that even feasible or is this month that takes weeks, just kind of through that logic?\n\nMichael Barrett -- Chief Executive Officer\n\nYeah. No, it's literally a tomorrow -- I can't speak for Netflix, obviously. But talking about the clients that we have, our demand pipes are installed, they're hooked in and they just -- in the case where it's open auction, they very rarely use that capabilities for the types of guys you just talked about. And so that demand could be instantly brought in because the demand is there.\n\nAnd so if you put the inventory on the platform, it could ramp up instantly. I caveat that by saying each publisher has their own way of handling it and there's creative review issues and that kind of stuff, and so that could delay it. But that's not a technical thing, that's just more of a business go-to-market practice. So yes, open auction could be enabled very quickly.\n\nInvite-only auction, a little bit slower because by nature, it's an invite, so you're lining up folks. And then lastly, if you're doing a PMP or PG, some of those are always on but that requires a little bit of a back and forth between buyer and seller. But open auction, biddable, it could be lit up very quickly.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nAnd I'll keep my streak alive by asking a DV+ question. I mean, can you just talk a little bit about where you guys have been seeing the most improvement? Obviously, the macros are still impacting the growth rates. And then, I guess, from an investment standpoint, is it just waiting for those investments to play out? Or are there incremental areas through year-end into next year that you're looking to be investing in?\n\nMichael Barrett -- Chief Executive Officer\n\nYeah, Matt, it's a constant game of tweaking and investing within our budget parameters. This is not like a case where we're going to drop another $20 million into it to -- from an R&D standpoint. We pretty much have a working group team on it. The challenge with it is it's such a massive business and hundreds of billions of ad requests a day that it takes a while to tweak those systems and optimize those systems.\n\nAnd so over the previous quarters where we said we're feeling good about our internal progress and not good about our external members that we report, you're starting to see why we're feeling good. You're starting to see those green shoots, and so I think it's a constant effort. We probably have another 30 projects lined up that you knock them off each one by one, some have more impact than others. But I think you're also starting to see in environment like this, even greater supply path optimization.\n\nNumber one, from an efficiency standpoint, you want to save every working media dollar you can. And number two, it's just too distracting to work with more partners that aren't bringing value. And so what we're just seeing is a continued push for even some of the larger platforms that you would say, that's a no-brainer. Publishers are starting to tell folks, I'd rather buy my inventory through Magnite because I'm familiar with Magnite.\n\nSo Mr. Publisher, you put it through that instead of coming to me directly. So it's really kind of accelerating in that respect too, Matt.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nAppreciate it.\n\nOperator\n\nThe next question is from Shweta Khajuria from Evercore. Please go ahead.\n\nUnknown speaker\n\nHi. Could you hear me? \n\nMichael Barrett -- Chief Executive Officer\n\nYeah, Shweta. You're on.\n\nUnknown speaker\n\nHi. This is Jocelyn calling for Shweta. I have a quick question, high-level question on the ad spending right now. So several ad tech names have reported over the past few days, like Trade Desk, and we are hearing basically cautional advertising spend.\n\nSo -- and I know you probably talked to a lot of agencies and advertisers, so wondering like, what are you hearing in terms of what could be -- what could the sentiment start to change from here? When could the sentiment start to see change from here?\n\nMichael Barrett -- Chief Executive Officer\n\nSo I lost you a little bit on that, but you're asking kind of market checks from buyers about their sentiment going forward. Is that what the question was?\n\nUnknown speaker\n\nYes.\n\nMichael Barrett -- Chief Executive Officer\n\nYeah. So obviously, we're -- although we get paid by the publisher -- to run a marketplace, you have to bring demand, and so we're very close with the buyers. And we're kind of seeing what the macro picture informs that there's a lot of caution by advertisers, desire not to get tied into fixed kind of longer-term commitments. So a lot of spot dollars are out there from a CTV standpoint that were held back from the upfront that are -- can be utilized quickly.\n\nSo I think the big question that everyone is trying to answer is, is this a pause on spend or a cut on spend? And I wish I could give you the definitive answer, but I think we tend to lean toward a little bit more to the pause on spend argument than the cut on spend. So we feel that the spend will come back and it will come back faster than perhaps the most pessimistic scenario that's being painted out there, if that makes sense.\n\nUnknown speaker\n\nYeah, that makes sense. Thank you.\n\nOperator\n\n[Operator instructions] There are no additional questions at this time. This concludes our question-and-answer session. I would like to turn the conference back over to Michael Barrett for closing remarks.\n\nMichael Barrett -- Chief Executive Officer\n\nThank you, Kate. We are happy to post a strong Q3 with improved growth rates. We're able to continue to build on our market-leading position and prudently invest in clear areas for growth in CTV, DV+ and audience and identity. We also feel very good about the ability to grow next year and for the improving prospects of the broader CTV ad supported market, as many of the largest market participants have or are just launching their CTV ad businesses which will drive growth for many years to come, especially for programmatic partners.\n\nThank you, Magnite team, for delivering this quarter, and all of our analyst investors for joining us for our Q3 results call. We look forward to talking to many of you at our upcoming investor events. SIG will host our post-Q3 virtual investor meetings tomorrow. We will also be attending the Stephens Conference in Nashville on November 15th, the RBC Conference in New York on the 16th, the Craig-Hallum Conference in New York on the 17th, a virtual Macquarie Conference on December 8 in New York, in Needham in New York on January 10.\n\nWe also have a busy road show schedule with Truist in Boston on November 30 and Evercore in San Francisco on December 14. Have a great evening, and thank you for joining us today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNick Kormeluk -- Head of Investor Relations\n\nMichael Barrett -- Chief Executive Officer\n\nDavid Day -- Chief Financial Officer\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nJason Kreyer -- Craig-Hallum Capital Group -- Analyst\n\nLaura Martin -- Needham and Company -- Analyst\n\nMatt Thornton -- Truist Securities -- Analyst\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nUnknown speaker\n\nMore MGNI analysis\n\nAll earnings call transcripts"
}