{
  "companyName": "Merck & Co.",
  "companyTicker": "MRK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/merck-co-mrk-q3-2022-earnings-call-transcript/",
  "content": "Merck & Co. (MRK 0.12%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Leo West, and I will be your conference moderator today. At this time, I would like to welcome everyone to the Merck & Co. Q3 sales and earnings conference call.\n\n[Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to Peter Dannenbaum, vice president of investor relations. Please go ahead.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nThank you, and good morning. Welcome to Merck's third quarter 2022 conference call. Speaking on today's call will be Rob Davis, president and chief executive officer; Caroline Litchfield, chief financial officer; and Dr. Dean Li, president of Merck Research Labs.\n\nBefore we get started, I'd like to point out a few items. You will see that we have items in our GAAP results, such as acquisition-related charges, restructuring costs and certain other items. You should note that we have excluded these from our non-GAAP results and provide a reconciliation in our press release. I would like to remind you that some of the statements that we make today may be considered forward-looking statements within the meaning of the Safe Harbor provision of the U.S.\n\nPrivate Securities Litigation Reform Act of 1995. Such statements are made based on the current beliefs of Merck's management and are subject to significant risks and uncertainties. If our underlying assumptions prove inaccurate or uncertainties materialize, actual results may differ materially from those set forth in the forward-looking statements. Our SEC filings, including Item 1A in the 2021 10-K, identify certain risk factors and cautionary statements that could cause the company's actual results to differ materially from those projected in any of our forward-looking statements made this morning.\n\nMerck undertakes no obligation to publicly update any forward-looking statements. During today's call, a slide presentation will accompany our speakers' prepared remarks. The presentation, today's earnings release, as well as our SEC filings, are all posted to the Investor Relations section of Merck's website. With that, I'd like to turn the call over to Rob.\n\nRob Davis -- President\n\nThanks, Peter. Good morning, and thank you for joining today's call. Our strong performance this quarter reflects sustained momentum across our key growth drivers and steady progress in our pipeline. We are well positioned to successfully close out the year and we look forward to building on this momentum in 2023 and beyond.\n\nWe are delivering across our strategic priorities and executing well scientifically, operationally, and commercially. As a result, our pipeline is advancing, our business is healthy, our growth pillars are intact, and our financial performance is strong. We remain keenly focused on sustaining the success by driving continued growth and delivering long-term value to patients and shareholders. With that, let's turn first to our results.\n\nWe are pleased to report exceptional revenue and underlying earnings growth again this quarter. We continue to see robust demand for our innovative human and animal health portfolios, including for products such as Keytruda, Gardasil, Bridion, and Bravecto. Our updated guidance reflects our expectation of truly standout full year growth. Moving to our research organization, we have made considerable progress across multiple therapeutic areas.\n\nIn cardiovascular, the top-line results of the Stellar Phase 3 trial evaluating sotatercept in patients with pulmonary arterial hypertension achieved successful outcomes across both the primary and almost every secondary endpoint, suggesting the potential to transform the treatment of patients suffering from this devastating disease. I am proud of the way our research organization has moved swiftly following last year's acquisition of Acceleron to advance sotatercept's development. We continue to advance other programs across our broad cardiovascular pipeline, including our Factor XI inhibitor, which recently received an FDA Fast Track designation for patients with end-stage renal disease. Turning to oncology, we presented encouraging results at ESMO across our broad portfolio and promising pipeline.\n\nLong-term survival data reinforces the durable benefits of Keytruda and Lynparza for certain patients. We remain enthusiastic about the potential of Keytruda in earlier stages of cancer as well as in combination with other agents. In vaccines, we launched Vaxneuvance in the pediatric setting and are progressing our Phase 3 trial of V116 in adults, an important component of our population-specific approach to invasive pneumococcal disease and part of our broader efforts to provide strong protection to both infants and adults. And finally, in HIV, we are pleased that there is a path forward for islatravir clinical trials in the treatment setting.\n\nWe remain committed to helping address unmet needs in both treatment and prevention. Moving to our efforts around sustainability, we continue to execute on our priorities, further demonstrating our long-standing commitment to delivering value to society which in turn creates value for shareholders. In August, we published our annual ESG progress report, which provides a comprehensive review of our sustainability strategy, initiatives underway and progress against our goals. Consistent with our mission, we are focused on access to health, ensuring that our inventions reach as many patients as possible.\n\nTo enable access, we are committed to responsibly discovering and manufacturing our medicines and vaccines, to bringing our best ideas forward through the empowerment of our talented and diverse employees and to always operating with strong ethics and values. Some of our initiatives include a commitment to providing 91.5 million doses of HPV vaccines in Gavi-supported countries, advancing our goal to achieve carbon neutrality by 2025 and supporting projects and partnerships in our priority areas through the issuance of an inaugural $1 billion sustainability bond. Our approach to sustainability helps propel and enable our business strategy in ways that align with our operating priorities. This makes us a better company and global citizen, creating value for society and for shareholders.\n\nYesterday evening, we also announced that Ken Fraser will be retired from his role as chairman of Merck's board of directors at the end of November. I know I speak on behalf of the entire company and our board in expressing our deepest appreciation for Ken, his principal leadership, respect for science, passion for engaging with employees everywhere, commitment to patients and health equity and contributions to communities around the world. Speaking personally, I am deeply grateful for the inspiration, mentorship, and support Ken has provided to me. Moving ahead, I look forward to working with the board in my new role as chairman as we continue to build on Ken's legacy and drive core to our purpose of using leading-edge science to save and improve lives globally.\n\nI am confident that we have the fundamental building blocks in place to achieve sustainable growth and value creation. This is exemplified by our talented team of scientists and our colleagues all around the world who are dedicated to discovering, developing, and delivering life-changing medicines and vaccines. I am very confident in the short and long-term outlook of our company and I look forward to continuing to share progress as we move into the future. With that, I will turn the call over to Caroline.\n\nCaroline Litchfield -- Chief Financial Officer\n\nThank you, Rob. Good morning. 2022 continues to be a year of excellent performance for our business. This quarter, we again achieved exceptional revenue and underlying earnings growth driven by demand for our innovative portfolio.\n\nThese results reinforce our commitment to our science-led strategy, enabled by the flawless execution of our dedicated colleagues across the globe. We are confident in our ability to continue to deliver in the short-term, while we make disciplined investments to maximize long-term value for patients and shareholders. Total company revenues were $15 billion, an increase of 14%. Excluding Lagevrio, the business delivered strong growth of 10%.\n\nUnderlying growth was 4 percentage points higher given the growing headwind from foreign exchange. The remainder of my revenue comments will be on an ex-exchange basis. Our human health business continued its momentum with growth of 19%, or 15% excluding Lagevrio, driven by strength across our key pillars. Our animal health business delivered a solid quarter as sales increased 4% in both our companion animal and livestock products.\n\nNow, turning to the third quarter performance of our key brands. In oncology, Keytruda grew 26% to $5.4 billion driven by strong global demand as well as continued expansion into new indications. In the U.S., Keytruda grew across all key tumor types and continued to benefit from uptake in earlier stage cancers, including triple-negative breast cancer as well as in certain types of renal cell carcinoma and melanoma. Intervening earlier in cancer progression provides the potential for better patient outcomes, which is why we remain excited by the impact Keytruda is having on patients with these early stage cancers.\n\nNotably, there continues to be very strong demand in neoadjuvant, adjuvant, high-risk, early stage triple-negative breast cancer a testament to the profound effect Keytruda is having for patients with this aggressive form of disease. In the metastatic setting, Keytruda is maintaining its leadership position in non-small cell lung cancer. Outside the U.S., Keytruda growth continues to be driven by uptake in non-small cell lung cancer, head and neck cancer, and renal cell carcinoma. Recently approved earlier stage indications, including certain types of high-risk, early stage triple-negative breast cancer and renal cell carcinoma, are off to a strong start following launches in key European markets earlier this year.\n\nLynparza maintained its leadership of the PARP inhibitor class. Our alliance revenue grew 23% driven by continued demand in certain patients with high-risk, early stage breast cancer based on the OlympiA study. The outlook for Lynparza remains strong. And if approved, we are confident in the potential to reach patients with metastatic castration-resistant prostate cancer based on the PROPEL study.\n\nLenvima alliance revenue grew 11%, a strong demand in the U.S. driven by continued uptake in advanced renal cell carcinoma and endometrial cancer was partially offset by shipment timing in China. Lastly, Welireg is performing consistent with our expectations, providing a treatment option to the significant unmet need of patients with certain VHL-associated tumors. Our vaccines portfolio achieved excellent growth led by Gardasil, which increased 20% to $2.3 billion.\n\nGrowth is being driven by strong underlying demand in ex-U.S. markets, particularly China. We recently received approval from China's National Medical Products Administration to expand the use of Gardasil 9 to girls and women 9 to 45 years of age, which will further expand our opportunity in this important market. Growth in the U.S.\n\nwas due to timing of CDC purchases, which will negatively impact fourth quarter sales. We are confident in our ability to drive sustainable growth of Gardasil given its proven effectiveness in preventing certain types of HPV-related cancers and other diseases. Global immunization levels remain low, which provides us a tremendous opportunity to benefit more patients. And we have invested aggressively in manufacturing capacity, which positions us well to supply the demand we expect to see now and over the long term.\n\nIn our hospital acute care portfolio, Bridion sales grew 22%, driven by an increase in market share among neuromuscular blockade reversal agents and an increase in surgical procedures. As mentioned earlier, Animal Health sales increased 4%. Livestock sales increased due to poultry products and ruminant technology solutions. Companion animal sales growth was driven by the Bravecto line of products, partially offset by supply challenges for certain vaccines.\n\nI will now walk you through the remainder of our P&L and my comments will be on a non-GAAP basis. Gross margin was 77%, an increase of 0.2 percentage points, reflecting favorable product mix and foreign exchange, partially offset by the impact of lower margin Lagevrio and supply sales. Operating expenses were $6 billion, which includes $619 million of payments related to certain collaborations and licensing agreements. Excluding these payments, operating expenses grew 13%, driven by increased investments to support our key growth drivers and pipeline.\n\nOther expense was approximately $100 million, which reflects lower pension expense compared to last year. Our tax rate was 13.6%. Taken together, we earned $1.85 per share, which includes $0.22 of charges related to significant collaboration and licensing agreement. Excluding these charges, we had exceptional underlying growth.\n\nTurning now to our 2022 non-GAAP guidance. The continued operational strength of our business enables us to raise and narrow our full year revenue guidance. We now expect revenue to be between $58.5 billion and $59 billion, including Lagevrio sales of $5.2 billion to $5.4 billion. Our increased revenue guidance range represents growth of 20% to 21%.\n\nThe projected impact from foreign exchange includes an incremental headwind of nearly 1% using mid-October rates, resulting in a full year negative impact of approximately 4%. Excluding foreign exchange and Lagevrio, we expect growth of approximately 16%. We are maintaining our gross margin expectation of between 74% and 74.5%. We are increasing and narrowing our operating expense projection to $21.3 billion to $21.7 billion, principally driven by a $250 million payment related to the recent exercise of our option to jointly develop a personalized cancer vaccine as part of our ongoing collaboration with Moderna.\n\nAs a reminder, our guidance does not assume additional significant potential business development transactions. We continue to assume other expense of approximately $500 million. We expect our full year tax rate to be approximately 14%. We assume 2.54 billion shares outstanding.\n\nTaken together, we have increased and narrowed our expected EPS range to $7.32 to $7.37, an increase of $0.05 at the midpoint. The operational momentum in our business would have led to an approximately $0.20 increase in our guidance. However, it is being partially offset by the option payments in Moderna and an incremental headwind from foreign exchange of nearly 1% using mid-October rates. Our guidance reflects confidence in the underlying strength of our business.\n\nWe continue to demonstrate strong momentum and expect durable underlying demand across our key pillars, including Keytruda, Gardasil, and animal health. As you consider your model, there are a few items to keep in mind. While we actively manage foreign exchange through our revenue hedging program, it continues to be a headwind to growth, particularly across products with a larger portion of international revenues, such as in our animal health business. The hedging program mitigates the impact of foreign exchange.\n\nAnd to the extent we continue to see foreign exchange headwinds recorded at the product level, we will see a benefit in other revenues. In addition, other revenue includes the supply sales to Organon. As you saw in our results, Pneumovax23 is experiencing pressure, particularly in the U.S. as the market continues to shift toward newer adult pneumococcal conjugate vaccines.\n\nWe remain committed to our capital allocation priorities. We will continue to prioritize investments in our pipeline and business to drive near and long-term growth across our portfolio. We have made significant progress across our pipeline which Dean will speak to that has the potential to drive sustainable revenue growth. We are augmenting our pipeline by steering the best external science through value-enhancing business development, which we will invest in to realize the promise of these products.\n\nWe continue to consider the full breadth of the business development landscape. We have ample balance sheet capacity and we will act only when science and value align. Should meaningful business development not materialize and depending on the pipeline of potential transactions, we will opportunistically buyback shares. We remain committed to our dividend with the goal of increasing it over time.\n\nTo conclude, as we finish the year, we remain confident in the continued growth of our business. Global demand for our innovative medicines and vaccines remains strong and we continue to demonstrate the operational momentum and commercial execution that will enable us to deliver value to patients and shareholders now and well into the future. With that, I'd now like to turn the call over to Dean.\n\nDean Li -- President, Merck Research Labs\n\nThank you, Caroline. It's my pleasure to provide an update on our progress since the second quarter call. We have growing momentum in our pipeline across therapeutic areas, across modalities, across stages of development and across the spectrum of internal programs, established partnerships, and recent business development opportunities. In cardiology, we are making strong headway in pulmonary arterial hypertension as well as our PCSK9 and Factor XI program.\n\nIn vaccines, we are moving with rigor and speed to build on the Vaxneuvance approval and established a suite of tailored pneumococcal vaccines. In oncology, we are expanding our portfolio in partnerships with Orion, [Inaudible], and most recently, Moderna. This progress strengthens my confidence in the pipeline and reinforces to me the opportunity presented by several candidates poised to positively impact patients' lives. As Rob noted, we see significant opportunity to make an impact in cardiovascular disease.\n\nEarlier this month, we announced top-line results from the Phase 3 Stellar trial, evaluating sotatercept for the treatment of pulmonary arterial hypertension. Sotatercept, added to currently approved standard of care, had a profound effect on the primary efficacy outcome measure of improvement in 6-minute walk distance from baseline at 24 weeks. Of note, eight out of nine secondary efficacy outcome measures achieved statistical significance, including the outcome measure of proportion of participants achieving multicomponent improvement and the outcome measure of time to death for the first occurrence of a clinical worsening event. We look forward to sharing the results with regulatory authorities and plan to present the findings at a scientific congress in 2023.\n\nThe data from the Stellar trial is an important milestone as we work to establish a beachhead in pulmonary arterial hypertension. Looking ahead, the Zenith trial is evaluating sotatercept for morbidity and mortality and will enable assessment of the potential to reverse progression of disease and will be followed by the Hyperion trial, which is designed to evaluate whether administration of sotatercept earlier in the course of PH can help improve outcomes and delay time to clinical worsening. And we also have a Phase 2 Cadence trial, which is exploring the potential for sotatercept in left heart failure. In addition to sotatercept, we are studying MK-5475, an investigational inhaled soluble guanylate cyclase stimulator designed to provide selective pulmonary arterial vasodilation with limited systemic exposure for the treatment of PAH.\n\nWe remain confident in the promise of our investigational portfolio to fundamentally change the treatment of pulmonary arterial hypertension.Next to Lagevrio. Approximately 2.5 million people have now received Lagevrio for the treatment of COVID-19, and studies are continuing to show the impact this oral treatment option is having on patients and on healthcare system. Real-world evidence of high-risk, older population conducted in Israel and Hong Kong found a reduction in hospitalization and death, consistent with the Phase 3 move-out clinical trial.Unsurprisingly, a large study in the UK evaluating a broader highly vaccinated population conducted during the omicron era found no difference in hospitalization versus standard of care. Nevertheless, there were important observations from certain secondary analysis, including quicker time to recovery and to symptom alleviation as well as reduced physician visits.\n\nLagevrio continues to demonstrate a safety profile consistent with our findings in move-out. The pandemic continues to evolve and vaccination rates still vary substantially from country to country. More reason variants, such as omicron, are generally associated with less severe disease. But the elderly and those with comorbidities remain at high risk of poor outcome.\n\nInsights from real-world studies are important in this context as we try to understand how Lagevrio is being used and the potential benefit for various patient populations. Lagevrio continues to be an important tool in the armamentarium to treat COVID-19, especially with uncertainty surrounding the emergence of new variants and continued global surges. In addition to COVID-19, we are now taking steps to harness the broad antiviral potential of Lagevrio. We have initiated a Phase 2 trial evaluating its use in the treatment of Respiratory Syncytial Virus and will provide further updates as they become available.\n\nShifting to our HIV portfolio, since last year's setback to the islatravir program, we have gained tremendous learning and insights through the evaluation of data. Following consultation with the FDA, we are pleased we have a path forward. We initiated a new Phase 3 clinical program evaluating a once-daily oral combination of doravirine and a lower dose of islatravir for the treatment of people with HIV-1 infection. In addition, the Phase 2 study with Gilead evaluating a weekly oral combination treatment regimen of islatravir and lenacapavir in adults with HIV-1 infection who are virologically suppressed is resuming with a lower dose of islatravir.\n\nWe continue to see significant potential in the nucleoside reverse transcriptase translocation inhibitor mechanism and remain committed to addressing the unmet need in both treatment and in prevention of HIV. In the PeEP setting, we are prioritizing an internal novel NRTTI compounds for development. Next to vaccine and specifically Gardasil-9. As Caroline noted, last month, the National Medical Products Administration in China expanded the authorization for Gardasil-9 to broader age rates.\n\nThe authorization reinforces the strong clinical profile of Gardasil-9 and its effectiveness in preventing certain types of HPV-related cancers and diseases. In addition, we were pleased with the recent approval of Vaxneuvance, our 15-valent pneumococcal conjugate vaccine by the European Commission in the pediatric calculation. This approval brings an important treatment option to vulnerable populations, including infants less than 1 year of age, who typically experience the highest rate of disease. I would also like to touch on the recently announced collaboration with Orna Therapeutics.\n\nWe have made significant investments and gained important insights into the use of RNA technology. The compelling circular RNA platform that Orna has developed allows us to explore the potential for a new generation of vaccines and therapeutics. Turning to oncology. Strong momentum continues in our oncology portfolio across tumor type and stages of disease.\n\nLast month, at the European Society for Medical Oncology Meeting, we showcased long-term survival benefit data for Keytruda in non-small cell lung cancer, melanoma, and head and neck cancer as well as for Lynparza in ovarian cancer. In addition, we presented data that continues to support the potential of Keytruda in earlier-stage disease. Our expansive research efforts in treating in earlier-stage setting reflects our ambition to treat cancer when the potential of curing cancer may be high. Also at ESMO, in collaboration with Seagen and Astellas, first-time data was presented from the Phase 1b/2 EV-103 for Keynote-869 cohort K trial.\n\nKeytruda plus enfortumab vedotin-ejfv demonstrated encouraging objective response rate as a first-line treatment in patients with unresectable, locally advanced, metastatic urothelial cancer who are ineligible to receive cisplatin-based chemotherapy. There remain a high unmet medical need for new medicines for the treatment of locally advanced or metastatic bladder cancer, and we look forward to the potential of this combination. This quarter, we received priority review for Lynparza in combination with abiraterone as first-line treatment for patients with metastatic castration resistant prostate cancer regardless of their genetic mutation status based on the PROpel study. the PDUFA date has been set for the fourth quarter.\n\nOutside of the U.S., we continue to deliver on our oncology strategy. There remains significant opportunity for us to help improve patient outcomes and address unmet need in Japan and in China. We received four new approvals in Japan based on Keynote-522 for Keytruda in combination with chemotherapy in neoadjuvant, adjuvant, high-risk, early stage triple-negative breast cancer; Keynote-564 for the adjuvant treatment of certain patients with renal cell carcinoma following surgery; Keynote-716 for the adjuvant treatment of certain patients 12 years and older with completely resected Stage 2b or Stage 2c melanoma; and Keynote-826 for Keytruda in combination with chemotherapy with or without bevacizumab in certain patients with advanced or recurrent cervical cancer. For Lynparza, we received approval in the EU and Japan for the adjuvant treatment for patients with certain types of high-risk, early stage breast cancer based on the OlympiA A trial and in China as first-line maintenance treatment for patients with advanced ovarian cancer.\n\nFinally, we exercised our option to jointly develop a personalized cancer vaccine, mRNA-4157, or V940, which our partner, Moderna, is currently evaluating in combination with Keytruda in a Phase 2 study for patients with locally advanced and resected melanoma. The primary objective of the Phase 2 study is to assess efficacy of a personalized cancer vaccine plus Keytruda versus Keytruda alone in a randomized study of early stage melanoma in the adjuvant setting. We are energized to continue our collaboration with Moderna, a pioneer in mRNA vaccine technology. To conclude, there has been substantive progress across our pipeline, and I look forward to providing further updates on our progress in the future.\n\nAnd now I will turn the call back to Peter.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nThank you, Dean. Leo, will you please start the Q&A? [Operator instructions]\n\nOperator\n\n[Operator instructions] And our first question is from Chris Schott with J.P. Morgan. Please go ahead.\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nHi. Great. Thanks so much. I guess my question was on capital deployment.\n\nI think you mentioned in the prepared remarks that if BD doesn't materialize based on the progression of the pipeline, you'd consider repo at some point down the line. So I guess on that front, how are you thinking about the overall business development landscape at this point? And has your preference on -- or I guess actionability of kind of larger deals versus Acceleron type tuck-ins evolved as we have gone through this year. I know it's obviously a big kind of point of debate on the Merck story. So I just love to hear your kind of latest thinking on kind of BD landscape.\n\nAnd are we getting closer to a point where maybe repo makes sense just given the cash that seems to be kind of accumulating at the company? Thank you.\n\nRob Davis -- President\n\nYes. Great, Chris. Thanks for the question, and I'll ask Caroline to comment specifically on the share repurchase side of the question. But just for the BD landscape, we continue to, frankly, see a portfolio of opportunities we are interested in and are continuing to look at.\n\nSo as we sit here today, our focus, our urgency on business development has not changed. We do see a list of potential places to play. Obviously, we got to bring them through to fruition which we're working to do. That is our priority because we continue to believe the best thing we can do for long-term value creation is to invest in the sustainability of our business, which is investing in the pipeline of the future in both what we do internally and through BD.\n\nSo that's our priority. And I do see opportunities. But obviously, we remain committed also to not hold cash. So with that, maybe I'll let Caroline comment specifically on the share repurchase.\n\nCaroline Litchfield -- Chief Financial Officer\n\nSo, Chris, our capital allocation priorities are unchanged. We seek to provide a competitive return to our shareholders through both the dividend that we pay and we expect will grow, as well as through share repurchases, while we balance the need to invest in our business in driving growth, as well as in our business development strategies, as Robert just outlined. Given where we are, with our focus on business development, our desire to not create excess cash on the balance sheet, we will look opportunistically at share buybacks based on our assessment of that BD pipeline.\n\nRob Davis -- President\n\nGreat. Thank you, Chris. Next question please, Leo.\n\nOperator\n\nNext question is from Daina Graybosch with SVB Securities. Please go ahead.\n\nDaina Graybosch -- SVB Securities -- Analyst\n\nYes. I wonder if you could talk a little bit more about your novel pneumococcal vaccine strategy, V116 and V117 and how you think that will compete ultimately with competitor vaccines that continue to increase in their serotype 3?\n\nDean Li -- President, Merck Research Labs\n\nThis is Dean. I'll take that, and thank you very much for the question. So the top line is, I would just emphasize that our view is that more serotype is not always better and one size does not fit all. Our view and the view that I've had when I practice medicine, it's the right medicine or, in this case, the right vaccine for the right patient at the right time.\n\nSo when you look at Vaxneuvance, which is our 15 valent, which has recurrent responses for serotype 3, but also 22 asset [Inaudible], if you look at that and you have to look at the epidemiology of pneumococcal disease, it's a bimodal curve where really in the first two years of life, especially in the first year of life, is really important. And then in the adult section, you realize that there is increasing at 45, 55, 65. So there is a bimodal curve. If you also lay down the different serotypes, the serotypes are quite different between the two.\n\nSo that's why we believe it's the right vaccine for the right patient at the right time. Now we have a pediatric V114 that has ACIP that's gone through. And in terms of differentiation and relationship to pediatrics, we don't have clear view of other vaccines, but we are very confident in our ability to give coverage in the first year. And data to date might suggest that that is an important differentiation in a pediatric study.\n\nThere is some questions in relationship to top-line serotypes that's been sort of laid out. There has been some discussion of six serotype 2 substantial which we can't really comment on that differentiation, until we know exactly what serotypes and what the real detailed data. In relationship to the adult market, this gives us great insight and great enthusiasm for V116, our 21-valent vaccine. Now that one is specifically targeted for the serotypes that are important for the adult.\n\nSo it's 21-valent, but I would just emphasize that 11 serotypes in the 21 valent for V116 is not shared by PCV20. And the reason is that we're focused on the adult disease, and we are targeting 85% of residual invasive pneumococcal disease. And I would -- if I look at the vaccines that are in Phase 3, but also Phase 2 or Phase 1 with recent data, I don't know that anyone else has a vaccine that's targeting 85% of the residual invasive pneumococcal disease. So more is not better, one size does not fit all the right vaccine, the right patient at the right time.\n\nRob Davis -- President\n\nThank you, Daina. Next question please, Leo.\n\nOperator\n\nNext is Colin Bristow with UBS. Please go ahead.\n\nColin Bristow -- UBS -- Analyst\n\nHey. Good morning, and congrats on the results. A great quarter for Gardasil, but you talk about the sort of the one-time impact of CDC purchase timing. Can you just quantify the level of impact that had? And then I just wanted to touch base on the additional supply coming online in '23 '24, and '25.\n\nIs this still on track? And could you just specify where the supply is coming from geographically? Thank you.\n\nCaroline Litchfield -- Chief Financial Officer\n\nThis is Caroline. I'll take a shot at answering your question. So Gardasil still continues to be a very strong growth driver for our company and will be long into the future given to date only 9% of the world's eligible population are vaccinated. In terms of the quarter results, we saw growth in the U.\n\nS., which was largely driven by the CDC timing. In the third quarter of 2021, there was an approximate $125 million buy-in by the CDC. In the third quarter of '22, there was an approximate buy-in of $250 million. So year over year, that contributed to growth to the tune of approximately $120 million plus.\n\nWe do expect the majority of that buy-in by the CDC in the third quarter to come out during the fourth quarter. As we look at our opportunity to satisfy the global demand and protect as many lives as we can going forward we will be supported by the increased supply and capacity that we have coming online commencing 2023. And we expect that that additional supply will come online over the course of '23, '24, and '25. And therefore, we remain very confident in our ability to protect more lives, to drive growth long into the future, including doubling the revenue of Gardasil in the year 2030 compared to where we were in 2021.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nGreat. Thank you, Colin. Next question please, Leo.\n\nOperator\n\nNext is Seamus Fernandez with Guggenheim. Please go ahead.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nThanks so much for the question. So, I really wanted to ask a question on sotatercept and perhaps the endpoints that surprised you the most. The feedback that we are getting from thought leaders is that the benefit on clinical worsening actually coming as early as it did was a genuine surprise and suggests upside. Just wondering, Dean, where you fit in that point of discussion and perhaps what you are looking forward to in some of the earlier-stage clinical studies for sotatercept? Thanks.\n\nDean Li -- President, Merck Research Labs\n\nThank you very much for that question. So, yes, we gave top line results. We are moving with speed to present those data to regulatory authorities throughout. But just to step back, I just want to remind, at least myself and every -- and others that we were drawn to the sotatercept mechanism because it was a unique mechanism of action.\n\nIt's the rebalance activin and BMP signaling. The other mechanisms of action could largely be viewed as vasodilatory, and we have a very strong program in trying to make the best [Inaudible] medicine. But the mechanism of action you would expect for sotatercept, you would expect it would potentially reprogram the cellular response and essentially be disease modifying. We are excited about the results.\n\nWe know that there was a profound effect on six-minute walk. But as you emphasized, time to clinical worsening, these multi-components are all really important and they came in clinically meaningful and statistically significant. So, we are hopeful that we can potentially reshape the treatment of PAH. I would emphasize that we talk about Hyperion, venous, and Cadence.\n\nBut Victoria, which is the follow-on program. And the reason why that is really important to me is given the results that I see, I very much want the individuals who were on the Stellar trial have the opportunity to get into Victoria, which is an open-label trial, because the effects that we see that will be reported in a meeting likely in 2023 are ones where we must make sure that those individuals who were recruited to Stellar have continued access to sotatercept. That's how important we think the results are.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nThank you, Seamus. Next question please, Leo.\n\nOperator\n\nNext is Steve Scala with Cowen. Please go ahead.\n\nSteve Scala -- Cowen and Company -- Analyst\n\nThank you. Rob, you have been CEO for 16 months and now you are going to be chairman. What do you view as your greatest accomplishments during this time? And what have been the greatest disappointments? I think given the comments you made when you took over, we might have expected more to be done more quickly to build the pipeline, especially since Merck's pipeline is the second smallest in global pharma. Do you think this is a fair assertion? And if so, why haven't things changed more quickly? Thank you.\n\nRob Davis -- President\n\nYes. Steve, thanks for the question. Obviously, it's been a fast six months -- or 16 months in the role. But I would say what I am most proud of, several things.\n\nOne, the way the organization has come together as one team and really brought more focus in the business. Obviously, the spin-off of Organon, I think was very successful, has given us more simple structures, more focus that I feel very good about. Our progress on business development, obviously, the fact that we moved so quickly with Acceleron and then you heard what are just really exceptional results coming out of the Stellar study, feel very proud about. But I would say also just overall the way our team has continued to just execute really flawlessly, scientifically, operational, commercially, I couldn't be prouder of what everyone is doing.\n\nWe have come together and we are really delivering for all of those things I would say I am very proud about. On the pipeline itself, I actually think we are making a lot of progress. The fact that a year ago won't even give us credit for having a cardiovascular pipeline. And today, we talk about the fact that by the '24 to '28 timeframe, we could be having as many as eight new approvals driving revenue that could be in excess of $10 billion by the mid-2030s across the whole suite of assets, some developed internally and obviously, some brought into business development, like what we did with Acceleron.\n\nSo, I feel very good about that. The progress we are making in vaccines, what we are seeing. I think Vaxneuvance is underappreciated. There is a notion that Dean laid out of really having a bespoke approach where we were able to cover more of the serotypes that cause disease, whether it be in infants, and then selectively and differently, those in adults.\n\nWe think that's a real game changer. Our growing pipeline in neuroscience and immunology, I could go on and on, and the strength that we are continuing to have in adding to our oncology pipeline. So, do I think we have everything we need, no. But do I think we have made great progress in a year, I actually think we have, and it gives me confidence that we are going to continue to drive progress.\n\nThe fact that we did three important business development deals this quarter alone, spanning mRNA technologies, into circular RNA technologies, personalized cancer vaccines and then more traditional oncology agents with a really novel mechanism, those all are adding to the future promise we have in this company. So, I actually feel very good about that. More to do, but confidence in what we have done so far.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nThanks, Steve. Next question please, Leo.\n\nOperator\n\nNext is Mara Goldstein with Mizuho. Please go ahead.\n\nMara Goldstein -- Mizuho Securities -- Analyst\n\nGreat. Excuse me. Thanks so much for the question. I wanted to ask about the cardiovascular business actually since it was just mentioned.\n\nAnd given the pending applications for sotatercept, where you feel that, that organization from a commercial perspective needs to go, or are you right-sized to be able to launch and maximize sotatercept in the near term?\n\nRob Davis -- President\n\nYes. Maybe I can start that and Caroline or Dean can add on. If you look -- if you go back in history, Merck has actually had a strong history and legacy in cardiovascular. And a lot of the -- if you will, the muscle memory still exists in our organization.\n\nSo, I am very confident that we have what it takes. But more importantly, we are already out there right now in PAH. We have Adempas. We have Verquvo.\n\nSo, we have people calling on these doctors. Recall what drove us to think about Acceleron was what we saw in our pipeline, but also what we saw commercially through that experience. So, we do have the capabilities. And also the other thing I would point out is this is a little different than the way we used to think about the world.\n\nThis is -- in many cases, a lot of these drugs are still specialty drugs. They are not necessarily the true traditional primary care drugs of what we have seen in the past. And I think we are very well positioned. So, I have no worries about our confidence and ability to deliver this commercially.\n\nWe have done it in the past, and we will do it again.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nGreat. Thank you, Mara. Next question, please.\n\nOperator\n\nNext is Umer Raffat with Evercore. Please go ahead.\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nHi, guys. Thanks for taking my question. I wanted to touch up on oncology trials, two of them in particular. There is an ongoing subcu Keytruda trial versus IV.\n\nI was curious to gauge your confidence on that and if it's reasonable to assume that vast majority of the franchise that gets switched to subcu. And also this Keytruda plus KRASG12C trial, curious if the early experience implies such a combination is feasible or not? Thank you.\n\nDean Li -- President, Merck Research Labs\n\nI will take a shot at both of those questions. I will just emphasize that there is a continuing move to early cancer throughout the field, but especially at Merck. We have talked about the approval that we have in the early stage, both for Lynparza and Keytruda. And this recent Merck-Moderna collaboration is to extend that.\n\nIt's essentially an IO-IO combination, initially in melanoma, but with the possibility to expand, deepen and extend throughout other tumor types in different stages. So, given that, the critical thing for patients, especially in the early stage is to be able to have really excellent access to our medicines, and there is a need for scientific innovation. That is why we are advancing the subcu program. And we are confident that, that will not only be important and successful, but it will be really critical as we move into early phase because the ability cannot be linked to an infusion center.\n\nSo, we are confident in our strategy of moving into early phase, and it is linked. Each scientific innovation required to improve access. In relationship with the RAS program, I have said previously that the RAS program of all of those who are advancing will require a combination. And the ability to move those programs such that you can have a dose and an ability to combine with other medicines is important.\n\nWe have early data with our RAF inhibitor and many of the attributes that we think are required for that. We are big that the cards are looking like they could positively reflect on our KRAS program. But we will share that data, both in monotherapy and in combination with pembrolizumab, at an appropriate time when we present that at a Congress.\n\nRob Davis -- President\n\nAnd, Umer, to the specific question of the conversion, it's probably too early to get into the specifics of that. But I would say, generally, we do see this as bringing meaningful patient benefit. If you think about quality of life, as you move especially in the earlier stages of cancer, to be able to deliver the drug subcutaneously, we think is both innovative and will bring real value to the patients. So, that is part of the strategy as we look at the totality of how is it that we continue to deliver for patients as we extend our franchise.\n\nSo, that's something we are looking at, but more details as we get further down the road.\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nGreat.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nThanks, Umer. Next question, please.\n\nOperator\n\nNext is Mohit Bansal with Wells Fargo. Please go ahead.\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nGreat. Thanks for taking my question. And staying on sotatercept, especially with the Cadence study. So, we spoke to a doctor and he was very excited about the study given that there are no approved therapies in the subset of patients you are going after.\n\nCould you help us frame expectations of this study, because a lot of these endpoints are very similar to Stellar. So, would you expect the similar level of efficacy or bar could be lower given there is no standard of care there? Thank you.\n\nDean Li -- President, Merck Research Labs\n\nYes. So let me just speak to, we look at both our both sotatercept, and I would just also emphasize our inhaled soluble guanylate cyclase are the same sort of general sense, which is we are willing to drive it into PAH. But when you look at the mechanism of action, you ask yourself, is there other places that you can affect diseases, that aren't pulmonary arterial hypertension, but diseases where you have pulmonary hypertension, such as diastolic heart failure or, for example, in lung disease. Our expectation is that we want to explore whether sotatercept and its unique mechanism of rebalancing certain molecular pathways could also be applied to those patients who have diastolic heart failure and pulmonary hypertension.\n\nAnd given the impact that sotatercept has that we have seen already with PAH, that gives us a little bit more confidence that that mechanism may be applicable to those people with diastolic heart failure. Equivalent is as we moved our in-house soluble guanylate cyclase.\n\nOperator\n\nI am sorry, your conference will end in five minutes.\n\nDean Li -- President, Merck Research Labs\n\nIn PAH, we are also evaluating whether that molecule could also be used in those patients with lung disease who have pulmonary hypertension. So, the results give us more confidence at the next step.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nGreat. Thank you, Mohit. Next question please, Leo.\n\nOperator\n\nNext question, Chris Shibutani with Goldman Sachs. One moment here and you may go ahead, Chris.\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nThank you. To follow on Steve's question to Rob in terms of the response about what you are most proud about. You talked about the successful implications of spinning off the Organon business and having an organization have a little bit of a simpler structure and focus. I want to juxtapose the question of the animal health business.\n\nTalk a little bit about your views these days in terms of how that fits the capital allocation priorities, whether you envision potential for that to be a strategic step that you would consider to perhaps separate that business. Thank you.\n\nRob Davis -- President\n\nSure. Chris, thanks for the question. As we have said in the past, we are always looking at the portfolio. We were always asking what is the best structure to develop and generate long-term value for our business and for our shareholders.\n\nAnd with that view, we continue to believe that the animal health business is a key growth driver for us. It brings a lot of synergies, frankly, in both directions. Obviously, they are benefiting from their ability to access the science on the human health side. We are benefiting from the value they bring and, in some cases, frankly, on the vaccine side, some of the manufacturing technologies are actually being brought over into the human health side.\n\nSo, we do see synergies in these two businesses. We continue to believe that our ability to invest fully to optimize the opportunity in animal health is there. I think we have demonstrated that to the capital we have deployed and that capital is paying off. And I don't believe that business would have the capital it's had to grow if it wasn't part of Merck.\n\nSo, it's benefiting from what we can bring to them. We are benefiting from what it brings to us and as of now we continue to see it as a strategic asset. So, no plans to look at spinning it.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nThanks, Chris. Next question, please.\n\nOperator\n\nOur next question is from Luisa Hector with Berenberg. Please go ahead.\n\nLuisa Hector -- Berenberg Capital Markets -- Analyst\n\nHello. Thanks for taking my question. Maybe a little bit more on islatravir, given your confidence to continue development. Can you say any more about the impact the drug is having on lymphocytes at the lower dose? Clearly, you are able to move forward to the regulator is happy.\n\nIs there some level of lymphocyte reduction that the regulator will accept? And how should we think about the risk of resistance development with the lower dose? And when might we see some Phase 3 data? Thank you.\n\nDean Li -- President, Merck Research Labs\n\nThank you very much for that question. So, I just want to emphasize that islatravir is one molecule in our suite of NRTTI molecule. And as you mentioned, we are very interested in the importance of this body of molecules and mechanism, both for the prep setting and for the treatment setting. And it has the possibility of really transforming the longer-acting space.\n\nSpecifically to your question, we have a large range of clinical data as many --\n\nOperator\n\nWe are sorry, your conference will end in one minute.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nExcuse me, Dean. Leo, our conference will continue past 9:00 a.m.\n\nOperator\n\nWe are attempting to make sure that happens, sir.\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nThank you. We are prepared to go a few extra minutes.\n\nDean Li -- President, Merck Research Labs\n\nAnd so we have a plethora of clinical data. We are very confident that the 0.25 milligrams will be effective. We are confident that the effects on lymphocytes and CD4 T-cells will be comparable to any standard antiviral. And so that's in the Q day.\n\nWe are also very interested in moving to the Q week with our partner, Gilead. And hopefully, that will begin to get posted more, but we are focusing on amending the protocol and the dosing regimen under the guidance of the FDA. And I also want to emphasize that we will continue to be committed on the two-month oral. I mean just think, 12 pills a year, 12 pills a year for patients who are high-risk take with PREP.\n\nWe have MK-8527, it is a different molecule in our suite of NRTTIs and we are confident that --\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPeter Dannenbaum -- Vice President, Investor Relations\n\nRob Davis -- President\n\nCaroline Litchfield -- Chief Financial Officer\n\nDean Li -- President, Merck Research Labs\n\nChris Schott -- JPMorgan Chase and Company -- Analyst\n\nDaina Graybosch -- SVB Securities -- Analyst\n\nColin Bristow -- UBS -- Analyst\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nSteve Scala -- Cowen and Company -- Analyst\n\nMara Goldstein -- Mizuho Securities -- Analyst\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nMohit Bansal -- Wells Fargo Securities -- Analyst\n\nChris Shibutani -- Goldman Sachs -- Analyst\n\nLuisa Hector -- Berenberg Capital Markets -- Analyst\n\nMore MRK analysis\n\nAll earnings call transcripts"
}