{
  "companyName": "Winnebago Industries",
  "companyTicker": "WGO",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/19/winnebago-industries-wgo-q4-2022-earnings-call-tra/",
  "content": "Winnebago Industries (WGO -0.45%)\nQ4 2022 Earnings Call\nOct 19, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the fourth quarter 2022 Winnebago Industries financial results conference call. [Operator instructions] Please be advised that today's conference may be recorded. I would now like to hand the conference over to your speaker today, Ray Posadas, vice president of investor relations and market intelligence.\n\nPlease go ahead.\n\nRay Posadas -- Vice President, Investor Relations and Market Intelligence\n\nGood morning, and thank you for joining us today to discuss our fiscal 2022 fourth quarter and full year earnings results. As you may know, I am new to Winnebago Industries and excited to be working with the team as we continue to partner with our analysts and investors and seek to deepen our relationships with the investment community. I look forward to connecting with more of you in the months ahead. I am joined on the call today by Mike Happe, president and chief executive officer; and Bryan Hughes, vice president and chief financial officer.\n\nThis call is being broadcast live on our website at investor.wgo.net, and the replay of the call will be available on our website later today. The news release with the fourth quarter and full year results was issued and posted to our website earlier this morning, along with the fourth quarter earnings supplement. Before we start, I would like to remind you that certain statements made during today's conference call regarding Winnebago Industries and its operations may be considered forward-looking statements under securities laws. The company cautions you that forward-looking statements involve a number of risks and are inherently uncertain, and a number of factors, many of which are beyond the company's control, could cause actual results to differ materially from these statements.\n\nThese factors are identified in our SEC filings, which I encourage you to read. With that, I would now like to turn the call over to our president and CEO, Michael Happe. Mike?\n\nMike Happe -- President and Chief Executive Officer\n\nThanks, Ray, and let me officially welcome you to the team. We look forward to your contribution, certainly. Additionally, I would like to thank Steve Stuber for his efforts in the past several years as our investor relations leader and wish him well as he transitions internally to the CFO position within our Grand Design RV subsidiary. We are truly grateful to have both Ray and Steve on our team here.\n\nNow good morning, everyone. As always, we appreciate your interest in Winnebago Industries and taking the time to discuss our fiscal 2022 full year and fourth quarter results. I will start the call with an overview of our performance during the quarter and the full year, then pass it to Bryan Hughes to cover our financial results in more detail. Subsequently, I will offer some closing thoughts before we turn to your questions.\n\nAs those who follow Winnebago Industries know well, over the past seven fiscal years, we have been laser-focused on enhancing and strengthening our enterprise portfolio. The success of those initiatives has created a more diversified, resilient, competitive and profitable Winnebago Industries. This was never more evident than in fiscal year 2022 when our company achieved record revenue, profitability and overall outdoor market share. Today, we have five premium outdoor brands, spanning two large and secularly strong outdoor recreation industries, recreational vehicles and marine, both enabling us to connect with a broad range of outdoor consumers.\n\nWe have also substantially grown our overall market penetration as more outdoor lifestyle consumers recognize and respond to the golden threads of quality, service and innovation they see throughout the Winnebago Industries portfolio. It is no secret that demand for outdoor products exploded in the last two years and that new consumer trends have emerged, which will impact our industries forever. Thanks to the relentless focus, commitment and heart of our world-class team here, we delivered on unprecedented levels of demand for our premium products as new and existing consumers embrace the outdoor lifestyle. While recognizing the inevitable normalization of short-term outdoor demand, we continue to believe that growing interest in the outdoors by an increasingly diverse range of consumers are lasting in the long term and that we at Winnebago Industries are better positioned more than ever to serve a wide range of consumers with our diversified portfolio.\n\nThe past year has ushered in a new landscape. Inflation and rising interest rates are reshaping the economy on a macro level. These trends are certainly impacting the strong retail demand environment that Winnebago Industries has been so successful at capitalizing on. However, we feel confident that our business is positioned to continue to perform well through economic cycles.\n\nI will touch on the multiple ways we are adjusting to ensure that we continue to deliver strong profitability and shareholder value. Our recent performance in fiscal year 2022 best demonstrates our flexibility and ability to deliver in a volatile environment. Winnebago Industries' fourth quarter results were a strong finish to an outstanding year in which we delivered record revenue and profitability. We recorded fourth quarter net revenues of $1.2 billion, which represent a 14% increase over the same period last year.\n\nOur performance was driven by the same key dynamics that have shaped the last few quarters. First, a sustained excitement for the outdoor lifestyle remained a powerful tailwind, driving demand for Winnebago Industries premium products. Our leading brands continue to win with our increasingly diverse consumer base, allowing us to maintain our strong market share positions within a challenging economic environment. Second, our team's relentless demonstration of operational excellence enabled us to deliver for consumers and our dealer partners efficiently and profitably.\n\nThe team has delivered on the bottom line through the pricing power of our brands the innovation of our products, the agility of our supply chain, the increasing efficiency of our operations and disciplined investments in SG&A. As I have discussed in previous quarters, in this constantly evolving macro environment, the holistic supply chain for each of our segments are experiencing varying degrees of disruption, which, in turn, impacts dealer inventory levels in different ways. For example, we continue to manage towable RV production levels to align with ongoing consumer end market demand, while our Motorhome RV and marine businesses work to replenish dealer inventories carefully. Responsibly producing and maintaining appropriate field inventory levels remains a priority, and we are working closely with each of our dealer partners to sustainably ensure they have the supply they need.\n\nI have confidence that the world-class Winnebago Industries team will rise to the challenges they always have. Our performance throughout fiscal 2022 is a testament to the power of our people, the strength of our operations and the extraordinary quality of our products. Early in the year, we delivered on voracious demand, running our production at full capacity to achieve tremendous growth. Even then, we likely lost shipment share in select RV categories as we maintain an ongoing sense of discipline and shipments versus other industry players' appetites.\n\nAs market conditions have recently downshifted, we have exercised further rigor and a focus on sustainable long-term value by constantly adjusting production in certain business segments to calibrate to the needs of our dealers and the end consumer demand levels. Additionally, our team executed and managed the businesses through supply shortages and pricing actions to cover significant cost inflation through the year, delivering annual record net revenues of $5 billion, record annual RV market share of 12.7% and a record gross margin of 18.7%. And finally, we returned record levels of cash to our shareholders, which Bryan will touch on during his commentary. Most importantly, we continue to innovate here and add strategic investments in talent.\n\nEarlier this year, we introduced the e-RV, the first all-electric zero-emission Motorhome concept from a major RV manufacturer. And we even drove the product more than 1,300 miles on a single road trip. We are moving closer to commercialization with multiple prototypes being tested by actual end customers as we approach calendar year-end. At the recent open house RV event in late September, each of our RV business units introduced multiple new products, many of which won category awards and were received very positively by our dealer base.\n\nWe also added new senior leadership to our team this year, including Casey Tubman as Newmar's president; Jeff Haradine, as Barletta's president; and Amber Holm as Winnebago Industries' first ever chief marketing officer, significantly enhancing our team with experience and exciting new capabilities. Overall, I am incredibly proud of our performance in fiscal 2022. Our record results show that our strategy is working while our team continues to deliver outstanding results in the face of a future volatile macro environment. I look forward to continuing that focus with our team and continuing to create value as we move into fiscal 2023.\n\nWith that summary, I will now turn the call over to our chief financial officer, Bryan Hughes, to review our fiscal 2022 fourth quarter and full annual financial results in more detail. Bryan?\n\nBryan Hughes -- Chief Financial Officer\n\nThanks, Mike, and good morning, everyone. As Mike noted, Winnebago Industries fourth quarter results represented a strong finish to a record year. Fourth quarter revenues were $1.2 billion, reflecting an increase of 14% compared to $1 billion for the year-ago period. Excluding Barletta, our organic growth for fourth quarter was 4% driven by pricing actions and increased motorized unit shipments, which was partially offset by a decline in unit shipments on the towable RV segment as we pulled back on production and shipments during the quarter in response to the level of inventory in the channel.\n\nAs a reminder, this is the last quarter that we will be reporting organic results, excluding Barletta, given we closed the transaction very early in the first quarter of fiscal 2022. Gross profit for the quarter increased 12.4% to $210.4 million compared to $187.2 million for the fourth quarter of fiscal 2021. Gross profit margin of 17.8% was 30 basis points lower than last year as a result of higher material and component costs, including higher logistics costs and lower volume in the towable segment and associated deleverage, partially offset by pricing actions and the timing of those actions as compared to the realization of increases to our input costs. Operating income, therefore, increased 3% to $123.6 million for the quarter compared to $120 million for the fourth quarter of last year.\n\nFourth quarter reported diluted earnings per share was $2.61 compared to $2.45 in the same period last year. Adjusted earnings per diluted share increased 14% to $3.02 compared to $2.65 in the same period last year. Consolidated adjusted EBITDA increased 7.9% to $139.2 million for the quarter compared to $129 million last year. Turning now to the fiscal 2022 annual results.\n\nCapitalizing on strong consumer demand and the need to replenish dealer inventories, Winnebago Industries delivered record annual consolidated fiscal 2022 results, including record revenues of $5 billion, a record gross profit margin of 18.7% and record reported earnings per diluted share of $11.84 and adjusted earnings per diluted share of $13.81. Sales growth of 36.6% was driven by the recently acquired Barletta business, pricing actions and strong volume growth in every business, supported by sustained demand and the particularly low field inventories we had in our dealer work as we entered the year. Our annual gross profit margin increased 80 basis points over the prior year as a result of operating leverage and the well-timed price increases that served to offset inflationary pressures. Our team also worked extremely hard throughout the year battling constant supply constraints, which were a steady disruption to our production environment and caused operational inefficiencies.\n\nNow turning to performance by segment. towable revenues were $494.2 million for the fourth quarter of fiscal 2022, down 11.8% compared to the fourth quarter of fiscal 2021. As Mike mentioned, we adjusted our production schedule in the fourth quarter in response to fully replenish dealer inventories, resulting in a 33% decline in unit shipments. Adjusted EBITDA for the towable segment was $53.2 million, down 36.2% from the prior-year period.\n\nAdjusted EBITDA margin of 10.8% decreased 410 basis points compared to the prior year due to higher material and component costs and deleverage, partially offset by pricing actions. This lower margin in the quarter was anticipated as earlier in the year we priced ahead of inflation with the expectation that inflation would have an impact over time. Given the market dynamics, the state of inventory in the channel and in anticipation of our dealer events in September, we elected to forgo further price increases in our fourth quarter. Backlog decreased to $576.5 million, down 66.2% from the prior year due to normalized dealer inventory levels and the extensive order fulfillment throughout our fiscal year.\n\nFor the full year, revenues for the towable segment were $2.6 billion, up 29.2% over fiscal 2021, driven by strong consumer demand and pricing actions that were taken to offset higher material and component costs. Segment adjusted EBITDA was $383.6 million for fiscal 2022, up 32.7% year over year. Adjusted EBITDA margin of 14.8% increased 40 basis points over fiscal 2021. The Motorhome segment continued to perform well with fourth quarter revenues of $555.8 million, up 23.8% from the prior year due to continued strong unit sales and pricing actions related to higher material and component costs.\n\nAdjusted EBITDA of $77.4 million increased 53.4% compared to the fourth quarter of last year. Adjusted EBITDA margin for the quarter was 13.9%, representing an increase of 270 basis points over the prior year due to pricing actions and production efficiencies, partially offset by higher material and component costs. Backlog decreased to $1.7 billion, down 26.7% from the prior year. On an annual basis, Motorhome revenues increased 24.2% year over year to $1.9 billion due to pricing actions related to higher material and component costs and increased unit sales.\n\nSegment adjusted EBITDA was $238 million, up 40.7% from fiscal 2021. Adjusted EBITDA margin of 12.5% grew 150 basis points compared to fiscal 2021. Total marine revenues for the fourth quarter were $122.1 million driven by the continued strength of Barletta and good performance from Chris-Craft. Excluding Barletta, revenues were $23.7 million, representing 41.8% organic growth compared to the same period last year.\n\nSegment adjusted EBITDA for the quarter was $17.5 million, a $15.8 million increase over last year. Adjusted EBITDA margin was 14.3%. Backlog for the marine segment was $314.7 million and remains elevated as low dealer inventories persist in this segment. Consolidated marine results for fiscal 2022 include revenues of $425.3 million, up $365.1 million from fiscal 2021 driven primarily by the addition of the Barletta business.\n\nSegment adjusted EBITDA was $60.8 million, up $55.7 million over fiscal 2021. Turning to Winnebago Industries balance sheet. As of the end of the fiscal year, we had $545.8 million in total outstanding debt composed of $600 million in debt, net of convertible note discount of $45.3 million and net of debt issuance costs of $8.9 million. We also had working capital of $571.7 million.\n\nWinnebago Industries continues to hold a very healthy liquidity position and recently added to it by securing an increased asset-based lending credit facility of $350 million. This upgrade was fully driven by the need to rightsize our ABL facility to the current size of our business from our previous $192.5 million facility. Our current net debt to adjusted EBITDA ratio is 0.5 times, which remains below our targeted range of 0.9 to 1.5 times, allowing us to execute on our balanced capital allocation strategy to make strategic investments serving the growth in our business while also returning cash to shareholders. As evidence of our commitment to these priorities, Winnebago Industries recently increased the dividend by 50% to $0.27 per share for this most recent quarterly dividend payment.\n\nThis increase reflects our continued confidence in Winnebago Industries' ability to remain resilient through the volatile market conditions that we are currently facing and maintain strong profitability. In addition, we bought back $80 million of shares during the fourth quarter, a new record, fully depleting our previous share repurchase authorization and resulting in our board of directors approving a new $350 million authorization. We executed approximately $210 million of share repurchases, around 11% of shares outstanding at fiscal year-end 2021 during the course of fiscal 2022. We are pleased to have exercised all levers of our capital allocation priorities during fiscal 2022 in addition to investing in organic and inorganic growth to capture the strategic opportunities within reach, Winnebago Industries returned a record $233 million to shareholders in the form of share buybacks and dividends, and all of this while maintaining a healthy balance sheet that allows us to continue to invest for outsized returns on behalf of our shareholders.\n\nThat concludes my review of our financials for the quarter and full year. I'll now turn the call back to Mike to provide some closing comments. Mike?\n\nMike Happe -- President and Chief Executive Officer\n\nThanks very much, Bryan. As we reflect on fiscal 2022, we are proud of the financial, organizational and cultural strides we have made. While we anticipate some select supply chain constraints will linger into fiscal 2023, particularly in the Motorhome and marine segments, we continue to make progress and become more effective at minimizing the related impacts by collaborating closely with our suppliers. We also continue to monitor inflation while trying to balance pricing actions in a tougher demand environment and affordability of our premium products for our customers.\n\nIn addition, we continue to leverage operating efficiencies and leverage our variable cost structure to help maximize profit margins as possible. We will build on our strong momentum by continuing to focus on executing our proven strategies and introducing new products across all our brands. I was particularly excited to witness the many new products showcased at the recent RV open house event in Elkhart County, Indiana. Our Winnebago Grand Design and Newmar products were impressively displayed for dealers and industry partners to experience.\n\nEach of these RV brands also received the latest RVDA Dealer Satisfaction Awards as presented in recent weeks. I look forward to seeing the results of our collective efforts in the months to come. The unique strength of all Winnebago Industries brands will position us to continue to win with consumers, building on our growing trailing 12-month RV market share of 12.7% and moving the Barletta brand, currently at 6.9% market share in the latest SSI report, firmly into the top five in the pontoon market. Now, I want to quickly touch on expectations for the RV industry for the upcoming year.\n\nAs mentioned previously, we are monitoring closely the macroeconomic environment to help assess outdoor leisure retail demand. All things considered and knowing that there are numerous factors that can impact forward-looking estimates materially, we are generally aligned with RVIA's recently released data and are projecting a range of 490,000 to 500,000 in shipment units for calendar year 2022. Concerning calendar year 2023, we believe industry RV shipments will likely trend closer to a range of 400,000 to 410,000 units for that period, slightly lower than the latest RVIA forecast. For retail, we estimate 450,000 RV units for calendar year 2022 and retail units equivalent to wholesale shipments in 2023.\n\nOverall, and in the long term, we are confident that Winnebago Industries has significant headroom for sustained profitable growth and enhanced value creation for our end consumers, dealers, employees and shareholders. The confidence we have in our ability to drive continued value as highlighted by the recent 50% increase in our dividend and the commitment to repurchasing record levels of shares. We look forward to telling you more about how we are building on our accomplishments over the last several years and why we believe Winnebago Industries is well positioned to continue driving value for shareholders at our upcoming investor day on November 15 at Lake Lanier Islands in Georgia. We hope to see many of you there in person.\n\nLastly, I want to acknowledge the efforts of our 7,400-plus employees here at Winnebago Industries and thank them immensely for their contributions. Too often, Bryan and I get more credit than we deserve as the messengers of our outstanding results. This company and our culture are successful because all our employees care deeply about our end customers, strategic business partners and each other. We are incredibly privileged to work alongside each of them on a daily basis.\n\nTheir dedication to excellence and inclusivity is inspiring. We recently saw evidence of this when Winnebago Industries was awarded the Champion of Women Award this month by the RV Women's Alliance. What a great achievement for our team. That concludes our prepared remarks this morning.\n\nI will now turn the call back over to the operator. Thank you for your time.\n\nOperator\n\nThank you. [Operator instructions] And our first question comes from the line of Tristan Thomas with BMO. Your line is open. Please go ahead.\n\nTristan Thomas -- BMO Capital Markets -- Analyst\n\nHey. Good morning. A few questions. Could you maybe help us quantify the margin kind of bridge for motorized and towables on an adjusted EBITDA basis? Just what the interplay between lower production rates, promos and return and then commodity costs and the price increases?\n\nBryan Hughes -- Chief Financial Officer\n\nYeah. Good morning, Tristan. This is Bryan. I'll take that one.\n\nAnd I'll go into some level of detail here. We had, as I think you know, overall, a strong quarter in gross margins at 17.8%. Our segment level EBITDA margins results were missed, I'd say. Our Motorhome EBITDA margins for the year at 12 and a half percent were very strong and for the quarter at 13.9% were at record levels.\n\nMarine EBITDA margins for the quarter and the year were 14.3%, the strongest across our three segments, and demonstrates the strength of our brands and why we have entered this segment through our two acquisitions of Chris-Craft and, more recently, Barletta. In the towable segment, we had record level margins for the full year at 14.8%. So, we're very pleased with that, obviously. Through this year, we saw EBITDA margins in excess of 15% a couple of quarters and even as high as 17.2%, as you recall, in Q1 of fiscal '22.\n\nWe've talked in past quarters that we've tried to navigate the inflationary pressures with well-timed pricing. And in some cases, that timing didn't always match perfectly within an individual quarter, but that we were managing this equation over a longer period of time and also with market dynamics in mind, of course. The EBITDA margins for the towable segment we saw in the quarter at 10.8% likewise reflected this timing. As we entered the fall, we have reinstituted the traditional fall programming, prices and those practices that encourage the dealers to take on product during the seasonal low periods, and this is certainly something that impacted margins in Q4, and we'll have a more normalized impact on our Q1 margins.\n\nThe inflationary impacts for the towable segment, including some heightened logistics costs we absorbed, continue to be very dynamic but are now showing some stabilization if you look at our cost today as compared to the summer months. Weighing all factors and as dealer inventories normalize and as market dynamics likewise normalize, we believe that over the long term, EBITDA margins for the towable segment will stabilize at historical levels, and our premium brands will continue to deliver EBITDA margins that are industry leading. So while I didn't give you a breakdown nor do we ever of the impact rather of pricing versus inflation versus other drivers, I think that gives you some additional color to help understand the margins.\n\nTristan Thomas -- BMO Capital Markets -- Analyst\n\nOK. I guess just trying to -- I think everyone is trying to figure out how to model margins moving forward. So even if you could just rank order kind of what was the biggest impact this quarter and if we think that's going to stick around.\n\nBryan Hughes -- Chief Financial Officer\n\nYeah, I think it's certainly, as I mentioned, the timing of how this stuff plays across the P&L. It's a very dynamic cost environment right now. And we're going to be really thoughtful about when we institute pricing and what amounts and then also taking into account our forward view of the cost or inflationary environment as well. And so that certainly factors into our decisions in the short term.\n\nWe clearly, Tristan, we don't manage margins for a quarter. We're managing them much more long term than that. And so I think that that's certainly something that we want to convey as well.\n\nTristan Thomas -- BMO Capital Markets -- Analyst\n\nOK, I'll hop back in the queue. Thank you.\n\nOperator\n\nThank you. And one moment for our next question. And our next question comes from the line of Scott Stember with KM -- I'm sorry, MKM Partners. Your line is open.\n\nPlease go ahead.\n\nScott Stember -- MKM Partners -- Analyst\n\nGreat. Thanks for taking my questions guys. \n\nBryan Hughes -- Chief Financial Officer\n\nHey. Good morning, Scott.\n\nScott Stember -- MKM Partners -- Analyst\n\nCan you maybe talk about open house, obviously, heading into this event, while we didn't have any in the last two years, but a little bit unique. We had an imbalance of lower-priced trailers in the system. And then we had the current pricing environment, but dealers seemingly a little bit reluctant to order 2023 product at these prices. Can you talk about how that dynamic took place a couple of weeks ago and what you saw from an order intake perspective at open house?\n\nMike Happe -- President and Chief Executive Officer\n\nGood morning, Scott. This is Mike. Yeah, I thought we had a really good open house event. And I'll start, first and foremost, with the quality of the product lines that we showed during open house.\n\nIn fact, several industry trade magazines in some of their future additions will be awarding many of our brands with some awards concerning the innovative products that we showed at open house. Secondly, we had great discussions -- honest discussions with our dealers. Open house had not been held since 2019. It was good to see a majority of the country's dealers show back up in Elkhart County and spend time with not only our brands, but I'm sure all of the other OEM brands that displayed.\n\nAnd any time you have a chance to spend quality time with one of your customers, you get the chance to share perspectives and talk about the future in a productive manner. As I said at our very small investor event that morning in Elkhart, our programming and pricing for the 2022 open house was candidly very similar in terms of discounts or promotions as it had been in the past. We stated very clearly that we were not showing up in Elkhart that week to offer steep discounts in order to incentivize dealers to take product that, in some cases, they shouldn't take. Especially on the towable side, inventory in the field continues to be at a healthy level.\n\nAnd while we would love to collect record-breaking levels of orders at an event like open house, this was not the year to do that, particularly on the towable side. So our teams walked away with a solid amount of orders. But more importantly, we probably walked away with better alignment with our dealers about how we're going to work with them on a daily basis going forward. Open house is an important event.\n\nIt is not an event where we collect hypothetically a majority of the orders for the season. We tend to obviously collect orders for the next several months, hitting into the winter and then the spring, particularly around the latest model year. So I think our teams were pleased overall with the event. We have no problem in terms of communicating with our dealers about their needs.\n\nAnd so we have the orders we need to keep running the business in a productive and disciplined fashion.\n\nScott Stember -- MKM Partners -- Analyst\n\nAll right. And then just the last question. Assuming you guys stay true to your pricing disciplines and just for the sake of modeling, at least early in the year, could you just give us an indication of towables versus motorized versus marine, what we're running at production just so we can have an idea where the numbers need to be?\n\nMike Happe -- President and Chief Executive Officer\n\nYeah. Certainly, Scott, I'll talk in terms of relativity. We continue to maintain that our two marine businesses are in the healthiest position, both in terms of the industry dynamics and the runway that they have with their dealers. Chris-Craft's field inventory is the lowest it's been candidly in the time that we've owned the business.\n\nWe're standing up a new assembly plant in Sarasota. Unfortunately, we saw many of our dealers or customers in Southwest Florida have several of their boats damaged. And so there'll be a benefit in an unfortunate way for those consumers and dealers down the road for us. The [Audio gap] market, while it is slowing in macro in terms of retail demand, it continues to be a very strong category for us with our Barletta brand.\n\nBarletta in its trailing three month retail data now has 6.9% market share. That's up 200 basis points over that same mark a year ago. And so we are also introducing in Barletta new product lines, both on the lower end and on the highest end. And so the marine segment for us is one where we remain bullish.\n\nAnd the segment overall that we will most likely continue to invest in from a BD standpoint in the future. And so you can expect, I think, good margin stability on our marine business for a good portion of the fiscal '23 year. The motorized segment has certainly been working its way back to a field inventory position that is healthier. There are pockets of the motorized RV segment where the dealers still need inventory, and there are candidly some pockets where they're probably reaching where they want to be in terms of a turn level.\n\nWe continue to see very solid profitability, particularly on the Class B product line, some of our Class C. And I've been very pleased as of late with the way Newmar has been running their business on the Class A side in terms of profitability yield as well. So motorized margins will probably settle a bit as field inventory normalizes to a full extent over the course of fiscal year '23. But as we've intimated, we sincerely believe that motorized profitability yield on the bottom line will maintain a double-digit position within our portfolio.\n\nBryan, lastly, talked about the towables segment. And timing is the biggest element of what you saw in fourth quarter. We made a very conscious decision to take our fall programs to the market ahead of open house, and that pushed some expense into the month of August, specifically. And candidly, as Bryan also talked about, the inflation pricing dynamics also played a role just overall in terms of timing.\n\nAs Bryan stated, we believe that towable margins will maintain a industry-leading position and that you will likely see them stabilize at historically normal levels as we travel through the rest of fiscal '23. That will be a gradual development, but we have confidence that that will happen.\n\nScott Stember -- MKM Partners -- Analyst\n\nGot it. That's all I have. Thank you.\n\nOperator\n\nThank you, and one moment for our next question, please. And our next question comes from the line of Michael Swartz with Truist. Your line is open. Please go ahead.\n\nMike Swartz -- Truist Securities -- Analyst\n\nYeah. Hey, good morning, guys. Mike, just wanted to follow up with the last part of your answer to Scott. I think you had said you expect towable margins to gradually improve through fiscal '23, and there were some timing issues in the fourth quarter, understood.\n\nSo does that -- is that another way of just saying that that's kind of the low point -- fourth quarter should be the low point for towable margins maybe over the next 12 months or so?\n\nMike Happe -- President and Chief Executive Officer\n\nWell, Mike, good morning, and thanks for the question. I certainly won't ever commit to what is either a peak or a low point. I mean we've seen enough volatility in the last two, two and a half years with the pandemic, supply chain disruption, inflation, the war on Ukraine, you name it. So I won't commit that our guardrails are permanent.\n\nWe believe that while what you saw in fourth quarter may have been a little bit lower margin than some on The Street were anticipating, that it is by no means a sign of deterioration of margins that's going to continue in earnest. So we are seven and a half weeks into our first quarter. Bryan and I sit here with a decent understanding of how the business has performed in those seven weeks. We do not believe that you're going to see a significant deterioration in the towable margins in the near term.\n\nBut as costs stabilize, as especially the Grand Design team works through their opportunities regarding their model year '23 product line, that margin stabilization will most likely be gradual here over the next one to three quarters. But we are not panicking about towable margins to any degree here at Winnebago Industries.\n\nMike Swartz -- Truist Securities -- Analyst\n\nOK, that's helpful. And then maybe just a follow-up quickly on -- I think you said the retail outlook for fiscal year '23. And I think some of the parameters you gave would suggest that you're thinking about something maybe similar to what we saw in 2019. Maybe give us -- maybe walk through some of your thoughts on how the business has changed in 2019 because I think the comment that you made, people are going to look back at 2019 and say, OK, there's the earnings power.\n\nSo maybe give us some context of why the business is different today and maybe how we should be thinking about some of the drivers, maybe some of the puts and takes to that 2019 earnings number relative to your '23 outlook.\n\nMike Happe -- President and Chief Executive Officer\n\nYeah. Thanks, Mike. Let me talk with why and how I think the company is different in mid-October of 2022 versus, candidly, probably the same month in 2019. First and foremost, we've added two pretty significant material businesses.\n\nProbably almost $1 billion of revenue has been added in terms of acquired businesses. First, starting with Newmar. Back in the fall of 2019, we added a fantastic brand that has been taking significant share in Class A diesel, Class A gas and early on here in Super C as well. That business grew in revenue from fiscal year '22 versus fiscal year '21.\n\nAnd we expect Newmar to be a bigger, more profitable business in the future. It complements the Winnebago line very well in terms of brand positioning, but also product line assortment. The second business we acquired was Barletta, the fastest-growing pontoon company, most likely in the history of the pontoon industry, and very candidly, one of the fastest-growing marine companies in the industry today as well. And we had stated at time of acquisition in late August of 2021 what we anticipated that they would do in calendar year 2021 sales.\n\nAnd I can tell you that their fiscal 2022 sales and profits exceeded what they did in calendar '21 in terms of revenue and profits. And that business continues to grow. So the first answer to how are we different is we have two significant new acquisitions that are headed in the right direction and have significant runway. Secondly, as we've improved the profitability of several of our other businesses organically, not the least of which is Winnebago-branded Motorhomes, Winnebago-branded Motorhomes has seen a profit transformation in the last four, five years at our company through a variety of elements, not the least of which is innovative new product, but also significant work on the operational side to drive inefficiency and waste out.\n\nAnd as I indicated just minutes ago, I think our profitability in that segment is sustainable. And that is dramatically different than three years ago. I would say, lastly, we're gaining share. We had a different level of share in 2019.\n\nI think we finished with  nine and a half percent points of share in the RV space at the end of fiscal '19. We enter fiscal '23 with almost 13 points of share. We had very low share in the marine industry. And in fact, we had zero share of the pontoon market in 2019.\n\nAnd as we sit here today, we have almost 7% on our way to double digits someday. So all of those combined to make us more resilient via a diversified set of revenue streams, a profitability floor that has been raised and a runway that we are quite bullish on. So we're proud of fiscal '22. We're proud of the fourth quarter.\n\nWe recognize there are always nuances in the numbers, but we hit into fiscal '23 competitively, I think, in a good place to manage through whatever the market gives to us.\n\nMike Swartz -- Truist Securities -- Analyst\n\nThat's very helpful. Thanks, Mike.\n\nOperator\n\nThank you, and one moment for our next question, please. And our next question comes from the line of Craig Kennison with R.W. Baird. Your line is open.\n\nPlease go ahead.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nThanks for taking my question. I guess, I wanted to ask about RV affordability, some things you can't control. Interest rates are moving significantly higher, and that increases the monthly cost for your consumer. And I think that's been a pain point in the channel.\n\nBut other things that are more within the industry's control would be the dealer margin and also your cost from a dealer perspective. How are your input costs trending and a like-for-like unit? Might we see any deflationary pressure in some of those categories? And then might we see some dealers offer sharper prices just as competition increases with more inventory in the channel?\n\nMike Happe -- President and Chief Executive Officer\n\nYeah. Good morning, Craig. Thanks for your question. I'll speak first to what we're seeing in terms of some of our cost inputs.\n\nI certainly won't get into some of the specifics. The good news is on many of our raw materials, particularly steel, aluminum and lumber, we have seen a significantly better environment over the course of the last calendar year. Steel is candidly probably, on sort of the spot market, 50% cheaper than it was at its peak. Aluminum is probably 30% cheaper than it was at its peak.\n\nAnd lumber candidly, is probably 60%, 65% cheaper than it was at its peak. Now that doesn't mean that we are always able to acquire those commodities or our suppliers acquire those commodities exactly at the right time to take full advantage of some of those drops. But the reality is the raw material market has definitely improved. And that is going to be of some benefit, I think, to our suppliers, which hopefully trickles to us.\n\nWe do some vertical integration with those materials, and that should help us as well over time. We are, however, continuing to see some cost pressure in areas where the supply chain is still constricted. motorized chassis is a good example of that because of the semiconductor situation and the automotive capacity limitations, in many cases, they're putting on themselves. Certain types of component systems, we have not seen sort of the -- in most cases, we've not seen deflation at all from our suppliers, but there are still categories where inflation is a little bit higher than we would like on either a sequential basis, quarter to quarter or year over year.\n\nBut the environment is getting better. Now on the flip side, the retail environment is a little tougher. And so therefore, our pricing power is going to look a little bit differently in fiscal '23 than it did in fiscal '22. I'll comment very carefully on dealer margins.\n\nDealer margins is a topic that we care deeply about. We want dealers to be financially healthy. And candidly, we want our brands, both on the RV and marine side, to be near the top of the list with our dealers in terms of turns and retail, but also profitability by brand. And we think, in many cases, we are.\n\nThat being said, dealers have stated to us and to other sources that they're not operating their business at probably the peak margin status they were in during the height of the retail demand in some of the field inventory constraints that they had. In many cases, dealers, though, are operating at levels that we've heard that are closer to pre-COVID levels. So relatively normal historically. The affordability of RVs particularly is something that I think is important generically to the industry.\n\nWe are often not the opening price point brands in most of our dealers. We tend to be the brands that people step up to. So we pay more attention most likely, Craig, to the premium price differential that we ask consumers to pay for our brands versus the value brands. Our job is to keep that gap manageable for consumers to make that step up.\n\nSo I think dealers are financially healthy right now. They'd like to run their business at slightly higher turns. And we're fine with both those. We want the dealers to be in great position when the winds kind of return behind our sales in the future.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nThanks, Mike.\n\nOperator\n\nThank you, and one moment for our next question, please. And our next question comes from the line of Fred Wightman with Wolfe Research. Your line is open. Please go ahead.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nHey, guys. Good morning. Could you dig in a little bit more on to the motorized backlogs? Just looks like there was a pretty big sequential change given sort of what you guys booked on the sales side. So was that cancellations? Was that something else that's going on there? Could you just give a bit more?\n\nMike Happe -- President and Chief Executive Officer\n\nYeah. Good morning, Fred, This is Mike. Just as a -- an asterisk as I answer this question, we've always stated that we all need to be careful in terms of backlogs as an indicator of future business. We are comfortable with where our backlogs are today in terms of what we believe our financial performance will be in the future.\n\nAnd we are monitoring carefully dealers' commitments to those orders that they have with us. I would say, from a Motorhome perspective, the decrease is probably simply a sign of field inventory getting healthier, and dealers mostly slowing down the placement of new orders based on either the retail pace of Motorhomes turning in the market or where they'd like to set their turn levels in the future. We have not seen an inordinate amount of units canceled on either Motorhomes or towables. We are not immune to dealers either delaying the receipt of committed orders or canceling orders, but it is not something that is epidemic right now at Winnebago Industries with any of our RV brands.\n\nThere's a little bit of open inventory on our lots, but it is something that we will work through efficiently here over the coming weeks. So I think the Motorhome backlog, candidly, Fred, is, in summary, just a sign of the field filling and dealers adjusting their appetite to what they see in terms of future retail.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nMake sense. And then, Mike, you had touched on sort of the hurricane impact or potential impact on the marine side, but is that something that you think could have an impact on the RV side as well, either from a replenishment standpoint or maybe housing or not?\n\nMike Happe -- President and Chief Executive Officer\n\nYeah. I think it's too early for us to really make a strong statement about it. Candidly, I don't think Hurricane Ian and sort of the implications of that now are going to be incredibly material to our company. We generally have not been first at the table with organizations like FEMA on trailers or temporary housing.\n\nOur units are not necessarily constructed for those purposes. Our brands are not positioned to necessarily be that specific solution. Should there be a need for those types of units? I think some of our lower cost, higher volume competitors are more in line for that. There's no doubt that some of our customers were impacted significantly, first and foremost, through the loss of probably their homes in some cases or at least major damage.\n\nBut we have seen pictures of boats and RVs heavily damaged and ending up in places that you could have never imagined because of that storm. So we're going to let the dust settle. Our teams are in contact with our dealers in those areas, and we'll provide our dealers and consumers all the support we can. And there will most likely be a sort of a geographical bump in sales in those categories in that area over the next couple of years as people begin to sort of rebuild their lives.\n\nSo people's passion for the outdoors is pretty strong. And while it's not going to be number one on their list of things to replace, people will want to get back out onto the water or back onto the road. And so we do believe any consumers who lost units, well most of them will replace them in the future.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nMake sense. Thank you, guys.\n\nOperator\n\nThank you, and one moment for our next question, please. And our next question comes from the line of Bret Jordan with Jefferies. Your line is open. Please go ahead.\n\nPatrick Buckley -- Jefferies -- Analyst\n\nHey. Good morning, guys. This is Patrick Buckley on for Bret Jordan. Thanks for taking our questions. \n\nMike Happe -- President and Chief Executive Officer\n\nYeah. Good morning. \n\nPatrick Buckley -- Jefferies -- Analyst\n\nI know you've talked about it a bit here, but do you have any additional commentary on the pricing environment moving forward? How have things progressed with conversations with the dealers? And have you seen any effects of changes at the retail level obviously entering a bit of a different environment in the financing environment with higher rates? Have you seen signs of higher down payments, longer loan terms or a higher portion of cash buyers?\n\nMike Happe -- President and Chief Executive Officer\n\nYeah. Good morning. I'll take maybe the first half of that in terms of maybe what we're seeing from a pricing standpoint, and I'll defer to Bryan here if he has any comments on the retail or inventory financing side of the equation. I think as I mentioned earlier in one of the earlier questions, we are seeing dealers be more aggressive in terms of pricing in the market, particularly on towables, but even in some categories like Class B vans where there is -- there's significant consumer demand and dealers are fighting for share themselves as well.\n\nWe don't see that pricing as irrational by the dealer community. And as I said earlier, I think a lot of their margins have been trending back toward sort of historically normal margins here over the late summer and the fall months. And so -- and I mentioned earlier as well that our pricing power in fiscal '23, because of softer retail conditions, is probably going to be less, but that doesn't mean that if we see meaningful inflation that -- we will protect our profitability as necessary over the long haul and put pricing in place should we see. I think we're going to be more sensitive, though, to the market and to the timing of those price increases, just given everything our dealers are facing on a daily basis.\n\nSo Bryan, any comments on maybe the health of the consumer or financing in general?\n\nBryan Hughes -- Chief Financial Officer\n\nYes. We've always struggled a bit with pinpointing the percentage of those buyers that are cash buyers versus finance buyers because, as you can appreciate, they may often show up with cash in hand from a HELOC or other source of financing. So it's a bit hard to pinpoint. We've not yet heard of any change in that mix of cash buyers versus finance buyers.\n\nInterest rates are probably anywhere from 200 to 300 points higher on the retail side versus where they had been over the past couple of years. And still, given the duration also, which has not changed, I think that was another one of your questions, we've not heard of that retail duration of loan changing to a shorter or longer duration, at least that we've heard yet. Still widely available. That is the financing.\n\nIt's still widely available on the retail side. And personal balance sheet remain relatively strong as well. So we think that that will be one of those factors that helps to sustain retail demand in the near future. So there's some additional perspective I'd share, but no significant changes really to that financing environment.\n\nAnd the retail customer remains pretty healthy from a balance sheet perspective.\n\nPatrick Buckley -- Jefferies -- Analyst\n\nGreat. Thank you. That's very helpful. And then also, are you guys able to provide an estimate or give any color on inventory that's been built but hasn't been sent to dealer lots.\n\nAnd maybe just sort of relative to where you've historically been, are there any changes in recent inventory levels there?\n\nMike Happe -- President and Chief Executive Officer\n\nOur inventories are elevated, but not for reasons in terms of a massive amount of finished goods sitting on our lot. We continue to manage working capital as best we can. That includes a number of areas. But inventory is certainly a part of that.\n\nWe manage raw materials, work in process and finished goods. As I stated earlier, with a comment on open order inventory, we are not sitting with what I would call an excessive amount of inventory on our lots. Some of our businesses are turning it as soon as it comes off the production line. And in some cases, the inventory sits while the dealer and the transportation company work out the best time to take it.\n\nSo no major areas of concern that I have at this time.\n\nGreat. Thank you.\n\nOperator\n\nThank you, and one moment for our next question, please. And next question comes from the line of Martin Mitela with Raymond James. Your line is open. Please go ahead.\n\nMartin Mitela -- Raymond James -- Analyst\n\nHi. This is Martin. I'm actually here for Joe Altobello, Raymond James. A quick question for you.\n\nWhen it comes to towable unit shipments, they were down over 30% year to year, while revenue per unit was up over 30%. Obviously, a sign this isn't sustainable. So where do you see price trending in fiscal 2023?\n\nMike Happe -- President and Chief Executive Officer\n\nCan I ask a question of clarification? Are you asking about wholesale price from us to our dealers or are you asking about retail price in the market?\n\nMartin Mitela -- Raymond James -- Analyst\n\nRetail price in the market.\n\nMike Happe -- President and Chief Executive Officer\n\nYeah. I think you'll see, candidly, a much more stable retail price environment in the next 12 to 14 months, assuming inflation is relatively stable and dealers don't see significant price increases from the OEMs. As we've talked, I mean, dealers have begun to be more aggressive on retail pricing on some of the categories already in light of the market conditions and their inventory. But I think you'll see less volatility in total.\n\nI think most of you on the call know this, but over the last 24 months, you've seen, in some cases, a -- an increase of 30% plus in terms of suggested MSRP for many of these units. Now the units aren't always sold at MSRP. So now you're starting to see some of the discounts from that happen in the retail environment, but you won't see nearly the, I think, volatility of retail pricing in fiscal and calendar year '23 as we saw in '21 and '22. So I think there'll be a little bit more certainty for the consumers.\n\nThose consumers who haven't been in the market for three to four years will see some prices that they're maybe not as used to. But the dealers do a great job of selling the ROI in terms of the lifestyle and the economic benefits of being in an RV versus on airplanes and in hotels.\n\nMartin Mitela -- Raymond James -- Analyst\n\nThank you. And my follow-up, actually, would you mind giving a little bit of color to where you expect price trending for wholesale?\n\nMike Happe -- President and Chief Executive Officer\n\nWe tend not to provide any forward-looking forecasts in terms of pricing. As I mentioned earlier, the need to price, because of lower inflation in our business and our pricing power, is different than in -- especially the last fiscal year. But at this time, we won't share any forward-looking comments on intended pricing actions.\n\nMartin Mitela -- Raymond James -- Analyst\n\nOK, thank you.\n\nOperator\n\nThank you, and one moment for our next question, please. Our next question comes from the line of James Hardiman with Citi. Your line is open. Please go ahead.\n\nJames Hardiman -- Citi -- Analyst\n\nHey. Good morning. So wanted to circle back to your RVI guidance commentary. Sounds like you think maybe a little bit lower than what they're looking for in terms of shipments, but I guess, more importantly, in line with retail and wholesale.\n\nSo I guess my question is, is that a fair way to think about your business over the next year, similar levels of units for wholesale and retail? And maybe if you see big differences between motorized and towables, that would help as well.\n\nMike Happe -- President and Chief Executive Officer\n\nYeah. From an industry perspective, what we stated this morning was for calendar year 2022 on RVs, we think that 500,000 shipment number is possibly attainable. It could come in a little bit under that, but I think 500,000 is a good target for the calendar year. We do think calendar year 2023, you will see probably somewhere in the range of 400,000 to 410,000 units shipped to the market.\n\nConversely, we think in calendar 2023 that at a macro level, you'll see a similar number of retailed RV units, somewhere in that 400,000-plus range. Now what that would insinuate is that not a lot of field inventory and macro would be coming out of the field. I think this is a mix or a balance topic. I do think you're going to see some towable inventory come out of the market in calendar '23.\n\nYou'll see a little bit of motorized inventory be built up. On the marine side, both of our businesses will probably continue to very carefully raise inventory levels where they are dealers. Barletta, as an example, has dozens of open markets around the country where we do not have a dealer presence. And so you have to sometimes look at a company's field inventory position in the context of market share, dealer penetration, the momentum of its businesses overall.\n\nSo I think there's more opportunity for Winnebago Industries to add some inventory than maybe some of our competitors. But we'll see how the next several months go.\n\nJames Hardiman -- Citi -- Analyst\n\nThat make sense. And then I'm going to ask a question that I don't think anyone knows the answer to, but I figure I might as well ask here. As we think about this retail slowdown, right, there's sort of two -- there's two issues at play, right? I mean we had this COVID surge and maybe there's some -- there was some demand pull forward there. And so we're seeing the other side of that.\n\nBut then there are all these macro issues at play. Are you at all able to tease out what's what as we think about this retail slowdown? And I guess the reason I asked the question is I think there's some debate as to whether or not we're looking at sort of a one-year shakeout, right, which would be, I think, consistent with maybe what we've seen in the past 2018, 2019 time frame where it was sort of an industry rightsizing itself or versus 2024, is there sort of more declines to come, which would maybe be more consistent if, in fact, there are macro pressures mounting.\n\nMike Happe -- President and Chief Executive Officer\n\nWell, let me be clear. We will operate our business with the paranoia that headwinds could last for a little while, but we will certainly hope they don't last very long. Every slight downturn in a cyclical industry has its own different elements and dynamics. This one is no different.\n\nThis one is different than 2018 and 2019, which, I believe, was also tied to some industry unit overstocking in the RV world during that period. I think the major pressures we're seeing right now in terms of consumer spending on outdoor recreation is a pressure on discretionary spending capabilities due to higher food costs, gasoline costs, other service costs they might be experiencing. Number two, the inflation of the products themselves in the outdoor rec category that they're looking. And three, we are seeing a meaningful rise in interest rates.\n\nNow interest rates are still historically in a decent spot, but these are products that probably two-thirds of our customers finance over a 15 to 20-month period, and they have seen interest rates in the last -- in nine to 12 months take a meaningful step up. And so they will analyze that in terms of the timing and ability to purchase. So if we can see some of the macroeconomic shifts to help relieve some pressure on any of those variables, our business will most likely recover. Remember, the RV business is generally one of the first industries to see some of the softness in a macroeconomic recession.\n\nIt's also one of the first businesses to potentially act with optimism when consumers are starting to feel more confident. So we don't have a crystal ball either on the time line. So we'll manage the business week to week, month to month and be very prudent with how we're managing it, but we'll be very well positioned to take advantage of a healthier market when that day comes.\n\nJames Hardiman -- Citi -- Analyst\n\nGreat. That's some good color on, obviously, a tough for all of us.\n\nOperator\n\nThank you, and our next question will be in just a moment. And our next question comes from the line of John Healy with Northcoast Research. Your line is open. Please go ahead.\n\nJohn Healy -- Northcoast Research -- Analyst\n\nThank you for taking my question. Wanted to kind of switch gears just a bit thinking about capital allocation. Obviously, you saw the business kind of move in this direction throughout the quarter. And to some degree, you kind of saw this coming.\n\nBut you were extremely active on the buyback front this quarter, which I feel like is kind of counterintuitive to what I see a lot of companies do, usually buy their stock back when the business is great. You bought your stock back when business is softening up. How do we think about that for fiscal '23 in the framework of the low 400,000 unit number? Would you expect to be hit in the buyback in the same way you have or do you pause there? And what are your thoughts about M&A as the industry shakes out a little bit either on the boat or the RV side of things? Do you step on the accelerator there a little bit?\n\nBryan Hughes -- Chief Financial Officer\n\nHey. Good morning, John. This is Bryan. I will address that initially here.\n\nAnd if Mike has any follow-up, I'll, of course, leave that to him. We really haven't changed our capital allocation strategy. Even in this past year, we stuck to our strategy. We invested organically pretty significantly with some capacity expansions that were certainly necessary given the demand on the product.\n\nWe acquired Barletta. And so we allocated capital to that strategic growth. We maintained our liquidity very nicely. We actually expanded our liquidity with that $350 million ABL.\n\nAnd then we returned cash to shareholders. And so that was certainly evident in our dividend increase, 50% increase on top of a 50% increase in the prior year. And then as you highlighted in your question, the share repurchase was very much a notable and very intentional use of our cash to get that back to shareholders. So I don't see that changing going forward.\n\nWe'll continue to look for the strategic growth opportunities, which we believe to still be plentiful. We'll manage our balance sheet very thoughtfully. We will certainly look to return cash to shareholders. We, as you noted, in August, announced a $350 million share repurchase authorization that our board approved.\n\nAnd so we'll continue to tap into that as we deem prudent. But I don't see it changing. It hasn't changed this past year. We're very much stuck to our narrative on capital allocation, and we will continue to do so going forward.\n\nShare repurchase is a great opportunity for us. We felt and still feel that our shares represent good value. And so that enters into the calculus as we consider when and in what magnitude we go to the market to do share repurchases. That will continue to be the case.\n\nBut we view going forward that our allocation priorities really will remain as I stated.\n\nJohn Healy -- Northcoast Research -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you, and one moment for our next question. And our next question comes from the line of Brandon Rolle with D.A. Davidson. Your line is open.\n\nPlease go ahead.\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nGood morning. Thank you for squeezing me in here. Just a follow-up on towable margins. Are you saying that we shouldn't see a sequential decline from here or are you expecting to see a little more stabilization in the first half before settling out and the second half of fiscal year 2023?\n\nBryan Hughes -- Chief Financial Officer\n\nYeah. Thanks, Brandon. I guess I'd point to a little bit of history. We've referenced in our prior answers that we expect margins to normalize.\n\nIf you look back at some of the prior margins or EBITDA margins we've realized in the towables business specifically, they have been in that 10, 10 and a half percent range in previous Q1s. We've mentioned that here in our fall Q4 period that we pulled forward some of the program discounting for open house that affected the margins in part here in Q4. So even in those years previously where we've had 10, 10 and a half percent margins in Q1, we ended the year in that 13%, 14% range. And I think the best method we're trying to convey here is, hey, look, it's one quarter.\n\nWe still have a lot of confidence in our product line and the strength of our portfolio to deliver in that 13%, 14% EBITDA margin range for the towables business over the long term. And we don't necessarily view our calendar year 2023 any differently sitting here today. It's a very volatile environment we're dealing with in terms of the inflationary pressures, the costs. Mike cited some of the commodity volatility, and a lot of which are coming down here as one of those factors, and we're trying to weigh the forward view of cost and what's going on as it relates to our cost input and the impact that that has on our near-term pricing decisions.\n\nSo very clearly, we're not managing the quarters. We always have our eyes on the quarter certainly and believe that we're doing our best to manage within a quarter, but that's not how we make decisions. We make decisions for the long term and what we think is best for the portfolio. So I guess, hopefully, that additional color in just helping all of you recall the margins that we've had in the fall period in past years while still delivering very healthy margins in the towables segment for the full fiscal year.\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nGreat. And just one quick follow-up. On your retail guidance for next year kind of implies down 10%. Kind of where do you see your brand shaking out versus the industry? Do you feel like you'll be able to outpace the market by 10, 15 percentage points or your brand is kind of trending in line with that guidance?\n\nMike Happe -- President and Chief Executive Officer\n\nBrandon, this is Mike. I would answer that with this phrase, the standard is the standard here. We have been taking share consistently over the last six to seven years in the RV business as we've acquired brands and then grown them organically after they're in our portfolio. And we expect to continue to do that.\n\nWe're well aware of the competitive landscape. And -- but the expectations at Winnebago Industries is for each of our five brands to take share in their respective outdoor categories. And so some years, that will be more. Some years, that will be less, but the expectation is similar year to year.\n\nI can tell you, and I usually do this each call, retail through the first part of the first quarter is relatively stable versus what we saw at the end of Q4 and, in fact, has been trending a little healthier from a comp percentage standpoint. And so we're not seeing in some of our latest retail results, on the RV side specifically, a comp percentage decline that is as steep as it was in the July, August months. And so that's a little bit of a factor of the comparatives getting a little bit easier. But this industry -- if this industry retails 400,000 units in calendar year 2023, which is our current estimate as of this date, that's a healthy amount of consumer retail historically in that space and especially in a post COVID environment.\n\nSo we'll compete for everything we can get.\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you, and one moment for our next question. And our next question is a follow-up question from Tristan Thomas-Martin with BMO. Your line is open. Please go ahead.\n\nTristan Thomas -- BMO Capital Markets -- Analyst\n\nI thought I hopped out. Everything I was going to ask have been answered. Thanks, guys.\n\nMike Happe -- President and Chief Executive Officer\n\nThanks, Tristan.\n\nOperator\n\nThank you. And I'm showing no further questions at this time. And I would like to hand the conference back over to Ray Posadas for any further remarks.\n\nRay Posadas -- Vice President, Investor Relations and Market Intelligence\n\nThank you, everyone, for joining today's call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRay Posadas -- Vice President, Investor Relations and Market Intelligence\n\nMike Happe -- President and Chief Executive Officer\n\nBryan Hughes -- Chief Financial Officer\n\nTristan Thomas -- BMO Capital Markets -- Analyst\n\nScott Stember -- MKM Partners -- Analyst\n\nMike Swartz -- Truist Securities -- Analyst\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nFred Wightman -- Wolfe Research -- Analyst\n\nPatrick Buckley -- Jefferies -- Analyst\n\nMartin Mitela -- Raymond James -- Analyst\n\nJames Hardiman -- Citi -- Analyst\n\nJohn Healy -- Northcoast Research -- Analyst\n\nBrandon Rolle -- D.A. Davidson -- Analyst\n\nMore WGO analysis\n\nAll earnings call transcripts"
}