{
  "companyName": "LSI Industries",
  "companyTicker": "LYTS",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/18/lsi-industries-lyts-q4-2022-earnings-call-transcri/",
  "content": "LSI Industries (LYTS -1.21%)\nQ4 2022 Earnings Call\nAug 18, 2022, 11:00 a.m. ET\n\nOperator\n\nGreetings and welcome to LSI Industries' fiscal fourth quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host Jim Galeese, chief financial officer. Thank you. You may begin.\n\nJim Galeese -- Chief Financial Officer\n\nGood morning, everyone, and thank you for joining. We issued a press release before the market opened this morning detailing our fiscal '22 fourth quarter and full year results. In conjunction with this release, we also posted a conference call presentation in the investor relations portion of our corporate website at www.lsicorp.com. Information contained in this presentation will be referenced throughout today's conference call.\n\nIncluded are certain non-GAAP measures to improve the transparency of our operating results. A complete reconciliation of GAAP and non-GAAP results is contained in our press release and 10-K. Please note that management's commentary and responses to questions on today's conference call may include forward-looking statements about our business outlook. Such statements involve risks and opportunities, and actual results could differ materially.\n\nI refer you to our safe harbor statement, which appears in this morning's press release, as well as our most recent 10-K and 10-Q. Today's call will begin with remarks summarizing our fiscal fourth quarter and full year results. At the conclusion of these prepared remarks, we will open the line for questions. With that, I'll turn the call over to LSI president and chief executive officer, Jim Clark.\n\nJim Clark -- President and Chief Executive Officer\n\nThank you, Jim. And good morning, all. Thank you for joining us today. As we're here discussing our fourth quarter and full year results.\n\nThe short version of the story is we had a great year. Before we go into the specifics, let me take you back a short three years ago to 2019. As a management team, we sat down with a commitment to our shareholders in the market that we would be a $500 million company with double-digit EBITDA in 2025. Sales at that time were teetering around $300 million, EBITDA was approximately 3%, and our company's momentum was a bit flat.\n\nWe set out to design and execute a plan which was to make our company a better company before we made it a bigger company. We engaged our workforce to strengthen our relationship with our customers and agents and put together a focus on specific vertical markets where we believed we could add value and differentiate ourselves as a key partner. We were choosy about the markets we selected. We looked for vertical opportunities that matched up well with our core competencies, had the right ingredients for sustainable growth, and we do recognize the value and differentiation we were trying to achieve.\n\nA good example of that vertical market selection was a grocery. Back in 2019, before the pandemic, we felt there was a real opportunity for remodel and new store development in the grocery space. Their traditional grocers were being disrupted by customer experiences of new entrants like Whole Foods, Fresh Market and Amazon. The big guys in groceries wanted to change the look and feel of their stores to compete on a different level and LSI was a perfect fit.\n\nWe provided high efficiency, energy saving, low maintenance, and outdoor lighting, coupled with graphics, and signage on the buildings. Moving indoors, we offered high-quality, high-efficiency indoor lighting with modern, engaging graphics and signage to the interior of the stores. We also offered project management, project management, and a full turnkey solution that took a lot of the burden of the store team and allowed them to focus on other activities. Looking further into the grocery vertical, we look for ways to grow and increase our value, and we identify JSI Fixtures as a great complement to the solutions we are already providing.\n\nBut the acquisition of JSI in May of 2021, we added refrigerated and stand-alone displays, and we were able to create a continuity in the look and feel of the products is only possible when these solutions come from one company. This year, the grocery was our number one vertical market, replacing C-store and refueling stations for the first time in the company's history. The best part is we have other vertical markets we feel represent growth opportunities that could be just as strong as grocery and continue to propel us forward. Given all of this today, we celebrate our fourth consecutive quarter with sales of over $100 million in each quarter, and a total sales revenue of $455 million, with 7.7% adjusted EBITDA for the year, and 8.3% adjusted EBITDA in the fourth quarter.\n\nAll underpinned by a very robust pipeline as we work into our first quarter of 2023. Great pricing discipline, margin management, and sales execution would be the theme for 2023, and clearly, our goal of $500 million is well within reach. You can be assured we'll be sitting down in the next quarter or two to plan out our next target. As I said, we have good reason to celebrate, we have not merely talked about our plans, but we put those plans into action and have shown the results.\n\nGoing back to 2019, we also made the decision to restore as much of our supply chain as possible. At that time, around 80% of our materials were coming from overseas. I'm happy to say, today that number is around 30%, but we moved almost 70% of our sourcing to domestic and North American suppliers. Along with that move, we decided to strategically increase our inventory levels.\n\nThe lumpiness of the supply chain and transportation delays in the supply chain were interfering with our ability to deliver our products on time. We increased our inventory by almost $20 million in the first half of the year. As you know, this impacted free cash flow a bit in the first half of the year, but in doing so, we reduced inefficiencies in our manufacturing process. And improve our overall profitability, effectiveness, and on-time delivery.\n\nThis performance was noticed. It was noticed by our agents, our customers, and our competitors. We took a share in the market and we created stickiness with these new customers by maintaining our commitment and reliability as a good, strong partner. Simply put, we did not have to start and stop our manufacturing processes because of limited parts availability.\n\nNow, I expect on a comparable basis, our inventory levels remain elevated for some time. It just makes sense to have it maintain a higher level of inventory and take a lot of the uncertainty out of our processes. With that said, it does not mean that we cannot tune that level some. And as you may have already noted, we are bringing inventory levels down.\n\nWhich has resulted in improved cash flow, which was positive for the third and fourth quarters, and I expect that performance will be maintained. Given this, you also note that our debt has improved below $77 million and our debt ratio is around 2.2%. This is a good cash flow business and we will continue to take on debt and consider other opportunities as our company continues to perform. In closing, I want to recognize and say thank you to the almost 1,400 employees of LSI, along with our agents, and partners.\n\nNone of this would be possible without a great team of people and strong leaders. The dedication of our people to participation, engagement, and leadership is truly remarkable. The last few years have not been easy on any business or person. The constant narrative that hard times are just around the corner can be exhausting.\n\nBut it reminds me of the saying that hard times create strong people, and strong people create good times. We're not in charge of the broader economy, but I can tell you that we have strong people. And because of that, I'm confident we can continue to create good times. I'm pleased and excited about the momentum we've developed.\n\nI see robust order and quote activity leading into our new year. And I hope you will continue to take a close look at LSI and see the solid execution this team continues to provide. We have a lot of runway in front of us. With that, I'll turn the call back over to Jim Galeese for a closer look at the numbers.\n\nJim Galeese -- Chief Financial Officer\n\nThank you, Jim. We finished fiscal '22 with a strong fourth quarter. Net sales were a record $127 million growth of 31% over the prior year, a 16% increase sequentially from Q3, with both reportable segments generating significant growth. Fiscal fourth quarter earnings also improved significantly.\n\nAs non-GAAP earnings per diluted share were $0.21 compared to $0.12 per share last year, adjusted EBITDA increased to $10.6 million or 56% over last year. Margin expansion was a strong focus throughout fiscal '22 and the business attained our highest levels in the fourth quarter with our adjusted operating margin improving 160 basis points versus last year and adjusted EBITDA increased 130 basis points to 8.3% of sales. Incremental sales growth in target market verticals, selling price aligned with inflationary impacts, and disciplined cost management productivity, all contributed to margin expansion. For the fiscal year, the business executed at a high level throughout the year, with all four quarters generating significant year-over-year sales and earnings growth despite a challenging operating environment.\n\nSales increased 44% to a record $455 million, adjusted net income improved to $18 million, 84% above the prior year, and adjusted earnings per diluted share increased to $0.64 versus $0.35 last year. Adjusted EBITDA increased to $35 million or 66% above fiscal '21. In fact, these results represent the highest EPS and adjusted EBITDA attainment in a number of years. We discussed in previous calls the purposeful decision to invest in inventory, specifically in the first half of the fiscal year to mitigate supply chain challenges and support sales growth.\n\nAn improving supply chain allowed us to reduce inventory levels in Q4, contributing to a higher rate of earnings conversion to cash. As a result, free cash flow increased to $8 million in the fourth quarter. Improve cash flow served to reduce net long-term debt to $77 million in Q4, lowering the ratio of net debt to trailing 12-month adjusted EBITDA to 2.2 times. A regular cash dividend of $0.05 per share was declared payable on September 7th for shareholders of record on August 30th.\n\nShifting to segment performance. Both segments achieve substantial increases in sales and operating income for the quarter, improving both sequentially from Q3 and to the prior year. Sales for the lighting segment increased 29% year over year in Q4, continuing strong growth in key vertical markets. Lighting generated a gross margin rate of 31% in the quarter 210 basis points above the prior year, reflecting additional volume leverage and successfully aligning selling price with inflation.\n\nFor the fiscal year, lighting sales increased 24%. Growth was balanced with double-digit growth realized in multiple market verticals and through both the project and distributor [Inaudible] stock channels. Growth was driven by multiple factors new products, expanded selling efforts, several effective marketing programs for both our channel partners and end users, and product availability enabled by our investment in incremental inventory. Lighting enters fiscal '23 with continued momentum with favorable quotation and order activity in the last three months book-to-bill ratio over one and a backlog approximately 30% above the prior year.\n\nFourth quarter sales for our Display Solutions segment increased 35% versus last year, led by the grocery and quick service restaurant verticals. Growth in grocery was led not only by continued strong demand for JSI display cases across national multiple chains, but our printed graphics also had a solid quarter with several key accounts. This supports the solutions selling approach we're utilizing in the grocery vertical. We continue to successfully execute the major QSR Digital Menu Board program initiated in fiscal '21 and have begun supporting the additional awards received resulting from our performance.\n\nActivity for both will run through fiscal '23 and beyond. For the full fiscal year, Display Solutions sales increased 75%, including the impact of the JSI acquisition, which occurred in the fourth quarter of fiscal '21. All display solutions vertical markets realized increased sales except refueling, which was down slightly because of the ongoing site construction delays. Program proposal activity remains at a very high level, however, and we recently received a rebranding program from a major oil company providing a turnkey solution, including both product and installation services for locations in Puerto Rico.\n\nWe anticipate this program will generate more than $10 million of new revenue in the first half of fiscal '23. Fiscal '22 operating income for display solutions increased to $18.1 million or 8.2% of sales fundamentals for the market verticals in this segment remain positive and our outlook is favorable as we enter fiscal '23. I will now turn the call back to the moderator.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Amit Dayal with H.C. Wainwright. Please proceed with your question.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nThank you. Good morning, everyone. Appreciate you taking my questions. Most of my questions are just based around the outlook.\n\nFor next year relative to the $500 million revenue target for 2025, it looks like you're almost there. Will it be too aggressive to assume that you could hit that number in fiscal '23?\n\nJim Clark -- President and Chief Executive Officer\n\nWell, Amit, first of all, thanks for joining us, and good to hear you. I'm always trying to -- or we are always trying to just make sure we deliver on what we say. There's environmental, there's still a lot of challenges. I feel very positive about the first quarter and I feel positive about where we can be in the year.\n\nI'm not -- I don't want to commit that we're going to hit the $500 million. But I will say that based on the momentum we've generated over the last few years, we're certainly on our way to it.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nUnderstood. And then, operating leverage has improved significantly, adjusted operating income grew by, I think, over 150%, while revenues grew by 44%. Is this sort of the level of adjusted EBITDA margins we can expect in a more steady fashion for at least fiscal '23 for you, guys?\n\nJim Galeese -- Chief Financial Officer\n\nYeah. Hi, Amit. This is Jim Galeese here. Yes, we've worked hard.\n\nIf you go back a couple of years, we identified that we needed work on our margin expansion. And so if you look at what we've accomplished over the last several years in this area, we're very proud of that, it's no accident. And it involved multiple levers, both commercial initiatives, and operational initiatives. And, we're going to continue to work both those levers, and we do see that we can maintain and continue to enhance, both our operating and EBITDA margins moving forward.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nUnderstood. Your book-to-bill ratio entering the fourth quarter was 1.1. Is it stronger entering the first quarter of '23?\n\nJim Galeese -- Chief Financial Officer\n\nI'm sorry, Amit --\n\nJim Clark -- President and Chief Executive Officer\n\nIt was a book-to-bill ratio of 1.1.\n\nJim Galeese -- Chief Financial Officer\n\nOK.\n\nJim Clark -- President and Chief Executive Officer\n\nAnd, yeah, I mean it -- coming into Q1 it's remaining at that level, and we take a daily look at it obviously, but we're right at that level.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nIn terms of the backlog that backlog mix, guys, could you maybe give a little bit more granularity on what is in the mix, maybe just an overall percentage of the different revenue sources?\n\nJim Clark -- President and Chief Executive Officer\n\nWell, our two reportable segments are Display Solutions and Lighting. And if you go back a couple of years, we were 70/30. Today we're 50/50 and it stays there. It's staying there.\n\nIt's on balance, we have a couple of large projects that we tend to work, and then most of it is smaller infill products, but from a mix standpoint, it's 50/50 right now. Lights and Display Solutions.\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nThank you, Jim. Really good to see such a strong execution in this type of environment. So congratulations on that. I'll take my other questions offline.\n\nThank you.\n\nJim Clark -- President and Chief Executive Officer\n\nThank you, Amit.\n\nOperator\n\nOur next question comes from the line of George Gianarikas with Canaccord. Please proceed with your question.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nHey, guys. Thanks for taking my questions. Appreciate it. Just maybe to start.\n\nI'm curious as to what led to the decision to reduce inventory. As you see things in the marketplace that suggest a supply chain loosening such that you feel comfortable bringing down inventories today, and then increasing your position to gain share in the marketplace? Thanks.\n\nJim Clark -- President and Chief Executive Officer\n\nYeah, George. Thank you for joining. You hit the nail on the head, we're just seeing a couple of supply issues kind of strengthen and get more reliable. And so, we knew that about 20 million is where we wanted to be.\n\nI don't think we ever got excessively heavy. I think that we're going to -- on a year-over-year basis on a comparable you're going to see us carry a heavier inventory likely for years to come and --\n\nJim Galeese -- Chief Financial Officer\n\nFrom a historical level.\n\nJim Clark -- President and Chief Executive Officer\n\nYeah, from historical levels. And the reason for that is to take out some of that variation in supply chain and transportation in that. But we have definitely seen some improvement. And we want to be diligent about taking advantage of that and reducing some of the positions we had had.\n\nThat's all it is. It is not it has nothing to do with weaker sales, or volume, or anything like that. Just some of those items have stabilized, and we see it as an opportunity.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nIs there still an opportunity to maintain even higher inventory levels? How do you balance that, versus buybacks, versus, I'm assuming there's some technology obsolescence that you have to deal with? I'm just curious, as to how that math works out pretty well?\n\nJim Clark -- President and Chief Executive Officer\n\nYeah. So, working backward from what you just said, we try to -- the way we try to manage our inventory is driven by a couple of things. One is availability, right? We don't want to have the orders and not be able to ship the product. And I think that over the last couple of years, that's been a significant competitive advantage for us, is that it was really about availability and we made sure that we looked at the key components and the ones that we felt were at highest risk, and we made sure we had sufficient inventory to carry us through that.\n\nThe second element we look at is technology and obsolescence. We do not want to get upside down on something that is moving toward obsolete. But something we've done over the last three years is really looked at reengineering our products. And part of that reengineering was cost performance, but also just uniformity in parts that we use across our product line.\n\nSo that's a big lever for us in hedging against obsolescence. But even with those, we're very careful about where we stock up on anything that could be subject to obsolescence. And then, the third is, like I said, the supply chain is getting more reliable. For us in particular, we tried to move from offshore to onshore, and we did this pre-pandemic, who would have known? But it was part of our plan.\n\nWe were about, 80/20 offshore. If you went back four years ago, we were about 80/20 offshore. Today, we're about 30% offshore and 70% domestic in North America. And so, all three of those levers just give us an opportunity to kind of takedown that inventory a little bit.\n\nJim Galeese -- Chief Financial Officer\n\nGeorge, Jim Galeese here, in the last couple of years, we've launched a record number of new products, right? And we've done a really nice job on the phase in, phase out process of that, despite the ongoing supply chain challenges. So we're confident, moving forward as we continue to go through technology changes are just phased in, phase out of new products that, we're going to be able to manage the inventory situation effectively.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nThe second question has to do with the strength in your business, I mean you guys are putting up really great results and you juxtapose that next to some of the things that we're reading in the paper about economic weakness. I mean, how do you balance what you read about, and you kind of alluded to on the call versus the strength you're seeing in the business? I mean, are you hearing any anecdotes from customers about issues, or is it full steam ahead? Or you're gaining so much market shares, in your opinion that you've been able to buttress yourselves from any macroeconomic weakness?\n\nJim Clark -- President and Chief Executive Officer\n\nNo, we're not -- we're certainly not immune to anything that could happen to the broader economy. We're all consumers here, we're all seeing, pain points and in terms of inflation, from gasoline to groceries. And, obviously, we're seeing the supply chain issues work out in all kinds of different places, whether it's the availability of if you wanted to go buy a new car, or machine, upgrades, we want to do here all of those types of things. When we look at our business, though, a lot of the decisions we made early on or what's giving us the momentum to work through this.\n\nWe are not seeing a slowdown in quote activity. We're certainly not seeing a slowdown in demand, as evidenced by the numbers that we're just publishing here in Q4, and you look at Q3 and you look at Q2 before that. I know the narrative is out there relative to hard times, and kind of the broader economy, and we're aware of it. But I will tell you honestly, we're just not seeing the impact, although we're preloaded to be ready if we do.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nGot it. And I could focus on your margin targets. Have you given us targets that a company that has $500 million in sales, or should we just assume the sort of similar leverage that you've shown over the last year?\n\nJim Clark -- President and Chief Executive Officer\n\nYeah. I think as Jim Galeese mentioned earlier, we've still got levers we can pull. And there are two things I'll say, one is as we get bigger, we get more efficient, and our utilization improves. We did a lot of restructuring three years ago, we sold some properties.\n\nWe consolidated a number of operations, but when we did that, we left capacity in the locations that we maintain and that we kept. And as we continue to absorb some of that capacity, we become more efficient that hits margin. The second thing is, I think right now there are still a lot of inefficiencies that are built-in because of the supply chain challenges that workforce issues, those types of things. I believe as those things continue to stabilize, we already have put the work in.\n\nWe'll just benefit automatically as those things stabilize, reducing inventory. Obviously, the higher inventory you have, the more you're moving around, the more you're storing, and the more work that is. And just from an efficiency standpoint, that's not great, but we need to do that right now to assure availability and all those types of things. And it's worked out very well for us.\n\nBut as we reduce inventory, as the workforce kind of stabilizes, continues to stabilize, the supply chain stabilizes, we have some natural efficiencies that will benefit and you'll see that in the margin.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nThank you. And maybe a final question. You announced buybacks, which is great. Any guidance on the timing of that buyback? Is it open-ended? Do you expect to be finished with that in a number of years? That would be great if you could give us a little guidance on that.\n\nThank you.\n\nJim Clark -- President and Chief Executive Officer\n\nYeah, the buyback is definitely open-ended. And, we looked at it as a management team and as a board and said at the levels that our stock was trading at it, just did not make sense. Our capital models are pretty well defined, we're flexible. We look at them all the time.\n\nBut, debt for us, debt investment kind of take, is kind of at the top of that pyramid. And the reason why we would focus on debt only is because it gives us opportunities. And in terms of investment, we make investments that we think can generate a higher return than maybe some other activities we can do. And then, we have in that mix the buyback.\n\nAnd as the stock price goes up, I think the market naturally says, hey, listen, your money might be best served to do, paying down debt and reloading and being able to be a little bit more opportunistic in the market or make some investments that we have gain productivity. So right now, it's still on the table and still in our top two, top three mixes. But we don't have -- I can't say that we have any specific plans to pull the trigger for optics or anything else. We want it to make financial sense.\n\nAnd obviously, as we're looking at the stock price today, as the stock goes up, it makes less and less sense. But if the stock did get depressed or settled again, you can be assured we would act on it.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nWell, thanks for taking the time, and congratulations on a great quarter and executing in a tough environment. Thanks.\n\nJim Clark -- President and Chief Executive Officer\n\nYeah, George, and I can't say thank you enough for taking the time. I know it was a challenge, so I appreciate the extra effort.\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nOf course.\n\nOperator\n\nOur next question comes from the line of Rick Fearon with Accretive Capital Partners. Please proceed with your question.\n\nRick Fearon -- Accretive Capital Partners -- Analyst\n\nGood morning, Jim, and Jim. And congrats on another terrific quarter.\n\nJim Clark -- President and Chief Executive Officer\n\nYeah, thank you, Rick.\n\nRick Fearon -- Accretive Capital Partners -- Analyst\n\nSo the first question is just around the forecasting of LSIs growth today, and Jim started off by comparing the state of affairs three years ago. It's apparent today that the company's transformed into a much more diversified business, with more orders, and a larger number of customers, constituting that revenue base. And so, yes, I just wondered about your commentary around the forecasting today versus three years ago, the predictability of that, the stability of sales, as you see it, whether some of the lumpiness of sales is ironed out with the transformation of the company.\n\nJim Clark -- President and Chief Executive Officer\n\nYeah. I mean, I think that is a great question, Rick. And I think from the company's perspective, from a company standpoint, yes, we've become much more stable, and have better visibility. Our forecasting is better, our commitment from our customers, our salespeople, and our agents are much better, and that all works.\n\nEnvironmentally a lot of that progress is offset just by the current environment, and I don't think anybody's immune to it. There's so much instability in the general kind of economic market that we're not only trying to forecast what we'll do and what our agents will do, but what their customers are doing and then what their suppliers will do to them. And, we've seen it run the gamut in terms of a new surprise all the time. At one point it's copper wire, at another point it's sheetrock, at another point, it's acoustical ceiling tiles or asphalt for a parking lot.\n\nSo there's a lot of, cause to be cautious relative to making any bold statements on forecasting or what we see the future to be. But I can tell you this, and I've said it before, and I think that we followed through every time we've said it, our quote activity remains very strong, historic levels, and our order activity remains strong. And as I mentioned in the beginning, our book-to-bill remains elevated. So all of those indicators say we're going to be strong.\n\nBut I don't -- for me to be on the spot and try to forecast out more than six to eight weeks, I just don't want to be that guy that gets caught. But, I will say that generally, I'm very optimistic.\n\nRick Fearon -- Accretive Capital Partners -- Analyst\n\nUnderstood. And it would seem that the greater focus on the grocery vertical probably provides a little less cyclicality in the sales, at least the petroleum. And I guess that leads to another question, which is regarding, additional verticals that you've targeted. Are you able to talk about some of the -- you alluded to opportunities to grow outside these verticals that you've identified? Are there things that you can speak to today, or should we hold off to hear about that?\n\nJim Clark -- President and Chief Executive Officer\n\nYeah, I mean, I'd rather hold off on any specifics on expanded verticals because this serves a couple of purposes. And one of them, which is just frankly, our guys -- our agents, our guys, we want to stay narrowly focused on the verticals we've already identified that do create great growth opportunities for us. Grocery is something that we had identified far before the pandemic and I talked about it a little bit in my comments in the beginning, which were that we saw disruption going on, and so we saw an opportunity there. The pandemic kind of accelerated in groceries, right, where we kind of forecasted it would be.\n\nPetro the refueling stations, they aren't necessarily any weaker. They are just under pressure, frankly, it's permitting and things like that. And it's the underlying infrastructure, state, federal, and local municipalities that are just slower to recover and they're holding up projects. It's not an activity, it's not interest, it's not a quote.\n\nIt's just getting them to be converted where, frankly, folks can go out and, put a shovel in the ground and start some of these projects. Even with that, I think that if the tempo had remained high in petro, we still would have won with grocery. I mean, the grocery was just such a powerful combination for us and it's all around that broader share of wallet, that we're in a specific vertical, and we're just offering more in terms of a solution. And it's -- one component is the product side, but don't forget, we do project management for a lot of these and these have been very important elements for us to win.\n\nWhen I think about our digital menu board, that that's now, in excess of a $125 million contract. And a big component of that was our ability to manage that nationwide and to make sure the deployments went good. That's the same formula we're using. It's an element in that formula with petroleum, and C-store refueling.\n\nIt's another element with grocery, so that's a big win for us. Automotive, automotive we've been very strong in, but it's under pressure right now, the market, in general, is under pressure. But of the projects that are coming up, we think we're taking share in that. A warehouse is something that has just, frankly, almost four times our thesis relative to where we thought we would be and we've been able to serve it.\n\nSo that's what's most important. The demand came and we weren't caught, again, because of a lot of uniformity between our parts -- the way we make our different products, we were able to shift and meet that demand. So of the verticals, we're in, we're doing good. And I'll just say this, Rick, we're experimenting with some others, but we like to do it in a smaller group so that we don't detract attention from anybody in case it's not going to meet our requirements in terms of velocity of growth and sustainability.\n\nWe don't want things that are a flash in the pan. If we're going to invest, we want things that have legs under them that can go 5, 7, 10, or 15 years.\n\nRick Fearon -- Accretive Capital Partners -- Analyst\n\nUnderstood. That makes sense. Thanks for that color, Jim. And then, regarding geographic growth and some of the slowdowns you were experiencing a couple of quarters ago in Mexico, those have been alleviated as well?\n\nJim Clark -- President and Chief Executive Officer\n\nYeah. I mean, I'll talk specifically in Mexico. Mexico, it's opened back up again, but it's still about half of what we expected. Again, no representation of lost projects or interest.\n\nIn fact, in this situation, it is, again, a broader kind of government approvals and transactions, and getting paperwork across the desk. Nothing to do with us, but everything from permitting to transfer of assets, real estate transactions, and things like that. With that said, Canada opened up -- broadly opened up, and six months ago that has -- we've definitely picked up activity there. And you noticed in Jim Galeese's comments in our press release, we have a very good-sized win in Puerto Rico with a petroleum customer, which is not only a good project, a great project, but it's a new customer for us too.\n\nRick Fearon -- Accretive Capital Partners -- Analyst\n\nYeah, congrats on that. And just I mean, it's exciting to hear additional international markets opening up, so that is really encouraging. The two other questions just regarding margins and the margin improvement continue to be really impressive. Definitely, doing a lot of things right, and I'm curious, with respect to kind of keeping that momentum going, if if you've been able to identify another niche-oriented sort of add-on sales, that might be bundled together, higher margin business when you're in these projects on the ground, that can kind of continue to improve your gross margins?\n\nJim Clark -- President and Chief Executive Officer\n\nYeah. I mean, great question. And frankly, it goes back to that broader share wallet, right? Which is, if we're going to walk in and get the confidence of a customer, we want to solve as many of their problems as we can. And when we're on-site, when we're doing the project management, when we are managing the logistics in the background, it gives us tremendous flexibility to work around delays.\n\nIt might happen somewhere else where we can pivot and accelerate something while we're delayed by something else. We have a list of -- we were constantly contributing to it, and scratching things off, and trying to figure out a way in. But we do have a list of our vertical markets and things that we think we could add. And, sometimes we're successful in the conversations, with companies that might have these products, or ways that we might be able to engineer them, and sometimes, things are on the sideline, JSI is a great example.\n\nJSI is kind of purposefully sourced if you will, and we were very fortunate to be able to get together with such a good, strong company, and added to our portfolio. We have others that are out there like that. And this goes back to, some of the questions we were just talking about in terms of prioritization, stock buyback, and debt reduction investments. And, those are things we think we continue to invest in.\n\nAnd as long as the stock price remains elevated, then we can focus on those things. And we do have a list that we're in, pursuing. And then after that, it's just there are a lot of cards that have to fall in place.\n\nRick Fearon -- Accretive Capital Partners -- Analyst\n\nThanks for some of that commentary, Jim. The last question is more of a comment since you've addressed the stock repurchases. And I would -- I just encourage your -- the management team and as you sit with the board and think about valuations and all the multiple of sales that the company trades at less than one-time sales, where EBITDA soon should be 10% of sales really is, I got to believe from your perspective, frustrating. But from our perspective, it's just -- it's an opportunity that this company trades, continues to trade at this kind of discount, and certainly as compared to some of the competitors, albeit they are larger.\n\nBut as LSI grows, it should certainly grow into multiples like that. It just seems like there's an extraordinary opportunity, even at today's prices to retire some of these shares. The benefit, of course, being that you're buying back more of what we all have already come to loathe, which is this business, JSI part of it. You're buying more of JSI, you are retiring a dividend payment.\n\nSo there's some benefit there that those shares don't need to be paid their dividends going forward. And then, of course, reducing the share count improves your EPS. And I just encourage you to continue to think about what is clearly a dynamic valuation of the company. As the company grows and becomes more profitable, the valuation goes up as well.\n\nAnd the stock price in my mind, anyway, reflects an extraordinary opportunity. So not to belabor it further, but just encourage you to continue thinking about deploying some of the capital into stock repurchases.\n\nJim Clark -- President and Chief Executive Officer\n\nI appreciate that comment, Rick. And I want you to know this does not fall on deaf ears, not by the management team, not by me, and not by the board. We want to be very opportunistic. And, if that -- if the stock repurchase rises to the best opportunity, you can be assured, I'll execute against it, we will execute against it.\n\nRick Fearon -- Accretive Capital Partners -- Analyst\n\nYes. And I take you absolutely at face value on that. Thanks, Jim, and thanks. Thanks for the hard work, and congrats on a fantastic quarter again.\n\nJim Clark -- President and Chief Executive Officer\n\nYeah, thank you.\n\nOperator\n\nThis concludes our question-and-answer session. I'd like to hand the call back to management for closing remarks.\n\nJim Clark -- President and Chief Executive Officer\n\nI just want to say that, this is the end of our fiscal year, we're -- Happy New Year. We're actually into a new year here. Our first quarter is starting off very, very solid and I'm very encouraged by it. But I want to take a minute to just thank the effort of the whole team, the management team that's here, an outstanding effort.\n\nI can't tell you how dynamic, and how much work they all put in, and how they're constantly trying to look at things and solve problems from different angles. And I also want to say, thanks to all the team members that are here, we're almost 1,400 employees strong now. And we -- every business is only as strong as the people that are in it. And, for those of the employees that are listening, or family members or people that know folks here, I just want to say thanks.\n\nNone of this would be possible if we didn't have a stronger team as we do, and as good people as we do. So for all the people that are on the call or reading the transcript, thank you for taking the interest and we'll look forward to the next call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJim Galeese -- Chief Financial Officer\n\nJim Clark -- President and Chief Executive Officer\n\nAmit Dayal -- H.C. Wainwright -- Analyst\n\nGeorge Gianarikas -- Canaccord Genuity -- Analyst\n\nRick Fearon -- Accretive Capital Partners -- Analyst\n\nMore LYTS analysis\n\nAll earnings call transcripts"
}