{
  "companyName": "Krispy Kreme, Inc.",
  "companyTicker": "DNUT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/15/krispy-kreme-inc-dnut-q3-2022-earnings-call-transc/",
  "content": "Krispy Kreme, Inc. (DNUT -0.67%)\nQ3 2022 Earnings Call\nNov 15, 2022, 8:30 a.m. ET\n\nOperator\n\nHello. My name is Lisa, and I will be your conference operator today. At this time, I would like to welcome everyone to the Krispy Kreme third-quarter earnings conference call. [Operator instructions] I would now like to turn the call over to Mr.\n\nRob Ballew, head of investor relations. Please go ahead.\n\nRob Ballew -- Vice President, Investor Relations and Corporate Communications\n\nThank you. Good morning, everyone, and welcome to Krispy Kreme's third-quarter 2022 earnings call. Thank you for joining us this morning. Our third-quarter earnings release and an accompanying earnings presentation deck are available on the Investor Relations portion of our website at investors.krispykreme.com.\n\nJoining me on the call this morning is Mike Tattersfield, president and chief executive officer; Josh Charlesworth, global president, chief operating and financial officer; and Joey Pruitt, chief accounting officer. After prepared remarks by Mike and Josh, there will be a question-and-answer session. Before we begin, I would like to remind you that this call contains forward-looking statements made pursuant to the safe harbor provisions of the Private Securities and Litigation Reform Act of 1995, including statements of expectations, future events, or future financial performance. Forward-looking statements involve a number of inherent risks and uncertainties, and we caution investors that these risks could cause actual results to differ materially from those contained in these forward-looking statements.\n\nThese factors and other risks and uncertainties are described in detail in the company's Form 10-K filed with the SEC on March 11th of this year. Forward-looking statements made today speak only as of today. The company assumes no obligation to publicly update or revise any forward-looking statements, except as may be required by law. Additionally, today's call will include certain non-GAAP financial measures.\n\nA reconciliation between non-GAAP financial measures and their closest GAAP measures can be found in the company's third-quarter 2022 earnings press release and our Form 10-Q, which will be furnished certainly to the SEC and available at investors.krispykreme.com. With that, I'll turn the call over to Mike.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nGood morning, and thank you, everyone, for joining us today. We are pleased to share our third-quarter 2022 results, which were bolstered by accelerating organic growth that was driven by our continued successful execution of our omnichannel strategy. I want to start today's call by thanking our Krispy Kremers, our team members. We're driving another strong quarter of revenue growth, where we had positive organic growth in every country around the world despite a tough macro environment.\n\nWithout your efforts and dedication, this would not be possible. Gracias. As you all know, the purpose of our company is to touch and enhance the lives of others through the joy that is Krispy Kreme. In the third quarter, we celebrated our 85th birthday with sweet promotions around the globe, launched Doggie Doughnuts for our four-legged friends and helped support over a dozen charities around the globe, ranging from cleaning up the planet, driving blood donations, and supporting children in low-income communities.\n\nAnd we've raised more than $30 million through fundraising year to date. Fundraising is an integral part to Krispy Kreme's purpose and has been part of our DNA for many years as part of our efforts to give back and support local community and issues. We are proud to be a global company operating in over 30 countries, and campaigns like these highlight the joy we help create and how we can really drive genuine consumer connections with our brand in an impactful way. Turning to our performance.\n\nWe made terrific progress on our long-term strategy to drive our omnichannel model in the third quarter, demonstrated by a 17% increase in points of access from a year ago. And this led to global organic revenue growth of roughly 12% over the prior year. Total doughnuts sold during the quarter was up 6% globally from a year ago, more than 380 million doughnuts. That's a lot of doughnuts.\n\nWe saw strong performance in the U.S. in our hubs and spokes and Insomnia Cookies, as well as in Mexico, Australia, and New Zealand and market development, including a robust performance in equity on Japan. In addition to strong DFD performance, much of the growth was also driven by robust e-commerce sales, which represented 18.5% of retail sales, up 170 basis points from a year ago. The growth was led by Insomnia Cookies and Krispy Kreme in the U.S., which saw e-commerce mix grew a combined 370 basis points to 20.7% from a year ago.\n\nE-commerce growth was driven by an expanded delivery rates through partnerships with third-party aggregators, the addition of dark shops, and improved availability of our specialty doughnuts on our mobile app. While much progress has been made, we continue to see significant upside to our e-commerce platform in the coming years. Our U.K. market continues to see a challenged consumer environment impacted by soaring energy costs and overall inflationary pressures, which led to significantly declined general retail and supermarket traffic in the U.K.\n\nAdditionally, the strength of the U.S. dollar continues to impact our results, including reducing our net revenue growth by [Technical difficulty] and reducing our adjusted EBITDA in the quarter by approximately 3.1 million. Despite strong global organic revenue growth, adjusted EBITDA in the quarter declined modestly to 38.5 million due to FX challenges in the U.K. operating environment.\n\nIn the U.S., we ran higher promotional activity in the first two months of the quarter. But since September, we've significantly reduced our promotional activity without any impact on revenue, which has led to significantly improved gross profit trends. In the U.S. and Canada segment, our performance was driven by the strength of our hubs with spokes, highlighted by another increase in sales per hubs and double-digit same-store sales growth by Insomnia Cookies led by growth in e-commerce revenue.\n\nOrganic revenue grew 9% in the third quarter, while total revenue grew 12%. Our DFD business continued to gain momentum with the addition of two large regional partners, higher points of access, and we continue to see strong interest from potential partners. We also continue to strengthen our omnichannel execution with a successful premium pumpkin spice LTO in August which was launched simultaneously through DFD, retail, e-commerce, and branded sweet treats. Since then, we've also run our premium price Halloween LTOs across multiple channels, and we'll be using a similar approach during the Thanksgiving and winter holidays as well.\n\nWe continue to premiumize and innovate with the recent successful launch of Fritter Fridays to add to our hand-cut Cinnamon Roll Sundays, both of which are in our newer fourth-tier premium price point, which can be more than 50% premium to our original glazed doughnut. These LTOs and innovative products really drive buzz and brand love in addition to more profitable sales. Adjusted EBITDA in the third quarter increased 10% in the U.S. and Canada, with strong organic revenue growth and price increases offsetting higher promotional activity and margin loss in the hubs without spokes.\n\nIn our international market, all of our international countries, including those in market development, had positive organic growth in the third quarter, led by robust performances in Mexico, Australia, and Japan. Additionally, our U.K. business also had modestly positive organic growth with a successful omnichannel -- LTO despite cycling a tremendous quarter a year ago and coping with the worst consumer sentiment there in decades. One thing that gives us confidence with our omnichannel model is our ability to succeed in challenging markets as we reach consumers wherever they are.\n\nWhen you complement that with relevant products, strong brand partners and maximizing our celebratory occasions like our recent Minions Halloween doughnuts, in most markets across the globe, we really see strong engagement with the brand. Roughly half of our -- sales and adjusted EBITDA are outside the U.S., proving that Krispy Kreme is truly a loved global brand. As you know, our goal is to open in at least three new countries per year going forward. So far, in 2022, we've signed development deals in seven international countries, including announcing Jamaica this morning, as well as a recently announced joint venture in France for 2023, which together represent more than 5,000 points of access or nearly 50% of our existing points of access.\n\nFrance alone has the potential for more than 2,000 points of access, and we expect to open 500 there in the first five years. We will enter this market as a minority partner with a very strong operator in [Inaudible] which operates more than 200 Columbia cafes in France, with the right to acquire a majority stake in future years. Additionally, Americana, our franchise partner in the Middle East, recently opened a shop in Jordan for the first time and achieved the highest weekly sales ever in the Middle East. With a proven model, we are building a very strong pipeline for new market entries with both existing and new franchise partners, as well as looking at equity stakes in certain strategic markets.\n\nWe expect to be able to announce further market entries over the coming quarters as we continue our journey to become the most loved sweet treat brand in the world. While our omnichannel strategy has grown significantly over the last few years, lack of access to Krispy Kreme is still by far and away, the No. 1 reason customers do not purchase our product. Our DFD journey to this point has been led by points of access in grocery and convenience stores.\n\nHowever, we see the spokes strategy evolving over time to more channels. Just recently, we announced an operational test pilot of nine locations in Louisville, Kentucky and the surrounding area with McDonald's to serve Krispy Kreme Doughnuts, bringing together two iconic brands that have so much in common. Obviously, this is a small test to partner with a global company, but we think this represents the type of opportunity that shows why we remain very confident in our long-term goal of achieving more than 50,000 points of access globally. We believe that strong global partners could be a great fit to significantly grow our DFD business.\n\nWe continue to look for new partners and channels across the globe as we build out our hub-and-spoke model to increase access to customers, and we look forward to updating you on this journey. Wrapping up, I'm extremely proud of how the team has and continues to manage, evolve on pricing, growing points of access with excellent cost discipline as we manage external challenges like inflation and geopolitical pressures. Short-term macro challenges will remain in some markets, but I am confident in our ability to thrive highlighted by the strong organic growth in the third quarter, low levels of price elasticity, and the continued ability to expand our omnichannel model in new and capital-efficient ways. As I mentioned last quarter, we are very excited to be hosting an Investor Day on December 15 here at our headquarters in Charlotte, North Carolina, which will also be webcasted.\n\nAt that time, we will provide further detail on our strategic vision and long-term growth goals. We will have a number of exciting updates to share with you at this event and introduce our initial 2023 to 2026 outlook as well. I'll now turn it over to Josh to walk you through our Q3 financials and our outlook for the balance of 2022. Josh.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nThanks, Mike, and good morning, everyone. In the third quarter, our Krispy Kremers once again showed that our beloved brand and our unique business model combined to deliver growth across our sales channels and across the world. Sales revenue grew 10% to $378 million, with organic growth, which excludes the impact of franchisee acquisitions and changes in foreign currency and even stronger 12%. During the quarter, we added another 294 fresh points of access, mostly in the form of capital-light delivered fresh daily doors, taking us to over 11,700 points of access globally, an increase of nearly 1,700 from a year ago.\n\nAlong with our successful brand activation and pricing mixtures, this has resulted in a more than 15% increase in 12-month sales per hub compared to the prior year in both our domestic and international business segments. We see this as a strong indicator of higher margins in the future due to the efficiency benefits of adding off-premise sales to the Hot Light theaters. Adjusted EBITDA was $38.5 million for the third quarter, down a little from a year ago. It would have been slightly up but for a $3.1 million foreign exchange impact.\n\nThe benefits to EBITDA of higher points of access and further price increases were also partially offset by two additional factors. First, our high-margin U.K. market was challenged by [Inaudible] weak retail traffic in all sectors, reflecting the cost-of-living crisis there. Second, price promotional activity in the U.S.\n\nremained high for the first [Technical difficulty] the quarter due to our well-received Beat the Pump discount, which ramped all the way through Labor Day. The final period of the quarter saw price promotional activity in the U.S. return to normal with no impact on sales. This, along with additional pricing on DFD in September and then the final period of the quarter, posted significantly higher margins than the prior year.\n\nIn the third quarter, GAAP net loss was $11.8 million or negative $0.08 diluted EPS, which includes the impact of $5 million of impairment charges related to planned shop closures as part of our strategic review of our hubs without spokes in the U.S. Adjusted net income for the quarter was $5.9 million, and adjusted diluted EPS in the third quarter was $0.03. In the U.S. and Canada business segment, total revenue increased 12% in the third quarter to $253 million, and organic growth was 9%, an acceleration on our second-quarter performance.\n\nGrowth was strongest again in Delivered Fresh Daily, partly due to a 9% increase in point of access, but we also saw strong growth at the doughnut shop, via e-commerce and from Insomnia Cookies. We added 206 points of access in the third quarter, taking our total to 6,259 in the U.S. and Canada. Like last year, we do not expect points of access growth in the fourth quarter in the U.S.\n\nwith grocery store customers accepting minimal changes to their floor space during the holidays. We expect points of access to resume a strong growth again in 2023, though. Hubs and spokes in the U.S., which increased by two to 129 during the quarter, averaged $4.5 million sales per hub on a trailing 12-month basis in the third quarter, which is up 18% compared to a year ago due to the success of our omnichannel model and pricing actions. Our hub-and-spoke model is working and helped add more than 200 basis points of margin in the quarter, which, along with higher pricing, offset significant commodity inflation and elevated labor costs.\n\nIn addition to increasing the number of hubs with spokes, we opened six new cookie shops in the third quarter, reaching 227 Insomnia Cookie shops in total at the end of September. Last quarter, I announced the planned closure of approximately 10 Krispy Kreme shops after a performance review of our shop network, in particular, the 118 hubs without spokes, which are Hot Light theaters, which do not benefit from off-premise points of access expansion. We closed eight shops during the third quarter. We also identified a further 12 shops, which we will close in the coming months.\n\nAll of these shops are low revenue and have flat or negative EBITDA margins. And most are hubs without spokes, which could not be converted to produce for DFD. We believe these 20 locations represent the overwhelming majority of potential closures. During our review, we also identified additional hubs without spokes, which could either be converted to produce for DFD by closing the lobby area or be converted all the way to spokes taking in doughnuts from other production hubs.\n\nI look forward to sharing more details on this at our December Investor Day. Adjusted EBITDA for the U.S. and Canada in the third quarter increased 10% to $22 million with margins roughly flat at 8.7% in our seasonally lowest margin quarter of the year. EBITDA margins did improve as the quarter progressed, reflecting a mid-single-digit price increase in DFD in September and significantly reduced promotional discounts after Labor Day.\n\nWe took further pricing action in mid-October in retail and e-commerce, which brings the total year-over-year pricing increase to the low double digits. Overall, we've seen low levels of elasticity from both the July and October retail price increases and expect price promotional activity to remain at more historical lower levels moving forward. Now, moving to our international segment, net revenue grew 5.4% in the third quarter to $92 million with FX headwinds creating attempted drag during the quarter. Organic revenue increased 15.5% with excellent performances from Mexico, Australia, and New Zealand, driven by strong premium product innovations and successful price increases.\n\nIn the U.K. and Ireland, we saw organic growth but at a much lower rate with the continued challenging consumer environment. International points of access expanded by 14 in the third quarter and by 548 year to date. The 22% increase in international points of access from a year ago allowed us to leverage our 37 international hubs to grow international sales per hub to $10.0 million on a trailing 12-month basis, up 16% from a year ago, even with the FX headwinds.\n\nInternational adjusted EBITDA for the third quarter declined 15.7% to $18 million as gains in Mexico, Australia, and New Zealand were not enough to offset a decline in the U.K. The U.K. decline was driven by $1.6 million in forex from the weakened pound, as well as cost increases in labor and commodities. We recently took a double-digit price increase in retail in the U.K.\n\nand continue to review pricing across our markets look to offset expected cost increases in 2023. Now, to our third business segment, market development, which is made up of our franchise businesses around the world and the equity around Japan market. Total revenues in the third quarter increased 11% to $33 million, even with a 15% impact from FX headwinds and franchise acquisitions. In fact, organic growth in the quarter was a very strong 26% with great performances in particular in our international franchise markets and in Japan, both of which saw organic growth in excess of 25% for the second quarter in a row.\n\nAdjusted EBITDA in the third quarter for market development increased 15% to $10.4 million, despite a negative $0.7 million impact from FX headwinds. Adjusted EBITDA margins increased 100 basis points to 31.4% in the third quarter compared to the prior year. Turning to guidance, this morning, we reiterated our 2022 full-year guidance, which included 10% to 12% organic revenue growth, $189 million to $195 million in adjusted EBITDA and $0.29 to $0.32 adjusted EPS with capital expenditures of $105 million to $110 million. We guided $10 million to $12 million in FX headwinds for 2022.\n\nBut given the continued strength in the dollar, we expect to come in closer to the $12 million. We have great top-line momentum with a strong performance at Halloween and record results in DFD, which lead us to expect to come in near the top end of our revenue range. In quarter 4, we expect to benefit from our recent pricing actions and reduced discounting through the holiday season, but the FX headwinds and uncertainty in the U.K. consumer environment leads us to believe that it more likely will come in at the lower end of our EBITDA guidance.\n\nCommodities are, of course, locked in for the balance of 2022. We have now also locked in more than 90% of our needs through Q3 2023 at high single-digit inflation, well below the more than 20% we have seen for 2022. We remain very confident in our ability to deliver strong organic top- and bottom-line growth in both the near and long term through omnichannel, innovation and marketing, the expansion of our hub-and-spoke model, and the growth of e-commerce. In addition, we're using pricing, productivity initiatives and the optimization of our hubs without spokes to offset inflationary pressures and grow margins.\n\nOperator, we can now open the call up to Q&A, please.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of John Ivankoe with JPMorgan.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. I'm going to ask some questions about the McDonald's partnership, but I'd like to talk about it more strategically if I can. You know, first, of course, I mean, there's a few of us on this call old enough to remember when Krispy Kreme doughnuts were put into McDonald's stores in London, Ontario 20 years ago.\n\nI don't know if there was a case study that was done on that, I mean what was done correctly, what wasn't done correctly. At least from what I remember, you know, there just weren't enough doughnuts sold in a given day for that program to continue. So, I just wanted to kind of get some comments of like what may have changed versus, I think, a fairly similar program put in 20 years ago versus today, but, you know, certainly educate me on that. And then, secondly, FMA, just like the broader idea of distributing Krispy Kreme products, you know, to areas where customers are likely to buy one or two or three doughnuts versus the six, 12, 18, 24 that's currently available in grocery stores.\n\nAgain, this brand used to be distributed fairly widely in convenience stores. I mean, I think management -- you know, that was a strategy that you didn't like and that you didn't think it was right for the brand and it really wasn't profitable, you know, from a DFD perspective. But I wanted to see if what we're seeing with this McDonald's test could be, you know, the development of a much broader single-serve type of DFD occasion, which obviously is very different than what you currently have in most grocery stores that I've seen. Thanks.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nSure. So, John, this is Mike. How you doing today? I'll give you just the two questions that you asked. First, about McDonald's.\n\nOur long-term strategy is we've always said to get access to our customer base. In fact, we defined very clearly long term that we believe there's 50,000 points of access that's primarily going to be made up of, at that point, convenience and grocery stores. We also knew internally that would look to evolve with other spokes. So, when the opportunity came, when you have an iconic world-class brand like McDonald's, we agreed to do a DFD test in the Louisville, Kentucky, it's an offset today.\n\nIt aligns with our DFD model. It's about fresh doughnuts to them. It's early days, and we just started this. And we'll keep you up on the journey as we move along.\n\nIn terms of I know the Canada story, it wasn't a DFD fresh business model. And they didn't have an integrated system of how to do it daily. So, any time that they were trying to do doughnuts, they couldn't really figure out the demand pattern. So, history gives you a lens, but that's a very different history.\n\nIn terms of merchandise mix, if you think about the opportunity, if you look at other channels or other partners, they will have three packs, six-pack, 12-pack, even single pack if that even exists today in our convenience shops, right, where you can walk in and you can buy singles and people make doughnut selections. Do they want a -- they make it themselves. That's about putting the cabinet in the locations. So, that's the discipline of how we sell.\n\nWe're not really in the business of the single doughnut purchase. What we do is look for our customers, and then they maximize their merchandise mix opportunity. It's about fresh doughnut access to where our customers are and using what we're building today in a DFD system to get there. I hope I answered those questions for you.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nYou did. But again, I mean, maybe it's me be so forward in seeing public and seeing, you know, the doughnuts. I think the smallest pack is six. It might even be 12 at my local store.\n\nBut kind of getting back to where you have cases where customers can buy single-serve doughnuts at convenience, yes. I mean, there are many convenience stores where customer visitation is highly predictable. If it makes sense, I mean, to go into national convenience stores. For example, I mean, does the DFD model support, you know, relatively small drops versus grocery, where presumably you're selling more per store per day? I just want to get a sense of how flexible that model is, you know, in terms of Delivered Fresh Daily to accounts that might not sell that many doughnuts in a given day -- I mean, how much flex there is.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nRight. So, think through about a route and the flexibility of adding an additional door on an existing route. You can get into how the convenience store model works. So, that becomes an opportunity for you.\n\nSo, the grocery stores will continue to evolve from a 12 and six to even single serves as well, as you see in Tesco and that ability. You want to see what the customer is looking for. You actually maximize your merchandising mix by having the cabinet there. So, the choice option becomes there.\n\nIt's the same drop. You're then going through a route system and looking at convenience customers. You want to pick the few customer brands that matter and then build that same logistics. Different size, different customers, but it's not about going everywhere.\n\nWe said before we're going to be really disciplined about how we build the route.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nThanks for the patience. It's an interesting evolution. Thanks.\n\nOperator\n\nThe next question comes from the line of Sara Senatore with Bank of America.\n\nUnknown speaker\n\nHi. This is Jessica [Inaudible] on for Sara Senatore. Thanks so much for taking the question. This is just another one related to the MCD partnership.\n\nI guess just more hubs more generally. Could you talk about your hubs and how we can think about how many additional DFD doors you could support in the U.S. on the existing capacity, and how many more you would need to, for example, service all of the Walmart stores or if you're willing to discuss a broader rollout with McDonald's?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nHi, Jessica. This is Josh. Yes. I mean, we do have clearly excess capacity across the U.S.\n\nto build out the DFD door network, whether it's Walmart, McDonald's, or others. We know that the sales per hub just $4.5 million in the U.S. compares to more than $10 million internationally to give you a good guide of that track capacity. Now, some of the hubs are not all -- in optimum locations are all structured and laid out to maximize the opportunity to match the international level, but there is significant room to grow.\n\nIn our annual guide, whether -- of a 10% increase or more DFD door growth can be supported largely in the U.S. by our existing hub network. We currently have plans for five to 10 hubs a year added in the U.S., and that will be more than enough to support -- to support that growth going forward. Although, indeed, as you see, in the U.S., the growth is strong.\n\nSo, we need to continuously look to ways to optimize and improve the operations of our existing hubs and even convert more hubs without spokes to be able to service the DFD growth given the level of the demand we're seeing in points of access.\n\nUnknown speaker\n\nGreat. Thank you.\n\nOperator\n\nNext question comes from the line of John Glass with Morgan Stanley.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nGood morning. First, Mike, just going back to your comments on the reduced promotional activity in the U.S. and you're not really seeing a diminution of demand, are you rethinking how you think about promotions, price point promotions maybe in favor of focusing on LTOs? Or is this just about timing, and you just aren't going to promote as much as given the holidays, but you might still go back to traditional promotional activity next year?\n\nMike Tattersfield -- President and Chief Executive Officer\n\nYeah. Hi, John. Well, Q4, as you well know, our big celebration quarter, the biggest quarter of the year. So, obviously, it's natural that we wouldn't be promoting on price as much at this time of the year.\n\nMore focused on our specialty doughnuts, which are a premium price points and don't necessarily need during the holiday season to have the same kind of price promotion. So, there's certainly an element of timing of that. We certainly found that the Beat the Pump promotion that really gained a lot of notoriety in the spring was not as successful as it led through the summer. So, it's clear that that mechanism isn't as applicable in the fourth quarter.\n\nSo, no major change. We want to be able to make sure that we provide value to our consumer but also provide those premium celebration offerings to them -- so recognizing the changing consumer dynamics. You know, we just did a great promotion for Veterans Day, one for the elections. So, we'll still continue to do these Acts of Joy as appropriate.\n\nBut -- so, yes. This is the big quarter for us, Halloween, the holidays, when there's a lot of demand, and we want to make sure we follow through to the bottom line on that.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThanks for that. And just as a quick follow-up, can you just talk about the point of access growth in the international markets? There wasn't much. I'm not sure if that had to do with the timing, to your point about in the U.S., retailers don't want to reset in the fourth quarter. Maybe that's earlier in the international markets.\n\nWere there a number of exits in the U.K. as a result of this? What's happening in the point of access growth in the international, particularly in the DFD business? Thanks.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nYou may have seen back in the second quarter, very strong growth internationally. So, it's more a timing piece. You know, in the third quarter, we didn't see any sort of exits or anything like that. It's more that the teams are just great gains during the second quarter.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nAnd therefore, your view on the fourth quarter, has that normalized or is that still pulled forward from the second quarter, so you don't see as much?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nWell, we certainly don't expect a big fourth quarter in points of access growth as is typical around the world for those grocers not wanting a lot of change on the floor when they have a lot of other holiday activity. The first quarter next year is when we'd expect to go back to that strong expansion growth. We are continuously looking to add. But really, January is a great opportunity to reset the store and add new merchandise, not just additional points of access but continue to improve the merchandising that we've got already out there.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Andrew Wolf with C.L. King.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nThanks. Good morning. A couple of questions on the United Kingdom. On price, if I got this right, you already had about a 5% increase over the summer.\n\nI think you just mentioned a double-digit increase. So, if your price is up to the mid to high teens, what does that tell us about commodity inflation? I assume it's running higher there than it is in other parts of the world. And secondly, have you had any view on elasticity so far? I mean, that's a big price hike, particularly in the economy, as you said, is experiencing something of a consumer crisis.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nMaybe I'll start with the [Inaudible] and I'll just --\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nSo, on the inflation, we have seen slightly higher inflation in the U.K. versus the rest of the world. And commodity inflation, on average, this year has been about 20% to 22% globally, a little bit higher in the U.K. Not just on commodities, we're also seeing fuel logistics costs a little bit higher in the U.K., wage inflation overall, about the same as elsewhere, but a little bit higher on drivers.\n\nSo, that's all reflecting, of course, the tough economic conditions there. Mike, do you want to talk about the pricing?\n\nMike Tattersfield -- President and Chief Executive Officer\n\nYeah. If you think about the pricing of the consumer in general, we've seen as the consumer -- and by channel and we get into the right product. So, we just launched the Jaffanut doughnut that did exceptionally well. So, the consumers will continue to look at that part of the promotional activity that goes through the marketplace.\n\nThe omnichannel approach to the business also lets us continue to move to where the customer wants the access. So, they shift around from retail, they shift around the delivery, or they become price sensitive to one. They have access to the channel. So, even with that, our business is still really solid in the U.K., and we're pretty comfortable about how we'll continue to be able to grow.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nGreat. Got it. And I wanted to also ask about the guidance, which you maintained despite, you know, what's going on in the U.K. And you mentioned you might -- the lower end might be better for EBITDA because it's in the U.K.\n\nBut should we infer that other regions and segments are kind of outperforming your internal expectations? Or were you looking for the U.K. to be about what it is?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nYeah. Looking forward, we expect the U.S. in particular, to lead the way in the fourth quarter, although we actually do see strong performance from many countries around the world. But in the U.K.\n\n-- in the U.S., sorry, we obviously had a great Halloween. It's a big quarter anyway. We expect to drive volumes, particularly with those specialty doughnuts at the higher price points and flow them through. As we discussed earlier, the discounts are materially lower.\n\nAnd on DFD, we only took pricing right at the end of the third quarter in the U.S., and so we benefit full -- a full quarter on that. Also, earlier in the call, I mentioned the continued momentum we have on hub with spokes and flow-through and also the optimization program on the hubs without spokes. So, a number of things happening in the U.S. that give confidence to both the top and bottom line.\n\nAnd then the rest of the world, we're still seeing strong momentum in the hub-and-spoke omnichannel model working. We just need to be conscious of that FX headwind and thoughtful around how we manage the U.K. through these challenging economic conditions. But overall, with the U.S.\n\nbeing strong, the expectation is clear that we'll be able to deliver on our guidance.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nYeah. I mean, one thing that should give you a little bit of a support on that, as well as all of our countries actually growing top line, every single one, even the U.K., right? So, it shows you how the consumer and how we can adjust in these environments and how the omnichannel model can actually really benefit us, right? It's not just one retail access point, right? It's a multichannel approach to how to view it. So, that's where, you know, as Josh just said, it's going to be led this time by the U.S., but a lot of the countries will come through. And even we saw organic revenue growth in the U.K.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nGot it. Excuse me. Thank you.\n\nOperator\n\nOur next question comes from the line of Brian Mullan with Deutsche Bank.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nThank you. Just a question on point of access expansion, specifically on the France news. I think you mentioned a minority stake, but could you just confirm, is that going to sit in your international segment or in your market development segment? And then related, if you could just comment how you expect the different types of points of access to evolve in that market between the need to build out the hubs and then how quickly you could layer on the spokes. Just any color on the next steps for that launch would be great.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nYes. So, we did do a, you know, minority JV in France. It will be in the market development segment. We'll look at -- you know, we see a 2,000 points of access opportunity, but you start with the hub.\n\nAnd pretty soon after, we start building out the spokes. That is the strategy. That's what's completely changed about Krispy Kreme. It's not about building all the doughnut shops and then adding that capacity.\n\nIt's leveraging the existing hubs that are there. So, we'll start with our one or two hubs in France and then start building the spoke network appropriately. And you'll see that happening starting in 2023, we start to potentially open our first hub in France.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nOK, thanks. And then just a follow-up, just wondering if you could update us on the Sweet Treats business in the U.S. and Canada. You know, I guess, maybe number one, how are you currently thinking about the pace of sustainable revenue growth over, say, the next three to five years? And then number two, is -- just any way to help us think about the segment, EBITDA dollar or margin tailwind that could represent in 2023.\n\nJust want to confirm you'd expect profitability next year on a full-year basis, and that would be a tailwind.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nSure. The branded Sweet Treats business or start-up in longer shelf life Sweet Treat category continues to mature and actually delivered another quarter of profitability in the third quarter, which we're pleased to see. That was partly the result of pricing taken earlier in the year. And we're continuously optimizing our manufacturing network and seeing gains there as well.\n\nWe remain confident in the long-term potential of branded Sweet Treats. You asked about 2023. We continue to broaden our distribution. But, you know, to be frank, I think that the Delivered Fresh Daily business, the hub-and-spoke model will be the biggest contributor of bottom-line performance in the coming quarters.\n\nYou know, we're happy with the long-term potential of branded Sweet Treats, but it's still in its start-up phase.\n\nOperator\n\nYour next question comes from the line of Bill Chappell with Truist Securities.\n\nBill Chappell -- Truist Securities -- Analyst\n\nThanks. Good morning. Just want a better understanding of -- and I know we've discussed this before but just overall pricing that's in the numbers now. I know it's certainly benefited, but I'm -- I don't know if I'm looking at the wrong way.\n\nLike if you look at the global points of access, up 16% and then kind of sales per hub up 18%, it would imply if you've taken anything more than 2% price increase that the volumes are actually down year over year. So, I'm just trying to understand. I mean, are we talking 5%, 10%, 15% pricing? And as you look into next year, is that a hurdle you have to overcome, or do you expect some reacceleration or the reacceleration to continue even despite pricing comps?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nThat's a lot of metrics you mentioned there. Some of them that you can't quite add up in that way. But maybe just to step back, volume is increasing globally and in the U.S. We're selling more doughnuts than ever before.\n\nThe pricing that we've now taken gets us to low double digit, if I stick with the U.S. for a moment in the beginning of the fourth quarter. And so, that's certainly helping drive our strong top-line momentum. To your point, that, combined with the biggest contributor, the points of access, there is always, whenever you take pricing, a modest impact in terms of elasticity.\n\nBut, certainly, relatively low, and we're pleased with the pricing actions we've taken. One of the reasons the volume is still high and the way you added the numbers is a bit of a mix effect toward the growth of Delivered Fresh Daily. We sell more dozens actually. That way, it skews the volume a little bit.\n\nAnd, you know, when you look forward, we expect to continue to drive volume of our doughnuts across the channels and, indeed, the pricing. Volume, a big part of it coming from the points of access expansion and leveraging those hubs and spokes in the U.S. So, those things all combine to explain why the momentum we're seeing in the fourth quarter is what we expect in the long run.\n\nBill Chappell -- Truist Securities -- Analyst\n\nOK. I can follow up. And then maybe looking specifically at pricing and the U.K., are you at -- I'm trying to understand the elasticity of can you take or do you even need to take further pricing in the U.K.? And I'm just trying to understand what the -- what's the impact of -- you haven't been able to take the pricing that you maybe hope in that elasticity or consumers are reacting to the price points, and so it's having lower volumes. Just trying to understand, you know, how that's pretty specific economic pain for that area.\n\nI'm just trying to understand how it's impacting kind of your pricing volumes and outlook. Thanks.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nSo, it's not an elasticity challenge that's going on in the marketplace. You just can think about when we just launched a new doughnut promotion, which is a premiumization. And it is very successful, right? What it is is channels and channels that were -- the business is in how the consumer is reacting to those channels in general, right? So, you got a significant part of the business in the supermarket trade business. And if that channel has shifted just from how consumers are interacting with it, I see us being able to continue to price and get very thoughtful about how do you partner with those Tescos of the world and getting interaction from our customer because the barrier becomes much more for them.\n\nAnd our opportunity in the U.K., to continue to look at other omnichannel partners that we could also continue to grow. So, the opportunity in the U.K. is still in front of us. We continue to believe that.\n\nBill Chappell -- Truist Securities -- Analyst\n\nGot it. Thanks for the color.\n\nOperator\n\nNext question comes from the line of David Palmer with Evercore ISI.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThanks. Good morning. I'm curious about pricing net of commodities. When do you expect pricing to catch up to commodity inflation, you know, net of your -- any hedging you're doing? And how does that differ between the U.S.\n\nand U.K., for example?\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nSo, during the third quarter, you saw us take price for the first time in 2022 on retail and early in the quarter on DFD, later in the quarter in the U.S. We also took pricing earlier in the quarter in the U.K. Following the U.K., we had taken another price increase, but quite small, at the beginning of the year.I would definitely say that that was the beginning of a catch-up. We certainly didn't anticipate the level of food inflation in the U.S.\n\nor the U.K. at the beginning of the year as we saw. And we're pleased with the success of those pricing initiatives. We've then taken further pricing in October in both U.K.\n\nand the U.S. We do find that, in this environment of price increases, we can almost instantaneously increase the pricing on retail. But, obviously, we need to work with our partners on DFD. So, that does lag a little bit behind.\n\nAnd so, I would say, you know, we're working now through the fourth quarter to catch up to the level you're describing. So, it's fair to say that we're very close to that now. Inflation continues next year, but we have a good read on it with more than 90% of the commodity requirements that we have in our ingredients already covered, which is obviously, we've gone a little further out than in past years in the context of environment and, indeed, some favorability on some of those commodities. It leads us to be more like high single digits.\n\nWe do see wage inflation remaining high. We want to invest in our Krispy Kremers, but it's slowing a little bit. So, with all that said, we think we're there, in terms of your original question about having the pricing up to the qualities as we stand now here in the fourth quarter, but we're obviously still a little behind in the third, a little bit maybe into January as we make sure the DFD, which kind of like behind, as I mentioned earlier, stays close.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThank you for that. I wonder, as we're thinking about '23, I don't know if you're going to be comfortable talking about whether you expect to be at or above your long-term algo in terms of EBITDA growth in '23 at this point. But what are some -- other than this pricing net of commodities, what are some of the big buckets you would advise for us to be looking at? You talked about nonhub rationalization. And clearly, there's going to be impact from the trajectory of the U.S.\n\nversus U.K. in general. But, you know, maybe those are it. But what are some things that you would have us be thinking about? Thank you.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nWell, I'll share -- willing to share what to do what we do know about 2023. And it's clear that we can maintain our growth momentum in this economic climate. Across the world, as Mike said, even in the U.K., we delivered organic growth in the third quarter. But in the U.S.\n\nand elsewhere, we're seeing very strong top-line momentum. It's volume and pricing working at the same time, plus, of course, more than 10% increase a year on the points of access. So, all that supported by modest hub growth is a continued trend that we see for many years to come in fact. Now, the next big thing to note on the bottom line is the margin flow-through from our hubs with spokes.\n\nWe're seeing more and more cities now benefiting from that model as we add these additional points of access largely to existing hubs and leverage the fixed costs. And so, we expect that benefit to continue. The hubs without spokes, a portion of them, clearly, in this environment, has been shown to be less successful. And as you mentioned, we're looking to both exit the 20 I mentioned earlier and indeed look to change some of the operating characteristics further of those hubs and spoke.\n\nSo, a number of things we can drive at. I mean the other one, of course, is that thing that isn't entirely within the control of the Krispy Kreme model is some of the broader consumer sentiment in the U.K. and FX trends. We'll manage those as best we can.\n\nBut what's great is that, our model, we're just as confident in it -- in this environment as we were when we started on this journey. And so, our long-term plans are very similar to what we've been talking about before. We can't wait to just give you more detail at the Investor Day in December. Really want to share some of that points of access expansion, particularly these new markets.\n\nSo, a question on France earlier, talk about how we see that playing out in the future years. Do more of a deep dive on the hub and spoke optimization in the U.S., some of those high-level comments I made there. I think there's a lot of rich insight there. And then the other one that we haven't talked about on this call at all today but one that's performing very well, particularly on the e-commerce side, is in Insomnia Cookies.\n\nWe're not just adding cookie shops. We're seeing very strong growth in the cookie shops we have today, thanks largely to continuous success in the digital e-commerce side of that business. And we can't wait to share with you more about that as we look further ahead.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nOur question comes from the line of Jared Garber with Goldman Sachs.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nGood morning. Thank you for -- thank you for taking the question. I wanted to get a sense of the sort of exit rate on the margins from the third quarter or what you're seeing so far in the fourth quarter. You talked a little bit about incremental positive trends on the margin line.\n\nI think the commentary around the top line and the EBITDA for the full year would imply a pretty meaningful step-up in EBITDA margins in the fourth quarter. So, I just wanted to get a sense of maybe, I mean, that number looks like it's close to 14%. I just wanted to get a sense of maybe what you're seeing in terms of the incremental margins as you flow through the incremental price to date. And then I have one follow-up.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nYes. It's clear in reiterating the guidance that doing the same math that you are in terms of the VAC calculation and can see in the U.S. in period 9 and period 10 that the pricing is working, the reduced discounting is working, and the volumes are strong at these, particularly, specialty doughnuts, which are at a premium price point. So, all those things combined through the hub-and-spoke model to deliver confidence in the guidance that we've given largely from what we're doing in the U.S.\n\nInternationally, we're seeing a good performance as well, top and bottom line. The market development reporting segment is doing well even with the FX headwinds. In Mexico and Australia, we're also seeing good performance and flow-through. It's just the uncertainty in the U.K., although as Mike highlighted, it's still a growth business.\n\nSo, there's every expectation that we'll deliver on the guidance that we reiterated this morning for the bottom line reflecting the kind of assumption that you've made.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nGreat. And I guess just following up on that, would you expect U.S. and Canada EBITDA margins to be above last year's rate? I think last year it was at 12.8, if we have that correct. I think this quarter came down a little bit versus last year, pretty close, but pretty -- down, maybe 10 basis points.\n\nSo, just curious maybe how we should be thinking about that.\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nWell, yes, as we mentioned, I think this quarter, the third quarter reflected a lot to do with that discounting. And indeed, the third quarter is generally our lowest-margin quarter, reflecting -- in the U.S. reflecting the summer months and ahead of all those big holiday excitement in the fourth quarter for our Krispy Kremer consumer --Krispy Kreme consumer. So, we don't give guidance for the individual markets.\n\nBut it's clear that the U.S. will be leading the way based on their current performance on the bottom line in the fourth quarter.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nGreat. Thanks. And then just one more, Josh, if you don't mind. Leverage, I know you reiterated the guide this morning, which I believe target leverage by the end of the year is 3.6.\n\nIt still looks like, as of the end of this quarter, you're running above four. So, I just wanted to get a sense of how we should think about that leverage level to end the year and how you get to that 3.6.\n\nJoey Pruitt -- Chief Accounting Officer\n\nYes, I can take that. This is Joey Pruitt. Just --\n\nJared Garber -- Goldman Sachs -- Analyst\n\nHi, Joey.\n\nJoey Pruitt -- Chief Accounting Officer\n\nYeah. How you doing, Jared. Just a couple of things there. First of all, I certainly expect a strong Q4 performance, which you've already been talking about from an EBITDA standpoint.\n\nThat will certainly be helpful for us as we look to reach our guidance range there. We also have a couple of things that we can do from a cash standpoint. Working capital is going to be a little more favorable in the fourth quarter than it was to the rest of the year through Q3, as well as some things like another sale leaseback that we can do, some things like that, that will help us to drive down our debt in addition to just the higher EBITDA run rate. So, those are the main things there.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nYeah. I look at it long term. You know, this EBITDA improvement, particularly in the U.S., that we expect from the benefits of the hub-and-spoke model, we also actually -- we made an acquisition just a couple of months back, of an accretive -- margin-accretive business. None of that EBITDA -- back just under $20 million we paid for that in the Midwest, none of that EBITDA is coming.\n\nIt's just starting to come through now, so that doesn't go into the leverage calculation you made. So, the general EBITDA improvement, continuous focus on working capital, and then the benefits of that acquisition will be coming through for the coming quarters. Bear in mind, I mean, why we can get leverage, it's all to do with our net debt position. We want to make sure we're in a strong position.\n\nPeople ask about interest rates. We are in a fortunate position. We decided a couple of years back to fix our interest rates, and more than 75% of our debt is at fixed rates from before the recent increases all the way through to the middle of 2024. So, we obviously look to reduce the leverage, drive down the leverage to increase EBITDA and managing our cash position, but it doesn't give us concern given the fact that our interest payments won't increase significantly up at least through to the middle of '24.\n\nJared Garber -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nAt this time, there are no further questions. I would like to turn the call back over to Mike Tattersfield for closing remarks.\n\nMike Tattersfield -- President and Chief Executive Officer\n\nI appreciate everybody for listening in to the call and the growth that we had in the third quarter as well as how we view the end of the year, and I want to thank all the Krispy Kremers who are just doing an incredible job for us every day and look forward to seeing everybody that would like to attend on the Investor Day or off to the webcast as well. And you'll see a lot more detail on how the growth story and how we continue to evolve Krispy Kreme. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRob Ballew -- Vice President, Investor Relations and Corporate Communications\n\nMike Tattersfield -- President and Chief Executive Officer\n\nJosh Charlesworth -- Chief Operating Officer and Chief Financial Officer\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nUnknown speaker\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nBill Chappell -- Truist Securities -- Analyst\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nJared Garber -- Goldman Sachs -- Analyst\n\nJoey Pruitt -- Chief Accounting Officer\n\nMore DNUT analysis\n\nAll earnings call transcripts"
}