{
  "companyName": "nVent Electric plc",
  "companyTicker": "NVT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/nvent-electric-plc-nvt-q3-2022-earnings-call-trans/",
  "content": "nVent Electric plc (NVT 0.73%)\nQ3 2022 Earnings Call\nOct 28, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the nVent Electric third quarter 2022 earnings conference call. [Operator instructions] Please note, this event is being recorded. I'd now like to turn the conference over to Tony Riter, vice president of investor relations. Please go ahead.\n\nTony Riter -- Vice President, Investor Relations\n\nThank you, Jason. Welcome to nVent's third quarter 2022 earnings call. On the call with me are Beth Wozniak, our chief executive officer; and Sara Zawoyski, our chief financial officer. They will provide details on our third quarter performance and outlook for the fourth quarter and update to our full year 2022 outlook.\n\nBefore we begin, let me remind you that any statements made about the company's anticipated financial results are forward-looking statements subject to future risks and uncertainties, such as the risks outlined in today's press release and nVent's filings with the Securities and Exchange Commission. Forward-looking statements are made as of today, and the company undertakes no obligation to update publicly such statements to reflect subsequent events or circumstances. Actual results could differ materially from anticipated results. Today's webcast is accompanied by a presentation, which you can find in the Investors section of nVent's website.\n\nReferences to non-GAAP financials are reconciled in the appendix of the presentation. We'll have time for questions after our prepared remarks. With that, please turn to Slide 3, and I will now turn the call over to Beth.\n\nBeth Wozniak -- Chief Executive Officer\n\nThank you, Tony, and good morning, everyone. It's great to be with you today to share our outstanding third quarter performance. Our nVent team delivered exceptional results, by serving our customers, responding to strong demand and overcoming supply chain challenges. Our strategy to focus on high-growth verticals, new products, global expansion and acquisitions, combined with strong execution, continue to drive our success.\n\nWe believe we are well-positioned with the electrification of everything megatrends. Our third quarter performance was a new record for both sales and adjusted EPS and, once again, exceeded our guidance. This marked our sixth consecutive quarter with organic sales growth at or above 20%, demonstrating our growth strategy is working. Our return on sales improved both year over year and sequentially.\n\nGiven our strong third quarter results and expectations for Q4, we are, again, raising our guidance for full year sales and adjusted earnings per share. Now on to Slide 4, for a summary of our third quarter performance. Sales in the quarter were up 20% organically, with double-digit growth in all segments and key verticals. Segment income was up 22% year over year and return on sales up 90 basis points.\n\nAdjusted EPS was up an impressive 25%. We generated $126 million in free cash flow, up 17%. Overall, a great quarter. Orders grew high single digits, on top of 43% orders growth a year ago.\n\nWe expected order growth to moderate given this comparison. We continue to have a robust backlog, up strong double digits year over year, that gives us confidence going forward. Let me share a few other highlights. New products added 3 points to sales growth.\n\nYear to date, we've launched 42 new products and expect to deliver 50 again this year. I'm very pleased with the progress we have made. We are launching more new products faster that are innovative and highly valued by our customers. We recently won a showstopper award at the National Electrical Contractors Association for one of our nVent catting products.\n\nLooking at our key verticals, they all delivered strong double-digit organic growth. Infrastructure continued to lead the way, with strength in data solutions and power utilities. Commercial and residential grew strong double digits, driven by North America and Europe. Industrial continued its broad-based growth, given the strong trends in automation.\n\nAnd finally, energy continued to perform well, particularly in MRO. Looking at our organic sales performance by geography, we continue to see broad-based growth in North America, up 28%. Europe was up double digits in all segments. Developing regions declined high single digits, primarily due to China.\n\nIn the quarter, we experienced COVID-related lockdowns in Xinghua, where we have our largest China manufacturing plant. Looking ahead, we are raising our full year sales and EPS guidance, reflecting our third quarter performance and expectations for Q4. Our orders and robust backlog give us confidence in Q4 and into next year. We're excited for the future with the electrification of everything.\n\nI will now turn the call over to Sara for a detail on our third quarter results and our updated outlook for 2022. Sara, please go ahead.\n\nSara Zawoyski -- Chief Financial Officer\n\nThank you, Beth. I'm pleased to share with you another quarter of strong execution, with double-digit sales growth, return on sales expansion and improved free cash flow. Let's turn to Slide 5 to review our third quarter results. Sales of $745 million were up 16%, compared to last year or 20% organically.\n\nOverall, sales growth was broad-based, with double-digit growth across all segments in key verticals. Volume contributed -- continued to be strong, adding 5 points to growth and price adding 15 points. Foreign exchange was a 4-point headwind. Segment income was $144 million, up 22%, with return on sales of 19.3%, up 210 basis points sequentially and improved 90 basis points year over year, all better than expected.\n\nVolume and price contributions more than offset the impact from roughly $55 million of inflationary cost pressures, supply chain inefficiencies and FX headwinds. In addition, we continue to make investments in R&D, digital and sales and marketing for growth and productivity. Q3 adjusted EPS was $0.66, up 25% year over year. We generated $126 million of free cash flow in the quarter, up 17%.\n\nWe are actively managing working capital, while supporting robust demand in a challenging supply chain environment. We expect cash flow momentum to continue in the fourth quarter, reflecting our seasonal strength and working capital improvements. Now please turn to Slide 6 for a discussion of our third quarter segment performance, where you will see continued sales momentum and strong margin performance. Starting with enclosures.\n\nSales of $388 million increased 20% organically, with both volume and price contributing. Sales growth was broad-based across all verticals, led by infrastructure and industrial. Geographically, North America led, followed by Europe. Overall, orders were up double digits year over year.\n\nEnclosures' third quarter segment income was $72 million, up 27%, return on sales improved 230 basis points sequentially and was up 170 basis points year over year to 18.5%. Improved execution and price realization offset the impact of inflation and continued supply chain inefficiencies. Recall, this business was most impacted by inflation and supply chain challenges and we pointed to ROS improvement in the back half of the year. We expect return on sales performance to continue to improve year over year in Q4 due to price cost and improved productivity.\n\nNow moving to electrical and fastening. Sales of $209 million increased 28% organically, with both volume and price contributing. All verticals grew strong double digits, led by infrastructure, with power utilities up over 50%. Geographically, all regions grew, led by North America.\n\nOrders were up double digits in the quarter. Electrical and fastening segment income was $61 million, up 26%. Return on sales was 29.1%, up 50 basis points relative to last year on strong execution and price offsetting inflation and supply chain headwinds. We continue to invest in new products and vertical teams to drive growth and support our customers.\n\nTurning to thermal management. Sales of $148 million grew 13% organically, with both volume and price contributing. All verticals grew double digits, led by industrial with particular strength in chemicals. High-margin industrial MRO demand continued to be robust for the sixth consecutive quarter.\n\nGeographically, North America was strongest, with growth in MRO, chemicals and clean fuels. Europe saw strength in industrial, offset by the impact of Russia. China was down due to supply chain challenges and customer delays from COVID lockdowns. Overall, orders were flat in Q3, largely reflecting what impacted sales.\n\nWe continue to see solid order and quote activity for longer cycle projects. Thermal management segment income was up 14% to $36 million. Return on sales expanded 140 basis points year over year to 24.2%, driven by improved price cost and positive mix contribution from industrial MRO. Moving to Slide 7, it's titled balance sheet and cash flow.\n\nWe ended the quarter with a cash balance of $194 million. We focused on working capital improvements in Q3 and generated $126 million in free cash flow. Also, we exercised our delayed draw option on our $200 million term loan and ended the quarter with $600 million available on our revolver. We believe our healthy balance sheet provides us with ample capacity to invest in the business and execute on our growth strategy.\n\nSlide 8 provides a summary of our capital allocation priorities. We continue to prioritize growth, while maintaining a strong liquidity position. We ended the third quarter with a net debt to adjusted EBITDA ratio of 1.7 times, just below the low end of our target range of two to two and a half. Year to date, we have returned $96 million to shareholders, including a competitive dividend and share repurchases.\n\nWe believe our strong liquidity and robust cash flow position us well to continue to invest, execute on M&A and deliver attractive shareholder returns. Moving to Slide 9, you will see our updated 2022 full year outlook. Our year-to-date performance has been strong, with sales up 21% and adjusted earnings per share up 18%. As Beth highlighted earlier, we are, again, raising our full year sales and earnings outlook.\n\nFor organic sales growth, we now expect a range of 18% to 19% versus our prior guidance of 15% to 17% for the year. Adjusted EPS is expected to be in the range of $2.30 to $2.32 versus our prior guidance of $2.17 to $2.23. This new guidance reflects adjusted EPS growth of 17% to 18%, on top of the 31% growth last year. For free cash flow, we now expect conversion to be approximately 90% at the low end of our prior range due to higher working capital to support our strong sales growth.\n\nA few other full year callouts. We now expect a 4-point FX headwind to the top line, corporate cost expectations have moved up slightly to roughly $85 million, and we now expect capex of approximately $50 million at the low end of our prior range. Looking at our fourth quarter outlook on Slide 10. We expect reported sales to be up 4% to 6% and organic sales to be up 9% to 11%, with an FX headwind of about 5%.\n\nWe expect both volume and price to contribute. Our orders and backlog give us confidence in Q4 and into next year, and adjusted EPS is expected to be between $0.56 and $0.58. Wrapping up, we continue to execute well with strong sales growth, ROS expansion and improved free cash flow. I am pleased with our performance and believe we are well-positioned for another great year.\n\nThis concludes my remarks, and I will now turn the call back over to Beth.\n\nBeth Wozniak -- Chief Executive Officer\n\nThank you, Sara. Please turn to Slide 11. At nVent, we are building a more sustainable and electrified world. With the macro trends of the electrification of everything and the increasing importance of sustainability, we are seeing increased demand for our products and solutions.\n\nAs the world moves through the energy transition, we see investments being made in infrastructure, renewables, energy storage and electric transportation. We believe we're well-positioned to grow with these secular trends. At nVent, we connect and protect. Our products and solutions have strong value propositions, tied to sustainability and electrification.\n\nThese include energy efficiency, electrical resiliency, labor saving, safety, reliability and serviceability. To bring that to life, let me share a few examples. Our data center liquid cooling solutions are more energy efficient when compared with traditional air cooling. They can remove heat at the source more effectively and improve the power usage effectiveness by up to 30%.\n\nWhen it comes to electrical connections, our nVent ERIFLEX Flex bus can reduce the installation time and cost up to 50% and 20%, respectively. It is safer and easier to use, more reliable and customizable. This new product is applications across many high-growth verticals from data centers to energy storage to e-mobility. We believe investing in sustainability and electrification is critical.\n\nIn addition to the strong value propositions of our products, we are committed to developing them in a responsible manner, with a focus on eco-friendly materials, lower environmental impact and end user safety. By 2025, we expect greater than 90% of our new product introduction funnel to have a positive impact in at least one of these categories. When it comes to acquisitions, our focus is on company's positioned to grow with the electrification of everything. We've strengthened our portfolio in data solutions, industrial automation and renewables.\n\nWe've added more than $200 million in annual revenue since then. These acquisitions have grown 30% year to date, outperforming and growing faster than overall nVent. Wrapping up on Slide 12. We had an outstanding quarter with sales and adjusted EPS exceeding our guidance.\n\nAnd for the full year, we expect double-digit sales and EPS growth. Looking ahead to 2023, let me share some initial thoughts. While the macro environment is uncertain and supply chain challenges persist, we believe the electrical secular tailwinds position us well to outperform GDP. We expect the investments in infrastructure and the energy transition will drive demand for our products and solutions.\n\nWe believe next year, we'll still be in inflationary environment, and we've consistently shown we can manage price cost effectively. We will continue to invest in capacity and productivity to deliver for our customers. Our digital transformation journey will accelerate, with the goal of making it easier for our customers to do business with us. We expect our momentum in new products and innovation to further enhance our position in high-growth verticals and be a strong contributor to growth.\n\nI'm excited about our future and believe we're well-positioned for the electrification of everything. With that, I will now turn the call over to the operator to start Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Joe Ritchie from Goldman Sachs. Please go ahead.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nThanks. Good morning, everyone. And nice quarter.\n\nBeth Wozniak -- Chief Executive Officer\n\nGood morning and thanks, Joe.\n\nSara Zawoyski -- Chief Financial Officer\n\nGood morning.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nYeah, so a bit of an odd question to start off, but there was a big acquisition that was announced yesterday. Stock was down double digits, I think partly because of the leverage that the company was taking on. And so, I know, Beth, in your opening remarks, you mentioned M&A and your focus on the electrification of everything. But I'm just really curious if in this environment, how are you thinking about the size of acquisitions that you are -- that are potentially in your pipeline, and the type of deals you would do and the type of leverage that you'd maybe take on in this environment?\n\nBeth Wozniak -- Chief Executive Officer\n\nYeah, our M&A pipeline is very robust. And I think, a couple of things. You never quite control the timing, and we've proven to be very disciplined in terms of our targets and how they strategically fit. I think, one thing I would say is we have a strong balance sheet and cash flow position, which we think gives us optionality.\n\nAnd I'd also say this, we have demonstrated such strong execution and integration of our acquisition targets, and as I mentioned, better than our overall nVent performance. But that gives me confidence that we could do a larger deal than the ones that we've had. But of course, we're going to remain disciplined and certainly, we have our models that we ensure that we can meet all those targets and hurdles.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nOK. Great. That's helpful. And then, I guess, you did provide some commentary on 2023.\n\nThere is some concern that nonresidential investment activity is going to follow residential. It doesn't seem like you're seeing the signs of that across your portfolio. And so, maybe just provide a little bit more color on how you're thinking about your end markets as you head into 2023?\n\nBeth Wozniak -- Chief Executive Officer\n\nI think, as we initially head into 2023, as I mentioned, we think infrastructure is going to continue to be very strong. And that's really because of the investments that are being made. It's the change with the energy transition. So all of those trends, we believe, are favorable.\n\nAs we look at industrial, we see that we have a really strong backlog there, particularly in our enclosures business, and there's a lot of focus on industrial, automation and reshoring or just -- the fact that everyone has had so many labor constraints and challenges. And so, we think going into next year with our backlogs, we believe we'll have some strength there. I think, on the commercial and residential, residential is not a big piece of our portfolio. And certainly, we've seen that slower.\n\nOn the commercial side, if you look at where we have the most of our business in our electrical and fastening solutions, a lot of what we do in commercial is related to power and data infrastructure. So any time that you are retrofitting a building or looking to have more content, you think of a hotel room and all the different outlets and plugs and things like that, it drives for more of our solutions. So we continue to keep innovating. We come out with new products that are labor saving, given the labor shortage in the contractor market, that also plays well to our strength.\n\nAnd then, finally, energy, we think that we'll see some continued strength there just because of energy independency, the switch to clean fuels, biofuels, etc. And we've seen good project and quote activity in our thermal management business.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nAll sounds good. Thanks, guys.\n\nBeth Wozniak -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Julian Mitchell from Barclays. Please go ahead.\n\nJulian Mitchell -- Barclays -- Analyst\n\nHi. Good morning.\n\nBeth Wozniak -- Chief Executive Officer\n\nGood morning.\n\nJulian Mitchell -- Barclays -- Analyst\n\nGood morning. Maybe I just wanted to switch the focus to the near term a little bit. So just for your fourth quarter revenue guide, I guess, two parts to it. One is that I think your guide implies sales are down mid-single digit sequentially and normally.\n\nThey're flattish in Q4. So I understand there's a bit of an FX sequential headwind, but is there anything else going on like shipping days or something like that to be aware of? And then, when we look year on year at organic sales, I think you said you should get volume growth in Q4. So maybe just frame how much pricing is stepping down from that very big tailwind in Q3?\n\nBeth Wozniak -- Chief Executive Officer\n\nOK. Good. Let me first start, Julian, with just how we thought about the quarter. And so, one of the things for us, as we looked at our orders and our backlog -- but we also were cautious with not knowing what our distribution channel partners would do with their inventory positions.\n\nAnd remember, there's a significant portion of our business that is really short cycle. And while demand is still very strong and the output through our channel partners is strong, our thinking there is that they may tend to modify their inventory positions as we go out of this fourth quarter. We don't know, but that was one of the our views in just being cautious on how we looked at Q4.\n\nSara Zawoyski -- Chief Financial Officer\n\nAnd I think, Julian, the other maybe thing to add to that on the sequential side is what Beth said, and then you flagged it, I mean, it's currency, currency is paying a piece of that in terms of that downtick. I think, the other piece is Russia. It's having kind of an oversized impact on Q4. And then, from an overall standpoint, I mean, that 9% to 11%, as we said in our prepared remarks, includes both an expectation of volume and price.\n\nObviously, it's going to be a bit more skewed to price, but still modest volume. And keep in mind that we're lapping 24% growth of a year ago, where we saw double-digit volume and double-digit price. So that step down on price is more of a factor of what we're lapping a year ago than anything else.\n\nJulian Mitchell -- Barclays -- Analyst\n\nThat's very helpful. Thank you. And just a very quick follow-up. On the sort of fourth quarter margins, are we thinking enclosures leads the year-on-year increase, EFS flattish and then thermal maybe down?\n\nSara Zawoyski -- Chief Financial Officer\n\nYeah. Well, here's what I would say, Q4, we do expect another strong margin performance and good incrementals. We would expect it to look a little bit more normal in terms of that sequential downtick in ROS, but significantly better than what we saw in Q3 to Q4 a year ago, really based on better price cost and productivity. And then, from a margin perspective, I guess, I would characterize it like this.\n\nWe would expect enclosures to be the largest driver of that year-on-year margin improvement and see more kind of modest margin performance to flatten EFS and thermal. I mean, it's really more of a function of the strength of that margin performance of a year ago than anything else.\n\nJulian Mitchell -- Barclays -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe next question comes from Deane Dray from RBC Capital Markets. Please go ahead.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nThank you. Good morning, everyone.\n\nBeth Wozniak -- Chief Executive Officer\n\nGood morning.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nHey, impressive performance here. Maybe I start with geographies. For Europe, just given all the anxiety about the potential slowdown, you're not seeing it in your headline numbers here today from third quarter. But anything changes at the margin quote activity? And then, similarly for China, you called out the COVID shutdown would -- are you expecting to recoup that in the fourth quarter? And can you size that for us?\n\nBeth Wozniak -- Chief Executive Officer\n\nOK. So starting with Europe, as we mentioned, our European performance continued to be strong. The one area, of course, where was a negative impact for us is just Russia, right? And that's largely in our thermal management business. So that was the impact that we saw.\n\nBut otherwise, Europe continues to perform well for us. When you look at China, and remember China is only mid-single digits in terms of our overall portfolio. So it's not significant. And we were really impacted.\n\nAnd these COVID lockdowns vary by region, and our plan was impacted in the quarter in Q3. So we're working to recover from that. And I expect we're going to see some improved performance there in Q4. And on our thermal management business, it's also just some timing there.\n\nSo I think, we're going to see that turn around as we progress through the quarter.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nGreat. Thank you. And then, for Sara, on the -- you tweaked free cash flow down for the year. And it sounds like it was all related to the higher working capital demands for this industry and ongoing strength on the industrial side.\n\nYou didn't call out anything on supply chain. So are you still carrying buffer inventory? Is there an expectation that you would be able to work that down? And has the supply chain improved at all since last quarter?\n\nSara Zawoyski -- Chief Financial Officer\n\nYeah. So I would see that free cash flow guide really is pointing to the low end of our previously guided range of that 90% in terms of conversion. And it simply is a function of the strong demand that we could use to see in the quarter. Amidst what is still a challenging supply chain, I think we see it getting modestly, gradually better, but it's still challenging.\n\nAR will naturally be higher with these higher sales, and we continue to invest in inventory to service our customers. And at the same time, we are surgically managing that working capital. Inventory was actually flat from Q2 to Q3. So I think, over the long term, nothing changes in terms of our cash conversion goals of getting to that 100%.\n\nWe continue to see working capital as being a big opportunity. And I think, prior to going into this year, with the strong demand against the challenging supply chain, we have a strong track record of converting at 100%, including in 2021. You asked kind of on the supply chain front, I would say that we see improvements in terms of getting team members into the door, into our factories and DCS from what we saw kind of in the first half of the year. But it still is taking time to get those team members trained on board and productive, and that's what continues to be a really strong volume output.\n\nMaterial availability, I would say, again, better than where we started the first half, clearly better than what we're lapping here of a year ago, but there's still pockets where we're still challenged. So we're having to be very surgical and very focused in terms of where and how we're managing this working capital as we balance all the factors here.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nThat's really helpful. Thank you.\n\nOperator\n\nThe next question comes from Nigel Coe from Wolfe Research. Please go ahead.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nThank you. Good morning.\n\nBeth Wozniak -- Chief Executive Officer\n\nGood morning.\n\nSara Zawoyski -- Chief Financial Officer\n\nMorning.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nYeah. So going to enclosures, obviously, we've seen some nice margin momentum through the year. It sounds like labor is the issue here more than supply chain. Is that fair to say? And I'm just wondering if it's a labor issue, when would you expect to be sort of at a more normalized productivity in enclosures? And then, so the second part of that would be, as we go into 2023, obviously, assuming no recession, do you think there's a path to high teens for the full year in enclosures?\n\nBeth Wozniak -- Chief Executive Officer\n\nSo let me just start with, yes, labor has been a challenge for us in many of our plants, including enclosures. And it's improving, but still a challenge. And I would also say materials, particularly when it comes to electronics, still is very challenging. But we're working our way both through that.\n\nAnd I would say, on enclosures, we're even looking at some more expanded capacity and looking at expanding our operations in Mexico, just for the strong demand that we see and we think that's prudent just strategic areas that we're investing in. We are not really giving any color yet as we go into 2023. But as I mentioned earlier and in my prepared remarks, I just think the backlog is strong for enclosures, and we think we've got momentum with some of the infrastructure and industrial electrification trends that we see going forward into 2023.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nOK. That's great. And then, to the thermal, obviously, orders -- I'm assuming there's some impact there from Russia, but just wondering if you can maybe size that. But more interested in the outlook.\n\nAnd you commented that coding activity and project outlook looks pretty good there. So maybe just give us a bit more color in terms of what you see on the longer cycle side. And then, perhaps just touch on Europe. We are seeing a lot of news their own pipelines, probably it's getting blown up, etc.\n\nHow does that impact nVent in regions?\n\nBeth Wozniak -- Chief Executive Officer\n\nWell, so starting with Russia. Yes, what we're seeing both in revenue and our orders in the thermal management business is -- has been impacted by Russia. And we've always said that was our business most impacted there. What we're seeing in North America is a very strong growth in industrial MRO.\n\nWe've talked about that for six consecutive quarters being very, very strong, and that's continuing. We've seen a lot of focus on things like clean energy and biofuels and carbon recapture, so some energy transition areas, but we think that the project orders and activity both in Europe and North America is strong. And I would say another area for us has been the focus in chemicals, and that has performed very well for us as we go forward. So with respect to the particular disruption that you talked about, that really hasn't been an area for us.\n\nIt hasn't caused any issue, but we definitely are strategically looking at this energy resiliency, energy independency, energy transition and making sure that we're well-positioned globally to serve some of the changes in demand here. And I think, that going into next year, we'll see some strength.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nYeah, that's great. Thanks, Beth.\n\nOperator\n\nThe next question comes from Jeff Hammond from KeyBanc Capital Markets. Please go ahead.\n\nJeff Hammond -- KeyBanc Capital Markets -- Analyst\n\nHey, good morning.\n\nBeth Wozniak -- Chief Executive Officer\n\nGood morning.\n\nSara Zawoyski -- Chief Financial Officer\n\nMorning.\n\nJeff Hammond -- KeyBanc Capital Markets -- Analyst\n\nSo I just want to go back on productivity because it seems like the price cost is getting better, but productivity still seems to be a challenge. And I'm just wondering, as you look into '23, how big of an opportunity that is, if you can kind of catch up some of the supply chain and labor issues you're talking about?\n\nSara Zawoyski -- Chief Financial Officer\n\nWell, I mean, I would start from the standpoint of -- we've worked toward this equation, if you will, that price, plus productivity is going to more than offset right inflation. And so, I think, we've managed that well over the last couple of years. Productivity has been more of a headwind in the current environment, given some of the supply chain challenges. But we would expect that to continue to gradually improve.\n\nI mean, I think, we saw a modest improvement from Q2 to Q3. We expect that to continue into Q4. I think, timing of when kind of that overall supply chain environment will get back to more normal? I can't say that we have a particular view on that. What I would say is that we're really focused on doing something differently than what we've done before in terms of onboarding, in terms of training, in terms of ensuring that we've got the right level of automation in our factories, putting in capacity and investments as Beth alluded to earlier.\n\nSo there's a lot that we're doing to drive that productivity improvement, along with looking to see that gradually improve just from an overall environment perspective.\n\nJeff Hammond -- KeyBanc Capital Markets -- Analyst\n\nOK. Great. And then, just to be clear on the 4Q guide. So you're building in some expectation for distributor destocking.\n\nAre you actually seeing any evidence of that in near term?\n\nBeth Wozniak -- Chief Executive Officer\n\nIt was a caution that we had, right, not knowing, right? And I'd say that our demand -- first of all, we always look at the demand and the throughput, our distributors, and that's very strong. So we're very pleased with that. And I think, order patterns have generally been in line with what we've seen in Q3. So to this point, things look fine.\n\nBut again, as we approach December, you just don't know, right? So I think, it's good for us just to have a cautious view there.\n\nJeff Hammond -- KeyBanc Capital Markets -- Analyst\n\nYeah, absolutely. And then, just -- there's been -- the magnitude of inflation has been pretty eye-popping. But we're seeing some input costs come in on the material side. And I'm just wondering, particularly on enclosures, how you're thinking about durability of kind of holding price should some of these lower input costs persist?\n\nBeth Wozniak -- Chief Executive Officer\n\nI think, the thing to keep in mind is that even if we see some material price easing, we've got inflation in so many other areas. We have inflation in labor. We have inflation in freight. We have inflation in energy costs.\n\nSo on balance, as I mentioned, we think next year is an inflationary environment, and we're going to continue to manage that price cost equation as we go into next year.\n\nJeff Hammond -- KeyBanc Capital Markets -- Analyst\n\nOK. Thanks so much.\n\nBeth Wozniak -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Jeff Sprague from Vertical Research. Please go ahead.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nThanks. Good morning, everyone.\n\nBeth Wozniak -- Chief Executive Officer\n\nGood morning.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nGood morning. Hey, I was wondering if -- just back to Slide 5, if we can just have a little bit more of a discussion of kind of the inflation productivity investment equation? And in particular, I'm sort of interested in how much of a productivity headwind you're fighting against some of these supply disruptions. But could you just kind of unpack that $74 million for us? And then, I've got a follow-up.\n\nSara Zawoyski -- Chief Financial Officer\n\nYeah. So on that $74 million, you've got roughly $55 million of that is going to be inflationary pressures. So that means you've got roughly $19 million, $20 million related to investments and productivity. Maybe a couple of things I would call out there, Jeff, is on the investment side, you can see it on the P&L., I mean, we are investing higher dollars in terms of R&D, sales and marketing and digital that shows up in that SG&A line.\n\nAnd so, that's a significant year-over-year investment that we're making that we believe you're seeing the returns already on that in terms of the new product contribution and what we're doing around digital capabilities to service our customers and to drive productivity. I think, the other piece of that -- balance of that is going to be on the productivity side. And then, that's a couple of different things there. One would just be, we're not yet seeing that supply chain efficiencies that we would expect with the volume leverage that we're seeing.\n\nI think that's marginally getting better from Q2 to Q3, and we would expect that to continue to get better as the quarters progress here and into next year, just as we get more productive in our factories as we've talked about and also put in some of the additional capacity. As we sit here today, and we continue to have just strong demand. And so, that means we're leveraging our global footprint, maybe unlike what we would normally do in terms of very -- in-region -- for-region approach. We are flexing our capacity, engaging with some outside sourcing to help us service that demand.\n\nAnd that just has a cost component to it. But again, as we drive for greater efficiencies in our factories, as we put in that more and more automation as we make some of those capacity investments, coupled with a backdrop of what we see as a gradually improving supply chain, we think that that's going to consistently improve as the quarters progress.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nAnd then, just on the question of capacity. It sounds like it's mostly labor, but your capital spending actually is a little on the low end of what you were previously thinking. Do you need kind of a significant bump in brick-and-mortar here to continue to grow at this pace? You're actually posting better volume growth than a lot of companies we cover, right? We are seeing a lot of organic growth out there. And from a lot of companies, it's price and not volume, but you've got both working.\n\nSo just wondering how much more you can kind of squeeze out of the existing footprint without maybe a material increase in your capital spending?\n\nBeth Wozniak -- Chief Executive Officer\n\nWe've been able to manage our capex spending fairly consistently as a percentage overall, and I think that's true how we think about 2023. Having said that, for the last couple of years, we've always been able to make investments and expansion. So this year, we expanded in a factory in Thailand. As we're going into next year, we're going to expand in Mexico.\n\nAnd what that enables us to do is to strengthen our regional strategy, as well as, as we look at some of these areas for infrastructure growth, we believe that we do need to add some more lines to give us that capacity that maybe is constraining some volume growth today. But Jeff, we believe we can manage that within our current investment plans that we have.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nAnd maybe just one little nit. Just surprised that chemicals are so strong. I'm sure it isn't lost on that -- it's about every chemical company in the world is like imploding from an earnings standpoint. I mean, is there kind of something unusual or unique that's going on that's giving you strength in that particular business at this point in time?\n\nBeth Wozniak -- Chief Executive Officer\n\nI don't know, Jeff, that I would say that there's anything unique there in particular. One of the things as we've talked about some conversion of petrochemical to some of these clean fuels or biofuels isn't for us. They require more maintenance -- attempt to maintain a temperature to allow to flow. So in some cases, it requires more content from us, for example.\n\nAnd I see that's been supporting some of our growth. So that would be maybe the one thing I could point to. But for us, it's just been an area where our value propositions and our capabilities have just played well.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nGreat. Thank you.\n\nOperator\n\n[Operator instructions] The next question comes from Scott Graham from Loop. Please go ahead.\n\nScott Graham -- Loop Capital Markets -- Analyst\n\nYeah, hi, good morning, and congratulations on really just an outstanding quarter.\n\nBeth Wozniak -- Chief Executive Officer\n\nThank you, Scott.\n\nScott Graham -- Loop Capital Markets -- Analyst\n\nI wanted to maybe drill down a little bit further into the impact of higher commercial loan rates and let's say, your commercial buildings market, which is a pretty big market for you guys. Obviously, we all get the whole secular to smart building thing, improving efficiency goes without saying. I'm just wondering, though, if you thought through whether, in a higher rate environment, perhaps some of that activity slows, maybe that market turns into more break and fix next year? You thought through that?\n\nBeth Wozniak -- Chief Executive Officer\n\nYeah, I mean, I think that's right. You see -- I mean, certainly, you've seen the interest rates. Again, we're not really in resi, but you see it starting there with homebuilders right now. And I do think, on the commercial side, we would expect to see that flow.\n\nAnd our view is we're so broad-based in terms of the different types of buildings, warehouses, data centers, etc., that we support with our products and offerings. And they also, particularly with our EFS portfolio, a lot of what we're driving our labor-saving solutions and power and data infrastructure is where we play. So the content, we think, is key. So our view is as we keep coming up with new products that are labor savings that can be extended across medical or institutional or that we believe we're still going to manage to grow and outperform just because of the value propositions that we have.\n\nBut it will -- certainly, commercial is going to slow from where it has been in 2022.\n\nScott Graham -- Loop Capital Markets -- Analyst\n\nOK. Happy to hear you contemplate that because it seems like it kind of has to move the right at least pause. The other I wanted to ask you about was sort of the cadence of orders in the quarter, obviously, continues to be very strong, but does that also includes some pricing, a fair amount of pricing? So I'm just wondering really two things on orders, what the sort of cadence was each month year over year and into October, if possible? And are the order volumes up as well?\n\nBeth Wozniak -- Chief Executive Officer\n\nWell, I think, the one thing I would say as we look at the quarter and just keep in mind that August is a big holiday period in Europe. So when we look at the quarter overall, I don't think there was any -- I mean, it was fairly consistent, right? And as we've gone into the fourth quarter, it's fairly consistent. So there hasn't been any particular trend one way or another, just strong order growth. And of course, it is both volume and price that we're seeing. \n\nScott Graham -- Loop Capital Markets -- Analyst\n\nGood to hear that. Thank you. Appreciate it.\n\nBeth Wozniak -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes from David Silver from CL King. Please go ahead.\n\nDavid Silver -- C.L King and Associates -- Analyst\n\nYeah, hi, good morning. Thank you.\n\nBeth Wozniak -- Chief Executive Officer\n\nGood morning.\n\nDavid Silver -- C.L King and Associates -- Analyst\n\nYeah, I'm going way down my list of potential questions here. But first question, and this will just take a few seconds. But broadly speaking, I guess, I'm interested in your thoughts about the vitality index or new product sales. But more to the point, last couple of years, you've kind of set internal targets for new product introductions, I think, at around 50.\n\nAnd your company has been growing, as you pointed out, pretty -- at a pretty healthy clip and you are sharpening your focus on those high-growth verticals. So is it a reasonable surmise on my part to think that 50 is moving from kind of the target or the ceiling to kind of the floor on your new product introduction efforts? And secondly, maybe just to comment about going to market with new products, maybe the last 12 months, you would probably say we were emerging or recovering from a downturn maybe over the next 12 months globally will be entering an economic slowdown? So just maybe some thoughts about new product introduction pace. And any changes or shifts in how you go to market should the global economy enter a slower patch? Thank you.\n\nBeth Wozniak -- Chief Executive Officer\n\nYeah. Well, I think, with new products, this is an area where I think we've had really tremendous performance. And it really is a cross-functional approach, right, that we think about what is the market opportunity, how do we differentiate and then how do we launch through our supply chain and through our channel partners. So you are correct to say, over the last couple of years, we've been able to launch about 50 new products.\n\nAnd keep in mind, our portfolio has everything from a fastening product, all the way up to a connected control solution or a liquid cooling solution. So there -- we have differences in terms of the cycle time to create those new products. So will that number go up? It could, but I think 50 is a good number for us. What we look to see is that the impact, in terms of our cycle time, the revenue dollars, margin, all of those things, which is why we're seeing our vitality increase.\n\nAnd I would say, from a launch standpoint, I think we've gotten much more effective in the commercialization because launching a new product effectively these days means that you have all the digital assets in place and not just that you launch a new product. And I think, we've gotten really good with our channel partners and with our end users to engage them in our process so that we launch very effectively and have inventory on hand, etc., so that we -- the time of revenue recognition from these new products is a lot faster. So let's say we go into next year when things are slower. I don't think that changes our approach because we're basing our new products on creating value and whether it's labor savings or whether it's liquid cooling, which is energy efficiency.\n\nAnd I spoke to the need for electrification and sustainability. I think, we're going to continue to see a strong impact of new products on our overall growth.\n\nDavid Silver -- C.L King and Associates -- Analyst\n\nOK. Great. And this next question, I guess, I'm looking at Slide 11 in the lower right-hand corner, where you list many of your recent acquisitions. So I believe it was 3 percentage points of your growth this quarter came from M&A or inorganic sources.\n\nWhen I look at that list, I was just wondering if you may comment on which of those acquisitions you think are contributing kind of at above the company average or maybe a little bit below? And in particular, I'm thinking proportionately. I mean, I understand there's all different sized companies in there. But which would you say are maybe punching above your weight or have been positively -- a positive surprise relative to expectations? And maybe if there's one or two that are lagging, that would be helpful as well. Thank you.\n\nBeth Wozniak -- Chief Executive Officer\n\nWell, David, just to clarify, we had said that new products had driven 3 points of growth. That was a 3-point comment. We've said these acquisitions have been growing at a rate of 30% year to date. And so, recall, overall nVent has grown at 20%.\n\nSo our acquisitions are all outperforming our overall nVent growth rate. And so, what I would point to here is more from a -- if you look at CIS Global and WBT, these acquisitions have been focused on data solutions, data centers, so one of that infrastructure areas. When I look at our Vynckier acquisition, it's been focused on renewables and places like solar. So we're seeing growth there.\n\nAnd we think about Eldon focused on global growth and industrial automation. So they really are all -- have all outperformed the models that we put in place, and I just use that as a -- to show that when we've done acquisitions, we know how to focus on high-growth verticals, integrate them into our business and make them successful through our vertical and channel approach.\n\nDavid Silver -- C.L King and Associates -- Analyst\n\nOK. Thank you. I see. I got a little confused there.\n\nThe numbers didn't quite add up. But anyway, that was my mistake. Thank you for clarifying. Appreciate the insight.\n\nBeth Wozniak -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Beth Wozniak for any closing remarks.\n\nBeth Wozniak -- Chief Executive Officer\n\nThank you, and thank you for all of us joining us today. We are very proud of the outstanding performance we have delivered. We will continue to execute on our strategy to make nVent a top-tier, high-performance electrical company delivering for our people, our customers and our shareholders. We believe nVent is well-positioned for the trends in electrification and sustainability.\n\nOur future is bright. Thanks again for joining us. This concludes the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTony Riter -- Vice President, Investor Relations\n\nBeth Wozniak -- Chief Executive Officer\n\nSara Zawoyski -- Chief Financial Officer\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nJulian Mitchell -- Barclays -- Analyst\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nNigel Coe -- Wolfe Research -- Analyst\n\nJeff Hammond -- KeyBanc Capital Markets -- Analyst\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nScott Graham -- Loop Capital Markets -- Analyst\n\nDavid Silver -- C.L King and Associates -- Analyst\n\nMore NVT analysis\n\nAll earnings call transcripts"
}