{
  "companyName": "Fluent, Inc",
  "companyTicker": "FLNT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/fluent-inc-flnt-q2-2022-earnings-call-transcript/",
  "content": "Fluent, Inc (FLNT -0.91%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to the Fluent Inc. 2022 earnings call. [Operator instructions] I will now hand today's call over to Dan Barsky. Please go ahead, sir.\n\nDan Barsky -- General Counsel and Chief Compliance Officer\n\nGood afternoon, and welcome. Thank you for joining us to discuss our second quarter 2022 earnings results. Joining me on today's call are Fluent's CEO, Don Patrick, our CFO, Sugandha Khandelwal, and Ryan Schulke, our co-founder and chief strategy officer. Our call will begin with comments from Don Patrick and Sugandha Khandelwal, followed by a question-and-answer session.\n\nI would like to remind you that this call is being webcast live and recorded. A replay of the event will be available following the call on our website. To access the webcast, please visit our investor relations page on our website, www.fluentco.com. Before we begin, I would like to advise listeners that certain information discussed by management during this conference call will contain forward-looking statements which are covered under the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.\n\nAny forward-looking statements made during this call speak only as of the date hereof. Actual results could differ materially from those stated or implied by our forward-looking statements due to risks and uncertainties associated with the company's business. These statements may be identified by words such as expects, plans, projects, could, will, may, anticipates, believes, should, intend, estimates, and other words of similar meaning. The company undertakes no obligation to update the information provided on this call.\n\nFor a discussion of the risks and uncertainties associated with Fluent's business, we encourage you to review the company's filings with the Securities and Exchange Commission, including the company's most recent annual report on Form 10-K and quarterly reports on Form 10-Q. During this call, we will also present certain non-GAAP financial information relating to media margin, adjusted EBITDA and adjusted net income. Management evaluates the financial performance of our business on a variety of indicators, including media margin, adjusted EBITDA and adjusted net income. The definition of these metrics and reconciliations to the most directly comparable GAAP financial measures are provided in the earnings press release issued later today.\n\nWith that, I'm pleased to introduce Fluent's CEO, Don Patrick.\n\nDon Patrick -- Chief Executive Officer\n\nThank you, Dan, and good afternoon. Thanks to all of you for joining our call today. I'm here together with Ryan Schulke our chief strategy officer, chairman of board and company founder, and Sugandha Khandelwal, our chief financial officer. I'll make some brief comments about our second quarter results, which we believe reinforces the appropriateness of our commitment to quality in an evolving test and learn culture, update you on the progress against our strategic priorities and then discuss the impact of the current economic operating environment.\n\nIn Q2 2022, our forward momentum continued, and we're quite pleased with our performance. Financial results were as follows. Revenue of $98.4 million represents 34% year-over-year growth, and it's a positive reflection of prioritizing our long-term growth strategies. As we continue to test, learn and validate, we are leaning into opportunities where we can establish and leverage Fluent's brand credentials in the marketplace.\n\nOur media margin of $32.3 million is up 60% year over year at 32.8% of revenue. This reflects ongoing strategic investments focused on expanding our media footprint and strengthening our performance marketplace. These results exceeded our expectations. An adjusted EBITDA of $9.4 million represents 9.6% of revenue up $7.6 million year over year.\n\nFluent's strong Q2 revenue growth provides us operating leverage against our performance marketplace and our business model. Our strong second quarter operating results exhibit the continued progress we're making on our long-term strategic growth plan, focused squarely on consumer engagement, enhancing the quality of their experience in our performance marketplace. Importantly, we believe the results also further validate our strategy and in turn, provide us with competitive advantages by leveraging Fluent's core go-to-market capabilities. The strong revenue and media margin growth also reflected the effects of some of our Q3 2022 strategic initiatives that hit earlier than we originally planned as we leaned into our momentum.\n\nAs a key element of our business process, we will continue to access each initiative strategic relevancy to our core while objectively determining where we make our longer-term bets. The enhanced brand strength and foundational principle of our business model is creating more effective and sustainable customer acquisition solutions for our clients while successfully positioned Fluent as a market leader in a rapidly evolving industry environment. As I've consistently outlined Fluent's ultimate competitive advantage is grounded in our three strategic growth pillars, our media footprint, our platform and our performance marketplace. Strengthening our go-to-market capabilities within the logical points of intersection across each pillar is our everyday mission, and it is also what differentiates us in our industry.\n\nWe remain excited on exceeding our clients' performance expectations by delivering a higher quality, more targeted and engaged consumer audience. This is essential as we build Fluent's brand equity while also affirming our credibility with clients by increasing their ROI. We continue to make meaningful progress in expanding and strengthening our strategic growth pillars. And in Q2, here are some of the highlights.\n\nWe accelerated our media footprint expansion into new media channels. Specifically, our biddable social platforms showed continued progress. We're able to provide more relevant content and offers for the consumers and our clients while also leveraging macro pricing and platform opportunities based on the value we were providing. We will continue to test, learn and extend our reach into other media channels as we explore longer-term growth opportunities that a larger Fluent media footprint will create.\n\nRegarding our performance marketplace and platform strategic initiatives, we leaned into our CRM capabilities grounded in higher-quality consumer experiences. The outcome was encouraging as we continued double-digit year over year growth while expanding the depth and increasing the length of our relationships with consumers. CRM provides us with a significant marketplace in creating meaningful downstream consumer engagement while strengthening our relationship with world-class clients in key industry verticals. Critically inherent in our strategic framework is that we enhance each consumer's lifetime value as we evolve our model.\n\nNot only was revenue quite strong, but as importantly, we also managed business mix across our investment profiles to expand Fluent's business unit margins, all while continuing to establish our competitive advantage. Net in Q2, a majority of our media properties were able to expand margins sequentially relative to Q1 2022. Obviously, this will not always be the case, but it's a great example of how managing the mix is a longer-term priority for us. While we realize as a turbulent economic environment before us, we remain excited about Q3.\n\nGiven the more unpredictable macro and geopolitical economic outlook, we are certainly seeing a parallel level of unpredictability in the digital advertising industry, while our consumers and clients access the road ahead. Given the ramifications are rather complex, I want to touch on the relevancy to Fluent's business and our performance marketplace. The breadth and depth of Fluent's first-party data gives us an important advantage with our consumers and clients and that it provides qualitative and quantitative real-time insights through our analytics and technology platforms. Historically, during recessions and times anomic uncertainty, there's both a decline in advertising spend and a significant change in media mix.\n\nAd spend that is inherently less measurable declines and shift toward advertising whose results can be clearly and quickly measured, and that is a core affluent capability. By design, our performance model generates revenue for us when the consumer takes an action that is agreed upon with the client based on their targeted ROI goals. Fluent's performance marketplace has direct measurable and immediate attribution for our clients and, as such, derisk their marketing spend regardless of the fact they may be reducing total ad spending. In this current environment, while remaining disciplined toward our long-term strategic growth plan, we look to accelerate against our growth agenda and take market share in the process.\n\nRegarding the second half of 2022, we see Q3 growth moderating compared to Q2 related to the current economic uncertainty that has led consumer spending less and our clients operating more cautiously. While we see -- we recently seen some consumer sentiment shift across the marketplace, become more heavily engaged with relatively lower cost, lower consideration -- products and services like media and entertainment, that tend to be more recession resilient. Coupled with the reality that we accelerated some of our Q3 initiatives forward in anticipation of headwinds will leave us in strong market position post Q2 and Q3 but with decidedly different flow. We feel confident that our total Q2 Q3 results will land where we planned as we test and learn and ensure revenue is consistent with our strategic course.\n\nWe maintain our belief that on a fiscal year basis, our annual 2022 financial results will continue to show revenue growth returning at or above industry growth rates as we look to earn market share. And we continue to believe we'll see sequential margin improvement return in Q4 as we scale. We anticipate this environment to remain for the foreseeable future, and we'll strategically adapt accordingly to the economic realities in the short term. In closing, while we're being very diligent in managing expectations, we remain fixated on our well-defined growth pillars, and we'll continue leaning into strategically compelling 2022 and 2023 revenue opportunities where we believe we have a differentiated position and significant consumer runway.\n\nEarning market share, where we can leverage our consumer-centric core while executing via our operation capabilities will be the key driver of our longer-term growth agenda. This is the decided path to winning more consumers and establishing competitive advantage in the marketplace while creating shareholder value for our investors. And with that, I'll turn to Sugandha to provide more detail on our financial results.\n\nSugandha Khandelwal -- Chief Financial Officer\n\nThank you, Don, and good afternoon to everyone. We are pleased to report a strong second quarter, which reflects the continued momentum in our business and growth across all the key P&L metrics. As you may recall, we made a strategic decision to launch the traffic quality initiative  to reposition our business and improve the quality of traffic we source into our media properties. As our business has grown, we've also attracted larger and more sophisticated clients to our platform.\n\nFurther, we have delivered a strong quarter with profitable revenue growth, annualized strategy with strong execution and progress against our operating initiatives. In the second quarter, Fluent generated $98.4 million of revenue, up 34% year over year. There was momentum across our core performance marketplace, new channel, and vertical expansion. Through the course of Q2, our team found opportunities to deploy media and beyond what we had anticipated and accelerate our test loan approach to supply discovery.\n\nWe found success with new promotional campaigns, which expanded our addressable audiences and new means of cross-promoting  our programs across Fluent's owned media properties. Our awarded discovery business also demonstrated solid growth in both the U.S. and international markets. And we also continue to improve and optimize our CRM capabilities to drive higher loyalty, retention, and customer lifetime value.\n\nBy leaning on brands, channels and technologies, we're encouraging our customers to come back to our platforms and drive lifetime loyalty, and in the process, generate greater margins for the business. Lastly, Fluent sales solutions, our live agent capability, continue to advance our strategic agenda by providing end-to-end customer service solutions for our advertisers. Our strong double-digit revenue growth during the quarter was driven by an increase in monetization for registration despite the reduced traffic volume from our focus on traffic quality. In Q2, our monetization increased by almost 88% as compared to the same quarter last year and up 23% sequentially over Q1.\n\nThe higher quality traffic has resulted in higher engagement by consumers on our media properties, yielded better conversion rates and provided more valuable customer acquisition from our clients. We believe our focus on traffic quality will continue to use strong monetization which we can then reinvest into media sourcing and product development, driving further client satisfaction and loyalty and turning the flywheel of our model. As it relates to media margin, the primary driver continues to be the mix of our media spend between traditional affiliate sources and the billable platform. Our media margin in Q2 was $32.3 million, up 60% year over year and representing 32.8% of revenue.\n\nFor context, we invested nearly $66 million in paid media in the quarter, our largest cost component. During our last quarter's call, we noted the opportunity to drive high-quality traffic from the billable platform, which we are seeking to optimize into high profitability over time. In the second quarter, we increased both our billable media spend and profitability sequentially over the prior quarter, as well as compared to the same quarter last year. The margin expansion across our media properties led to a favorable mix resulting in stronger overall profitability in the second quarter.\n\nOur operating expenses on a GAAP basis for Q2, comprising sales and marketing, product development and G&A, grew in aggregate by $3 million, or 17% year over year, to $21 million. Within that mix, sales and marketing expenses increased $1.5 million, driven by an increase in business travel, events, and in-person meetings. Our product development expenses increased by $1.4 million, reflecting continued investments that we have made in our technology and analytics platform, as well as development of new ad-based media properties, expanding beyond our traditional focus on web-based media properties. And lastly, our G&A expense increased by $150,000.\n\nWith the increased operating expenses reflecting strategic investments in the business, as well as enhancements to our technology platform and internal capabilities. Finally, on profitability, our adjusted EBITDA, a non-GAAP measure, for the second quarter was $9.4 million representing 9.6% of revenue and up $7.6 million year over year. These profit levels were driven by higher top line, as well as margin expansion, along with a disciplined approach to overall operating expenses. Moving forward, we will continue to manage our media mix by focusing on margin-accretive initiatives and driving operating leverage.\n\nOur team has a number of exciting strategic initiatives in place this year. As Don mentioned, we began some of these initiatives earlier in Q2. The early momentum will help us accelerate our learnings while we're navigating the economic environment and advertiser spend levels, although Q3 growth will be moderate on a sequential basis. Our interest expense remained flat year over year at approximately $440,000, benefiting from the lower cost of debt under our replacement credit facility.\n\nAs of Q2, we expect a cash tax liability due for the federal jurisdiction from utilization of all the remaining annual carryovers in the 2022 tax period. As described in our earnings release, the company determined that the decline in our stock price during Q2 represented a triggering event and an indication of impairment of our goodwill associated with the acquisition of Fluent operating business in 2015. Based on this analysis, the company took a noncash impairment charge to goodwill of $55.4 million in the second quarter. The noncash impairment charge is excluded from our adjusted EBITDA and will have no impact on our operations or liquidity.\n\nWe reported GAAP net loss of $56.9 million in the quarter and adjusted net income, a non-GAAP measure, of $550,000. As a reminder, our non-GAAP metrics are reconciled to comparable GAAP metrics in the earnings release in our 10-Q and 10-K filings. Turning to the balance sheet. We ended the quarter with $26.4 million in cash and cash equivalents.\n\nThis represents an increase of 5% year over year. The working capital, defined as current assets minus balance liabilities, was $51.6 million at the end of the quarter up 16% year over year. Total debt as reflected on the balance sheet was $43 million at the end of the quarter. In closing, we are confident that our high-quality traffic models and strategic investments are the right path to achieving sustainable growth in our business.\n\nAs the economy transitions to slower growth and we head into uncertain times, our management team is laser-focused on execution and operating discipline with the goal of creating long-term value for consumers, clients, and Fluent shareholders. In that regard, we intend to expand our investor relations strategy and outreach in hopes that equity markets will come to see the value we see in our business and the value we are building for our consumers and clients. Thank you for your time. We are glad to take questions now.\n\nOperator\n\n[Operator instructions] At this time, there are no questions. I will now hand the call back over to Don for any closing remarks.\n\nDon Patrick -- Chief Executive Officer\n\nThank you. We are pleased with our strong Q2 results, and we are very proud of our team and the hard work that they're putting in, in terms of our strategic path and our growth initiatives. I want to -- we have a very disciplined operating plan, and we look to take market share in this environment. So thank you so much for your support and thank you for being on the call today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDan Barsky -- General Counsel and Chief Compliance Officer\n\nDon Patrick -- Chief Executive Officer\n\nSugandha Khandelwal -- Chief Financial Officer\n\nMore FLNT analysis\n\nAll earnings call transcripts"
}