{
  "companyName": "Progress Software",
  "companyTicker": "PRGS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/27/progress-software-prgs-q3-2022-earnings-call-trans/",
  "content": "Progress Software (PRGS)\nQ3 2022 Earnings Call\nSep 27, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the Progress Software Corporation Q3 2022 earnings call. My name is Darryl, and I will be your operator for today's call. [Operator instructions] I will now turn the call over to Mike Micciche, VP of investor relations. Mike, you may begin.\n\nMichael Micciche -- Vice President, Investor Relations\n\nOK. Thank you, Darryl. Good afternoon, everybody, and thanks for joining us for Progress Software's third quarter 2022 financial results conference call. With us today is Yogesh Gupta, the president and chief executive officer; and Anthony Folger, our chief financial officer.\n\nBefore we get started, I'd like to remind you that during this call, we will discuss our outlook for future financial and operating performance, corporate strategies, product plans, cost initiatives, the impact of the COVID-19 pandemic on our business, and other information that might be considered forward-looking. This forward-looking information represents Progress Software's outlook and guidance only as of today and is subject to risks and uncertainties. For a description of the risk factors that may affect our results, please refer to our recent SEC filings and in particular, the section captioned Risk Factors in our most recent Form 10-K. Progress Software assumes no obligation to update the forward-looking statements included in this call, whether as a result of new developments or otherwise.\n\nAdditionally, on this call, the financial figures we discuss are non-GAAP measures unless otherwise indicated. You can find a reconciliation of these non-GAAP financial measures to the most directly comparable GAAP numbers in our financial results press release, which was issued after the market close today and is also available on our website. This document contains the full details of our financial results for the fiscal third quarter of 2022, and I recommend you reference it for specific details. We also have prepared a presentation that contains supplemental data for our third quarter 2022 results, providing highlights and additional financial metrics.\n\nBoth the earnings release and this presentation are available in the Investor Relations section of our website at investors.progress.com. Today's conference call will be recorded in its entirety and will be presented -- and will be available via replay on the Investor Relations section of our website. So with that, I'll turn it over to Yogesh and we'll get started.\n\nYogesh Gupta -- President and Chief Executive Officer\n\nThank you, Mike. Good afternoon, everyone, and thank you for joining us as we discuss the results of Progress' fiscal third quarter '22. We're excited to report that we again exceeded the high end of our revenue and EPS guidance and recorded another strong performance across virtually all products and geographies. We remain confident about our revenues, operating margins, and free cash flow for the rest of the year.\n\nDespite strong FX headwinds, we are maintaining our revenue guidance and raising our EPS guidance for the full fiscal year '22. Our results continue to be driven by our Total Growth Strategy, which combines accretive M&A with a highly profitable and predictable business with strong recurring revenues and very high retention rates. Our disciplined execution of this strategy over the past several years continues to deliver consistent performance and meaningful returns to our shareholders. A very important aspect of our business is its predictability and stability.\n\nThe mission-critical nature of our products results in a steady demand from our customers. This steady demand forms the foundation of our business in good times and in challenging times, leading to a high-visibility business model and providing a degree of protection from uncertainties that may impact other types of software businesses. Our third quarter results speak to this length. Annual recurring revenues continued to grow to $495 million, up approximately 13% year over year on an as-reported basis and 4% year over year on a pro forma basis.\n\nNet dollar retention rate was again over 100%, coming in at 101.4%. Revenue of $153.1 million was above the high end of prior guidance as was our EPS at $1. Free cash flow was also impressive for the quarter and our balance sheet continues to strengthen. Two things to note, recall that in our third quarter last year, several very large deals closed at the end of the quarter, giving us a huge beat and a tough compare.\n\nAnd of course, FX has had a very strong negative impact of over $5 million, in this quarter alone. So in that light, our third quarter results are even more impressive and show that Progress is managing well in a challenging macro setting. Demand for our products continues to be strong as our renewal rates. Our execution to meet this demand remains super with noteworthy strength in this quarter in Chef, OpenEdge, DataDirect, and Sitefinity.\n\nAnthony will provide more details on our numbers, including details on the impact of FX. But before that, let me share some commentary about our business and the macro environment. As we have discussed before, the three pillars of our Total Growth Strategy are: number one, strengthen our profitable core businesses by investing in product innovation and customer success to maximize retention and drive organic ARR growth. Number two, focus on operational excellence to successfully execute and integrate acquisitions run efficiently and deliver world-class margins and cash flow.\n\nAnd number three; deploy capital to produce the highest shareholder returns, preferably through accretive acquisitions that fit our disciplined criteria. We also returned value to shareholders through share repurchases. We buy back our stock, both as a calculated element of our capital allocation policy as well as opportunistically if Progress shares offered meaningfully better returns. In the third quarter, we bought back shares worth $24 million.\n\nExpanding a bit on our acquisition strategy, we have been steadfast in our commitment to only doing deals that meet our strict criteria. That means identifying strong enterprise software businesses with a durable, recurring revenue model, high retention and renewal rates, and once we are confident that we can rapidly integrate within our operating model. It also means applying them for the right price, such that the expected return on invested capital exceeds our cost of capital. As a result of our stringent standards, we have passed a number of deals that did not meet recurring revenue or retention rate criteria.\n\nSome sellers have tried to reengage at significantly lower asking price. But we'll remain disciplined because any business we buy must deliver strong returns that are sustainable over the long haul. And while deteriorating macro factors are working in our favor with respect to valuation multiples, private company valuations are still not where we believe they should be. While lower than a year ago, their valuation expectations remain out of line with public markets.\n\nSo we will be patient and not overpay for the assets we acquire. We continue to be an extremely active contender in the M&A market and seek to be a buyer of choice for companies looking to sell. In order to enhance our ability to efficiently integrate acquired businesses and better serve our customers, we're working to realign our go-to-market product and operational teams. This will improve collaboration among the teams that develop, sell and support our products.\n\nThe work we're doing to realign some of our teams will also centralize some shared services, lead to greater systems uniformity and increased operating efficiency. All of this also supports an important element of our total growth strategy, which is operational excellence. Switching to the topic of macroeconomic conditions and inflation. The largest expense drivers in our business are employee-related expenses.\n\nAnd we've worked hard to ensure that we can pay our employees competitively; while at the same time, managing costs across our business in order to protect our margins. We've done this by focusing on employee engagement. Elevated employee turnover can increase expenses in the business significantly because hiring and training new employees is much more expensive than retaining the great talent we have. We continue to work hard to make Progress the kind of place where employees find the work fulfilling, the environment inclusive and authentic.\n\nOur employee engagement scores continue to be in the top quartile in the tech industry. And we're proud that our employee turnover remains significantly below the industry average. I want to thank our employees for their ongoing commitment to the success of the company and for making progress such a great place to work. On top of all this, we continue to diligently manage other costs to ensure that we can sustain our margins during this unprecedented inflationary period.\n\nFor example, earlier this year, we sold our headquarters building and reduced our fixed costs significantly. We also continue to keep a close eye on maintaining some of the benefits of pandemic-era reductions in travel and marketing expenses. Our focus on employee engagement and our efforts to continually streamline operations will help us retain our talent, while at the same time, position us well as we move forward toward 2023. Let me wrap up with a few highlights from our recent global customer event.\n\nJust a couple of weeks ago, we hosted Project 360 in Boston, our largest event in the last three years. CIOs and other executives from our customers and partners as well as developers, IT ops, and Sec-ops practitioners from around the globe, joined Progress team members for two days of strategy discussions, training and education, product demonstrations, and collaboration. For me, personally, it was wonderful to connect face-to-face with technologists and business people who use our products to make a positive impact in the world. Most importantly, it was a reaffirmation that our customers love our products and are, as enthusiastic as ever about working with us.\n\nSo to wrap up, Progress is having an excellent year so far. I'm pleased with these outstanding results for the third quarter. And I'm confident we will finish FY '22 on a strong note as our guidance reflects. And with that, I'll now turn it over to Anthony.\n\nAnthony Folger -- Chief Financial Officer\n\nThanks, Yogesh. Good afternoon, everyone, and thanks for joining our call. As Yogesh mentioned, the third quarter was another exceptionally strong one for Progress. Even more impressive is the fact that these results were delivered in the face of significant foreign exchange headwinds and general economic uncertainty, further demonstrating the incredible strength and durability of our business.\n\nJumping right into the financials, I'd like to start with ARR, which we believe provides the best view into our underlying performance. As a reminder, our calculation of ARR is presented on a pro forma basis to include the results of acquired businesses in all periods presented and in constant currency, with all periods presented at our current year budgeted exchange rates. ARR at the end of Q3 was $495 million, representing approximately 4% organic growth on a year-over-year constant currency basis. The growth in ARR was driven by virtually all our products and was again bolstered by net retention rates, which in Q3 reached a record high, exceeding 101%.\n\nIn the past, we've talked about the investments we've made in our products, which are aimed at improving the customer experience and our net retention rates in Q3 illustrate the continuing benefit of those investments. Revenue for the quarter was $153.1 million, which is approximately $3 million above the high end of the Q3 guidance range we provided in June. Relative to our guidance, we saw better-than-expected results from our DataDirect, OpenEdge, Sitefinity, and Chef Product lines. Moreover, movements in foreign exchange rates during the third quarter alone resulted in a revenue headwind of approximately $1.5 million without which, we would have landed $4.5 million above the high end of our guidance range.\n\nOn a year-over-year basis, revenue increased slightly. However, there are multiple factors that make the year-over-year comparison difficult, including the timing of revenue recognition and contract duration, which we covered in last year's Q3 earnings call, movements in foreign exchange rates, and the addition of Kemp to our 2022 results. When we consider all these factors, our year-over-year revenue growth in Q3 is reasonably consistent with the growth in ARR mentioned previously. We've provided additional details on the Q3 year-over-year revenue comparison in the slide presentation accompanying our press release.\n\nI'd encourage you to look at Slide number 11 in that presentation for a clear illustration of this point. Turning now to expenses. Our total costs and operating expenses were $93 million for the quarter, an increase of $11.6 million compared to Q3 of 2021. The year-over-year increase is the result of two primary factors.\n\nFirst is the addition of Kemp to our business, which makes up the vast majority of the year-over-year increase; and second, our increased wages and travel costs. Like most other companies, we are experiencing wage inflation. However, cost management in other parts of our business is helping to offset those increases. Also, we're seeing travel return to a more normalized level in 2022, not quite where it was pre-pandemic, but certainly elevated from 2020 and 2021.\n\nThis is something we anticipated coming into the year and just like wage inflation, solid cost management in other parts of our business is helping to offset these increases. Operating income was $60.1 million for the quarter and operating margin of 39%, compared to 47% in the year-ago quarter. As previously mentioned, our results in the third quarter of 2021 were significantly impacted by the timing of revenue recognition and as such, year-over-year comparisons are less meaningful. Turning to the bottom line.\n\nOur earnings per share of $1 for the quarter were $0.02 above the high end of our guidance range. Moving on to a few balance sheet and cash flow metrics. We ended the quarter with cash and short-term investments of $225 million and approximately $300 million in untapped capacity under our revolving line of credit for a total liquidity of $525 million. DSO for the quarter was 48 days, an improvement compared to 54 days in the year-ago quarter.\n\nDeferred revenue was $251 million at the end of the third quarter, down slightly from the second quarter, reflecting normal seasonality in our business, coupled with the impact of foreign exchange rates on deferred revenue. Adjusted free cash flow was $39 million for the quarter, up $4 million or 11% from the year-ago quarter. During Q3, we repurchased approximately $24 million of Progress stock. And at the end of Q3, we have approximately $80 million remaining under our current share repurchase authorization.\n\nIn the fourth quarter, we will continue to evaluate the market price of our shares, along with other factors in determining whether to make additional share repurchases. In the first three quarters of 2022, we have repurchased a total of $75.5 million of Progress stock. OK. Now I'll turn to our outlook.\n\nAt different times in my remarks, I've mentioned the impact of changes in exchange rates on our reported results and I'd like to provide a little more insight. The primary point I'd like to highlight is the mix of currencies in which we transact is different than the disclosed geographic mix of our business. So when it comes to transacting in different currencies, it's worth noting that more than 70% of our revenue and approximately two-thirds of our expenses are denominated in U.S. dollars.\n\nThis mix of currencies results in a hedge on our operating margins. Meaning, our operating margin is generally much less exposed to movements in foreign exchange rates than our revenues and this has been the case during 2022. Now shifting back to our outlook and starting with the full year 2022. We're maintaining our revenue guidance to be between $609 million and $617 million.\n\nThis outlook includes an increase to our revenue guidance of approximately $4 million, which is offset by a $4 million foreign exchange headwind. To help illustrate this point, we've included a slide in the presentation that accompanies our press release. And I'd encourage you to look at Slide number 14 for a clear illustration of this point. We're maintaining our outlook for operating margin for the year at approximately 39% to 40%.\n\nWe're maintaining our outlook for adjusted free cash flow to be between $185 million and $190 million. And we're increasing our outlook for earnings per share to be between $4.08 and $4.12. Our guidance for full year EPS assumes a tax rate of 20% to 21% and approximately 44 million shares outstanding. For the fourth quarter of 2022, we expect revenue between $157.6 million and $165.6 million and earnings per share between $1.06 and $1.10.\n\nIn closing, we're thrilled with our financial performance and our outlook for the balance of 2022. And we believe the clear strength in our business and our balance sheet positions us very well to continue to execute on our total growth strategy. With that, I'd like to open the call for Q&A.\n\nOperator\n\n[Operator instructions] And our first question comes from Fatima Boolani from Citi. Go ahead, Fatima.\n\nFatima Boolani -- Citi -- Analyst\n\nGood afternoon. Thank you so much for taking my questions gentlemen. Yogesh, I'll start with you. Last quarter, you did allude to or offered an inclination toward increasing prices across your portfolio.\n\nSo I just wanted to get a quick update on that in terms of how you're thinking about the parameters of these price increases and particularly in the context of the inflationary environment where you're absolutely managing costs, but just curious on sort of the top-line inputs from just outright pricing increases across your suite of solutions? And then I have a follow-up for Anthony if I could.\n\nYogesh Gupta -- President and Chief Executive Officer\n\nHi, Fatima. Thank you. And yes, we did talk about the-what we could do with respect to price increases. And let me share with you sort of the three parts to that answer.\n\nPart one is that we have with many of our software vendors who are our partners. They embed our software in their software. We have long-term relationships and a revenue share responsibility -- sorry, revenue share relationship where effectively, we don't really change the prices or can't really change prices. It's a percentage of what revenue they get, and we collect the percentage of that.\n\nSo there is a segment there that we can't touch at all. There is a second segment where of our customers who, of course, have multiyear contracts. And so when those contracts come up for renewal, we basically continue to look at opportunities, and we are increasing prices. But again, I would like to make folks aware that the -- we have a larger number of multiyear contract customers than one-year contract customers.\n\nSo, Fatima, we have made changes to some of our prices, some of our product prices. We do have a third category of products, which are in -- what I would call extremely price competitive markets. And there, we are careful about increasing prices. We sometimes reduce our discounts and so on.\n\nSo we're trying to use the lever on price the best we can. But I do want to point out that it isn't as though we can take our entire business and go, hey, let's increase price ex-percent across the board and see that ex-percent show up in the next 12-month cycle. Is that -- sort of did that explain it a bit?\n\nFatima Boolani -- Citi -- Analyst\n\nThat's very helpful. So we should more or less expect a gradual visible impact versus anything pronounced or anything seasonally pronounced.\n\nYogesh Gupta -- President and Chief Executive Officer\n\nExactly.\n\nFatima Boolani -- Citi -- Analyst\n\nOK. Excellent. Thank you. Anthony, just for you, just on the net retention rates, a record high, as you mentioned.\n\nCan you remind us the key vectors of expansion on this metric? And maybe sketch out the priority sequence of factors that will help drive and even sustain net retention rates in excess of 101%. And that's it for me. Thank you.\n\nAnthony Folger -- Chief Financial Officer\n\nSure. Thanks, Fatima. Yeah. The big driver on net retention really is upsell.\n\nWe upsell within existing relationships and we continue to grow relationships with customers, I think we tend to be very, very close to our customers. We've got a very strong account sort of account-based management model in place, a good customer success organization in place, and we invest in the technology so that we understand where our customers are going. And so most of what we're doing to drive improvement in net retention rate has to do with continuing to grow with customer relationships and continuing to invest in the product so that we're not giving customers an excuse to churn out. So really, I think we're increasing the gross retention rate slightly.\n\nAnd then we're continuing to grow relationships with our existing customers. And really that for us, there may come a time in the future where we're able to do more with cross-selling products. We don't do a lot of that right now. And so the focus really is on really a level of intimacy with our customers that helps us know where they're going.\n\nWe make the right investments in our products and continue to grow those relationships. And so I think that's what our organizations are designed around, and we'll continue to focus there going forward.\n\nFatima Boolani -- Citi -- Analyst\n\nI appreciate that detail. Thank you.\n\nAnthony Folger -- Chief Financial Officer\n\nYep.\n\nOperator\n\nAnd our next question comes from John DiFucci from Guggenheim. Go ahead, John.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nThank you. So I think this is for you, Yogesh, or maybe, Anthony, you might want to chime in, too. You beat the high end of the revenue guidance by easily this quarter and you maintained guidance. And I get the $4 million foreign exchange impact since you gave guidance, but you actually beat our numbers by more than that.\n\nI guess, what does that say about your views on the macro backdrop? I just get your sense on that. And I know your business is really steady but you -- I'm sure you're still close to your customers and you talk to them about what they're doing.\n\nYogesh Gupta -- President and Chief Executive Officer\n\nSo, John, we feel really confident about the way our business is shaping up. I think Anthony mentioned, I think the Slide 14 or something that sort of shows how every quarter the FX has continued to negatively impact what we wanted to guide. And so even though the expectation at midpoint looks at the same point, the numbers have gone up in constant currency quite a bit. So we are seeing a healthy demand.\n\nWe are not seeing demand fall off, which I mean, if you think about it, right, over the last three quarters, every single quarter, especially in constant currency, we have raised our top-line guidance every single time. And so to me, that's just an indication of that. And speaking to our customers, we have this great customer conference. It was -- people are really engaged.\n\nThe products that they're using from us are solving real business problems for them that are mission-critical. And so what that means is they stick to us and stick with us and continue to expand as their needs expand. So I am really positive about and bullish about where our business is going. Obviously, can't too much about FX, but that's the way the world goes.\n\nAnthony, do you want to add anything?\n\nAnthony Folger -- Chief Financial Officer\n\nYeah. Yes, I would just say, John, we -- as has been the case with Progress for a number of years, we probably don't see the same peaks and values as other software companies. And so when money is free and everything is frothy, maybe Progress doesn't see the same upside or same growth in terms of the customer base that we have. But the flip side is that when times are tough, because of the mission-critical nature of the products that we have, the values tend to be a lot more muted for us, too.\n\nAnd I think that's what we're seeing right now. We're not certainly not blind to what's going on out there in the macro and we're staying close with our customers. But I think the mission-critical nature of the products that we have and the close relationships with our customers have given us the ability to just continue to grow with them. And so we'll stay on top of it.\n\nObviously, everyone is going to continue to monitor the macro pretty closely, and Progress is certainly going to continue to do that as well. But I think that's where things have been for '22.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nThat all makes sense. And if I could, Anthony, one for you. Just sort of last quarter, you were really clear that there was a large renewal pulled forward in the year-ago period. So when we're thinking about the compare, although that looks -- you put up some really good numbers here.\n\nBut as we contemplate guidance going forward, is there anything like that, that we should be thinking about? Any pull forwards or anything unusual about the renewal base?\n\nAnthony Folger -- Chief Financial Officer\n\nNo. Nothing unusual. Obviously, the -- if you were to look at that Q3 comp last year, that was revenue that moved from Q4 of 2021 into Q3 of 2021. There's about $10 million of that.\n\nAnd so we -- when we normalize for that, I think it provides a reasonably healthy outlook for '21, but also for Q4 of '22. And you also think about the fact that Kemp was part of the business in Q4 of last year. So the incremental contribution from Kemp in Q4 is a lot smaller. So our view is that Q3 results when you normalize then we are really strong.\n\nThe Q4 outlook is strong. As we think about 2023, obviously, we're not guiding there today. But we'll be sure to call out any anomalies in the revenue distribution when we get closer there.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nGreat. OK. All clear, guys. Thank you very much.\n\nAnthony Folger -- Chief Financial Officer\n\nThanks, John.\n\nOperator\n\nAnd our next question comes from Ittai Kidron from Oppenheimer. Go ahead, Ittai.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nHey, guys. A couple of questions for me. Maybe Yogesh with you. I do want to go back to John's question on macro.\n\nAre you seeing any elongation in sales cycles and renewal activity? Do you see customers requiring a few more signatures on closing on renewals? Are you seeing customers maybe reconsidering renewals or pushing them out or downsizing as a result? Anything Yogesh you can see that you're seeing out there, would it be by region as well, if there's any specific color related to that, that would be greatly appreciated.\n\nYogesh Gupta -- President and Chief Executive Officer\n\nIttai we're not -- to be honest, we're not really seeing much of that. I'm sure there's some internal scrutiny going on in organizations. But from our perspective, we've had business close on time that we expect it to close in Q3. Obviously, otherwise, putting up the numbers we put up would have been not possible.\n\nWe've had people expand their relationships with us and continue to do so. We -- I'm actually -- I know that that is something that I've heard from other organizations and other companies. I think the difference is that our business is primarily focused around renewals and our expansions are primarily focused around the capacity of the work that people are trying to do. So let me give you an example, right.\n\nIf somebody is using Chef for their environment and their environment scales up because they've actually ended up doing more with their environment. And now they have a bigger environment and now they need more effectively capacity for deploying software securely or deploying the infrastructure security using Chef, the deal with Chef becomes bigger with us, right? So it is because we are in the IT op side and as well as on application development, which is more on the run time side rather than developing new things, we really see a really solid business right now. So I know that I'm probably going against the stream with respect to what the rest of the world is talking about. But for Progress Software, that's actually one of our core strengths, having mission-critical software that people need even when times are tough, makes us such stable.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThat's great. Great to hear. And then, Anthony, just on the operating margin. I guess you're closing on a year now in Kemp.\n\nMaybe you could talk about what's left to squeeze out there from a margin or cost standpoint? And before Kemp, you had higher operating margins, you're kind of reiterating the same operating margin into the fourth quarter. What will it take for you to get over 40% again from an operating margin standpoint?\n\nAnthony Folger -- Chief Financial Officer\n\nYes. I think there's probably not much left to do with Kemp as we get into the fourth quarter here. I think from an integration perspective, we've done everything that we need to do. I think the business is performing well.\n\nI think as we look out and start to see the contribution for Q4, I think it's a pretty solid contribution, probably generally in line with the business case that we've put out. Kemp will be affected by foreign exchange rates, just like the rest of our business will be. So we'll keep an eye on that. And I think our business generally is a little bit impacted by those foreign exchange rates, and there's probably a little bit of a slight margin compression there, not anything like what we would see on the revenue line.\n\nAnd I talked a little bit about having more of a natural hedge on the operating income line. We're probably 75% hedged, 75% to 80%, generally speaking, from the negative impact on revenue. But I think Kemp is pretty much chugging along on plan. We'll see how our margins evolve in Q4 and going into 2023.\n\nBut I think we're feeling like the margin profile is as stable as it's been a long time for us.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nVery good. Excellent. Thank you.\n\nAnthony Folger -- Chief Financial Officer\n\nYep.\n\nOperator\n\nOur next question comes from Anja Soderstrom from Sidoti. Go ahead, Anja.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nThank you for taking my questions. I'm just curious, you said you made investments in improving the customer experience, which seems to be very important for you, considering you're dependent on your current customer base. Can you just elaborate on what kind of improvements you've done there and what we can expect from those?\n\nYogesh Gupta -- President and Chief Executive Officer\n\nYes. So, Anja, we continually look for better ways to engage with our customers. So there are two areas of investment. One area of investment is in our products, continuing to innovate and making sure that our products continue to be relevant and market-leading for our customers, right? So for example, like now, for example, our DevTools products for Blazor are absolutely the best in the market.\n\nAnd we continue to see interesting customer successes. One of the Blazor users, which happens to be the S&P Global Markets Market Intelligence team, the MD there basically spoke about how it has helped them make their apps much more engaging. And obviously, they deal with trillions of dollars of fundraising that companies do either through IPOs or secondaries or debt offerings or whatever. So I think we -- one of that is, as I said, around product investment and innovation.\n\nThe second area is around customer success and customer intimacy. And Anthony spoke about the fact that our customer intimacy efforts are the ones that basically allow us to keep our customers engaged with us and to us, be engaged with them. And so that's where we make investments. But these are not -- I don't want you to think of these as incremental investments -- these are -- we've been making these investments all along, and we will continue to make these investments.\n\nSo I don't want to imply Anja that we are increasing investments, right? It's not that. We're continuing to invest the way we've been investing in the past.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nOK. Thank you. And then can you also tell us how -- what you see in the M&A market? Are you -- are you sort of much more active there now? Or you're waiting to see when the prices come down? Or what's your sort of approach right now to further M&A?\n\nYogesh Gupta -- President and Chief Executive Officer\n\nSo we are extremely active, Anja. An interesting thing happened this year, I think, which was quite unusual, I think, a little bit. In July and August for a couple of months in the summer, it seemed like everybody wanted to take a vacation given that they were in 2020 and 2021, people weren't taking summer vacations. So the deal flow slowed down.\n\nSo the amount of activity in the M&A market in terms of even deals coming on the market slow down. But that didn't mean that we didn't stay engaged just less deals showed up. And we've seen it already pick up this month. So we are extremely active.\n\nWe are not waiting. We are looking at the right opportunities and the right type of businesses. And where it makes sense, we compete to the right value that we feel is right for our shareholders. I think that's the fundamental process that we go through.\n\nSo we are extremely active.\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nOK. Thank you. That was all for me.\n\nYogesh Gupta -- President and Chief Executive Officer\n\nThank you, Anja.\n\nOperator\n\nAnd our next question comes from Brent Thill from Jefferies. Go ahead, Brent.\n\nUnknown speaker\n\nHi, guys. This is [Inaudible] on for Brent. Thanks for taking the question. I guess could you talk a little bit about the mix of enterprise versus mid-market customers on your platform today.\n\nAnd where do you want to see this trend over time?\n\nYogesh Gupta -- President and Chief Executive Officer\n\nSo the vast majority -- so again, our business, I would say, I would break down our business into two major segments first, right? There's a segment about approximately one-third of our business, let's say, 30% of our business is other software companies, right, where we have 1,700 other software companies whose products are built on top of our products, they embed our products into their products and then they license those to all kinds of companies, large enterprises as well as mid-market companies. And those software companies range from the largest names you can imagine, including Microsoft and Oracle and Adobe and IBM and SAP, and others and as well as a host of mid-market software companies around the globe. So that's one audience. And really, their customers can be enterprise customers or they can be mid-market customers.\n\nThen direct to the market business where we sell to the business, the vast majority of our business is mid-market. We, of course, have phenomenal enterprise customers, right? And 90% of the Fortune 500 are our customers. So I don't imply that we don't have great large customers. But in terms of revenue impact, the vast majority of our business is mid-market customers.\n\nAnd we like that, by the way. So we actually believe that in-stock elephant hunting, we like the fact that we are able to do mid-market deals and we're able to work with businesses and grow with them as they grow and have a broad base that cuts across a whole bunch of different industries. So we have resilience to a specific vertical industry doing well or not doing well. We have resilience to geographies.\n\nWe have resilience to sectors. So it is really an important thing for us. And we primarily focus on growing our mid-market presence around the world.\n\nUnknown speaker\n\nThat's very helpful. Thank you. And maybe just one more. Could you just remind us of the split between the contribution of ARR coming from existing and new customers? And what Kemp is that anything different that you saw on Q3?\n\nAnthony Folger -- Chief Financial Officer\n\nYeah. I don't think we've broken out the ARR contribution coming from existing versus new, obviously, with a business like ours, the vast majority is going to be coming from existing. So I would say significant majority. Kemp, I would say nothing sort of unusual or different in the third quarter.\n\nBut Kemp overall, when we acquired the business, we expected it to be probably close to $70 million in revenue. And the mix of recurring revenue was a little bit lower than what we have in our business, but that was sort of known coming in. And I think there was a drive to improve customer retention rates and net retention rates. And I think we're seeing some success with the integration.\n\nSo nothing, I think, unusual with their ARR model or their ARR makeup relative to the rest of our business.\n\nUnknown speaker\n\nUnderstood. Thank you.\n\nOperator\n\nAnd our next question comes from Pinjalim Bora from J.P. Morgan. Go ahead, Pinjalim.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nGreat. Thank you, guys. Congrats on the quarter. I wanted to ask you about the -- go back to the price increase question, which was, I think, one or first or second question in the queue.\n\nBut the -- when I look at the pro forma ARR sequential additions, I think it's something like $9 million seems probably the highest in the last eight quarters, at least in my model. Is there -- are you seeing any impact of price increase at this point that's kind of helping that number a little bit?\n\nAnthony Folger -- Chief Financial Officer\n\nI think it's -- Pinjalim, thank you. I think the price increase has a very, very tiny contribution to it. I don't want to say it's zero, right, I don't imply it is zero. There is some impact on it.\n\nBut no, it was quite small compared to the rest of it. It's hard for me to estimate that in any quantifiable way, but I think it's extremely small.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nOK. Got it. And then, Yogesh, I think you alluded to a go-to-market realignment in your script. I wanted to ask you if you can elaborate on that.\n\nIs that kind of folding Kemps two-tier sales motion into the broad broader organization? Is it something else? Help me understand what you're talking about?\n\nYogesh Gupta -- President and Chief Executive Officer\n\nYes. So I think it is about a better way to go to market. So we are basically saying which products that we now -- we've acquired three companies over the last three years. And when we acquired them, we were sort of running them differently than we would like to run them because we see that certain products can go to market better and we can serve our customers better that way and go to market better.\n\nWe also want to be ready for M&A and actually be able to do M&A across our entire portfolio in a much more rapid way and be able to integrate M&A more rapidly. So both those things are driving what we are doing. It really is primarily realigning some of our functions and not more than that.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nAnd we have no more questions at this time. I'll turn it back to the speakers for final comments.\n\nYogesh Gupta -- President and Chief Executive Officer\n\nWell, thank you very much for joining us on our call today. We look forward to talking to you again soon and have a wonderful evening. Goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Micciche -- Vice President, Investor Relations\n\nYogesh Gupta -- President and Chief Executive Officer\n\nAnthony Folger -- Chief Financial Officer\n\nFatima Boolani -- Citi -- Analyst\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nAnja Soderstrom -- Sidoti and Company -- Analyst\n\nUnknown speaker\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nMore PRGS analysis\n\nAll earnings call transcripts"
}