{
  "companyName": "Berkeley Lights, Inc.",
  "companyTicker": "BLI",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/berkeley-lights-inc-bli-q2-2022-earnings-call-tran/",
  "content": "Berkeley Lights, Inc. (BLI -3.25%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nThank you for standing by. Welcome to the Berkeley Lights conference call. I would now like to turn the call over to Suzanne Hatcher. Ms.\n\nHatcher, please go ahead.\n\nSuzanne Hatcher -- Vice President, Communications and Investor Relations\n\nThank you, operator. Good afternoon everyone, and welcome to Berkeley Lights' second quarter 2022 earnings call reporting financial results for the quarter ended June 30th, 2022. My name is Suzanne Hatcher, vice president, communications and investor relations at Berkeley Lights. I'm joined today by Dr.\n\nSiddhartha Kadia, chief executive officer; Mehul Joshi, chief financial officer; and others from the management team. Before we begin, I'd like to remind you that management will be make statements during this call that are forward-looking statements within the meaning of Federal Securities Laws. These statements involve material risks and uncertainties that could cause actual results or events to materially differ from those anticipated. For more information, please refer to the risks, uncertainties and other factors discussed in our SEC filings.\n\nExcept as required by law, Berkeley Lights disclaims any intention or obligation to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. This conference call contains time-sensitive information and is accurate only as of the live broadcast on August 9, 2022. With that, I'd like to turn the call over to Siddhartha.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nThanks, Suzanne, and thank you everyone for joining us. In our call today I will spend a fair amount of time discussing Berkeley Lights updated near-term strategic plan and then Mehul, our new chief financial officer will review our second quarter 2022 results. Since joining Berkeley Lights in early March, I become even more confident in our market opportunity and enthusiastic about the advantages of our differentiated technology. On our last earnings call in early May, I shared my plan to spend my first 100 days at Berkeley Lights reviewing our business strategy, recruiting for key leadership positions, and engaging with key stakeholders.\n\nI have assessed the company's current situation comprehensively speaking with customers, investors, employees, and industry partners to make informed decisions on how to move the company forward. It is clear to me that the Berkeley Lights technology has pioneered entirely new process by which functional biology at a cellular level could be researched and applied in therapeutic discoveries with unprecedented speed. However, to enable adoption of this technology, we must evolve our organization. The new Berkeley Lights leadership team and I are turning the page and focusing on building a diverse life sciences tools and services company with a culture of innovation, customer centricity, and a commitment to excellence in quality.\n\nWe have updated our near-term strategy and execution plans focusing on five key pillars. Number one, generate positive operating cash flow by early 2025. We will do this by building a growing profitable and sustainable business versus pursuing growth at any cost. This will be accomplished through revenue acceleration supported by an updated market-driven product portfolio and pricing strategy and disciplined expense and cash management.\n\nWe expect to generate positive operating cash flow at $150 million of revenue. The management has taken an initial step to reduce operating costs through a global workforce reduction of approximately 12% in July 2022 and optimized business structure and processes. This resulted in an immediate decrease in the operating costs and working capital requirements. In conjunction with other cost-saving initiatives, we expect to reduce our cash burn to approximately $30 million in 2023.\n\nNumber two, priorities R&D return on investment through increased focus and rigor on development initiatives. We will only dedicate resources for the highest value projects. In our partnership and services business, this means that the high throughput functional screening service agreements must support our margin and profitability goals as well as create the opportunity to participate in downstream economics, such as milestone payments and royalties where appropriate. In the near term, we are committing resources to partnerships and services business to accommodate the growing interest from a diverse set of companies in partnering with us, specifically in the gene therapy, viral vector development and manufacturing space where there is significant market demand.\n\nAnd our technology provides a highly differentiated solution. In Q2, Berkeley Lights validated the unique capability on our platform to select and retrieve high-value stable producer cell lines that will improve the cost and therapeutic relevant yields for manufacturing AAV-based gene therapies. The Berkeley Lights workflow takes roughly 10 days to screen up to 3,000 cell lines, enabling an unprecedented timeline and throughput that allows us to discover rare clones at a speed and cost that no other technology can match. The cost of AAV production is widely regarded as the most significant constraint in this segment of the gene therapy industry.\n\nAnd we believe that Berkeley Lights technology is the long-sought solution. There are a growing number of AAV clinical trials every year, with 353 clinical trials and clinical studies in 2021 and projected to reach 850 by 2025. We will partner with CDMOs and gene therapy companies to enable them to meet the largely unmet demand of the significant number of potential drugs to hit the market in the next 10 years. Given initial market and customer interest in this Berkeley Lights capability, this could be game changing in the industry, and the company's largest return on investment opportunity in the near term.\n\nWhile our partnership and services team has experienced strong demand for many applications, we intend to dedicate a majority of that team to the development of this workflow in the balance of 2022 and in 2023. We believe another emerging opportunity is in TCR discovery. As communicated in a press release last week, Berkeley Lights partnered with Jaime Leandro Foundation for therapeutic cancer vaccines to demonstrate that our high throughput screening platform can be used to discover novel T cell receptors from patient blood in a one-week workflow. TCRs offer a powerful new therapeutic modality to target some of the most challenging human diseases, but has been historically limited in market adoption because the difficulty to discover TCRs that has proven to be functional against the target antigen.\n\nNow that we have validated out that our platform the ply isolate functional TCRs. Our partnerships and services team is actively exploring commercial partners interested in this significant opportunity. I'm also excited about the strategy of our instrument platform business. We plan to launch three new configurations of our system in the next three years, details of which I will share in just a few minutes.\n\nFinally, we will seek out commercial or technology partners who are relevant or explored developing a strong out-licensing technology model. We are currently in discussions with several potential industry partners for cell therapy initiatives. Number three, deliver consistent commercial execution through a new sales structure, and enhance product portfolio and pricing strategy. We made two internal appointments over the last quarter, promoting Dr.\n\nYue Geng to general manager of the platform business; and Dr. Troy Lionberger, to general manager of the partnerships and services business, both Yue and Troy have been with Berkeley Lights for more than six years. They have previously served in sales and commercial positions at the company and have a deep understanding of our technology, and markets. I'm grateful for the ongoing leadership and confident in their abilities to lead our team to the next phase of growth.\n\nWe have completed an in-depth analysis of our markets and unmet customer needs in various segments. Our well-recognized capabilities in antibody discovery and cell line development have enabled many biopharma customers, CROs and CDMOs in their therapeutic discoveries and development. We believe our technology can also provide significant value in high-growth academic research segments, for example, gene editing and immuno oncology applications. We are started to form academic collaboration pilot programs to help inform the design of these new applications.\n\nTurning to our product and pricing roadmap, we recognize the need to provide optionality for customers to access our technology. To support this, we are materially enhancing our approach to the market with the introduction of a more flexible configuration and pricing strategy that encompasses the total cost of ownership. Beginning in 2023, we will launch application specific models of the beacon system each year, culminating in the launch of the beacon light platform in 2025, a low cost benchtop device with segment specific versions. We believe broadening our portfolio of platforms will allow us to access a wider array of potential customers in the market with products that are more tailored to their needs and budgets.\n\nIn addition, we'll expand our access programs that offer financing options. Number four, build a world-class leadership team with a proven track record in profitably scaling life sciences tools companies. On our last call, I shared our goal to build a world-class life sciences leadership team and bring onboard individuals with a proven track record of success in our industry. Till then, we will announce three key executive leadership hires, Mehul Joshi as our new chief financial officer, Dr.\n\nRolando Brawer to the newly created position of executive vice president of strategy and corporate development; and Lucas Vitale as chief human resources officer. I'm thrilled to welcome Mehul, Rolando, and Lucas to the Berkeley Lights leadership team. Mehul has more than 25 years of experience in financial leadership roles. His wealth of financial and operational knowledge, experience building, and leading global finance teams, and strategic mindset will be invaluable to our efforts to fully unlock the value of Berkeley Lights.\n\nRolando is a highly experienced corporate development leader with robust scientific expertise. Rolando most recently served as vice president of services and technology Alliances & Ventures at Danaher, and in several corporate development positions at Exact Sciences and Genomic Health. Rolando's experience also including leading Thermo Fisher Scientific global strategy for out-licensing and commercial supply for the company's life sciences solutions group. Lucas Vitale brings more than 20 years of human resources experience in the life sciences and medical device industries.\n\nPrior to Berkeley Lights, he served as senior vice president of human resources at Arena Pharmaceuticals and as chief human resources officer at NuVasive. Prior to that, Lucas spent 10 years at Life Technologies where he was an integral member of the global HR leadership team and served on the company's acquisition and integration team where he supported the scaling of the company from several 100 to nearly 10,000 employees. As I discussed in my first earnings call in May, my own experiences, I've been with scaling life sciences businesses in both public and private equity-based companies. My leadership team and I are putting in place processes to shift to a performance-driven culture across all functions.\n\nThis will be critical to our efforts to effectively scale our business and advance our market position through targeted investment, and strong execution. Collectively, the new leadership team has the experience needed to build a diverse life sciences tools and services company. Number five, evaluate M&A opportunities that will help us accelerate profitable growth and leverage our current cost structure. Over the past quarter, we have conducted and synthesized market research to understand customers unmet needs, and competitive dynamics.\n\nThese features will help us formulate data driven decisions on what markets to expand into and what inorganic options will be complementary to our business and technology. We expect to pursue synergistic merger and acquisition options that expand our total addressable market and/or provide leverage to our SG&A and R&D expense structure. We believe by focusing on these five pillars that I described, we can transform Berkeley Lights from a technology platform company to a diverse life sciences tools and services company. We will continue to advance important changes to our business through the rest of this year to lay a strong foundation.\n\nWe have immense opportunities ahead of us, and we have a strong plan in place to achieve our strategy to create value for our shareholders. Now, I would like to turn the call over to Mehul, to discuss our second quarter 2022 results.\n\nMehul Joshi -- Chief Financial Officer\n\nThank you, Siddhartha. I'm excited to join the Berkeley Lights team and eager to build on the company's strong foundation as a revolutionary innovator and continue to help scientists make extraordinary breakthroughs. Looking at our results for the second quarter 2022, total revenue was $19.2 million, down 1% compared to second quarter 2021. By geography, North America accounted for 52% of total revenue in the second quarter, followed by APAC at 37% and EMEA at 11%.\n\nDuring Q2, we experienced the same macroeconomic conditions that our industry is facing, including elongated sales cycles and tightening of capex budgets. Direct platform revenue was $6.4 million in the second quarter 2022, compared to $11.4 million in prior year. Our installed base grew by five placements during the second quarter of 2022 to a total installed base of 120 platforms. Recurring revenue was up 50% to $5.9 million in the second quarter of 2022, compared to $3.9 million in prior year.\n\nRevenue from the partnership and services business increased by 74% to $6.8 million in the second quarter 2022, compared to $3.9 million in the prior year. Gross profit for the second quarter of 2022 was $12.9 million, compared to $12.7 million in the prior year. Gross margin For the second quarter of 2022, was 67%, compared to 66% in the second quarter of 2021. The increase in gross margin year over year was due to a higher mix of recurring revenue and partnerships and services.\n\nWe expect the company's strong gross margin to provide significant operating leverage as we execute our strategy. Operating expenses in the second quarter of 2022 were $38.5 million inclusive of $6.6 million of stock-based compensation, compared to $30.6 million in the prior year, inclusive of $5.6 million of stock-based compensation. Operating expenses in Q2 2022, included $18.2 million in R&D, $13.0 million in G&A, and $7.3 million in sales and marketing. Net loss for the second quarter 2022 was $25.7 million, compared to a loss of $18.2 million for the prior-year period.\n\nAll net loss numbers are inclusive of stock-based compensation. We ended the quarter with cash and short-term investments of $152.4 million. Our available liquidity is $162.4 million, which includes our revolving credit facility. Now turning to revised guidance for full year 2022.\n\nFollowing the strategic business assessment by management, Berkeley Lights now expects full year 2022 revenue to be approximately in line with full year 2021 revenue as we put in place processes to execute against our updated business strategy. As Siddhartha discussed, we are laying a strong foundation this year to achieve our goal of generating positive operating cash flow by 2025. With that, I will turn the call back to Siddhartha.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nThank you, Mehul. As I close out my formal remarks, I wanted to reiterate that I have enormous confidence in Berkeley Lights, and our ability to capture the opportunities ahead of us as we accelerate the adoption of our technology. The changes we are making will help us manage our costs and focus on the right objectives to build a growing profitable and sustainable business. We look forward to sharing progress achieved against our new operating strategy in the coming months, including an Investor Day planned for later this year.\n\nWith that, we will now open it up for questions. Operator?\n\nOperator\n\n[Operator Instructions] We will now take the first question from Tejas Savant with Morgan Stanley. Please go ahead.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nHey, guys. Good evening and thanks for the time here. Siddhartha, one for you to kick things off here. I know you mentioned this plan to launch app specific instrument starting in '23.\n\nCan you just elaborate on what that means for your subscription model? Are you now sort of deemphasizing that in favor of more capex focus model?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nGreat question, Tejas. Now I think we are going to continue to provide access models, and in fact, are going to add more sort of lease to own financing as well. But as we have learned, some customers actually like to buy it outright. And for them, we want to offer more flexible pricing and reduce features when appropriate.\n\nSo we are going to actually bring down the sort of continuum of our pricing all the way to the launch of the benchtop device. But throughout the next 3 years, we will actually focus on total cost of ownership. So not just focusing on a platform itself, but what with the price of consumers going forward. And we have a pretty good model that we run through that creates net-net sort of positive value by doing that over the next 3 years.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nGot it. That's helpful. And then, in terms of your plan to launch this the low cost, beacon light, I think you mentioned 2025 there. How exactly would that be different from the lightning platform that you have on the market today?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nIt's going to be significantly reduced version of the beacon. Lightning and beacon are very different. And so not going into all the technical details, but there are some features about beacon that customers just absolutely love and have come to appreciate. Lightning was a good concept for an academic market, but the price point was still significantly high.\n\nAnd as we look at from a broader adoption of our technology in cell biology community, we believe that we can significantly reduce the cost structure and bring the applications that are specific to generating workflows, immuno oncology workflows, as well as lower cell biology level at the environment. So it's a totally different platform compared to what lightning was.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nGot it. And just a follow-up there. So is it fair to assume that the lightning is now essentially shelved? And then last one for me, just curious as to your thoughts on the cell therapy manufacturing system and timelines for that?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes. Great question. So on lightning, it is not shelled as much as we're going to use the lightning as a way to collaborate the academic community, so that we can see the next innovation platform is designed to fulfill all of their needs, and no more and no less. So we're going to use reduced versions of beacon as well as lightning to work with academic community in the next two years to inform our sort of full launch of that beacon light platform.\n\nOn the cell therapy manufacturing systems, we have decided that we will not do that alone, that we will actually find a commercial partner. As you know, it's an incredibly hot area with a lot of sort of regulatory expertise required. And an investment required that, frankly, Berkeley Lights alone should not do. And as such, we have very unique and differentiated things we bring to table.\n\nBut we don't bring the commercial capabilities on the table. So we are in active discussions with multiple players who are very interested in accessing our technology for the cell therapy manufacturing space.\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nGot it. Very helpful. Thank you.\n\nOperator\n\nYour next question comes from the line of Dan Arias with Stifel. Your line is open.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nThanks for the question. Virtually you mentioned that focus is on total cost of ownership. It sounds like you have your hands around the model there. I'm just curious what that model sort of spits out and suggests might be the break-even timeline for a customer where a lab can recoup the investment that's made?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nI think it depends on the customer's application. For some customers, then I think, they are actually already getting significant benefits from Berkeley Lights platform. And the ROI is paid up soon as they buy in, and as the workhorse beacon tool actually becomes live in their lab. In some customers case, depending on the application need, it may be a longer cycle and that's exactly what we are focusing on is to meet the customers where they are on their workflow needs.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nOK. Helpful. And then just maybe on the general strategy and going back to the prioritization exercises that you've undertaken, can you just maybe give us a sense of what isn't making the cut and maybe what you won't pursue just so we can draw a distinction between sort of the old scope of the business and the new scope of the business?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes. Good question. I think it's actually not that inconsistent, except for one very large team, which is that we are not pursuing growth for the sake of growth. We are absolutely focused on profitable growth, and becoming cash flow positive by 2025.\n\nSo it is not as such, which initiative is really which projects we would pursue and which projects we would not pursue. We are still going to be in a business of launching technology platforms as I described, in fact, more of them, but with an increased focus and doing them quickly enough to meet the customer's needs. And then second, on services and partnership side, we are not going to trying to be everything to every single potential customer. Even though we possibly could apply our tool to a large variety of applications, we're going to pick our battles for where we think is the highest potential return of our investment of working with our customers, where there's a very significant market demand.\n\nAnd I think the AAV vector workflow is a great example of that. We are working with several different customers on multiple applications. But we are finding that AAV vector workflow is so powerful, and such a large demand from a variety of participants in the market. CDMOs, CROs but also gene therapy target companies themselves, that we believe that that's a place where you'd like to dedicate more resources than reduce some resources from other projects.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nOK And If I could just squeeze the third one here in just on the executive hires and the C suite, what percentage of the key leadership positions do you have filled out at this point? And if there are some key roles that still need a person to be slotted in there? What's the outlook for getting that done?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nI think we are largely there, I would call it 80% mission accomplished.\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nOK. Very good. Appreciate that.\n\nOperator\n\nYour next question comes from the line of Brian Weinstein with William Blair. Please go ahead.\n\nBrian Weinstein -- William Blair -- Analyst\n\nHey, guys. Hey, guys. Good afternoon. Thanks for taking the question.\n\nMaybe you could talk a little bit about the reduction in force that you guys are implementing the 12%? I don't think I heard i and if you said that I apologize, but specifically where the workforce reductions are hitting the most in terms of the different pieces to the business? And then I have a couple other follow-ups for yesterday.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes, Brian. Thank you for the question. We basically optimize our business structure around the business and structures, the platform business and services business. And we went through highest value projects, and took reductions were needed.\n\nMost of this -- about 40 employees, most of these, actually from our North America-based businesses, but there are some global roles. We believe this structure is actually pretty consistent for the growth that we need. So I think it was the right thing to do. And again, going back to the principal of not pursuing growth in the sake of the growth, we are actually taking a very surgical approach to project by project and have been very critical into thinking about where are the resources needed going forward for the next two, three years?\n\nBrian Weinstein -- William Blair -- Analyst\n\nUnderstood. And then one kind of short-term question and one longer-term question. But on the short-term, if you're talking about 2022 being similar to '21, it implies the back half really has no growth. But you have announced some recent deals here.\n\nIs that simply just a reflection of kind of what you're saying now pursuing deals in the second half of the year that are kind of growth of any cost and being a little bit more cognizant of that? Or is that a reflection of the end markets being a little bit softer with funding concerns? I just curious about the flat year-over-year growth. You're talking about in the second half? And then if I can just ask the third question now, which is you talked about operating cash flow in early '25. And I think you said that that's kind of on $150 million run rate, which is 70% gross margin, of course, operating expenses of about $100 million run rate or so that's well below where you guys are today, even, I think taking into consideration some of the reduction in force. So I just want to better understand the operating expense structure.\n\nDo you think that you will need to kind of be at that breakeven in just sort of how you get there to dramatic difference, I think from where you're at today. So sorry for all the questions. Hopefully, they made sense.\n\nMehul Joshi -- Chief Financial Officer\n\nHi, Brian. This is Mehul Joshi talking here. So just on the updated guidance, so just wanted to mention again, that this guidance was determined by the new management team and the structure we put in place. But just generally we are experiencing some macroeconomic implications, just like the rest of our industry, tightening of budgets, prolonged sales cycles, etc.\n\nThat being said, our pipeline is still very strong. We expect acceleration of our tool sales in the second half of this fiscal year, somewhat driven by historical seasonality, but also supported by our third pillar in the strategy around commercial execution. Recurring revenue will continue to grow year on year as our install base grows, and demonstrates the value of our platform. And then finally, on the service business side, as Siddhartha mentioned, we are really focused on going after contracts and customers around those few areas that he talked about.\n\nBut also I'd like to mention that the R&D phase of several service projects have ended. And we are opportunistically shifting those resources to the viral vector development, and manufacturing as well as TCR discovery to support our strategic pillar, where we are prioritizing R&D investment. So this will create a bit of a slowdown in the second half of 2022 revenue for the partnership and services businesses.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes. And Brian, right, I think -- I've not taken the second question that you asked, which was about the opex structure. Our current opex structure includes stock-based compensation So if you exclude that, we -- you're right, you did the math correctly, we are ending up in $95 million to $100 million range. And as we did the realignment of the business, not only we have reduced the headcount, we've also significantly reduced our overall cost structure for next year as well.\n\nSo, for example, our cash burn in 2023 is expected around $30 million.\n\nBrian Weinstein -- William Blair -- Analyst\n\nOK. I appreciate all the clarifications and comments and all the detail around the new structure. Thanks, guys. It's very helpful.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from Julia Chen with J.P. Morgan. Please go ahead.\n\nJulia Chen -- J.P. Morgan -- Analyst\n\nHi. Good afternoon here. Just telling on the question on guidance, can you maybe give us more color on your confidence in hitting that full year guidance number? Considering that, there might be potential organizational disruptions, and considering the current customer capex budget environment that you mentioned. I know you alluded to commercial execution? Are you mainly referring to being more flexible on pricing? Or are there other additional efforts you're pursuing that support your confidence in that second half? Thanks.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nJulia, thank you. This is Siddhartha. Yes. Great question.\n\nLook, I think our guidance is inclusive of both the risk as well as upsides that are reflected in what we communicated to you. We feel pretty good about that guidance. Of course, there are significant changes that organize will continue to go through, as the new management team does its job implementing putting in place the process is to improve our commercial execution and which will include recruiting for new salespeople, making sure the regional management team is working well, and that people are using the sales tools efficiently that we are putting in place right now. Having said that, I think he feels pretty optimistic about the guidance and pretty strong about the number we are putting out there.\n\nJulia Chen -- J.P. Morgan -- Analyst\n\nThat's helpful. And one clarification on the new product pipeline. Can you help me understand what's the difference between the application specific model that you're launching next year versus beacon light?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes. I think the beacon light will also have application specific tools. One of the things we are implementing is to make sure that the customers are accessing, specifically the tool only for the application they're using. So making changes into our consumables and software.\n\nSo instrument box can work with the applications that customers were mainly interested in, which allows us to lower the cost of the tool, because that tool cannot be used for other applications and actually becomes more efficient tool for that application. And in other words, a tool will be used for cell line development will only be used for cell line development, and will not be able to be used for other applications. But it'll be more efficient for cell line development to use.\n\nJulia Chen -- J.P. Morgan -- Analyst\n\nGotcha. That's helpful. Last time for me, in terms of business development and M&A opportunities. Could you give us more color on what kind of opportunities or targets you're thinking of? And also, if you could touch on the out-licensing opportunities in either will get as well.\n\nThanks.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes. Thank you, Julia. Look, I think we are a team that actually have done this before right here. As you can see from the management team that we are bringing on board, we've all kind of been there done that in life sciences tools industry.\n\nLife sciences tools industry is actually built for continuing to expand both addressable markets by technology acquisitions. We will only pursue technology acquisitions when they are revenue accretive to us. And they actually make sense to our kind of status strategy of generating false positive operating cash flow by early 2025. And as you know, we are recently taken public company with a significant infrastructure that is very capable on SG&A and R&D platform, and anything that provides us with a leverage, we will continue to look at that.\n\nWe are very selective about that. You started the market evolve, we know where we want to place our bets. And frankly, given the market dislocations that the market is experiencing right now, we will see the next two years, there'll be significant opportunities for a strong leadership team to go and pursue inorganic growth. Coming back to your second question on partnership opportunities, the whole industry is kind of built, if you go back to 25, 30 years, there is so much cross licensing between different market participants here, Berkeley Lights has truly unique and differentiated platform.\n\nIt has been homegrown and only utilized by the team that is internal here. We've built a significant and formidable intellectual property position in the marketplace. And there's literally nothing else in the market that can be compared to Berkeley Lights, an ability to do things. Berkeley Lights cells move then with lights without testing them.\n\nAnd number two, keeping them alive. This is perhaps the least understood part of Berkeley Lights platform. We can keep ourselves alive, which means in all applications, you could study those cells after you've actually done some original biological functional asset on them. So the whole biologic community is asking two different types of questions.\n\nWhat is happening to different cells under disease condition, under different conditions? And why is it happening? The only technology that can allow us to do both is our technology because we keep ourselves alive throughout the process. So instead of doing all that ourselves, we would like to pursue opportunities to license our technology to others who may be stronger in other parts of that question of why, and partner with them. And at times, we might go and acquire the ability for us to answer the question why the cells are doing that. Hopefully, that explains to you more clearly what we mean by licensing.\n\nJulia Chen -- J.P. Morgan -- Analyst\n\nYes. They're helpful. Thanks for your time.\n\nOperator\n\nYour next question comes from the line of Steven Mah with Cowen. Please go ahead.\n\nSteven Mah -- Cowen and Company -- Analyst\n\nGreat. Thanks, operator. Thanks for taking the questions. And apologies if you guys said this already, but maybe I needed a little bit more color on the application specific instruments and the beacon light.\n\nIs that more for the CRO and CDMO channels? Or what specific channels are those for, individual labs or companies? Give us a little color on that.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes, Steven. Great question. Actually, CROs and CDMOs who are used to using beacon, the users of workhorse, and we are not actually going after that market with these tools. These tools are more specifically designed for small to medium size biopharma companies as well as sort of large academic medical centers.\n\nAnd a smaller, call it a smaller CROs and CDMOs which are emerging, not the large ones. And as you know they're both in application right now there is a significant amount of kind of money that has gone into emergence of a smaller player, which might have need for flexible budgets and that's where we are going with this application specific models.\n\nSteven Mah -- Cowen and Company -- Analyst\n\nOK. That's helpful. And then a follow-up question, talking about CROs and CDMOs. Can you talk about the trends you're seeing in terms of beacons into those channels? As you know, space or just cash conservation and capital expenditure budgets get squeezed?\n\nMehul Joshi -- Chief Financial Officer\n\nYes. Hi. This is Mehul. So we are still seeing a continued growth in the CRO, CDMO space relative to beacons, followed by pharma and then the academic market is also starting to pick up in terms of sales.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes. Just to give you a little bit more color all five of our placements were for new customers.\n\nSteven Mah -- Cowen and Company -- Analyst\n\nOK.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nAnd CROs and CDMOs, when they buy beacon, they are the highest users of our consumables. And I think one thing I wanted to point out which is sort of in the numbers, but our recurring revenue numbers are starting to grow very robustly. And the idea of creating a truly razor blade model from Berkeley Lights platform is becoming a reality as we look forward to the next two, three years of plan. And our entire plan is built on putting more beacons in place or whatever we want to call them, beacon lights, beacon select and beacon lights in place over the next few years.\n\nAnd -- but go after that recurring revenue stream, both from a warranty related services as well as consumers that come with that.\n\nSteven Mah -- Cowen and Company -- Analyst\n\nOK. Great. That's helpful. And if I get sneak one more in.\n\nAnd this was a follow-up on the reduction in force questions you already had. But I'm just wondering if the riff will potentially impact the cadence of signing of new R&D partnerships. And if, what should we expect as far as news flow and workflow releases from your existing partnerships? And will those be impacted by the risks?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes, Steven. Great question. On services and partnership model, I would think about the business not in terms of just the number of partners if signed, but the value we are bringing to the partner, and how deep we are going into capturing that workflow and serving our customers needs. So an example of AAV vector workflow, the value provided is tremendous.\n\nFrom what I understand the manufacturing capacity for gene therapies is significantly constrained by this one issue. And we -- at least in the early experiments we've proven now that we have a solution for that, a significant demand, but we can only serve so many people well. I think I've run services business before Steven and it is important to serve the current and existing customers really well, and not trying to over build for growth, because it doesn't build a sustainable business. So this doesn't only give you the exact answers that you will need for your models, but we are not focused on number of customers.\n\nWe are focused on growing that business robustly in a strong double digits for the next three years.\n\nSteven Mah -- Cowen and Company -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nYour next question comes from Mark Massaro with BTIG. Please go ahead.\n\nMark Massaro -- BTIG -- Analyst\n\nHey, guys. Thank you for the questions. I guess, Siddhartha, the revenue from -- the recurring revenue grew 50% year over year. That's the fastest rate of growth since Q1 of '21.\n\nSo I guess what I'm -- what my question is, is that a reasonable target to consider for the back half of the year? Do you think that could be a potential run rate recurring revenue growth, recognizing it is off of small numbers. But I guess what I'm trying to get at is we all have to lower our beacon estimates in terms of placements. So just help us figure out a way to sort of right size, the recurring revenue run rate with what the beacon placement run rate might look like going forward.\n\nMehul Joshi -- Chief Financial Officer\n\nHi, there. This is Mehul again. So I think, you kind of almost answered the question yourself. As we put more placements in, the recurring revenue growth rate will likely not stay at the 50%, but it will be in somewhere between the high 30s to 250.\n\nAnd it will fluctuate over time.\n\nMark Massaro -- BTIG -- Analyst\n\nOK. Maybe another question. To what extent are you committed to the current configuration of the beacon. There had been some industry concerns that at a $2 million price point that sort of boxes out a lot of potential users.\n\nSo, yes, so, multipart question. How committed to you are -- how committed are you to the beacon as currently configured? And then can you just provide a little more clarity around the three new configurations over the next three years? Should we expect one each year? And when should we expect the first configuration to be deployed commercially?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes. Fantastic question, Mark. We are already doing a pilot in Q4 for one instrument right now. It's already been through the development cycle, pretty strong demand for cell line development application for that.\n\nWe launch that commercially in 2023, most likely in the first half of 2023. In 2024, we will launch another unit, that will be at even further reduced features that will be more specific to applications required by generating workflow and immuno-oncology applications. And then finally, that will culminate into our innovation work that is going on and significantly taking the cost out of the beacon platform. Remember, beacon platform was actually launched five, six years ago, and all the supply chain and all the technology used in it were eight years ago, OK.\n\nThe technology team has, for the last six, seven years, have continued to experiment with bringing the same technology, not all the features, but most of them that are used by customers at a reduced cost. So we've got a lot of in-house work that has gone on into taking the cost out of what we call the beacon, which is why the beacon light is the phrase we are using for beacon that is going to be launched in 2025. But we have significant headroom on taking the cost out there.\n\nMark Massaro -- BTIG -- Analyst\n\nOK. I also want to ask about the -- go ahead.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nBut just to make sure that I answer your question about how committed we are to Beacon, we are absolutely committed to supporting customers who are actually interested in buying full beacon platform. But we are also aware of the fact that $2 million price point is not the right price point for everybody, which is why we are launching new versions with introduced features in '23 and '24, as we make the bridge to the '25 with a much larger adoption by a very wide range of cell biology laboratories.\n\nMark Massaro -- BTIG -- Analyst\n\nOK. Is there a point in time where or maybe that point in time to be now, can you give us a sense for -- so if $2 million might be a little out of reach for some, how are you thinking about the different pricing configurations? I mean, presumably some maybe below a $1 million, but can you give us a sense for what you think the sort of the appetite is, in terms of the capital expenditure for the system?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes. It's a great question. What I'd like to do is to address this at the later Investor Day. What I will give you a little bit of a hint on is that it is not just a placement and the pricing of the instrument, it will also be what will be the cost of consumables, when a cost to own and access technology is reduced.\n\nWe will modify the cost of consumption along with that. And we have a pretty strong model that shows that actually right from the get go if we do it right, in the ninth month, after the platform is acquired. It becomes a cash flow positive event products.\n\nMark Massaro -- BTIG -- Analyst\n\nOK. I also wanted to ask about recognizing that you're both new in terms of having an operational role at the company. But just going back to the original guidance for the year, it was 30% growth. Now you're guiding roughly flat.\n\nIt's a $26 million delta. So like, in simple terms, that could be as little as 13 system placements, right. But maybe it's not that simple. So maybe can you help us, maybe better understand what the delta is between the current guidance and what it was at the beginning of this year? And what the factors are?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nI think we all went through it again. But we can go through that again in for the sake of clarity. It really is one, I think the most important backdrop that you would appreciate is that, as I -- I was asked about a guidance and a forecast when I first started, which was my day number 30. And I was evaluating what the current progress is.\n\nA lot has changed in the macroeconomic environment, and the capital cycles in Life Sciences tools industry of London, there are significant challenges being faced by not just us, but many companies. So large part of it is that. Another part of it is applying our judgment and, frankly, not pursuing growth for the sake of growth. And I can tell you that, we are in a much better shape to have profitable growth we believe that we will be turning the page as we move into 2023 with a significant growth ahead of us.\n\nMark Massaro -- BTIG -- Analyst\n\nOK. If I can ask one more, and then I'll stop, I promise. The -- you've had some time to assess the business and the end markets, of course. The initial total addressable market from the management team, I think, was somewhere in the $23 billion to $25 billion range, primarily driven by cell therapy at $15 billion, $6 billion for antibody therapeutics, viral vectors and SynBio $2 billion each.\n\nDo you still agree with the size of the market? And maybe just comment about anything that you think may be different from how you see the opportunity now in end markets versus how this was sort of presented to investors back at the IPO?\n\nSiddhartha Kadia -- Chief Executive Officer\n\nYes. Good question. Right now we are in the middle of a pretty significant customer research project. When we are ready to have an Investor Day, we will actually debrief you with a full estimate of our sort of what is the current addressable market, as we study it in full depth? My instincts tell me right now, based on the early data, that it will be smaller than what was estimated at the time of the IPO.\n\nBut it is still in the billions of dollars.\n\nMark Massaro -- BTIG -- Analyst\n\nOK. Thanks for all the questions.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Gaurav Goparaju with Berenberg Capital Markets. Please go ahead.\n\nGaurav Goparaju -- Berenberg Capital Markets -- Analyst\n\nYes. Hey, guys. Thanks. Just two for me.\n\nI'll run by you, guys. So should we expect pretty consistent or at least similar direct platform sales segment revenues to continue to, I guess, remain at that de-escalation growth that they're at right now? It seems like it's kind of hovering around, 36% to 40% at that current rate relatively in the near term? Or do you think this is something that we should expect to kind of have a turnaround on relatively quickly?\n\nMehul Joshi -- Chief Financial Officer\n\nHi, Gaurav. This is Mehul. So I think we're, our guidance was relative to 2022. We haven't really provided any guidance around 2023.\n\nBut as I mentioned, in the 2022 guidance, we do expect acceleration of the tool sales in the second half of the year, relative to the first half of the year. And again, some of it is cyclical, but it's also supported by some of the commercial execution, things that will occur around the platform as well as pricing that Siddhartha kind of talked through. So we do expect acceleration in the second half of this fiscal year. And as I mentioned, we should see a little bit of a slowdown on the subscription, or the platform and services businesses, as some of the contracts, the R&D contracts have had now ended.\n\nAnd we are refocusing our resources on the higher value areas that again, Siddhartha talked about.\n\nGaurav Goparaju -- Berenberg Capital Markets -- Analyst\n\nGot it. That was helpful. And then just one more for me, before I let you guys go, more of a general question, how do you guys look to, looking at the public view of the company, right? How do you like the correct messaging of the company to the market? The reason I ask is the general public perception of the company in the market given, in the last 12 months or so isn't the most favorable, so any color on initiatives that sense on communicating this strategic focus on bigger scale would be helpful.\n\nSiddhartha Kadia -- Chief Executive Officer\n\nThat's -- Gaurav, that's a fantastic question. I'll tell you, I've been in life science industry for 20 years. I was also new in the context of all of that, that is going on with the company and the perception. My first task was to understand the value and the power of this technology.\n\nI was sitting on a board for two quarters before that I can tell you by being in the company, I am super excited about the power of the technology. I think it's forgotten perhaps in the all the publicity event that this technology was already used in the most important public health crisis of our time, which is to discover the first COVID antibody. And then since I've been here, I've seen amazing impact on the things that technology can do, and allowing scientific breakthroughs to happen through the use of Berkeley Lights technology. I'm also incredibly encouraged by passion of our employees.\n\nWe are a small company, everybody here is here because they have a purpose. They want to change the world and have an impact. And then finally, I think what was missing from the company and this is well, only time will tell everybody, the leadership team coming here is experience, knows what we are doing. And we are putting in place what was missing in the company, which is a commercial acumen and fiscal discipline.\n\nBut as I say, only time will actually change the narrative as you know.\n\nGaurav Goparaju -- Berenberg Capital Markets -- Analyst\n\nNo, of course. Thanks for the response. It's great to hear.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSuzanne Hatcher -- Vice President, Communications and Investor Relations\n\nSiddhartha Kadia -- Chief Executive Officer\n\nMehul Joshi -- Chief Financial Officer\n\nTejas Savant -- Morgan Stanley -- Analyst\n\nDan Arias -- Stifel Financial Corp. -- Analyst\n\nBrian Weinstein -- William Blair -- Analyst\n\nJulia Chen -- J.P. Morgan -- Analyst\n\nSteven Mah -- Cowen and Company -- Analyst\n\nMark Massaro -- BTIG -- Analyst\n\nGaurav Goparaju -- Berenberg Capital Markets -- Analyst\n\nMore BLI analysis\n\nAll earnings call transcripts"
}