{
  "companyName": "Blink Charging Co",
  "companyTicker": "BLNK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/blink-charging-co-blnk-q3-2022-earnings-call-trans/",
  "content": "Blink Charging Co (BLNK 7.66%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Blink Charging's third quarter 2022 earnings conference call. [Operator instructions] Please note this conference is being recorded. A replay of this call will be available on the Investor Relations page of the company's website. At this time, I'd like to turn the presentation over to Vitalie Stelea, vice president of investor relations.\n\nPlease go ahead.\n\nVitalie Stelea -- Vice President, Investor Relations\n\nThank you, Charlie. And welcome everyone to Blink's third quarter 2022 earnings call. On this call today, we have Michael D. Farkas, chairman and chief executive officer; Brendan Jones, president; and Michael Rama, chief financial officer.\n\nToday's discussions will include non-GAAP references. These are reconciled to the most comparable U.S. GAAP measures in the appendix of our earnings deck. You can find the deck along with the rest of our earnings materials and other important content on Blink's Investor Relations website.\n\nToday's discussion may also include forward-looking statements about our expectations. Actual results may differ from those stated. The most significant factors that could cause actual results to differ are included on page two of the third quarter earnings deck. Unless otherwise noted, all comparisons are year over year.\n\nNow regarding the Investor Relations calendar, Blink will be hosting investors at the upcoming Consumer Electronic Show, CES, between the fifth of January and the eighth of January of 2023 in Las Vegas. In addition, Blink management will be participating in the Annual Needham Growth Conference in January of 2023. I will now turn the call over to Michael D. Farkas, founder and CEO of Blink Charging.\n\nGo ahead, Michael.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nGood afternoon, everyone. Thank you for joining us. As you can see, we delivered an extremely strong third quarter of 2022 highlighted by record revenue of $17.2 million, an increase of 169% over the third quarter of 2021. During the third quarter, our product sales grew by 177%, an increase of $10.8 million compared to Q3 of 2021.\n\nService revenue grew by 123%. Within service revenue, Blink's network fees grew by over 600%. I repeat, over 600%. And this is our recurring revenue model with very, very strong gross margins.\n\nA record third quarter results are reflective of our strong fundamentals driven by organic and strategic opportunities. In the third quarter we contracted, sold or deployed 7,834 commercial and residential chargers, an increase of 160% compared to the same quarter of last year. Most of our competitors don't even have that many units on their entire network, let alone deployed last Q. Our success in part is rooted in our ability to fulfill customer orders relatively quickly.\n\nOur goal is to establish Blink as a reliable provider of choice, able to comply with our customers tight deadlines, even a world still impacted by supply chain issues. To that end in Q3, we strategically substantially increased the investment in our inventory levels to ensure that we had the components, equipment, and products on hand to meet current and future customer and market demand. Subsequent to the end of the quarter, we had two major announcements. On October 11, we announced our own new Blink Network and Blink Charging mobile apps.\n\nCompletely redesigned from the ground up. It's there to power our next generation best-in-class, EV charging experience. More on that later. As on October 18th, in conjunction with the Secretary of Labor's visit to Blink headquarters, we announced our current plans to increase Blink's U.S.\n\nmanufacturing capabilities to up to 100,000 charges per year. Just for the U.S. We are very excited about these announcements as these are important building blocks in our future success here in the United States and globally. Turning to Slide 5.\n\nBlink has sold, deployed or installed nearly 59,000 chargers since the inception of the company. We have over 440,000 active users on Blinks networks, a number that has been consistently growing. Blink today has global manufacturing capabilities in the U.S., India, and Taiwan. And most importantly, our advanced hardware and our networks are compatible with the standards adopted by the majority of countries around the globe.\n\nA recent study from McKinsey published in April of this year, shows that the United States alone could have 48 million EVs on the road by 2030. And globally, Bloomberg New Energy Finance recently pointed to the need for between 340 million and 490 million chargers by 2040. Remember, the entire global market today has a few million viable charges deployed at best and almost 500 million units are estimated to be needed. We view this as a massive growth trend in the marketplace and a tremendous opportunity for Blink.\n\nTurning to Slide 6, please. At Blink, we are dedicated to providing the best in EV charging. And we're proud of the new completely redesigned Blink network and Blink charging mobile apps. Our state-of-the-art infrastructure tech stack and user-centric approach allowed us to create a technology platform that can be augmented quickly and efficiently without disrupting our customers.\n\nThe mobile apps put EV drivers in control by giving them improved search capabilities for nearby amenities and chargers by zip code, city, business, category or address, and it seamlessly integrates EV charging into everyday life. Drivers can save favorite charging locations and manage payment information as well as view payment history and real-time charging status. I encourage everyone on this call to experience the new Blink charging apps and network for yourselves. And that's by downloading it at the iOS App Store or the Google Android App Store.\n\nOn Slide 7 when it comes to whose benefits. The entire experience has been redesigned with ease of use in mind. The new cloud-based Blink network allows site hosts to manage their EV charging business in multiple languages that include English, French, Greek, Hebrew, and Spanish across 25 countries, with additional languages to be added. Site hosts will also have expanded functionality in creating dynamic pricing protocols, responsive to various use cases, locations, and schedules.\n\nOur new infrastructure will allow for the faster integration of our recent acquisitions, which we'll outline in our next slide. Our legacy businesses currently operate on four separate networks in the near future, all of our charges globally will operate on one network. Four networks consolidated to one should translate into major savings and technological innovations. Turning to Slide 8.\n\nA recap of our recent acquisitions. In June of 2022, we completed the acquisition of Semi Connect, significantly expanding our charging networks in the United States. This provides vertical integration and manufacturing capabilities in the U.S. and globally, and allows Blink to comply with by American mandates.\n\nIn April of 2022, we acquired the U.K.-based Electric Blue, giving us access to the U.K., and Ireland's fast-growing markets and adding nearly 1200 chargers to our global footprint. So overall, as you can see, in Q3, we continue to position Blink for significant current and future growth. Our equipment, our new and updated networks, and apps will serve as the foundations to launch new services and functionality in the future. With that, I'll turn the call over to Brendan Jones, President of Blink to discuss some of our recent developments.\n\nBrendan Jones -- President\n\nThank you, Michael. And good afternoon, everyone. We now go to Slide 10. Within the last 12 months, Blink has contracted sold, deployed, or acquired over 30,000 charges both domestically and internationally, bringing the total charger account for the company to over 58,000 chargers since Blink's inception.\n\nWe have a diverse mix of deployments in the United States and abroad, with 74% of the total companywide chargers deployed in North America and 26% deployed internationally. If you now flip to Slide 11. This is a partial list of our customers. But as you can see from the logos and verticals, we operate in this speaks to the breadth and depth of our products and services.\n\nWe've won numerous multi-year contracts with a variety of well-respected commercial enterprises, healthcare facilities, multifamily complexes, planned communities, fleets, and missing municipalities. We are especially seeing strong demand from fleet customers. In fact, we were selected as a preferred provider by one of the world's largest delivery service companies which we are very very excited about. Overall, customers choose Blink because of our flexible business model and superior products.\n\nWe are the only fully integrated charging provider in the U.S. market. Now if we go on to Slide 12, we had a great visit from U.S. Secretary of Labor, Marty Walsh, and we subsequently announced that we are planning to expand our U.S.\n\nmanufacturing footprint by adding another facility to produce chargers. This new facility is targeting about 10,000 DC fast chargers and approximately 20 to 40,000 L2 chargers per year. Our current target, which includes the approximately 40,000-unit expansion at our Bowie, Maryland facility allows Blink's annual U.S. charger production capacity to increase to up to 100,000 units.\n\nIn fact, we've already visited four different potential locations and held discussions with the local municipalities there, and we shared and discussed our plans. In the meantime, as Michael mentioned earlier, our team has focused on securing additional inventory in order to keep up with demand. Earlier this year, it became abundantly clear to us that the supply chain constraints would persist, we decided to proactively increase inventory to ensure we could meet our customers needs and demands. On Slide 13, it details what we believe are industry-leading software and manufacturing capabilities, we leverage our manufacturing engineering competencies to meet all EV charging needs.\n\nA unique advantage in our competitive landscape the Blink has. Our approach has multiple benefits. One, it allows us to test and identify hardware and software capability early in the design process. And two, it gives us significantly more control over the supply chain inputs and manufacturing planning and our facilities in the U.S.\n\nand globally. Now if we move to Slide 14, you can see examples of our innovative product portfolio. This includes our network HQ 200 charger, which provides up to 50 amps of Level 2 charging for homeowners. This charger is already on sale with more information to be released within the coming weeks.\n\nThe network MQ design are growing commercial and fleet applications. And the series eight charger is one of the only fully integrated chargers with credit card capabilities that complies with the credit card swipe requirements in the state of California. Notably, this is not a bolt-on solution but a fully integrated charger that we specifically designed with this functionality in mind. Next, you can see the picture of our vision IQ 200 charger with a new design to take advantage of advertising opportunities in urban and retail locations.\n\nAnd the Blink EQs series is an intelligent, affordable and scalable charging solution that fit any location is compact design and it supports technologies like OCP 2.0, bidirectional charging and VTG. The EQ 200 will be used in our European and Israeli markets. On Slide 15, you can see our current DC fast charger offerings. What is notable here is that we have products to satisfy many applications in North America, Europe, South America and even Asia markets.\n\nThese ranges anywhere from a 30-kilowatt wall-mounted charger to a 350-kilowatt stationary charger. And that's not it. We are working diligently to introduce a more advanced DC charger, to satisfy the expanding DC fast charging landscape. You can see that we have a wide ranging portfolio of charging solutions to fit the needs of any customer, public or private, small or large with the ability to penetrate numerous end markets.\n\nAlso before I conclude, on Slide 16, I'd like to just touch on our progress with the integration and synergies of our recent acquisitions of Blue Corner, Electric Blue, and SemaConnect. All are going according to plan. On the revenue side. This is something that we addressed in the early days after the acquisition.\n\nFor example, both Blink and SemaConnect sales teams starting working together on lead generation, complementing each other's efforts and product offerings. In addition, we've been working diligently on converting some SemaConnects largest customers to the owner operator model. Among them are large property management companies as well as large multifamily apartment owners. One example that comes to mind is Crow Holdings.\n\nCrow is a leading real estate investment firm with over 20 billion in assets under management. We just secured our second order of chargers for a property in Denver under the owner-operated model. Customers appreciate this flexibility in our offerings as they chose to deploy critical capital and allow Blink to own and operate the chargers at their location. Additionally, on the cost side of the equation, we are also on track.\n\nWe have completed a comprehensive study and are in the implementation phase now. Our management team is conscientious about controlling costs, and maximizing synergies. We are hiring very strategically, as we are implementing G&A efficiencies and optimizing our sales and customer service functions. The newly launched network and mobile application will be a tremendous component of our integration process.\n\nAs we bring latency acquisition charge charges onto the new network, and tech infrastructure, thus reducing our overall IP and support costs spend. All in all, we are very, very proud with the performance in the third quarter. Our pent-up fundamentals are strong as we delivered record, and I say that again record results in Q3, even without realizing the full benefits and synergies from our recent acquisitions. We are positioning Blink for current and future growth, driven by the fast adoption of electric vehicles and favorable regulatory environments.\n\nThis includes the administration $7.5 billion infrastructure plan and the inflation Reduction Act in the U.S. and numerous governed programs in Europe and elsewhere. We're very, very, very excited to what's next for Blink. I will now turn it over to our CFO, Michael Rama to run through some of the specific financial results for the quarter.\n\nGo ahead, Michael.\n\nMichael Rama -- Chief Financial Officer\n\nThank you, Brendan. And good afternoon, everyone. Turning to Slide 18, total revenue in the third quarter of 2022 grew to $17.2 million, another record for the company and an increase of $10.8 million, or 169% compared to the third quarter of 2021. The solid performance in the quarter was driven by organic growth, underlying by the strong fundamentals in our business and the results from acquisitions of Electric Blue and SemaConnect.\n\nYear to date through September 30th, 2022 our total revenues were $38.5 million, compared to $13 million for the first nine months of 2021. With an increase of $25.5 million, we have nearly tripled our revenue for the first three quarters when compared with the same period in 2021. Product sales in the third quarter of 2022 were $13.4 million, an increase of $8.5 million, or 177% over the same period in 2021, as customers purchase greater volumes of our commercial, DC, fast chargers, and residential chargers. Third quarter 2022 service revenues which consists of charging service revenues, network fees, and ride-sharing revenues were $3.1 million, an increase of 123% compared to the third quarter of 2023.\n\nThe year-over-year growth is primarily due to the increased utilization of our chargers, and an increased number of chargers on Blink networks. We combined these three service revenue line items into one amount to differentiate between the product and service aspects of our business. And this approach also aligned with our company's strategic goal of increasing the service component of our revenue mix and growing our recurring revenue base. In time as EV adoption accelerates and utilization of our charging stations improves, we anticipate seeing a larger mix of revenues come from services.\n\nGross profit for the third quarter of 2022 was approximately $4.8 million, or 28% of revenue. This compares to about $900,000 or 14% of revenue in the third quarter of 2021. As you can see our gross profit doubled year over year as a percentage of revenues primarily driven by stronger performance in product sales, service revenues, and improved performance in ridesharing and warranty. As we expand our in-house production capacity, we expect continued improvements in our gross profit.\n\nOperating expenses in the third quarter of 2022 were $29.3 million, compared to $16.7 million in the prior-year period. This increase is primarily due to higher expenses in the areas of accounting, legal marketing, Investor Relations, and consulting. Also included in the operating expenses for the third quarter of 2022 increased amortization of intangible assets associated with the acquisitions of semiconductor and EB. This is an expense that will continue but is non-cash in nature.\n\nFurthermore, the increase in operating expenses includes operating expenses from both SemaConnect and EB that were not included in the results with third quarter of 2021. Adjusted EBITDA for the third quarter of 2022 was a loss of $17.6 million, compared to a loss of $8.4 million in the prior-year period due to the previously mentioned higher operating expenses. Adjusted EBITDA as a percentage of revenues for the third quarter and for the first nine months of 2022 both improved by about one-third when compared to the same periods in 2021. This performance was achieved without the impact of synergies that we expect to realize going forward.\n\nAdjusted earnings per share for the third quarter of 2022 was a loss of $0.47, compared to a loss of $0.36 in the prior-year period. Non-GAAP adjusted EPS is defined as adjusted net income, which excludes significant non-cash items such as amortization of intangible assets, and non-recurring expenses such as acquisition related expenses divided by the number of shares outstanding. Now turning to Slide 19, our revenues and gross profit performed very well in the third quarter of 2020. Continuing the upward trend that we've seen over the past several quarters now.\n\nIn part boosted by results from recent acquisitions. As we execute on our flexible solutions of owner-operator strategy, sell hardware or facilitate the installation of charters and continue to further vertically integrate the key components, such as hardware design and manufacturing. We believe that we are well-positioned to continue to capture market share and drive revenue growth. I have to say that in today's inflationary environment, customers appreciate our flexible business model as customers themselves can decide on how to deploy their capital.\n\nMoving to our cash position, at September 30th, 2022, the company had approximately $57 million of cash. It is notable here that we have been proactive in increasing our inventory levels in the third quarter by nearly $7 million sequentially. To ensure proper levels of product on hand to mitigate supply chain risk and to support a rapid growth and demand. We are very pleased with the results for the third quarter.\n\nNot only did we achieve record revenues, we also showed significant improvements in our operating results. These are testament to our flexible operating model and the strong demand for products that satisfy a wide variety of customers, from homeowners, residents in multifamily units to sophisticated fortune 50 fleet customers. As we continue to integrate the recent acquisitions and leverage the operating efficiencies to drive continued growth. I will now turn the call back over to Michael Farkas for a few final comments.\n\nGo ahead, Michael.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nThe third quarter of 2022 was another monumental quarter for Blink. We achieved significant year-over-year top-line growth driven by organic and strategic opportunities. We launch our newly completely redesigned network and apps. And we announced plans to increase manufacturing in the United States.\n\nBlink is unique in our industry. Because we are the only fully vertically integrated EV charging provider in the U.S. Well, our competitors typically offer products or charging services, blink designs, manufacturers, owns the network that operates our chargers, deploys the hardware, and we also own a substantial amount of our equipment in the field. In addition, we offer a modern tech stack and we provide business models that best serve our customers.\n\nWe have a hardware solution for every type of location, whether single and multifamily residential, fleet and workplace, retail, commercial, and even high traffic travel corridors. And with multiple deployment methodologies to get those chargers out there, giving us unparalleled optionality to property owners that none of our competitors can match. For example, if a property owner simply wants to buy equipment, we'll certainly do that. However, we prefer the value-added structure provided by our owner-operator model, creating a substantial long-term exclusive recurring revenue model for Blink.\n\nBefore I conclude, there's one last thing I'd like to share with you. As Blink has done with level two chargers in the past, Blink in the combined CEMA are going to do with DC fast chargers in the future. I'm very proud to show you the current design of our new DC supercharger that is under development. In addition to having superior aesthetics, this will be our best-in-class type charger, compatible with the highest voltage vehicle architectures like the 800-volt architecture you see in some of the most advanced EVs being released.\n\nPricing and availability will be off the charts. We can't wait to tell you more about it in the future. With that, we will now open the call for questions.\n\nOperator\n\n[Operator instructions] Your first question is coming from Stephen Gengaro with Stifel. Please pose your question. Your line is live.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nThank you, and good afternoon, everybody. I think there's two things for me. The first would be around the product margins you delivered, I think about 35% product margins, they were up 700 800 points sequentially. When we think about the product side of business, and obviously you've integrated here, the SemaConnect business.\n\nHow should we think about the progress in those margins going forward? Was there any anomalies here? Or is this a trend that we should see improvement? I understand your supply chain issues, inflation, etc. But how should we think about those margins going forward?\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nVery simply, we're going from a path of us having third parties manufacture equipment for us to doing it internally. So it's going to be very impactful to the Blink business moving forward.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nAnd when we think about the --\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nAnd by the way, I just want to be very clear that that's not happening overnight. As you mentioned, there are issues with the supply chain. So we're looking to get equipment from all of our different vendors today. But the ultimate goal is for us to produce our own goods.\n\nAnd that brings us up a couple notches when it comes to having to procure equipment and components and so on and will ultimately to, we believe higher margins in the future.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you. And the other one and I've asked you this before and I'm trying to get a sense when we think about the services revenue line. And attraction and understanding the adoption a big driver of care.\n\nBut how should we think about the number of units that are driving that business? Because like, as we as it evolves here, I would imagine those margins get better and the utilization goes up. But, we always think about sort of the whether the numbers are going up, because you're getting more throughput at your existing installed base, or just simply a function of installed base going up.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nIt's actually a combination of both what we're seeing higher utilization at our current chargers, and we're getting more obviously, a lot more chargers out in the field.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nAnd any guidance on how to sort of model that going forward? I mean, it's obviously a high margin business we're trying to -- so I'm trying to get a sense for how to think about that number.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nMichael, do you want to maybe give color?\n\nYes, little more color. We're expecting as EV penetration continues to expand where we expect that number or services not only its charging revenues, but also network connectivity. So as well as some of the ancillary services. So as more units are connected more online, more connected to networks, and are and as well as more EB adoption and penetration and service revenue, utilization increases, we expect that to continue to increase and go higher.\n\nThat's our, as we've always said, that's kind of our sweet spot operator and really, generating revenues, high gross profit, and revenues from the service side of the business.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nOK. Great. Thank you for the details.\n\nOperator\n\nYour next question is coming from Matt Somerville with D.A. Davidson. Please pose your question. Your line is live.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nThanks. A couple of questions. First, just with respect to capacity, can you remind us what your current in-house capability is between Maryland, India and I think you mentioned Taiwan, and how this new capacity comes online. Will it be in waves will it be all at once and just remind around the timing of it? And then what the ultimate, run rate is and how quickly you think you can be actually producing add capacity, and then I have a follow-up.\n\nBrendan Jones -- President\n\nOK. So let's start first with U.S. base capacity and what it looks like today. So right now we're between 10,000 and 11,000 units out of the Bowie facility.\n\nAnd that's the current state. As we mentioned during the acquisition, the plan is to increase that to upwards of 50,000. Those plans are in the first phase of that plan is increasing the ships from what they are now at a standard one ship to up to two ships, and then moving to three ships to up the capacity there. The subset of that plan is a little bit more squished that is added to that facility to get us up to that 50 mark.\n\nWhen you think about the relationship between Bowie and then India, India becomes the parts manufacturer of all the components that are needed. And all those components, are subsystems put together, and Bowie, the finished product is shifted out from there. So that's how we get to the 50,000. Those plans are, as I said, in play.\n\nThe second or Phase 2 of the big master plan is to acquire some additional land within the United States, then, once we acquire that land, go ahead and build or buy a parcel with the building on it. And then in that facility will begin to construct the DC fast chargers and add additional L2 capacity to meet the expected market demand, as Michael outlined in his original comments. Now light on in parallel, everything is not going to happen in one. So we have to maintain our global manufacturing presence through third-party contract suppliers, such as light on and are certain third-party partners in Europe simultaneously.\n\nSo there's a high level on all that, let me know if you need any clarity as we move forward.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nNo. That's helpful. Thank you, Brendon. And then just kind of a housekeeping item, relative to the $17.2 million in revenue that you guys generated this quarter.\n\nMichael, can you disclose what the acquisitive contribution was? So we can kind of get to an organic growth number for Blink? Thank you.\n\nMichael Rama -- Chief Financial Officer\n\nYes. I'll provide you know, we, between Sema and EB for the quarter, it generated about $6.5 million in revenues. So it was a big contribution. And it was -- so but we still had good organic growth as well for the quarter.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nGreat. Thank you, guys.\n\nOperator\n\nYour next question is coming from Chris Souther with B. Riley. Please pose your question. Your line is live.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nGuys, thanks for taking my questions here. Maybe just a bit more on personnel, some of the acquisition. Are any of the services revenue coming from either EB charging or semiconductors that mostly in the product side?\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nWe're getting both we're getting service as well as product with their network fees as well as the charging revenues from EB is also as an owner-operator model that also produces charging revenues as well.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nOK. So the charging, services revenue that's coming from company-owned stations and networks could be --\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nNetwork and all that. Yeah.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nYes. OK. So you're getting network from them as well, and potentially networks from ones that you don't own as well would be kind of a way to kind of parse it out?\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nThat's great.\n\nMichael Rama -- Chief Financial Officer\n\nThe other one, we didn't mention there, but it's in there is the service contract revenue, you get on non Blink owned equipment, that applies to all the all the different iterations. So if it's networking services and service contract revenue,\n\nChris Souther -- B. Riley Financial -- Analyst\n\nOK. That makes sense. Can you provide maybe an update on the size of the Blink owned station kind of footprint in any kind of rev ballpark of where utilization is today? If it's bigger, you're discussing kind of improvements that we're seeing lately.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nMichael?\n\nMichael Rama -- Chief Financial Officer\n\nYes. We're seeing network more we have, as we mentioned in our comments there's four networks, now, there's close to 44,000 units on all combined networks between Blink, SemaConnect and all the networks that we have for the various companies that we've acquired. And the utilization. We continue to see increases in the utilization, there's more EV penetration.\n\nStill similar to how the adoption of the EV. It is penetrating from an EV vehicle standpoint, but also, we're seeing even higher utilizations in Europe still. So always trending -- like I said, its trending in the positive direction. And we're encouraged, what third quarter produced?\n\nChris Souther -- B. Riley Financial -- Analyst\n\nOK. Maybe just the last one. I think last call, you talked about working with some consultants around synergies with Sema, I just want to see if you know, any update on kind of quantifying the costs out, you think you can get there and timelines around kind of the roadmap of the combined, which I think was kind of part two of that engagement.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nYes. So I'll pick up that, that part. So, in terms of realizing synergies, we're at the -- we're on the sales side of it, we're already actively involved in combining the organization's together, that activity is already happening. As we outlined in the call, we're already exposing both businesses and sales teams, which now becoming one sales team with a multiple group of products, we've already started the cross population of them selling separate team selling the Blink owner-operator model.\n\nAnd that is where we're really thinking long term revenue streams. Because as you are aware, the model that we put together as a learning model, so it keeps refreshing itself and getting more data on where the most optimum sites are, for the owner-operator model, we're able to cross apply that data and look at the semi-connect portfolio and find those sites where the return on investment is going to be quite good over time. And we've already started to capture business, as we outlined as a result of that. So sales synergies moving on operational synergies are moving forward right now.\n\nWe have a dedicated team after initial analysis reports, finding all those operations as they relate to support call center, network operations, center service, and maintenance. All those are underway and will realize the true benefit synergies of them as we move into 2023.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nAppreciate all the color there. I'll hop in queue. Thanks.\n\nOperator\n\nYour last question is coming from Sameer Joshi with H.C. Wainwright. Please pose your question. Your line is live.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nYes. Good afternoon. Thanks for taking my questions. So just a couple of questions on the actual results.\n\nThe network fees are substantially higher. Was this mainly because of the acquisition? Or was there some organic growth in the network fees as well?\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nSo yes. It was actually both the same account connect acquisition but also their organic growth that's driving the network activity and the expansion of our more chargers and more adoption into the networks.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nYes. And then, between the -- in the operating expenses, we feel compensation and general administrative costs, sort of, like swap, the compensation went up, and the general and GNA costs went down during the quarter sequentially. Is there something that you want to point out there? What's going on?\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nYes. Yes. In the comp, they're included in compensation expense is share-based compensation. So sequentially, we had higher share base comp that got accounted for in the third quarter, because of grants and equity that was granted during I think we've in the second quarter, but it's certain achievements were accomplished in those programs.\n\nSo a majority of that is going to be the share base comp that went up non-cash, if you will. And it is always good to see that the G&A it's -- so we're working on that we're working hard. So we're working on the G&A where we're trying to, you know, we're working to integrate and see where we could be more scalable and that's we're starting to see some of those reflected early on.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nUnderstood. So we can see some operating leverage not just by increased its revenues, but also by reduced costs.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nThat's the expectation, yes. As we move forward the opex as a percentage of revenues is expected to increase just as we expand and penetrate and really integrate. And this the acquisition into Blink.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nGot it. And then just stepping back the 7.5 billion 5 billion of which is coming to the States. What kind of visibility do you have on individual state programs and how they are implementing it or planning to implement it? If you have any insight that we may not know about? That would be great.\n\nYes. So, all states now had been approved under the federal program. So the other plans they submitted, are approved. Now it's back to the state to move forward with their implementation program.\n\nNo state has moved forward with RFP yet most are in the very beginning stages of RFI. So it is what they're going to -- how they're going to define for the players that are active in the state, are going through that analysis. And then individually, they're adjusting and being additive into the in every scorecard on what they want for their state. No state can reduce the requirements as outlined by NaVi or the scorecard.\n\nWe are in conversations with a multiplicity of states. As they're asking pulmonary inflammation, we're meeting with as many states as possible to discuss the Blink and bleak capabilities under Navi. And we continue making progress on that. But as of yet, we're not seeing anything being issued yet.\n\nAnd we'll see how aggressive it is in Q1 of next year. We're anticipating the bulk of NAVi to be played out as you get into Q3, and then into Q4, and then indeed in 2024 as well. And as you know the program is deemed to stretch further out. And the funding is available further out.\n\nSo we'll we're being aggressive keeping up to speed working with the states. And we'll continue to do so months and quarters that follow.\n\nYes. That's good to know. Thanks for that insight. And glad that you are at the forefront.\n\nJust one last question about this new supercharger design. Will it be ready for CES at least in a conceptual form or something?\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nMost likely not.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nOK.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nSorry. Go ahead.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nI think most likely not. But we may surprise you.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nOK. This is -- congrats on all the progress over the last three quarters.\n\nOperator\n\nYou have a follow-up question coming from Stephen Gengaro with Stifel. Please post your question, your line is live.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nThanks. Thank you for taking the question. Just could you remind me as we think about the fourth quarter, and just sort of the moving pieces on the top line, please remind us about seasonality and different kind of puts and takes we should be thinking about that impact the fourth quarter?\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nGo ahead, Michael.\n\nMichael Rama -- Chief Financial Officer\n\nNo. No. No, obviously. Well, as we saw with the sales that got reported over a 700 to 800, you know, expect? It's kind of an indicator where we think the quarter could start at, but obviously, the unknown is going be the weather.\n\nSo some areas could be affected, and it just depends. So that could be a little variable that we're not unsure of at this point in time. But Michael, cover that.\n\nAgain than that, the industry is growing. And there is a lot of incentives nationwide, and even areas globally to get charging equipment deployed. There's also mandates in certain areas, now, new construction, and so on. So, we're staying on top of all of that, and the industry is growing.\n\nAnd, if you heard what I said earlier, Bloomberg predicts that by 2040, you're going to need about a half a billion charging stations globally. So we've got to get from where we are today, which is only a couple of million chargers that are deployed today, viable chargers, and get to that, almost 500 million number to be able to really support, e-mobility globally. So we're seeing tremendous growth, we're seeing tremendous demand. We expect that growth to continue for the foreseeable future.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nOK. Thanks. From a seasonality from a fourth quarter perspective, are there? I mean, we've talked about weather. I mean, I think about new car sales, maybe rising.\n\nIs there are sort of normal seasonal patterns in the fourth quarter to just kind of overwhelm?\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nSometimes. Remember, we're installing the equipment out in the element. There are certain areas where it's very very difficult if the length if the ground is very, very cold. So the seasons do impact deployments.\n\nSo, again, it could impact negatively. And if we have a really mild winter, it could allow us to accelerate our growth. But yes, typically, in these times because it is out in a lot of outdoor work, and these units are deployed, in the elements, it could impact things based on weather.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. That's helpful color. Just sort of trying to think about the fourth quarter, but I appreciate the color.\n\nMichael Rama -- Chief Financial Officer\n\nOther than that, we see massive growth. Again, there's a lot of amazing automobiles on the road today that really satisfy a lot of different consumers needs and desires. You're seeing the highest end of the market being electrified and you're seeing the lowest end of the market being electrified now. It is the future of mobility and we need to make sure that there's enough charging infrastructure available to fuel all these cars that are coming into the marketplace.\n\nIt's that simple.\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nExcellent. Thank you, everyone, for your time.\n\nDuration: 0 minutes\n\nVitalie Stelea -- Vice President, Investor Relations\n\nMichael Farkas -- Founder and Chief Executive Officer\n\nBrendan Jones -- President\n\nMichael Rama -- Chief Financial Officer\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nChris Souther -- B. Riley Financial -- Analyst\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nMore BLNK analysis\n\nAll earnings call transcripts"
}