{
  "companyName": "Geron",
  "companyTicker": "GERN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/geron-gern-q2-2022-earnings-call-transcript/",
  "content": "Geron (GERN 15.24%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Rob, and I will be your conference operator today. At this time, I would like to welcome everyone to the Geron earnings second quarter 2022 conference call. [Operator instructions] And today's conference is being recorded.\n\n[Operator instructions] Thank you. Aron Feingold, vice president of investor relations and corporate communications, you may now begin your conference.\n\nAron Feingold -- Vice President of Investor Relations and Corporate Communications\n\nGood afternoon, everyone. Welcome to the Geron Corporation second quarter 2022 conference call. I am Aron Feingold, Geron's vice president of investor relations and corporate communications. I'm joined today by the following members of Geron's management team: Dr.\n\nJohn Scarlett, chairman and chief executive officer; Olivia Bloom, executive vice president of finance and chief financial officer and treasurer; Dr. Faye Feller, executive vice president and chief medical officer; and Anil Kapur, executive vice president of corporate strategy and chief commercial officer. Before we begin, please note that during the course of this presentation and question-and-answer session, we will be making forward-looking statements regarding future events, performance, plans, expectations and other projections including those relating to the therapeutic potential and potential regulatory approval of imetelstat, anticipated clinical and commercial events and related time lines, the sufficiency of Geron's financial resources and other statements that are not historical fact. Actual events or results could differ materially.\n\nTherefore, I refer you to the discussion under the heading Risk Factors in Geron's quarterly report on Form 10-Q for the quarter ended June 30, 2022, which identifies important factors that could cause actual results to differ materially from those contained in the forward-looking statements. Geron undertakes no duty or obligation to update our forward-looking statements. And now, I will turn the call over to CEO, Dr. Scarlett.\n\nChip?\n\nChip Scarlett -- Chief Executive Officer\n\nThanks, Aron. Good afternoon, everyone. Thanks for joining us today. It is an exciting time to be at Geron.\n\nWe expect the journey ahead will emphasize potential value-accreting milestones that reflect imetelstat's unique and highly differentiated qualities, that in turn, we believe, address many of the current unmet needs of patients with both lower-risk myelodysplastic syndromes or MDS and refractory myelofibrosis or MF. As such, we're planning for an upcoming catalyst-rich period during which we will be focused intently on the execution that we expect will take us from being a development-stage company to a commercial company. I'm personally very excited that we're only five months away from the first of these exciting milestones, which is the disclosure of top-line results from our IMerge Phase 3 trial in lower-risk MDS that are expected in early January of 2023. In advance of those top-line results, we're already actively preparing for two regulatory submissions in this indication, lower-risk MDS.\n\nThe first, expected in the first half of 2023, will be a submission of a U.S. New Drug Application, NDA; and the second, which will be the submission of a European Marketing Authorization Application, or MAA, which we expect in the second half of 2023. If the lower-risk MDS top-line results are positive and these regulatory activities are successful, we expect U.S. approval and commercial launch of imetelstat in lower-risk MDS in the first half of 2024.\n\nAlso in 2024, we anticipate an interim analysis of the ongoing IMpactMF Phase 3 study in refractory myelofibrosis. This assumes that enrollment meets our expectations and that a sufficient number of events have occurred to enable such an analysis. A positive readout in this trial, which is comparing imetelstat to best available therapy would have major implications. IMpactMF is the only MF study being conducted to date with a primary endpoint of overall survival.\n\nImprovement in overall survival is consistently ranked by hematologists near or at the top of the desired qualities of a new medicine in refractory MF. Returning to lower-risk MDS. We believe imetelstat represents a potentially transformative treatment option, as well as a significant commercial opportunity in this indication. Based on the market research conducted by our commercial team, practicing hematologists cite several key attributes of imetelstat that were observed in the IMerge Phase 2 study and that address current unmet medical needs in this indication.\n\nFirst, the durability of transfusion independence that was observed in Phase 2 addressed what these hematologists cited is the most significant current unmet need for the lower-risk MDS patients. Second, they cited the expected ability of imetelstat to treat a broader set of patients, including both RS-positive and RS-negative subsets, as well as a broad range of patients with high and very high transfusion burdens. They believe data such as these would differentiate imetelstat significantly from other currently available therapies in this indication. For example, luspatercept is restricted for use in only RS-positive patients, which represents approximately a Quarter 4 of the market.\n\nThird, these hematologists cited the novel mechanism of action of imetelstat. This mechanism is also significantly differentiated from the mechanism of other treatments for low-risk MDS and leads to the potential for disease modification. This disease-modifying potential was supported by clinical outcomes in the Phase 2 study, including very meaningful increases in hemoglobin, as well as depletion of malignantly transformed cells after treatment with imetelstat. These key attributes, as well as a manageable safety profile from the Phase 2 study give us confidence that the outcomes in the Phase 3 trial have the potential to address the unmet needs of the approximately 33,000 patients with lower-risk MDS in the U.S.\n\nand largest five EU markets, who are relapsed and refractory to ESAs. This translates to a significant market opportunity of approximately $1.2 billion in potential peak revenues across these lower-risk MDS markets. To capitalize on the potential of this market opportunity, a stage-gated build-out of the U.S. commercial team and plan has begun, which we plan to accelerate if we achieve positive top-line results in early January 2023.\n\nFor Europe, we're considering our options, including potential partners, as well as self-commercialization with the goal of bringing imetelstat to patients in that marketplace as efficiently and effectively as possible. Putting these upcoming milestones together, we believe Geron has the necessary elements for significant value creation over the next several years. These include the lower-risk MDS Phase 3 top-line data, the build-out of the U.S. commercial team and plan, the IMpactMF Phase 3 data from the interim analysis and the unique product attributes of imetelstat that are expected to allow to successfully address unmet needs.\n\nIn addition to the corporate attributes I've already discussed, another key element that we expect to lead to an ability to deliver the expected value creation is our strong balance sheet. In late March of this year, we raised approximately $70 million in net proceeds from a public follow-on offering. This past quarter, we secured up to an additional $50 million in potential nondilutive capital through an amendment to expand our existing loan facility with Hercules Capital and Silicon Valley Bank. These additional debt tranches increase our total available debt facility from up to $75 million to up to $125 million.\n\nWe believe these potential additional debt proceeds when added to our current financial resources and the projected proceeds from exercises of current outstanding warrants in 2023 will be sufficient to fund our projected level of operations until the middle of 2024. This strong balance sheet should also give us flexibility as we consider potential additional strategic funding and partnership opportunities after disclosure of top-line results in the lower-risk MDS Phase 3 trial in early January of 2023. Finally, I'd like to comment on our deeply talented management team. We continue to build an employee base that is both experienced and knowledgeable in hematologic malignancies, as well as in the commercial path ahead.\n\nThe recent appointment of Dr. Faye Feller as our chief medical officer, with Dr. Aleksandra Rizo having transitioned to her new role as senior medical and regulatory advisor, exemplifies the type of management expertise and capabilities in Geron today. Faye has been a cornerstone in the history of imetelstat's clinical development from working on the Phase 2 imetelstat studies at Janssen starting in 2015 to driving our Phase 3 trials and designing our pipeline expansion studies at Geron beginning in 2019.\n\nFaye has been instrumental in the design and management of the entire imetelstat development program in hematologic malignancies. I'd like to give Faye the opportunity to briefly introduce herself on this call. Following that, Olivia will provide a financial update, and then I'll make my concluding remarks. Faye?\n\nFaye Feller -- Chief Medical Officer\n\nThank you, Chip, for the kind introduction. I'm delighted to be speaking to all of you today and to be settling into my new role. I've been very lucky to be involved in the imetelstat journey for the past seven years, beginning at Janssen and then since 2019 at Geron. It is an incredible honor to lead its clinical development effort as chief medical officer as we plan to read out two pivotal trials for imetelstat over the next two years.\n\nBy way of a personal introduction, I'm a hematologist and medical oncologist, trained at Mount Sinai and Memorial Sloan Kettering Cancer Center. I subsequently joined the faculty at Memorial as an attending physician on the leukemia service before joining Janssen. At Janssen, I was a study physician for multiple clinical trials of early and late-stage development assets including the IMbark Phase 2 clinical trial of imetelstat, as well as other product candidates, including several in AML. Since coming to Geron in 2019, I have been the primary medical point of contact with our clinical investigators and involved in all parts of running the Phase 3 trial and designing the pipeline expansion studies.\n\nWith that, I'll turn the call over to Olivia for a financial update. Olivia?\n\nOlivia Bloom -- Chief Financial Officer\n\nThanks, Faye, and thanks to everyone on the call for joining us today. Please refer to the press release we issued this afternoon, which is available on our website for detailed financial results. As of June 30, 2022, we had approximately $220 million in cash and marketable securities, which includes net proceeds of approximately $70 million from the underwritten public offering we completed in April of this year. Overall, operating expenses were slightly lower for the three and six months ended June 30, 2022 compared to the prior period.\n\nThis overall decline primarily reflects changes in the composition of activities from last year. For example, the decrease in R&D expenses for the three- and six-month periods of 2022 compared to the same period in 2021, primarily reflects the net result of decreased manufacturing costs due to the timing of imetelstat manufacturing batches, partially offset by increased personnel-related expenses for additional headcount and higher consulting costs related to preparation for top-line results and regulatory submissions in lower-risk MDS. The decline in general and administrative expenses for the six months ended June 30, 2022 compared to the same period in 2021, primarily reflects the net results of reduced consulting costs related to modernizing the internal infrastructure to support potential commercial launch and lower legal fees, partially offset by higher personnel-related expenses for additional headcount. We continue to expect non-GAAP total operating expenses up to $150 million for the full year of 2022.\n\nUnder current planning assumptions, we expect to have approximately $130 million in cash and marketable securities at the time of the lower-risk MDS top-line results in early 2023. As Chip mentioned, in late June, we amended our existing loan facility with Hercules Capital and Silicon Valley Bank to expand the facility from up to $75 million to up to $125 million. This expansion of our debt facility provides potential access of up to $50 million in additional nondilutive capital in 2023, which is the year in which we expect low-risk MDS top-line results and if the data are supportive, U.S. and EU regulatory filings thereafter.\n\nWe also project up to $124 million in additional funding in 2023 from potential exercises of currently outstanding warrants. We believe the additional $50 million from potential additional debt proceeds when added to the projected exercise proceeds from outstanding warrants and our current financial resources will be sufficient to fund our projected level of operations, which includes stage-gated activities for potential U.S. commercial launch of imetelstat in low-risk MDS until the middle of 2024. With that, I will now turn the call over to Chip for closing remarks.\n\nChip Scarlett -- Chief Executive Officer\n\nThanks, Olivia. Well, I'd like to end where I began, emphasizing what an exciting and important time this is for Geron. We expect imetelstat's highly differentiated attributes to address many of the significant unmet needs of patients with both lower-risk MDS and refractory MF. As you've heard several times today, we're eagerly anticipating a Phase 3 lower-risk MDS readout in early January of 2023.\n\nWe also believe imetelstat has potential multibillion-dollar market opportunities. And supporting these efforts, as Olivia just described, is a well-funded balance sheet that currently takes us into mid-2024. I and my colleagues believe this set of circumstances has the potential to transform Geron into a leader in the treatment of hematologic malignancies and to bring significant value to patients and shareholders. Thank you very much for listening today.\n\nOperator, please open the call to questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Kalpit Patel from B. Riley Securities. Your line is open.\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nYeah, hey, good morning. Thanks, good morning, good afternoon. Thanks for taking the questions. I guess, first, starting with the lower-risk MDS program, as you sort of get closer to the final stages and assuming that trial reads out positive, how are you thinking about the potential utilization in the real world? You touched on this in the prepared remarks for the RS-positive and RS-negative patients.\n\nBut would you think the drug would be more likely to be reserved for patients who have a greater transfusion burden and perhaps those who are unlikely to use luspatercept? And just any more color on that would be useful.\n\nChip Scarlett -- Chief Executive Officer\n\nOK. Thanks a lot. I think, this would best be taken first by Anil Kapur, our chief commercial officer, who will have a few comments. Thanks.\n\nAnil Kapur -- Chief Commercial Officer\n\nSure, Kalpit. Thank you for the question. So Kalpit, as you know, we are addressing a very high unmet medical need in patients who are transfusion-dependent post ESAs. These patients have shortened survival and they suffer from very poor quality of life.\n\nDespite new advances, some of which you mentioned, what we are clearly seeing in our research and our discussions with clinicians and from scientific and clinical forums is significant dissatisfaction with current options, especially as it relates to durability of transfusion independence and ability to address the need of high transfusion burden patient populations. In this market, vast majority of the patients have -- they come with high transfusion burden. Our data with the Phase 2 study shows unprecedented durability of TI. We have guided in the past that we expect to present 24-week transfusion independence data, which has been regarded as one of the most important clinical outcomes by physicians.\n\nSo we expect commercially imetelstat to be very well differentiated, positioned as a standard of care across both RS-positive and RS-negative. And with our unique mechanism of action, our ability to kill the malignant stem cell and potential for disease modification, I think it is set up for big success. We do not comment on competitors' products and their adoption. But what is very clear is the durability of TI in the real world remains a high unmet medical need, and it is regularly cited by practicing hematologists across both indications.\n\nSo I'll just stop here.\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nOK, that's very helpful. And then, maybe one on the relapsed/refractory myelofibrosis program. The Phase 2 data in the past have suggested improved survival with imetelstat when compared to historical controls. I guess, has anything changed in terms of the best available therapy in this relapsed/refractory setting from the days of the historical controls to what's being used today? I'm just trying to delineate if we should expect any changes in that comparator arm relative to what we have seen historically.\n\nThank you.\n\nChip Scarlett -- Chief Executive Officer\n\nRight. Thanks, Kalpit. I'll take that one. It's pretty straightforward.\n\nSo as you know, we did not only the -- not only the Phase 2 study, the IMbark Phase 2 study, but we also did a real-world data study in which we did a careful matching with patients at the Moffitt who were relapsed or refractory to JAK inhibitors. And in that exercise -- in that sort of synthetic study, we actually looked very carefully at the BAT, at the best available therapy that would be available. And I think that since our study does exclude JAK inhibitors in the BAT arm, I don't think we expect to see very much difference. In fact, we've commented a couple of times publicly that we expect the BAT arm in the Phase 3 IMpactMF study to be very similar to what we saw in the real-world data study from using the Moffitt patients.\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nOK, that's very helpful. And if I could squeeze in one more for the IMproveMF, the Phase I study in combo with RUX. I guess, how is the enrollment going for that trial that started in May? Can you comment on any pushback that you might be receiving from investigators or any general thoughts on the additive profile of -- maybe additive adverse event profile of the two drugs?\n\nChip Scarlett -- Chief Executive Officer\n\nYeah, that's a great question. So I'm going to -- I'll take just the first part, which is super simple. Way early days. We really just got going on this.\n\nSo probably premature to comment about the pace of enrollment. But Faye, maybe you want to talk about the question of how investigators are sort of looking at this and how they're thinking about the potential combination of RUX and imetelstat in front line.\n\nFaye Feller -- Chief Medical Officer\n\nSure. Thanks, Chip. Thanks for the question. So to date, we've opened two of the three sites, and we continue to receive positive feedback from investigators on combination therapy.\n\nThe field is headed toward combination therapy and where we remain confident.\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nOK. Thank you very much. Thanks for taking the questions.\n\nChip Scarlett -- Chief Executive Officer\n\nKalpit, thank you for calling.\n\nOperator\n\nYour next question comes from the line of Joel Beatty from Baird. Your line is open.\n\nJoel Beatty -- Baird -- Analyst\n\nHi. Thanks for taking the questions. First one is on the IMerge Phase 3 trial in MDS. Are you able to share how the dropout rate or dose reductions or different measures like that are looking compared to expectations?\n\nChip Scarlett -- Chief Executive Officer\n\nSo Joel, we -- first of all, number one, we remain blinded to the study. Number two, we're in -- pharmaceutical development terms, we're pretty much there, and we'll see the results soon enough. So we would not be making any comments about the conduct of that study or any sort of interim looks or anything like that. We haven't done them.\n\nSo I'm afraid we'll have to wait to see all of that sort of data come out in early January.\n\nJoel Beatty -- Baird -- Analyst\n\nOK. Sure, yes, it makes sense, and that certainly is coming soon now. All right. So assuming the trial is successful, what would the filing time line be? Is it -- are you able to narrow it down to what part in 2023? And then, beyond the trial results from IMerge, what else remains to be done before filing?\n\nChip Scarlett -- Chief Executive Officer\n\nSure. We can give you a little bit of color on that. We've said that we expect the filing to be -- or the submission, I guess, I should say, specifically to be made in the first half of 2023. As you know, there's a couple of months to go by usually while the FDA looks at that and then they officially file it.\n\nBut we've simply given guidance that we expect the filing in the first half. There's been a ton of activity, as you would expect. There are many modules to an NDA, the only one of which really relies on the final data from the Phase 3 in this case. So all of the preclinical has been worked on extensively with CMC, the quality modules.\n\nSo I think, I would -- pretty much everything. So I think, I would say we have a very good head start on it all, and that's why we can give that kind of comfort in terms of filing -- sorry, submitting the NDA. So I think, we feel very good about that.\n\nJoel Beatty -- Baird -- Analyst\n\nThank you.\n\nChip Scarlett -- Chief Executive Officer\n\nSure.\n\nOperator\n\nAnd your next question comes from the line of Stephen Willey from Stifel. Your line is open.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nYeah, good afternoon and thanks for taking the questions. On the BD front, I know you mentioned wanting to maybe explore partnership opportunities on the back of IMerge data. Can you say if you've had any kind of preliminary discussions with any strategics thus far? And is it safe to assume that any deal would also have to contemplate the option of the imetelstat within MF as well?\n\nChip Scarlett -- Chief Executive Officer\n\nSo let me take the latter part first. I think that it would be extremely difficult and probably practically impossible to split indications here. I mean, 99% of the time, as we all know, indications don't get split in any type of partnership opportunity. But in this case, because there -- many of the investigators or many of the treating physicians are the same, etc., they're kind of kissing cousin diseases, not only biologically, but also from a practice perspective, I think, it would be pretty impossible.\n\nSo I think, you can assume that it's -- everything would involve both indications, and we see them both as huge value drivers. The second question, I can't really comment on. Obviously, we have a -- we hired Ed Koval as our chief business officer at the end of last year. You can certainly imagine that he and others are busy.\n\nBut I think, beyond that, it would be not appropriate for us to make any comments. We remain -- except to say that we remain very committed to seeing this product on the market, Steve. We believe it brings huge benefit to patients. It, obviously, is a key value driver for us.\n\nSo when we look at all the different options that I suspect will be available or at least some will be available after the turn of the cards in the beginning of next year. I think, we'll keep that in mind. And we are building out a very robust commercial group and fully expect to be prepared to launch that product on time whenever we have the opportunity and do so enthusiastically. So I don't know, Anil, is there anything else we should say about that? Or is that adequate from your perspective?\n\nAnil Kapur -- Chief Commercial Officer\n\nAdequate from my perspective. Nothing more to add on that.\n\nChip Scarlett -- Chief Executive Officer\n\nOK. All right. Thank you.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nAnd then, just a follow-up. So the TELOMERE study, which is, I guess, the investigator-sponsored study for relapsed/refractory AML. Can you tell us what the starting dose of imetelstat will be in that study, specifically in combination with venetoclax and -- just curious how you think those two drugs will get along considering some of the overlap on the hematologic side?\n\nChip Scarlett -- Chief Executive Officer\n\nYeah, I'm going to turn that over to Faye, but just to be crystal clear, TELOMERE itself is in AML, right? And as you quite rightly pointed out, it's in post Aza or post venetoclax-treated relapsed/refractory AML patients. But I think that's what you were asking about.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nSo it's in post venetoclax?\n\nChip Scarlett -- Chief Executive Officer\n\nYeah, so Faye can explain the design of TELOMERE.\n\nFaye Feller -- Chief Medical Officer\n\nThanks, Chip, and thanks for the question. So TELOMERE is in relapsed/refractory AML, and patients can have had exposure to venetoclax or HMA previously or they may not have and or, either of them. So in terms of the dose, I don't believe we've released that publicly. Of course, I cannot comment on it.\n\nChip Scarlett -- Chief Executive Officer\n\nYeah, but we can -- yes, so we can be crystal clear, the -- it's in AML. And Faye, it's also -- so it's in combination -- there are sort of two parts to it, right? It's in combination with venetoclax or it's in combination with azacitidine.\n\nFaye Feller -- Chief Medical Officer\n\nOne arm is in combination imetelstat and venetoclax and another arm is combination imetelstat and azacitidine.\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nOK. That helps. Thanks.\n\nChip Scarlett -- Chief Executive Officer\n\nThanks, Steve.\n\nOperator\n\n[Operator instructions] Your next question comes from the line of Stephen Willey -- I'm sorry, from Gil Blum from Needham & Company. Your line is open.\n\nGil Blum -- Needham and Company -- Analyst\n\nHi, everyone. Thank you for taking our singular question. A bit of a follow-up on that earlier luspatercept angle. Maybe I'll attack it from a different direction.\n\nSo it looks like luspatercept is expected to reach a blockbuster status by 2023. And this is despite it being restricted by RS status. Do you think this suggests potential for more impressive penetration just based on reduction of transfusion burden? I mean, I kind of suggest that there's a very unmet population there, right?\n\nChip Scarlett -- Chief Executive Officer\n\nAnil, I think, it's in your purview.\n\nAnil Kapur -- Chief Commercial Officer\n\nSo Gil, what I can -- I don't know what blockbuster status means. Obviously, it's a really important advance in low-risk MDS, a disease which saw really no innovation come through for almost a decade. These patients, as I previously highlighted, especially patients who are ESA relapsed/refractory, they come with significant transfusion burden. What the marketplace is seeing in terms of adoption is the realization of that unmet need.\n\nBut now, that that drug is on the market for some time, we are also seeing real-world utilization patterns and the real story emerge around these drugs. And that's why, as I previously stated, durability of transfusion independence becomes a really, really important metric for these patients to address high unmet medical need. We are seeing up-dosing phenomenon among competitor drugs as they are searching for responses. Our expectation is that given the fact that we are mechanistically different, the data set that we'll bring out is highly differentiated.\n\nIt is going to showcase and really meet the unmet need across both these populations with the breadth and durability. And to your question around high transfusion burden, number of patients, I think you're absolutely right. The ESA literature for the last two decades has been very clear, patients three-plus are literally 60%, 70% of the presenting population. So we are going to bring out data, which is highly relevant to the community and patients really deserve these options.\n\nSo I'll just stop here, Gil, if I answered all your questions. And if you have a follow-up, I'll try to answer that as well.\n\nGil Blum -- Needham and Company -- Analyst\n\nNo, that was very helpful. And yes, I think that's a good summary of the items.\n\nOperator\n\nAnd there are no further questions at this time. Ms. Aron Feingold, I turn the call back over to you for some final closing remarks.\n\nAron Feingold -- Vice President of Investor Relations and Corporate Communications\n\nThanks so much to everyone for joining us today. We appreciate you taking the time to dial in to our call. We look forward to keeping you up to date on our progress and hope that you are all well. Thanks so much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAron Feingold -- Vice President of Investor Relations and Corporate Communications\n\nChip Scarlett -- Chief Executive Officer\n\nFaye Feller -- Chief Medical Officer\n\nOlivia Bloom -- Chief Financial Officer\n\nKalpit Patel -- B. Riley Securities -- Analyst\n\nAnil Kapur -- Chief Commercial Officer\n\nJoel Beatty -- Baird -- Analyst\n\nSteve Willey -- Stifel Financial Corp. -- Analyst\n\nGil Blum -- Needham and Company -- Analyst\n\nMore GERN analysis\n\nAll earnings call transcripts"
}