{
  "companyName": "Thorne HealthTech, Inc.",
  "companyTicker": "THRN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/thorne-healthtech-inc-thrn-q2-2022-earnings-call-t/",
  "content": "Thorne HealthTech, Inc. (THRN 1.11%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:00 a.m. ET\n\nOperator\n\nHello and welcome to today's Thorne HealthTech second quarter 2022 earnings call. My name is Bailey and I will be your moderator for today's call. All lines will be muted during the presentation portion of the call with an opportunity for questions and answer at the end. [Operator instructions].\n\nI would now like to pass the conference over to our host, Thomas Wilson, vice president of investor relations. Thomas, please go ahead.\n\nThomas Wilson -- Vice President, Investor Relations\n\nGood morning, everyone. Thank you for joining Thorne HealthTech's second quarter 2022 earnings call. With me today to share our results are Paul Jacobson, our CEO; and Bryan Conley, our CFO. Tom McKenna, our COO; and Michelle Crow, our chief Marketing officer are also available for questions.\n\nBefore we begin, please note that today's discussion contains forward-looking statements that are subject to risks and uncertainties. Actual results may differ materially from those indicated by our forward-looking statements. More information about potential risk factors can be found in our 2021 annual report on Form 10-K and our upcoming Form 10-Q, which we anticipate filing after market today and in other SEC filings. Today, in addition to U.S.\n\nGAAP reporting, we will be discussing financial measures that do not conform to GAAP. We believe these non-GAAP measures enhance the understanding of our performance because they are more representative of how we internally measure the business. Non-GAAP financial measures should not be considered in isolation from or as a substitute for GAAP measures. A reconciliation of GAAP to non-GAAP results is available in the earnings press release we issued after market closed yesterday and in the supplemental investor presentation posted to our IR website.\n\nWith that, I'll turn the call over to Paul.\n\nPaul Jacobson -- Chief Executive Officer\n\nThank you, Thomas. Good morning, everyone. Thank you for joining our second quarter earnings call. I'm pleased to report that we had another successful quarter on our journey to becoming the leading company in healthy aging and personalized scientific wellness.\n\nWe entered the quarter with an aggressive agenda that included our largest ever marketing campaign aimed at driving significant brand awareness, slating important new product launches that span across multiple health areas, and the continued advancement of our proprietary wellness tests, which we expect will further differentiate our holistic offerings and help us build a competitive moat around areas of the wellness space that have not existed before. Today I'll highlight milestones related to these topics and discuss some of our more recent activities before turning to our updated guidance. But first let me share some of the details of our financial performance for the quarter. Record net sales of $56.1 million, grew by more than 30% over Q2 of last year, led by an increase of nearly 70% in direct-to-consumer or DTC sales.\n\nOur strong growth in this channel was underpinned by 74% growth in subscriptions. And I'm pleased to say we now have served over 5 million customers since 2018. We continue to benefit from high customer engagement and a routinely strong net promoter score, which was 69 for the quarter compared to the average digital retailer score of 35. Excluding distributor issues, our pro and B2B sales channel was significantly up over the last year second quarter.\n\nHowever total sales in this channel were impacted by the previously disclosed reduction of a distributor sales into international end markets from the conflict of Ukraine and Russia. As a reminder, our exposure to those end markets through our U.S.-based distribution partners was higher than we were aware of entering the year. And the actual impact of Q2 was slightly higher than we anticipated last quarter. We now expect our annual sales mix to be closer to 50-50 split between channels on a go forward basis.\n\nThe mix shift that benefited successful targeted pricing actions for some products this year and further efficiencies from increased scale have helped offset the inflationary pressures in our cost of sales. As a result, our gross margin expanded over 260 basis points to 55.9% for Q2, which is above our original full year guidance range. Despite landing above that range for the quarter, we have not revised our full year gross margin guidance since we expect some higher costs raw materials secured in Q2 to move through our cost of sales line with the related product sales in the second half of the year. Moving down to P&L, our adjusted EBITDA loss was $1.4 million for the quarter.\n\nIn addition to the reduction in international distributor sales, the loss was mainly driven by planned marketing spent related to our redefining healthy aging brand campaign. As our largest campaign in history, marketing costs for Q2 were just above 30% of sales. Now with the major campaign behind us, the rest of year marketing spend as a percentage of sales will be much lower than it was in Q2, which will push marketing costs below our original full year guidance range into our revised full year guidance range, which I'll touch on shortly. In addition, SG&A cost as a percentage of sales ticked slightly higher during Q2.\n\nAs we approach the one-year anniversary of our IPO with better insight into the run-the-engine costs of recently acquired companies and the formation of the Asia JV, we expect to see some corporate cost efficiencies emerge that will help us deliver our full year profit goals. Rounding out the P&L, our GAAP loss was $0.11 per share for the quarter with an adjusted loss per share of $0.05. Bryan will provide more details on our Q2 financial result in his remarks. I'll now step through some of our other operational highlights.\n\nFirst, circling back to our healthy aging campaign. We have been pleased with the results today. The campaign was designed to highlight how the aging process can be more controllable at a personal level and how our solutions can help individuals make more informed decisions aimed at living healthier for longer. Our 12-week full funnel campaign was aimed at increasing brand awareness and driving new customer acquisition.\n\nOur core messages centered around a few key themes. Personalized empowerment, specifically that we equip individuals with tools to lower risk of chronic disease and take proactive steps toward optimize self through our test, teach, and transform model. Scientifically driven solutions, where we highlighted our suite of solutions for every age and life stage because health needs change over time no matter where an individual is on the aging segments. The benefits of owning your own health.\n\nWe amplified our view that health is the new wealth and how the benefits of everyday investments in one's health can accumulate over time like investing in one's retirement. Over the course of the campaign, which ran from March 28 through June, we generated over 1 billion unique impressions. In addition, our digital properties doubled the number of web page views over Q2 of last year to nearly 15 million in total between thorne.com, our mobile app and Amazon. These views significantly outpaced volumes we achieved during our Olympic campaign in Q3 of 2021.\n\nWe saw a dramatic increase in pageviews for our proprietary nicotinamide riboside or NR products, especially NiaCel, Collagen Plus, and ResveraCel. As a reminder, we normally see campaign results to take hold between eight and 20 weeks post campaign, which stands to mid-November. As a byproduct of the timing of the campaign spent, our quarterly customer acquisition costs increased meaningfully, which dropped our LTV to CAC ratio for the quarter to 1.8 times for Q2. For the first half of the year, our LTV to CAC ratio was 2.7 times, putting us on pace to achieve our goals of an annual LTV to CAC ratio of 3.0 times or better.\n\nAs such we anticipate that ratio to trend back up in the next couple of quarters. During the quarter, we also launched several new offerings that we had previously highlighted on our roadmap for the year. Many of these new products like Daily Greens and Collagen Fit contain essential ingredients that not only boosts performance, but have also been shown to resist the hallmarks of aging in some way, such as NR. In fact sales of products that contain NR were up 35% over Q2 of last year.\n\nWe're seeing great traction with the potential for significant growth over time. We also launched an ovarian care product to support women with endometriosis and PCOS with solid feedback so far. We'll be launching our kids plus multivitamin offering this month, which leverages the cutting edge technology we acquired from Nutrativa to physically spread supplements on a dissolvable wafer. In addition to providing superior efficacy with no sugar or gelatin, this technology requires less water, no plastic packaging, and reduces shipping costs.\n\nOn the testing front, we continue to build on the positive study results related to our proprietary Microbiome Wipe and our OneDraw collection device which were published just before our first earnings call. Starting with the wipe, which has revolutionized the user experience for microbiome testing. We officially relaunched our gut health test with the first to market wipe technology in June. That test was already our most popular and we sold out of our first 500 new kits in three days.\n\nWe started working with a few early adopting biopharma and B2B partners with great feedback thus far. And we're in early stage conversations with a handful of companies to identify an OEM. Just last week, our wipe technology was highlighted in a CNBC Make It article describing the importance of gut health. The topic is trending heavily on TikTok with gut health hashtags crossing over a billion views.  With respect to the OneDraw collection device, we have already started expanding our testing panels and have launched new tests with the partner lab focusing on allergies and autoimmune screening.\n\nThe team made solid progress developing the plasma separation cartridge we've mentioned before. Manufacturing has started with the first lot of 500 units already shipped to select partners. We've also been able to support extending the shelf-life of the device from 12 to 18 months. We are currently negotiating a contract with a national medical device distributor, and have received interest from multiple biopharma companies, CROs, and other research organizations for additional trials using the device.\n\nWe expect to highlight a few more key developments later this year while we continue to work toward FDA approval for unsupervised sample collection, to expand the test directly into our wellness offerings and ultimately into increasingly decentralized healthcare settings, including telehealth. Rounding up to more recent updates. Last week we announced an extension of our collaboration with AstraZeneca. The collaboration allows AstraZeneca to fully deploy our disease discovery system, which leverages our proprietary Multi-Omics platform, extensive disease library and AI models to provide further data driven insights into underlying novel disease drivers to support their drug discovery program.\n\nThis technology platform is being utilized internally to help develop new and targeted natural products for our own use. With respect to the revised guidance considering the incremental deterioration of a single distributor of our products into end markets, I mentioned earlier, we are now projecting approximately $22 million of lost sales against our original plan for 2022 instead of the $16 million previously disclosed. While we will make up some of it versus the original budget, we have reduced our full year net sales guidance to a revised range of between $235 million and $242 million, with the remaining projected net sales for the second half of 2022 expected to be weighted more toward the fourth quarter than the third quarter. We've also reduced our adjusted EBITDA guidance to a revised range of between $28 million and $32 million, and revised our adjusted EPS guidance to a range of between $0.36 and $0.39.\n\nTo prioritize delivering on our profit goals, we've decided to defer the second brand campaign that was planned for the third quarter, which will reduce our full year marketing expense. Instead we are capitalizing on our first brand campaign and dedicating more resources to unpaid initiatives such as SEO and automated marketing for new products. While we expect this decision may reduce the number of new customers short-term, we do not expect it to cause a significant deterioration in 2023 sales growth based on the strength of our customer base, a planned expansion of international sales and the significant business development effort in the U.S. and in the channel diversification.\n\nAs a result, we are now projecting full year marketing costs of between 14% and 15% of net sales, a reduction compared to prior guidance of 16% to 18%. The remaining projected marketing costs for the second half of 2022 are expected to be weighted slightly more to the third quarter than the fourth quarter. In summary, while we have experienced higher than anticipated impacts to our business from the conflict in Ukraine and Russia, our brand is growing significantly. And our U.S.\n\nand international B2C customers have thus far been resilient amid the uncertainties presented by current economic conditions. We have made significant progress advancing our health tests and devices and have further strengthened our strategic partnerships. Our core business remains incredibly strong, positioning us well for continued long-term profitable growth. The field of scientific wellness and healthy aging is expected to grow significantly and we intend to be one of the leaders in the field.\n\nI'll now turn the call over to Bryan for additional color on our results and outlook before getting to your questions.\n\nBryan Conley -- Chief Financial Officer\n\nThank you, Paul. And good morning, everyone. As we're all well aware, the second quarter offered an unprecedented number of headwinds and headlines, including the continued conflict in Ukraine, rising interest rates and energy costs, record inflation, and the resurgence of COVID and related lockdowns, which continue to impact the global supply chain. In the face of these events, we again delivered another quarter of strong financial and operating results, building on the foundational strength and trusted brand of Thorne.\n\nDuring the quarter, we launched our healthy aging brand campaign, the largest ever for Thorne, and continued to strengthen the structural economics of our business, driven by robust demand across all sales channels, gross margin accretion, disciplined cost management, and continued strategic investment in the Thorne brand and our integrated offerings. During the second quarter, we continued the quarterly cadence of strong top line growth with net sales growing 30.7% to $56.1 million, up $13.2 million from the same period last year. The increase was led by double digit growth in our DTC channel, which grew by $11.9 million or 69.6% to $28.9 million. Subscription sales continued to strengthen during the second quarter, growing 74.3% over the second quarter of 2021 to $9.7 million.\n\nSubscriptions sales now represents 17.2% of our total net sales and 33.5% of our DTC net sales. Our non-subscription DTC sales also continued to grow during the quarter, increasing $7.7 million or 67.3% year-over-year to $19.2 million. The continued growth in our DTC channel highlights the growing brand awareness across the consumer segment. In terms of our B2B business, sales during the second quarter were $27.2 million, an increase of 5.1% or $1.3 million over the same period last year.\n\nWhile we continue to see growth among our existing B2B and professional customers, the Russia-Ukraine conflict continues to impact a historically significant customers' business within that region, which we believe has adversely impacted our business by as much as $6.9 million during the second quarter of 2022. Gross margins during the second quarter continued to strengthen and were 55.9% of net sales, an expansion of 260 basis points or 4.8% over the same period last year. Sequentially gross margins grew 80 basis points or 1.5% over the first quarter of 2022. We remain hyper-focused on operational efficiency and disciplined cost management.\n\nThese continued initiatives have guided our gross profit higher by $8.5 million or 37% over the prior year. While we began to feel some impact from inflation during the quarter, we have taken this as an opportunity to more deeply engage our strategic suppliers, enhance our relationships, and strengthen our partnerships to ensure that the short-term cost impacts on our business are minimized.  In addition to our relentless focus on managing our materials input costs, we remain concentrated on optimizing our manufacturing processes and driving efficiency through our production environment. While we continue to scale to meet the continued growth in the demand for our products, we will begin investing and upgrading our manufacturing facility to maximize production efficiency, increase throughput, and realize cost savings.  Looking at operating expenses, our SG&A expenses during the second quarter of 2022 grew $6.2 million or 50% to $18.5 million, representing 33% of net sales. Adjusted to exclude the impact of depreciation and stock-based compensation, SG&A expenses during the second quarter of 2022 increased $3.5 million or 29.7% to $15.3 million for the quarter, representing 27.2% of net sales.\n\nComparatively SG&A excluding depreciation and stock-based compensation for the second quarter of 2021 was $11.8 million or 27.4% of net sales. The increase in SG&A is attributed to a number of factors, including higher sales activity, rising shipping costs, IP related legal fees, public company costs and costs related to acquired and newly formed businesses. As a result of the continued growth in our DTC business, we incurred higher fulfillment costs primarily related to higher shipping fees of approximately $900,000 during the quarter due to increased transactions and shipment volume. Additionally we incurred incremental legal fees of $1 million during the second quarter of 2022 related to IP filings and compliance.\n\nWe also incurred $1 million of incremental costs during the second quarter of 2022, which we consider public company in nature, including higher insurance premiums related to D&O coverage, professional and legal fees, board costs and audit related fees. Finally, during the second quarter of 2022, we recorded $800,000 of incremental SG&A expense attributable to our acquired businesses, Drawbridge and Nutrativa, and our consolidated Asia joint venture. We continue to remain focused on managing our SG&A expenses and leveraging the fixed cost components of our corporate cost structure. As expected, during the second quarter, marketing expenses were $17.3 million or $12.2 million higher than the same period last year, driven primarily by our planned investment and marketing as we launched our healthy aging campaign.\n\nAdjusting for the $10.2 million investment in marketing during the second quarter of 2022, marketing was 12% of net sales compared to 11.8% for the second quarter of 2021. Research and development expenses were $1.7 million during the second quarter, up from $1.1 million during the prior year as we continue to advance the development of our pipeline and strategic initiatives and new products such as our collagen line, gut health kit, OneDraw device and our new Daily Greens Plus product which launched in July. Second quarter per share earnings on a GAAP basis were a loss of $0.11 per share, which is $0.11 per share lower than a year ago. Adjusted EBITDA for the second quarter of 2022, excluding special items, was a loss of $1.4 million, a decrease of $7.2 million, compared to the $5.7 million reported during the prior year.\n\nIf we were to exclude and add back the investment in the healthy aging campaign conducted during the second quarter of 2022, adjusted EBITDA would have been $8.8 million for the second quarter. Looking at year to date results for the first six months of 2022, net sales increased $23.4 million or 26.7% to $110.7 million led by an $18.3 million or 50.1% increase in our DTC sales, of which $7 million was attributable to the continued growth in our DTC subscription sales. B2B and professional sales during the first six months increased $5.1 million or 10% to $56 million during the first half of 2022. Gross margin for the first six months of 2022 was 55.5%, an increase of 270 basis points or 5.2%, compared to 52.8% during the first six months of 2021.\n\nOur continued commitment to operational efficiency and cost management initiatives steered gross profit higher by $15.3 million or 33.3% over the prior year. During the first six months of 2022, SG&A expenses grew $12.6 million or 53.3% to $36.1 million or 32.6% of net sales. Adjusted to exclude the impact of depreciation and stock-based compensation SG&A expenses during the first six months of 2022 increased $8.8 million or 40% to $30.8 million or 27.8% of net sales. Comparatively, SG&A, excluding depreciation and stock-based compensation for the first six months of 2021 was $22 million or 25.2% of net sales.\n\nMarketing expense during the first six months of 2022 increased $13.7 million or 147.7%, driven primarily by the $10.2 million investment into our 12-week healthy aging campaign aimed at increasing brand awareness and driving new customer acquisition, which ran the majority of the second quarter of 2022. Excluding the $10.2 million of incremental advertising spend and stock-based compensation, marketing costs during the first six months of 2022 was 11.1% of net sales, 50 basis points or 4.7% higher than the first six months of 2021. Research and development expenses were $3.7 million during the first six months of 2022. Earnings on a per share basis for the first six months of 2022 were a loss of $0.01 per share, a decline of $0.01 cent per share, as compared to the first six months of 2021.\n\nAdjusted EBITDA for the first six months of 2022 was $7.2 million, a decrease of $6.9 million, compared to $14.1 million during the prior year. If we were to exclude or add back the investment in the healthy aging campaign, adjusted EBITDA would have been $17.4 million for the first six months of 2022 or an increase of $10.2 million over the first six months of 2021. Turning from operations and focusing on capital and liquidity. As of June 30 2022, we have a cash balance of $32.7 million, of which $27.8 million was unrestricted.\n\nOperationally, during the first six months of 2022, we used $7 million of cash in our operating activities, primarily driven by marketing and advertising spend and growing our inventory, including raw materials by $11.2 million to support our continued growth, new product launches and protect our supply chain. As we move forward, we expect to continue to invest in research and development activities and operational enhancements of our production facility to meet the continued demand growth for our products. As previously announced, on April 9, 2022, we executed a loan agreement with Bank of America for a $15 million revolving line of credit. We have not drawn any amounts against the revolver and the full amount remains available to fund working capital requirements and strategic initiatives.\n\nWe will continue to remain assiduous in our sourcing and allocation of capital in the most efficient manner possible while preserving a strong balance sheet. In closing, I want to recognize and thank our team members in New York, South Carolina, Wisconsin, California, and across the globe for all of their tremendous efforts and valued contributions. You're the backbone of Thorne and are the reason our customers trust our brand for their bodies. Your passion inspires me every day and your commitment continues to make Thorne HealthTech a leader in the health and wellness space.\n\nWe could not be more excited about the opportunities ahead. This completes our prepared remarks. We would now like to open the line for any questions you may have. Operator, can we have our first question please?\n\nOperator\n\nThank you. [Operator instructions]. The first question today comes from the line of Sean Dodge from RBC Capital Markets. Please go ahead, your line is now open.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nThanks. Good morning. So, Paul, you mentioned the disruptions in Russia and Ukraine and that that deteriorated further in Q2. Does that just relate the product you were selling specifically in those two countries or you're seeing weakness in adjacent countries of the region, too? And then for the remainder of the year, are there any more revenues assumed to be coming from Russia and Ukraine or for the purpose of the guidance, have you completely taken those out now? Just trying to understand if it stabilized and if it does get worse, how much more compression we could see in the revenue outlook.\n\nPaul Jacobson -- Chief Executive Officer\n\nSo I believe that most of it was attributable to those two countries with a touch of weakness due to the strong dollar in Europe from this same distributor and maybe a few others, but very marginal impact from the strong dollar in Europe overall. This particular distributor also does business in other parts of the world, and we continue to do business with them. And we have found that they're very unreliable this year, in particular, in their ability to forecast for us. So effectively, what we're doing is we're looking at the numbers we're doing with them every month, and we're forecasting for the remainder of the year, numbers that are slightly below what we're actually doing and significantly below what they're forecasting to us.\n\nNow we've asked for a recent update before earnings today from them on forecast, and we don't have it, they couldn't do it. But we are budgeting significantly below where they're forecasting and actually a little bit below what we're doing the last several months for the remainder of the year. So I don't see an impact from this particular account that would be worse than what we're -- that's why we simply took the guidance down because of this account, and that's how we're forecasting.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOK. That is helpful. And then the decision to defer the brand campaign for the back half of the year, is there any more detail you can share around what led to that decision? Is it just purely related to the tougher consumer or macro backdrop or are there other factors that play a role there?\n\nPaul Jacobson -- Chief Executive Officer\n\nSo first of all, let me say that our consumer demand is really strong. I mean we haven't seen any impact from the recession yet, and I think this is really cuts to the fact that we are focusing on being a luxury brand. This is a combination of two things. One, expense management.\n\nWe're just a bit conservative and protect our earnings. That's been the mission, is to try and protect the guidance we've given on our earnings for the year. And that's really what we're -- that's one of the reasons. The other is that Michelle -- which she'll talk about, I'm sure, with other questions -- is very focused on being nimble and trying to find other ways to spend our marketing dollars that continue to drive sales for us.  But we're also very, very focused as a company now.\n\nChannel diversification, which I can talk about more later. But we are really beefing up our business development effort. We've coordinated it significantly between people here in New York on the biz dev front, with our sales teams, and we're trying to add big blocks of new customers that we've never approached in the past. And some of it, which will begin launching at the end of the year, are a result of basically nine months' worth of product market fit studies that we've been doing to enter new areas like corporate wellness and the assisted living space.\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOK. Thanks again.\n\nOperator\n\nThank you. The next question today comes from the line of Oliver Chen from Cowen and Company. Please go ahead, your line is now open.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, Paul and Bryan. Good to talk to you. As we look ahead to the gross margin in the second half, if you could speak to both headwinds and tailwinds you're seeing, you've got some nice operational efficiency this quarter. Also, as you conduct the shifts, the proactive shifts in marketing spend, what are your thoughts on ensuring that you protect the revenue guidance in terms of managing the right kinds of changes there? And then your earlier statements, Paul, on LTV to CAC, it sounds like you're optimistic for improvement.\n\nJust would love further details on what underlies, what's ahead with that improvement.\n\nPaul Jacobson -- Chief Executive Officer\n\nOK. First of all, I'm going to let Bryan comment on the margin aspects. I will tell you, Oliver, first that we're trying to be conservative in the way we're forecasting our margins. From an inflationary perspective, I think our operations team has done an incredible job managing this so far.\n\nWe've had some negative impacts, which we've discussed. But we've already begun through aggressive management to get -- to see prices decreasing in certain parts of our raw material side, largely due to pressure we're putting on our suppliers to basically not make oil prices a permanent factor if they come down in our pricing. So we are working on that. I'll let Bryan talk about that, and then I'll get into the revenue and the LTV to CAC after that.\n\nBryan Conley -- Chief Financial Officer\n\nOverall, we expect gross margins to kind of stay in the range that we've seen during the first half of the year through the remainder of the year. Where we've seen inflation hit -- I guess I'll address it with inflation and then the second part of this, I'll address with kind of the tailwinds on this. But from a headwind perspective, inflation coming into our raw materials, we are seeing roughly for the year a 2% increase in raw material costs. So not substantial.\n\nAnd that's obviously from an actual dollars perspective. That's the biggest dollar component flowing through on margin. In terms of the highest increase we've seen, as we mentioned in Q1, it still remains in that packaging space. Anything that -- any of the plastics, right, that are driven from oil prices, those are up roughly 42% year-over-year.\n\nIn terms of actual dollar impact, however, that increase is roughly $400,000 of increase year-over-year. So it's not a large impact there. So that's the benefit. And in terms of specific raw materials, we certainly see more pricing increases coming out of Europe, and that's driven really by the increased energy costs.\n\nWe've had some benefit, obviously, with the strengthening of the dollar against that because our purchases are denominated in USD. So again, kind of mitigating FX. I think overall, in terms of product mix, we're starting to see more [Inaudible] powders being sold, [Inaudible] powders in terms of relative to encapsulated products, slightly lower margin. But again, we're seeing the increase in sales kind of month-over-month as we move through 2022.\n\nSo that's really the drivers overall on the inflation side. The other component that we see is shipping, both inbound and outbound. On the inbound side, those costs go right into inventory and will go out through margin. And we've seen increases there roughly anywhere from kind of 8% to 12% on shipping costs on inbound freight.\n\nSo that's having some impact.  And the point I'd like to say or echo what Paul said, we are actively in communication with all of our suppliers. We understand the short-term necessity for the price increases. We've gained commitments from a majority of our suppliers that as quickly as they can reduce prices back down, they will. And to Paul's note, we've seen that with a number of suppliers even post June 30.\n\nSo here in July and August, we've actually seen somewhat of an acceleration on some of those reductions coming back through on our raw materials. So in summary, though, we do expect margins to maintain kind of in that mid-50% range where we've been for the year so far. And we're doing all we can to protect that.\n\nPaul Jacobson -- Chief Executive Officer\n\nOliver, on the your next questions, we'll let Michelle make a couple of comments on that, and then I'll add anything if there's anything left to make.\n\nMichelle Crow -- Chief Marketing Officer\n\nYes. So I can address the kind of how we're proactively managing the marketing spend to protect sales. So as Paul mentioned, we'll be deferring the second brand campaign and instead focusing on capitalizing on our first brand campaign. And we're able to really do that because we've had record performance with this campaign.\n\nWe've had actually record performance with every paid channel that we've invested in in Q2. And we'll also be really digging further into our unpaid initiative. So we're really actively mitigating any risk by focusing on both earned and owned media. So scaling our SEO efforts, investing in content marketing, driving awareness of our referral ambassador programs, focusing on increased earned media coverage.\n\nAnd we still strategically spend in certain areas, and we'll really be focused on optimizing our acquisition costs in those areas. So for the year, we're really confident that our DTC customers will contribute about 49% to 52% of our total sales. And then on your LTV to CAC question, as we look at the first half of the year, our customer acquisition cost was $58. So for Q2, it was a little higher, and that's really a function of the timing of the spend and not capturing the full impact of that spend.\n\nAnd if you look at the comparable period in 2021, which would be Q2 and Q3 based on the timing of the brand campaign last year, the CAC was $50. So overall, we're right in line with where we want to be in terms of customer acquisition costs. And then if we look on the LTV side, year-over-year in Q2, we grew 5%. And quarter-over-quarter, we were slightly down, but we're confident in rebounding that in the future quarters.\n\nAnd if you look at our customer value that we capture post purchase, about 78% of that is captured post purchase. And we really feel like that implies both customer satisfaction and retention and favorable acquisition economics. So kind of our goal this whole year has been an LTV to CAC ratio of three times or better, and we're confident that we're going to be able to hit that by the end of the year.\n\nPaul Jacobson -- Chief Executive Officer\n\nI would also add, just from a protection of revenue side, we are seeing strength in Asia. In particular, Korea, and China. And hopefully we're going to begin to be able to enter the Korean market this year for the first time. Our hope also is that we don't get an acceleration of conflict between China and Taiwan because our business there is significantly picking up.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThanks a lot. Paul, as a follow-up, you mentioned channel diversification and some interesting strategies on the horizon. Maybe you could elaborate on what you see there is big opportunities and also how you'll think about talent to embrace those. And then the final question is on the United States.\n\nI would love your thoughts on the customer health in the U.S., and as you think about pricing, elasticity of demand and other considerations to apply that optimally across your portfolio. Thanks a lot.\n\nPaul Jacobson -- Chief Executive Officer\n\nSo on the channel diversification, we've been in a product market fit study for some time, probably 10 months now looking at the corporate wellness area. It's an area that we had a tremendous amount of question as to whether we could enter with a supplement offering without the testing offering. And we actually hired an outside firm that's an expert in consulting with people on product market fit. They did a lot of surveys of corporations.\n\nOur people are traveling to companies looking at beta testing, and we're quite confident we're going to have a robust corporate wellness offering to launch. We'll do a beta launch this year, but we'll start next year. We're also through our chief medical officer have begun initiating discussions with some good-sized assisted living spaces where the people are wealthier and still quite focused on maintaining an active lifestyle. And we think there's going to be an offering that we'll be able to come up with for those two markets as well.  So we continue to be also focused on opportunities to do ventures of some sort with physicians.\n\nOne of the biggest trends in the world right now, which we believe is a real tailwind for us, is this whole move toward global wellness and prevention. And it really has been dragging the doctors. They're not leading, but they're certainly catching on, and you see more and more physicians opening some facet of prevention and wellness inside their practices. We have been approached by doctors who are interested in doing various ventures with us that are focused on their areas of specialty, and we intend to get involved in one very specific one later on this year as we conclude the agreements.\n\nAnd I think that that's going to be -- continue to be a big opportunity for us, the doctor channel. Michelle, you have any other thing?\n\nMichelle Crow -- Chief Marketing Officer\n\nYes. And I can add to the health of the consumer and price elasticity. So despite taking a price increase in January, our demand volumes from consumers remained really strong. We saw growth in the number of purchasing DTC customers quarter-over-quarter and year-over-year.\n\nIn fact, our active customer growth rate accelerated 5% in Q2 from Q1. And then in terms of the unit economics, we've seen an increase in net price per unit and order frequency. And we feel like this is really promising given that we continue to acquire customers kind of straight from our core when the economics tend to degrade. So overall, we feel that this is really a testament to a relatively inelastic customer base that's attracted to a luxury brand and premium products, but also speaks to kind of the deep emotional bond that our customers have with our brand where we're empowering them to fulfill their health needs and operations at a time when health continues to be top of mind for consumers across the U.S.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you very much. Best regards.\n\nPaul Jacobson -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. The next question today comes from the line of Elizabeth Anderson from Evercore. Please go ahead, your line is now open.\n\nUnknown speaker\n\nThis is Patrick on for Elizabeth. You provided color on marketing spend cadence for the back half of the year, and you talked through SG&A in the prepared remarks, which was helpful. Is there anything you can say about R&D spend cadence for the back half of this year?\n\nPaul Jacobson -- Chief Executive Officer\n\nYes. I would say it's going to be slightly lower than we've spent in the first half of the year. There was a significant amount of R&D work that went into a lot of our new product launches. And the good news for us overall is that as we've disclosed along the way, we've had a number of new product launches in the pipeline and we're basically complete, which is going to allow us to save money on all sorts of developmental areas as well as R&D going forward.\n\nSo the next big platform for us is really brain health. That will continue. But otherwise, we expect to be able to spend less in the second half of the year.\n\nUnknown speaker\n\nAnd then in terms of the sales channel mix, how has the breakdown developed between your own Thorne website and Amazon over the course of the year? And should we expect any changes to that mix going forward?\n\nPaul Jacobson -- Chief Executive Officer\n\nMichelle, go ahead.\n\nMichelle Crow -- Chief Marketing Officer\n\nYes. So philosophically, we want to be where our customers are and where they purchase products. So overall, we're kind of channel agnostic. However, we do believe that we can deliver the best customer experience on thorne.com.\n\nSo that's where we focus on driving the most users, and we also have slightly better economics there. However, we're really looking at holistically where we can drive the best thing for our buck in terms of acquisition and retention and improvement in LTV. And so from that perspective, we're really focused on growing TUC as a whole channel.\n\nUnknown speaker\n\nGot it. Thanks. And then just as one final question from our side. Thanks again on the updates on OneDraw.\n\nI know you guys said that you're going to be providing some updates later on this year, but is there anything you can discuss in terms of what we might expect in terms of timing for the other necessary approvals to have one drug brought to the market more at scale?\n\nPaul Jacobson -- Chief Executive Officer\n\nYes. So specifically, what you're referring to is our ability to get this thing cleared as a direct-to-consumer device. And we've said repeatedly that this was going to be really important to us. I think I've previously indicated that we expect to have it cleared sometime toward the end of this year.\n\nI think that's going to be delayed. We had a meeting -- by just a little bit. So we had a meeting recently and the timeline we put on it was six months. So we're kind of looking in that six-month range, so we'll see into early next year for direct-to-consumer clearance.\n\nWe have, however, initiated our first offering with the device specifically for doctors. So there's been a big business in food allergy testing, utilizing a methodology that we thought was highly suspect. And our team put -- which is IGG. And yes -- it's IGG, right, that's the one that's been used.\n\nNo, IGG is what I'm saying. Yes. So IGG is the one that's been used that we think is highly suspect. And we've come up with an IGG test with the device that we're going to be marketing to physicians to start until this thing is cleared.\n\nUnknown speaker\n\nGot it. Thank you for the questions.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nThomas Wilson -- Vice President, Investor Relations\n\nPaul Jacobson -- Chief Executive Officer\n\nBryan Conley -- Chief Financial Officer\n\nSean Dodge -- RBC Capital Markets -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nMichelle Crow -- Chief Marketing Officer\n\nUnknown speaker\n\nMore THRN analysis\n\nAll earnings call transcripts"
}