{
  "companyName": "RxSight, Inc.",
  "companyTicker": "RXST",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/rxsight-inc-rxst-q2-2022-earnings-call-transcript/",
  "content": "RxSight, Inc. (RXST 4.28%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to RxSight second quarter 2022 earnings conference call. [Operator instructions] I would now like to hand the conference over to your speaker for today, Alex Huang. You may begin.\n\nAlex Huang -- Investor Relations\n\nThank you, operator. Presenting today are RxSight President and Chief Executive Officer Ron Kurtz and Chief Financial Officer Shelley Thunen. Earlier today, RxSight released financial results for the three and six months ended June 30, 2022. A copy of the press release is available on the company's website.\n\nBefore we begin, I would like to inform you that comments and responses to your questions during today's call reflect management's views as of today, August 8, 2022, only and will include forward-looking statements and opinion statements, including predictions, estimates, plans, expectations, and other information. Actual results may differ materially from those expressed or implied as a result of certain risks and uncertainties. These risks and uncertainties are more fully described in our press release issued earlier today and in our filings with the Securities and Exchange Commission. Our SEC filings can be found on our website or on the SEC's website.\n\nInvestors are cautioned not to place undue reliance on forward-looking statements. We disclaim any obligation to update or revise these forward-looking statements. We will also discuss certain non-GAAP financial measures. Disclosures regarding these non-GAAP financial measures, including reconciliations with the most comparable GAAP measures, can be found in the press release.\n\nPlease note that this conference call will be available for audio replay on our website at rxsight.com on the Investor Calendar page of the News & Events section on our investor relations page. With that, I will turn the call over to president and CEO, Dr. Ron Kurtz.\n\nRon Kurtz -- President and Chief Executive Officer\n\nGood afternoon, and thank you, all, for joining us. RxSight continues to establish a track record of strong year over year and sequential growth with 2022 second quarter revenue of $11.4 million, up 132% versus the year-ago quarter and up 27% versus the quarter of this year -- the first quarter of this year. Growth in the quarter was broad-based, reflecting both accelerating utilization of our light adjustable lens, or LAL, and vigorous demand for our light delivery device, or LDD. Given this performance, we're raising our 2022 full year revenue guidance to a range of $44 million to $46 million, which implies a 95% to 104% growth rate versus 2021.\n\nRxSight is focused exclusively on the attractive high growth premium IOL market, where our unique clinical approach is beginning to take hold and gain share. Our proprietary system delivers outstanding outcomes that consistently exceed the exacting expectations of private pay patients who want excellent vision without glasses or compromises. These outcomes in turn provide doctors the confidence and peace of mind to offer our LALs to an increasing number of their premium cataract patients. Leveraging these significant competitive advantages, we're building an efficient razor-razor blade commercial model designed to drive sustained growth, expand margins, and create long-term value for shareholders.\n\nOur second quarter performance underscores the strides we're making to execute this growth strategy, starting with driving LAL adoption. During the second quarter of 2022, doctors implanted 5,400 new LALs, representing an increase of 196% versus a year-ago quarter and 30% versus the first quarter of 2022. The momentum in LAL utilization reflects a number of powerful benefits doctors and patients derive when they choose our technology. First, our LAL allows surgeons to precisely adjust each patient's refractive correction to meet that person's individual lifestyle needs and visual preferences.\n\nWithout increasing the risk of troubling side effects like glare, halos, or loss of contrast if common with other premium IOLs. Second, all other premium IOLs require the doctor to select a lens type and power before surgery, committing the patient to a specific visual approach and uncertainty as to whether their goals will be met. Conversely, the LAL removes this high stakes preoperative guesswork by allowing patients to test drive their vision as the IOL power is adjusted after surgery. Third, the LAL addresses a broad-based population.\n\nThe ability to correct astigmatism and sphere in the same increment as glasses or with about twice the precision of other premium IOLs, makes it attractive across the board, including to perfectionists, to those who are on the fence regarding premium IOLs, as well as to patients who are worried about side effects, like glare and halo. And fourth, the LAL delivers clinical results that are superior to those reported for competitive products. In our FDA clinical trial, 70% of LAL patients achieved 2020 or better uncorrected visual acuity without classes, while in similar trials of other premium IOLs, only about 40% of patients met this performance level. Moreover, subsequent real-world LAL data continues to reveal excellent reliable outcomes with a recent follow-up reading of 51 patients demonstrating 82.4%, achieving 2020 or better vision without glasses.\n\nEach of these are important attributes to not only help doctors deliver optimal care to individual premium cataract patients, but also help them increase practice revenue and profitability. Our clinical field and customer service teams play a critical role in the adoption process by working closely with every new account to ensure that doctors, technicians, and staff members are fully trained proficient providers, who can offer the LAL to patients with confidence. Quarter back by our recently established 18-person LAL account managers, our team engages with practices on an ongoing basis to assist with patient awareness and education programs, development of efficient patient flow processes, data analysis on LAL outcomes and other referral and traffic building initiatives. The continued expansion of our LDD installed base is essential to driving robust LAL utilization and to executing our overall growth strategy.\n\nThe LDD is used to administer brief in-office light treatments that induce the precise postoperative changes to the focusing power of the LAL. During the quarter, we sold 49 new LDDs to the network of clinical sites offering these postoperative LAL treatments. With these new second quarter placements, our installed base rose to 294 units, up 126%, compared to the year-ago quarter of 130 units and up 23% versus the first quarter of 2022. Importantly, the vast majority of LDD units sold in the second quarter were to new customers, signaling a continued -- a continuation of favorable LAL adoption trends and the increasing productivity of our recently expanded 20-person LDD sales team.\n\nThis team is focused primarily on the roughly 3,000 U.S. cataract surgeons who perform approximately 70% of premium IOL procedures. You'll recall that we are planning to launch a lower cost to manufacture LDD, which will have the same functionality and performance as our current model. As we reported in June, the FDA requested some additional data added to our submission, which we will provide.\n\nConsequently, we now anticipate approval in the first half of 2023 with launch early in the second half of next year. Since supply chain pressures continue, particularly for chips and other components, we will continue to bring in inventories for the lower to cost to manufacture LDD when available from suppliers to ensure we have supply. Since in this environment, suppliers will divert inventories on order to other customers if we do not take them when ready. In about 60 days, we head to Chicago for the American Academy of Ophthalmology annual meeting.\n\nWe have numerous LAL awareness building programs planned and expect RxSight technologies to be featured in a number of certain presentations. In addition, we will host a roundtable discussion on October 1 for members of the investment community attending AAO. The session will feature leading surgeons who will discuss their experience and insights regarding the LAL system. To summarize, we believe RxSight is well-positioned to succeed in the high-growth private pay premium IOL market.\n\nOur second quarter performance reveals the solid inroads we're making to establish a durable LDD installed base and drive sustained utilization of the LAL. We expect these favorable trends to continue as our newly expanded commercial organization becomes even more cohesive and productive and as an increasing number of doctors and patients recognizes significant advantages of our unique technology. With that, I'll turn the call over to Shelley for an overview of our second quarter 2022 financial results and full year guidance.\n\nShelley Thunen -- Chief Financial Officer\n\nThank you, Ron, and good afternoon, everyone. As Ron noted, total revenue in the second quarter was $11.4 million, increasing 132% compared to the second quarter of 2021 and 27% compared to the first quarter of 2022. By product line, the 49 LDDs in the second quarter of 2022 generated revenue of $5.7 million. This compares to 25 LDD unit sales for $3 million in revenue in the second quarter of 2021, representing growth of 96% in units and 92% growth in revenue.\n\nCompared to the first quarter of 2022, we sold 40 LDDs for $4.6 million in revenue. Our second quarter 2022 LDD placements rose 23% and a corresponding revenue rose 24%. The LDD ASP was approximately $116,000 in the second quarter of 2022 versus approximately $119,000 in the year-ago period. There was a slight sequential increase in LDD ASP from approximately $114,000 in the first quarter of 2022, when we offered preferred pricing to several accounts purchasing multiple units.\n\nWe sold 5,400 LALs in the second quarter of 2022, generating $5.3 million in revenue. This compares to 1,825 LAL unit sales for $1.8 million in revenue in the second quarter of 2021, representing year-over-year growth of 196% in units and 198% in revenue. In the first quarter of 2022, we sold 4,166 LALs for $4.1 million in revenue, representing quarterly sequential growth of 30% for both units and revenue. In the second quarter of 2022, LAL sales represented 47% of total revenue.\n\nIn the second quarter of 2021, LAL sales represented 30% -- 37% of total revenue. The favorable shift in revenue mix reflects rising utilization of the LAL. In the first quarter of 2022, LAL sales accounted for 46% of revenue, similar to the second quarter. As Ron indicated, we believe multiple factors are driving strong LAL sales growth, including the recent expansion, and increasing productivity of our commercial teams, the ongoing growth of our LDD installed base and fundamental clinical benefit of our technology compared to competing premium IOLs.\n\nWe believe COVID had less of an impact than in previous quarters with minimal interruptions to RxSight practices, surgery schedules, which are typically booked one to three months in advance. Second quarter gross profit was $4.8 million or 42% of revenue, compared to a gross loss of $800,000 or 17% of revenue in the second quarter of 2021. Recall in the second quarter of 2021, we recorded a $1.7 million inventory write-down in anticipation of the full rollout of ActivShield in the third quarter of 2021. The second quarter gross profit of $4.8 million or 42% of revenue was in line with the first quarter of 2022 with $3.8 million of gross profit and 42% of revenue.\n\nSelling, general and administrative expenses in the second quarter of 2022 were $14.4 million, up 121%, compared to the $6.5 million in the year-ago quarter and up 5.6% compared to the $13.6 million in the first quarter of 2022. The quarter-over-quarter increase was primarily due to increased headcount in sales and marketing as we built our sales force from six at the time of our IPO in July of 2021 to 38 today. Increased costs to operate as a public company and an increase in stock-based compensation. The sequential increase of 5.6% from the first quarter of this year was related primarily to increased travel and headcount in sales and marketing.\n\nResearch and development expenses for the second quarter of 2022 were $6.2 million, down 5.6%, compared to $6.6 million in the year-ago quarter and down 7.8% compared to $6.7 million in the first quarter of 2022. As noted in previous calls, research and development costs, which include clinical and regulatory, can fluctuate quarter to quarter based on the timing of utilizing research and development materials and clinical studies. The $0.5 million decrease sequentially was primarily due to reduced testing materials. We reported a net loss in the second quarter of $16.7 million or a loss of $0.61 per basic and diluted shares using weighted average shares outstanding of 27.6 million shares.\n\nIn the second quarter of 2021, our net loss was $13.5 million or $3.28 and $3.53 per share on a basic and diluted basis, respectively. I would also like to highlight the non-GAAP disclosure in the press release for the non-cash stock-based compensation expense as it provides investors with useful comparative information. Stock-based compensation in the second quarter of 2022 was $2.9 million, resulting in a non-GAAP loss of $13.8 million or a loss of $0.50 per basic and diluted share. Moving to the balance sheet.\n\nWe ended the second quarter of 2022 with $128.6 million of cash, cash equivalents, and short-term investments. Long-term debt was $39.9 million. Today, we filed an S-3 registration statement commonly called the shelf registration with the SEC to register shares with a value of up to $200 million. The filing included in at-the-market or ATM, that allows us through our broker to offer and sell from time to time shares of our common stock up to an aggregate offering price of $50 million.\n\nWe believe it is prudent to have the S-3 and ATM in place for future use to fund our growth initiatives for several years. While we have not made any determination regarding the timing and amount of any sales, we will continue to monitor our capital needs and market conditions. The ATM will be effective for a period of three years. Turning now to guidance.\n\nAs Ron indicated, we increased our 2022 revenue guidance to a range of $44 million to $46 million. Our updated revenue range implies year-over-year growth of 95% to 104% and compares to prior guidance of $41.5 million to $45.5 million. We expect the usual seasonality patterns in 2022 with the second and fourth quarters generally the strongest for capital equipment, or LDD, and for softer LAL procedure volumes in the third quarter, as doctors and patients take time off during this summer. We are also increasing our gross margin guidance to a range of 37% to 38% of revenue versus the prior guidance range of 35% to 36% of revenue.\n\nWhile our gross margin for the first-half 2022 was 42% of revenue, we expect higher LDD material costs in the second half of the year as compared to the first-half 2022. And as supply chain constraints continue to increase our material costs. While we've been able to secure the necessary materials to manufacture the LDD and meet growing customer demand, we continue to face supply chain constraints and inflationary pressures exacerbated by the latest cohort related shutdowns in China and the war in Ukraine. Our operations team has navigated this situation successfully thus far, and we continue to monitor our supplier channels and work closely with our suppliers to mitigate disruptions whenever possible.\n\nMoving on, we are narrowing our operating expense guidance range to $88 million to $90 million, compared to prior guidance range of $86 million to $90 million. While R&D spending will rise in 2022 versus 2021, our largest spending increases will be in SG&A related to increased headcount in our sales and marketing and commercial organizations, growing customer demand to participate in Phase 4 studies and full year costs associated with operating as a public company. We maintain our estimate for non-cash stock-based compensation in the range of $12 million to $13 million for 2022, compared to $7.6 million in 2021. Now I will turn the call back to Ron for closing remarks.\n\nRon Kurtz -- President and Chief Executive Officer\n\nThank you, Shelley. Just over a week ago, we marked the one-year anniversary of RxSight's initial public offering. It's been an exciting and eventful year for the organization as we navigated our way as a newly public company, a process made even more interesting by an often volatile stock market, a protracted global pandemic, global supply chain shortages, and persistent macroeconomic headwinds. I'm very proud of the RxSight team and the significant progress that we have made, together with our customers, to advance our technology and build a strong and vibrant company.\n\nOver the last four quarters, we have grown our LDD installed base by 164 units or 126%, guided dramatic growth in LAL adoption for 14,500 new LAL implantations, representing an increase of 122%. Enhanced, the LAL's ease of use with the addition of ActivShield technology established a formidable collaboration with more than 80 RxSight practices to collect and share a wealth of useful clinical data stored on practice LDDs, expanded the size and scope of our commercial team to effectively target premium IOL surgeons while helping existing customers take full advantage of our unique technology and deliver triple-digit growth in quarterly revenue while managing expenses, in line with expectations and building a healthy balance sheet. I want to acknowledge the dedication, professionalism, and hard work of our growing RxSight team for these and other accomplishments over the last year. Looking forward, I've never been more confident in our ability to expand and lead the fast-growing premium IOL market with our unique clinical system, capable of providing every patient with the highest-quality vision.\n\nAnd now operator, please open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Ryan Zimmerman with BTIG. Your line is open.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nHi. Good afternoon. Thanks for taking our questions, and congrats on all the progress. Maybe to start, the LDD numbers were certainly strong.\n\nRon, I appreciate your commentary just about kind of the installed base and what you say is kind of the changing characteristics or the changing nature of the customer today versus maybe 12 months ago when we thought of them as early adopters and kind of how you're seeing the technology kind of permeate the broader premium segment?\n\nRon Kurtz -- President and Chief Executive Officer\n\nThank you, Ryan. So I think we're still in the earlier phases of adoption. We're still -- even with the numbers that we have. However, we do see continued development of the installed base with customers that may not be the early innovators or early adopters, but those a little bit later on that early phase for early maturity.\n\nAnd the characteristics of those are typically more focused on making the technology work effectively from a business practice standpoint. And I think generally, we see that many of these practices are perhaps more prepared to implement the technology. And of course, we continue to get better at helping them so that they can start faster out of the gate. Go ahead, Ryan.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nNo, that's very helpful, Ron, and I appreciate the commentary. I guess to dovetail off of that question, I mean, the units per system as you think about kind of the productivity metrics of the installed base continue to go up, right? And we're starting to see it hitting a new high this quarter. And I'm curious kind of as you move into the early majority segment, how do you think about productivity? And not just in the context of the installed base, but I'd love to get your thoughts about the sales force because you've added more on the capital equipment side than, say, the account managers on the LAL side. And as the installed base grows, do you need to add more on the LAL side to manage and help shepherd customers to maintain some of these higher utilization rates.\n\nThanks for taking my questions.\n\nRon Kurtz -- President and Chief Executive Officer\n\nYeah. So in terms of the sales force, our LDD sales force is 20 individuals, our LAL account managers is 18. So they're fairly closely delayed, and they work closely together. When we -- if you could just repeat that first part of your question.\n\nI'm sorry.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nSure. No problem. So I guess my question is just how do you maintain the utilization going forward? Do you have to kind of grow the LAL sales force? And just your comments about kind of where the utilization you think can go over time, irrespective of sales force dynamics?\n\nRon Kurtz -- President and Chief Executive Officer\n\nYeah. I think one thing that you need to consider is that that -- while that number is LALs per LDD is readily accessible, it really is a complex -- more complex picture, because it reflects not only the -- our adoption, but it reflects just things about the practices. How many premium IOLs they're doing, how many overall cataracts doing. And our goal is really focused on penetrating the entire market, whether that's -- obviously, we try to focus on those people who are doing more premium, but we want to really penetrate the entire market and allow customers to offer this to as many patients as possible.\n\nSo that number has some complexity to it. It's -- we certainly believe that our LAL account managers have and will continue to have an important impact on that number, along with our clinical trainers. We're building this infrastructure that didn't exist before for postoperative light treatments in order to deliver these clinical results that also didn't exist before. And that is an investment that -- we're making is an investment that our customers are making, and we anticipate that that will continue to pay off over time.\n\nShelley Thunen -- Chief Financial Officer\n\nYeah. Can I add something, Ron? So the way we look at the LAL volume is there's kind of three primary ways we grow LAL volume. And if you want to talk about -- whether you're talking about number of LALs per LDD, because that is readily accessible. But as we go into the accounts, our first goal with new customers is to get them to take up quickly, do more cases in the first couple of weeks, get going on their sales and the marketing.\n\nAnd what we are finding with our new sales forces, both the LDD and LAL, our newer customers are very well prepared to launch. And I think that's important. And then with existing customers, we continue to go back to them, because if we're not holding 100% of their premium volume, which we don't, we want to give them an opportunity and tools to make sure that they can increase their LAL penetration, because it is the best clinical outcome for their patients. And then we go in to practices that have multiple doctors, they have the infrastructure set up, and it might be one or two doctors that are really driving volume, and this gives their partners an opportunity to start doing premium if they're not doing premium or to increase their premiums.\n\nRyan Zimmerman -- BTIG -- Analyst\n\nThank you, both, for the answers. Appreciate it.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from the line of Robbie Marcus with J.P. Morgan. Your line is open.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nOh, great Thanks for taking the questions, and congrats on the good quarter. Maybe to start, you beat sell-side consensus by $600,000. You raised the midpoint of the range by $1.5 million. Just maybe speak to where you're seeing the most confidence to raise numbers more than the beat.\n\nAnd are you comfortable with the spread of third quarter versus fourth quarter that The Street is currently modeling?\n\nShelley Thunen -- Chief Financial Officer\n\nOK. That's kind of a multipart question. So I'll answer your first question first. While we feel very confident on both our LDD and LAL numbers, what we have seen is the LALs have increased pretty rapidly.\n\nAnd we've gotten good penetration in the last couple of quarters. I think we are confident in the spread, it's not that big, it's only $2 million before our low-end and our high-end of guidance. But I think that we continue to think that we'll see some seasonality in the third quarter, and the fourth quarter will be probably our strongest quarter for both LDD revenue and potentially, obviously, for the fourth quarter for LAL as well, because we'll be adding to our customer base.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nGreat. And Shelley, you did the $50 million ATM today. Do you think that's all we'll see in terms of capital raises in the near to mid-term? And should that be enough to get you to breakeven? Thanks a lot.\n\nShelley Thunen -- Chief Financial Officer\n\nSo I think that, of course, some of this is good housekeeping. Obviously, a year after we went public, we can file for an S-3 registration statement. The ATM is good for three years. We currently have a nice cash balance with $128 million in cash and just under $40 million in debt.\n\nOf course, we wouldn't pay back our debt until we got profitable or got closer to profitability. And I think really using the ATM will be -- at this point in time, will be opportunistic, it really depends on how the market performs and whether it's the right timing to do so as well. So I wouldn't necessarily say we're going to do it tomorrow, but I wouldn't say we wouldn't either if the timing was good. And we have not yet commented on when we would hit breakeven.\n\nBut this gives us potentially in addition to the $20 million line of credit that we can draw on next year in 2023, the ability to add $70 million to our balance sheet based on hopefully investor interest in investing in the company.\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nGreat. Thanks a lot.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Larry Biegelsen with Wells Fargo. Your line is open.\n\nLei Huang -- Wells Fargo Securities -- Analyst\n\nHi. This is Lei calling in for Larry. Thanks for taking my questions. Can we talk about the gross margin for a minute? So Shelley, you talked about the gross margin stepping down from 42% in the first half to we're getting to kind of the low-30% in the second half? Any color you can provide as far as the cadence from Q3 to Q4? And if there are any implications for gross margin beyond 2022? I mean, you mentioned higher input cost for LDD.\n\nIs that something you can pass along to the customers? And then I have a follow-up. Thanks.\n\nShelley Thunen -- Chief Financial Officer\n\nGreat. So I'm trying to start at the end of your question. Is it something that we're planning on passing on to customers? No. Capital equipment is pretty rare.\n\nTo raise your capital cost over time, particularly as you get deeper in. And we certainly wouldn't sacrifice new accounts to improve our margin ever so slightly on the capital, right? The most important thing is to get that installed so that we can in turn sell our higher -- our more profitable line, which is the LAL, and it has much better gross margins as well. So we wouldn't increase prices. I do think that as we look at the margin mix between quarter, it really depends.\n\nWe have very high mix of LALs in the first half of this year. We initially had guided that we would have somewhere between 50% and 60% LDD. And it's been a little stronger on the LAL side. And so that's driven the margin up.\n\nAs well as the fact you have first in first out on material, and so as we've continued to buy, it become more expensive. I think that what we're going to see between the third and fourth quarter is really just based on mix. But we will have -- as we've continued to buy, it's become more expensive. I think that what we're going to see between the third and fourth quarter is really just based on mix.\n\nBut we will have higher LDD costs as we go in -- as we move into 2023, as Ron mentioned, we will continue selling through probably the first half of 2023. And recall, of course, that, it's the same functionality, it's just that we designed a new LDD to lower the cost and normalize our margins.\n\nLei Huang -- Wells Fargo Securities -- Analyst\n\nGot it. That's helpful. And then if I can ask on the new LDD, can you share anything as far as what you have to -- what information you have to give to the FDA and also what gives you the confidence that you'll have that information in time for a first-half '23 approval? And if I can just tap on there, any other R&D priorities you would highlight for the next 12 months? Thank you.\n\nRon Kurtz -- President and Chief Executive Officer\n\nYeah. Thank you. So we don't disclose our interactions with FDA, but the amount of information that's been asked is relatively limited, and we feel confident that we'll be able to address that shortly. The FDA, of course, has 180 days to respond.\n\nAnd so that's really what drives the time line. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from the line, one moment, David Saxon with Needham & Company. Your line is open.\n\nJoseph Conway -- Needham and Company -- Analyst\n\nHello. This is Joseph on for David. I guess maybe first, just trying to get a little bit more of a clear sense of the adoption curve. We'd love to hear maybe what portion of the higher volume practices you're initially -- we're initially targeting that you've been able to engage with.\n\nI guess, like what's the sell-through rate or of the doctors that you guys consider prospects, what percent end up getting in LDD?\n\nRon Kurtz -- President and Chief Executive Officer\n\nYes. So the -- overall, the market scope numbers suggest that there are about 3,000 surgeons who are doing the vast majority, 70% or so of the premium IOL procedures in the U.S. And that is our primary market currently. It's difficult to get individual numbers about how many premium cases each one and their penetration of premium.\n\nBut obviously, our focus is on those practices that do more premium, that's where -- those are the ones that can have the -- by adopting our technology can have a very quick ROI. But we also appeal to customers who are trying to adopt -- trying to get into the premium game and who may have been not unable to do so, either because they didn't believe in the previous technologies, such as with multifocal lenses, or because they didn't have access to excimer lasers and LASIK for which they could touch up patients that were unhappy with their clinical results.\n\nJoseph Conway -- Needham and Company -- Analyst\n\nOK. That's helpful. And maybe just adding on to that a little bit more. Do you have a sense from the higher volume accounts, whether you're taking share in the premium IOL category or if it's more just increasing premium penetration overall? And then I have one more after that, if possible.\n\nRon Kurtz -- President and Chief Executive Officer\n\nYeah. It's a good question. We did a survey. It's now about a year old, but it looked at where LAL patients were coming from.\n\nAnd about one-third of them were patients that would have otherwise received a monofocal conventional IOL, about one-third would have received a toric or astigmatism correcting IOL and about one-third would have gotten a presbyopia correcting IOL. And so with typical pricing, two-thirds of those customers are customers who either would have provided no additional revenue to the practice or significantly lower revenue beyond Medicare payments to the practice. So we see really a mixture. We're -- we believe that we're growing the market by being able to offer high quality vision to a broad spectrum of patients, but also obviously taking some market share from other technologies.\n\nJoseph Conway -- Needham and Company -- Analyst\n\nOK, great. That's very helpful. And then I guess maybe just talking on the AAO conference coming up. I wanted to know if you guys maybe saw an uptick in LDD placements following any previous conferences like ASCRS earlier this year? And I guess, if so, if you expect to see a benefit in the fourth quarter following that conference.\n\nRon Kurtz -- President and Chief Executive Officer\n\nI would say that the conference is, of course, over the last few years, the conferences have been impacted considerably by COVID. We're starting to see numbers come back to what we're used to in terms of attendance. They still remain an excellent opportunity for us to educate doctors and for doctors to educate their peers and interact with their peers and learn about our technology. And that's really the biggest factor is just peer-to-peer interactions that lead to increased awareness not only of the clinical results, but also of the economic potential for the technology.\n\nAnd of course, that leads ultimately to more sales, but the timing of that depends a lot on when the meeting is in the quarter and a lot of other factors.\n\nJoseph Conway -- Needham and Company -- Analyst\n\nOK, great. That makes sense. Thank you very much, and congrats on the quarter.\n\nRon Kurtz -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. I'm showing no further questions in the queue. I would now like to turn the call back over to Ron Kurtz for closing remarks.\n\nRon Kurtz -- President and Chief Executive Officer\n\nGreat. Thank you, operator, and thank you, all, for your time and attention today and for continuing your interest in RxSight. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlex Huang -- Investor Relations\n\nRon Kurtz -- President and Chief Executive Officer\n\nShelley Thunen -- Chief Financial Officer\n\nRyan Zimmerman -- BTIG -- Analyst\n\nRobbie Marcus -- J.P. Morgan -- Analyst\n\nLei Huang -- Wells Fargo Securities -- Analyst\n\nJoseph Conway -- Needham and Company -- Analyst\n\nMore RXST analysis\n\nAll earnings call transcripts"
}