{
  "companyName": "Invitae",
  "companyTicker": "NVTA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/invitae-nvta-q3-2022-earnings-call-transcript/",
  "content": "Invitae (NVTA 2.20%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nHello, everyone, and thank you for joining the Invitae's third quarter 2022 financial results conference call. My name is Darius, and I'll be the operator for today. [Operator instructions] I now have the pleasure of handing you over to your host, Hoki Luk. Please go ahead.\n\nYour line is now open.\n\nHoki Luk -- Head of Investor Relations and Capital Markets\n\nThank you, operator, and good afternoon, everyone. Thank you for joining us for our 2022 third-quarter results call. Joining us today are president and CEO, Ken Knight; and our CFO, Roxi Wen. Before we begin, I'd like to remind you the various remarks that we make on this call that are not historical, including those about our vision and business model, the company's strategic business realignment, future financial and operating results, expectations of future growth and reduction in burn rate and future products, services, our product pipeline, and the timing constitute forward-looking statements within the meaning of the safe harbor provision of the Private Securities Litigation Reform Act.\n\nIt is difficult to accurately predict demand for our services, and therefore, our actual results could differ materially from our stated outlook. Statements on future company performance assumes, among other things, so we don't conclude any additional business acquisitions, investments, restructuring, or legal settlements. We refer you to our most recent 10-Q, in particular to the section titled Risk Factors for additional information on factors that could cause actual results to differ materially from our current expectations. These forward-looking statements speak only as of the date hereof.\n\nAs you listen to today's conference call, we encourage you to have our press release available, which includes financial results, as well as key growth metrics, and commentary on the quarter. To supplement our consolidated financial statements prepared in accordance with generally accepted accounting principles in the United States or GAAP, we monitor and consider several non-GAAP measures. We encourage you to review our GAAP to non-GAAP reconciliations, which are available in the press release and in the appendix of the earnings slide deck, both of which you can access by visiting the Investors section of the company's website at ir.invitae.com. Today, Ken and Roxi will discuss Q3 highlights, the continued execution of our realignment plan, updates within our portfolio, financials, and key metrics of the third quarter, including our guidance, and concluding the call with Q&A.\n\nWith that, I'll turn the call over to Ken.\n\nKen Knight -- President and Chief Executive Officer\n\nThank you, Hoki, and thank you all for joining us today. Let me start with an overview of our third-quarter performance, which shows solid operational execution against our realignment plan. We're proud of our team's ability to continue to deliver and appreciate their passion for our patients, our mission, and our future. We're working hard and are encouraged by the financial and operational results of this quarter.\n\nRevenue for the quarter was $133.5 million, growing almost 17% year over year. This was paired with further improvement in our gross margin with non-GAAP gross margin of 45.9% in the quarter compared to 35.6% in Q3 2021 and 40.1% in Q2 2022. We are well on track to achieve our full-year non-GAAP gross margin forecast of 42% to 43%. Additionally, our efforts to reshape our cost profile has good momentum and is reflected in the reduction of our non-GAAP operating expenses to roughly 112% of revenue compared to 176% of revenues in Q3 2021 and 146% of revenues in Q2 2022.\n\nThis work helped us to reduce our cash burn to $108 million in the quarter if we exclude one-time nonrecurring items compared to $169 million cash burn in Q1 2022. Roxi will provide an update later on how we see cash burn for the full year 2022. The reduction in cash burn to $108 million represents an annualized run rate reduction of approximately $245 million from Q1 and reinforces that we are on track to deliver the $326 million in cash burn reduction fully realized in 2023. We have made the tough but necessary workforce decision with notifications and reductions pretty much completed as planned.\n\nWe've also made headway in consolidating our office and lab footprint, including steps to reduce underutilized office space. Regarding the consolidation of our geographic footprint, we have exited all impacted international territories prior to the end of September. In Q3, our ex-U.S. business positively contributed to our improvement in non-GAAP gross margin.\n\nFinally, our portfolio optimization work has begun, and we have taken steps to consolidate our offering, including exiting our pre-implantation products for IVF and exiting other underperforming products and accounts. We continue to pursue divestiture or wind down of our distributed kits business, but not much more to report on that at this point. So, in summary, we are on track to deliver the $326 million of cash burn reduction. Now, turning to core product areas.\n\nIn hereditary cancer, the Invitae brand is trusted and valued. We generated an enormous amount of compelling data, and we've used that data to drive changes in guidelines and coverage policies, resulting in broader clinical adoption and more consistent reimbursement. Our most recent contribution includes an Invitae publication in JAMA, underscoring the American Society of Breast Surgeons guidelines, recommending that all breast cancer patients receive genetic testing. We also recently highlighted NCCN's decision to expand guidelines in CRC, advocating for universal germline testing for all colorectal cancer patients past and present.\n\nHereditary cancer testing is still underpenetrated with some estimates as low as 10% to 20% of potential patients being tested. In addition to expanding adoption, we have additional initiatives underway to bring product enhancements and improved workflows for more access and ease of use. We intend to keep the momentum going with the genetic council or community and are expanding our call points to nongenetic experts with a focus on workflows, education, and decision support and pursue the very best outcomes for patients. Our hereditary cancer offering is our highest revenue business with a margin profile well above our corporate average.\n\nAnd our goal is to leverage this to extend offerings into the somatic space. The most recent addition to our somatic offering is our minimal residual disease product. We call it personalized cancer monitoring, or PCM, which is powered by our proprietary AMP technology. As many of you are aware, getting somatic testing incorporated into patient care is a massive opportunity.\n\nThere are over 18 million cancer survivors in the U.S., and it's estimated that there are nearly 2 million new cases diagnosed each year. The total addressable market for MRD is $20 billion to $30 billion and is still in the early stages. Widespread clinical use is still on the horizon, and we are actively working through the steps necessary to further facilitate the adoption of our PCM, engaging with clinicians, key opinion leaders, and payers. Our goal is to continue to demonstrate the utility of PCM to combine it with our other oncology insights and to be positioned to enable cancer-treating physicians to advance precision oncology in an effort to move cancer into a chronic disease.\n\nPCM will provide the speed and accuracy to detect cancer sooner, thus reducing the downstream cost of care and improving patient outcomes. While we're working through reimbursement options in clinical trial results, we are supporting a growing number of top biopharma companies and academic medical centers who are partnering with us via fee-for-service arrangement to conduct research and generate revenue. Moving on to women's health. Recent guideline expansion recommending screening for all pregnancies, including average risk, has created a meaningful tailwind to us and to this segment with a TAM of over $2 billion.\n\nAs part of our operational shift, we've exited channels with lower-quality revenue, as well as implemented better reimbursement practices internationally. In the U.S., changes in our billing policy, improve calls performance and better discipline in our contracting have eliminated several underperforming aspects of this business. These factors together have taken our women's health non-GAAP gross margins from deeply negative to positive, and we expect continued improvement into next year. We're sharpening our product positioning, which includes new core and expanded panels, and we are also tapping into additional women's health channels, including OB/GYNs and breast surgeons to expand hereditary cancer testing.\n\nOn the rare disease and data side of our business, we are seeing growth opportunities bridging our testing and data collection. Our testing business gives us access to multiple disease population and hundreds of clinician relationships. We now have an emerging capability to combine genomic and phenotypic data, including real-world evidence, and are seeing an enthusiastic response to this capability among patients, advocacy groups, researchers, and biopharma partners in the rare disease area. We are excited about the growth of our recent partnerships with Praxis.\n\nWe used our platform as natural history data to support their IND application for the treatment of pediatric epilepsy and with AstraZeneca, who is using our platform for real-world data in the research of a rare bile duct cancer. While currently, a small part of our total revenue, our data segment is a high-growth, high-margin and scalable business, and there are more opportunities in our pipeline. By the way, recent findings in JAMA demonstrate that a positive epilepsy genetic diagnosis leads to clinical management changes in approximately half of patients, and the changes implemented by clinicians based on genetic testing, improve health outcomes and as many as three-quarters of patients. This will help adoption and reimbursement of our epilepsy genetic testing product.\n\nWith that, I'll turn it over to Roxi for financial highlights of our most recent quarter.\n\nRoxi Wen -- Chief Financial Officer\n\nThanks, Ken. In the third quarter of 2022, we generated approximately $134 million of revenue, and the breakdown was as follows: approximately $79 million from oncology, including germline testing, therapy selection, and PCM services offered to the pharmaceutical partners, representing a 12% growth over the prior year; approximately $25 million from our women's hub offerings, including NIPS, carrier and other reproductive tests, a 19% growth over the prior year; approximately $17 million from RareDx and other testing products, 17% growth over prior year. Data and patient network revenue grew 48% over last year. This includes data management, data as a service, and the partnership projects supported by the Citizen patient network.\n\nNon-GAAP gross margin was 45.9%, which is an improvement of over 1,000 basis points from the prior year and 580 basis points from prior quarter. Non-GAAP operating expenses was $150 million or 112% of revenue compared to $200 million or 146% of revenue in the second quarter of 2022 and 176% of revenue in the third quarter of the prior year. As a result of our realignment plan, we also incurred more than $125 million of restructuring and other one-time expenses, including employee separation and benefits, loss on asset disposals, and other costs. These items were excluded from our Q3 non-GAAP operating expenses in today's presentation.\n\nWe stated on our first quarter call that we plan to hold our operating expenses at a stable level. And on our July call, we further committed to reduce that figure by a significant amount going forward. Our actions, including reduction in headcount, lab and office space, third-party services, as well as exiting certain businesses and geographies resulted in operating expenses reduction of nearly $50 million from the prior quarter. We expect additional reductions to our quarterly run rate over the next two to three quarters as our broad cost-reduction efforts take effect.\n\nMoving on to cash performance. Cash, cash equivalents, restricted cash, and marketable securities totaled $596 million at September 30, 2022, compared to $737 million at June 30, 2022. Our cash position went down by about $141 million compared to the end of the second quarter. Excluding the inflow of approximately $2 million from our ATM facility, our total cash burn was $151 million.\n\nAdjusting for one-time items, including approximately $29 million related to the realignment program and $14 million related to compensation items for past M&A transactions, the cash burn for our ongoing business would be $108 million in Q3, a meaningful reduction from the run rate at the beginning of 2022. While we're nimble with our ATM financing options, we do not intend to use it to solve our debt maturities. Instead, we continue to have conversations with long-term partners who have a shared vision of our company and a desire to find a constructive solution to our balance sheet. As of now, we have close to $600 million cash, and our cash burn trajectory is heading in the right direction, aided by the efforts we put into place over the past year and accelerated by our strategic realignment.\n\nStepping to the business metrics that are intended to offer more transparency and a more consistent balanced perspective on our performance and the portfolio growth, our active accounts continue to fuel top-line growth despite active partner being relatively stable in Q3 due to our geographic consolidation and focus on higher quality revenue. The impact of these efforts will continue to be a slight headwind to this metric. However, the number of patients we served and ones who are available to share the data continue to expand, each grew roughly 48% over prior year and 10% sequentially. Our new product vitality was down slightly from previous quarters.\n\nAs a reminder, this metric represents a revenue contribution by new products over the trailing three years. As previously communicated, we saw a pullback in our numbers resulting from the slowdown in new product launches in 2020 and part of 2021. Revenue per patient measured by total company revenue divided by the number of ordering patients for the period has continued to increase as we have focused our broader efforts on achieving higher-quality revenue. Moving to operational excellence.\n\nWe're seeing continued quarter-over-quarter improvement in all categories. Cash burn had a number of one-time items in this quarter. Cash burn as a percent of revenue would have been 81%, excluding the one-time items. Moving to our financial guidance.\n\nWe're reaffirming our 2022 revenue growth and non-GAAP gross margin targets. We expect full-year 2022 revenue growth of low-double digits over the prior year and our non-GAAP gross margin to be between 42% and 43%. For the fourth quarter, as previously communicated, we project to have less revenue than the third quarter based on the fact that it's the first full quarter of operations since our realignment started in mid-July. There will also be some revenue impact depending on our final decision and the timing of that decision regarding our distributed chip business.\n\nTaking these factors and our current trajectory into consideration, we're maintaining our full-year revenue guidance of low-double-digit growth. Looking at our cash burn. We now expect full-year 2022 cash burn to be between 585 and $625 million, improvement from our previous guidance of $600 million to $650 million. Note that the cash burn guidance includes up to $75 million related to realignment activities, and this amount has remained the same as our previous guidance.\n\nWe're encouraged by our progress to date and are confident in our team's ability to deliver. Back to you, Ken.\n\nKen Knight -- President and Chief Executive Officer\n\nThank you, Roxi. With that, we'll now turn the call over to the operator for Q&A.\n\nOperator\n\nThank you. [Operator instructions] The first question comes from Tejas Savant from Morgan Stanley. Please go ahead.\n\nGaby Gabel -- Morgan Stanley -- Analyst\n\nHi. This is Gaby Gabel on for Tejas Savant. So, I was just wondering if the recent granting of preliminary injunction preventing California from enforcing a requirement of only labs contracting with them would be allowed to perform trisomy screening for California residents? And if that would affect your NIPT volumes going forward and how we should think about that impact of the NIPT providers?\n\nKen Knight -- President and Chief Executive Officer\n\nYeah. This is Ken. That's a great question. We obviously were not supportive of the direction that CDPH was taking, and so it continues to allow us to operate in the state of California with our NIPS product, which we're excited about.\n\nAnd so, as we see the broadening guidelines and expansion of guidelines and making the utility of NIPS more accessible to pregnant women, we see it as nothing but upside for us.\n\nGaby Gabel -- Morgan Stanley -- Analyst\n\nThank you. That was very helpful. And then just in terms of your hereditary cancer business, what are you seeing in terms of a shift toward expanded carrier screen panels? And what do you think are the challenges for broader adoption?\n\nKen Knight -- President and Chief Executive Officer\n\nWas the question of expanded carrier screening?\n\nGaby Gabel -- Morgan Stanley -- Analyst\n\nExpanded carrier screen panels.\n\nKen Knight -- President and Chief Executive Officer\n\nYes. So, we have some work underway actually bringing out an expanded carrier screening product here pretty soon. There's a specific utility of expanded carrier screening. It's obviously used for more complicated type of diagnoses.\n\nAnd so, we see there's a place for expanded carrier. But we don't expect that every one of our customers that are ordering carrier screening today is going to pivot to the expanded products. So, we'll have the option for our customers in the future.\n\nGaby Gabel -- Morgan Stanley -- Analyst\n\nOK. Thank you. I appreciate your time.Thank you.\n\nOperator\n\nThe next question comes from Matthew Sykes from Goldman Sachs. Please go ahead, Matthew.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nHi. This is Ivy on for Matt. Could you just talk through the new product vitality metric, which is a little lower on a sequential basis? I know last quarter, you talked about new products coming on in second half of this year. So, any update on those would be helpful.\n\nKen Knight -- President and Chief Executive Officer\n\nRoxi, why don't you take that one?\n\nRoxi Wen -- Chief Financial Officer\n\nSure. Just to -- great question. Thank you. Remind the destination is revenue contribution from our new products or either acquired or internally developed over the last three years.\n\nSo, as you indicated, the launches and the schedule and timing of launch does have an implication on this metric. We did have some product -- new product launches at the first half of this year and expect some of those revenues will come in. But we are not providing guidance for these metrics, but we do recognize that the 2020 and 2021, part of 2021 slowdown is having an impact on this metric.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nGreat. Thank you. And then could you talk to pricing dynamics you're seeing in oncology and women's health and what impact that might have on margins as we move into '23? I know you mentioned more data in hereditary cancer, which is driving reimbursements, but additional color would be helpful.\n\nKen Knight -- President and Chief Executive Officer\n\nYeah, sure. You know, for our women's health products, we've been seeing great improvement in our ability to give reimbursement. The expanded guidelines are helping immensely. Average risk is now covered pretty much with the most major -- almost all major players in the U.S.\n\nAnd so, that's having a tailwind in our average payment per test for our NIPS products. We made some decisions about pricing ex-U.S. in international marketplace. And as I said in my preamble, the benefit of that is we're seeing our ex-U.S.\n\nbusiness providing positive contribution to our gross margin expansion initiatives. So, we're seeing that working as well. So, I'd say from a pricing standpoint, where pricing changes needed to be done, we've done those, and we've seen great benefit from it. For hereditary cancer, it's been pretty solid.\n\nI mean, I think the -- as I said, our gross margin performance of our hereditary cancer product is well above our corporate average, and it's staying pretty consistent. And so, we don't see necessarily downward pressure on pricing any more than what we are doing in the marketplace. We continue to be the provider who is trying to drive more affordable, accessible access to genetic testing. So, we still believe in that part of our journey.\n\nBut the pricing in the marketplace is pretty solid. There were some concerns about PAMA, making some changes, but that's obviously been held back for now. And so, overall, we see the quality of revenue for hereditary cancer is growing based upon our reimbursement and internal policies and how we're going to market.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nGreat. Thanks for the questions.\n\nKen Knight -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Marta Nazarewicz from JPMorgan Chase. Please go ahead.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nThis is Marta on for Julia. So, as it relates to your current mix between oncology, women's health, and others, how do you see those mix is evolving over the next year, given the restructuring? And how do you see that mix settling beyond 2023? Essentially, what are some qualitative factors impacting that mix? Thank you.\n\nKen Knight -- President and Chief Executive Officer\n\nSo, simply put, as hereditary cancer product line is our highest revenue product, and it will continue to be our highest revenue product into 2023. And so, I wouldn't say there's a material shift in mix that's going to be occurring. As we are adjusting our go-to-market for our women's health, we are getting a higher quality of revenue for each of the tests that we're running. And so, that's going to provide some lift in our gross margin, but I'm not expecting it to shift our mix significantly into 2023.\n\nSo, I think our mix is going to continue to be more weighted toward hereditary cancer into 2023 and beyond.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nGot it. Thank you. And then the second question was related to the MRD product that you've mentioned. Could you just give a little bit more detail about that? And how quickly do you think it could drive penetration of that product? And what are some of the competitive advantages over the existing products in the market? Thank you.\n\nKen Knight -- President and Chief Executive Officer\n\nYeah, sure. I mean, I'll start with how we see the product itself. Again, you might recall, we have a tumor-specific product. And so, there's products that are out there that are tumor agnostic.\n\nWe have a tumor-specific product, and we provide a panel specific to the patient and the tumor that the patient has, which, we believe, is a superior product. That's number one. Our early data and analysis that we've seen is that our sensitivity and specificity are going to be top of the market in terms of how the product will perform. And so, we've done -- we're now in a period of time where we've got analytic validity and now we're going in the process of getting clinical validity of our product.\n\nAnd so, we've got several studies that are out there that are -- we expect they're going to continue to show the clinical validity of our product. And as we navigate through that, then we'll be moving to kind of getting confidence in the utility of our product and ultimately utilization and reimbursement. So, the journey is pretty well mapped out. We know how to do this.\n\nWe're just in the process of getting that done. And in the meantime, we're utilizing our fee-for-service arrangements with biopharma or academic medical centers. And we're getting good interest in our product and our PCM product. And we expect that's going to be kind of a bridging revenue opportunity for us until we get all the way to commercial utilization and commercial reimbursement.\n\nWe're pretty excited about it. So, I hope, as I was answering the question, I want to make sure you understand. We are very excited about our MRD product. And the space is, as I said, in the opening $20 billion to $30 billion of TAM, and it's still underutilized.\n\nAnd so, it's early, and we're excited to be competing in that space in the very near future.\n\nOperator\n\n[Operator instructions] It appears we have no questions registered at this moment. I'm going to hand back to the management team.\n\nKen Knight -- President and Chief Executive Officer\n\nWell, thank you, operator, and thanks, everybody, for joining us on the call today. We remain very positive about the opportunities for Invitae, and we're extremely confident in our team's ability to execute on our plans. So, we appreciate your continued support, and thank you all for joining us on the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHoki Luk -- Head of Investor Relations and Capital Markets\n\nKen Knight -- President and Chief Executive Officer\n\nRoxi Wen -- Chief Financial Officer\n\nGaby Gabel -- Morgan Stanley -- Analyst\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nMore NVTA analysis\n\nAll earnings call transcripts"
}