{
  "companyName": "UiPath Inc.",
  "companyTicker": "PATH",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/06/uipath-inc-path-q2-2023-earnings-call-transcript/",
  "content": "UiPath Inc. (PATH 0.16%)\nQ2 2023 Earnings Call\nSep 06, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings. Welcome to the UiPath second quarter 2023 earnings conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation.\n\n[Operator instructions] Please note this conference is being recorded. I will now turn the conference over to your host, Kelsey Turcotte, senior vice president of investor relations. You may begin.\n\nKelsey Turcotte -- Senior Vice President of Investor Relations\n\nGood afternoon, and thank you for joining us today to review UiPath's second quarter fiscal 2023 financial results, which we announced in our earnings press release issued after the close of the market today. On the call with me are Daniel Dines, UiPath co-founder and co-chief executive officer; Rob Enslin, co-chief executive officer; and Ashim Gupta, chief financial officer. Rob will start the discussion and then turn the call over to Daniel. After that, Ashim will review our results and provide guidance.\n\nThen we will open the call for questions. Our earnings press release and financial supplemental materials are posted on the UiPath Investor Relations website, ir.uipath.com. These materials include GAAP to non-GAAP reconciliations. We plan to discuss non-GAAP metrics on today's call.\n\nThis afternoon's call includes forward-looking statements about our ability to drive growth and operational efficiency and our financial guidance for the third fiscal quarter and fiscal year-end 2023. Actual results may differ materially from those expressed in the forward-looking statements due to many factors, and therefore, investors should not place undue reliance on these statements. For a discussion of the material risks and uncertainties that could affect our actual results, please refer to our annual report on Form 10-K for the year ended January 31, 2022, and our other reports filed with the SEC, including our quarterly report on Form 10-Q for the quarterly period ended July 31, 2022, to be filed with the SEC. Forward-looking statements made on this call reflect our views as of today.\n\nWe undertake no obligation to update them. I would like to highlight that this webcast is being accompanied by slides. We will post the slides and a copy of our prepared comments to our Investor Relations website immediately following the conclusion of this call. Before I turn the call over to Rob, I'd like to inform you, we plan to hold an Investor Day during our FORWARD 5 user conference on Tuesday, September 27, at the Venetian Hotel in Las Vegas, starting at 11:45 a.m.\n\nPacific Time, with lunch that will feature round tables hosted by our executive team. Please reach out to ir@uipath.com for registration details. Now, I'd like to hand the call over to Rob.\n\nRob Enslin -- Co-Chief Executive Officer\n\nThank you, Kelsey, and good afternoon, everyone. Thank you for joining us. Our second quarter results exceeded the high end of our guidance despite an increasing FX headwind and a choppy macro environment. ARR crossed the $1 billion mark, totaling $1.043 billion, an increase of 44% year over year, driven by net new ARR of $66 million.\n\nWe now serve more than 10,500 customers. Automation continues to be a central part of digital transformation for companies of all sizes and across all industries. We see this in the breadth of companies that continue to invest in UiPath, like ADT, Icertis, Mayo Clinic, Smartsheet, and Take-Two Interactive, which are just a few of the organizations that invested in UiPath platform in the second quarter. Our relationship with iCIMS, a leading global provider of talent acquisition software, is a good example of the power of automation.\n\nDuring the quarter, they expanded their UiPath deployment. And looking to the future, they plan to embed UiPath Automation Cloud robots and Integration Service into the iCIMS Talent Cloud to enable their customers to automate routine tasks and business processes. Success stories like these and dozens of customers and partners I have met since I joined UiPath leave no doubt in my mind that we will be the enterprise automation provider that all organizations will embrace over time. That's because we move automation beyond RPA to a full suite of end-to-end platform capabilities.\n\nOur PostFinance AG win says it better than we do. PostFinance, a retail financial institution in Switzerland, has been on its automation journey for three years with a competitor in RPA and another in process mining. Driven by a search for more efficient automation platform with a wider scope, they determined that UiPath platform is the one in the market that can fulfill all their current and future needs while significantly reducing the total cost of ownership for their automation program and helping them to achieve their strategic goal to become more efficient. Our platform not only allows customers to discover automation opportunities but also redesign and improve previously disjointed processes, bringing them from the endless cycle of outdated approaches and unlocking the true digital transformation.\n\nDigital transformation is one of the most important secular trends, and UiPath platform is central for companies to reach their goal. Over and over, the executives tell me that automation has accelerated their business, improved their customer and employee experience, increased speed to value, and allowed them to redeploy capital. These kinds of outcomes, our customer discussion from the RPA center of excellence, which is automating process by process, to the C-suite executives, we have a holistic view of enterprise requirements. A great example of this evolution is a U.S.-based global power technology leader, a customer since 2018.\n\nThey've automated over 160 processes across finance, supply chain, HR, IT, and shared services, saving over $4 million. Now with the C-suite sponsorship, they have expanded their programs to the full UiPath platform, both on-premise and in the cloud, and are launching a citizen development and a tendered automation program. My takeaway from the last few months is that the market is clearly evolving, and UiPath is driving that evolution. We have a first-mover and a technological advantage.\n\nAnd as an automation leader, we continue to expand the value we can deliver for our customers. That being said, while we believe our business has considerable room to grow, our top-line metrics have slowed, and we need to evolve how we manage our business. Our go-forward priority will be to balance investing for the long-term growth while managing the business to consistently expand non-GAAP operating margin and deliver sustainable positive adjusted free cash flow in fiscal year 2024 and beyond. As we said during our IPO, our long-term objective, we expect to achieve a non-GAAP operating margin of greater than 20%, and our commitment to that objective has not changed.\n\nLet me be clear. I don't believe we need to sacrifice growth to achieve our profitability targets. This market is large and early stage. Our customers are committed to UiPath, and they love the outcomes we deliver.\n\nIn the short term, we are strategically repositioning the company to increase velocity, efficiency, and customer-centricity. This includes evaluating -- elevating customer conversations, selling business outcomes, and helping organizations realize the transformational benefits of automation. We have the opportunity to be the essential automation goal standard for customers delivering technology that is integral to their business strategy. To get there, we are aligning around four strategic objectives.\n\nFirst, investing in our platform to increase our competitive moat and delight our customers with disruptive and innovative capabilities that improve outcomes, accelerate return on investment, and leverage the cloud. Second, increasing velocity and productivity. This is where we are expending the most energy and also expect the greatest return. We need to set ourselves up to take advantage of our incredible new platform releases like 2022.10, which we plan to unveil at FORWARD 5 in a few weeks.\n\nThis includes branding and marketing around business outcomes that resonate with the C-suite, simplifying our sales motion to lower costs, building strategic partnerships that elevate our brand and serve as distribution channels, and coalescing around partners that can really move the needle. Third, we are bringing together a diverse team aligned around driving UiPath to the next level. Every business that grows at our rate requires experienced leadership. We have great bench strength, having already elevated internal leaders to new roles, and a strong brand that is attracting a great pool of new talent, as you saw by today's sales leadership announcement.\n\nFinally, and equally critical, we are committed to sustain profitable growth by leveraging our scale and exercising disciplined resource allocation. Profitability is a core pillar of our go-forward strategy. While we are reducing our near-term forecast to account for a significant FX headwind, the macro environment, and our internal repositioning, I am confident in our strategy. And I firmly believe from my experience that we are on the right track to achieve our growth and profitability objectives.\n\nAnd I am confident in our strategy. I'll now turn the call over to Daniel.\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nThanks, Rob. We frequently talk about our market leadership. And in July, we were positioned by Gartner as the Leader in the 2022 Gartner Magic Quadrant for Robotic Process Automation research report for the fourth year in a row, positioning UiPath highest for Ability to Execute and furthest for Completeness of Vision. We are gratified to have received this recognition.\n\nWe continue to hear from our customers that the breadth of capabilities in UiPath's automation platform is why we win. UiPath is the only company that offers a complete solution, including Task and Process Mining, Document Understanding, Test Suite, RPA, and low code deployed on-premise or in the cloud. Task and Process Mining are key to helping customers discover new opportunities for automation. And in June, we were named a Process Mining Leader in the Technology Vendor landscape, according to the Everest Group PEAK Matrix for Process Mining Technology Vendors 2022 for the third consecutive year.\n\nAnd in our upcoming 22.10 platform release, we will introduce new process mining capabilities. At the other end of the automation life cycle, Test Suite is emerging as a meaningful growth opportunity for UiPath and an important tool for customers to scale their programs resiliently. The value of Test Suite expands when customers use UiPath's test capabilities for both RPA and application testing, driving our platform adoption in a new market. Finally, we have long believed that the combination of UI plus API plus AI automation is the key to customer success, and are really excited about the acquisition of Re:infer.\n\nBy adding Re:infer to our platform, we can now leverage natural language processing and machine learning technology to do what we call communications mining, transforming massive amounts of unstructured data into actionable information with speed and accuracy, which customers like UBS, Paychex, and Farfetch are already doing. Combining Re:infer with the breadth of our AI-powered capabilities unlocks new opportunities for our customers. We are very excited to unveil our newest innovations at FORWARD 5, where we will announce exciting functionality in our 2022.10 platform release across all elements of our platform. We hope to see many of you there.\n\nWith that, I'll turn the call over to Ashim to talk in more detail about our second-quarter results and provide guidance.\n\nAshim Gupta -- Chief Financial Officer\n\nThank you, Daniel. Before I get started, please note that unless otherwise indicated, I will be discussing results on a non-GAAP basis, and all growth rates are year over year. We delivered a solid second quarter in the face of increasing FX headwinds and a more measured buying environment. Customers understand the meaningful business outcomes that automation delivers and the competitive differentiation of UiPath's automation platform.\n\nIn fact, two of our largest deals in the quarter were new customers making multiyear commitments to our platform, which is really nice to see. Turning to our numbers. Second quarter ARR totaled $1.043 billion, up 44%, driven by net new ARR of $66 million. On a year-over-year basis, FX created an approximately $8 million headwind to net new ARR in the quarter and a $12 million headwind to the total ARR balance.\n\nDollar-based net retention was 132%. Normalizing for FX and excluding the impact of Russian sanctions, dollar-based net retention was 135%. Consistent with the broader macroeconomic environment, dollar-based net retention rate was meaningfully stronger in the Americas. Dollar-based gross retention was 98%.\n\nThis best-in-class metric is consistent with previous quarters as customers are committed to our platform, which is driving quantifiable ROI. As of the end of the second quarter, customers accounting for at least $100,000 in ARR grew more than 30% year over year to 1,660, while customers contributing over $1 million in ARR grew over 60% year over year to 190. Revenue grew 24% to $242.2 million. Normalizing for the year-over-year FX impact, which was an approximately $20 million headwind, revenue grew 35% year over year.\n\nRemaining performance obligations increased 36% to $709 million. Normalizing for the year-over-year FX impact, which was an approximately $51 million headwind, RPO grew 46% year over year. Current RPO increased 37% to $442.6 million. Total gross margin was 84%, reflecting ongoing investments in support and cloud infrastructure as we scale that business.\n\nSoftware gross margin was 91%. Looking ahead, we continue to expect gross margin to be greater than 80%. Second-quarter operating expenses of $215.7 million increased 34%, reflecting only one month of benefit from the steps we took in the second quarter. GAAP operating loss of $120.2 million included $88.3 million of stock-based compensation expense.\n\nNon-GAAP operating loss was $11.2 million. Second-quarter non-GAAP adjusted free cash flow was negative $23.3 million. And we have $1.7 billion in cash, cash equivalents, and marketable securities, and no debt. Let me now turn to guidance.\n\nFirst, we guide to what we see in the pipeline, which continues to fluctuate given the choppy macroeconomic environment, which we anticipate will continue. Second, more than half of our business is outside the U.S., and we price in local currency, including euro and yen. And as a result, there is a material FX headwind for both ARR and revenue that has significantly increased as we move through the year. Lastly, going forward, as Rob said, profitability is a core pillar of our go-forward strategy.\n\nWhile the reduction in our top-line near-term forecast reflects the FX headwind, of the macroeconomic environment and our internal repositioning, we are committed to our goal of achieving non-GAAP profitability and positive adjusted free cash flow in fiscal year 2024. Turning to the numbers. First, for fiscal third quarter 2023, we expect ARR in the range of $1.091 billion to $1.093 billion, including an incremental FX headwind of approximately $5 million. Excluding the foreign exchange impact, ARR is expected to grow 36% year over year at the midpoint of guidance.\n\nWe expect revenue in the range of $243 million to $245 million, including an incremental FX headwind of approximately $10 million. Excluding the foreign exchange impact, revenue is expected to grow 22% year over year at the midpoint of guidance. We expect non-GAAP operating loss to be in the range of negative $30 million to negative $25 million, reflecting the timing of investments that shifted from the second quarter to the third quarter and an incremental FX headwind of approximately $5 million. And we expect third quarter basic share count to be approximately 550 million shares outstanding.\n\nFor the full year, we expect ARR in the range of $1.153 billion to $1.158 billion, including an incremental FX headwind of approximately $15 million. Excluding the foreign exchange impact, ARR is expected to grow 30% year over year at the midpoint of guidance. Revenue in the range of $1.002 billion to $1.007 billion, including an incremental FX headwind of approximately $25 million. Excluding the foreign exchange impact, revenue is expected to grow 22% year over year at the midpoint of guidance.\n\nNon-GAAP operating loss of approximately negative $15 million, including an incremental FX headwind of approximately $15 million. Excluding the foreign exchange impact, non-GAAP operating income is expected to be $25 million for the full fiscal year. Now, I'll turn the call back to Rob.\n\nRob Enslin -- Co-Chief Executive Officer\n\nThanks, Ashim. Crossing $1 billion in ARR this year is a big achievement, but it is just the first milestone for us. I am confident that this is a multibillion-dollar company that customers see as integral to how they run their business. We have a strong foundation to scale, and we are making decisions that put us on track to achieve growth and profitability.\n\nOur potential is enormous, and we believe in the long-term vision of the company now more than ever. I look forward to meeting many of you over the coming weeks and to laying out our strategy in more detail during our Investor Day on September 27. We'll now take questions, and I'll turn the call over to the operator. Operator, please poll for questions.\n\nOperator\n\nAt this time, we will be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for questions. Our first question is from Raimo Lenschow with Barclays. Please proceed with your question.\n\nRaimo Lenschow -- Barclays Capital -- Analyst\n\nPerfect. Thank you. Thanks for the extra clarity, Rob. So, can you -- if you think about the strategic changes that you talked about, can you kind of double click on that a little bit more in terms of like the initiatives you're doing there? And usually, when you do that, you kind of have a period where you're negatively impacted, and then it should get better afterwards, which is why you're doing it.\n\nCan you just talk a little bit about how you see that evolving at the moment? And the second follow-up question for Ashim. If you think about the -- at the beginning of the year, you were one of the first to kind of call out some macro uncertainties. And back in March, you talked about the renewal pool, and you didn't know how customers would behave. If you think about the additional comments you made today, is that still the same issue? Is there something else that is happening? Can you just elaborate there a little bit more? Thank you.\n\nRob Enslin -- Co-Chief Executive Officer\n\nSure. Let me go first, Raimo. Thanks for the question. Yes.\n\nAs we evolve and reposition the company, we spoke early on about how we're driving digital sales, which is basically a combination of inside sales in our emerging segment, and we're very happy with the progress that we continue to make in that space. We need to position the company to drive business outcomes into the C-level suite and position the enterprise automation platform to be the winner. And we actually believe that the product is absolutely incredible. And in order to do that, we are aligning the sales organization around that, bringing in new experienced talent.\n\nWe promoted some talent internally as well. We've just announced the European leader. And we've seen some promising signs in North America as we move the automation platform. So, we are pretty confident that over time, this is the right strategy.\n\nAnd as we said, we would lay it out at Investor Day in very, very clear terms.\n\nAshim Gupta -- Chief Financial Officer\n\nAnd then, Raimo, just when you think about, you know, our guidance and tracing back to the first of the year, first, I'll remind everybody, look, we have a very strong foundation globally. So, we actually have a very good view of just the overall exposure that's there. Here's what's different. FX continues to get worse and deteriorate, right? We came to parity on the euro.\n\nThe yen continued to deteriorate, as well as the quarter has progressed. We do see weakness in Europe and Japan in particular. And we see that reflected. I mean, in our dollar-based net retention rate, we still see that as an asset when you take out the impact of FX.\n\nWhen you break that down one level further, the Americas dollar-based net retention rate when -- where it's not as exposed to the macroeconomic environment, we see a lot of strength there. We continue to see strength there. We also see strong gross net retention rates, which we talked about, at 98%. So, we still feel very confident in the value around our renewable base that our software is performing.\n\nSo, we just -- we look at our pipeline. We look at the activity. We listen to what customers are saying. And we just find it appropriate given the environment to provide the guidance that we did here.\n\nRaimo Lenschow -- Barclays Capital -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is from Phil Winslow with Credit Suisse. Please proceed with your question.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nHi. Thank you for taking my questions. I just wanted to focus on the guidance in terms of what you're hearing from customers. Maybe, Rob, you can start with this.\n\nIn terms of just the lower sort of net new ARR expectations, obviously, excluding FX, are you seeing any sort of -- what are you seeing in terms of the change from customers? Are they simply shrinking maybe some of the scope of the deployments or just deployments as a whole getting pushed out? Any sort of more color there would be helpful. And also, maybe compare that to what you have done in the first half. And I just had one follow-up for Daniel.\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. Thanks, Phil. I would say to add on to Ashim's comments, we're definitely seeing budget discussions taking longer, C-level executives getting engaged in us. We view automation, obviously, as a key growth lever for companies, but we've definitely seen those outcomes.\n\nAnd as we position new experienced leaders, we're going to be able to deal with that more. As I said earlier, we do see the benefit, though, of that discussion in North America, where we are starting to see really positive signs in the upper end of the segment as well.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nGot it. And then, Daniel, on the technology side, obviously, you've been investing organically and inorganically in expanding your portfolio. They're really trying to build out an end-to-end suite. When you talk to customers, what is starting to resonate? Is this starting to resonate with them? In particular, are there parts of that suite that are starting to carry more weight? Thanks.\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nYeah. Phil, look, I would say that our entire platform resonates very well with the customers. They find the value from process discovery, which is very important in finding opportunities for automation, to implementing where we play for personal automation and enterprise automation to delivering great outcomes -- measurable outcomes. We are seeing meaningful traction with our Test Suite, which is not only for testing RPA but also for testing application implementation.\n\nAnd it's -- we are seeing it as becoming, like, a clear path in digital transformation. As people are implementing new systems and it's a lot of manual labor involved in testing the new systems, it makes a lot of sense to automate the manual testing and then reuse the building blocks into delivering an end-to-end automation.\n\nOperator\n\nOur next question is from Keith Weiss with Morgan Stanley. Please proceed with your question.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThis is Sanjit Singh for Keith. This is Sanjit for Keith. Thank you for taking the question. Rob, I wanted to get a sense of some of the spending hesitancy.\n\nSo, outside of the FX sort of impact. But in terms of customers trying to expand their business with you or attracting new customers, at a high level, you would think that automation would be a super high priority given the inflationary environment, given the need to get more efficient. And so, in terms of the sources of those -- that spending hesitancy, is it about the implementation cycles? Is it about the payback period? I assume this extremely -- it sells itself on an ROI basis. But if customers are prioritizing projects with 12 months or less payback, does this sort of automation fit that -- fit the bill, if you'd like? Or alternatively, are there potentially competitive issues that are sort of lengthening the sales cycles or lengthening the eval process? Any sort of color on the nature of the hesitancy to get deals done? Really appreciate it.\n\nRob Enslin -- Co-Chief Executive Officer\n\nThere's no question customers see the benefit of automation. I'd say the automation market is evolving, and it's new. And when we look at the broader platform, that takes into account what I would say is speed to value. I've spoken to some senior executives here in New York City, in the bank, and they are looking to utilize UiPath's platform to drive really financial transformation in their organization.\n\nSo, we see it in many of our conversations. That's absolutely true. But as we look at it, those decisions are taking a little bit longer. They take a little bit more foresight, and customers are taking just a little bit longer to drive it.\n\nAs we build the ROI calculators and drive the business outcomes with these customers, I'm absolutely convinced that this is -- their automation is definitely going to help companies do not only digital transformation but drive speed to value. In the lower enterprise segment, one can look at the emerging markets. We are still very relevant, and product is relevant. And we're doing very, very well in that segment.\n\nAnd that's where we acquire customers, and we continue to acquire customers. So, I would say, over time, I feel really confident that we will be able to deliver. And at the top end of the market, we need to focus on a denser ability to drive consumption with our largest accounts. And that's something that we focus on as well.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nUnderstood. I really appreciate that thought. And then as a follow-up, Ashim, I just want to get some -- maybe some context around the guidance. So, as you look to the Q3 and the Q4 implied guide, are you extrapolating just the trend that you've seen through July, through August, through the balance of the year? It seems like Americas has been a source of strength.\n\nDo you assume that this strength continues in the Americas? Or are you being more conservative on that side of the business, too? In some sense, are you seeing something that's worse than what you've seen or just extrapolating what you've seen thus far?\n\nAshim Gupta -- Chief Financial Officer\n\nI mean, like we always say, we're very consistent with the way we guide. We guide to what we see in front of us today. And we see Americas strength. We have a lot of confidence in that business as we look at our pipeline and as we look at our execution there.\n\nI think Europe and Asia continue to be outsized impacted in terms of -- from a macro and a foreign exchange standpoint, and both of those that we have guided in. And the other piece is, as Rob said, we're repositioning the company. And we're really excited about the leadership announcements that are out there. And so, we're also just accounting for the transition that's natural as any company repositions itself in certain areas.\n\nSo, those are the two factors that really give context around our guidance, Sanjit.\n\nOperator\n\nOur next question is from Mark Murphy with JPMorgan. Please proceed with your question.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nYes. Thank you very much. Ashim, is it possible to disaggregate the reduction in ARR? I think it's about 6% for the year. Into those three factors, I think you had mentioned FX, macro, and your own internal repositioning.\n\nIn other words, are those equivalent? Or are there varying magnitudes across those three?\n\nAshim Gupta -- Chief Financial Officer\n\nYes. I mean, when you look at -- I think FX is the one that is the most quantifiable in terms of where that is. And so, we -- when you look at it versus the prior consensus in terms of the change in guidance, we look at that as $15 million to $20 million in terms of the impact just from FX. The macro and kind of some of the internal changes that we're doing and other items, for that, that's really hard to disaggregate.\n\nI would say we look at both of those as in play as we give our guidance. That's there. So, the macro -- the FX is quantifiable, and I provided that, Mark. The other two, I would just say, is more guiding based on our pipeline that we see in front of us today.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nUnderstood. Thank you. And then I had a quick follow-up, perhaps, for Daniel or Rob. I'm wondering if you're seeing equivalent growth rates for automation that run entirely inside the Microsoft environment versus those that are stretching across multiple environments.\n\nAnd if there's any way you could just remind us, what does that mix stand out of the kind of Microsoft-only environment today?\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nWell, traditionally, and it continues today, our technology was mostly used for complex processes that usually span multiple systems. This is actually the strength of our technology. And most of our customers have multiple enterprise systems. This is -- it's a big difference between an enterprise automation platform that works very well across multiple systems and in application automation, that's Microsoft, and similar system application providers have basically entered the market recently.\n\nSo, I am very confident that we have the only complete platform that offers an end-to-end process automation that is differentiated for our customers.\n\nOperator\n\nOur next question is from Kirk Materne with Evercore ISI. Please proceed with your question.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nYes. Thanks. Rob, I was wondering, can you just talk about the environment maybe from a vertical or an industry perspective? Are you seeing any difference in the discussions you're having in certain industries rather than others at this point in time? And I guess just some of the earlier questions on the sales organization. Anything you all are thinking about doing sort of toward the end of this year? Or will any sort of changes with some of the new folks coming in be more positioned at the beginning of fiscal '24? Thanks.\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. Thanks, Kirk. Good question. So, we're evolving the sales organization inflight.\n\nI would say when you look at the industry, we continue to see significant demand for financial services, for healthcare, and for manufacturing. I wouldn't say the environment is impacting any of them more than others, for sure. I would say it's much more geographical. Some things that we're doing in terms of -- we're driving significant uptick with partners, for sure.\n\nWe're looking at distribution models. We're looking at the emerging to graduate accounts into the enterprise segment, and as I said, at the density level. The majority of those changes will take place in the beginning of the year as we have brought in new talent, and we align our outcome to that. But we feel good about what we're seeing in the market already around business outcomes and how enterprise automation drives speed to value for companies.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Bryan Bergin with Cowen. Please proceed with your question.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nHi. Thank you. I wanted to ask on the revenue headwind associated with just the cloud transition. I think it was four points previously.\n\nSo, first, any change to that assumption? And then just thinking out further, should we expect a more deliberate push on cloud deployment by clients that caused that headwind to potentially get worse as we go forward beyond this fiscal year? And I guess can you give us any sense of deployment mix in the revenue base now and how you're thinking about puts and takes of that progressing? It would be helpful.\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. So, the four points stays relatively consistent for the second half. We don't see any change in our assumption there. The launch of our Automation Cloud robots was very successful, but it's on track with the way we have discussed it and modeled it post our launch of 22.4.\n\nWhen we think about going forward, Bryan, like longer-term assumptions, those are things we'll discuss at Investor Day, but we don't see anything significant at this moment versus the previous assumptions that we've given. In terms of Automation Cloud robots, which is the biggest impact from a revenue standpoint, we've already gotten a dozen customers there. It's been great feedback. We mentioned iCIMS in our script, and there's a great partnership emerging there that is using there.\n\nAnd we see other companies as well like Smartsheet and other companies very interested to see how they can take advantage of those Automation Cloud robot capabilities. To sum it up, no change in the assumption. We'll talk more about that at Investor Day, but there's no significant difference at this moment in terms of that as a headwind.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nOK. And just understanding FX you've given for ARR in the back half here, any further color you can give on NDBR as you go through 3Q and 4Q?\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. I mean, net dollar-based retention, we had a 300-basis-point FX headwind that is there. Like I mentioned, when you disaggregate it, really, Europe and Japan have the largest impact on the deceleration of the net dollar-based retention rate. We do have confidence in -- as we reposition the company to reaccelerate that and as FX and macro stabilizes.\n\nRight now, those are the two largest pressures that we feel. It's just really from those two geographies.\n\nOperator\n\nOur next question is from Brad Sills with BofA Securities. Please proceed with your question.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nOh, great. Thanks so much. I wanted to ask about land versus expand. I think a couple of years ago, the company pivoted more toward expansion deals, understanding that the installed base was such that there was that opportunity.\n\nYou can see dollar-based net retention has been holding nicely in the 130-plus range here. Is there any plans to go back toward land potentially here? Or do you still see that opportunity within the installed base to kind of continue to drive this kind of growth with more focus on expansion deals?\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah, Brian, great question. So, you know, we definitely see the opportunity to drive expansion deals. As the automation -- the enterprise automation platform becomes very relevant for companies, that is how we would want to do it. We also want to see how we can drive it in the really top segment in key accounts and provide a density model there.\n\nAnd we're also looking at customers in terms of the propensity that they have to expand. So, we're actually looking at the full segmentation and how do we drive an efficiency model in terms of acquiring a company, promoting a company, and ensuring that they have density with consumption.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. Thanks, Rob. And then one more if I may, please. Just you mentioned bolstering the competitive moat.\n\nWhat are some of the things that you think of in the road map here that are behind that potential to continue to build upon the platform and the capabilities that do differentiate UiPath? Thank you.\n\nRob Enslin -- Co-Chief Executive Officer\n\nSo, I'll start and hand over to Daniel. Just having spent the last three months visiting customers and partners, doing world tours, I've been to Asia, Europe a couple of times, I've met probably 60-plus companies, right, I will tell you that we have a very unique platform that nobody else has in the market in an end-to-end way, from discovery to process understanding, ability to fulfill it through RPA and AI and ML and the ability to connect to test and then have insights into how they can operate in a company. That message, when we connect that branding to the C-suite, I think, is going to be incredible. And then Daniel can talk a little bit about the details on the technology.\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nYeah. So, we are the only platform that succeeded in combining API-based automation with UI-based automation. We deliver it in a single low-code, no-code platform that is easy to learn. This is tremendously important to automate a vast array of existing processes and new processes.\n\nWe completed the platform by adding document understanding that is based on our AI foray and machine learning, and we are making steady progress there. We are building a world-class platform. We have acquired Process Mining three years ago. We've done cloud replatforming of the technology, and we are the clear No.\n\n2 in the -- in that part of the technology, and we are closing fastest the gap with the No. 1 in the process mining. Plus, our discovery suite that combines Process Mining, Task Mining, Test Capture, Automation Hub is unparalleled in helping our customers discover both processes at system, log level, and tasks on harvesting the data on the desktop level. We are making steady progress on smoothly integrating all the components of the platform delivered in a single unified experience for the end user.\n\nOperator\n\nOur next question is from Terry Tillman with Truist Securities. Please proceed with your question.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah. Thanks for taking my question and follow-up. I guess, Rob, first question for you. There's been a number of questions about just the strategic repositioning of the company, go-to-market kind of excellence that you're focused on.\n\nIf you had to look, just given your time so far at the company and just thinking ahead over the next 12 to 24 months, where do you see the biggest impact, though, to this key metric ARR? Is it new customers on the enterprise side coming into the fold? Can digital sales actually add up to a lot more for the expansion with your existing enterprise customers? Can you kind of pick apart those three areas? Or maybe I'm missing something. I'm just trying to understand what you have, the biggest needle mover. And then I had a question for Ashim.\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. We need to do both on that. In other words, selling products into the emerging enterprise segment is a great way to acquire new customers. Then we need to determine how to reposition these companies so that we actually drive enterprise-level scale activity.\n\nWhen we look at enterprise-level scale activity, that's where we're talking about driving enterprise automation as a theme through companies. So, we have to do both. We have to continue to acquire companies. We have to understand which part of these companies have the propensity to expand.\n\nAnd when we know and understand where the propensity is, we need to make certain that we provide dense coverage to them so that we can accelerate the expansion as well. So, we're looking at that level of efficiency. And we're also leaning on our partners in this space to help us drive this. So, Terry, it's not just one play.\n\nIt's multiple plays. I think we've done really well at the acquisition. I think our digital sales organization is really very, very good and very scaled. And you can see that across the board.\n\nAnd we have a unique opportunity to evolve enterprise automation to become truly a business play that drives speed to value. We're also looking at creating solution packages so that it makes it easier for companies to understand what we're selling and how to position it, and that applies as well to our sales folks. All these pieces coming together, we will lay out at Investor Day very, very clearly for everybody to understand how this will evolve over time.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nGot it. Thanks, Rob. And just a follow-up for Ashim. I think you all talked about a path to non-GAAP EBIT or operating income profitability and free cash flow positive.\n\nIs that for the full year of FY '24? Or would that be at some point within the year when you hit that -- those metrics? Thank you.\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. Look, we're committed to profitability. I just want to emphasize that, to begin with. We're going to talk more about this at Investor Day.\n\nWhat we said in the script is pretty clear in terms of we want to get sustainable and profitable in the short term, and fiscal 2024 is definitely in sights for us, but we're going to talk more and provide more specific information at Investor Day.\n\nOperator\n\nOur next question is from Michael Turits with KeyBanc. Please proceed with your question.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nHey, guys, a couple of questions. Kind of coming back, Ashim, I think, maybe best, to Raimo's question about going back to Q4 when you had seen some negativity. So, just walk us through this trajectory, if you would, where in Q4, you said you were seeing macro pretty much across the board impacting the pipeline, not just in Europe. And then last quarter, I think you said that customers were starting to get a handle on things.\n\nAnd now things seem worse again from a sales cycle perspective and particularly bad in macro so -- excuse me, in certain geos. So, if you could just walk us through why bad, been better, and bad again. That would be helpful.\n\nAshim Gupta -- Chief Financial Officer\n\nYeah. So, one is like -- I want to make sure like -- you know, we guide to what's in front of us, right? That is a very consistent way in which we guide from -- and that we have from the very beginning. It's a really dynamic environment. I just -- I want to make sure.\n\nI think we all can attest to that, and we feel it. So, really coming out of last quarter, we felt more optimism in EMEA, in particular, when we were guiding, you know, in terms of that. Right now, we see it's much more challenging than expected on the ground there. Rob can also give more color on that as he has the discussions with customers.\n\nSo, really Japan, EMEA, Europe, as well as kind of some parts of Asia, like they are all -- they all feel just more challenged when we look at the dynamics right here today, and we guide what's in front of us. At the same time, we feel like the opportunity for automation is big. We see our customers engage. Our dollar-based net retention rate to me shows the durability of our model and the value proposition that we have.\n\nAnd as we talk about guidance, we want to make sure that we are responsible and prudent and derisk the second half of the year just given the dynamic environment in which we're in. I'll let Rob give more color on Europe, etc.\n\nRob Enslin -- Co-Chief Executive Officer\n\nNo, I just think it's consistent. I mean, having spent time in Europe in the last couple of months, I would say we had slight optimism that companies that -- got used to what is happening in the war. I think we said the world become more regional. But I think the -- certainly, the level of what's happening now with the inflation and the energy and so on is having an impact.\n\nAnd companies are thinking about what to invest and where to invest, and they're taking a significant amount of time to make those decisions. The more we focus on automation in helping companies and delivering that message to companies, I'm pretty convinced that we will be more successful in Europe, for sure.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nAnd then my follow-up. I think someone else asked about competition, but not sure if you answered it or maybe I missed it. But what -- is there any change in the competitive environment, whether it's typical people we would think of like Microsoft or not just other companies doing RPA but think of it as maybe potential for competition with substitute products, whether something like low code where you do have some offerings also? So, are you seeing more competition strictly in RPA and then maybe with alternative ways of solving the problem?\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nWe are not seeing any material change in the competitive landscape since -- in the past three months. And we have -- we continue to see Microsoft but limited to personal automation. In enterprise automation, we are competing with more of our traditional competitors. We are not seeing the new entrants like ServiceNow, Salesforce into our opportunities.\n\nWe -- they are probably -- we are seeing them in less than 1% of our opportunities. At this moment, I'm pretty confident we have a very differentiated platform that it's a clear leader in automation as attested by various analysts, by our customers, by anyone, basically.\n\nOperator\n\nOur next question is from Michael Turrin with Wells Fargo Securities. Please proceed with your question.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHey there. Thanks. Good afternoon. Appreciate you taking the question.\n\nI know there have been several on the go-to-market changes, but I do want to go back to that topic. We saw Chris and Rob join earlier in the year. We have a few new regional announcements on the team there this quarter. Commentary in terms of the backdrop.\n\nStill sounds clear that automation is a big opportunity. But given changes in go-to-market, changes in macro, how do you make sure you aren't taking your eye off the ball in the core automation space? And are those changes things you're able to kind of shore up ahead of the user conference, the customer conference, and just the upcoming importance of the fiscal Q4 period that you have in front of you?\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. We feel confident that we have -- that showed up, but I would also add in terms of the RPA or the automation -- the core automation, that continues to expand. And then you see that in the digital sales piece. But as we reposition, the broader enterprise automation is a platform play that we have to drive true business outcomes and faster ROI environment.\n\nAnd many of the leaders that we brought in understand that, and we will bring in more experienced leaders as well to actually to drive that environment. And to be honest, when you look at this, and many of you will be at Investor Day, the attendance for FORWARD 5 is amazing. So, I'm absolutely convinced. One is we have the right strategy.\n\nWe lay it out very, very clearly for you. You'll see that we are focused on ensuring that we will get enterprise automation at the right level. And at FORWARD 5, with the amount of folks that are showing up, it clearly shows that we are the automation leader, and we have a unique value proposition across the board for all aspects of automation.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Alex Zukin with Wolfe Research. Please proceed with your question.\n\nAleksandr Zukin -- Wolfe Research -- Analyst\n\nHey, guys. A lot of mine have been asked, but just two more kind of clarifying questions on previously discussed topics. Maybe the first one, just -- it sounds like the guidance has been derisked for incremental macro deterioration in Europe. But have you reflected anything in terms of incremental macro deterioration in the U.S.\n\nin the guidance? And then as a follow-up, you know, just the confidence interval here around – you know, to some extent, just to Michael's point, that the execution changes that you're putting in place and the repositioning, you know, don't have an outsized impact on actually closing the business at the end of this year's Q4.\n\nAshim Gupta -- Chief Financial Officer\n\nSo, I'll start with the guidance. So, one is I think that the Americas from our standpoint, we guide what's in front of us. As of this point, we don't forecast further deterioration in Americas. We have our sales leader in place that -- the announcement came out that was recently promoted, has been with the company.\n\nFrom a macro standpoint, we still feel good about the pipeline relative to Europe and to Japan. And the indicators -- like I said, we have strong dollar-based net retention rate. We are not FX exposed in Americas. So, I think we are appropriately guiding for where we are today.\n\nOf course, anything could change from a macroeconomic environment, but we guide for what's in front of us at this moment. And then in terms of the overall year, like again, we've accounted for not just the macro but also the repositioning of the company. As Raimo kind of talked about even in the beginning, we've derisked that in -- as a part of our guidance, the impact that comes with any change, and we feel very positive and excited about the change for our long term, but we acknowledge some of the short-term risk that that could create.\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. We've derisked, and we pretty -- we see -- when we say we see positive signs in North America, we look -- we're seeing the opportunity of deals, larger deals coming into the pipeline. And we have actually implemented a very strict forecasting policy. So, we feel really good about the derisking and the opportunity in front of us in North America.\n\nAleksandr Zukin -- Wolfe Research -- Analyst\n\nPerfect. Thank you, guys.\n\nOperator\n\nOur next question is from Fred Havemeyer with Macquarie. Please proceed with your question.\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nHey. Thank you. I think, likewise, many of my questions have been asked, but I wanted to check in about just sales across the platform. Clearly, we understand that UiPath is going to market with an end-to-end automation platform, but are you seeing any particular segments that are kind of running a bit hotter or are seeing more demand or some areas that might be a little bit softer or receiving additional scrutiny, say, between RPA versus Process Mining versus Task Mining, just various different aspects of your platform?\n\nAshim Gupta -- Chief Financial Officer\n\nSo, when we look across the platform, I really want to -- we see customers wanting to buy the platform. And I think the metric that actually reflects the best is our customers greater than $100,000 and our customers greater than $1 million, which we showed continued positive momentum in both of those areas. We've discussed in the past that we do have the ELA offerings that are there for customers. And what's attractive for that is they get the full breadth of our platform and full automation capabilities from discover to the core RPA to additional capabilities as well.\n\nSo, those two metrics really show that. Do we believe there is some more opportunity? Yes. And I think Rob talked about that in the script. And that is some of the areas that we're going to be talking about at Investor Day.\n\nRob can add as well from his comments with customers.\n\nRob Enslin -- Co-Chief Executive Officer\n\nI think you answered it. I think that, you know, there's opportunity. There's significant opportunity. This market is not constrained.\n\nWe need to go after that opportunity. Test Suite is clearly an amazing product in the market in that it connects Test Suite, testing, test automation across all platforms. And it allows you to automate the -- to automate automation inside the automation platform. So, I think we have a unique and a big opportunity in that space.\n\nAnd, you know, on the discovery side, customers are just getting started.\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nThank you. And if I can get one more in. You hire today or rather announcement today of hiring Mark Gibbs, his background at SAP, the -- also it just looks like the integration you announced with Workday, is there anything to read here that you're seeing more opportunity in either HCM or in ERP-related workloads and automation there? Because it's clear certainly that some players in the space have been focusing on automation.\n\nRob Enslin -- Co-Chief Executive Officer\n\nYeah. And maybe we haven't been clear, but I would tell you, I see -- I'd phrase it maybe a different way. I see a significant opportunity in embedding automation into technology products where those products will drive higher value services for their customers. I think iCIMS is a great example of that, and we are talking to a number of technology providers in this space.\n\nSo, I think that is a runway that we can drive for. Our product is really well suited to being embedded in other solution sets. And clearly, when you look at the different ERP markets or transaction provider market, we focus on subprocesses. And so, we are additive, additive in terms of how customers would see value.\n\nAnd any customer that's going through digital transformation or a transformation or migration, whether it be SAP or Oracle or Workday or Salesforce, including automation into that transformation is an incredible opportunity. And that's where we see the CIOs will see automation going forward.\n\nOperator\n\nWe have reached the end of the question-and-answer session, and I'll now turn the call over to Rob Enslin for closing remarks.\n\nRob Enslin -- Co-Chief Executive Officer\n\nThank you very much, everybody, for attending today. We really appreciate it, and we look forward to seeing everyone at Investor Day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKelsey Turcotte -- Senior Vice President of Investor Relations\n\nRob Enslin -- Co-Chief Executive Officer\n\nDaniel Dines -- Co-Founder and Co-Chief Executive Officer\n\nAshim Gupta -- Chief Financial Officer\n\nRaimo Lenschow -- Barclays Capital -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nTerry Tillman -- Truist Securities -- Analyst\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nAleksandr Zukin -- Wolfe Research -- Analyst\n\nFred Havemeyer -- Macquarie Research -- Analyst\n\nMore PATH analysis\n\nAll earnings call transcripts"
}