{
  "companyName": "Coupang, Inc.",
  "companyTicker": "CPNG",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/coupang-inc-cpng-q2-2022-earnings-call-transcript/",
  "content": "Coupang, Inc. (CPNG 0.34%)\nQ2 2022 Earnings Call\nAug 10, 2022, 5:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Abby, and I will be your conference operator today. At this time, I would like to welcome everyone to the Coupang earnings conference call. [Operator instructions] Thank you.\n\nAnd now, I'd like to turn the call over to Mike Parker, vice president of investor relations. You may begin your conference.\n\nMike Parker -- Vice President, Investor Relations\n\nThanks, operator. Welcome, everyone, to Coupang, Inc.'s quarterly earnings conference call for the second quarter ended June 30, 2022. I'm pleased to be joined on the call today by our founder and CEO, Bom Kim; and our CFO, Gaurav Anand. The following discussion, including responses to your questions, reflects management's views as of today's date only.\n\nWe do not undertake any obligation to update or revise this information except as required by law. Certain statements made on today's call include forward-looking statements. You should not place undue reliance on forward-looking statements. Actual results may differ materially.\n\nPlease refer to today's earnings release, as well as the risks and uncertainties described in our most recent quarterly report on Form 10-Q filed with the SEC on May 12, 2022, and in other filings made with the SEC for information about factors, which could cause our actual results to differ materially from those forward-looking statements. During today's call, we will present both GAAP and non-GAAP financial measures. As a reminder, these numbers are unaudited and may be subject to change. Additional disclosures regarding these non-GAAP measures, including reconciliations of non-GAAP measures to the most comparable GAAP measures are included in our earnings release and our SEC filings, which are posted on the company's investor relations website at ir.aboutcoupang.com.\n\nAnd now, I'll turn the call over to Bom.\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nThanks, everyone, for joining us today. Let me begin with some highlights from our second quarter operating results. First, we achieved an adjusted EBITDA of $66 million for the entire business, an improvement of $157 million quarter-over-quarter and $188 million year over year. Second, we recorded $1.2 billion in gross profit and 22.9% gross margin, representing a 250-basis-point improvement quarter over quarter and 470-basis-point improvement net of the fire year over year.\n\nThird, constant-currency revenues grew 27% year over year and 3% quarter over quarter. And revenue per active customer for the overall business grew 20% year over year and 4% quarter over quarter on a constant-currency basis. In short, the spend of our customer cohorts continues to compound at a fast rate and we continue to grow at multiples of the overall e-commerce segment in Korea. In just three short years, by 2025, that e-commerce segment is projected to exceed $290 billion in sales.\n\nWhile we've grown to significant scale, we remain a small portion of what is expected to soon become the third largest e-commerce opportunity in the world. And our growth is powered by our relentless customer focus. We'll always strive to make experiences richer and prices lower for our customers. We increased our investments in free Rocket shipping, exclusive discounts and free video content for our WOW members by 50% over last year to a record $500 million in Q2 alone.\n\nIn addition to providing unmatched delivery and service levels, we continue to offer the best prices to our customers. A recent study by KPMG found Coupang to have a 25% to 60% average price advantage compared to major competitors for top-selling items across the category survey. Now a few details on the operating results of our individual segments. To provide more visibility into the underlying performance of our business, for the first time in Q1, we broke out product commerce as a segment representing our core e-commerce and fresh offerings separate from the developing offerings segment, which captured our investment in nascent initiatives like Eats and international.\n\nIn Q2, product commerce generated $98 million of adjusted EBITDA, an improvement of $95 million quarter over quarter and $146 million year over year. We continue to see strong gross profit margin results in product commerce with improvements of 150 bps quarter over quarter, 380 bps year over year, net of the fire. Despite ongoing inflationary headwinds, these positive results were driven by levers that we highlighted in Q1, benefits from investments in technology, infrastructure, automation, supply chain automization and scaling margin-accretive offerings, including advertising. We believe the progress we've made and the 2% adjusted EBITDA that we recorded in product commerce in Q2 is just a glimpse of the significant long-term profitability of our business.\n\nThe rate of improvement won't be consistent or is dramatic each quarter, but we're excited about the potential ahead. On growth, product commerce revenues grew at 27% year over year and 3% quarter over quarter on a constant-currency basis. In contrast, the broader product e-commerce segment in Korea grew 6% year over year and 0% quarter over quarter. Our share of product e-commerce growth has increased every quarter since we've gone public, and this quarter was no exception, setting a new record.\n\nIncreasing customer adoption and engagement across more offerings is accelerating our flywheel. Nowhere is that more evident than in our fresh offering. After just three full years of operation, fresh annual run rate stands at nearly $3 billion on the back of what we believe is the best value proposition for an online fresh offering in any market. We believe we provide the largest fresh selection of any retailer in the market, and we're the only online grocer that offers free shipping for orders above just $11.\n\nWhat's more? Customers can have their fresh orders delivered via dawn or same-day delivery, along with millions of non-fresh items because we deliver both fresh and non-fresh orders on the same logistics infrastructure. Customers love the convenience of ordering everything in a single checkout experience, and the combined scale of both offerings generates economies that are difficult to match for any off-line retailer or a stand-alone fresh grocer online. And fresh is still far from its full potential. The vast majority of our active customers did not make a purchase in fresh in Q2, highlighting the significant opportunity to scale this offering in the years ahead.\n\nWe are also encouraged by the progress of fulfillment and logistics by Coupang or FLC, which allows 3P merchants to leverage our Rocket Delivery services and infrastructure for growth. The offering promises to unlock for customers the speed and convenience of Rocket Delivery for millions of additional SKUs, and it allows us to share the value and growth of our Rocket offering with potentially hundreds of thousands of merchants, many of whom are small businesses with limited access to shelves of off-line retailers. As of the end of Q2, over 90% of the 3P merchants benefiting from the services provided by FLC were small and medium enterprises or SMEs, with less than $2.5 million in sales. FLC has the potential to unleash exponential value for both customers and small merchants in the years to come.\n\nAnother investment we're especially proud of is our effort to create a more sustainable environment. We invested in process and infrastructure changes to eliminate our box packaging for over 85% of our Rocket deliveries, which not only saves on box and plastic packaging waste but also allows us to reduce the number of trips our trucks make to complete deliveries, leading to a significant reduction in emissions. We've gone one step further in fresh, delivering most of our fresh orders in completely reusable eco bags. Customers take their products and leave the eco bags for pickup and reuse, like empty bottles left on the porch in the old days of milk bottle delivery.\n\nThat has allowed us to eliminate virtually all styrofoam and most of the onetime packaging waste in our fresh deliveries. We estimate that for 2022, these two efforts alone will save the equivalent of 8 million trees and offset the majority of the carbon footprint of our existing delivery fleet even as they deliver unmatched savings and convenience to our customers. Our small victories on this front serve as a powerful reminder that smart innovation, sustainable practices and good business can go hand in hand. Now on developing offerings, revenues increased 24% year over year but declined 7% quarter over quarter on a constant-currency basis, driven primarily by our Eats offering.\n\nThe decline in quarter-over-quarter revenue is due in part to the post-COVID slowdown in the online food delivery segment in Korea. Growth has also not been our priority this past quarter. As we mentioned in our last call, our primary focus in each continues to be on making structural improvements that will improve customer experience and position us to be more efficient in our next phase of expansion. Adjusted EBITDA losses in the developing offerings segment decreased $62 million quarter over quarter.\n\nThe key driver for this improvement was optimization efforts in our Eats offering, including enhancements and operating efficiency. Developing offerings also includes promising initiatives outside of Eats that target additional customer spend beyond our current e-commerce segment, specifically, investments in video, fintech and international have the potential to expand the TAM for Coupang beyond the forecasted $290 billion in e-commerce sales by 2025. As we do with all parts of our business, we will continue to invest and execute in keeping with our operating tenants, which we first shared publicly shortly after our IPO last year. One, we exist to deliver new moments of WOW for customers; two, we don't start with what looks easy.\n\nWe worked backwards from imagining jaw-dropping customer experiences, and we embrace the hard work required to challenge trade-offs that customers take for granted. Three, we will employ technology, process innovation and economies of scale to create amazing customer experiences and drive operating leverage and significant cash flows over time. Four, we always prioritize growth in long-term cash flows. And five, we are disciplined capital allocators.\n\nWe start with small investments, then test and iterate rigorously. We invest more capital over time and opportunities that have the best long-term cash flow potential. In closing, I want to thank our employees for their dedication in executing on these tenants even during some of the most trying times in recent history. It would have been easy for the team to make a trade-off between customer experience and operational discipline to choose one and give up the other.\n\nDespite the unprecedented challenges of the last few years, our teams refused to compromise on customer experience and focused relentlessly on strong execution to delight customers and drive operational excellence. Gaurav and I are honored to represent such an amazing team, and we're excited to work together to continue to break trade-offs and deliver even greater moments of WOW for our customers in the years to come. Now I'll turn the call over to Gaurav to review the financials in more detail.\n\nGaurav Anand -- Chief Financial Officer\n\nThanks, Bom. Our demand continues to remain strong despite the post-COVID reopening impacts seen here in Korea. Our total net revenue grew 12% year over year on a reported basis or 27% in constant currency. Quarter over quarter, we grew minus 1.5% on a reported basis or 3.1% in constant currency.\n\nOur active customers grew 5% year over year but declined quarter over quarter by 1%. While active customers and product commerce increased both year over year and quarter over quarter, active customers in our Eats offering declined due in part to a minus 11% contraction quarter over quarter in the overall online food delivery segment after the loosening of COVID restrictions. As Bom noted, we continue to see strong growth in our net revenue per active customer, increasing 20% year over year on a constant-currency basis as our customers continue to deepen their engagement with our services. Q2 marked another record quarter with gross profit of $1.2 billion representing 75% year-over-year improvement or 41%, excluding the impact of the FC Fire in 2021.\n\nOur gross profit margin was 22.9% or 250 bps quarter-over-quarter improvement. This improvement is a continuation of the drivers that we saw earlier in Q1 this year, benefits from investment in technology, infrastructure, automation, supply chain optimization and scaling margin-accretive offerings, including advertising. And for the first time as a public company, we reached positive adjusted EBITDA for the total company with $66 million in adjusted EBITDA for Q2. This represents $157 million quarter-over-quarter improvement that follows a $194 million quarter-over-quarter improvement in the prior quarter.\n\nOver the past two quarters, we have given a total improvement of over $350 million, a reflection of our disciplined execution across our business. We provided guidance at the beginning of the year that we expected adjusted EBITDA losses to be below $400 million for full year 2022. We are now raising that guidance to achieve positive adjusted EBITDA for the full year. While we are encouraged by the ramp in profitability that we have been able to achieve over the last two quarters, the rate of improvement going forward will be a bit uneven quarter to quarter due to cadence and sequencing of optimization efforts, variances and investments and some seasonality impacts among other factors.\n\nAs we stated at the beginning of the year, forecasting revenue growth this year with the reopening of the market after COVID remains challenging. However, as Bom noted, we are confident that we will continue the trend of growing significantly faster than the overall Korean e-commerce segment. Overall, we are pleased with our results this quarter. We believe that our position and customer value proposition will continue to drive significant revenue expansion, as well as increase our operating leverage.\n\nIn light of our performance to date, we are more convinced than ever of our potential to generate long-term 7% to 10% or greater adjusted EBITDA margins. Operator, we are now ready to begin the Q&A.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Stanley Yang with J.P. Morgan. Your line is open.\n\nStanley Yang -- J.P. Morgan -- Analyst\n\nWell, thanks for the great results, and congratulations. I have two questions. First question on your adjusted EBITDA in the second quarter, the Q-o-Q improvement has been dramatic, more than USD 150 million. Can you break down the driver of this EBITDA improvement by segments or by products? And my second -- and the other follow up question is actually, when do you expect the free cash flow turning positive? And my next question is what's your outlook for the fulfillment capacity growth and utilization? In the wake of the e-commerce market growth deceleration this year, do you have any plan to incrementally strengthen 3P people service jet delivery.\n\nWhat's your expectation on your jet delivery volume growth this year and next year? Do you see the potential take-up of the jet delivery as margin equity? Thank you.\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nHi, Stanley, thank you for the questions. So first on the drivers of the adjusted EBITDA improvement. And most of the impact came from continuous improvement programs that we also mentioned last quarter and many of which were launched before 2022. The main drivers were improvements in technology, infrastructure, automation, supply chain optimization and the continued growth of various offerings like advertising.\n\nI think, what hopefully is becoming more clear is that COVID last year really obscured the underlying strength of our business, some of which we are now seeing more clearly. It's hard to overstate the unprecedented pressure and problems we faced during the pandemic and how hard the team worked to get through that period to where we are now. We have operational initiatives underway targeting significant margin improvement ahead. And we do expect benefits to continue to come from greater economies of scale, improved operational excellence, and the growth of higher-margin categories and services.\n\nBut as we've stressed, the rate of improvement will not be consistent as a result of the efforts will materialize unevenly. There are also some pressures from inflation, including higher fuel costs. Of course, our teams are focused on generating operational efficiencies to mitigate it, but there are some short-term disruptions and -- that we should highlight. But we remain confident in our ability to achieve the long-term targets of 7% to 10% or higher adjusted EBITDA for the overall business in the long term.\n\nWe continue to invest in our FLC. As you mentioned, there are -- FLC timeline isn't dictated by macro trends. It's really driven mostly by our internal execution. We are continuing to see a very positive response from our customers and merchants, which has reinforced our belief that FLC will create tremendous value for both customers and merchants.\n\nBut there is a lead time to build the technology and infrastructure to scale FLC, and we continue to test and iterate and refine processes. It's still very early, but our confidence is growing that FLC will be a meaningful driver of growth and margin in the long run. We look forward to sharing more data points, Stanley, at the right time.\n\nGaurav Anand -- Chief Financial Officer\n\nStanley, on the FCF question, we have not given guidance on it, but of course, we continue to work toward it.\n\nStanley Yang -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Eric Cha with Goldman Sachs. Your line is open.\n\nEric Cha -- Goldman Sachs -- Analyst\n\nThank you for the opportunity, and myself as well, congrats on the great set of results. I have two questions, if I may. So around Eats, it's, obviously, been impacted by the slowdown of the industry, but there also seems to be a bit of a idiosyncratic issues as well if I call it -- if I can call it an issue. But in what ways do you plan to rationalize the unit economics on that business going forward? And at the same time, how do you balance your sort of plans to gain market share as well? That's the first question.\n\nMy second question is another question on FLC, actually. So more around the strategy. So how do you plan to acquire the big 3P merchants or migrate the current 3P players to migrate to the FLC. What would motivate them to do that? And how will FLC impact Coupang's profitability? Thank you.\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nSo Eric, on FLC, as I mentioned, it's still very early. We are still testing, iterating, we're building tools and the infrastructure to scale. The intent here is to share the value that -- and the growth that Rocket generates with our merchants. And of course, for our customers as well, we're expanding exponentially the value of Rocket Delivery to many, many more products and selections that are provided by merchants in the broader market.\n\nSo we're excited about the value that we can create for both customers and merchants by sharing Rocket Delivery's value with 3P merchants. But it's still very early. And I think, as we mentioned in Q1 toward the back half of this year, we look forward to sharing more data points. On your question on Eats, you're right that we were affected by the negative 11% quarter-over-quarter slowdown in the overall food delivery sector.\n\nBut we saw a significant improvement in Eats profitability in Q2 due to our focus on improving operational efficiencies. This quarter, we're also exploring synergies between Eats and other offerings in our ecosystem to expand value for customers and improve efficiency before the next phase of expansion. And it's important to highlight that long term, we remain very excited about Eats potential. And we believe it will be a valuable and profitable offering in our ecosystem that generates synergies with other offerings and expands the value proposition for our customers in the ecosystem.\n\nOperator\n\nAnd your next question comes from the line of Seyon Park with Morgan Stanley. Your line is open.\n\nSeyon Park -- Morgan Stanley -- Analyst\n\nThank you. Thank you for the opportunity. I think, the results were actually very encouraging. Given the focus on the investors' focus really on margins, I was just wondering whether you can provide a little bit more color on where you have seen the biggest gains in terms of gross profit margin improvement for the product commerce segment, particularly, would there -- could you say that in terms of the utilization of your delivery capacity a higher utilization is a key reason for the improvements? And I guess, along those lines, how much of improvement do you foresee kind of going through the remaining two quarters of the year? Has the low-hanging fruit been taken? And does that make the slope a little bit more difficult in the second half along with the impact of inflation and the slowing market overall? Or do you still think that there is still a lot of room for these efficiency gains to continue? That's my first question.\n\nSecond question, I think just given the other analysts have already asked on Eats, so I'd like to ask just on the strategic direction for Coupang Play. Just the function of Coupang Play and just given some of the content investments that Coupang has been doing recently, obviously, that's, it's a negative in terms of near-term margins. But I was just trying to see whether you had other ways you were thinking of monetizing this service over the longer term. Thank you.\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nSo there's many parts to unpack there, but let me start with the product commerce with the overall margin improvement. I think, this also touches on a question, maybe I can go a little bit deeper that Stanley mentioned. We have -- when you talk about which segment it came -- the margin improvements were driven in, we have a structural advantage in the network and infrastructure that we've built in the sense that we -- the scale advantages that are driven in one category benefits the economies of the other. So for example, our structural advantage in fresh of combining fresh and general merchandise on the same logistics infrastructure allows us to provide customers not only with the best experience and delivery within hours but also the lowest cost structure that enables us to provide free shipping and low prices.\n\nYou'll continue to see that with economies -- generate greater economies of scale, improved operational excellence across multiple segments for that reason. And of course, our margin expansion is aided by the growth of higher-margin categories and services. Much of our growth ahead is concentrated in services and offerings that are higher margin. So the acceleration of our flywheel, we believe should also, over the long term, drive margin expansion as well.\n\nSo we're very confident that there's a lot of room for margin expansion over the long term that, and we remain more confident than ever in our ability to achieve the 7% to 10% or greater EBITDA margins in the long term. However, in the short term, as you mentioned, there are disruptions like inflation, that have led to higher fuel costs among other things. And we continue to work through them. We were net positive this past quarter because of our team's ability to mitigate much of that impact, but that continues to remain a short-term headwind going forward.\n\nOn Eats, I think we continue to remain focused on making the structural improvements. As you mentioned, there are synergies across that we believe we can capture, both in creating structural efficiency -- both in creating operating efficiency, as well as the monetization across offerings in our entire ecosystem, but we will again update you as we make more progress on that front. On Play, long term, we believe, Play's an exciting opportunity to enhance our membership experience and capture spend currently not included in the $290 billion e-commerce opportunity in 2025. Much of our developing offerings' investment is in initiatives that allow us to expand the TAM beyond the $290 billion e-commerce opportunity over the next three years.\n\nAnd we'll continue to invest in a disciplined way in those offerings in keeping with our operating principles.\n\nOperator\n\nOur next question comes from James Lee with Mizuho Securities. Your line is open.\n\nJames Lee -- Mizuho Securities --Analyst\n\nGreat. Thanks for taking my questions. I have two here. First, on demand on by categories here.\n\nIn the U.S., we're seeing essential product outperforming, discretionary items due to inflationary pressure and mix shift to services. I'm just curious that you're seeing a similar trend in Korea. And also help us understand what the trends look like in 3Q so far in July? And second question is on FY '22 EBITDA guidance. Now how should we think about the EBITDA for developing offering.\n\nPreviously, you said you plan to lose about $200 million. Just curious what's your thinking there for FY '22 now. Thanks.\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nOn your first question, as we noted earlier, our revenue per active customers grew on a constant-currency basis, 20% year over year and continues -- customer spend continues to compound at a fast rate because we are seeing growth and strong adoption across many categories and offerings. We are still very early in our journey. And we represent -- we're only in the single-digit share of the overall commerce market. We continue to see customers expand their spend into newer categories from our older categories.\n\nCustomers want selection, low prices and fast delivery for all categories. And we've yet to find an exception to that truth. So we're seeing broad growth across multiple categories. I think that was your first question.\n\nAnd on your second question. What was it? The $200 million investment in developing offerings. We continue to invest, as I mentioned, in long-term opportunities that may not yield revenue growth in the short term because we're excited about the opportunity to capture spend in fintech and video and international, for example. That help us expand the TAM over the long term.\n\nAnd we'll continue to do that and test and iterate investment. We are confident in the ability to generate long-term cash flows, we continue to be disciplined on that front.\n\nJames Lee -- Mizuho Securities --Analyst\n\nGreat. So Bom, if I can ask you a follow-up question, more about your investment philosophy. Given the fact that you guys have done a great job becoming more efficient. So how should we think about your approach in terms of balancing growth and profitability going forward, and especially in Developing offering, right, what indicators do you need to see to double down the investments? And what do you need to see to really back off continuously to reduce losses?\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nSo one thing I should really -- one thing that I should point out and I hope is clear is these improvements you're seeing was not created over one quarter. Many of these programs that are driving this impact today that are materializing in the numbers today were made over many, many quarters and sometimes over many years. The continuous improvement programs that drove our -- very much of the impact that will continue to drive much of the impact going forward were started before this year. And it was -- as I mentioned in earlier calls, COVID last year obscured a lot of the underlying improvements and strength.\n\nAnd we had -- our business went from -- our business tripled from 2019 to 2021 while COVID presented unprecedented challenges to our operations. And we had -- I cannot overstate how -- what an incredible job the team did not only this past couple of quarters but throughout the couple of years of the pandemic when we had to -- when we refused to compromise on customer experience and continued to make progress on the underlying structural -- the underlying operational excellence. And so, I hope that's clear. And I hope we don't misinterpret these results as the output of a few months.\n\nAnd we -- that operational excellence is a part of our DNA. As we mentioned in our principles that we shared not this year, but over a year ago, shortly after IPO, we are disciplined. We test, we iterate. And when we see our hypothesis confirmed and we have more confidence in long-term cash flow generation, we invest more.\n\nWhen we don't, we cap the budget. And that's the same approach you'll see as we invest in developing offerings that will -- that have the potential to yield a lot of impact to the business that drive meaningful growth and meaningful profits for us in the long term.\n\nJames Lee -- Mizuho Securities --Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nYour next question comes from the line of Susie Lee with Bank of America. Your line is open.\n\nSusie Lee -- Bank of America Merrill Lynch -- Analyst\n\nHello. Thank you for the opportunity. I have two quick questions. First, I would really love to get your thoughts on big macro, big picture and consumer spending trend.\n\nSo it seems like investors around the world seem to worry about potential recession and recent inflation may lead to consumer wallet shrinking and also edge budget decline. So in the past couple of months, have you witnessed any changes in the behavior of your customers or advertisers, like customers, even the moderate things like they seem to prefer cheaper products or any signals that the basket size declines? Or for the advertisers, they become more prudent and they seem to delay the advertising toward the end of this year or even next year. So that would be my first question. And then, the second thing is I think James also asked about this, if possible, any chance, could you help us understand the latest trend in your revenue growth in July and early August? Thank you.\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nAs I noted -- as we've mentioned, there are unpredictable variables in the near term and growth remains difficult to forecast but we're very confident that in any scenario, we'll continue to grow significantly faster than the overall e-commerce sector. And as you can see, the revenue per active customer growth highlights how fast customer spend is compounding. That's happening because of strong adoption across many categories and offerings. So we are -- advertising continues to grow fast.\n\nBut on both trajectories, we are still very early, far from where we want to be. So I don't think there's -- we see a general trend -- long-term trend that we're very encouraged by, but the short-term variables make it very difficult to forecast. And I think, we'll -- as we've mentioned before, this year especially, we'll refrain from making forecasts on short-term growth.\n\nOperator\n\nAnd we will now take our last question from the line of Peter Milliken with Deutsche Bank. Your line is open.\n\nPeter Milliken -- Deutsche Bank -- Analyst\n\nThank you, and good morning, everyone. Hey, Great results. Really nice to see EBITDA profit. And my question really is, how did you feel about improving quarter on quarter so much.\n\nWould you attribute that more to COVID costs coming out and efficiency costs being driven or through margins being higher either through this positive mix shift that you talk about or even pricing in higher pricing per item?\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nThere were no price increases. Our pricing strategy, policies and implementation are unchanged. And as we mentioned, in fact, we increased our investments in benefits for our customers in free services and exclusive discounts for line members by over 50% to a record $500 million in Q2 alone. So -- and we continue to invest not only in the low prices in fast delivery and richer experiences but also in new benefits and services and offerings for the long term, like the ones we highlighted in developing offerings.\n\nAnd as I've repeated, these efforts were not the results -- these results were not produced by efforts in just one quarter. Our improvements around process technology, supply chain optimization, automation, infrastructure -- we're driven by continuous improvement programs that preceded -- many of which preceded this year. Now some of those efforts did accelerate as we directed more resources toward them, resources that have been previously tied up in response to pandemic-related challenges, but it's not a single short-term variable that drove this broad-based improvement in margin.\n\nPeter Milliken -- Deutsche Bank -- Analyst\n\nGot it. OK. And while I have you on the line, could you maybe perhaps give us your views on the competitive space that we have now? We've seen a lot of investment going to your competitors or at least plan to over the last year. With the post-COVID slowdown, do you see that continuing or any sign of change?\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nI think, we can say that more so that at any point in our history, the core drivers of our business are unaffected by competition. Our share of product e-commerce growth has increased every quarter since IPO, including this past Q2. And that acceleration is the result of our investments, our innovation to provide customer value. A relentless focus on customer value and operational excellence.\n\nAnd that's where we're spending all of our time and energy. And I think, we're more confident than ever in our ability to deliver for customers and unaffected by competition, more so than at any point in our history.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Parker -- Vice President, Investor Relations\n\nBom Suk Kim -- Co-Founder and Chief Executive Officer\n\nGaurav Anand -- Chief Financial Officer\n\nStanley Yang -- J.P. Morgan -- Analyst\n\nEric Cha -- Goldman Sachs -- Analyst\n\nSeyon Park -- Morgan Stanley -- Analyst\n\nJames Lee -- Mizuho Securities --Analyst\n\nSusie Lee -- Bank of America Merrill Lynch -- Analyst\n\nPeter Milliken -- Deutsche Bank -- Analyst\n\nMore CPNG analysis\n\nAll earnings call transcripts"
}