{
  "companyName": "Duluth",
  "companyTicker": "DLTH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/duluth-dlth-q3-2022-earnings-call-transcript/",
  "content": "Duluth (DLTH 1.98%)\nQ3 2022 Earnings Call\nDec 01, 2022, 9:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the Duluth Holdings Inc. third quarter 2022 conference call. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Nitza McKee.\n\nPlease go ahead.\n\nNitza McKee -- Investor Relations\n\nThank you, and welcome to today's call to discuss Duluth Trading's third quarter financial results. Our earnings release, which was issued this morning, is available on our investor relations website at ir.duluthtrading.com under press releases. I'm here today with Sam Sato, president and chief executive officer; and Dave Loretta, chief financial officer. On today's call, management will provide prepared remarks, and then we will open the call to your questions.\n\nBefore we begin, I would like to remind you that the comments on today's call will include forward-looking statements, which can be identified by the use of words such as estimate, anticipate, expect, and similar phrases. Forward-looking statements, by their nature, involve estimates, projections, goals, forecasts, and assumptions and are subject to risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking statements. Such risks and uncertainties include, but are not limited to, those that are described in our most recent annual report on Form 10-K and other SEC filings as applicable. These forward-looking statements speak only as of the date of this conference call and should not be relied upon as predictions of future events.\n\nAnd with that, I'll turn the call over to Sam Sato, president and chief executive officer. Sam?\n\nSam Sato -- President and Chief Executive Officer\n\nThank you for joining today's call. We're in the midst of our peak season when direct order volume and store traffic are at the highest levels. So, I look forward to providing insights on the trends we're experiencing and the great work our teams are doing to deliver against evolving consumer expectations and execute on our strategic playbook. I'm also excited to share updates on our brand positioning and critical investments we're making to position our business for long-term growth.\n\nWe're committed to staying the course on our Big Dam Blueprint initiatives in the face of many macroeconomic headwinds that we're experiencing today and expect to continue into 2023. While the current environment does pose some near-term challenges for the business, our efforts remain focused on unlocking the company's full potential for sustainable growth. We're all-in on the commitment to support scalability and further enable Duluth to deliver long-term growth and profitability. I'll share further detail on some of the key initiatives shortly.\n\nBut at a high level, we'll continue to execute against our commitments on leading with a digital first mindset, supported by investments in our logistics and technology infrastructure, and in product development and new innovation, while driving brand awareness across our evolving portfolio of sub-brands. But first, regarding our current business, I'm pleased to share that we've seen several key trend reversals that point to progress in the areas that have been our focus. Most notably, total net sales for the company grew 1.3% in the third quarter, a sequential improvement of 770 basis points when compared to the first half of the year. Driving that growth was our direct channel, which was up 7% in Q3 versus down 6% in the first half of the year.\n\nI'll share more regarding the positive initiatives around inventory management, marketing execution, and new product introductions that are supporting this growth. But I would be remiss to not mention upfront that we're seeing the impacts of the inflationary environment on our core consumer with a higher level of price sensitivity. This is resulting in a reduction in the overall basket size and lower levels of food price selling in both our direct and retail channels. The good news is we saw consistent and strong shopper conversion, a clear indication our brand, sub-brands, and products are resonating.\n\nIn high core inflationary environments like we are in, where many consumers face strains on their pocketbook, the price value balance in their discretionary purchase decisions can tilt in the direction of value. In response to the customer's need to balance their own spend decisions, we have strategically and selectively increased our mix of discounted offers and extended some sale event periods to meet these adjusting expectations. Our product offering is centered around fulfilling customers' needs for durable, long-lasting gear and apparel that meets a high-quality standard with an appropriate price value proposition. But we understand for some, trade-offs are made between the need to cover the rising cost of staple items and investing in their apparel and accessories.\n\nThe demand for Duluth Trading product has remained strong. That said, to address the evolving consumer and macro environment, we focused on critical levers to maximize opportunities. For example, to minimize supply chain risks like we experienced last year, we plan to receive inventory sooner to ensure improved in-stock positions as we headed into Q4. We adjusted the mix of our marketing tactics to maximize efficiencies, and we strategically post promotional activity to capitalize on consumer demand while maximizing profitability.\n\nThese efforts materialized in the third quarter as we realized a 9% increase in units sold, and customers who have been with us the longest were the highest retained group of customers. These results speak to our flexibility and agility as we continue to read, react, and adjust to the rapidly changing consumer and macro conditions. As a result of the price sensitivity we are seeing from the customer, we took appropriate actions aligned with the ship, resulting in contraction in our selling gross margins, impacting the bottom-line results. Today, we reported a net loss of $0.19 per diluted share and positive adjusted EBITDA of $1.7 million.\n\nWhile we are not satisfied with these results, we are confident that keeping our inventory clean, generating cash flow, and continuing to meet the customers evolving expectations will serve us well and allow us to continue investing in the strategic priorities we have set for the business. Our overall inventory position, while up 24% to last year, is down 4% to the same period in 2020. As I mentioned earlier, we front-loaded inventory receipts to derisk supply chain challenges by taking early delivery of Q4 goods in Q3. Our strategic actions to be in stock at all times in our core year-round items is paying off.\n\nWe can flex our position in these categories in shorter time frames and make adjustments relative to quarterly demand trends. Dave will share more about how we expect inventory flow and year-end position to play out. Importantly, our current overall inventory is in a healthy position to support peak holiday shopping. From a seasonal merchandise standpoint, our fall winter offering is off to a great start.\n\nSales of seasonal styles were up 8% in the third quarter, driven by flannels, fleece, shirt jacs, and light pants. It took a little longer for the weather to turn colder this year. But when it did, our mix of transition and cold weather items took off. In Duluth women's, The Folklore Flannel collection, featuring several styles and patterns, has seen standout performance.\n\nAs has the Frost Lake collection of fleece tops featuring super soft anti-peeling fabric and cut-shaping that is suitable for wearing alone or as an extra layer. New in the Duluth women's business this season is the shiftless sweater collection that we've designed with the classic V-neck, crewneck, and turtleneck options, as well as the cardigan duster style with extra length for comfort and freedom of movement that our customers expect. Overall, our women's business increased 10% in the third quarter with positive gains in the Duluth branded collections, while we also continue to see strong momentum within the AKHG sub-brand. After a successful introduction of AKHG women's in the spring, our fall/winter assortment is being led by the meltwater first layer program and the midnight sun flannel program.\n\nCombined, our women's business increased to 31% of total sales in Q3, compared to 28% last year and has grown significantly up 35% since 2019. The investments we've made in product innovation and great brand marketing to build out our women's assortment is paying off by cementing Duluth Trading company as truly a co-gender lifestyle brand. Importantly, the proportion of new buyers is closely approaching a 50-50 split between men and women, with the number of female shoppers at the highest peak in the past three years. With the great success we are seeing in our women's business, we're excited to have recently launched a reconfiguration in 20 of our stores that expands our women's footprint.\n\nThe expansion is informed by customer research and focus group insights, highlighting the desire to allocate more space to our women's assortment and balance the shopping experience. These stores have already produced better-than-average results so far this holiday season. We see great opportunities in women's, and we'll continue to focus on this segment of our business as a strategic pillar. Within our men's business, we realized growth in apparel across the three sub-brands of Duluth, AKHG, and Best Made.\n\nOur men's pants program continues to be a dominant category for our company, where many of our top volume items live and where workwear innovation is integral to our success. A good example is the men's ballroom double-flex relaxed fit carpenter jean, a top new product performing this quarter by a wide margin. While we introduced Duluth double-flex denim several seasons ago, we leveraged our double-flex denim innovation into a carpenter style, which blends proven innovation with updated styling and functionality and has quickly become a customer favorite. Another great example of driving success by offering more choices is in our men's longtail T collection.\n\nWe reintroduced an additional style called the un-longtail T that shortens the length, adjust the fit, and provides more color choices to further enhance our staple work shirt offering. Complemented by a new intuitive web selection guide, our customers can more easily browse the many options and find their perfect mix of size, color, and features. Overall, the longtail T program drove a mid single digit increase during Q3. We did experience some softness in our men's unders business this quarter.\n\nAnd while unit sales and the overall unders business was up high single digits, average unit prices were down due to the higher promotional actions, leading to a low single-digit decline in net sales. We're seeing the men's underwear customer become increasingly more price sensitive and value-driven. This trend has been the opposite in women's, however, with net sales in the category up high single digits, driven by high growth in underwear, bras, and our famous no-yank tanks. We also introduced our new line tamer collection in Q3, offering an innovative, seamless solution for women's bras and underwear.\n\nNewness in our unders business is just as critical as other categories, highlighted by another top new product this quarter. The men's functional Bullpen boxer brief was among the top new items this period and demonstrates that Funk No and uniqueness will break through. Of the recently introduced collaboration with the Green Bay Packers for co-branded Packers-themed clothing, the men's buck naked cheese pattern boxer brief has been a top-selling item so far this season. We're also excited to see the success that [Inaudible] our AKHG sub-brand to women's has had on the overall brand growth.\n\nAKHG increased nearly 45% in the quarter, due in large part to the introduction of women's. Men's AKHG also saw healthy growth of mid single digits in the quarter, driven by new programs such as Blackburn and crosslayer, which features pullovers, hoodies, and vests, and in meltwater base layers, dramatically improved in-stock positions compared to last year, helped drive increases in our boar's nest and cross-style collections, which feature sweatpants, sweatshirts, and flannels. Overall, we see AKHG having outsized growth potential and can aggressively compete in the sizable outdoor recreation apparel space. And to support this growth opportunity, we plan to increase our brand-building investments in AKHG in future seasons.\n\nMore near term, our marketing focus to drive brand growth has been to prioritize digital channels with paid advertising and personalized communication across our own channels, email, and brand followers and influencers. During the third quarter, we realized a mid single-digit increase in total customer counts and repeat buyers, with success in reactivating customers having purchased in more than a year. Tactically, we were able to increase this segment of lapsed buyers in the quarter by over 30%. We increased our working media investments in Q3 by roughly 15%, which helped drive an increase in web visits in the quarter by 6% and mid single-digit sales growth in September and October.\n\nIn addition, we tested digital messaging to drive store traffic in 15 local store markets that led to increases, and we have broadened the investment in all our store markets for the holiday season. The increase of web visits and direct sales in the third quarter came through a mobile device with desktop and tablet essentially flat. Not coincidentally, we saw outsized customer growth coming from the younger age cohorts, who are more apt to transact on their mobile device. As we've shared in our Big Dam Blueprint, targeting a younger customer in the age range of 40- to 50-year-old with our product offering and marketing mix is gaining traction.\n\nWith our average customer age today in the mid-50s, we are actively balancing our mix of advertising to both target and build visibility with our 40- to 50-year-old target customer, while maintaining visibility within media channels that index well with the older demographic. In Q3, we observed that the content consumption behavior of our target 40-to-50 year old customer is becoming more fragmented, meaning that they consume content in multiple channels, including most streaming platforms, cable TV, YouTube, and streaming audio. As such, building awareness with the customer must be selective, focused, and intentional by channel. For example, within digital channels, social platforms index well with a female buyer and proved to be successful in driving sales from new younger female buyers in the quarter.\n\nYouTube specifically index as well with males age 40 to 50, along with social channels. Our success long term will be driven by the learnings we're gaining now about our target customers' media consumption and how to appropriately best flex the mix of working media investments. Related to the investments we make in working media. I'm excited to share news about a recent website replatform that has meaningfully improved the user experience and transactional performance of the duluthtrading.com site.\n\nIn October, we successfully relaunched our website using headless site architecture known as a progressive web application. The improvements to site speed upon launch have been meaningful, and customers are taking notice. We believe this investment will drive a lift in site conversion and engagement going into peak, especially for those customers who choose to shop on their mobile device. Next year, this new platform will allow us to progress our digital experiences faster than ever before by enabling more rapid enhancements, richer digital storytelling, and quicker upgrades for third-party tools, such as new site search functionality.\n\nWe have recently completed key investments in our logistics operations and met critical milestones in our Southeast fulfillment center project. Between our existing Bellville and Dubuque facilities, we have increased the speed and capacity for sorting and relaying inbound inventory, and we have automated scanning and manifest printing on outbound orders that will save freight costs. The efficiencies we are seeing in managing fulfillment costs are directly related to the value these investments are bringing. In addition, our inventory position between fulfillment centers and stores is in great shape and has contributed to the outstanding work our store teams are doing to convert traffic to sales by having the right inventory in the right place.\n\nIn the Southeast fulfillment center project in Adairsville, Georgia, we are on schedule with the facilities infrastructure in place and the delivery of the auto store material equipment is ahead of schedule. Our plans are to go live during Q3 of next year. Regarding our technology strategy, under the direction of our new chief technology officer, we have strategically redirected our technology investments and have prioritized a new warehouse management system to advance our Southeast fulfillment center capabilities and have paused on the upgrade of our current ERP system. The upgraded cloud native version-less warehouse management system will provide end-to-end supply chain and logistics process orchestration, resulting in vastly improved inventory management and terms.\n\nThe prudent management of expenses is always heightened in our business. But in the inflationary environment and uncertain consumer outlook that exists today, we're acutely focused on ensuring that operating and capital outlays we make our core to supporting our strategic priorities. With that, the heightened levels of macro and consumer uncertainty that have weighed on our business in 2022 is impacting our plans for 2023. That said, I want to again emphasize, we will continue to control our cost and conservatively plan our inventories, but we remain steadfast on carrying out our Big Dam Blueprint, which serves as the Foundation for Duluth Trading Company's long-term success and value creation.\n\nNow, I'll turn the call over to Dave to provide more details on our third quarter results and discussion of our year-end outlook. Dave?\n\nDave Loretta -- Chief Financial Officer\n\nThanks, Sam, and good morning. For the third quarter, we reported net sales of 147.1 million, up 1.3% compared to 145.3 million last year, and up 8.6% compared to the same period in 2020. Our direct channel sales were up 6.8% from last year, which included online sales growth in store markets of low double digits and a nonstore markets of low single digits. Our retail channel was down 6.6% in the quarter, representing a significant improvement to the trend in the second quarter of over 500 basis points and benefited from outstanding conversion of the store traffic to sales of over 300 basis points.\n\nTraffic to our stores is still below the prior year but has improved to being down mid-single digits versus mid-teens in the second quarter. Total net sales growth was strongest in our established Midwest, Southeast, and Northeast markets. As we shared on our last call, better supply chain flow and targeting earlier receipt dates on our inbound inventory positioned as well during the third quarter and better supported our transition into the fall and winter season. Sales turned positive in early September and continued through October, up mid-single digits to last year.\n\nAs planned, we increased the marketing investments during the quarter to align with the inventory position and focused our messaging on new seasonal products. Our women's AKHG launch and drive in traffic for our annual Big Dam birthday sale event and our pre-season global sale event in the end of October. As we entered the fourth quarter, holiday shopping was slow to get started relative to last year's industry push to get consumers to buy early. The first two weeks of November, during the midterm elections, sales were down mid-teens.\n\nFor the last two weeks of November, sales were down high single digits to last year, and that trend continued for the four-day period of Black Friday through Cyber Monday. We are seeing a more near term ramp-up of gift-giving shopping, supported by a healthier inventory position that is helping to convert traffic into sales in both our store and direct channels. We are beginning to lapse easier sales growth comparisons in the months of December and January. That said, given broader consumer headwinds and impact on discretionary spending, we are lowering our fourth quarter and full year sales and earnings outlook.\n\nAs Sam shared. the strategic targeting actions to retain and reactivate customers produce healthier results in our buyer file, where we are now realizing an increase in the year-to-date retention rate compared to last year, which is being driven by customers who have been with us for greater than one year. Our third quarter gross profit margin was 52.3% compared to 57.6% last year. This represents an 8% decline in gross profit dollars to 76.9 million in the third quarter, which was the result of a shift in mix from full price to promotional price selling and indicative of the customer being impacted by the inflationary environment and responding to price promotions more than in the past.\n\nImportantly, as we took action to be in-stock on seasonal items coming out of the summer, we ended the quarter up roughly 40% in our fall/winter assortment that has supported the sales growth and filled our stores with the necessary inventory to drive holiday shopping. Additionally, we're keeping our eye on the merchandise mix and taking markdown actions on slow-moving items to prevent the end-of-season buildup. Our level of clearance inventory currently at mid-single digits as a percentage of total is in a good spot for where we are during the season. Turning to expenses, SG&A for the third quarter increased 7% to 84.3 million compared to 78.8 million last year.\n\nAs a percentage of net sales, SG&A expense increased to 57.3% compared to 54.2% last year. This included an increase of 2.4 million in general and administrative expenses, 1.8 million in advertising and marketing expenses, and an increase of 1.3 million in selling expenses. Selling expenses as a percentage of net sales increased 70 basis points to 17.1% compared to 16.4% last year, and was driven entirely by higher shipping cost and outbound customer shipments due to fuel surcharges and a greater mix of direct sales versus store sales during the quarter. We manage their variable costs very well during the quarter, with our store and fulfillment center operations delivering labor efficiencies and flexing their controllable costs.\n\nWe expect to realize slight deleverage in selling expenses in the fourth quarter due to the higher outbound shipping costs related to ongoing fuel surcharges. And the expected mix of sales weighted more toward the direct channel. Advertising and marketing costs were 19.6 million in the quarter compared to 17.7 million last year and, as a percentage of sales, increased 110 basis points to 13.3% compared to 12.2% last year. An increase in the paid digital media channels and shifting some catalog circulation back into the third quarter drove the higher marketing spend.\n\nAs Sam noted, we are making purposeful adjustments to the media channel mix in the interest of gaining more visibility to our target customer of 40- to 50-year-olds, while maintaining presence with our existing customers in the traditional linear TV channels. In traditional TV media flights, we measure the spikes in brand search volume and new website visits during the high-impact placements, particularly during sporting events. In addition, we launched our first TikTok takeover placement on National Underwear Day in early August and realized over 50 million impressions and awareness that drew visits to our underwear collection online. We expect our advertising and marketing costs will be below last year in the fourth quarter, but will include a greater mix of digital media tactics of nearly $2 million, focusing on new product arrivals and innovation.\n\nWe expect to realize slight deleverage in Q4, given the increase in the Q3 spend and the shifts we made in the prior year to better align with our inventory position in the back half of the year. General and administrative expenses as a percentage of net sales increased 130 basis points to 26.9% compared to 25.6% last year. The 2.4 million increase from last year represents personnel and technology costs, as well as fixed costs for our new Southeast fulfillment center that is scheduled to open in the third quarter of next year. Additionally, related to the decision to reprioritize technology initiatives and pause the ERP upgrade, we have taken a one-time write-down of 1.1 million related to the implementation costs incurred in the early stage of the project.\n\nWe expect our fourth quarter overhead expenses will be below last year as we realize savings in personnel and incentive costs due to the expected lower full year sales and earnings and be roughly flat on a percentage of sales in Q4 compared to last year. As of today, our store count stands at 65 with no planned store openings for the balance of the year. Adjusted EBITDA for the third quarter was 1.7 million. Our net loss for the third quarter was 6.2 million, or $0.19 per share, compared to $0.09 per diluted share profit reported in the third quarter last year.\n\nOn a year-to-date basis, our operating income, absent the ERP capital project write-down and associated operating expenses, as well as expedited freight costs, totaling approximately 6.3 million, would have been positive. With our year-to-date sales down 3.8%, generating positive operating income, while we were making the strategic investments to support long-term growth, highlights the underlying health of our business model. Moving on to the balance sheet. We ended the quarter with net working capital of 98.7 million, including 9.4 million in cash and 10 million outstanding on our line of credit, which has since been paid off.\n\nThe increase in inventory compared to last year and related decrease in cash and use of the line of credit were driven by the strategic decision to improve our inventory flow. Our inventory level is 24% higher than last year at quarter end and is in a healthier position with more timely receipt of both year-round and seasonal goods. Compared to two years ago, inventories are slightly down and reflect our objectives of being more efficient in driving increased inventory turns. The increase in total inventory units is roughly 19% over last year, with the delta to our total dollar increase, reflecting higher average costs and a shift in the mix of balances with growth in our women's Collections and ALHG sub-brand.\n\nAt the midpoint of our revised sales guidance, we would expect to end the year with inventories up mid-teens compared to last year and down low double digits compared to 2020. Our capital expenditures year to date of 24 million, including the cost of software implementation, is in line with our plans. Our outlook for the full year capex is reduced to 35 million, reflecting the reprioritized technology initiatives, but continued investments and logistics automation. The expansion of our fulfillment network with the new facility in the Ayersville, Georgia and retail store test-and-learn initiatives, such as the women's footprint expansion as Sam discussed.\n\nWe remain confident that the strategic priorities outlined in our Big Dam Blueprint and resulting capital investments are the keys to driving growth longer term in our business. Since the introduction of our strategic roadmap a little over a year ago, we've made many strides and completed key initiatives, such as the replatforming of our website enabling the progressive web app technology, the launch of phase 1 of our merchandising lifecycle management suite of tools, the expansion of our marketing technology that has allowed us to identify and leverage customer data analytics and adjust our marketing mix to drive digital traffic, and the completion of our customer journey mapping to inform actions that elevate the in-store experience. In addition, we have completed the remodel of our St. Charles, Missouri store to test a new customer-informed design, including a new floor plan, fixturing, and signage package.\n\nAnd we've expanded the women's footprint in 20 of our stores to elevate growing women's business. Moving to our outlook for the fourth quarter and full year, we now expect sales in our direct channel to be down mid-single digits in the fourth quarter. For retail sales, we expect to be down to prior-year high single digits in the fourth quarter. With the higher promotional sales environment, we expect gross profit margin to be down roughly 350 basis points in the fourth quarter, with the full year gross profit rate down year over year, 180 to 200 basis points.\n\nAdvertising expense in the fourth quarter will be roughly 3 million less than last year as planned. With selling expenses, we expect the fourth quarter to be flat to down 30 basis points as a percentage of sales. Overhead expenses will be roughly 2 million less than last year in the fourth quarter. We are updating our full year guidance with net sales of 650 to 680 million, adjusted EBITDA of 42 million to 49 million, and EPS in the range of $0.05 to $0.20, reflecting a wider range due to the heightened uncertainty with consumers' holiday spend activity and impact from heavier promotional pricing environment.\n\nOur teams remain focused on executing a great peak season push and managing what is in our control. Sam, I, and the entire leadership team would like to wish you all a happy and healthy holiday season. And with that, we will open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Jonathan Komp with Baird. Please go ahead.\n\nJon Komp -- Robert W. Baird and Company -- Analyst\n\nYeah, Hi. Good morning. Thank you. I want to just maybe gauge your overall sense of the trends you're seeing in your business.\n\nI know you highlighted the third quarter, some of the sequential improvement you saw on both channels. But it looks like, you know, the fourth quarter, you're embedding the opposite, you know, return to negative year-over-year performance for both direct and retail. So, what do you make of sort of the trends you're seeing? And then given some of the commentary, do you think it's going to be hard not to still show sales declines going into the first half of next year?\n\nDave Loretta -- Chief Financial Officer\n\nYeah. Hi, John. You know, where we were seeing some of the trends that I mentioned on the call coming out of our third quarter, November, the first two weeks, in particular, were kind of the toughest. And we attribute a portion of that to the early shopping as last year.\n\nAnd so, earlier in November, going up against tougher comps. Last year, our November, we posted an increase over the prior year of low teens. And so, we're comp -- it was a toughest month for us to comp. But going into December and January, we're comping easier periods relative to last year, both from the sales trends, shopping behavior.\n\nAnd our inventory position was really tough as we move through December. So, as I mentioned, you know, the more near-term trend of down. Kind of high single digits that we saw come in through the back half of November and through Cyber Monday is really where we expect some of the rest of the period to play out, but with more upside in the coming weeks than we saw in the first part of the quarter. But, you know, that being said, I think we're looking into next year and we're still planning it.\n\nWe had inventory issues in the first half of last year, in the first quarter, in particular. And so, I think we'll see some momentum because of that. But the overall consumer backdrop, at least as we're seeing it, isn't going to drive a significant growth, you know, over the next few months.\n\nJon Komp -- Robert W. Baird and Company -- Analyst\n\nThanks. That's helpful. And maybe a follow up then to understand how you're planning the organization. You know that the margin for the business this year will be the lowest that, you know, is in our model looking backward.\n\nAnd I'm just curious if the sales, you know, were not according to your plan and stayed negative, how long would it take or how much pressure would you need to see incrementally on the top line before you took a different approach to the operating structure or the cost structure of the business, or maybe anything more drastic than the current actions you've outlined t, you know, slow some of the incremental spend.\n\nSam Sato -- President and Chief Executive Officer\n\nYeah, Jonathan. It's Sam. How you doing? Yeah. So, a couple of things.\n\nYou know, we've got some, you know, expense flexibility within opex specifically. You know, our intentions at this stage, you know, while the near-term challenges certainly are impacting our results, you know, we're currently, you know, focused on unlock unlocking the company's full potential longer term. And as we talked last year, you know, just really beginning the journey of infrastructure and technology and investments. And we've got a number of, you know, things that are in the works.\n\nAnd, you know, certainly we're excited about where we are with Adairsville and what value that that will create. The pivot to a different warehouse management system that will allow us to optimize, that investment in Adairsville is exciting. And in fact, I think it lowered our capex spend next year to 35 million or something like that -- or this year. Yeah.\n\nAnd so, as we think about next year, you know, while at a high level, you know, where going to stay the course on our investment strategy for the long term. We also recognize the importance to manage the business as well. And so, you know, as we've always said, we're acutely focused on managing expenses. You know, we're being highly critical of investments that are outside of kind of the must haves to deliver our strategic initiatives.\n\nAnd, you know, as we think about next year and as Dave said, you know, we'll share more on our next call as we're finalizing the plans for '23. You know, we're going to take a really conservative approach, not just to sales and margins, but also, you know, expenses, capital, but also not take a short-term look necessarily in our strategic initiatives and what investment requirements will be necessary to unlock that.\n\nJon Komp -- Robert W. Baird and Company -- Analyst\n\nUnderstood. Thanks for sharing the color. \n\nSam Sato -- President and Chief Executive Officer\n\nYup. You bet.\n\nOperator\n\n[Operator instructions] Our next question comes from Jim Duffy with Stifel. Please go ahead.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nOh, thank you. Good morning. Thanks for taking my question. You guys gave a lot of detail on categories on the call.\n\nSounds like you're having good success with women, you're having some success with new products. Men's core product, however, has been a challenge. Sam, can you speak to customer acquisition dynamics? You're turning to promotion to reengage existing customers. Is that improving customer acquisition as well?\n\nSam Sato -- President and Chief Executive Officer\n\nYeah. Hi, Jim. Thanks. Yeah.\n\nSo, we're obviously, you know, excited about the continued traction we're gaining with women's. Total business was up 10%. Obviously, that's success we're starting to see with the introduction of AKG. And we're supporting that with investments like that the 20-store reconfiguration we've done in order to give women's greater space and improved shopping experience.\n\nAnd equally important, you know, as AKHG starts to grow, you know, it requires its own dedicated space in the stores as well. So, those are all good things. And you know, our customer acquisition, new customers are reaching this 50-50 point now between men and women, which is exciting for us. Our current female shoppers are at its highest peak that, you know, over the last three years.\n\nAnd so, that's again exciting for us. So, you know, we remain confident in our product strategy and our marketing strategy to not only engage the female shopper, but also, you know, as we as we discussed a few calls ago and continue to our target consumer at 40- to 50-year-old, we're getting traction there which, is a good sign. And, you know, we want to be careful that we don't alienate our core consumer who's in their mid-50s, but at the same time recognize the need to build a business for the future based on a slightly younger consumer that really is you know, in the spending kind of height of their lives and career. So, you know.\n\nBoth of those elements to our marketing strategies and customer acquisition strategies we continue to see really good progress there. And we're pleased with what we're seeing.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nOK. And then it's a step backwards in promotion from previous strategies. I'm curious how you see the balance between promoting support sales and moving inventory versus conditioning the consumer that the brand is always on sale. Perhaps related to that, I was wondering if maybe this causes you to rethink your pricing architecture.\n\nIt sounds like you're having success engaging new consumers with core products. But if I interpret your comments, it sounds like new consumers aren't coming back to -- I'm sorry, your existing consumer base isn't coming back to core products unless they're on sale.\n\nSam Sato -- President and Chief Executive Officer\n\nYeah, so really important question. And so, a couple of things I'll say. One is, you know, we're always going to balance and take a strategic approach to how we balance price and brand integrity. We want to be really careful about that.\n\nAnd, you know, in this heightened promotional period we're in, you know, everyone is faced with, you know, inflationary issues. And, you know, it clearly has taken a toll on the consumer, and we're not immune from that. Having said that, we think that, you know, the products we build to deliver against solutions and durability needs and expectations that our consumers have, our price value relationship is really good. It's just, you know, we're faced with a highly promotional, volatile environment right now.\n\nAnd so, you know, while we've got to be more promotional than we are historically, we're also making sure that we're not having a fire sale, so to speak. And I think in certain areas of the business, specifically, again, back to women's and AKHG and some of the new innovation, like our Funk No men's underwear, you know, the success in those areas continue to show that our brand strength is as good as it's ever been. And it's just we're competing with, you know, highly promotional activity that now is about share our wallet. And that share of wallet, you know, has over the spend has reduced because of you know inflationary issues.\n\nSo, I wouldn't say so much that we are rethinking our pricing or our regular pricing strategy. You know, we're going to build products that satisfy the needs of our customers through the lens of durability and performance and solution-based. But we also recognize that at times, you know, we've got to be competitive. We've got to make sure that we're strategically taking the appropriate actions to not allow our inventories to back up.\n\nAnd then that creates a whole different dynamic as we experienced two years ago. But having said that, you know, we're investing heavily in innovation, and we recognize that innovation with the right price-value relationship is critical. And so, our teams continue to think about that and think about other areas of the business, whether it's price or adjacent categories, that we can continue to innovate into.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you for that perspective. Maybe one last one. Should we interpret your comments on the cautious approach to 2023 to mean that perhaps you're backing away from planned store openings?\n\nSam Sato -- President and Chief Executive Officer\n\nYeah. Not necessarily. I would just say, you know, as we laid out in our Big Dam Blueprint, you know, the big chunk of our investments are based on a digital-first mindset, digital-first business. And really, you think about, you know, for example, our traffic and transactions coming from a mobile device are at their highest levels that they've ever been.\n\nAnd we're consistently holding to those levels and, in fact, continue to grow as a percentage to our total online business. So, we recognize that, you know, our investments have to be about enabling a digital marketplace, so to speak. Having said that, we recognize stores are a really important piece of our omnichannel customer experience. And it's about, you know, gaining and garnering new consumers.\n\nWe recognize that it's a place to provide incredible service opportunities for the consumer. Whether it's buy and line and pick up in-store, or even return or exchange product, we recognize the importance of that. Hence, you know, we just completed a remodel in our St. Charles, Missouri store to a new format, which was based on a lot of work we did with the consumer in terms of what they want and expect out of a modern customer experience journey.\n\nAnd so, we've done that. And so, we're going to continue to look for opportunities to open source, but we're going to be highly opportunistic about that, given the backdrop of what we are expecting in 2023 and some of the priorities we have around, you know, technology and logistics investments. You know, we want to be really prudent about where our capital outlays go and again building for the long-term value. And growth benefits of the company.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nUnderstood. Thank you, Sam. And best of luck to the team through the holiday season.\n\nSam Sato -- President and Chief Executive Officer\n\nAppreciate it. Happy holidays.\n\nDave Loretta -- Chief Financial Officer\n\nJim.\n\nOperator\n\nOur next question comes from Dylan Carden with William Blair. Please go ahead.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nThanks. Point of clarification, did you indicate that inventories would be up mid-teens by year end? Did I hear that right?\n\nDave Loretta -- Chief Financial Officer\n\nThat's right. That's the estimate.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nAnd so, I guess the disconnect there, the spread between kind of the implied guidance for sales -- or actually the actual guidance for sales, would you suggest potentially that the gross margin pressures kind of persist into the front half of next year, which I imagine you're not going to blast necessarily, but maybe will help us out as far as modeling? You know, when does freight at least turn into a tailwind? You know, how are you thinking -- you were asked kind of about pricing, but, you know, what sort of the currency of the inventory and the risk of, you know, additional promotions kind of into the front half of the year? Anything you can say around that? Thanks.\n\nDave Loretta -- Chief Financial Officer\n\nYeah, absolutely. You know, while inventories may land up mid-teens compared to last year. It would still be on par slightly below two years ago. And that's really a function of where our inventory was last year, unfortunately, below where it needed to be.\n\nSo, we just -- we're getting back to the level that's necessary to enter our spring summer season. You know, we expect while clearance levels today are mid-single digits, we would end up maybe high single digits as we look forward to the back to the end of the fourth quarter. And that's not unusual for where we end the season. And so, we don't see that the margin pressure will be there.\n\nWe do have a tailwind on freight expense in the first quarter of next year, that -- roughly almost $4 million that will lapse and get the benefit on the gross profit margin for. But product margins will probably still be tougher than they were last year, but not due to an overhang of inventory. But just simply due to competitive pricing environment we're in. So, we're not we're not concerned with the higher inventory levels just compared to prior year.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nAwesome. Thank you, Dave. And then, kind of just curious, you know, from an outsider's perspective here, it seems like, you know, the sales from the blueprint aren't necessarily materializing, but the costs are. And sort of pausing the ERP deployment is a little bit telling in that same regard.\n\nYou know, what's the capacity here to kind of -- it sounds like, as far as the guidance in the fourth quarter, pull back on some of the costs here that maybe we're building out to, you know, billion dollars in sales, or whatever the ultimate target might land? You know, that's something where we should see a deeper reduction in SG&A, in particular, sort of next year.\n\nSam Sato -- President and Chief Executive Officer\n\nYeah. Maybe I'll answer the first part of that, Dylan. This is Sam. So, as you know, as I said in my prepared remarks, the current environment, it's posing near-term challenges for the business for sure.\n\nAnd we're going to, you know, prudently focus on managing expenses. Having said that, you know, we're focused on unlocking the full potential long term. And so, yeah, are there some -- you know, there is some flexibility in our opex as we move into next year for sure. But we're not going to necessarily cut our nose off despite our face, meaning, you know, there's certain things that we believe we've got to invest in, in order for our business to scale and continue to grow sustainably long term.\n\nAnd that's largely around technology and logistics. And so, while, you know, we may, depending on, you know, what next year looks like, we may extend the timeframe of those capital investments. The investments themselves will ultimately have to be made in order for us to deliver against a longer-term value proposition. Specific to the pause on the ERP, that was really more about, you know, as our new CTO came in and looked at our infrastructure and our in our current course and speed said, you know, we really should prioritize, and we would get greater near-term value out of a more optimized warehouse management tool than ERP.\n\nAnd so, he really advised us and made the call, as you know, we expected him to give us kind of a reprioritization through his expert lens on not only where we would get greater value, but importantly in these conditions, you know, where we could potentially get greater near-term value. And so, I think that was the appropriate call. And we eventually are going to replace the ERP system. We're going to have to do that.\n\nBut it's now moved down the priority list because AJ believes there's, you know, other areas that take greater priority and will deliver greater results for us faster.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nThanks, Sam. Appreciate that. Best of luck for all of you.\n\nSam Sato -- President and Chief Executive Officer\n\nSure. Appreciate it.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNitza McKee -- Investor Relations\n\nSam Sato -- President and Chief Executive Officer\n\nDave Loretta -- Chief Financial Officer\n\nJon Komp -- Robert W. Baird and Company -- Analyst\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nDylan Carden -- William Blair and Company -- Analyst\n\nMore DLTH analysis\n\nAll earnings call transcripts"
}