{
  "companyName": "VNET Group, Inc.",
  "companyTicker": "VNET",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/31/vnet-group-inc-vnet-q2-2022-earnings-call-transcri/",
  "content": "VNET Group, Inc. (VNET -0.87%)\nQ2 2022 Earnings Call\nAug 30, 2022, 9:00 p.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for the second quarter 2022 earnings conference call for VNET Group, Inc. At this time, all participants are in a listen-only mode. After the speakers' presentations -- after the management's prepared remarks, there will be a question-and-answer session.\n\nParticipants from our management include Mr. Samuel Shen, chief executive officer and executive chairman of Retail IDC; Mr. Tim Chen, chief financial officer; and Ms. Xinyuan Liu, investor relations director of the company.\n\nPlease note that today's conference call is being recorded. I'll now turn the call over to the first speaker today, Ms. Xinyuan Liu. Please, go ahead.\n\nXinyuan Liu -- Director, Investor Relationsc\n\nThank you, operator. Hello, everyone, and welcome to our second quarter 2022 earnings conference call. Our earnings release was distributed earlier today. And you can find a copy on our IR website, as well as on Newswire services.\n\nPlease note that the discussion today will contain forward-looking statements made under the safe harbor provisions of the US Private Securities Litigation Reform Act of 1995. Forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from our current expectations. For detailed discussions of these risks and uncertainties, please refer to our latest annual report and other documents filed with the SEC. VNET does not undertake any obligation to update any forward-looking statements, except as required under applicable laws.\n\nPlease also note that VNET's earnings press release and this conference call include the disclosure of unaudited GAAP financial measures, as well as unaudited non-GAAP financial measures. VNET's earnings press release contains a reconciliation of the unaudited non-GAAP measures to the unaudited GAAP measures. As a reminder, this conference is being recorded. In addition, a webcast of this conference call will also be available on our IR website at ir.vnet.com.\n\nI will now turn the call over to our CEO, Samuel.\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nAll right. Thank you, Xinyuan. Good morning, and good evening, everyone. Thank you for joining our second quarter 2022 earnings conference call.\n\nDuring the second quarter, our focus remains on driving healthy results and delivering high-quality solutions and services to our customers. Our solid growth momentum across our business segments, amid macro challenges, clearly reflects the effectiveness of our growth strategy and our strong execution capabilities. On the operations front, total cabinets under management increased to approximately 80,800 by the end of the second quarter, compared with approximately 62,900 one year ago. At the same time, cabinets utilized by customers increased sequentially by approximately 1,500 to 44,500 by the end of the second quarter, compared with approximately 36,600 one year ago.\n\nAccordingly, the overall utilization rate maintained a sequential ramp-up, reaching 55.1% by the end of the second quarter. Our retail MRR per cabinet reached RMB 9,186, showing a healthy increase from the same period last year. On the financial front, we delivered a robust financial performance, with a year-over-year growth of 15.2% and 14.5% in revenue and adjusted EBITDA year over year, respectively. With the rapid growth of China's digital economy, we, as a leading IDT service provider, are in a good position to benefit from this growth momentum and local government support measures.\n\nThis may the National Committee of the Chinese People's Political Consultative Conference held a consultative session and call for stronger efforts to boost development of the digital economy across the broad swath of industries. Technological empowerment was highlighted as a vital driver for higher quality economic growth. We believe this will carry immense potential to significantly amplify demand for IDC services. Within this environment, we are confident in our strength and our ability to capture exciting new growth opportunities.\n\nNext, let's take a closer look at the business update, starting with the recovery momentum from the impact of COVID resurgences. Encouragingly, in June, with the gradual easing of COVID-19-related lockdowns and mobility restrictions in Shanghai, Beijing, and Hebei province, we immediately resumed construction on new projects in these areas and have seen moving rates recovering steadily. Next, a review of our progress in key business segments during the quarter. Our wholesale business made solid progress in the second quarter.\n\nWe once again extended our contract with an existing customer, a leading social platform in China, for building its network infrastructure in the northern region of China. This new order will generate total capacity of approximately 14 megawatts and further demonstrates our value proposition for this business segment. In addition, we recently signed a new contract of approximately 15 megawatts with the leading cloud service providers in China to build its network infrastructure in the Yangtze River Delta region. In the data center for this customer, aside from conventional air cooling, we will also offer liquid cooling solutions a more sustainable approach that will help reduce PUE and carbon emissions.\n\nMoving on to our retail business. Thanks to our diversified customer base. We are pleased to see our retail business growing steadily amid macro challenges. In the second quarter, we leveraged our technologies and expertise to cater to various vertical needs with a suite of very ag services, existing customer expansion, and new customer acquisition, both achieved impressive results, driven by rising digital demand from a wide variety of industries, such as local service, automobile, financial services, power manufacturing, and online gaming.\n\nLooking ahead, we plan to harvest our advanced engineering capabilities to reach our service portfolios, creating more value for our customers and generate more diverse revenue streams. On the Blue Cloud business front, we continue exploring opportunities that will allow us to diversify our industry-specific cloud solutions during the second quarter, we extended our manufacturing execution system, AKA MES to a leading automotive seating manufacturer in China. Through the delivery of MES, we help the customer, manage manufacturing flexibility, improve productivity and maximize efficiency by deploying digitalization, automation, and new technologies that will provide a real-time workflow visibility, flexibility, and insight into the entire manufacturing operations process from order release to ready to forge shipment. This system has been successfully implemented across all of our customers' production lines, and we're very pleased with the progress we have made in this area.\n\nIn the meantime, we are actively accumulating more industry-specific expertise and look forward to tap into greater opportunities in the cloud business industry in the future. Despite macro headwinds, the unprecedented COVID-19 resurgence, and lockdowns in the first half of the year, our sustained growth highlighted our excellent business resealing and our ability to capture the rising demand for high-quality IDC services. However, in the near term, the uncertain economic outlook and threat of COVID-19 outbreaks may bring some short-term challenges to us. While the long-term demand trend is secure, taking into account the short-term challenges of the current slowdown environment and the impact from COVID-related disruptions.\n\nWe are adjusting our outlook for the full year of 2022 and revising our full year delivery plan to the range of 9,400 to 12,400 cabinets from previously provided 14,400 to 17,400 cabinets. Going forward, we remain focused on our dual-core growth strategy, leveraging our scalable service offerings to drive growth and building our customer base across verticals. As the industry frontrunner and the fundamental link in China's digitalization change, we will see the opportunities from the nation's rapidly expanding and evolving digital economy, creating sustainable value for our stakeholders in the long term. Thank you, everyone.\n\nWith that, I will now turn the call over to our CFO, Tim Chen, to discuss our financial performance for the quarter and our business outlook. Hi, Tim.\n\nTim Chen -- Chief Financial Officer\n\nThank you very much, Samuel. Good morning, and good evening, everyone. Before we start the detailed discussion of our financials, please note that we will present non-GAAP measures today. In our non-GAAP results exclude certain noncash expenses, which are not part of our core operations.\n\nThe details of these expenses may be found in the reconciliation tables included in our earnings press release. Please also note that unless otherwise stated, all the financials we present today are for the second quarter of 2022 and in renminbi terms. For the second quarter, again, we delivered a robust financial performance driven by rising demand from both our wholesale and retail businesses. Our solid financial position gives us a firm foundation to drive a long-term and sustainable growth, as we continue to leverage our scalable service offerings and build our customer base across a wider variety of industries.\n\nNext, let me walk you through our second quarter financial results. Unless otherwise specified, the growth rates I will be reviewing are all on a year-over-year basis. In the second quarter, our net revenue increased by 15.2% to RMB 1.72 billion from the same period last year, mainly due to increased customer demand, for our highly scalable carrier and cloud-neutral IDC solutions from both wholesale and retail IDC customers, as well as the continued growth of our cloud business. Gross profit was RMB 357.8 million in the second quarter of 2022, roughly flat, compared with the same period of 2021.\n\nGross margin was 20.7% in the second quarter of 2022, compared to 24% in the same period of 2021. Adjusted cash gross profit, which excludes depreciation, amortization, and share-based composition expenses, was RMB 713.7 million in the second quarter of 2022, an increase of 11.5% from the same period of 2021. Adjusted cash gross margin in the second quarter of 2022 was 41.4%, compared to 42.8% in the same period of 2021. Adjusted operating the compensation for postcombination employment in acquisition and impairment of loan receivables to potential investees, were RMB 250.7 million in the second quarter of 2022, compared to RMB 235.6 million in the same period of 2021.\n\nAs a percentage of net revenues, adjusted operating expenses in the second quarter of 2022 were 14.5%, compared to 15.7% in the same period of 2021. Adjusted EBITDA in the second quarter of 2022 was RMB 486.9 million, representing an increase of 14.5% from the same period of 2021. Adjusted EBITDA in the second quarter of 2022 excluded share-based compensation expenses of RMB 47.5 million. Adjusted EBITDA margin in the second quarter of 2022 was 28.2%, compared to 28.4% in the same period of 2021.\n\nOur net loss attributable to ordinary shareholders in the second quarter of 2022 was RMB 377.2 million, compared to a profit -- or a net profit of RMB 455.9 million in the same period of 2021. Basic and diluted loss were both RMB 0.43 per ordinary share and both RMB 2.58 per ADS. Each ADS represents six Class A ordinary shares. Turning to our balance sheet.\n\nAs of June 30, 2022, the aggregate amount of the company's cash, cash equivalents, and restricted cash was RMB 3.62 billion. Meanwhile, net cash generated from operating activities in the second quarter of 2022 was RMB 942.7 million compared to RMB 314.8 million in the same period of 2021. Our capex in the second quarter of 2022 was RMB 540.6 million. And now on to our financial outlook.\n\nAs Samuel mentioned, we faced the impact from COVID-related disruptions in the second quarter of 2022 on data center construction and customer moving schedules, and ongoing macroeconomic uncertainties as well. As a result, we adjusted our outlook for 2022. Based on our current estimates, we expect our net revenues to be in the range of RMB 7,250 million to RMB 7,550 million and adjusted EBITDA to be in the range of RMB 1,800 million to RMB 1,950 million. We always believe opportunities go alongside challenges.\n\nThe COVID impacts are short term in nature, and digitalization is rapidly advancing in the wider society. Looking ahead, we will remain committed to advancing our dual-core growth strategy, broadening the spectrum of our services, increasing customer diversification, and capitalizing on the enormous opportunities presented by a thriving digital economy in China. This concludes our prepared remarks for today. Operator, we are now ready to take questions.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] First question comes from the line of Ethan Zhang from Nomura. Please proceed.\n\nThank you.\n\nEthan Zhang -- Nomura -- Analyst\n\nThank you, management, for letting me ask the first question. So, I have two questions. So, the first one is, given the current situation of the electricity supplies in China, especially the heat wave in and surrounding areas, how do you see the trend of the utility cost in the second half of this year and the impact on our EBITDA margin? And second question is regarding the capex trend. So, I remember, we guided around RMB 5 billion capex for the full year 2022.\n\nBut during the first half, since that we only completed a limited portion of our capex target. So, I just wonder, if we maintain the previous guidance on our capex spending for this year and how would we focus or target for capex spending in the second half of this year? Thank you.\n\nTim Chen -- Chief Financial Officer\n\nThank you very much, Ethan. Let me take the first two questions. First, in terms of electricity, and impact of some of the areas, Sichuan, as an example, we do not expect to be a major increase in the electricity tariffs. However, in the areas that are impacted by electricity shortages, not dissimilar to last year and early parts of this year, where some of the data centers would need to switch over to diesel or we would actually acquire diesel in preparation for potential shortfalls in terms of electricity supply.\n\nI think that will show up in the figures for the second half, especially for anything in the affected areas. As to the capex and whether there are any changes to the capex guidance, we still expect to spend roughly in the range of RMB 4 billion and that's despite some of the capacity being pushed into 2023. As you know, these constructions do have a longer lead time. And so there will still be money being spent with regards to the power infrastructure, the buildings, and so forth.\n\nIt would just be a slowdown a little bit, but we still expect that it will be for the full year around RMB 4 billion. I hope that answers your questions.\n\nEthan Zhang -- Nomura -- Analyst\n\nThank you.\n\nOperator\n\nThank you for the questions. Our next question comes from Edison Lee of Jefferies. Please proceed with your question.\n\nEdison Lee -- Jefferies -- Analyst\n\nHi, morning, Samuel and Tim. Thank you very much for the presentation. I want to see what kind of power cost increases that you are assuming in your new guidance for the second half. And also, I want to know, what are the two new wholesale projects? What is the timing in terms of service launch and EBITDA contribution? Thanks.\n\nTim Chen -- Chief Financial Officer\n\nHi, Edison. Let me talk about the first one. So, in terms of the second half, we've assumed small increases in terms of coming from the power side. As you know, some of the power increases already took place in the first half.\n\nWe do expect a little bit of further increases, but not in really the Tier 1 areas, but I would say the other areas the regions. We can go into some other the details later on, but not a very large increase. I think in the full year, we had given to the market previously, it was about a 1% margin impact I'd say that this moves the needle a little bit in the second half, but nothing that would be very material. Let me pass to Samuel to talk a little bit about the two wholesale wins.\n\nThanks.\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nSure. Thank you, Tim. And also thank you, Edison, for the questions. Regarding the wholesale wins, that we announced today, the social platform, it is actually an existing customers, but with a new contract.\n\nAnd basically, a country signed in the second quarter. And then for another one, which is public cloud service providers. And then we're expecting to sign the contract in Q3. And we're very pleased because spend quite a bit of time working with the customers and finally secure a design win.\n\nSo that's pretty encouraging for us.\n\nEdison Lee -- Jefferies -- Analyst\n\nSorry, Samuel. Can you talk about the timing of these contracts coming into service? And --\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nOh, yeah. As I said, the social platform wins, that would be second quarter, this quarter. And then for public cloud service providers, the contract will be signed in Q3. And we expect this to be serviced and the ramp-up starting from Q4, this year.\n\nTim Chen -- Chief Financial Officer\n\nOK. So, Edison, both of these, I would say, are small or negligible contribution in 2022, but the ramp-ups should be within 2023.\n\nEdison Lee -- Jefferies -- Analyst\n\nSo, is the ramp-up period also two years for these two projects?\n\nTim Chen -- Chief Financial Officer\n\nThey should actually be quite quick. Again, contractually, as you know, our customers will sign a commitment but what we've seen at least from the customers that we've just talked about. They can actually ramp up, extremely quickly. So, I would say, at the moment, probably assuming that most of the ramp-up should be within 2023 for these projects.\n\nEdison Lee -- Jefferies -- Analyst\n\nOK. Thank you, Tim.\n\nTim Chen -- Chief Financial Officer\n\nYeah. Most welcome.\n\nOperator\n\nThank you for the questions. [Operator instructions] Our next question comes from the line of Alex Wang from Daiwa Capital Markets. Please proceed with your question.\n\nAlex Wang -- Daiwa Capital Markets -- Analyst\n\nThanks, management. So, my first question is regarding our pipeline, I understood that we cut our capacity addition plan in the near term. But I understand that we currently forecast roughly 17,000 for 2023-2024 capacity addition. So, I want to have more color on the spend.\n\nDo we have any change on two years guidance? And the second thing is about the utilization run-up, so how do you say ramp-up acceleration in exciting projects starting from June? So, could we add more color on the current utilization rate for existing wholesale projects in service, and given current macro and the current situation, I want to have more sense about what's the typical period for this kind of capacity rate, normalized utilization rate? Thanks.\n\nTim Chen -- Chief Financial Officer\n\nThank you, Alex. Let me take the first question in terms of the pipeline. You're correct. I think previously, we had a range from 14,400 to 17,400 in terms of the cabinet deliveries in 2022.\n\nWe did revise down, down to a range of 9,400 to 12,400. You'll see the details that we've included in the IR PPT, that be uploaded to our website. But -- so that is the range of guidance down from the 17.4 that you discussed earlier on. You'll see that the projects that we've taken out, again some of these, we expect to take place in 2023.\n\nThere's some related to construction slowdowns and then others related to customer demand being pushed back. And so rather than have everything ramped up in terms of delivering the cabinets and then waiting for the customer, we decided to also then match our pace of delivery with the customer requirements as well. For the second question, maybe I'll pass to Samuel, and he can address that for you.\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nYeah. In terms of the ramp-up for our wholesale customers, what happened is most of the customers basically from the contract, we're committed to have two years to ramp up to hit the 90% or even higher utilization rates. But in reality, from our experiences and by talking to the customers, given their business growth normally will be within a year, they basically hit the 90% or even higher. And so, for the two MOU that we talked about today, including the social platform and public cloud service providers, we have a high expectation that can ramp up to 90% or even higher within a year period of time, given the current forecast.\n\nAnd then separately, from a retail point of view, we're also seeing a momentum from the customer digital transformation trend as well. So, I would say, given, even though, with the macro conditions, a little bit uncertain. But the part -- business is pretty solid in the quarter ahead of time.\n\nAlex Wang -- Daiwa Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Sara Wang from UBS. Please proceed.\n\nSara Wang -- UBS -- Analyst\n\nHi, Sam and team. Thanks for the opportunity to ask a question. So, I have two questions. First is still on the delivery target.\n\nI mean, I asked what's the split between wholesale and retail of the delivery target of covenants. And another question is, so what's the increased magnitude or what's the magnitude of power tariff increase in the second quarter? I noticed that our adjusted EBITDA margin actually stayed relatively stable versus last -- so just what means if there's any other area, we can actually save cost to offset the power tariff increase? Thank you.\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nHi, Sara. Can you repeat the first part of the question, please, again?\n\nSara Wang -- UBS -- Analyst\n\nHi. The first question is what's the split between wholesale and retail orders of our delivery target?\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nOK. Thank you. Let me handle that first question. I'd say that right now, the split between the wholesale and retail, we're still looking at a similar split of around 60-40.\n\nSo, we've talked about, again, in the past 60-20, 20-60 being the wholesale and then scale retail and retail. So, we still expect that to be the same in that range more than half being wholesale related, maybe up to two-thirds being wholesale related. In terms of the power increases, again, the vast majority of the increase that we saw were in the Tier 1 cities. Again, the earlier part of the year, we saw them go up by anywhere from 10% to 20% in the Tier 1 cities.\n\nAnd so, we factored in the impact to the full year margins. In Quarter 1, we did have some tax rebates and other income, and then that's kind of some of the reasons behind why the margins in the first quarter weren't impacted as much. And then in the second quarter, there were some costs incurred there. But again, we have been quite focused on making sure we help to implement cost controls.\n\nSo, we'll continue to do that in the third and fourth quarter, but there are going to be limits to how much we can do to offset increases in our operating costs in general. Hope that helps, Sara.\n\nSara Wang -- UBS -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you for the questions. The next question comes from the line of Albert Hung of J.P. Morgan. Please proceed with your question.\n\nAlbert Hung -- JPMorgan Chase and Company -- Analyst\n\nHi, Samuel and Tim. Thank you for taking my question. My first question is, if I look at the 2022 new guidance, the EBITDA margin in a second half adjusted EBITDA could be like 22%, which is a multiyear low. Going now further on the one-off structural margin drag in second half, how does it drive the margin recovery in the next year? And the second question is the decline in revenue is mainly driven by wholesale or pro-based IDC demand weakness.\n\nAnd from your point of view, how long did you expect that the downside to will not? Historically, our spending will be the leading indicator for IDC, and right now, the average spending looks still quite weak in second half. Does that imply, first half of next year, we'll also see the slowdown in IDC? Thank you.\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nOK. Thank you, Albert. Let me take the first part of the question, and then maybe Tim can help to chime in with additional contacts. I think as Tim pointed out, the very -- the first quarter of the year because we did have the tax subsidies and annual reimbursement from the depository bank.\n\nAnd then so by removing the one-time thing and then the second quarter margin is pretty much on par. However, with the revised guidance, as you can see our second half EBITDA margin is going to be roughly about a 22% ratio. I would say in a nutshell, aside from the fact that some of the cost and expense got delayed to the second half due to the COVID outbreak, the lockdown in the first half. We are also expecting some of the support revenue in the pipeline.\n\nBasically, for new retail customer acquisition and then, as well as some of the increased engineering cost, mainly focusing on the investment ahead of revenue type. And so that basically impacts our EBITDA margin in the second half. So, a lot of the analysts are asking about the power tariffs or even our data center maintenance and upgrade, I think both electrical and mechanical parts, although not really material data center, but if we add up, it is still a month in the P&L. So that basically impacts the EBITDA ratio in the second half.\n\nAre we expecting -- that will continue going on? We strongly doubt because a lot of the costs basically impact in the second half, it's more seasonality -- and so we're expecting to have the improvement in 2023. And then Tim, do you want to take on the second question?\n\nTim Chen -- Chief Financial Officer\n\nIn terms of the -- you're asking about how long this will last for, I think Samuel started to address that and kind of will this drag into 2023 in terms of leading indicators. I would say that in our shifting of some of the capacity deliveries through 2023, alongside or matching with the customer demands is that we already see some of the things that they had initially wanted by end of the year being pushed into the sort of first half of 2023. So, there is that visibility that customers still intend to require these data centers, but it has been shifted backwards. In terms of which area, we've kind of seen, let's say, the slower ramp-ups, I would say, just given the sheer scale of the ramp-up pace of a wholesale customer versus a retail customer, I would say that it is more on the wholesale side.\n\nThey are a sort of larger contributor in terms of billable cabinet ramp-up. But it's not to say that we've not seen a sort of similar slower pace during the times that there were lockdowns in place. We certainly hope that we see less and less of these steps of lockdowns in the second half. And so, then customers can actually resume a more normal pace of ramp-up during the rest of this year and into next year\n\nAlbert Hung -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nQuestions?\n\nOperator\n\nOur next question comes from the line of Clive Cheung from Credit Suisse. Please proceed with your question.\n\nClive Cheung -- Credit Suisse -- Analyst\n\nHi. Thank you, management, for taking my question. I have two questions. The first one is regarding wholesale demand.\n\nSo, for the move-ins you have seen for the existing customers we have had or existing orders. How different is that, say, in terms of months required for ramp-up, [Technical difficulty] is different to our previous expectations, say, previous guidance versus our new guidance? That's number one question. The second question is the MSR. I see there is a small decline in retail MSR for two quarters running, quarter on quarter.\n\nI was wondering, is there any trends we should pick up here, or should we still expect them to be broadly in line, or previously, you mentioned slightly upwards in the longer term? Thank you. Two questions.\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nThank you, Clive. I would say, from the wholesale customers' point of view, basically, I think Tim and I, we talked about specifically two types of the wholesale customers we're talking to almost on a weekly basis; the public cloud service providers and social platforms and especially for video type of customers, who require a huge storage to store the data. I would say, we're not seeing any difference from their move-in rates, aside from the COVID-19 impact or lockdowns impact and so on and so forth. Their business continues to grow.\n\nAnd then -- so when we talk to them, they proactively plan their demand forecast and do the site selection. And then, when we participate and win a bid, it is not just a one-time deal; it is more like lifetime partnership, and so on and so forth. So, again, from our partnership, we've seen the similar trend from a moving rate perspective. So that's the reason when Tim and I, we talked about, aside from what contractual say, two years commit to ramp up to 90%.\n\nWe've actually seen the actual results way more faster than that. So, again, with the two MOU that we talked about today, hopefully, we're seeing exactly the same trend as we talked about. Tim, do you want to address the monthly recurring revenue for the retail one?\n\nTim Chen -- Chief Financial Officer\n\nYeah, sure. In terms of the monthly recurring revenue, I think, the main thing is quarter to quarter, you will see some fluctuation, and that's because the figure there is a total retail-related revenue divided by cabinets. We do expect that these levels will remain around 9,000. And Clive, you're absolutely correct in your second part of your statement, which is whether or not we expect this longer term to trend upwards.\n\nI think the answer is definitely yes. And that's going to be driven by some of the investments that Samuel mentioned earlier on. The investments on the retail services side that will then allow us to provide, again, a larger suite of services to the customers and expand then the contribution of the value-added services to the overall MRR. So again, longer term, expected to trend up, but I think quarter to quarter to quarter, roughly fluctuating around the 9,000 level.\n\nI hope that helps.\n\nClive Cheung -- Credit Suisse -- Analyst\n\nThank you very much, Samuel and Tim. Thank you.\n\nOperator\n\nThank you for the questions. Your next question comes from the line of Hongjie Li of CICC. Please proceed with your question.\n\nHongjie Li -- CICC -- Analyst\n\nHi, management. Thanks for taking my questions. I have two questions. First one is based on the current wholesale and retail demand, could you share more about the delivery pipeline and capex plan in recent years like in 2023? And my second question is regarding the utility cost.\n\nWe're cueing some regions in China, there's a par supply shortage. Is there any material impact for us and traditional detail about the future trend you think of the utility costs and the impact on our margin? Thanks.\n\nTim Chen -- Chief Financial Officer\n\nYeah. Let me take the two questions. In terms of, I guess, capex and delivery plans for 2023, I would say that based on the fact that some of the capacity we had planned for 2022 being shifted into 2023. I would say year on year, we would expect that the capacity in terms of megawatts will be larger in 2023 as compared to 2022 clearly, as things ramp up again and also as some of the construction delays ease, hopefully, as we see a COVID -- less COVID impact year in 2023.And so, capex also, we talked about earlier on that we still expect capex spend to be around RMB 4 billion this year.\n\nNext year, it likely will be higher than that, as we then continue to build out the capacity, especially with the additional MOU wins. Those will then clearly form part of what we see in terms of the spend in -- for the latter part of this year, but also then into next year in terms of expected future tender wins as well. The second question, in terms of power. Again, the cost that we're seeing is largely similar to the last time around where we -- there were power shortages around China, and these were related to mostly short-term purchases of diesel fuel and making sure that our data centers continue operating when there was uncertainty in terms of continued power supply from the grid, so these are the costs that we expect to see.\n\nAgain, on a single data center basis, these are not material if they persist or if they start to spread throughout China, then it will become a larger figure. But at the moment, I think largely covered in what we've already provided to the market in terms of what our views are for the second half and balance of the year. I hope that helps.\n\nHongjie Li -- CICC -- Analyst\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nXinyuan Liu -- Director, Investor Relationsc\n\nSamuel Shen -- Chief Executive Officer and Executive Chairman of Retail IDC\n\nTim Chen -- Chief Financial Officer\n\nEthan Zhang -- Nomura -- Analyst\n\nEdison Lee -- Jefferies -- Analyst\n\nAlex Wang -- Daiwa Capital Markets -- Analyst\n\nSara Wang -- UBS -- Analyst\n\nAlbert Hung -- JPMorgan Chase and Company -- Analyst\n\nClive Cheung -- Credit Suisse -- Analyst\n\nHongjie Li -- CICC -- Analyst\n\nMore VNET analysis\n\nAll earnings call transcripts"
}