{
  "companyName": "nCino, Inc.",
  "companyTicker": "NCNO",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/ncino-inc-ncno-q2-2023-earnings-call-transcript/",
  "content": "nCino, Inc. (NCNO 1.77%)\nQ2 2023 Earnings Call\nSep 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to nCino second quarter fiscal year 2023 financial results conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Harrison Masters, investor relations.\n\nPlease go ahead.\n\nHarrison Masters -- Investor Relations\n\nGood afternoon, and welcome to nCino's second quarter fiscal 2023 earnings call. With me on today's call are Pierre Naude, nCino's chairman and chief executive officer; David Rudow, chief financial officer; and Josh Glover, president and chief revenue officer. During the course of this conference call, we will make forward-looking statements regarding trends, strategies and the anticipated performance of our business, including, without limitation, the acquisition and integration of SimpleNexus. These forward-looking statements are based on management's current views and expectations, entail certain assumptions made as of today's date, and are subject to various risks and uncertainties described in our SEC filings, and other publicly available documents, the financial services industry, and global economic conditions.\n\nnCino disclaims any obligation to update or revise any forward-looking statements. Further, on today's call, we will also discuss certain non-GAAP metrics that we believe aid in the understanding of our financial results. A reconciliation to comparable GAAP metrics can be found in today's earnings release, which is available on our website and as an exhibit to the Form 8-K furnished with the SEC just before this call. With that, I will now turn the call over to Pierre.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nThank you, Harrison, and thank you all for joining us today to discuss our second quarter fiscal '23 results. Our team executed extremely well in the second quarter, highlighted by our strong top-line performance of $99.6 million in total revenues, a 50% increase over the second quarter of fiscal '22, which includes SimpleNexus revenues. Excluding SimpleNexus, we grew subscription revenues by 29% organically. During the second quarter, we saw continued global demand for our platform, including strong growth across our newer product solutions as illustrated by the Rabobank announcement we issued shortly before this call.\n\nRabobank selected our nIQ automated spreading solution to transform their financial spreading capabilities within Australia and New Zealand. This partnership represents a multicurrency, cross-country commitment and is our largest order spreading deal to date. We all know we're in a challenging mortgage market. But despite that, our SimpleNexus teammates had another strong quarter, growing subscription revenues 73% year over year or 47% organically.\n\nYou will hear more about SimpleNexus from Josh shortly, but we believe the strength in the quarter further highlights the unique quality of this business, including its mobile-first, cloud-based homeownership platform and superior subscription-based business model, which is fueling continued growth and market share gains in a difficult mortgage market. The uncertainty in the economy isn't just tied to the mortgage market. So let me spend a minute on the macro outlook as it is top of mind for all of us right now. Overall, I would characterize the global market as having become more complex with different dynamics in different geographies.\n\nOn the plus side, higher interest rates are generally a positive for financial institutions and the demand we see in our sales pipeline for our products has never been stronger, reflecting the ongoing need for financial institutions to digitally transform in order to stay relevant and competitive. Specifically, we are seeing strength in the U.S. Canada, and Asia Pacific markets. However, we are seeing some weakness in Europe, highlighted by longer deal cycles.\n\nWe continue to closely monitor how the macro environment is impacting the market. In the meantime, I am pleased that we are once again increasing our full year revenue guidance. David will provide more details later on in the call and how we view the second half of the year. I would like to highlight the progress we made in the second quarter toward profitability and reinforce that we remain committed to achieving non-GAAP profitability next year even as we continue to invest in the business.\n\nIn fact, we are improving our non-GAAP operating loss guidance by $12 million for the full year from our guidance last quarter. The key focus for us has been a more measured approach to hiring. We believe we have plenty of opportunity within our existing employee base to support future growth while driving incremental operating leverage. That said, we will continue to responsibly invest in growth, which remains our top priority, and we will make additional strategic hires where needed to drive growth and revenue expansion.\n\nWe are in the early innings of growing a global business and capturing a $16 billion serviceable, addressable market, and we see the current environment as a time to invest with discipline to extend our market leadership. The executive appointments announced recently proved this point. I am sure you saw our announcement last month of Matt Hansen's appointment as nCino's chief product officer. After conducting an extensive external search, it became evident that we had the strongest candidate right here in the nCino family.\n\nMatt, founder of SimpleNexus, is now overseeing all of nCino's product development and engineering organization globally. We also appointed Ben Miller, co-founder of SimpleNexus as its CEO taking over for Cathleen Schreiner Gates, who is staying on with us in an advisory capacity. And we announced two other appointments through our executive leadership team during the quarter, including Jaime Punishill as our chief market officer, and Chris Ainsworth as our first chief people officer. I am excited about the deep domain expertise and diverse perspectives each of these individuals brings to nCino.\n\nThese additions to our leadership team will enable us to further scale, maximize market share and drive profitable growth while continuing to attract and retain top talent and deliver the best products in the industry. And with that, I'll turn the call over to Josh to go through more business highlights from the quarter. Josh?\n\nJosh Glover -- President and Chief Revenue Officer\n\nThanks, Pierre. We had a solid second quarter with a strong mix of go-lives, renewals, upsells, and new logos across our portfolio of products, asset classes, and geographies. As Pierre addressed earlier, the Rabobank win is a great example of the increased interest in our nIQ solutions as well as our momentum across APAC. Earlier in the quarter, we announced that ASB, one of New Zealand's leading commercial banks went live on the nCino Bank Operating System following a primarily remote implementation during COVID.\n\nWith nCino, ASB start to replace and consolidate 16 existing legacy systems and tools, focusing on one platform to streamline the lending process for their bankers and to reduce overall complexity for the bank. Additionally, in APAC, our team added a new logo in Japan, marking our fourth customer in that country. We also expanded our international footprint with new customers in the Netherlands and South Africa during this quarter. We had a number of nIQ cross-sales within our existing customer base in the quarter, including an automated spreading deal with a $7 billion U.S.\n\nbank, and a commercial pricing and profitability upsell with a $2 billion community bank. The number of bank operating system customers using our nIQ solutions, including portfolio analytics, automated spreading and commercial pricing and profitability increased 119% year over year, reflecting the growing demand we see for these solutions. For example, during the quarter, we announced that nbkc, a $1.1 billion community bank in Kansas City went live on both automated spreading and commercial pricing and profitability as well as our commercial small business and retail lending solutions. nbkc eliminated numerous systems and manual processes in favor of the nCino platform to drive efficiency, transparency, and real-time data insights across the entire lending originations journey.\n\nnSight, our annual user conference, was a huge event for us during the second quarter, and it was wonderful to be together again with over 1,400 of our customers, partners and nCino teammates from around the globe. We were honored to have many customers on stage with us sharing nCino journey, including Kevin Nielsen, director of product management at nbkc as well as Shane Loper, chief operating officer, Hancock Whitney. You may recall, last quarter, I spoke about our retail go-live at $36 billion Hancock Whitney, which is nCino's largest upmarket retail lending deployment to date. I'm pleased to share that the bank is live not only on retail, but is also now live on commercial lending.\n\nWe are deeply appreciated the Hancock Whitney's team's continued partnership. Our single platform vision continues to resonate with the market in the second quarter with five new customers selecting nCino for both our commercial and retail solutions. Our team at SimpleNexus had another strong quarter and a tough mortgage market, we continue to win new deals, grow revenue and take market share. During the second quarter, SimpleNexus signed 26 new customers across banks, credit unions and IMBs.\n\nOf these four were nCino cross-sales, including one with an over $30 billion asset regional bank and six were competitive replacements. To highlight our strong competitive position, SimpleNexus had more competitive replacements in the second quarter in all of the prior fiscal year. SimpleNexus continues to be a critical part of our consumer retail strategy, which is one of our four key pillars for growth, along with nIQ, maintaining our commercial market leadership and our international expansion. Looking at the third quarter, we are excited to spend more time in person with customers across the globe.\n\nMany of us were in Dallas this week with a large group of our customers from the Farm Credit System, and there was so much energy and enthusiasm from everyone in the room. Over the next several months, we will be hosting customer events and executive forums from Wellington to London to Sydney to Toronto. And I'm excited to show these customers how nCino can deliver digital transformation to financial institutions of all sizes all around the world. And with that, I'll turn the call over to David.\n\nDavid Rudow -- Chief Financial Officer\n\nThank you, Josh, and thanks, everyone, for joining us this afternoon to review our second quarter fiscal '23 financial results. Please note that all numbers referenced in my remarks on a non-GAAP basis, unless otherwise stated. A reconciliation to comparable GAAP metrics can be found in today's earnings release, which is available on our website and as an exhibit to the Form 8-K furnished with the SEC just before this call. We are pleased with the second quarter results, and in particular, our progress toward achieving non-GAAP profitability in fiscal '24.\n\nTotal revenues for the second quarter of fiscal '23 increased 50% to $99.6 million, which included a negative $1.5 million impact from FX. Subscription revenues for the second quarter were $84.4 million, an increase of 57% year over year, representing 85% of total revenues. Organic subscription revenues, excluding SimpleNexus, were $69.4 million, representing 29% year-over-year growth. SimpleNexus' subscription revenues increased approximately 73%, including NBA were revenues or about 47% organically.\n\nSimpleNexus again exceeded our internal expectations despite the difficult mortgage market. Professional services revenues were $15.2 million in the quarter, growing 21% year over year. Non-U.S. revenues were $14.9 million or 15% of total revenues in the second quarter, up 38% year over year or approximately 52% in constant currency.\n\nInternational revenues continued to see strong subscription growth, while professional services growth lags as we engage our partner ecosystem more frequently in new deployments. Non-GAAP gross profit for the second quarter of fiscal '23 was $64.9 million, an increase of 55% year over year. Non-GAAP gross margin was 65%, compared to 63% in the second quarter of fiscal '22. Our gross margins continue to improve largely from subscription product mix as enterprise and international customers comprise more of our revenues, the increasing adoption of nIQ products, along with the growth of subscription as a percentage of total revenues.\n\nNon-GAAP operating loss for the second quarter of fiscal '23 was negative $2.8 million, compared with negative $1.8 million in the second quarter of fiscal '22. Our non-GAAP operating margin for the second quarter was negative 3%, flat with negative 3% in the second quarter of fiscal '22. Non-GAAP net loss attributable to nCino for the second quarter of fiscal '23 was negative $4.9 million or negative $0.04 per share, compared with negative $2.5 million or negative $0.03 per share in the second quarter of fiscal '22. Non-GAAP net loss attributable to nCino included approximately $1 million of noncash unrealized loss on intercompany loans due to the strengthening dollar.\n\nOur remaining performance obligation, or RPO, increased to $907 million as of July 31st, '22, up 28% from $707 million as of July 31st, 2021, with $589 million in the less than 24-month category, up 45% from $406 million as of July 31st, 2021. Organic RPO increased 19% year over year with $528 million in the less than 24-month category, up 30% from July 31st, 2021. As a reminder, the second quarter of fiscal '22 saw a significant increase in total RPO from several large enterprise deals signed in the quarter. The stronger dollar also had approximately negative $2 million impact on total RPO.\n\nAs we've discussed, the business can be lumpy from quarter to quarter. Turning to cash. We ended the quarter with cash and cash equivalents of $91.5 million, including restricted cash. Net cash provided by operating activities was $9.5 million, compared to $13.3 million in the second quarter of fiscal '22.\n\nCapital expenditures were $4.6 million in the quarter, resulting in free cash flow of $4.9 million. As a reminder, we have also have an untapped $50 million line of credit that we signed earlier this year. So overall, we had a good first half of fiscal '23 with strong revenue growth, focused investments for future growth, and significant momentum toward achieving non-GAAP profitability. Let me echo Pierre's comments.\n\nWe are keenly aware that we are addressing a big market and are strategically building a business for the long term. We'll continue to invest, optimizing our spend in the areas of greatest opportunity while working toward being non-GAAP profitable and cash flow positive next year. In providing Q3 guidance and updating our full year outlook, we are taking a few factors into account. First, longer sales cycles in Europe; second, a measured outlook for SimpleNexus in light of the challenging mortgage market; and finally, a 1% to 2% negative revenue impact from FX.\n\nThat said, for the third quarter, we expect total revenues of $103 million to $104 million, with subscription revenues of $87 million to $88 million. This guidance assumes year-over-year subscription growth of 53% at the midpoint of the range with approximately 27% organic subscription growth for the third quarter. Non-GAAP operating loss is expected to be approximately negative $750,000 to negative $1.75 million and non-GAAP net loss attributable to nCino per share to be negative $0.02 to negative $0.03 per share for the third quarter. This is based on a weighted average of approximately 111 million basic shares outstanding.\n\nTurning to guidance for the full year. We are now increasing our revenue outlook. For full fiscal year '23, we now expect total revenues of $401.5 million to $403.5 million with subscription revenues of $341.5 million to $343.5 million. This full year guidance assumes year-over-year subscription revenue growth of 52% at the midpoint of our range with approximately 28% organic subscription growth.\n\nWe are also improving our non-GAAP operating loss guidance for fiscal '23 to negative $12 million to negative $14 million. Non-GAAP net loss attributable to nCino per share is expected to be negative $0.17 to negative $0.19 based on a weighted average of approximately 110.5 million basic shares outstanding. The second quarter was another strong one, thanks to the hard work of the nCino team around the world. Your dedication to the success of our customers is what makes nCino the global leader in cloud banking.\n\nAnd with that, we will now open the line for your questions.\n\nOperator\n\n[Operator instructions] Our first question is from James Faucette with Morgan Stanley. Please proceed with your question.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much and really great performance here. You mentioned a little bit of slowing in at least sales cycles in Europe and that you've taken that into account in the outlook for the second half of the year, etc. But I'm wondering if you can talk to us about how we should expect those to progress or beyond just the delays, are you seeing reassessment of scope or of scale, etc? And what's your sense as to actual timing to close and the like in that market?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYes. Thanks a lot for the question. We are fortunate to have a global footprint, including Japan, Asia Pacific, Australia, New Zealand, South Africa, of course, Europe, U.K. Island, Canada and the U.S.\n\nAnd what I've seen over the history of the company since 2017 when we went -- expanded on a global basis, is that these markets take a long time to develop. There are macro influences, sometimes it's just by country that they're slower or more conservative. But fortunately for us, it's always that one market pops ahead of another one, etc. So just like our solutions, some are more mature than others, and then we lean on the more mature ones to carry us through.\n\nWhat I'm seeing on a global basis is very exciting stuff out of Canada as well as Australian, New Zealand. We've got a good presence in South Africa right now, I see good momentum in Japan. The European thing is really a macro influence where we do see an impact with the energy crisis as well as the Ukraine war, whether it's psychological or not. On the other hand, we see a great opportunity with the ESG.\n\nSo what we're doing is we've got the right team in place there. We are tracking the deals on a per-country basis. But we clearly saw that there was less of an aggression on adopting this in the short term. In the long term, those markets have no choice, but to actually move to cloud-based flexible solutions.\n\nSo we are maintaining our investment, and I'm bullish on it but we just realized that in the short term, the macro influences. Josh, do you have anything to add?\n\nJosh Glover -- President and Chief Revenue Officer\n\nNo. We've not seen a change in the conviction of our customers that they need to continue to digitize and modernize, that commitment is very clear. For us is lots of uncertainty, and we see them continuing to evaluate the timing of those investments.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGot it. Got it. And I'm wondering if you can help us nuance a little bit what's happening with SimpleNexus. Obviously, really strong growth that they're seeing.\n\nBut at the same time, it sounds like you're a little bit aware of obviously the way that the market is developing as you formulate your outlook. And we have started to see headlines at least from some mortgage originators that they're planning to cut back heads etc. So how are you thinking about like what's reasonable for SimpleNexus? And what the work is that they need to do to kind of assure that they do as well as they possibly can in the current environment?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nWe've included a very conservative forecast for them and it's reflected in our guidance. But I would like to emphasize, six competitive takeaways. How many new logos? 26 new logos the past quarter. I realize, even though they're cutting back heads and our estimation, it typically is middle back office when these mortgage volumes go down.\n\nAlso, remember that market is shifting to a purchase market versus the refi market, and we are very strong on the purchase side. Then if you look at the competitive landscape and the financial strength of different companies, I think we have a stand out there. We can continue to invest. And that's why you're seeing a shift in market share to us.\n\nSo I'm very optimistic. Our technology is superior. The experience is superior for the loan officer as well as the ecosystem around them versus purely a mortgage application. We think we got this asset at the right time.\n\nIn difficult times like this is when good companies actually take market share and land logos that will expand rapidly when this market turns around. Josh, do you want to add to that?\n\nJosh Glover -- President and Chief Revenue Officer\n\nI think you also have to think about the opportunities that we have to continue cross-selling SimpleNexus into the bank customer base. We're proud of what we did this quarter. And it's hard to draw it as a proxy, but I think you need to understand how we go to market. When you say 119% year-over-year increase of bank operating system customers who have adopted nIQ, that has a well-defined cross-selling motion.\n\nThe team is executing well on that. So when you look at SimpleNexus, as we continue to bring these teams together, we look to continue driving that cross-sell further into the bank operating system customer base. We cross-sold SimpleNexus into a $30-plus billion basis last quarter. excuse me, $30-plus billion bank this last quarter, sophisticated institution, great validation point for us.\n\nAnd we have a fantastic customer base that needs the software.\n\nDavid Rudow -- Chief Financial Officer\n\nYes. And James, on the numbers for SimpleNexus, we had anticipated $60 million for the year. We did have a little better performance than we anticipated in the quarter, and we're going to maintain that $60 million for SimpleNexus for the year, accounting for a little bit higher churn that we're seeing. There's some M&A, one or two deals went against us in the quarter, but we do anticipate within our guidance an elevated level of churn too.\n\nAnd on top of that, we expect to also grow revenue sequentially in Q3 and Q4 from where they ended in the second quarter.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThat's great nuance and color, gentlemen. Thank you.\n\nOperator\n\nThank you. [Operator instructions] Please stand by for our next question. All right. Our next question is from the line of Brad Sills with BofA Securities.\n\nYour line is open.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nWonderful. Thanks, guys, and congratulations on a nice quarter here in a tough environment. My question is on SimpleNexus. Obviously, you're seeing traction here with cross-sell into the base.\n\nIs there a point in which we might see this drive more new deals in retail, now that you've got this more complete solution across mortgage, credit card, auto, personal, you've got the full suite now? Could this be a situation where SimpleNexus starts to lend to new deals coming in the retail segment?\n\nJosh Glover -- President and Chief Revenue Officer\n\nYes. And you saw our comments on the five platform wins that we had people who purchased commercial plus a retail solution. I absolutely think that these validation points of our single platform strategy are going to help us across the board. I would hope it helps us with all of our solutions because as banks look to digitize, they just don't want more point solutions.\n\nSo from our perspective, it's our job to tell that story. But I think you have to look at all of these as continue to strengthen that strategic message.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYes. The other thing I want to emphasize is, remember, in the community bank space, we are selling full platform story and we can deploy that in one fell swoop. When you start going to very large banks, top 25, etc., they buy more piecemeal because they cannot absorb the whole thing. So we would sell commercial, we would sell small business, you may sell into the mortgage division.\n\nThat gives us a foothold. We get to know the senior people in that retail division, and we sell retail products, OK? We've done this across the base for a long time. We feel very good about that strategy. And SimpleNexus is just one more arrow for us to get into retail, get a foothold, get to know the people, become influential, and penetrate deeper.\n\nSo I feel very good about that penetration point.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat to hear guys. Thanks. And if I could ask one on the macro. You called out earlier, Pierre, that rising interest rate is a positive for banks.\n\nWe all understand that. But yet the risk of recession is coming in more and recession is obviously not a positive for banks. So in the U.S. in particular, what are you hearing from CIOs with regard to their willingness to take on these new digital transformation projects for loan origination? Thank you.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYes. What's great for us is, we actually sell to the business. I just spent a day, on Monday, with the head of a top 25 bank on the commercial side, listened to their book of business, what is the credit quality, how do they feel about it. And Josh comes back from trips in the field and we talk to them all the time.\n\nNot the technology people, we do talk to them as well, but we talk to the heads of business and begin to understand how do they manage credit? What are they seeing a weakening of the book, etc? And I can tell you, everyone says it must be the other guy because none have ever told me that their book is looking weakened, they're beginning to worry about it, which is to me, extraordinary. So our banks are moving full speed ahead on transformation. They see it as a competitive advantage and they keep on spending. We also saw a global survey around IT spend for banks.\n\nAnd for next year, it's going up by 5%. So we believe the momentum will continue. And with our reputation, our installed base, I feel good about it.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat to hear. Thanks so much.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Terry Tillman with Truist Securities.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nHey, Josh and David. Thanks for taking my questions. David, great perspective and all the color you're providing is really helpful, particularly even with the SimpleNexus and giving us the update for the full year. So thanks for all the color and transparency.\n\nMy first question is related to with like nIQ and like Rabobank, was that the entry point you all expected to get in there? I'm kind of curious about, nIQ, in terms of in the environment we're in where people are trying to like control costs and efficiencies, is nIQ potentially kind of tip of the spear and something that could actually even get you into some of the other kind of top 25 banks you're not into in the U.S.? And just a little bit more color on how you got nIQ in door at Rabobank. And then I have a follow-up for David.\n\nJosh Glover -- President and Chief Revenue Officer\n\nWe're proud of that press release. That was our entry point, the largest auto spreading deal that we've done in history. So I think sometimes these things are viewed as cross-sells or upsells. The fact that it's an entry point and we're going to execute really well there is something that we're quite excited about.\n\nSo, Terry, I would say we should think about continuing this template and using these nIQ solutions as an entry point.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nOK. Got it. And I guess, David, going into this quarter, I mean, you gave us a heads up where we're going to have a tough cost for like RPO and total RPO, so 24 months and then total RPO because of the enterprise transactions last year. But you definitely were ahead of what I was expecting.\n\nSo it's good to see that. But as we think about the second half of the year, are there any callouts in terms of like anniversarying tough comps in the second half of the year? And then also kind of not trying to pin you down on RPO guidance, but given the puts and takes we have, any more color you can share about how we should be thinking about RPO in the second half? Thank you.\n\nDavid Rudow -- Chief Financial Officer\n\nYes. For the second half RPO, we don't guide RPO. I think it's a metric that I think is important. And the issue with it is it's lumpy from quarter to quarter as you saw.\n\nLast year, we closed Wells and a couple of large enterprise deals. We had some FX impact as well that affected it. And I think the thing to note with the current quarter, second quarter is that we didn't have any big deals or any large renewals in the quarter that were longer duration, I would expect to see kind of continued balance renewals versus new bookings for the balance of the year. And I think that's the update on RPO.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nAll right. Thanks.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Saket Kalia with Barclays. Your line is open.\n\nSaket Kalia -- Barclays -- Analyst\n\nOK. Great. Hey, guys. Thanks for taking my questions here.\n\nMaybe a question for Pierre and Josh to maybe tag team. Can we just talk a little bit about just the broader retail opportunity, the five platform customers, Josh, great to hear? Just I guess just zeroing in on retail specifically, there's been some nice traction Hancock Whitney, right, was a great win. What are your customers saying broadly about their willingness to explore a replacement to that legacy retail solution with something like nCino?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nSo look, if you look at the community retail base, so let's make that Hancock Whitney is a $40 billion, $36 billion bank. So let's go up to that level. There, we see some consolidation happening in the banking space, and they need to standardize on platform technologies. And when you put two of those sized banks together, they cannot continue on with point solutions that's not attached to the customer full 360 CRM records, etc.\n\nSo we see great traction on the platform story and banks up to that size. When you go above that, you start selling more into certain divisions for certain product types to solve a problem they've got today. That's why SimpleNexus is important for us. We get in there, we are on the mortgage side, OK? You can point and sell a HELOC on its own into that market because that's what somebody wants to automate and do it on a cellphone and so on.\n\nWe see good traction. Internationally, we also see good traction interest on the retail side back to the platform story. They want to see a consolidation of their customer records into their fulfillment supply chains. And customers cannot run anymore, be competitive on its point solutions.\n\nSo we're actually beginning to see traction on a wider basis with retail. And the investment to us is going to pay off.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. Got it. That's very helpful. David, maybe for you.\n\nMaybe a metric that we haven't talked about as much, but it was great to see was the subscription gross margin, I think, about 74% to 75%. Can you -- on non-GAAP. Can you just talk about sort of what's helped with that expansion as we looked over the last few quarters? And how sustainable this level might be as we think about, again, that path to profitability for next year?\n\nDavid Rudow -- Chief Financial Officer\n\nYes. Thanks, Saket. Yes, it's really from the product mix. We're selling more enterprise and international, which has a higher margin than we see on the community regional side.\n\nAt the lower end of the market, we are able to sell sales force at $5 billion and below, a premium seat, which comes at a lower gross margin. And so we're selling more enterprise than international, we get the natural lift. But then also, you look at the nIQ products, those are based on AWS, and those have a much higher gross margin. So the mix of that allows us to elevate the gross margins over time.\n\nAnd then in terms of outlook on gross margin, I'd say that 74% to 75% range still holds true as you look out to build your model.\n\nSaket Kalia -- Barclays -- Analyst\n\nVery helpful, guys. Thank you.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Brent Bracelin with Piper Sandler. Your line is open.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. I wanted to basically drill down a little bit into the current environment for Pierre and Josh. Clearly, I understand larger deals will take longer given just the complexity out there in the space.\n\nBut a little surprised to see the momentum around SimpleNexus, the number of competitive takeaways, momentum around nIQ. Obviously, we know labor costs are going up here in a meaningful way, I think, a 40% -- a 40-year high growth in labor costs. How much is automation and software automation helping you win some business? Is that resonating with end users? I'd love to get your view on kind of what is resonating across either nIQ, SimpleNexus at a high level. Is automation and the benefits of the platform the reason why you're winning here or not? I'd love to drill down a little bit into that.\n\nThanks.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nLet me take the whole automation and intelligence first, and then Josh will take SimpleNexus for you, OK? The first thing we have to remember is how do you use in a bank, AI, machine learning, analytics, etc., unless you have a platform to deliver the insights to the people on the front line. And that's been the age-old problem. The people on the 36th floor of a bank, they've got all the people around them with all the answers, but you have to get that out to 24,000 people working in your branches, etc. So what we've established is a workflow platform that everybody touches from the moment they step into the office that morning, whether that be at home or in the office until they leave for the day.\n\nAnd so now everybody works in exactly the same system all the way from the first touch point with the customer through the loan origination or account opening, the underwriting, the closing, etc. Since you've got everybody in the same system, you can start developing systems like an integrated commercial pricing and profitability system that now gives you an experience into and that can be influenced by anyone on the line because you have to think of this as a production line, OK? That level of intelligence is now beginning to become much more of a differentiator. So think about this. You have to adopt nCino, get your processes in place and then you drive intelligence, insights, integrations and data into that platform.\n\nThere's nobody else in the market has done this at this level of sophistication. Then you start with your nIQ products and you become a lot more sticky and more differentiating as you go forward. And that's why we have the market share we've got and we continue to penetrate these markets overseas. So they can see that our vision and execution is aligned, and they actually see the outcomes of banks who are using nCino.\n\nCan you imagine competing with a bank in a territory, if you don't have nCino, you don't have these automated processes? So that's how we've driven this. So nIQ becomes a penetration point as well as a differentiating point when we sell the platform. Josh, can now comment a bit on SimpleNexus.\n\nJosh Glover -- President and Chief Revenue Officer\n\nI will add one more point on the automation aspect. One change I've seen in the last 12 months or so, as I've talked to business leaders is that this talent market is causing them to think about software investments, not just how do I run my organization more efficiently. But how do I actually compete for talent? So something like spreading that takes 85% of the effort out of taking an unstructured financial statement or a tax return and getting that into a spread tool helps them compete for the best talent out of university. And it's been really fascinating to see how that message continues to resonate.\n\nOn SimpleNexus, what I would say, is there is strength in the purchase market, particularly as they digitize that home buying journey and the NBA outlook for sustained interest in the purchase market is something that differentiates them. The refi shops are having a hard time. But if you do a lot of purchase, there's no one better than SimpleNexus. The other thing, I think, that I've seen from engaging with that market is that you have a lot of business leaders in the mortgage space today, who've seen this before, and they understand that facing a competitive market, facing market challenges is the time to actually invest not to cut back.\n\nSo we do believe that's driving a lot of their continued momentum. When you look at the number of new logos added this quarter, it feels that they're leaning into the opportunity to differentiate in a tough market.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYes. We also see with banks, traditionally banks tend to be a bit more stable. And with our focus on banking, bringing that solution over to banks in the purchase market, we feel pretty optimistic about that business.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThat's very helpful color there. I guess last follow-up here for David. I'd remiss not to take a look at that guide on narrowing the operating loss here in the second half of the year. Is that tied to a slowdown in hiring? Or is that tied to just greater leverage? Or you think about the momentum of the business, trying to think through the levers and how you're narrowing losses here in the second half of the year?\n\nDavid Rudow -- Chief Financial Officer\n\nYes. So it was really -- in the second quarter, we paused hiring and then we reevaluated it with the entire team around the headcount adds for the balance of the year. So it really is around optimizing each and every team and increasing productivity. We've done that work, the plan is in place.\n\nWe're still hiring for the balance of the year as well, just at a more measured pace. So you'll see those cost savings kick in this year, but then really will benefit us next year in achieving our profitability and cash flow positive status.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGood to hear. Thank you.\n\nOperator\n\nThank you. [Operator instructions] Please stand by. Our next question comes from the line of Brian Peterson with Raymond James. Your line is open.\n\nBrian Peterson -- Raymond James -- Analyst\n\nHi, gentlemen. Thanks for taking the question. So David, one for you. So I'm coming up with the 19% implied organic growth outlook for subscription revenue for the fourth quarter.\n\nI realize you guys are guiding to next year at this point. But is that something that investors should use maybe as a reasonable starting point for next year? I know there's some potentially larger seat ramp deals that are coming in. But any context that you could add there would be helpful.\n\nDavid Rudow -- Chief Financial Officer\n\nYes. That's not -- we guided for the year at 28% and 27% for Q3. So that 19% is not correct, and it should be -- you can -- I mean, it's higher than that, and you should run the numbers that's just solved for Q4, and it will end up being in the 27% to 28% range for Q4, I believe.\n\nBrian Peterson -- Raymond James -- Analyst\n\nUnderstood. Apologies, I messed up the M&A math. One on some of the sales cycles are kind of following up on some of those questions. I mean is that really differentiated by the size of any of your customers.\n\nI'm just looking to double click on that a little bit. And as we think about maybe the linearity of some of the slowdowns that you guys have mentioned, did that change throughout the quarter? Just would love to get some perspective there. Thank you.\n\nDavid Rudow -- Chief Financial Officer\n\nI would say the macroeconomic sentiment is pretty standard across the customer base. The difference I would give you is when you look outside of the U.S., you have just a more enterprise heavy market. They just don't -- they don't have as many small institutions as we do here. That's the only difference I would see, but that's more of a market composition question, not really a sentiment question.\n\nJosh Glover -- President and Chief Revenue Officer\n\nYes. And then on the quarter, you talked about linearity in the quarter. I'd say linearity was normal. I think we had some deals in the -- early in the quarter that were closed earlier than we expected in May, which is part of the reason why we saw upside in subscription revenue.\n\nSo linearity was more normal, but I would say, heavier weighted to the balance to the beginning of the quarter.\n\nBrian Peterson -- Raymond James -- Analyst\n\nUnderstood. Thanks so much.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Robert Napoli with William Blair. Your line is open.\n\nRobert Napoli -- William Blair -- Analyst\n\nThank you and good afternoon. On nIQ, just anything you can give on the sizing of nIQ or gross margins? And which products -- I mean, auto spreading obviously, is on fire. But how is loan pricing, those portfolio analytics. Is that becoming more important?\n\nJosh Glover -- President and Chief Revenue Officer\n\nYes. So we're really part of what we did with auto spreading. Today, within my bank operating system customer base, I have 26% of those customers have at least 1 nIQ solution, which is exciting progress, but that means we still have a very long runway there to get them hopefully to adopt all of those. Pricing and profitability.\n\nWe included in our notes here, we saw momentum in a $7 billion bank signing a $2 billion bank signing. And I'm frankly pleased with the upmarket momentum that we have and the way that's being received, both in the U.S. and internationally. So we feel like we have good proof points.\n\nThe product is coming along, and we're going to continue to trying to drive that into the customer base because they all need it.\n\nDavid Rudow -- Chief Financial Officer\n\nAnd Bob, did you have a question on growth. The first part of your question didn't come through. Did you have another part of the question?\n\nRobert Napoli -- William Blair -- Analyst\n\nYes, David. It's any -- if you could give any color on the sizing of nIQ today given the growth it has in the gross margins. I mean your gross margin momentum has been pretty impressive. I guess, is nIQ contributing to that?\n\nDavid Rudow -- Chief Financial Officer\n\nYes. So in terms of total revenues, it's about 5%. And remember, we added SimpleNexus, which is about 15% of revenue. So that percentage has come down of mix.\n\nOn the gross margin side, we do use AWS. So I would view those gross margins similar to what you see with other SaaS companies in that range.\n\nRobert Napoli -- William Blair -- Analyst\n\nOK. And then last quarter, you had announced -- you added a $1 trillion bank, I think, in the U.K., with the -- are there elongated onboarding cycles as well in that market? I mean that's I think that was for commercial and auto spreading. When does that customer onboard?\n\nJosh Glover -- President and Chief Revenue Officer\n\nWe're not seeing an impact to project duration. I think we've seen the industry has figured out how to work either remotely or hybrid. One proof point that we gave from our press release was ASB going live. That was a program that we kind of kicked off right into the heat of COVID, and they're live with this and they're out there publicly with us.\n\nSo no impact on that program's time line. Relative to onboarding that's in line with our typical expectations for a program of that size.\n\nDavid Rudow -- Chief Financial Officer\n\nYes. It's a normal enterprise type seat activation schedule that you would see with that as well.\n\nRobert Napoli -- William Blair -- Analyst\n\nThank you. Appreciate it.\n\nOperator\n\nThank you. Please stand by for our next question. And our next question comes from the line of Fred Havemeyer with Macquarie. Your line is open.\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nHey. Thank you very much for the question here and congratulations on a strong quarter despite the macro environment. Really great to see the narrowing in the non-GAAP operating loss guidance for the year. I wanted to ask about just generally how -- rather it's a little bit of additional context on what you're describing in terms of doing more with your existing headcount.\n\nSo in terms of R&D initiatives, are you just finding that the headcount that you have in place is sufficient for the product innovation and your product roadmap that you have? Or have you decided on any changes to your cadence of product delivery?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYes. So if you look at the breadth of the portfolio, we used to be mostly commercial, a little bit of small business. Then you started building these different teams out, commercial lending, small business lending, retail lending, deposit account opening, treasury management, onboarding, OK? And then you have SimpleNexus in. And then we started adding customer-facing technologies for each of those solutions.\n\nWe had to build foundational infrastructure in place. Then you go to international and all of a sudden, London, new team to put in place for integrations, etc. We acquired a company in Australia, FinSuite that became the auto spreading thing. If you put that whole footprint in place and you onboard 100 to 200 people per year like that, it takes a lot of management time as well as effort by the teams to bring them in.\n\nWe're very fortunate. We always had a fairly much lower than the industry churn rate of people or turnover rate. So what we recognized is the percentage of revenue that we spent on R&D was always traditionally quite high. It was 27%, I believe, up to last month.\n\nThat if we stabilize that organization, keep the headcount more flat, we're actually still adding but a much slower growth rate. We have all of these teams populated and let them focus on bringing out new products, to quality improvements, etc., that stabilization effect could have quite a big boost of productivity and focusing on processes and optimization of software development and time to value where we actually write code and get it quicker to the customer. Those initiatives, it's a great little breather for a company like us is for 10 years, just went go, go, go and add more heads, OK? I would say that if you look at growth companies like us, the answer later on becomes, I need more heads. And I think what we've done now is change that mentality to looking at optimization methods, improving our processes and so on.\n\nand I'm seeing great progress, and I'm pleased with my teams. So I think it's a good thing, and it's a good corporate hygiene to do this. But I'm satisfied that each of these teams are populated to the extent needed for their solutions.\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nI would say big congrats to the team that have been working, the auto spreading always impresses when I see that. I wanted to also ask about generally your channel ecosystem and how that is also shaping up as you're continuing to scale, as you're going more globally. And just generally, how do you see your -- the maturity of your channel ecosystem and global systems integrators shaping up around nCino? And how do you think that could impact professional services as a mix of your total revenue over time? Thank you.\n\nJosh Glover -- President and Chief Revenue Officer\n\nYes. We -- and I appreciate you calling that out because we do believe that's a differentiator for us and has allowed us to execute as we've executed this global strategy. We see about 2,800 partner practitioners to date that are certified to implement nCino. A lot of that increase since we last spoke was driven by international interest, which is a great thing that we're proud of.\n\nThe earlier question about you signed a large account in the U.K. or are they implementing well is because we have that partner ecosystem and a proven model. So from our perspective, that is going to continue to be how we go to market globally and how we can put our reputation behind these strategic accounts. And I'll let David just speak to the revenue side of that.\n\nDavid Rudow -- Chief Financial Officer\n\nYes. On the revenue side for total services, it's 15% is kind of what we see for the year. The partner channel, they deploy the majority of our, if not all of our large solutions. And so they have their own revenue stream for that.\n\nBut we would expect, as we continue to expand onshore onto the continent Europe that those partners will be up trained and running and deploying the solutions on the continent as well as we've seen with the initial projects that we've had.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nThere is a demand for our services because we are the specialists. And I don't have a problem coexisting in the ecosystem with services between 15% to 20% of total revenue. But we are very careful to complement our partnerships and not compete with them. But sometimes customers just ask for our people because it's closely related to the engineering teams, etc.\n\nSo it's a nice equilibrium, but we'll continue to grow services as well.\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. Please stand by for our next question. And our next question comes from the line of Joe Vruwink with Baird. Your line is open.\n\nJoe Vruwink -- Baird -- Analyst\n\nGreat. Hi, everyone. I wanted to go back to the higher-end topic, and Pierre, you touched on it a little bit a few answers ago, but one thought is maybe recalibrating to a new trajectory of demand can enable a moderation in hiring. But productivity has come up a few times in this discussion.\n\nSo are you seeing something from an efficiency standpoint where you actually feel a certain rate of growth can maybe be sustained at this point and a different head count gets you there?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nSo our priorities for growth is as follows -- or actually headcount. The very first thing we do every year when we start the year is to plan to make sure we've got enough salespeople, bag-carrying salespeople on the field to cover the quota and the sales goals for that year. And so there is no restriction on that. If Josh tells me the pipeline supports a certain amount of sales, we will make sure that we've got that team on the field to accomplish that.\n\nSo that's your very first thing. The second one then is to complement that with a support team to support the existing customers and the professional services team to implement. Those three things go lockstep and we don't cut back on them. We don't hold back.\n\nWe plan that first. Once that's in place, we look at PD&E for product and then finally, G&A because we're a large global organization, we have complex tax structures. We have people to support accounting, finance, entity involvement, or entity creation, OK, as figure around the globe. All those infrastructures are in place because we always had a plan to build this global company.\n\nSo I feel we're going to get leverage on the G&A side. We're getting leverage on our global infrastructure because they've been in place, the management structure is in place, and the people you add now is more from a capacity standpoint to maintain the growth rates, OK? And as I explained before, the product organization has got all the necessary teams as well as structures in place to continue building out each of our portfolio elements. So I think we're just reaching a level of maturity where you can scale and drive growth without having to add overhead.\n\nJosh Glover -- President and Chief Revenue Officer\n\nSo to summarize, we're making measured business decisions in an uncertain environment. And that's the real driver.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nBy the way, if you bring me a great idea, and I can make a lot of money quickly, we'll invest.\n\nJoe Vruwink -- Baird -- Analyst\n\nOK. I think I have a lot of ideas, but maybe take a lot of money aspect, I'll work on that. On the international side of things, revenues, I think they have grown close to 60% the last few quarters. Where did that stand in the second quarter? And how might you be thinking about international growth, just given we seem to be having this divergence now between APAC and Europe?\n\nDavid Rudow -- Chief Financial Officer\n\nYes. International growth in total grew 30% -- 38%. The majority of the growth, though, is coming on the subscription side. We have seen a slowdown in the services growth because we are pushing more of our projects to our partners.\n\nAnd then also FX, we had a big FX hit in the quarter on the international side, which I believe constant currency was at 52%.\n\nJoe Vruwink -- Baird -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nThank you. Please stand by for our next question. And our next question comes from the line of Charles Nabhan with Stephens. Your line is open.\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nHi. Good afternoon and thank you for taking my question. So we're about a year, year and a half removed from the Wells Fargo win and had a pretty significant add-on back in September. Just wanted to get a quick update on how that's going in terms of the integration and the impact that can have on ACV expansion going forward.\n\nJosh Glover -- President and Chief Revenue Officer\n\nWe were really proud to do both of those press releases, not only on the broad commercial deal, but also the expansion into small business. I won't comment on the details of their program, but there's been no change to the landscape there.\n\nDavid Rudow -- Chief Financial Officer\n\nYes. The seat activation schedule -- Charles, on the seat activations, we've talked about that in the past. It's a normal larger deal, probably a little longer in duration to activate those seats. And so those are ongoing.\n\nThose are all contracted by date. And so no update there either.\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nGot it. And if I go back to the conference in the spring, I thought the commercial pricing and profitability tool was one of the more interesting product shows. So I was hoping to get an update on that and any traction you're getting on that front reception you're getting from your customer base.\n\nJosh Glover -- President and Chief Revenue Officer\n\nYou're a little bit broken. Just to read that back, you're asking for an update on how pricing and profitability is progressing?\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nYes. That's right. I apologize.\n\nJosh Glover -- President and Chief Revenue Officer\n\nSo we commented -- we brought on a $7 billion bank, a $2 billion bank. We're also really proud to do a press release with nbkc who went live. That's a great replacement sale, and we're proud to have them live. We're continuing to take that to market and the accounts that we can serve within the customer base.\n\nAnd I'm quite excited by the momentum in accounts of the size that I referenced and also in some of our larger accounts, both in the U.S. and globally.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nI would tell you what surprised me by that product is because I thought we will focus for an extended period on the community regional space and then eventually get to the enterprise. And we are beginning to see serious interest in the enterprise business even internationally, which tells me that the integrated experience that we've built and the complexity of the models we included there, as well as the flexibility is actually resonating. And so I'm very positive around how that product is coming about and the proof points we're seeing from these customers evaluating it. So I feel very good about what we've done there.\n\nJosh Glover -- President and Chief Revenue Officer\n\nSo much of the initial value prop with those customers was the opportunity to connect the front and the middle back office into one platform. You look at the way we price these loans is so central to the connection of the front office and the risk function of the institution, the overall profitability, that message has really resonated nicely.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYes. My view is in the end, every commercial customer should get in profitability and should get automated spreading from us as these next solutions roll out. So there's a significant upside penetrating the existing base.\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nThank you. I appreciate the color.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Ken Suchoski with Autonomous Research. Your line is open.\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nHi, everyone. Good afternoon and thanks for taking the questions. I wanted to ask about the ability to pass on higher expenses and higher inflation that we're seeing in today's environment. And my understanding is that nCino, the contracts don't have annual inflation escalators.\n\nSo can you just talk about your interest and your ability to add those into your contracts? Or is the plan to kind of wait until the end of the contract to put through some of that pricing? Thank you.\n\nDavid Rudow -- Chief Financial Officer\n\nYes. So when we sell a deal, we have -- whether it's a three- or a five-plus year deal, we have an activation schedule built into that for customers as we deploy the product. By contract, we are allowed to increase pricing upon renewal What we normally try to do, though, is go in and sell them additional products or lines of business or additional seats to expand the relationship with the customer. And the idea is to grab as many seats as possible with the customer.\n\nAnd then in the future, you would have the ability to raise prices. But our idea now is to grab as much share as we can. And then hopefully, as we service our customers and make them happy, we have the ability to maintain them as customers and increase prices at inflation or whatever the number is in the future.\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nOK. That makes a lot of time, David. And just as my follow-up, I wanted to ask a SimpleNexus, I think you mentioned the new logos, the competitive takeaways. Can you just talk about what you're seeing across your customer base? And I guess the industry more broadly from a C-end employment perspective.\n\nI mean, are you seeing layoffs? Or are you seeing C growth at your existing customers? Thank you.\n\nJosh Glover -- President and Chief Revenue Officer\n\nWe hear some of that. But historically, what you'll see is into a challenging market. The mortgage industry will look to cut the middle and back office first because those are salary employees. They want to keep their good loan officers because they're more commission-based and they drive the revenue.\n\nSo I think David spoke about some of our moderated approach to ensuring that we're buffering for some churn there. But no change to that. David, do you want to elaborate?\n\nDavid Rudow -- Chief Financial Officer\n\nYes, no, I think you summarized it well.\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nOK. Thank you.\n\nOperator\n\n[Operator instructions] Please stand by for our next question. Our next question comes from the line of Maddie Schrage with KeyBanc Capital Markets. Your line is open.\n\nMaddie Schrage -- KeyBanc Capital Markets -- Analyst\n\nHi, guys. Congrats on the quarter and thanks for taking my question. My first question for you was I'm wondering if you could provide some color on the competitive landscape. Wondering if you're seeing any changes in pricing mainly from your competitors and then internationally, if there's any new entrants or anything like that?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYes. So if you look at our competitors, you have to look at it by segment because they vary by product type and segment, OK? So let's start with the community retail space. But when you look at commercial there, we do have at the lower end of the banking space, some competitors. We respect them.\n\nThey come with a different approach, a much more packaged approach. We're competing well, but we see competition there that wasn't there a few years ago, OK? If you look then at the enterprise market, it typically is still -- they can bill it themselves if they want to do it with -- for the life of me, I don't know why you want to do it. But every now and then, you'll still see a bank in the enterprise or even the international space to try and do that. Pega is a platform provider.\n\nWe see more active in Europe, where people might contemplate that. So the landscape since we went public hasn't really changed on that front. When you look at the mortgage markets, as a matter of fact, that landscape has changed. Some of our competitors are public companies.\n\nYou can clearly see that their business models are different than ours and the resultant outcomes of that. So we see that as a big opportunity for us to be more aggressive and grab logos and do a land grab in that space. So in the consolidation, that market is going to help us as well because we have a very stable financial company with growth aspirations and we invest in our products. So I feel optimistic that in turbulent times, companies like us with a very stable management team and a strategy that's been proven over time will actually expand and take market share.\n\nMaddie Schrage -- KeyBanc Capital Markets -- Analyst\n\nAwesome. And then just a follow-up for you guys. Have you guys been reevaluating your M&A standpoint with the current macro uncertainties? Thanks.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nThere's some nice assets out there, and obviously, prices came down. But right now, we're focused on execution. Our customers are looking at us critically to see that we focus on their needs and the integration of SimpleNexus. As you could see from the appointment of Matt and Ben and integration into my executive team, those two teams are coming together very well.\n\nWe had a whole team of SimpleNexus people today here in the office, training on cross-selling and cross-pollination of people. And I can tell you the excitement in the room is infectious. So we're focused on execution, get to the rest of the year, as always, beat and raise, make our numbers, and then we'll evaluate as the market develops.\n\nMaddie Schrage -- KeyBanc Capital Markets -- Analyst\n\nThank you. Always appreciate it.\n\nOperator\n\nI am showing no further questions at this time. I would now like to turn the conference back to Pierre Naude for closing remarks.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nThank you, operator, and thank you all again for joining us today. We look forward to talking with you next quarter and seeing many of you at upcoming calls.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHarrison Masters -- Investor Relations\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nJosh Glover -- President and Chief Revenue Officer\n\nDavid Rudow -- Chief Financial Officer\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nTerry Tillman -- Truist Securities -- Analyst\n\nSaket Kalia -- Barclays -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nBrian Peterson -- Raymond James -- Analyst\n\nRobert Napoli -- William Blair -- Analyst\n\nFred Havemeyer -- Macquarie Group -- Analyst\n\nJoe Vruwink -- Baird -- Analyst\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nMaddie Schrage -- KeyBanc Capital Markets -- Analyst\n\nMore NCNO analysis\n\nAll earnings call transcripts"
}