{
  "companyName": "AppLovin Corporation",
  "companyTicker": "APP",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/applovin-corporation-app-q2-2022-earnings-call-tra/",
  "content": "AppLovin Corporation (APP 0.96%)\nQ2 2022 Earnings Call\nAug 10, 2022, 5:00 p.m. ET\n\nRyan Gee\n\nOK. Welcome, everyone to AppLovin's earnings call for the second quarter ended June 30, 2022. Joining me today to discuss our results are our co-founder, CEO and chairperson, Adam Foroughi; and our president and chief financial officer, Herald Chen. Please note our SEC filings, earnings release and shareholder letter discussing our second quarter performance, are available at investors.applovin.com.\n\nDuring today's call, we may be making forward-looking statements regarding future events, expectations regarding the market, the future financial performance of the company, our strategic review of our apps portfolio and our proposal to combine with Unity. These statements are based on our current market assumptions and beliefs, and we assume no obligation to update them, except as required by law. Actual results may differ materially from the results predicted. We encourage you to review the risk factors in our most recently filed Form 10-K for the fiscal year ended December 31, 2022, our press release regarding our proposed combination with Unity and in our Form 10-Q for the second quarter, which we expect to file later this week.\n\nThis call does not constitute an offer to sell or the solicitation of any offer to buy any securities or solicitation of any vote or approval. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933 as amended. This call includes information related to a proposal that we have made for a business combination transaction with Unity Software.\n\nIn furtherance of this proposal and subject to future developments, we, and if a negotiated transaction is agreed to Unity, may file one or more registration statements, proxy statements, tender offer statements or other documents with the SEC. We urge investors and security holders to read such registration statements, proxy statements, tender offer statements or other documents we or Unity file with the SEC because they will contain important information about the proposed combination. We will also be discussing our non-GAAP financial measures. Reconciliations of our GAAP to non-GAAP financial measures are included in our shareholder letter available on our investor relations site.\n\nPlease be sure to review the GAAP measures and the reconciliations as the non-GAAP measures are not intended to be a substitute for or superior to our GAAP results. This conference call is being recorded, and a replay will be available on our IR website shortly. I'm going to turn it over to Adam to discuss some highlights for the second quarter, and Herald will provide more context on our financial performance and our 2022 outlook. Then we'll open up for Q&A.\n\nWith that, Adam, please go ahead.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nThanks, Ryan. Thank you all for joining us today. With our proposal this week, we were really hoping to spice things up at this earnings call. We'll come back to that in a bit.\n\nBut now I want to start by saying that we are pleased with our performance during the second quarter. We delivered strong year-over-year growth led by our Software Platform business, which grew over 100% over the same period last year. Notably, we surpassed 500 Software Platform Enterprise Clients and our revenue from those clients and net dollar-based revenue retention also improved year over year. We're successfully driving adoption by onboarding new clients and deepening our relationships with the existing ones.\n\nI also want to acknowledge the challenging period for the mobile app ecosystem, which was facing a few headwinds going into the quarter and which were compounded by the weaker macro economy. We appreciate the near term may be challenging, so we are hyper focused on the one thing we can control best, continuing to improve our strong software platform technologies. I'm very proud of our team and all of our accomplishments. Let me highlight three of them.\n\nFirst, we successfully completed the shutdown of MoPub. Now that MoPub is fully integrated into MAX and their developers have moved over, we have been focused on strengthening our relationship with all the new partners in the quarter. MAX is on track to hit our goal of a $10 billion a year run rate of media transacted through our platform by the end of the year. MAX is the strongest platform for mobile in-app bidding.\n\nNext, we ramped our AppLovin Exchange continuing the migration of MoPub demand partners to our platform. Just as with the publisher integration of MoPub into the MAX, we are rebuilding 10 years of MoPub efforts in a very short amount of time. We want to facilitate success for these DSPs as they migrate and to give back to the publishers that use MAX in a tough economic time. So we reduced our take rate on AppLovin Exchange by nearly half.\n\nWhile we maintain flexibility on the economics of ALX long term, in the short term, we felt that this was the right thing to do for our marketplace. Additionally, we successfully integrated Wurl and are already using AppLovin ad tech to start testing mobile gaming advertising campaigns on CTV. While this is still in the early stages of testing, the results are promising. And we're excited for Wurl to bring a true performance-driven approach to advertising for the television market.\n\nThis past quarter, we updated our strategic and financial approach to our apps business to focus on segment profitability and long-term cash flow growth. We have better aligned our level of investment across the portfolio to both current market conditions and future opportunities. For some studios, our plan may be to sell, close or restructure to maximize value. To increase margins, the most notable change in our approach was a reduction in user acquisition spend for our portfolio of apps as we increased our own desired return goals.\n\nThe effect of this is that it reduces revenue, which is reflected in our guidance, that will lead to higher margins much more in line with industry peers. We believe we're mostly through this period of readjustment of revenues and margins, and the business will now be in a stable place, able to produce consistent cash flow. With that, let me turn it over to Herald to provide color on our numbers and outlook.\n\nHerald Chen -- President and Chief Financial Officer\n\nThanks, Adam, and thanks, everyone, for taking the time to join us today. We know you may not have had time to review our shareholder letter just yet, so I'll quickly hit some of the key points. As you already know, we are operating in a more challenging environment, notwithstanding though, given the focus and execution of our AppLovin teams around the globe, we were able to continue to grow our top line year over year to $776 million, which is a 16% increase led by our Software Platform business. That growth, plus improvements in cash flow from our apps business, resulted in year-over-year adjusted EBITDA growth of 47% to $270 million.\n\nThat equates to a 35% margin, which is the highest normalized EBITDA margin we posted since being public. We also introduced segment reporting this quarter, which allows us to provide you more information regarding the progress of our businesses. Starting with the Software Platform segment, we had $318 million of revenue, which was up 118% year over year. We continue to deliver highly performant solutions to our most important customers as evidenced by our record 503 enterprise customers with an increase in net dollar-based revenue retention of 204% on an LTM basis.\n\nOn a quarter-over-quarter basis, all of our software solutions had some growth, except for ALX, which in the aggregate led to a quarterly decline of minus 3%. The ALX decline was due to a migration of DSP demand from Twitter's platform in Q1 to our ALX platform in Q2, which takes some time to ramp. And as Adam mentioned, we proactively reduced the take rate from DSPs, so we could pass more dollars along to our publishers. Importantly, from a cash flow standpoint, our Software Platform adjusted EBITDA grew 114% year over year to $197 million, representing a margin of 62%.\n\nWhile certainly a strong margin overall, in particular relative to our peers, during the quarter, we incurred step function increases and several costs. First, we have technology infrastructure costs that we discussed before, including additional data center capacity to support new publishers and demand partners onboarded from MoPub acquisition; and headcount costs. We're now including the team from Wurl, our recently acquired connected-TV platform. For the second half of 2022, importantly, we do not foresee meaningful increases in the Software Platform cost.\n\nTherefore, we expect our Software Platform adjusted EBITDA margin to be between 65% and 70% for the year, consistent with our previous range. Regarding software revenue performance for the year, we have confidence we will deliver against our guidance. The second and third quarter summer months are slower -- a slower part of the year for mobile gaming. But importantly, for our business, the primary driver of our Software Platform business growth is AppDiscovery, which is, of course, powered by AXON.\n\nThe ability for us to more than double revenue over the past year and more than quintuple revenue over the past two years is largely driven by the continuous improvements in AXON. As we find improvements to our technology, we will realize meaningful increases in software revenue, which will flow through at very high margins. We do expect more of these improvements to occur over time, which supports our outlook for this year and beyond. Turning to the app side.\n\nAs Adam described, our new approach to managing the portfolio is to focus on optimizing the business for financial return. Our efforts and progress are already evident in our second quarter numbers. Our apps adjusted EBITDA increased from $41 million in Q1 to $73 million. Margins expanded from 8% to 16%.\n\nOur bigger-than-expected reduction in spend, in particular in user acquisition, impacts the top line in the near term; and therefore, we meaningfully reduced our apps revenue guidance by $300 million for the year. By 2023, our goal is to position the apps portfolio to have a healthy business model where we can grow the top line and earn a solid margin. Closing out on guidance, we did not make any other changes to guidance, including holding the midpoint of '22 EBITDA at $1.2 billion. We can do so given our high-margin Software Platform business and our ability to drive higher margins now in our apps portfolio.\n\nOverall, we remain highly confident in the stand-alone long-term value creation potential for our business given our top line prospects and cash generation potential. To that end, we were able to buy back approximately $340 million of our stock under our $750 million buyback program at an average price of $38 per share. Before we open it up for Q&A, I want to turn it back to Adam to address the unique partnership proposal we made this week to the Unity board.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nThanks, Herald. We'll be happy to answer as much as we can on the call, but I wanted to address some of the key points now. First, why now? Over the last decade, we've been an innovative company focused on building marketing and monetization solutions for app developers. At the same time, we've always had a lot of admiration for what Unity has built with their create and operate businesses.\n\nOur goals have always been very similar, helping grow the app economy by giving tools to creators to help them turn their ideas into growing businesses. In the past, internally, we've discussed the strategic rationale to bring the two companies together, but at the time, it didn't make sense for a few reasons. Up until a couple of years ago, our ad tech business was very similar to Unity Operate. We were both successful in growing ad networks.\n\nBut in the last two years, we launched our machine learning engine, AXON, which powers our ad network and helped it grow by over 500% since. We integrated MoPub into MAX, creating the best in-app monetization platform for developers. And we added Adjust, giving us one of the leading mobile attribution and analytics companies. In particular, because of the strength of AXON, we now see a path to unlocking very meaningful synergies by bringing the two companies together.\n\nWhen Unity announced their ironSource deal, we started analyzing these synergies, and we were excited by the possibilities as they could be over $700 million in just three years. We also weren't sure that Unity would be open to improving their technologies through a merger. Their ironSource bid made it clear that they now see the potential of a full stack solution; and given the synergies we assessed, we felt it necessary to put a thoughtful proposal out there of what our combined companies would look like. To be clear, we are confident in our stand-alone prospects.\n\nHowever, the combined business offers additional scale, data and reach, which, if constructed correctly, would be accretive to the market and to all of our shareholders. So how did we arrive at over $700 million of synergies? Simple. It's based on the numbers and gains we see from our marketing and monetization solutions. In Q1 2021, our first full quarter with AXON, our software revenue was $88 million.\n\nAt the time, Unity Operate reported $146 million revenue. This past quarter, our software business reported $318 million of revenue, compared to Unity Operate reporting $158 million. The fast growth of our software business allows us to apply the trend and get us really excited about what we could unlock together. AXON is extremely good at predicting, which apps users will engage with next, but it can always be improved.\n\nWe have two paths to this continued improvement: one, as we've touched on, our code improvements to lower error rates in our predictions; another and just as important is more access to data, which strengthens our algorithms. With the reach of Unity Create, combined with the reach of our marketing and monetization solutions, the data sets of the two companies would be even more compelling. That incremental data should give us the potential to drive material lifts in our combined businesses. In 2023, separately, our Software business plus Unity's Operate business would be projected to be over $2.5 billion in revenue.\n\nWe believe, just next year, the incremental data flowing into AXON would create material gains, and it only takes 20% improvement to the accuracy of our algorithms to generate $500 million more revenue with nearly 100% flow-through. And what does this mean for the industry as a whole? This $500 million is net revenue. So if you gross it up to what advertisers would spend in round, you can get $2 billion extra of performance spending in the combined platform just from synergies. Now remember, we sized the advertising market in mobile games for you at $25 billion in a prior shareholder letter.\n\nSo the synergies alone would unlock 8% growth in the whole market. This would be a catalyst for growth in our market for years to come. Why did we make the proposal we did? Our proposal was constructed to best position the combined company to drive strong returns for AppLovin and Unity shareholders. We know the Unity board would need to find our proposal superior to their current option on the table, and we believe we've done just that.\n\nWhile ironSource is a great business, the scale we operate at is just much greater. We believe our proposal offers both superior terms and a stronger partner in technology, scale, cash flow and strategic position. Importantly, we have AXON, proven to be super impactful and the efficiencies it could unlock our immense. From a cash flow standpoint, our business alone will generate over $1 billion of EBITDA this year, whereas their current combined plan contemplates reaching that in 2025.\n\nFrom a pure price standpoint, our proposal is at one-half the EBITDA multiple versus their existing deal. We strongly believe this is also good for AppLovin shareholders. We're very confident we can quickly unlock synergies, and the longer-term strategic strength of the business would be very compelling, creating the unquestionable leader in a growth category and a software business with strong growth and cash flow prospects for as long as people will use mobile devices. This would benefit shareholders on both sides making ownership in the joint company really valuable.\n\nNow importantly, our personal decision around why I'm willing to take a backseat on the CEO role. My motivations of every step of our business were to build a bigger platform and truly innovate. I've never been motivated by power, equity or needing to be the face of an organization. I've been committed long term to what we've built here because this is my life's work, and I'm incredibly proud of everyone I work with here who continue to contribute to building great things.\n\nThis combined company could potentially become a $100 billion enterprise, and that gets me really excited. John Riccitiello is a strong leader and CEO for Unity. We've known each other for years, and I believe that, together with our combined teams, there's a huge opportunity to capitalize on. COO means many things, but in this case, integration will be a key to unlocking the revenue and efficiency gains we would be asking our shareholders to believe in.\n\nI would owe it to you all to spend my time ensuring success there. So what's next? We are not going to speculate on the outcome of our proposal, but we feel strongly that we have put forth an offer the Unity's board, its shareholders and our AppLovin shareholders should find compelling and be as excited about as we are. In the meantime, our team remains focused on the three strategic priorities we outlined in our shareholder letter, and we feel very strongly about our ability to continue to grow our business, whether we're successful on this proposal or not. We continue to see exceptional opportunities driven by improvements in our software platform, and we are optimizing our business to improve our margin and our cash generation potential.\n\nWe've been bold since we went public, but really, we've been bold since we started this company. I have the passion and drive to lead an exceptional team to building a $100 billion company, and we will do that here with or without this deal. But we're definitely excited that this merger can accelerate both of our paths to that goal. Now happy to take your questions.\n\nRyan Gee\n\nWe'd be happy to take your questions. We'll go up right up until the hour and get -- fit in as many as we can. [Operator instructions] OK. It looks like we have a few raised hands.\n\nSo first -- We'll take our first question from Clark Lampen at BTIG.\n\nClark Lampen -- BTIG -- Analyst\n\nThanks, guys. Can you hear me OK?\n\nRyan Gee\n\nWe hear you OK.\n\nClark Lampen -- BTIG -- Analyst\n\nOK. Perfect. Thanks, guys. Hey, Adam, I guess, just for starters, I wanted to unpack some of the things that you were talking about with sort of 2Q variances with software, the demand, I guess, migration, the cut in the take rate.\n\nAny way you could quantify maybe how much of a headwind that was for the quarter? I think if I heard right, it was down 3%. Could you give us a baseline maybe for the first quarter? And then I guess as we step back maybe from the Unity deal, you talked about being open to exploring other avenues of growth or sort of scaling the business maybe toward that $100 billion long-term target. Would you think about, I guess, sort of avenues outside of the ad space similar to this deal? Or could you elaborate, I guess, just on big picture strategic priorities if you could? Thanks a lot.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nThanks, Clark. I'm going to reverse the answers. Second one, strategic opportunities in the future to expand our TAM and really our market potential, that really aligns with the new initiatives that we've talked about in the past. We're excited about our current market and our leadership position in it, but to expand to the scale that we aspire to get to, we've got to both expand our reach and the monetization potential for the developers that we have great relationships with.\n\nOne of those new initiatives, CTV, expands reach. It's all about tapping into a new audience on a fast growing platform, and we're now live with the product there. It's just really early stage. But as I touched on in the script, we're seeing positive results already.\n\nAnd then we're also talking about, and we released an announcement around Array. Array is now a marketing platform for carriers and OEMs to give them a life cycle native marketing solution to take -- to give them the capacity to deliver better advertising to their customers. We were sharing revenue with those carriers and OEMs, and we think that can create a big expansion of reach as well. Then we talked about, in the past, NFTs.\n\nWe're still working on NFTs and blockchain as a new initiative. And really, the idea there is to get into payments. It's to allow our developers to create the transfer of ownership of a digital good to their customers and that transfer of ownership to be a transaction that would flow through our payment mechanism, our own blockchain. If we can execute on these new initiatives, we will be executing and expanding the TAM and giving ourselves a runway for many, many years of growth.\n\nNow that said, we have a lot of confidence in our current business. For multiple quarters now, we've had a lot of sequential growth in that business, and that came from AXON. The efficiencies we unlock by improving that technology made our ability to drive better results for advertisers. That's carried forward.\n\nThe more improvements we make on AXON going forward, the bigger we're going to be able to expand the dollars that flow through our platform, and the bigger we'll be able to create an influence on TAM expansion in the market that we're in today. That creates upside in this business and the core opportunity we have going forward as well. I think, Clark, your other question was around MoPub DSPs. We did bring the MoPub DSPs.\n\nWe're in the process of transitioning MoPub DSPs over to ALX at the moment, and that's ongoing process. Again, this -- the MoPub Q1 focus was around publisher migration because that part of the platform was shutting down. Q2 and ongoing will be around getting DSPs onto our platform and ramped. We did make a short-term decision to cut take rate, as I touched on, by a little bit under half.\n\nAnd that was driven by two reasons: One, we want the DSPs to be successful and ramped on our platform; but more importantly, we want to flow more dollars to our publishers at a time when, frankly, because brand dollars are less in the economy and less in the ecosystem, publisher yield has gone down. So we wanted to offset that by reinvesting back in our own MAX ecosystem. We don't talk about the scale of the DSP business really, but you get back into it in a way by understanding the short-term impact with what we sized MoPub at originally, a couple of hundred million dollar business that's now transitional coming over would then be, let's call it, in a migration period, down a little bit and then have that and then divided by four to get to a quarterly impact. So call it somewhere in the neighborhood of $20 million.\n\nRyan Gee\n\nOK. Thanks, Clark, for the question. We'll go next to Matt Cost with Morgan Stanley. Go ahead, Matt.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nHey, thanks for taking the question. Maybe I'll piggyback on Clark's question about the ALX MoPub migration. So I just want to understand, so the publisher bonuses -- and please correct me if I'm wrong about this. The publisher bonuses last quarter were to get people to transition onto the combined MAX and MoPub platform that publishers have inventory for sale.\n\nSo now you're working to get DSPs that were previously bidding into that inventory to move over to MAX. I guess, if that's correct, what is holding them back from transitioning? I mean if they were already bidding into that inventory, what are they looking for in order to move over to the new platform? And have you noticed or observed that cutting the take rate has been enough to get them to start through that process? And then I have one follow-up.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. Good questions, Matt. So look, the publisher bonuses went to publishers. We don't yield dollars off the publishers.\n\nBut once we get the supply, that creates strength of the platform. That's given us the largest reach in mobile for that MAX audience platform. And then the DSPs will follow. And so we do have over 90% migrated now, but these DSPs won't have to go through the technical effort of reconnecting the pipes to a new exchange, MoPub over to MAX.\n\nSecondarily, their models have to learn on new inventory. Data, let's call it, over the last 10 years, most of these DSPs were plugged into MoPub five-plus years. So they had tons of learning on the MoPub exchange that now has to port over to the MAX exchange for them to get their spend through the platform to increase the levels it was at. We're well on that way because MAX is a bigger platform, but we paired that with just cutting the take rate.\n\nSo that's just a short-term cut to the potential revenue. We're not bound to keep the dollars that we're pushing to publishers from the DSPs at the level that we decided to put it at. But our goal with MAX is to ensure that publishers have a consistent and strong business. And as we're looking at the macro trends that we're seeing, brand CPMs through the MAX platform have decayed.\n\nIt decayed in the entire digital landscape. And with that, publisher yield has gone down. So we felt like it was our responsibility to flow more dollars to the publisher, which helps them maintain a good standard at baseline in their business. And then as the economy improves and dollars flow back into the ecosystem, we can make whatever judgments we need to on the economics of these different revenue streams in our business.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nGreat. Thank you. And then just on the guidance for the software platform, is there a market growth assumption underlying that? And has that changed? Or how has that changed year-to-date?\n\nHerald Chen -- President and Chief Financial Officer\n\nObviously, we're operating in a tougher overall environment. But as we said, we do control mostly our own destiny through our own technology. If we're able to improve our AXON engine, which has driven obviously extraordinary growth over the past year and actually now a few years, we think that's the key driver. So look, the summer months are slower.\n\nThird quarter will be probably similar to the second quarter, but we do see acceleration in the fourth quarter due to seasonality, but more importantly, due to our own efforts on our technology platforms.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nGreat. Thanks.\n\nRyan Gee\n\nOK. Great. Thanks. Thanks, Matt, for the question.\n\nWe'll go next to Martin Yang at Oppenheimer. [Operator instructions]\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nHi, good afternoon. Thank you for taking my question. Adam, can you address your strategic rationale for Unity's Create side of the business. If you were in a role of the CEO, how would you think about Create's synergy with the rest of the business with AppLovin's and its longer-term future.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nThanks, Martin. And obviously, we're really early stages here. We made a proposal. We'll be waiting for a response.\n\nAnd so we're not too deep into this type of analysis. But I will say just conceptually because I've known the Unity business the whole time we've been building this business. We have a lot of respect for the Create business. Frankly, it's one of the most complicated and impressive technologies in the technological world today, and it enables creators of all kinds to bring their content online in a 3D real-time manner.\n\nAnd the value of that to us and why we were excited about making this proposal is that we've built this complex and very powerful machine learning technology, AXON, and it does better if it has more data. Create is the underlying technology in over -- in the majority of mobile games. So if you think about that, the contextual data that Unity has access to is very compelling. We also reach a lot of the mobile games in the ecosystem through our technologies on MAX and AppDiscovery, but that combination could be very compelling.\n\nAnd that's why Create is important to us and why we see this path of being able to unlock a lot of synergies by the complementary nature of these two complicated technologies, which could unlock a lot.\n\nHerald Chen -- President and Chief Financial Officer\n\nI'd just add to that, again, we're very early in that discussion. So far, it's been a one-way discussion. Create is definitely a different business model than how we've operated our business. But the beauty of the transactions Adam said is the synergy we can get using our AXON technology with their Operate business, where we'd have tremendous free cash flow generation.\n\nAnd on the Create side, where they've invested very, very heavily in the business, it is a market leader. It is very, very difficult for anybody to chase them down now. And they are on the precipice of migrating over to being cash flow positive on that business. So our view in the medium and long term, that's a very, very unique software asset that's high growth and ultimately will also be contributing to free cash flow, which we're excited about.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nThank you. I have a follow-up with Herald. Can you maybe confirm that your $2 billion software platform target for '23 is still intact?\n\nHerald Chen -- President and Chief Financial Officer\n\nThat's still our target. Obviously, with the headwinds of macro in the industry and some changes in privacy, that becomes a higher target. But given our strategic position today, some of the new investments we've been making, acquisitions we've made, that remains our target -- internal target.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. I'll add to that. I think the important piece that we want our investors to understand about our business is we do control our own growth, and that's really truly improvements to the AXON technology. And you've seen that in the last four quarters where we had these sequential step-ups.\n\nEach one of those were enhancements to the technology to make it more accurate. This is a predictive technology, and the goal is to predict which apps users are going to download and engage with. Every predictive technology that's built on top of a lot of data is going to have an error rate, and we have an error rate. Every time we can reduce that error rate, the accuracy of those predictions go up and the business will see a step function gain in revenue.\n\nSo what we get excited about and why our teams work so hard is to look for those lifts. When we find one, it'll increase the business, and it won't be a slow increase. It will be a step function. So given time, we're going to find more of those lifts, more of these accuracy enhancements.\n\nAnd that will give us a lot of confidence in bigger numbers in this business given the scale that we're operating at today.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nGot it. Thank you.\n\nRyan Gee\n\nThank you, Martin, for the question. We'll go next to David Pang at Stifel. David, go ahead.\n\nDavid Pang -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks. Can you hear me?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah, great, David.\n\nDavid Pang -- Stifel Financial Corp. -- Analyst\n\nThanks for the question. Can you talk about the implications of Google joining MAX as a bidder? And as a follow-up, can you talk about just your thoughts on capital allocation in the midst of the Unity merger proposal?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYes, I'll talk to the first one. Herald will talk about the second one. So on Google bidding, obviously, we announced that we're one of three mediation platforms they're externally bidding into for the first time ever. This is truly exciting for us.\n\nWhen we built MAX, our intent with it was to create an open, transparent and fair platform for real-time auction. But a lot of the ad technologies in the industry weren't there yet. Now we've got a good amount of the market already bidding, but Google is the biggest company, and they were the big one to go tip into bidding to really make this initial goal that we have for the platform a reality, where we one day envision the entire market real-time bidding on our exchange and that being the best way to create efficiency for all constituents in the market, the publisher, the advertiser and the consumer. And so Google taking this step, we think, is giant.\n\nAnd they're still in the midst of testing. We're in a beta period with them on the platform, but as it ramps, of course, and we've disclosed our economics on MAX, our 5% of the dollars that flow through our ecosystem from a bidder, we take. So today, we're not generating any dollars or any material dollars, I should say, from Google into our platform. And the day that they can scale bidding, it will become a material revenue stream for our business, which we're excited about.\n\nHerald Chen -- President and Chief Financial Officer\n\nAnd then with regard to capital allocation strategy, I think we remain the same as we've always been. We're focused on how do we create the best long-term shareholder value for all of our shareholders. So on a stand-alone basis, we've obviously been doing that through the acquisitions, through investing in our team and our development projects. We do believe specifically in the case of Unity, we really have a partnership with them, and that's why we offered essentially our combination is fairly equal, a little different on voting, a little different economics but essentially as a partnership with them to go attack the market that we know extremely well and do it well together.\n\nThey do have an amazing engine that's basically the operating system for the mobile gaming industry or a large portion of it. That's also applicable outside the gaming industry, which is very interesting. That is a different business model that I just mentioned from the one that we've been pursuing with cash flow focused. On the other side, their Operate business, combined with ours, it will be a very, very powerful business, and we're excited to go put our capital behind that.\n\nSo we'd rather reserve our balance sheet, cash, leverage capacity for investing in that combined business or as I said, on the stand-alone business as we've been doing in the past, we've been reinvesting. When we find, if you will, the no-brainer acquisitions to do, we're certainly leaning in to go do those things.\n\nRyan Gee\n\nOK. Thanks, David, for the question. We'll go next to Stephen Ju with Credit Suisse. Stephen, please go ahead.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nOK. Thank you. Can you hear me?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nAll right. Great. Hi, Adam and Herald. So I wanted to dig in a bit on the inputs to the synergy calculation you laid out earlier.\n\nSo you talked about potentially a 20% lift to accuracy to generate an incremental $500 in net revenue. So -- but from the outside looking in without an engineering or a data science background, it's hard for us and investors to kind of conceptualize how easy or difficult it will be to drive that accuracy lift. So can you talk about, from a practical perspective, what you need to do? So day zero, the merger has been consummated and you're sitting in the room with John. What are you doing first? And also, should we be thinking about potentially a materially better than 20% or 50% or even 100% lift to accuracy and what the potential could be? Thanks.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. I mean, look, this is what gets us really, frankly, most excited about the opportunity. As you all know, the trajectory that our advertising business was on and the scale that it was at was so materially different than what AXON enabled us to get to over a very, very short time. Now I really like to unpack a little bit of what is AXON.\n\nSo underlying our entire platform is a big data platform. This is what we built over the last decade. We ingest a ton of data from all sorts of data sources. And this comes into our platform, and the AXON is the modeling on top.\n\nIt's the math that says, I have a bunch of contextual data. I have engagement data on devices. How do I take that data and predict, which apps are users going to engage with so that I can show them a very relevant advertisement? That math is extremely complex. And the data platform, that underlying infrastructure and all the tools and reporting and everything that we've built over the last decade on top of it is also extremely complex.\n\nThen you've got Unity Operate. That's already a scaled advertising business. We know it well. Obviously, we're in the market with their customers and MAX.\n\nBut if you take those two businesses and allow them to tap into that same underlying data platform and allow them to tap into the same math and the same algorithms, the unlock could potentially be huge. It's more scale, more customer reach, more data, all coming into the same place that's proven to be very, very successful for us. And this is what we look for when we look for synergies and deals, is where can we apply our machine learning and data technology expertise to be able to unlock more. So to your point of 20%, obviously, we don't know if it's going to be 20% or 50% or 100%.\n\nFor us, it was over 500% in seven quarters. So it had a huge impact. We put out there what we think is a conservative number because we know the power of our own technologies.\n\nHerald Chen -- President and Chief Financial Officer\n\nAnd maybe just taking it from two high-level perspectives. One, obviously, on their current transaction, they're discussing $300 million of synergies. We're obviously a much larger partner for them, a lot bigger business and a lot more overlap. So you could just think about the baseline at $300 million.\n\nProbably, it wasn't clear whether that's cost or revenue synergies. But talking about the cost side for a moment, just top down. Adam mentioned having a combined Operate and our Software Platform business over $2.5 billion of revenue. That would probably have a cost base of $1 billion to $1.5 billion of costs.\n\nAnd so apply any reasonable percentage of that. There's an opportunity to really get some efficiencies, let alone, obviously, all the normal back-office corporate functions and two public companies considering coming together. So we do think the ability to achieve $700 million EBITDA synergy, a lot of work to be done. But given the lift we have on the revenue side and then on the cost side, we think that's achievable.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nThank you.\n\nRyan Gee\n\nThanks, Stephen. We'll go next to Ralph Schackart with William Blair. Ralph, please go ahead.\n\nRalph Schackart -- William Blair -- Analyst\n\nGreat. Thanks for taking the question. First one, just more short term in nature on the take rate, Adam. I'm just curious on the duration of that, kind of how you're thinking about that.\n\nAnd are you seeing the sort of intended sort of benefits that you were looking for? And then I have a follow-up for Herald.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. I mean, look, like ultimately, this is us reinvesting into our own ecosystem, and we see it out of necessity right now because the brand dollars are really dried up in these digital markets today, while we've got the supply chain and macro issues. As that eases up as we go forward, we have a decision to make: keep the take rate where it is or expand it. That's something that's just a manual toggle in our system.\n\nWhat's more important for us is ensuring that the publishers on our system have a thriving business. So when we get there, we'll make the decision. But as the economy improves and as more dollars go back into the system, this part of our business, frankly, isn't the biggest driver of growth in our business. Our entire system is automated around return on ad spend goals for advertisers.\n\nSo as you think about our AXON platform, again, advertisers plug in the goals, and they want us to go achieve those goals. We have very little churn on our platform. We've got over 200% net dollar retention. So these advertisers are still spending, but the problem is that their ability to generate revenue on the other side of those dollars spent decreases in a bad economy because they have less brand dollars flowing in.\n\nSo in a way, we're offsetting that. And as the brand dollars come back into the ecosystem, our systems for the much bigger part of our business, AppDiscovery, automatically, will increase bids, will increase yield to the advertiser and will increase scale of our platform. So we end up with two benefits when the economy turns the other way. And that's hopefully not going to take too much longer here.\n\nRalph Schackart -- William Blair -- Analyst\n\nGreat. And then, Herald, I think you had made the comment that on the Unity offer had been primarily sort of a one-way conversation. Sort of any color you could add to that? Are you in dialogue at all? Or anything you're comfortable sharing will be appreciated. Thanks.\n\nHerald Chen -- President and Chief Financial Officer\n\nThanks, Ralph. No, we put in our proposal, and we're waiting to hear back.\n\nRalph Schackart -- William Blair -- Analyst\n\nOK. Thank you.\n\nRyan Gee\n\nThanks, Ralph, for the question. We'll go next to Youssef Squali at Truist Securities. Go ahead, Youssef.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nExcellent. Can you hear me?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYup.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nAll right. So two quick ones for me. Herald, you said earlier something about your expectation even in 2023, you expect to grow the apps business top line and stabilize margins. Can you maybe just -- under the assumption that you still own that business by then, what gives you confidence in that considering the most recent quarter performance and the last couple of quarters? And then I guess on the Unity proposed offer, I guess at a high level, philosophically, how are you guys looking at voting control? And how important is that to you? Notice that you have that in there, 51-49? How important is that to consuming the transaction?\n\nHerald Chen -- President and Chief Financial Officer\n\nYeah, happy to take both of those maybe in reversed order. On the Unity voting structure, look, the reality is we want to be a partner of theirs. We think it's a very friendly nonbinding, unsolicited offer. So we wanted to make sure they understood that.\n\nThe reality is no one would really have a controlling stake in the combined business, and so we would have a diversified shareholder base, highly liquid and no one would really be in that control seat, was really our goal there. And then the first question was -- remind me.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nWas around the apps business.\n\nHerald Chen -- President and Chief Financial Officer\n\nYeah. On the apps business side, look, we've had a change of leadership there. We have a completely different lens of how we're managing the portfolio. Adam and I are now digging quite deeply at each of the applications and studios themselves.\n\nAnd so -- and in some ways, we get to cherry pick what are we going to be left with coming into '23 and that we want to be a healthy business. Of course, if the market improves and someone could come in and pay us a very attractive price for that, as we said, it's nonstrategic. And if that's the right financial return, we'll do that. Otherwise, we want to make sure we have a business that is healthy, that is growing and has industry-type margins, which is, we think, 15%, 20% at least on an EBITDA basis.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. I think the other point to add on the growth point is really like we're not talking about exceptional growth, just industry growth. And when you think about the period that we are now and the period that we were for the last couple of years, there was a lot of overconsumption of games during COVID. People were spending dollars more than they typically would in games.\n\nPeople were consuming more content because, frankly, they couldn't go anywhere. Now we're in a period of under consumption because people are just past COVID. Everyone's traveling. Sun's out, and people are having fun in the sun.\n\nWe'll eventually get back to normal traffic patterns, and mobile gaming is still the most accessible and most affordable form of entertainment. We started this business in 2012. So we've been on the front lines of seeing all the traffic patterns, all the trends in both the COVID period and today's period are anomalies. Once we get back to normal traffic patterns, we fully expect this to be a growth category.\n\nAnd our apps business now that we've had a couple of quarters where we've minimized, we've taken down user acquisition spend based on much more realistic ROAS goals to what industry norms are. We're seeing revenues stabilize, and then now we expect that business to just be a standard mobile gaming business, which will grow with the ecosystem.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nThank you. And just very, very quickly, was there -- back on the Unity proposed transaction. Did you guys have any discussions with them before the IS deal was announced?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nNo. I mean, look, I can answer that without answering it too directly because we've known Unity for a long time. I've known JR for years, have a lot of respect for what he and the team have built over at Unity with Create and Operate. And I hope they have mutual respect for what we've built over here.\n\nSo in a way, like I can't answer that too clearly because over the past many years, we've had discussions well in the past. But what we're looking at today was a bid that we made really unsolicited. It was -- it can't -- we were really busy in Q1 with MoPub, right? And then we've seen a lot of growth in our own business. We're putting the pieces together.\n\nAnd of course, over the years, we assessed the Unity business and been very -- really impressed with what they put together. And over the last couple of years, as we put our technology stack together, we saw a lot of complementary pieces, but we didn't stop to think about the synergy math until they announced that ironSource deal, and we started doing the analysis. And then we just saw a need to put this bid out there because the math was so compelling to us that we felt putting a very thoughtful offer out there would be appropriate for both parties, companies, teams and shareholders.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nAll right.. Thank you. Thank you, both.\n\nRyan Gee\n\nThank you, Youssef, for the question. We'll go next to Tim Nollen at Macquarie. Go ahead, Tim.\n\nTim Nollen -- Macquarie Research -- Analyst\n\nThanks a lot. Hi, Adam. Hi, Herald. A couple of things.\n\nI want to follow up on the last point, which was also a previous question. And I'm just wondering how much does the effort to sell the gaming app business factor into any decision that Unity might make? It sounds from previous comments like it might be something that would be very useful to them, to the combined company. But at the same time, you're going to the process of selling it. So I just wonder like how that would factor into any decision that Unity would make to actually go ahead with you.\n\nAnd then --\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. Let me maybe answer that one first. So look, like we can't address what other people's decisions would be on parts of our business. But we decided last quarter it wasn't strategically critical to our software business as our software business has become so large scale.\n\nIf we were able to put the two companies together, that software business would be incredibly large scale. And truly, the parts, the components of that that would be in focus would be AXON and Adjust and MAX and Create and Operate. These are software businesses at their core. They don't need the mobile gaming side.\n\nAnd so we would still operate the business as a good business just like we would do independently. But I don't think the thought process around games changes materially in any way when the combined business would be one of the world's largest, fastest growing, most cash flow-generative Software businesses.\n\nTim Nollen -- Macquarie Research -- Analyst\n\nYeah. OK, I get it. Secondly, and separately, you mentioned privacy as an issue that's kind of weighing on things right now. You haven't really talked about privacy concerns being an issue before.\n\nI think like a quarter, two or three ago, we were all worried about IDFA and what impact that would have on the business. And it had little to none, I think. Are you just talking more on the game app side if that's weighing down things? Or can you just talk a bit more about what you mean by the privacy implications?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nYeah. To unpack that, it really has to do with privacy constricting growth opportunities in the whole sector. And when you take the IDFA away, you lower the capacity for mobile gaming companies to go target effectively on all channels. We're a contextual channel at its core, so it didn't have as much direct impact on our business.\n\nBut we're now seeing the gaming category slowdown in growth. And of course, there's macro trends. But more specific to the gaming category is this IDFA was taken away. So we're four or five quarters in to advertisers, mobile gaming companies not being able to spend all of their money as efficiently as they used to be able to spend.\n\nAnd that eventually has effects on growth. And so we think that's one of the inputs into the fact that we're seeing lower game consumption today. We do think the bigger one is just this hangover post this COVID overconsumption period that will reverse out, that this privacy one isn't an issue. And frankly, it's one of the reasons why we were really compelled to make this bid for this merge with Unity because the synergy math is so impactful on the ecosystem itself to be able to spend more dollars.\n\nTogether, we were able to unlock these synergies, and mobile gaming advertisers could spend billions of dollars more a year in a performance manner. Together, we'd actually be able to be a catalyst for growth in the ecosystem. Of course, on our own, we've been doing that with AXON as our business has grown really quickly and gotten to large scale. We're causing that TAM expansion, too, to offset some of these losses from IDFA as shares come to our platform, so the ecosystem just needs more of that.\n\nTim Nollen -- Macquarie Research -- Analyst\n\nThanks.\n\nRyan Gee\n\nOK. Thanks, Tim, for the question. We'll take our last question from Franco Granda with D.A. Davidson.\n\nFranco, please go ahead.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nHi. Yeah. Thanks for --\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nWe lost you, Franco.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nCan you hear me now?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nNow you're back.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nOK. Awesome. Thanks for taking my question here. Your software business is clearly doing very well, so well, in fact, that you're able to pass on some of the potential revenue to your customers and keep your outlook unchanged.\n\nAnd this is during a moment where the self-attributing networks are seeing big head winds. So can you just speak to what is driving the outperformance at AppDiscovery? Is it simply improvements in recommendations? Or what are your thoughts there? And then secondly, Adam, you talked about the introduction of Array during the quarter. What potential customers will you be focusing on first? And what is that active outreach to clients due to your margins?\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nSo maybe I'll answer the first one. Herald, you take the second one. So on the first, really, our growth has come from a couple of things. And one, traditionally, we've always been a contextual data platform.\n\nWe've never known the user. In fact, we don't need to know the user's name, the user's background, the demographics of the user. These are not things that matter for our models. What we care about is mobile game engagement data off of the device.\n\nAnd so our models have always been built around that. Now we took this baseline of data, which definitely was inferior to a lot of the bigger platforms that have direct relationships with the consumer in an era of IDFA and prior to all these privacy changes, much more personalized advertising to the person. And so now advertising has shifted much more to the device. Then we paired our data with AXON.\n\nThe math in our system just got better. And that system is really, really complicated. But when we put it together, we put our data platform and AXON together the right way, it made our system just much more accurate. And getting more accurate drives more value to advertisers, so they can put more dollars in.\n\nThat's what's reflected in that net dollar revenue retention that we put up over 200% every one of the last five quarters. And really, that's why we're thriving in this ecosystem today. And we expect that to carry forward. These are not advantages that we have that somehow are going to disappear.\n\nThis is just what our business is built on because this is the only access to data that we've ever had since we started the company.\n\nHerald Chen -- President and Chief Financial Officer\n\nYeah. With your question regarding Array, we're super excited about it, but it's still very early. We've got a really good team, still a small nimble team, doing an AppLovin style, where we can move very, very quickly, build great product. It does leverage our existing ad tech capabilities, of course.\n\nAnd so I think you asked about the customer base. We'll go after the same OEMs and providers that are out there. There's only a certain number of those there. But we've already started really good dialogues with several key ones.\n\nWe're helping them build product road map. They're helping us build hours. And so we hope it to be something more meaningful in terms of getting started from a revenue standpoint really in '23 and scaling up to something more meaningful '24, '25.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nThat's helpful. Thanks.\n\nRyan Gee\n\nOK. It looks like that's all the questions we have for today. I'd like to turn it back to Adam or Herald for any closing remarks before we conclude the conference call.\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nLook, thanks, everyone, for taking the time. I know it is an interesting period in our industry. We are excited about the stand-alone prospects about our business. We think we've built a stack -- a full-stack solution that's super interesting.\n\nIf we think we can integrate that as a partner into Unity, that would be a very interesting place to be as well a different path, but could be also very accretive to both sides of the shareholders. We did need to put a superior proposal in according to their contract, which we think our proposal is just that, in so many ways, strategically, scale and then also just in terms of absolute price. So we'll keep everybody informed to the extent we can on that process. But in the meantime, we're certainly all heads down focused on our own business.\n\nSo thanks for the time.\n\nRyan Gee\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRyan Gee\n\nAdam Foroughi -- Co-Founder, Chief Executive Officer, and Chairperson\n\nHerald Chen -- President and Chief Financial Officer\n\nClark Lampen -- BTIG -- Analyst\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nDavid Pang -- Stifel Financial Corp. -- Analyst\n\nStephen Ju -- Credit Suisse -- Analyst\n\nRalph Schackart -- William Blair -- Analyst\n\nYoussef Squali -- Truist Securities -- Analyst\n\nTim Nollen -- Macquarie Research -- Analyst\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nMore APP analysis\n\nAll earnings call transcripts"
}