{
  "companyName": "Sarepta Therapeutics",
  "companyTicker": "SRPT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/sarepta-therapeutics-srpt-q3-2022-earnings-call-tr/",
  "content": "Sarepta Therapeutics (SRPT 1.82%)\nQ3 2022 Earnings Call\nNov 02, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Sarepta Therapeutics third quarter 2022 earnings call. As a reminder, today's program is being recorded. [Operator instructions] At this time, I'll turn the call over to Mary Jenkins, senior manager, investor relations. Please go ahead.\n\nMary Jenkins -- Senior Manager, Investor Relations\n\nThank you, Kathy, and thank you for joining today's call. Earlier today, we released our financial results for the third quarter of 2022. The press release is available on our website at sarepta.com, and our 10-Q was filed with the Securities and Exchange Commission earlier this afternoon. Joining us on the call today are Doug Ingram, Ian Estepan, Dallan Murray and Dr.\n\nLouise Rodino-Klapac. After our formal remarks, we'll open the call for Q&A. I'd like to note that during this call, we will be making a number of forward-looking statements. Please take a moment to review our slide on the webcast, which contains our forward-looking statements.\n\nThese forward-looking statements involve risks and uncertainties, many of which are beyond Sarepta's control. Actual results could materially differ from these forward-looking statements, and any such risks can materially and adversely affect the business, the results of operations and trading prices for Sarepta's common stock. For a detailed description of applicable risks and uncertainties, we encourage you to review the company's most recent quarterly report on Form 10-Q filed with the SEC, as well as the company's other SEC filings. The company does not undertake any obligation to publicly update its forward-looking statements, including any financial projections provided today based on subsequent events or circumstances.\n\nAnd now, I'll turn the call over to our President and CEO, Doug Ingram, who will provide an overview of our recent progress. Doug?\n\nDoug Ingram -- Chief Executive Officer\n\nThank you, Mary. Good afternoon, everyone, and thank you for joining Sarepta Therapeutics third quarter 2022 financial results conference call. Commencing with performance, as you will have seen in our release, we had another strong quarter serving the community with our three approved therapies EXONDYS 51, VYONDYS 53 and AMONDYS 45. As we mentioned on our second quarter call, about $5 million anticipated for the third quarter came in and was booked in the second quarter.\n\nAnd even with that, total revenue for the third quarter was approximately $230.3 million and net product revenue was $207.8 million, representing a nearly 25% growth over the same quarter last year. To remind you, in the second quarter, we raised our full year total revenue guidance to between $905 million and $920 million and our net product revenue guidance to between $825 million and $840 million. And in light of our continuing strong performance, we remain comfortable with that guidance. So let's move now to our gene therapy platform and specifically to SRP-9001, our gene therapy for Duchenne muscular dystrophy.\n\n2022 has been a momentous one for SRP-9001 and for the Duchenne community that we serve. Over the course of the first half of 2022, we discussed with the FDA the possibility of submitting a biologics license application or BLA for the approval of SRP-9001 on an accelerated basis. As a result of those discussions and the written feedback that we received, we announced on our second quarter call that we intended to submit a BLA for the approval of SRP-9001 to treat ambulatory Duchenne patients. And in the third quarter, we did indeed submit our BLA for SRP-9001.\n\nNow if all goes to plan, the FDA will accept the BLA for filing at the end of November of this year. We anticipate a PDUFA date on our BLA in May of 2023 and if successful, a launch by the middle of 2023. To those who have asked why we are trying to move so urgently, let me talk for just a moment about why seeking accelerated approval here is not merely appropriate but is compelled by good science and ethics. We are justified by appropriate disease, therapy and evidence.\n\nThe accelerated approval pathway is an innovative modern tool that has extended and saved countless lives, including patients living with HIV/AIDS, patients living with cancers and patients living with Duchenne. It brings therapies to patients in time to actually intervene and do good. And at the same time, it results in an explosion of innovation. And the FDA itself has repeatedly noted the opportunity for accelerated approval in gene therapies where appropriate.\n\nAnd from our perspective, SRP-9001 is an ideal candidate for accelerated approval review. Let's consider, first, patients need this therapy now, not someday or eventually. Time is the enemy of those living with Duchenne. It irreversibly robs children of their muscle and their function on an hourly and daily basis, ultimately killing them.\n\nPreventing further disease progression is the greatest need of every Duchenne family and patients should not have to irreversibly suffer when a well-established regulatory pathway exists to bring that therapy to them now. Second, Duchenne is a well-characterized monogenic disease and the shortened functional dystrophin robustly produced by SRP-9001 is an upstream surrogate endpoint for accelerated approval, one addressing the proximate cause of disease, one founded on a wealth of scientific evidence supported by preclinical related biomarker and clinical functional benefits and one based on a well-established precedent as the FDA has approved four therapies to date using shortened functional dystrophin as a surrogate endpoint. And finally, we are well underway to confirm the results of that accelerated approval. Our proposed confirmatory trial EMBARK is in fully rolled and fully dosed, so children can get this treatment rapidly and the accelerated approval will be expeditiously confirmed through EMBARK.\n\nThe risk of granting accelerated approval is fleetingly small, while the risk of harm to Duchenne patients if we did not seek accelerated approval is certain, is severe and is indelible. So planning for the success of our BLA, we are ramping up manufacturing. We have bolstered our commercial, medical affairs, patient services and access teams, and we are focused on site and launch readiness. Additionally, we have already commenced a study to narrow the early exon mutation exclusions currently in EMBARK and thus, if successful, to safely expand the availability of SRP-9001 to a larger percentage of the Duchenne population.\n\nLikewise, we are finalizing protocols for the commencement of ENVISION, our study for nonambulatory patients as we look to expand the label for SRP-9001 to nonambulatory patients as soon as possible. And continuing on the theme of expanding the addressable population, next year, we intend to start a study with our partner, Hansa Biopharma, to explore the use of imlifidase to cleave IgG in rh74 positive Duchenne patients with the goal of safely and effectively permitting dosing with SRP-9001. Dr. Rodino-Klapac will provide further commentary on our gene therapy plans and those will include our plans for LGMD in 2023 as well.\n\nNow moving to our RNA franchise. As you are aware, we have three approved PMOs today, EXONDYS, VYONDYS and AMONDYS. The first of those approvals, EXONDYS 51, came in the fall of 2016, nearly six years ago. So in addition to continuing to prosecute our two main post-marketing commitments for those approvals, ESSENCE and MIS51ON, we have had the opportunity with respect to EXONDYS to evaluate the world evidence of the effect of our PMO therapies over time.\n\nAt the World Muscle Society conference in Halifax, Nova Scotia in October, we presented study results on the benefits of EXONDYS versus natural history controls. For those interested, you will find the poster on the investor page of our website, including the survival benefit associated with EXONDYS. Dr. Rodino-Klapac will discuss these findings in her remarks momentarily.\n\nEXONDYS was approved on an accelerated basis using internally shortened functional dystrophin. As encouraging as the early data was to support its approval and that of VYONDYS and AMONDYS as well, with a degenerative disease, those full benefits mature and reveal themselves only over time. And that is the value of an accelerated approval to the lives of patients living with a deadly degenerative disease. Without it, patients would have been denied this therapy at least by additional years and perhaps we would never have been able to generate this long-term data without that approval.\n\nSo moving to our next-generation RNA therapy, the peptide conjugated PMO or PPMO SRP-5051. We are dosing momentum Part B, and we are on track to complete enrollment this year, and we'll have a data readout on that trial in 2023. Finally, commenting on a management transition. We are announcing tonight that Bill Ciambrone, our head of technical operations and Manufacturing, will be retiring.\n\nI would like to give a big thank you to Bill, without whom we would not be in the position to launch SRP-9001 next year. After an impressive career, Bill had been largely retired when I approached him in 2019. But given our mission and our science, and I'd like to believe some fair amount of persuasion from me, I was able to coax Bill out of retirement and give them three important goals. First, to complete the process and analytical development for SRP-9001, and to ensure we had capacity to launch SRP-9001 and to fully meet the need of the community; second, to build a robust, sustainable technical operations function that has the talent and the focus to scale with Sarepta's ambitions; and third, to prepare his successor as Bill had intended to make a large impact in a relatively short period of time.\n\nI am proud to say that Bill achieved every one of those goals. We have the process, the people and the capacity to launch SRP-9001 and to make it a success. Bill has built a best-in-class organization, and we now have over 300 technical operations personnel driving us forward. And Bill has prepared an ideal successor.\n\nBill will transition leadership of the technical operations organization to Bilal Arif at the end of this year. And then, he will stay with us as both an advisor to me and to the manufacturing organization through June 2023 after the presumed PDUFA date for SRP-9001. Bilal has been with Sarepta and intimately involved in all aspects of our manufacturing activities, including SRP-9001 from the beginning of 2019. He has well over 20 years of experience, including over eight years at Shire, where he worked for and closely with Bill.\n\nI'm absolutely confident that in Bilal, we could not have a more aligned successor to Bill, someone who will continue our progress without missing a beat, who will continue to drive our technical operations and who is intimately familiar with our strategic priorities and the tactical requirements for success. Now Bill has made an enormous impact at Sarepta, and he's been a great thought partner for me and for all of my colleagues on the executive committee. And I know that sentiment is shared by our board as well. I am very pleased that he will remain involved and advise us through the approval of SRP-9001.\n\nSo thank you, Bill, for all that you've done and for what you will do for Sarepta and for putting us in this great position to be successful. And with that, let me turn the call over to our head of R&D and chief scientific officer, Dr. Louise Rodino-Klapac. Louise?\n\nLouise Rodino-Klapac -- Chief Scientific Officer and Executive Vice President\n\nThanks, Doug. In the third quarter, we achieved two critical milestones for the SRP-9001 program. The completion of enrollment and dosing for the Phase 3 EMBARK Study and submitted our BLA to the FDA ahead of schedule. I could not be prouder of my team of R&D and regulatory for their commitment, perseverance and execution while keeping the Duchenne community and our mission at the forefront.\n\nOn a personal note, these accomplishments are both personally and professionally meaningful and bring us closer to realizing the potential of SRP-9001 as a treatment for Duchenne. What we've accomplished, thus far, with gene therapy for Duchenne is just the beginning. We are leveraging our learnings from SRP-9001 and are applying them to the candidates in our deep genetic medicine pipeline. Nearly the entirety of my professional career has been dedicated to genetic therapy research.\n\nMy team and I have never been singularly focused on bringing just one drug to market. Instead, finding a way to shift the paradigm and create a platform that shortens the development time while producing multiple targeted therapies. In parallel and aligned to our strategy of bringing forth the best therapies to treat the widest array of patients with genetic diseases, we are pleased to announce the advancement of our MyoAAV platform with the Broad Institute of MIT and Harvard. MyoAAV is a new group of adeno-associated viruses that uses a modified capsid or outer protein shell of AAV to deliver genetic therapies with greater efficiency and at lower doses.\n\nThe platform has the potential to offer another breakthrough in genetic medicine delivery, with early research showing significantly greater gene expression at lower doses compared to natural serotype capsids. Now moving to our PMO therapies. I want to highlight Sarepta's impressive presence at the 2022 World Muscle Society conference that took place in October. In total, we had 14 posters and presentations, several containing new data from across our genetic medicine portfolio.\n\nI'd like to focus for a moment on a key late-breaking real-world evidence presentation on eteplirsen in treated patients with Duchenne amenable to EXONDYS 51 skipping. This new analysis showed that treatment with eteplirsen resulted in statistically significant survival benefits compared to a controlled natural history comparator group of Duchenne patients. The analysis found that patients treated with eteplirsen were an N of 579 patients survived 5.4 years longer when compared to untreated reproduced patient-level data for Duchenne natural history study, which had an N of 1,224 patients. Additionally, longer exposure to eteplirsen was associated with increased survival benefit.\n\nPatients treated with eteplirsen for less than two years has survival consistent with the natural history arm with a hazard ratio of 0.89 and a p-value of 0.64. Patients on therapy for two to four years increased benefit with a hazard ratio of 0.36 and a p-value of 0.005. And patients on therapy for four-plus years had the greatest benefit with a hazard ratio of 0.11 and a p-value of less than 0.001. The findings were generally robust to sensitivity analysis conducted across cohorts, including natural history controls.\n\nThe 5.4-year survival benefit was observed in the most conservative of the analytical models. Other findings from the analysis included eteplirsen patients appear to have a 66% higher survival compared with Duchenne natural history controls, where P is less than 0.0001. Also eteplirsen patients experienced prolonged survival and had significantly longer survival from baseline compared with Duchenne natural history controls, where P is equal to 0.0011. This finding was consistent in the subgroup with patients aged 10 to 28 years at baseline, for whom deaths are most likely to be observed where P is equal to 0.0001.\n\nAnd finally, predicted mortality rates were lower for eteplirsen-treated patients, compared to Duchenne natural history control for all patients between the ages of 10 to 30 years. These new data on survival adds to the totality of evidence we have for eteplirsen, which also includes a 2.7-year delay in the time to loss of ambulation, a significant milestone for patients with Duchenne and a slower rate of decline in lung function, leading to a difference of 5.7 years free of ventilation. As Doug noted, full details of the posters are available on the investor page of our website. Now turning to gene therapy and beginning with SRP-9001.\n\nAs I mentioned at the outset of my remarks, we are thrilled to have completed the enrollment in dosing for the Phase 3 EMBARK study and so submitted our BLA to FDA. I'd like to take a moment to acknowledge the tremendous effort undertaken by our team. Many activities are done in parallel, so we can move quickly, but we were able to accomplish so much critical work in a short period of time because of the team's deep commitment to execution. Our BLA was submitted for accelerated approval based on the expression of SRP-9001 dystrophin protein, a shortened functional version of dystrophin as a surrogate endpoint reasonably likely to predict clinical benefit.\n\nAmong other things, it is supported by positive preclinical biomarker and clinical functional results. In clinical trials, SRP-9001 demonstrated positive results at multiple time points, including one, two, four years after treatment in addition to a consistent safety profile. The BLA for SRP-9001 includes efficacy and safety data from Studies 101, 102, 103 or ENDEAVOR, as well as an integrated analysis across these three studies comparing functional results to propensity-score-matched external control. Importantly, the functional data reinforced the consistency of NSAA improvement across these three independent trials and show mean improvements across key secondary functional endpoints such as time to rise and 10-meter walk/run.\n\nQuantification of the SRP-9001 protein expression is measured by Western blot and supported by immunofluorescence. The expression data from across our clinical studies demonstrate consistency from both our clinical and commercial manufacturing process. In particular, the clinical results from ENDEAVOR are positive as they show that SRP-9001 intended commercial process material improves motor function and further confirms our confidence in the treatment effect of our therapy, increasing the probability of success for our Phase 3 EMBARK. Additionally, these studies serve to increase our level of conviction for EMBARK because both ENDEAVOR and EMBARK are being conducted using the same material.\n\nImportantly, across Studies 101, 102, 103, an integrated analysis, the safety profile of SRP-9001 remains consistent and manageable with no evidence of clinically relevant complement activation. As I've mentioned, we completed studies of EMBARK and are encouraged because at over one month Part 1 dosing completion, the safety profile remains consistent with our previous experience. I wanted to note that as we prepare to enter a review period with the agency, we do not anticipate publicly sharing additional data cuts leading up to our 2023 regulatory milestones and the EMBARK data readout. We are committed to reaching as many individuals within with Duchenne as possible, which is why, as Doug mentioned, we have commenced a new cohort as part of the ENDEAVOR study designed to narrow the on early exon mutations that are currently excluded in EMBARK.\n\nWe are also working to finalize the protocol for ENVISION, a placebo-controlled study evaluating SRP-9001 in nonambulatory patients. Additionally, we're in the process of starting an extension study for gene therapy studies, enabling us to follow patients out for a minimum of five years. Our commitment to our limb-girdle muscular trophy programs has not wavered and continues to be a key priority for Sarepta. We are pleased that our natural history study journey continues to enroll and represents a key component of our LGMD development pathway.\n\nWe will soon be conducting an additional study for SRP-9003, using clinical material for LGMD2E to expand our full experience in more ambulatory and nonambulatory patients. It is also our goal to start a study with commercial process material for SRP-9003 in 2023. And finally, in addition, soon we plan to commence a systemic pilot study for our SRP-6004 dual vector rh74 mediated gene therapy to treat LGMD2B, which is characterized by the absence of the protein dysferlin. The progress in the third quarter exemplifies our commitment to advancing the best science in the interest of individuals living with rare disease.\n\nWe are enormously grateful to the patients who are -- who participate in our clinical trials and their families who support them, along with the clinical investigators and experts who have guided us to where we stand today. Again, thank you again to our extraordinary teams, scientists and professionals who are tirelessly dedicated to our mission to bring forward [Inaudible]. I'll turn the call over to Dallan to update our internal activities. Dallan?\n\nDallan Murray -- Senior Vice President, Chief Commercial Officer\n\nThank you, Louise. The third quarter of 2022 represented another quarter of execution for Sarepta's RNA-based PMO franchise. Net product revenue totaled $207.8 million in the third quarter, with roughly $122 million for EXONDYS 51, $55 million for AMONDYS 45 and $31 million for VYONDYS 53. As you'll recall from the second quarter, and as Doug mentioned up front, we guided a $5 million pull forward due to ordering patterns resulting from the timing of the July 4th holiday in Q2.\n\nThe results for the third quarter including the pull-forward played out exactly as we had expected and guided. The pull-forward had a disproportionate impact on the AMONDYS 45 net revenue in the third quarter. We see the third quarter as an anomaly for AMONDYS 45 and expect the quarter-over-quarter growth rate to modestly rebound in this fourth quarter. Overall, AMONDYS 45 is very much on track with our expectations, and we continue to rapidly identify and gain access for the Duchenne population amenable to exon 45 skipping.\n\nIt's also important to note that the EXONDYS 51 net revenue has been positively impacted by our ex U.S. sales growth in 2022. Ex U.S. revenue continued to grow year over year, and the vast majority of these ex U.S.\n\nrevenues are currently coming from EXONDYS 51. This is becoming an important contributor to net product revenue growth while at the same time, introduces some quarter-to-quarter fluctuations as the ordering patterns are different than what we see in the U.S. As it relates to the third quarter revenue, while EXONDYS 51 U.S. revenue grew modestly, the overall revenue for the quarter was impacted by the lumpiness in ex U.S.\n\norbiting patterns. Taken as a whole, the $207.8 million in total net product revenues for the third quarter represents nearly 25% growth over the third quarter of 2021. We remain on track to achieve our full year net product revenue guidance of between $825 million to $840 million. Moving on now to the performance of each of our three RNA-based PMO therapies during the quarter.\n\nFor EXONDYS 51, we delivered $122 million in net revenue in Q3. To note, the third quarter net revenue for EXONDYS 51 represents nearly 6% growth from the third quarter of last year. For AMONDYS 45, particularly in light of the effect of the pull-forward, we are very pleased with the nearly $55 million in net revenue, representing nearly $166 million compared to third quarter of 2021. VYONDYS 53 grew more than 24% over the third quarter of 2021, with net revenue of $31 million.\n\nWe have continued our market leadership position in the exon 53 amenable population, and our team is continuing their efforts to get new patients on therapy and maintain existing patients. As we mentioned on the second quarter call, we don't expect any substantial changes for VYONDYS in the coming quarters. In addition to another strong quarter of execution and revenue generation, we've accelerated our efforts to be launch-ready for SRP-9001 by mid-2023. As leaders in Duchenne, we feel the urgency of the patient community and will ensure that our deeply experienced team will be ready on Day 1 of SRP-9001 approval, just as we were for each of our three PMO launches.\n\nIn the third quarter, as our R&D colleagues were executing on a BLA submission ahead of schedule, the customer organization ramp up for the SRP-9001 launch hit full stride. Currently, we are building out all of our field and head office teams who will lead what we believe will be the most successful gene therapy launch to date. Further, we have started engaging with key sites so that we and they are ready to support patients at approval. The magnitude of this opportunity is not lost on us.\n\nWe are the Duchenne market leader with three of the four approved RNA therapies. To be poised to launch the first Duchenne gene therapy with the data that our R&D colleagues have generated is absolutely incredible. We are ready to take the torch, build on the efforts of our R&D colleagues and deliver this important therapy to the Duchenne community. On a personal note, I want to share that I recently celebrated nine years with Sarepta.\n\nDuring this time, it has been a privilege to witness the unwavering dedication to our mission and commitment to serving patients. I'm proud of our key strong performance and execution since launching our first PMO six years ago. The extensive experience we've gained has prepared us well, and I feel that no one is in a better place than we are to take on the launch of SRP-9001. And with that, I'll turn the call over to Ian Estepan for an update on our financials.\n\nIan?\n\nIan Estepan -- Chief Financial Officer\n\nThanks, Dallan, and good afternoon, all. This afternoon's financial results press release provided details for the third quarter of 2022 on a non-GAAP basis, as well as a GAAP basis. Please refer to our press release available on our website for a full reconciliation of GAAP to non-GAAP financial results. For the three months ended September 30, 2022, the company recorded total revenues of $230.3 million, which consists of net product revenues and collaboration revenues, compared to revenues of $189.4 million for the same period of 2021, an increase of $40.9 million.\n\nNet product revenue for the third quarter of 2022 from our PMO exon skipping franchise was $207.8 million, compared to $166.9 million for the same period of 2021. For the third quarter of 2022, individual net product sales were $122.3 million for EXONDYS, $54.9 million for AMONDYS 45 and $30.6 million for VYONDYS 53. The increase in net product revenue primarily reflects increasing demand for our product in the U.S. and around the world.\n\nIn each of the quarters ended September 30, 2022 and 2021, we recognized $22.5 million of collaboration revenue, which relates to our collaboration arrangement with Roche. The reimbursable co-development costs under the Roche agreement totaled $22 million for the third quarter of 2022, compared to $29.4 million for the same period of 2021. On a GAAP basis, we reported a net loss of $257.7 million or $2.94 and $48.1 million or $0.60 per basic and diluted share for the third quarter of 2022 and 2021, respectively. We reported a non-GAAP net loss of $70 million or $0.80 per basic and diluted share in the third quarter of 2022, compared to a non-GAAP net income of $2.4 million or $0.03 per basic and diluted share in the third quarter of 2021.\n\nIn the third quarter of 2022, we recorded approximately $40 million in cost of sales, compared to $23.4 million in the same period of 2021. The increase in cost of sales is primarily due to increasing demand for our products and an increase in write-offs of certain batches of our products not meeting the quality specifications for the three months ended September 30, 2022, as compared to three months ended September 30, 2021, partially offset by a decrease in royalty payments during the three months ended September 30 due to changes in the BioMarin royalty terms. On a GAAP basis, we recorded approximately $216.7 million and $139.1 million in R&D expenses for the third quarter of 2022 and 2021, respectively, a year-over-year increase of $77.6 million. The increase is primarily due to increases in manufacturing expenses due to the continuing ramp-up of our SRP-9001 manufacturing.\n\nOn a non-GAAP basis, R&D expenses were $193.7 million for the third quarter of 2022, compared to $119.6 million for the same period of 2021, an increase of $74.1 million. Now turning to SG&A. On a GAAP basis, we recorded approximately $104.8 million and $61.1 million of expenses for the third quarter of 2022 and 2021, respectively, an increase of $43.7 million. The increase was driven primarily by an increase in stock-based compensation expense, primarily due to an additional expense recognized through the CEO grant modification agreement executed in the three months ended June 30, 2022, which is recognized over the service period.\n\nOn a non-GAAP basis, the SG&A expenses were $66.8 million for the third quarter of 2022, compared to $43.6 million for the same period of 2021, an increase of $23.2 million. On a GAAP basis, we recorded $6.3 million in other expenses net for the third quarter of 2022, compared to $20.6 million in other expenses net for the same period of 2021. The decrease is primarily due to an increase in interest income to the investment mix of our investment portfolio, as well as a reduction of interest expense incurred as a result of the repayment of our December 2019 term loan for the three months ended September 30, 2022. In the third quarter, we had proceeds of $1.1 billion from issuing convertible senior notes due in 2027.\n\nAdditionally, we repurchased a portion of our outstanding 2024 convertible notes and prepaid in full the amount of our outstanding related to the 2019 term loan. The repurchase and prepayment of the existing debt resulted in a loss on debt extinguishment of $125.4 million. Assuming an approval of 9001, we anticipate that along with our current cash and our projected revenue, that this offering will be sufficient to fund our operations to profitability. We had approximately $2.1 billion in cash, cash equivalents and investments as of September 30, 2022, and therefore, we are well capitalized to support the launch of SRP-9001, if approved.\n\nAnd now, I'll turn the call back over to Doug to start the Q&A. Doug?\n\nDoug Ingram -- Chief Executive Officer\n\nThank you, Ian, for that. Kathy, let's open the call for questions and answers.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Gena Wang of Barclays. Your line is open.\n\nGena Wang -- Barclays -- Analyst\n\nThank you for taking my question. I have one question regarding the SRP-9001. Doug, you mentioned that you expect PDUFA day likely in May 2023. Any concern that the review could be standard review? And do you think that if it's possible the FDA would like to see three-year Study 102 data that will mature in January 2023?\n\nDoug Ingram -- Chief Executive Officer\n\nSo we have -- in connection with our submission of our BLA, of course, we have requested a priority review. We are planning for that, and that's why we have mentioned the May deadline for the PDUFA date, at least that's our current expectation. So that is what we're planning for. That's what we assume.\n\nAnd we haven't received any information for the agency or any commentary from the division that would lead us to believe anything differently right now.\n\nOperator\n\nOur next question comes from the line of Tazeen Ahmad of BofA. Your line is now open.\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good afternoon, guys. Thanks for taking my question. Doug, I just wanted to get some detail from you on where you are with your manufacturing commitments.\n\nWhat do you need to show FDA? And if you do get a priority review, will this allow enough time for you to complete whatever commitments you have agreed upon before the launch would proceed? Thanks.\n\nDoug Ingram -- Chief Executive Officer\n\nThank you very much, Tazeen. So obviously, we'll have all of this dialogue with the division during the review itself, but we're in great shape. You will recall that summer before last in connection with the commencement of our EMBARK study, the placebo-controlled trial that we fully dosed. Now we were required to and then got basically the bulk of our CMC completed and our assay work done as well.\n\nSo I think we're in very good shape right now to respond to any of the agency's questions, the BLA submission that we made is very detailed and has an enormous amount of CMC. So I think we're in very, very good shape right now.\n\nOperator\n\nOur next question comes from the line of Gil Blum of Needham & Company. Your line is now open.\n\nGil Blum -- Needham and Company -- Analyst\n\nHi, everyone, and thanks for taking our question. So Doug, maybe this is just helpful for us. Can you put in context a six-month difference for a DMD patient? Thank you.\n\nDoug Ingram -- Chief Executive Officer\n\nSix -- every day is -- first of all, just so we're clear because I think probably underlying your question was that it's sort of an assumption that the delta between a non-accelerated approval submission and approval versus a traditional versus accelerating would be about six months. It would be much longer than that because let's just remember, if we were not seeking accelerated approval, if that pathway didn't exist as it has existed formally since the '90s, we would have to wait for the end of EMBARK, compile that information, QC all of that. By the time we were all done with that, we might be ready to start working on a BLA. We'd submit that BLA sometime in 2024.\n\nAssuming we get priority review, we'd probably be getting approval in the back half of 2024, not the very end of 2024. So this is a very significant delta in the lives of the patients with Duchenne. But even six months, let's be very clear, is that it's monumental in the life of Duchenne patient. Remember, and I've said this before, and it's not an exaggeration, every day when the sun comes up and then the sun goes down at the end of that day, a Duchenne patient has been damaged, and damaged in ways that neither our therapy or any other therapy currently envisioned would rectify.\n\nThat's not with therapies like this do. What this therapy does is a arrest decline. And that means that they would get damage on a daily basis that will not be reversed. It also means over a six-month time, some -- in the United States, probably 200 or so of those children would have died.\n\nAnd some other significant number of hundreds would be confined to a wheelchair for the rest of their lives. And some other group of them will lose additional milestones that they wouldn't have. And some will be on a ventilator, maybe a few hundred will be on a ventilator in just that six-month period. And then, compound that because it is in six months, it's upwards of 15, 17 months delta and the difference between an accelerated approval and a traditional approval is enormously valuable.\n\nAnd it's not valuable to a 200 or 400 or 600 , it's valuable to the 10,000 to 15,000 because every one of those children is going to be damaged every single day that we wait. And unfortunately, with respect to science, sometimes science takes a long time and that damage is inevitable. But when it isn't inevitable, when there is a pathway that provides an opportunity to bring a therapy founded on really good science for patients, we should be doing that. And we should certainly be fighting for that and seeking an accelerated approval.\n\nHere, as I mentioned in my script, again, this is sort of -- I would argue, and I realize that, that is an argumentation that this is purpose-built, accelerated approval for something like Duchenne. It's a devastating, life-ending neurodegenerative disease. It is not well served right now. There are only about 29% of the Duchenne population that have any real therapy available to them.\n\nAnd we have a surrogate endpoint that isn't some downstream correlative endpoint, but actually directly relates to the proximate cause of this monogenic disease, and we know why these children are dying. We've known it since 1986 when the Duchenne -- the dystrophin gene and eventually its protein were discovered. They're dying because they're missing the shock absorber in their muscles that protects their muscles. And then, the final thing I will say on why it's so compelling from our perspective at least, to be seeking accelerated approval now is that we can confirm these results relatively rapidly.\n\nEMBARK, our placebo-controlled trial, as you know, as we sit here today, is fully enrolled.It's fully dosed. And so, there isn't some argument about when the confirmatory trial will be complete. It will be complete basically on a day search. And so, I would argue with the availability of something like accelerated pathway, a pathway, let's be clear, that it saves innumerable lives.\n\nHIV and AIDS patients who at one time in history, who had a death sentence when they had a diagnosis, can now live with a chronic disease. Cancers and the innovation associated with that and Duchenne muscular dystrophy. So from our perspective, it is very compelling that we seek accelerated approval now, certainly given the wealth of data that we have to support it. We had an enormous amount of data that justified the use of the truncated functional dystrophin associated with our PMOs, EXONDYS, VYONDYS and AMONDYS.\n\nAnd as that benefit has emerged over time and really matured, we can see what benefit that brings to patients. Well, the evidence we have, the numbers of patients and the experience and the functional results we have for SRP-9001 is perhaps an order of magnitude even greater still than that. So it would be -- as I said in my script, and I really mean it, I think it would border on unethical if we hadn't sought accelerated approval. Certainly, after we had very detailed, evidence-rich discussions with the FDA.\n\nBut thank you very much for that question.\n\nOperator\n\nOne moment, please. Our next question comes from the line of Colin Bristow of UBS. Your line is now open.\n\nColin Bristow -- UBS -- Analyst\n\nAfternoon. And thanks for taking the questions. just a couple from my side. First on the case of myocarditis, you had, I think it was in Cohort 2103, just any update here, any further insights around the cause? And then, second, on Pfizer's recent protocol change to screen out the patients with deletion in the regions of exon 52 to 71.\n\nI believe this spans the region that 9001 contains near the C-terminal region. Sort of any index or concern on your side around sort of potential immunogenicity issues for patients lacking native proteins in that region? Thanks.\n\nDoug Ingram -- Chief Executive Officer\n\nNo to the latter question, but I'm going to throw both of those questions over -- Dr. Rodino-Klapac can provide additional color.\n\nLouise Rodino-Klapac -- Chief Scientific Officer and Executive Vice President\n\nThank you for that question. Obviously, we are continuing to follow our patients. So as you recall, the patients in Cohort 2 with myocarditis had sustained cardiac function, normal cardiac function trend baseline. There was a troponin increase.\n\nAlso, as you know, in Duchenne, these increases can occur in natural history as well. And so, the patient continues to do well and continue to follow. But no other updates other than that. In terms of the genetic exclusions, as we've mentioned, we've excluded one to 17 in EMBARK, but we're conducting our Cohort 5 study to narrow that down.\n\nWe have not had any concerns with the C-terminus for our program.\n\nOperator\n\nOur next question will come from the line of Salveen Richter from Goldman Sachs. Your line is now open.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nThanks for taking the question, and congratulations on the progress. This is Tommy on for Salveen. And we're wondering if you've discussed the scenario where you get accelerated approval for 9001, but EMBARK is not stat sig on MSAA potentially due to variability or other factors? And can you comment on what could be like the likelihood of -- that you would get an Adcom? Thanks.\n\nDoug Ingram -- Chief Executive Officer\n\nSure. So let me start with the first one. First, before I comment on that hypothetical, let me be very clear, we're very confident on EMBARK. We are very well powered.\n\nWe are powered well into the 90s. It is very well informed. That entire study in its design is very well informed. Now in dealing with the issue directly and I think the question underlying all of that is essentially what -- do you -- would you commit to removing the therapy from the market if EMBARK didn't hit that -- see, that's not the actual standard.\n\nThe actual standard is to look at the entire totality of the evidence and if the totality of the evidence didn't justify the continued availability of the therapy, then would you commit to removing? And the answer to that is, of course, yeah. That is the standard for accelerated approval. And we would certainly do that, notwithstanding the fact that we're very confident. And we're confident based not just on the power of that study, but on all of the data that we already have on the therapy.\n\nAnd I apologize -- perhaps someone can remind me of the second question?\n\nIan Estepan -- Chief Financial Officer\n\nAdcom.\n\nDoug Ingram -- Chief Executive Officer\n\nApologies. Yeah, I knew there was -- the short answer is that we haven't heard yet from the agency whether or not we're going to get an Adcom. We will know that probably shortly after the agency accepts our BLA, which should occur in late November. But given that this is the first in its class, we're certainly planning for and assuming that we would get an Adcom and that would occur in the spring of 2023.\n\nApologies for that.\n\nOperator\n\nOur next question comes from Matthew with Morgan Stanley. Your line is now open.\n\nMatthew Harrison -- Morgan Stanley -- Analyst\n\nGreat, Good afternoon. Thanks for taking the question. I just wanted to ask about some of the real-world data that you presented and some of your thoughts just around the time point for the primary endpoint in EMBARK. I think, one of the things a lot of investors are concerned about is potential variability from patients.\n\nI wonder if you've considered looking at a longer time point in that study and just your confidence that one year is the right time for the primary endpoint in that study? Thanks.\n\nDoug Ingram -- Chief Executive Officer\n\nYeah. Thank you. The real-world evidence for EMBARK, first of all -- I mean, for EXONDYS, this is very exciting for us, and we've had the opportunity to really follow those kids over a number of years to see it emerge. Now remember, of course, that the PMOs and [Inaudible] ones are very different, right? The PMOs make -- they reliably make quantifiable amount of dystrophin, and it does it very consistently across all of our therapies and across all of our studies, but it's making a much smaller amount of truncated functional dystrophin than the 9001 makes.\n\nSo the impact on the life of the child is different over a different time frame. And just so we're clear because I think there have been misunderstandings. 9001, again, makes a truncated functional version of full-length dystrophin, as does Becker dystrophins or Becker type of Duchenne, as well as the PMOs. And they're all kind of reasonable approximations of the same thing.\n\nAnd then, as we look to the 9001 study, I would say, again, that we've taken into account the variability and the heterogeneity of the patient population in the design of the study, we've been very rigorous and well informed about it. As everyone knows, we have, in addition to a wealth of natural history data and our own experience, and I don't think anyone at least from an organizational perspective, has the kind of experience we have. We have the 101 data, the 102 data, Part 1 data, Part 2 data, 103, multiple cohorts. So we're well informed in the design of that study, and I think relatively conservative in the assumptions that we make around the powering of that study.\n\nAnd based on all of that, including the amount of variability that we're assuming and the standard deviation we're assuming, we feel very confident in the powering of that study, which, as I've said, is well over 90%, even conservatively assumed. So we feel very good about where we are, and we feel very good about 52-week time frame. Now I will also say that 52 weeks in the life of a Duchenne patient is a short period of time. But that's what makes 9001 so exciting, that you can actually already see the fairly significant delta in the trajectory of disease when you look at a trial that's been on 9001 for 52 weeks versus natural history.\n\nAnd if you keep reading that out, you see it expanding. You've seen it expanding in two years. You see at the four-year mark with the 101 kids truly transformative as you would expect, from something that deals with the root cause of the disease and change the trajectory of the disease in a disease-modifying way, where you're literally over 9 points on a 34-point scale when you get out to four years. So two things on it.\n\nOne, we're very comfortable with the powering of EMBARK, and we are very confident and have a lot of conviction around those results. It is one of the largest studies of its kind that exists right now. And we're very excited about the -- what this means to Duchenne kids, we have one year, but it's two years, three years, four years, five years, 10 years. And I think far beyond that, hopefully, if we get approved.\n\nOperator\n\nOur next question is from the line of Joe Schwartz of SVB Securities. Your line is now open.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nHi. This is Beth on for Joe. For SRP-9001 BLA filing for ambulatory patients, we were just wondering if you have a sense from the FDA if your current data package is sufficient to support use in ambulatory patients broadly regardless of age? Just in our doc checks, desire to initiate gene therapies sooner than later. I also was curious if you maybe consider doing a study in DMD patients younger than four to support use there, kind of similar to what Pfizer is doing with their two- to three-year-old study? Thank you.\n\nDoug Ingram -- Chief Executive Officer\n\nSo we do feel good and confident about the approach we're taking -- seeking approval for the ambulatory patient population and remind us that the regulatory standard, as well as the legal standard for extrapolating to greater parts of the population, is well understood, when you have a presumed mechanism of action that would be applicable to a broader population. You have the ability to study in a narrow population to see the effect, as we were discussing a moment ago, to deal with the heterogeneity that it comes from a larger population, then expand it to broader populations. So that's why we've chosen the ambulatory population. We want to get started as soon as possible on a placebo-controlled trial for the nonambulatory population.\n\nWe are actually ongoing dosing nonambulatory kids today, but in our 103 protocol, we want to expand it to the nonambulatory patient population as soon as possible because those kids need this therapy rapidly. And then, to your point, we are -- I think we are in the planning phases for our study to go significantly lower, but I'll turn that to Louise Rodino-Klapac can you talk about going even lower than the four-year old population in EMBARK.\n\nLouise Rodino-Klapac -- Chief Scientific Officer and Executive Vice President\n\nThanks for that, [Inaudible]. To say that recently done study with Cohort 103 study, and we plan the study to go even younger than three years old as well. So certainly, we are in a therapy that broadly addresses this population.\n\nOperator\n\nOur next question comes from the line of Brian Abrahams of RBC. Your line is now open.\n\nBrian Abrahams -- RBC Capital Markets -- Analyst\n\nThank you so much for taking my question. Maybe shifting gears to limb-girdle. What's the latest on the CMC assays and process development there? And then, perhaps I misheard it, but it sounds like there's going to be, I guess, a plan for two studies now with clinical materials and then material in it, subsequently, with commercial scale material. Just any sense of conduct time lines and maybe how these two studies might combine to support a potential pivotal path? Thanks.\n\nDoug Ingram -- Chief Executive Officer\n\nYeah. I'll turn it to Louise, who can provide additional color. But I'll say in the broadest of strokes, we're still working on the assays for the commercial process release assays for 9003. To remind everyone that to start a study that could form the basis of an approval, the current standard of the agency is to have those assays essentially done and ready for commercial use, clinical use isn't sufficient.\n\nSo we're working on that. It does take time, and we're continuing that. But our goal is to have all of that done and to commence that study in 2023. As you point out, we have two different studies.\n\nThey're not -- the intention was not to have them done sort of serially but they can be done concurrently. These are really in a very real sense, unrelated studies, both of which should occur in 2023. And then, the question is, why are you doing two studies? Why not just do your study with your commercial process material when the assays are complete? And the answer for that is that we have clinical material available to us that is very usable and we think would significantly benefit patients and would give us some really additional interesting insight in other parts of the population than the studied population for purposes of our -- what would be our pivotal trial next year with commercial process. And so, from our perspective, it only makes sense that we use that material and do a study and gain additional insight while at the same time, from our perspective, at least benefiting patients.\n\nLouise?\n\nLouise Rodino-Klapac -- Chief Scientific Officer and Executive Vice President\n\n[inaudible] will add about the [inaudible] kind of material adding patients [inaudible] besides those nonambulatory patients. And so, it will give us significant insight into the entire population. And as Doug mentioned, is not a pretty [inaudible] for the internal commercial process material [inaudible] cohort. And so, we're making sure that we're capturing the whole population with these [inaudible].\n\nOperator\n\nOur next question comes from the line of B. Skorney at Baird. Your line is now open.\n\nB. Skorney -- Baird -- Analyst\n\nHey, good afternoon. Thanks for taking my question. I guess, as we think about potential launch, obviously, clinical sites are somewhat prepped for this and patient demand would presumably be pretty high. I guess, what have your conversations been like so far with payers? I know that payers have sort of pushed back recently on Subpart H approvals.\n\nJust trying to think about the curve of the launch. You're, obviously, in negotiations with a ton of payers on Recuplashen have some idea of utilization of Zolgensma. But just do you think that there's going to be hurdles put up until you get the EMBARK data out? Or do you think that payers will be relatively flexible at initial subpart H approval?\n\nDoug Ingram -- Chief Executive Officer\n\nSo I guess, I'd say, a couple of things. And Dallan, if I miss anything let me know. First, I'll say what Dallan is probably too humble to say, which is the good news is there will be lots of hurdles to overcome. But we're battle-hardened in the ability to work with payers and overcome obstacles and get kids on therapy.\n\nI would remind everybody that we've been -- we have three approved therapies from EXONDYS, we've been growing at what is between 35% and 40% CAGR now for nearly six years. Our compliance and adherence rates well over 90%. Our ability to get these kids on therapy -- and with respect to a chronic therapy, keep them on therapy, has been just tremendous. We've been able to go to the prior process, and the reauthorization process wouldn't be relevant for gene therapy, that makes the point.\n\nWe definitely know what we're doing. The good news is that we are working significantly with payers, even as we speak. We've been doing it for a number of years to make sure we really understand their perspective and what they want. Because to your very good point, I think that if you think about the things that can constrain demand or open up demand, let's go first from the patient perspective, it will be enormous.\n\nWe are not at all concerned, patients are desperate to get a therapy like this from our perspective. I think, physicians will be equally in the same place. The third thing is capacity-related issues at the sites, are they well prepared to infuse as it relates to that? Our goal ultimately is to have 70 expert sites available to infuse. And in fact, about 80% of patients are served by about 50 sites.\n\nSo we should be in very good shape. And the vast majority of these sites already have significant experience with gene therapy. We are befitting from the launch of Zolgensma. And then, the fourth one is payers, and I think we're working very well and very thoughtfully with payers, very proactively with payers and we're thinking of some very innovative approaches.\n\nAnd our goal is simply to get -- let's be clear. I've said earlier, I know I get a little strident about this, but I feel strongly about it. These kids don't have the luxury of waiting. They need therapy and they need it now.\n\nAnd waiting three or four months for therapy is inappropriate. So we're working with payers on that exact issue, which is we don't just want access, we want access in a timely manner. And I think well-informed payers are going to be -- I'm not suggesting there won't be challenges, but payers are going to be supportive. And certainly, when you look at our value proposition for our therapy, and we've done a lot of work on the value of -- the objective value of this therapy, I think, is going to be very compelling.\n\nNow from an uptake perspective, let me be very clear, it takes some time to get through the process. So assuming we get approved on the time line we envision, it will take a couple of quarters to get through the process and start getting kids infused and the like. But then, I think the uptake is going to be very robust if we've done our job well, and I do think Dallan and team have the ability to do this very well, probably second to none. Dallan, have I forgotten something that I should have commented on?\n\nDallan Murray -- Senior Vice President, Chief Commercial Officer\n\nNo, I think you've covered it, Doug. I think, there's a couple of things that the payers -- we've had constructive dialogue with the payers, and there is a real high level of receptivity to gene therapy, number one. Secondly, in the last six years, thanks to the Duchenne community and particularly our KOLs, neuromuscular KOLs, I think the payer community has learned a lot about Duchenne. And there's a -- that we're in a different place now than we were in the launch of -- in 2016 of EXONDYS 51.\n\nAnd then, I think the last and very important thing I would say here is that thank you to Louise and our R&D colleagues. The data that we're going to be launching with the publications that we'll have to support the value and the work of our health outcomes folks as well, this value framework that Doug was talking about. We've learned a lot as well in Duchenne, and this will be a very different -- we're well prepared to engage in constructive dialogue here.\n\nOperator\n\nOur next question comes from the line of Tim Lugo of William Blair. Your line is now open.\n\nTim Lugo -- William Blair -- Analyst\n\nThank you so much, and congratulations on the progress. I know we're laser focused on the AA and even EMBARK data next year. However, we haven't heard much about Europe in a while. Can you just give us an update on your relationship with Roche and the time frame for O-N making impact in Europe and beyond.\n\nI assume that's going to be EMBARK dependent no matter what occurs with the AA?\n\nDoug Ingram -- Chief Executive Officer\n\nYeah, thank you for that. So first, we have a great working relationship with Roche. I think, you can -- I think you'll see it revealed in their public statements. I think, Roche is -- seems to be about as bullish as we are about this therapy publicly, and that certainly is reflective of the very positive working relationship we have with our colleagues at Roche, and we've got a very good collaborative approach across all aspects of the development program, commercial planning, regulatory and the like.\n\nYeah, I've been on Europe and beyond Europe to other parts of the world outside the United States. I will leave it to my colleagues at Roche to inform the external world on the timing of things other than to know what you've noted, Tim, which is that I think that Roche's public statements have been that they will rely upon the EMBARK readout as the pathway for their approvals and then the HTA discussions that they'll have in Europe and around the world. So I think that -- unless we hear something different from Roche, I think that's their public statement, and that's what we should rely upon.\n\nOperator\n\nOur next question which comes from Anupam Rama of J.P. Morgan. Your line is now open.\n\nAnupam Rama -- J.P. Morgan -- Analyst\n\nHey, guys, thank you so much for taking the question. I wanted to follow up on Tazeen's question earlier. And I think you've kind of highlighted this a little bit, but on the manufacturing side, what are the 9001 supply scenarios that you're planning for, looking to next year pending approval? And are there any sort of constraints or hurdles we should be considering when it comes to supply access as we think about this launch curve?\n\nDoug Ingram -- Chief Executive Officer\n\nYeah. Thank you. So I think, with Tazeen I was answering a slightly different question, which was -- to your point which was, are we in a good shape from a CMC perspective? Do we have the assays done and the -- and the data that is supported? And the answer to that is yes. We've done a ton of work.\n\nAnd in fact, we did a ton of work before EMBARK, so we were in very good shape. And then, I think, your question is a very good one, which is how about capacity? Are you in good shape from a capacity perspective to fully launch? And the answer is yes, we're going to be in very good shape. We are planning to launch for the ambulatory patient population. That is our current working assumption, broadly speaking, and our goal is to fully serve that community without delay.\n\nAnd even assuming a fairly aggressive uptake and even assuming, which I think is, at this point, a very fair assumption that we would be launching this O-L.\n\nOperator\n\nOur next question comes from Hartaj Singh of Oppenheimer. Your line is now open.\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you, and thanks for all the updates. Just had a quick question. The MyoAAV program.\n\nI know, Louise, you and your colleagues when you were at Nationwide, you had been working on rh74 for over a decade, and it seems you have a best-in-class AAV vector there. What really attracted you to MyoAAV? And I guess, is it significantly better than rh74? And lastly, how do you see it kind of getting into the clinic in DMD, LGMD?\n\nDoug Ingram -- Chief Executive Officer\n\nSure. Thanks for that question. I'll turn this to Louise to comment.\n\nLouise Rodino-Klapac -- Chief Scientific Officer and Executive Vice President\n\nYeah. Thank you for that question. So certainly, we're -- we love rh74 [inaudible]. In terms of our bullishness about it, MyoAAV is very exciting.\n\nIt's in the research phase. And what we've seen is higher [inaudible]. We are excited about it [inaudible] once we continue to validate on a clinical path for that as well.\n\nDoug Ingram -- Chief Executive Officer\n\nI apologize, Hartaj -- I'm sorry, Louise. I think, Louise is cutting out a little bit. I'll just repeat less artfully what I think Louise was saying, which was -- look, first I will repeat what Louise said, firmly, we love rh74. We are excited.\n\nThat is really the platform right now for our gene therapy focused on neuromuscular and neuro and frankly, cardiomyopathies as well. And there is no -- from our perspective, at least, there is no better current serotype from a safety perspective, coupled with a tropism perspective than rh74. So this isn't about any negativity on rh74. We are thrilled with it.\n\nObviously, there is an enormous amount of future value to patients and to the breadth of patients if one can find ways to decrease dose, which would make therapies more affordable around the world, etc., and probably increase safety and the like. We have a long way to go. We haven't dosed any patients or even healthy human volunteers with MyoAAV, but at a preclinical and animal model perspective, we're seeing some things that really excite us about the potential at least for MyoAAV. Could it be literally an order of magnitude more tropic than any of the current serotypes, which would really be extraordinarily meaningful.\n\nIt would be meaningful around the world in places like India and Africa and other places where we're going to have to find a different kind of cost of goods to really have the full breadth of the benefits of our therapies, including 9001. And it probably takes us to many other kinds of disease states that would be challenging today. At these cost of goods with gene therapies currently today, there are probably certain kinds of ultra-rare diseases that become very difficult. And that's -- frankly, that's not acceptable.\n\nThat's tragic. If we have the ability to treat even very, very rare diseases, we ought to be thinking about ways to do it. And MyoAAV -- if not MyoAAV, maybe some other capsid, but currently the best thing we've seen and we've seen everything, is MyoAAV. It could really be a transformative next-generation approach to gene therapy.\n\nSo we are in love with rh74, but we are excited about the potential of MyoAAV down the road.\n\nOperator\n\nOne moment for our next questioner. Our next questioner which comes from the line of Anvita Gupta of Cowen. Your line is now open.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nHi, guys. This is Amrita for Ritu from Cowen. I wanted to continue your questioning on the MyoAAV program. So are you guys seeing any transduction of satellite muscle cells to hopefully get a sense of potentially improve durability in DMD patients? Or is that something that you hope to explore?\n\nDoug Ingram -- Chief Executive Officer\n\nWell, certainly, we will explore satellite cells and the like. I don't know if we have yet. And -- if Louise's mic is working.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nAre you seeing that already in preclinical --\n\nLouise Rodino-Klapac -- Chief Scientific Officer and Executive Vice President\n\nWe will explore it. Just to mention, we have also explored our transduction there with Allied. So it's not something we already see, but we'll certainly evaluate it with MyoAAV as well.\n\nOperator\n\nOur next caller, which comes from the line of Yun Zhong of BTIG. Your line is now open.\n\nYun Zhong -- BTIG -- Analyst\n\nHi. good afternoon. Thank you for taking the question. it's actually an old question that has been asked before, but now that you're talking about the launch of gene therapy program with strong confidence, so probably more related.\n\nSo what kind of impact do you expect the launch to have on your exon skipping revenues? And are we going to build that into our launch strategy, please? Thank you.\n\nDoug Ingram -- Chief Executive Officer\n\nYeah. So one of the things we talk about often as an organization is that we are a patient-driven, patient mission-driven organization. So let's start with the first premise. If indeed, we have a therapy that is as beneficial as we believe 9001 is and it has an impact or greatly cannibalizes the current exon skipping platform, and the children as a result of that are benefiting from it, we are thrilled.\n\nSo I just want to be very clear about that from our perspective. We lean into the best technology for kids. We do believe, first of all, though, that there will be a significant place for both gene therapy and our exon skipping therapy, either PMO or next-generation PPMO for a very long time to up. First, I would remind everybody -- and we won't see significant cannibalization in the near term in any event for a number of reasons.\n\nSo the first thing to note is that we are -- over 50% of our current therapies are -- about 50% of our current patient population on our exon skipping is nonambulatory. So they need this therapy while they're waiting for us to get 9001 approved. Second of all, there -- until we do something about it, there are neutralizing antibody related kids, maybe 14% or so, that won't have availability for gene therapy. We are trying to do something about that.\n\nAs I mentioned in the opening remarks, we're going to start a study with our partner, Hansa. And we're very encouraged by the preclinical data that we've seen, and we may very well be able to address that. But until that's addressed, that therapy will continue to benefit those kids. And then, of course, around the world, there'll be lots of places, both in the U.S.\n\nand around the world where there just may be the availability for a PMO or PPMO where a gene therapy is not. So we do think they will coexist for some time. And then, of course, that doesn't even consider the issue of the co-administration of gene therapy and then a PMO or PPMO, which at least in some of the preclinical models and even some literature would suggest is an additive value to add both together. And if that's the case, and we're doing some basic research on that to continue to explore it, then you would have a long-term answer for kids with a onetime therapy and then over the long run, a chronic therapy.\n\nBut I will go back to the statement I made at the beginning. If eventually this 9001 is so significant as we believe it is and that it results in cannibalization of our exon-skipping therapy and kids are benefiting enormously we'll be thrilled with that answer, frankly. And you'll be thrilled, too. Let's be honest.\n\nAs an investor, you'll also be thrilled because this is -- the population that can be addressed with 9001 is enormous right now. It's enormous even with the current restrictions. And then, we're reducing -- we've actually started dosing already, a study to reduce the amount of early exons that would have to be excluded. We are focusing on the neutralizing antibody positive patients, and we're going to start a study on that, that if it works, would bring another 14% of kids in frame for us.\n\nAnd then, of course, the biggest of all is getting to the nonambulatory kids, and we're going to work like mad to get that done and get the label expanded to nonambulatory kids as fast as possible.\n\nOperator\n\nOur next question comes from the line of Kristen Kluska of Cantor Fitzgerald. Your line is now open.\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nHi. This is Rick on for Kristen. Thank you for taking our question. For the real-world EXONDYS 51 data presented at the World Muscle Society, could you talk about how you're specifically thinking about the importance of these data in the high unmet need, nonambulant population? Thanks.\n\nDoug Ingram -- Chief Executive Officer\n\nWell, the beauty of -- look, with respect to dystrophin. So I guess, that's an interesting question. The question is what impact does it have upon ambulatory. First of all, understand -- all this data is equally applicable across all of the population because every kid is on -- there may be a different part of the journey or place in the journey, but they're all suffering from exactly the same issue.\n\nThey are missing functional dystrophin as a result of which they are damaging their muscles every time they move them. And the value of this real-world evidence is it is proved over a very long period of time, that what we saw at the beginning with EXONDYS really reveals itself over time. And -- so I think it's really important in that regard. And it's important for EXONDYS and it's important for VYONDYS, it's important for AMONDYS.\n\nAnd of course, metaphorically and sort of by example, makes the point of the value of accelerated approval, you just imagine what we will see over time with 9001 when we think about the amount of dystrophin that is induced with 9001. And then, finally, let me be very clear, so I want to loop back to something that's important, which is with respect to EXONDYS and VYONDYS and AMONDYS, we have a significant number of post-marketing commitments. We have literally invested already hundreds of millions of dollars in progressing those studies, and two of them are really top-of-mind assent submission. And I do want to be very, very clear to everybody that, notwithstanding what we're very excited about with respect to real-world evidence, it's our obligation and our absolute commitment to continue and ensure that we complete both of those studies as timely as possible.\n\nSo the real-world evidence is -- it's very encouraging. We need to continue to work on our post-market commitments as well.\n\nOperator\n\nOur next question, which comes from the line of Zhiqiang Shu of Berenberg. Your line is now open.\n\nZhiqiang Shu -- Berenberg Capital Markets -- Analyst\n\nGreat. Thank you very much for taking the question. I'd like to ask about the external control that is included in your integrated analysis in the gene therapy package you submitted for accelerated approval. I wonder, have you got any alignment with the FDA on the control -- external control based on natural history? Obviously, we're aware that recently, there was a negative opinion from an oncology product from the -- at Supervisory Committee.\n\nJust wondering if you have got any alignment there. And how important it is to have that data to support your accelerated approval? Thanks very much.\n\nDoug Ingram -- Chief Executive Officer\n\nWell, so first of all, I think the totality of evidence is extraordinarily important. So the design, why it exists the way it exists, the extent to which it's a reasonable approximation of a Becker dystrophin, the preclinical work, all of the related biomarker work. And then, all of the clinical data that we have, including the integrated analysis, we have 101. Those kids are one year, two years, three years, now four years out.\n\nYou got 102 Part 1 and Part 2, those kids are one in two years out. We've got 103, a broad look at kids from a safety perspective. And 103, very broad age ranges, very broad weights and the like. And certainly, the integrated analysis pulling it all together is additionally valuable.\n\nWhat I would say on the FDA is that the FDA has seen all of this data, we've shared all of this information with them. Obviously, all -- but their views on all of that is going to reveal itself in the review process itself. But we feel very good. I'm not sure how one does an external control more rigorously than the way we've done it.\n\nJust to remind people, it's not a simple external control -- we used a well-masked external control, but then we matched on four different covariants, not simply one covariant, which is age, NSAA baseline, I think 10-meter walk/run. I believe, rise time, if I'm not misremembering. And then, we didn't even stop there. We got that very closely matched.\n\nBut to ensure that we had a tight correlation between the -- and is closely a representative, external group control was our actual group as possible. We did this regression analysis and this propensity matching, which is essentially synthetically makes the distribution, not simply the means but the distribution identical across the two. So within the limitations associated with external control, this is about as rigorous as one gets. And then, on top of it, I should note that many of the patients in the external control actually came from placebo-controlled trials, so to the extent that people might wonder about that.\n\nThey actually came from a very similar approach that you'd have to a placebo-controlled trial because they were on a placebo at the time that their information was developed. So we'll have this full review with the agency. I don't think it's any one piece of data. I think, it's all of the data that's going to go into the discussion because remember, with respect to accelerated approval, the fundamental question is, does this surrogate endpoint -- in this case, we're talking about functional shortened dystrophin.\n\nSo is it reasonably likely based on all of this data, reasonably likely to predict the clinical benefit? We are, obviously, the sponsors, so you can imagine what our perspective is, but we believe it's very compelling.\n\nOperator\n\nOur last question, which comes from the line of Gavin Clark-Gartner of Evercore ISI. Your line is now open.\n\nGavin Clark-Gartner -- Evercore ISI -- Analyst\n\nHey, thanks for taking the question. For LGMD, I'm just wondering if you're planning to include a placebo arm for either of those next trials? And what your current thinking on registrational endpoints is?\n\nDoug Ingram -- Chief Executive Officer\n\nLouise, do you want to touch this?\n\nLouise Rodino-Klapac -- Chief Scientific Officer and Executive Vice President\n\nYeah. You saw that we [inaudible] will not include a placebo arm that is [inaudible] older patients who are going to be more severe ambulatory and then nonambulatory. And as we think about the Phase 3 study [inaudible] agreement.\n\nDoug Ingram -- Chief Executive Officer\n\nJust to remind everybody with respect to 9003. So we're -- we've seen in our -- we've done two cohorts with clinical material. You'll see we've gotten a very similar safety profile of 9001, not surprising at rh74, and it's the same promoter. And we've seen very good expression across both of the cohorts.\n\nAnd I would remind you of two additional things when we think about what that study design ought to look like. The first is to remember that not unlike Duchenne muscular dystrophy, 9003 2E, which is -- it's the lack of beta-sarcoglycan, beta-sarcoglycanopathy. It is well characterized in that regard. We know exactly what's causing the demise in the generation of these kids.\n\nIt's a lack of beta-sarcoglycan properly localized to the sarcolemma of their muscle. And 9003 induces an enormous amount other than native protein properly localized and associated in addition with signals on the functional side associated with all of the condition being a functional protein, upregulation of the dystrophin-associated protein complex, reduction in CK and the like. So with all of that in mind, and given the fact that this is an ultra-rare disease, our view is that the registrational trial for this needs to be thoughtful and take that into account and be lean enough to get this trial done rapidly and get this therapy to kids without undue delay or unnecessary delay.\n\nOperator\n\nWith no further questions, I'd now like to turn it back to Doug Ingram for closing remarks.\n\nDoug Ingram -- Chief Executive Officer\n\nAll right. Well, thank you all very much for spending time with us this evening, and thanks, everyone, for your very insightful questions. Obviously, the next seven months are among the most consequential in our history. And we have a fairly long history.\n\nAnd more than that, I believe, at least that are probably among the most consequential for Duchenne patients, perhaps since the discovery of the dystrophin gene back in 1986, if I'm remembering correctly. And so, with that said, we're looking forward to all of the work that we have ahead of us, and we're looking forward to updating you as we pass through these important milestones. And with that, I would ask everyone to have a lovely evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMary Jenkins -- Senior Manager, Investor Relations\n\nDoug Ingram -- Chief Executive Officer\n\nLouise Rodino-Klapac -- Chief Scientific Officer and Executive Vice President\n\nDallan Murray -- Senior Vice President, Chief Commercial Officer\n\nIan Estepan -- Chief Financial Officer\n\nGena Wang -- Barclays -- Analyst\n\nTazeen Ahmad -- Bank of America Merrill Lynch -- Analyst\n\nGil Blum -- Needham and Company -- Analyst\n\nColin Bristow -- UBS -- Analyst\n\nUnknown speaker -- Goldman Sachs -- Analyst\n\nMatthew Harrison -- Morgan Stanley -- Analyst\n\nBrian Abrahams -- RBC Capital Markets -- Analyst\n\nB. Skorney -- Baird -- Analyst\n\nTim Lugo -- William Blair -- Analyst\n\nAnupam Rama -- J.P. Morgan -- Analyst\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nYun Zhong -- BTIG -- Analyst\n\nZhiqiang Shu -- Berenberg Capital Markets -- Analyst\n\nGavin Clark-Gartner -- Evercore ISI -- Analyst\n\nMore SRPT analysis\n\nAll earnings call transcripts"
}