{
  "companyName": "Tyson Foods",
  "companyTicker": "TSN",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/14/tyson-foods-tsn-q4-2022-earnings-call-transcript/",
  "content": "Tyson Foods (TSN 0.74%)\nQ4 2022 Earnings Call\nNov 14, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Tyson Foods fourth quarter 2022 earnings conference call. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Brandon Tucker, senior manager, investor relations. Please go ahead.\n\nBrandon Tucker -- Senior Manager, Investor Relations\n\nHello, and welcome to the fourth quarter fiscal 2022 earnings conference Call for Tyson Foods. Prepared remarks today will be provided by Donnie King, president and chief executive officer; and John R. Tyson, EVP and chief financial officer. Additionally, Shane Miller, group president, fresh meats; Stewart Glendinning, group president, prepared foods; David Bray, group president, poultry; and Amy Tu, group president, international, and CAO, will join the live Q&A session.\n\nWe have prepared presentation slides to supplement our comments, which are available on the Investor Relations section of the Tyson website and through the link to our webcast. During this call, we will make forward-looking statements regarding our expectations for the future. These statements are subject to risks, uncertainties, and assumptions, which may cause our actual results to differ materially from our current projections. Please refer to our forward-looking statement disclaimers on Slide 2, as well as our SEC filings for additional information concerning risk factors that could cause our actual results to differ materially from our projections.\n\nWe assume no obligation to update any forward-looking statements. Please note the references to earnings per share, operating income, and operating margin in our remarks are on an adjusted basis, unless otherwise noted. For reconciliations of these non-GAAP measures to their corresponding GAAP measures, please refer to our earnings press release. I will now turn the call over to Donnie.\n\nDonnie King -- President and Chief Executive Officer\n\nThank you, Brandon. And thank you to everyone for joining us for the call. Earlier today, we announced our fourth quarter and total fiscal year 2022 results, which showed record annual financial performance, including revenue, adjusted operating income, and earnings per share. I'm grateful for the hard work and dedication of our team members.\n\nOur results would not have been possible without them. In this challenging macroeconomic environment with historically high inflation, consumer demand for protein remains relatively steady. We remain well-positioned to serve this demand. We leveraged our diverse protein portfolio across multiple channels and brands to meet customer and consumer needs across a broad range of products and price points, serving an estimated one-fifth of U.S.\n\nprotein consumption. And as proven by our double-digit sales growth, our portfolio of value-added and branded products positions us uniquely to win. In addition to growing sales, we are also aggressively' mitigating inflationary cost and SG&A expenses through disciplined revenue management and enterprisewide productivity actions, including investments in automation to improve operational excellence and efficiency. As we progress our efforts to be the most sought after place to work, we continue to listen to our team members needs and invest in areas, like child care, to provide a better quality of life for our team members.\n\nWe're beginning to see results from these investments through improved staffing levels and reduced turnover. Before I discuss our financial performance, let me provide a bit of strategic context. As you are well aware, we have a strong and disciplined strategic growth plan. In this past year, we continue to methodically execute against this plan as we strengthened our position as a global protein leader.\n\nOur growth strategy is built on five key pillars: transforming our team member experience, growing with our customers to service demand, investing in digital and automation to drive operational excellence, restoring competitiveness in our chicken segment, and leveraging our financial strength to invest in the business and return cash to shareholders. I'm pleased to report that we have executed on each of these imperatives and delivered what we said we would entering the fiscal year. Our commitment to strengthening our position as a global protein leader and driving value creation for our shareholders is the most important goal for our team. Having the right leadership team in place is also imperative as a global protein leader.\n\nTo accomplish this, we recently announced changes in our executive leadership team, which we believe will drive improved results across our organization. Overall, we feel good about our performance. We saw a lot of really good things. We delivered record sales, revenue, and earnings.\n\nThe chicken turnaround progressed as promised. Beef performed better than expected. And prepared foods is seeing positive volume momentum exiting the year. With that strategic context, let's turn to our financial performance.\n\nCompared to our initial fiscal year guidance, we exceeded our total company sales and beef margin guidance. And we met guidance on chicken and prepared foods margins. We managed our balance sheet and sit today at a leverage ratio comfortably below our guidance. Sales improved 7% for the fourth quarter and 13% year over year.\n\nWe delivered record sales revenue as a company and across each of our four largest operating segments. We delivered record annual adjusted operating income of $4.4 billion, up 3% over the prior year. As expected, our fourth quarter earnings were lower compared to the prior year. But this was almost entirely due to record strength in beef a year ago, our operating income performance translated to adjusted earnings per share of $1.63 for the fourth quarter and a record $8.73 for the full year, up 5% from last year.\n\nTurning to our results on volume. We're continuing to optimize our existing footprint, add new capacity, adjust our product mix by plan, and match our portfolio more closely with customer and consumer needs. We saw the benefits of our efforts in the fourth quarter as total company volume increased 2.1%. We are building positive momentum and remain confident that our strategy will enable us to grow volumes across all segments long term.\n\nChicken volumes increased 1.1% in the quarter compared to the prior year, driven by increased domestic production. In prepared foods, volumes were relatively flat in the quarter compared to the prior year. We are gaining momentum, delivering sequential quarterly improvement, driven primarily by the strength of our retail brands. The categories in which we play continue to be highly consumer-relevant, with the vast majority remaining elevated relative to pre-pandemic.\n\nIn a few slides, we'll discuss our strong share performance. Compared to prior year, beef volumes were up 5.1% for the quarter, driven by higher head throughput and carcass weight, improving from a full year volume deficit of 1.5% in the third quarter. We finished a year relatively flat. Port volumes were down 1.1% for the quarter compared to prior year due to limited hog supply and reduced export demand.\n\nIn international, volumes continue to grow, up 7.3% compared to the prior-year quarter, driven by our investments in capacity, innovation, and brands that support market share growth. As we look ahead, one thing that excites me is the momentum I see in our branded retail business. It is evident that we are delivering the brands and the products that consumers want. With our iconic retail brands, Tyson, Jimmy Dean, Hillshire Farm, and Ball Park, Tyson core business lines outpaced total food and beverage and our peers in growth, up 18% in volume sales in the last 13 weeks compared to pre-pandemic levels per Nielsen data.\n\nAccording to Nielsen data, Tyson core business lines grew volume share by 2.6 points this quarter compared to pre-pandemic levels, while also growing share relative to a year ago. We continue to be the market share leader in the majority of the retail core categories in which we compete, while also gaining share in seven of these nine core categories. We experienced the greatest share gains in frozen protein breakfast, smoked sausage, and corn dog category. Our brand strength relative to our peers is undeniable, as Tyson, Jimmy Dean, Hillshire Farm, and Ball Park all hold favorite brand status with consumers in the categories in which we compete.\n\nMany of our retail businesses continue to outperform total food and beverage and remain highly relevant to consumers, and, therefore, elevated in consumption. Consumers will continue to spend on relevant categories and brands they know and trust. This data shows the recovery we're seeing versus a year ago and the momentum we are gaining as we move into fiscal 2023. We have made steady progress improving fill rates and on-shelf availability as we focus on serving our current customers and attracting new customers to grow our distribution and volume.\n\nAdditionally, we took various degrees of pricing in our key categories earlier this fiscal year to offset inflationary cost pressures. Recently, we have seen competitors followed by increasing their prices, nearing Tyson's price gap relative to our competitors. This is supporting improved volume performance across our portfolio of prepared foods products as we are continuing to see price elasticities remain below historical levels. We're investing strategically in merchandising and advertising to support the long-term health of our brands as their strength enables continued growth in both, dollar and volume retail share.\n\nThese factors, along with our strong business fundamentals, resulted in sequential quarterly share growth in many of our key retail category. And we expect our retail share growth to continue. While the food service industry has yet to recover to pre-pandemic traffic levels, the Tyson Focus 6 group is outpacing both total broadline and respective categories and volume sales, up 18.9% and 0.9 share points in the last 52 weeks compared to last year according to NPD SupplyTrack data. The Tyson Focus 6 group composed of value-added chicken, breakfast sausage, dinner sausage, pepperoni pizza toppings, bacon, and Philly steak is also up 1.7 volume share points in the last 52 weeks compared to pre-pandemic levels.\n\nWe believe strongly in our food service portfolio and are confident there is immediate and long-term growth ahead of this business as we align with key growing customers and execute our strategy across all categories to build momentum for the future. Our team members are essential to providing the products to our customers and consumers' demand. Staffing levels and the impact on operational throughput were a challenge in our business. We continue to make significant investments in our team members' experience, prioritizing these three key areas of health, safety, and well-being of our team members, total rewards and team member growth, and our One Tyson culture with digitalization as a key enabler.\n\nWe're now seeing business results from investing in becoming the most sought after place to work. Examples of these investments are free education, child care solutions, citizenship support, transportation, maternity and paternity leave, and expanded mental health and well-being benefits. In August, we received national recognition for our innovative ride-sharing program benefiting team members across the nation. The program provides an option for team members who may have difficulty assessing reliable transportation to get to work and is improving their quality of life.\n\nInvestments in enhanced benefits, digitalized processes and tools, and career growth opportunities for our team members are paying off. In October, we announced our One Tyson corporate office consolidation to world headquarters in Springdale, Arkansas. The move will enable excellence and execution by bringing our corporate business unit roles together on one campus, driving a culture that optimizes collaboration, innovation, accelerates speed, and facilitates career growth for our team members. The feedback we've received from our customers for this change has been well received.\n\nThese investments we're making in our people are part of our broader effort to evolve our business from an environmental, social, and governance perspective. Today, we are focused on three core pillars of our ESG framework, the formula to feed the future. Those three pillars are reimagining people and community impact, driving product responsibility from farm to table, and working toward achieving net-zero. In July, we released our sustainability report for 2021, which highlights our ambition to become the world's most sustainable and transparent protein company.\n\nIn addition to the investments in people mentioned, we also highlighted in our report our efforts around animal welfare, sustainable packaging, minimizing waste, water stewardship, and working within our operations and supply chain to reduce emissions. Significant progress was achieved in the past fiscal year in improving our scores and metrics within ESG rating agencies. We are particularly proud of a more than 30% increase in our Dow Jones Sustainability Index score year over year, and we're taking more steps to continue to improve our standing with ESG stakeholders. In the past fiscal year, our productivity program outperformed on our commitments, delivering over $700 million in savings impact across all components of our business.\n\nThis performance indicates how Tyson has remained focused on optimizing our business processes, digitalizing our supply chain and increasing automation, and aggressively managing SG&A across our operations. We expect the productivity program will continue to outperform our original expectations of more than $1 billion in recurring savings by the end of fiscal year 2024. The program is now on track to deliver this commitment by the end of fiscal year 2023, a year earlier than expected. As mentioned before, these recurring savings support the partial offset of inflationary pressures, while at the same time improving our competitiveness in the marketplace.\n\nAutomation remains a top priority, and I'm very pleased with the aggressive rollout of automation technologies across all segments in fiscal year 2022, including continuing to scale debone automation in our poultry operations and pack-out automation across all businesses. I will now turn the call over to John to walk us through more detail on our financial results for the fourth quarter.\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nThank you, Donnie. Let me turn first to a summary of our total company financial performance. We're pleased to report resilient fourth quarter and record annual performance in the fiscal year. Sales were up for both the fourth quarter and fiscal year, benefiting from our pricing initiatives to offset the increase in cost of goods.\n\nVolumes were up for the fourth quarter and relatively flat for the full year as we overcame supply constraints in an elevated inflationary environment pressuring consumer demand. Looking at our sales results by channel for the fiscal year, retail drove 1.4 billion of top-line improvement, while the ongoing recovery in the food service channel drove an increase of 2 billion. Fiscal year sales in international markets, including both domestically and internationally produced products, were 1.3 billion greater than the prior year as we leverage our global scale to grow our business. Donnie covered our operating income and earnings per share results, so I won't repeat.\n\nSlide 16 bridges operating income for the fiscal year, which was 126 million greater than the fiscal 2021. We significantly improved earnings in our chicken segment and generated higher earnings in prepared foods, which more than offset the expected decline in beef earnings. Our pricing actions, which offset the higher input costs, led to higher sales during the year. We saw notable year-over-year increases of 20% to 25% across the business in cost of goods, including labor, feed ingredients, live animals, and freight costs.\n\nInvestment in growth is our priority. To facilitate this growth, an additional 80 million in SG&A expenses compared to last fiscal year was invested in team members, marketing, advertising, and promotional spend to support our brand and digitalization initiatives, among other things. While SG&A expenses increased, SG&A as a percentage of total sales was down to 4.2% from 4.5% in the prior fiscal year, reflecting our continued focus on assessing all expenses across the business to identify non value-added spend and continuing to build leverage across the scale of our business. As mentioned by Donnie, we significantly accelerated our productivity actions to improve efficiency across all segments during the past year, which has had a meaningful positive impact on our margin profile.\n\nOur year-to-date results clearly demonstrate that our diverse portfolio supports our growth objectives of growing faster than the overall market, improving operating margins and driving strong returns for our shareholders. Now, moving to the beef segment, sales were approximately $4.9 billion for the fourth quarter, down 3% versus the same period last year but up 10% for the fiscal year at nearly $20 billion. Sales in the quarter remained strong, supported by higher volume but offset by lower average sales price. Global consumer demand for beef products remains strong.\n\nWe expect volumes to remain stable next year amid tightening supply of cattle, offset by improved labor participation, supporting higher plant productivity. On expenses, we incurred greater costs during the fiscal year compared to the prior year as live cattle costs increased approximately 2 billion. But we have sufficient livestock available to finish the year, and we continue to have ample supply to support our operations. We delivered segment operating income of 2.5 billion for the year.\n\nAnd our fiscal year operating margin of 12.5% was a very strong performance by historical standards. We still expect future beef margins to be in a normalized range of 5% to 7% over the long term. Looking next to the pork segment, sales were approximately 1.6 billion for the quarter and 6.4 billion for the fiscal year, down 3% and up 2%, respectively, versus the prior year. Global demand remains challenged by high domestic retail prices and the strong U.S.\n\ndollar, making U.S. pork relatively expensive as compared to alternative sources globally. For the year, the average sales price increased 4.1%, offsetting the decrease in volume of 1.9%. We expect these headwinds to impact pork volumes next year to a lesser extent than the past year.\n\nSegment operating income and margins were 198 million and 3.1%, respectively, for the fiscal year. The operating income deterioration was driven by herd health issues negatively impacting hog costs and a constrained cut out compressing pork margins in the elevated inflationary environment, increasing operating costs overall. While the Q4 result was negative operating income, we do expect to flip back to positive returns in Q1. Moving now to prepared foods, sales were approximately 2.5 billion for the quarter, up 12% relative to the same period last year.\n\nFor the fiscal year, sales increased 9.4%, driven by the higher average sales price increase of 13.5%, partially offset by the volume decline of 4.1%, in which 0.9% of the decline was due to the sale of our pet treats business. Volume performance improved in the fourth quarter as our investments in brands and merchandising drove an increase in portfolio market share. Our fourth quarter result, which was roughly flat versus last year, was our strongest performance this year and better than the competition, which underscores the strength of our brands. We expect volume to grow sequentially next year, driven by food service recovery, improved supply, and continued investment in our brands.\n\nOperating margin for the segment was 5.8% or 147 million for the quarter, up 4.1% compared to last year. For the fiscal year, our operating margin was 8.1%, up 0.5% compared to the prior year at 782 million. Now, on to the chicken segment's results. Sales were 4.6 billion for the quarter, up 19%.\n\nAnd for the full year, sales were up 24% at 17 billion. Volumes improved both for the quarter and fiscal year as we gained momentum in the improvement of our live operations. We expect this operational improvement to continue driving sequential quarterly volume growth into next fiscal year. Average sales price increased by approximately 18% for both the quarter and the fiscal year compared to last year.\n\nOur shift in pricing mechanisms to more variable structures, allowing us to be more agile in response to market condition, was a key decision by our management team. Chicken delivered operating income of 337 million or 7.3% for the fourth quarter and 926 million or 5.5% margin for the total fiscal year. Respectively, this represents margin improvement of 10.2% and 5.3% over the prior-year comparable periods. This quarter, we surpassed our goal of processing 40 million head per week by the end of the fiscal year.\n\nWe intend to continue to grow next year to 42 million head per week, enabling us to maximize our fixed cost leverage and grow market share along with our value-added business. With live operations on a positive trajectory, we will continue optimizing our plant network and portfolio mix to maximize the profitability of our chicken segment. I am pleased with the tremendous progress we have made against our road map to restoring competitiveness in this business. However, there's still work to do to attain industry-leading performance, and I look forward to more great things to come from the team on this one.\n\nNow, turning to Slide 20, our healthy cash flows and improved balance sheet have continued to support our disciplined capital allocation approach with a focus on total shareholder return. We remain focused on building financial strength, investing in our team members and business, and returning cash to shareholders. We produced 2.7 billion of operating cash flows in fiscal year '22. This is after funding a 2.1 billion increase in working capital, which included an investment of $1 billion in inventory to better service our customers, as well as the impact of cost inflation.\n\nAdditionally, we had other planned working capital outflows associated with taxes paid on the divestiture of our pet treats business, payment of a portion of deferred payroll taxes from the CARES Act, and the settlement of certain legal accruals. Our leverage ratio finished the year at 1.3 times net debt-to-adjusted EBITDA, demonstrating our powerful balance sheet and our continued capital allocation optionality. Investing in our business for both organic and inorganic growth and operational efficiency will continue to be an important priority as we utilize a disciplined capital allocation and balance sheet management approach to invest in desirable projects, brands, categories, and geographies. We also maintain a disciplined M&A approach, investing in opportunities that fit well with our existing portfolio or our growth objectives, such as the recent acquisition in Saudi Arabia, providing access to the growing Halal market.\n\nWhile M&A will always be a consideration for growth, we're focused first on investing in growth in our existing footprint. This will facilitate Tyson increasing production capacity, market capabilities, and profitability, providing return on capital generation above the market and at a minimum of 12% return on invested capital for our shareholders as our long-term target. To address projected demand growth over the next decade, we invested $1.9 billion in our business in the past fiscal year, focused primarily on new capacity and automation objectives. Finally, we remain committed to returning cash to shareholders through both dividends and share buybacks.\n\nFor the fiscal year, we returned nearly 1.4 billion in cash to shareholders through $653 million in dividends and $702 million of share repurchases as we continue to prioritize shareholder return. Let's now discuss the fiscal 2023 financial outlook. We anticipate total company sales between 55 billion and 57 billion, and also expect volume growth compared to the prior fiscal year. Both total company sales and volume growth in fiscal '23 will largely be driven by our chicken, prepared foods, and International businesses, as we work to run our plants full, optimizing our existing footprint and utilizing new capacity expansions.\n\nTo grow volumes in our chicken, prepared foods, and international businesses, construction is in progress of six new plants, all to be in operation by the end of fiscal 2023. We're building a value-added chicken plant in Danville, Virginia, and we're growing our bacon business with a new location in Bowling Green, Kentucky. And we're also expanding our footprint and increasing volumes outside the U.S. with three plants going live in China and one in Malaysia during 2023.\n\nThese investments in the recently announced joint venture partnerships are fueling future growth, both organically and inorganically, in our international business. We remain focused on growing internationally and on those fastest-growing protein consumption markets in the world. Now, as we touched on earlier, our productivity program is expected to deliver an additional 300 million to 400 million of savings during fiscal 2023 as we build upon the foundation laid across the enterprise this year with focus on operational and functional excellence, digital solutions, and programmatic automation initiatives. To continue to capitalize upon the organic growth opportunities ahead for our business, we expect to increase capex spending to approximately $2.5 billion during fiscal 2023 to pursue a healthy pipeline of projects with strong return profile.\n\nWe currently expect our adjusted tax rate to be around 23%, and we anticipate net interest expense of approximately $320 million. Liquidity is expected to significantly exceed our minimum target and net leverage is expected to remain below two times net debt-to-adjusted EBITDA. We expect strong and meaningfully better operating cash flows in fiscal 2023 as we do not expect to invest as much in working capital as experienced in the past fiscal year. Now, finally, let's look at how each of our segments will contribute to our total company performance.\n\nAs mentioned earlier, we continue to expect future beef segment margins to be in a normalized range of 5% to 7% for the long term. However, based on current market dynamics, we expect fiscal 2023 to be at or below the low end of that range. In pork, we expect return on sales between 2% and 4%. Due to normal seasonality for our pork segment, we expect the front half of the year to outperform the back half of the year.\n\nWe continue to invest behind our expanded case-ready capacity, increasing volume through organic growth with new and existing customers, underpinned by product innovation for both our beef and pork segments. Prepared foods is expected to deliver margins during fiscal 2023 between 8% and 10%, driven by volume growth, productivity, and disciplined revenue management. We expect volume, sales revenue, and operating income to all increase through the fiscal year, with stronger quarters in the second half of the year compared to the first half of the year. In chicken, our operational turnaround progress as forecasted, and we are now increasing our focus on optimizing our mix to maximize profitability of our value-added portfolio.\n\nWe expect to deliver full year margins of 6% to 8%, driven primarily by progressively growing volume and sales revenue, while at the same time realizing additional operational improvements. And in international, we anticipate improved profitability from our operations in fiscal 2023, driven by volume growth from capacity expansions ramping up. Our segments individually and in aggregate have clear and compelling roles within Tyson's portfolio strategy. We make products that provide options for consumers across proteins and up and down the value chain, delivering performance that supports the company's long-term earnings objectives and desirable returns for shareholders.\n\nTo sum it up, fiscal 2022 was a record year in revenue, operating income, and EPS. And as a result, we are in a strong financial position as we enter fiscal 2023 to support continued investment in our existing footprint, new capacity expansion, more automation, and support for our brands as we continue to grow our business. Now, before I turn the call over for your questions, I want to take a moment to address an important issue. I'm sure you've seen the news about the recent incident involving me.\n\nI'm embarrassed, and I want to let you know that I take full responsibility for my actions. I also want to apologize to our investors as I have to our employees. This was an incident inconsistent with our company values, as well as my personal values. I just wanted you guys to hear this directly from me and to know that I'm committed to making sure this never happens again.\n\nAnd with that, I'll turn the call back over to Donnie. Donnie?\n\nDonnie King -- President and Chief Executive Officer\n\nThanks, John. I would like to take a moment to make one final point. Like John, the company takes this matter seriously. Tyson Foods has a strong, robust corporate governance process.\n\nOur independent board of directors are overseeing a thorough review of this matter, and I'm confident in this independent process. With this said, and before I turn the call back over to Brandon for your questions, I'd like to remind you that 2022 was a record year for sales for operating income, as well as EPS. And we look forward to a strong 2023.\n\nBrandon Tucker -- Senior Manager, Investor Relations\n\nThanks, Donnie. We will now move on to your questions. Please recall that our cautions on forward-looking statements and non-GAAP measures apply to both our prepared remarks and the following Q&A. Operator, please provide the Q&A instructions.\n\nOperator\n\n[Operator instructions] Our first question comes from Adam Samuelson with Goldman Sachs. Please go ahead.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nYes. Thank you. Good morning, everyone.\n\nDonnie King -- President and Chief Executive Officer\n\nGood morning, Adam.\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nGood morning.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nSo, I guess my first question is thinking about the outlook for fiscal 2023 in beef, and you're kind of staying at or below the low end of the normalized range. Clearly, there's been some herd liquidation that's been happening in the U.S. industry. Cattle prices have risen.\n\nI guess I'm trying to understand if we're already at or below the low end of that normalized range, the cattle herd was going to keep -- is going to keep shrinking. Can you help us think about how we would ever get -- how we would get back to that normalized range in the next few years with the smaller herd? Talk about kind of what you're doing from productivity, from a mixed, case-ready capacity that would be a balance to margins and what would seem like a more challenging kind of multiyear outlook?\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nHey Adam. This is John, and thanks for the question. I think, look, first, I'd reiterate what we see as the long-term guidance for the beef business. And, you know, we -- that's a full outlook for the year, long term.\n\nWe're not, at this point, going to give quarterly guidance. And what I think I'd say is, you know, we're, at Tyson, not necessarily immune to the cattle cycle, but there are a couple of things I'd point out, you know, that maybe make this cycle a little bit different. You know, number one, we see the quality, generally speaking, around the industry is stronger and better that has kind of supported demand for beef cattle. I think, secondly, the global demand is pretty strong.\n\nThat's a little bit tempered by FX that we're seeing in our business. But generally speaking, I think that makes this cycle that we're heading into a slightly different. I'll let Shane maybe comment on some of the investments we're making around the business and give a little more detail as it relates to the outlook on beef.\n\nShane Miller -- Group President, Fresh Meat\n\nThanks for the question, Adam. You know, John touched on a couple of things that -- I think to think about that's a bit different this cycle versus, you know, previous cycles is, one, you know, John touched on the cattle quality. That's extremely different this go-round than the last time we went through this cycle. The second component is, globally, beef has remained and still has been a strong demand product that's going into different channels throughout Asia.\n\nAnd also, we're seeing interest from different parts of the globe that historically have not been big buyers of U.S. beef. And then, finally, if you think about the -- even though we do have a strong quality that's coming out of the meat products, but you have items such as our specialty products, fats and oils are off all items. Items like that that typically haven't been large contributors that this go-round are significant contributors.\n\nSo, if you think of it in direction in relationship to the last cycle, I think we have an opportunity here to scale in here and do much better than the last go-round. So, I think all those things coupled together give us confidence and hope that we're going to continue to be able to drive this type of return.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nOK. That's helpful. And if I could just maybe switch gears to the chicken business. And if you think about the exit margins coming out of fiscal fourth quarter and 7.3%, can you just help us think about the trajectory of chicken from here? I think there was some mark-to-market derivative gains in the quarter.\n\nBut how do we think about the volume scaling kind of mix contribution? And help us think about kind of what would get you to the 8% versus the 6% at the upper and lower bounds of your guidance range.\n\nDonnie King -- President and Chief Executive Officer\n\nThanks, Adam. This is Donnie. Thanks for the question. The chicken turnaround continues.\n\nWe've made a lot of progress. David and his team have got our chicken business in a better place than it's been in some time. But we haven't arrived yet. There's still things to do.\n\nAnd we get better sequentially each quarter and would expect that to continue. I would point out that we're guiding to a 6% to 8% for '23, and we feel very good about that. And we feel good about investing in our Tyson brand and continuing to use that. But let me just flip it over to David.\n\nAnd this is a guy who's been doing all the work and -- he and his team, and let him add some additional color for you.\n\nDavid Bray -- Group President, Poultry\n\nPerfect, Donnie. Thank you very much. And you said it very well. We have made progress in 2022, but we've got a considerable amount of work to do as we get into 2023.\n\nBut it's also important to understand that our goals have not changed within this segment. And we are aligned on not only making sure that we service our customers, but we run our facilities and capacity. And that's incredibly important to us as we move into 2023. As a team, we're focused on making sure that our customers are serviced, that we fill our plants, and that we're taking care of our team members.\n\nAnd in total, we've got a very strong plan for 2023. And John mentioned the guidance between 6% to 8%, and we feel very good about the plan we have in place to deliver those numbers.\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nGreat. I'll pass it on. Thanks.\n\nDonnie King -- President and Chief Executive Officer\n\nThanks, Adam.\n\nOperator\n\nOur next question comes from Ben Bienvenu with Stephens. Please go ahead.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nHey. Thanks. Good morning, everybody.\n\nDonnie King -- President and Chief Executive Officer\n\nGood morning.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nSo, I want to ask about the prepared foods business, and you talked about the cadence of improvements that we should expect as we move through the year. Could you talk about the critical path to achieve that cadence of improvement through the year? And if we think about the pricing that you've taken today, is that sufficient to cover the costs to get to that 8% to 10% range? Or is there additional pricing that you might need to take?\n\nDonnie King -- President and Chief Executive Officer\n\nLet me just say that -- and I'll pass it over to Stewart to add some commentary. We guided to 8% to 10% in 2023. And behind productivity, capacity utilization, and mix improvements, we anticipate improved volume sales and AOI for '23. Our food service recovery is a little slower pace than expected, but we feel very good about this segment and the performance.\n\nAnd I'm personally very proud that we have Stewart leading this business. And, Stewart, why don't you add some comments?\n\nStewart Glendinning -- Group President, Prepared Foods\n\nYeah. Thanks. Good morning, Ben. I'd, you know, start by saying that it's great to run this business because when you look at the construct of the prepared foods business, on the retail side out of the nine categories, we've got the No.\n\n1 position in eight. And on the food service side, we're in, I think, about 19 categories or so there. And in the majority of those, we've got the No. 1 position.\n\nSo, we're really starting from a position of strength just from a portfolio standpoint. You look at the way this year has gone, we took pricing earlier in the year. And so, as we went through the year, of course, we had continued inflation. So, looking to the back part of this -- of '23, as we go through '23, we're going to be recovering from the 5.8% to get up to the eight.\n\nAnd that's really going to have a couple of big drivers. The first one and the most important is volume. If you look back in the volume history, we shared last quarter that we'd lost some food service volume. We're working on getting that back.\n\nOur fill rates, we still have an opportunity in fill rates. And so, there's volume that's actually sitting in our order queue that we can go and get. And we're working on that and seeing improvement week over week. As the pricing, we'll see how the year goes.\n\nIn this fourth quarter, we saw a strong volume performance. Some of that came on the back of increased promotions. But I'd note that our promotions were in line with our competition. So, back half of the year, probably the last point to make is we've got pretty strong plans for cost reduction this year, and that will also contribute to getting us to the 8% to 10%.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. Great. And if I could circle back to the chicken business, I believe your goal that you laid out at the investor day in 2021 was to be at an 84% hatch rate as of kind of around right now. Is that where you are? Are you on track? You mentioned commentary in your slides that you're on track with your hatch improvement goals.\n\nAre we kind of now at a new cruising level and shouldn't expect further improvement from here? Or could that continue to improve, would you want it to?\n\nDavid Bray -- Group President, Poultry\n\nWe are well on track. We are very pleased with the work that our live team has done in getting this put back in a position where we're no longer having daily conversations about what our hatch rates are. So, we are on track and feel good.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. Thank you. Best of luck.\n\nDonnie King -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Alexia Howard with AllianceBernstein. Please go ahead.\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nGood morning, everyone.\n\nDonnie King -- President and Chief Executive Officer\n\nGood morning.\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nGood morning.\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nGreat. Can I ask about the productivity savings program? You obviously overdelivered in fiscal '22 relative to where you were expecting to get to. Can you talk about what it was that went better than expected? And I guess linked to that, a second question, if the automation part is going faster than expected, how quickly is total employee count coming down? And how much more is there to go on that front? Thank you.\n\nDonnie King -- President and Chief Executive Officer\n\nSure. Thanks for the question. So, the productivity program, as we laid it out, it was a three-year program, and we're well ahead of that in 2022. And we talked about this in terms of really three buckets.\n\nAutomation is obviously one of those, digital is another, and then operational and functional excellence. And all of those are working together really, really well. We think we'll meet our commitment by the end of this fiscal year '23. But, you know, it seems like every rock we turn over, we find something new, and we capture that, and we'll continue to do that.\n\nThe automation piece specifically is progressing faster than what we had planned. And, of course, we're happy about that. But -- you know, remember, the automation piece was to eliminate some laborious difficult, high turnover type of positions. And in the program, as I think it was in the script that I mentioned, in chicken, the debone automation project, but we also, in this programmatic approach to automation, where we have focused in our pack-out area.\n\nAnd we've also launched our digital enablement group as we take technology throughout Tyson. And we're progressing on all of those, and we'll update you each and every quarter on how we're doing in that area.\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nGreat. And anything on the headcount side of things?\n\nDonnie King -- President and Chief Executive Officer\n\nI have nothing to report on that now. We obviously are eliminating positions and are eliminating difficult jobs, and we are reassigning people to open position throughout the company.\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nGreat. Thank you very much. I'll pass it on.\n\nDonnie King -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Robert Moskow with Credit Suisse. Please go ahead.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHi. Thank you. Look, those of us who have followed Tyson for a long time are used to the company putting people with a lot of brand management expertise in charge of prepared foods because it's a heavily branded food portfolio, and putting people into the CFO role who have 20-plus years of experience in the finance track. And this latest reshuffling did the opposite.\n\nCan you speak to how the organization is responding culturally to these decisions, especially in light of the fact that you're also closing down two of your headquarters, consolidating into Springdale? Donnie, what are you doing to mitigate execution risk during this, you know, kind of high turmoil period?\n\nDonnie King -- President and Chief Executive Officer\n\nThank you. In short, we have a plan. Let's start with the office consolidation that you referenced. You know, this is something that we've talked about.\n\nWe've looked at for a number of years now. And we made the decision to do that in an effort to be a better version of ourselves. We're still working through trying to finalize which team members are moving and which ones are not. We certainly realize it's a difficult decision for those team members, and we're committed to providing the resources.\n\nAnd the way we've characterized that here at Tyson is we're trying to help those team members, and it's about 1,100 of them, to be able to find the yes in terms of being able to move here and with their families. And I would just characterize it as integration a few years later. And there's opportunity, obviously, that we see in terms of being better, being more agile, and delivering better results, being more productive, all those type attributes. And in order to get that, we had to do our project concept.\n\nNow, in terms of the people, I would remind you, at Tyson, we have a -- our succession planning process is very robust. And we're working that program. It's a living document, and we did, to your point, make some decisions. I would start with I am very pleased with the decisions that we've made around John Randal, around Stewart, and Amy Tu.\n\nThese are very talented individuals. And all of them have experience in other areas that -- and then they brought that to Tyson. So, we're comfortable with the team that we've got. The team feels good with the leaders that they have.\n\nAnd I already see great progress in the work that they're doing. And -- but we're -- I'm perfectly comfortable with the people we put in place.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nI appreciate that, Donnie. Maybe a follow-up. When do you expect to be able to give more clarity to those 1,100 people? In my experience, you know, people who want to know stuff like that sooner than later. How quickly can you move?\n\nDonnie King -- President and Chief Executive Officer\n\nSure. So, I think the thing that you need to know about that is we've been working and meeting almost on a daily basis. We put together a team to execute the plan that we have in place. We've invited every team member to join us here in Northwest Arkansas.\n\nAnd that's open. We've asked them to commit to us, you know, what their intentions are. And in fact, today -- I don't know the numbers yet, but today was the day at which we needed to know that. And we really approached this in a couple of different ways.\n\nOne is we want you to be here. We want you to remain a part of Tyson Foods. And quite frankly, I've been out recruiting people to, as other leaders have, to come to Northwest Arkansas. And we've had a lot of success.\n\nThere will be some people who, at this point in their life, can't move. And so, we will try to create an opportunity where they can stay with the company long enough so that their replacement could be hired and trained so that we have no business interruption or interruption of business continuity.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nMakes sense. Thank you.\n\nDonnie King -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Ben Theurer with Barclays. Please go ahead.\n\nAntonio Hernandez -- Barclays -- Analyst\n\nHi. Good morning. This is Antonio Hernandez on behalf of Ben Theurer. My question is regarding your capex plans for the next year.\n\nYou provided some color on that. But could you provide a little bit more breakdown on the different items that you're spending and what should we expect more in the medium to long term? Thanks.\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nHey, there. You're kind of muffled on our end. I think your question was about capex and just wondering if we could expand upon that. Is that right?\n\nAntonio Hernandez -- Barclays -- Analyst\n\nExactly. Yes.\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nSure thing. Well, I think what we've talked to you about already this morning is our plans for a heavier investment in our business compared to historical years. And I think, you know, in a small part, that's driven a little bit about the inflationary environment that we're in. But really, I think the point we want, you know, you to take away is that we see a lot of opportunity in our business in terms of productivity improvements, things like automation and a little bit of capacity expansion.\n\nSo, as it relates to priorities, I would tell you that in our value-added segments, we're trying to grow capacity. And in some of our, you know, chicken, prepared foods, and fresh meats businesses, we see opportunities for network optimization. So, I don't think it's any departure from what you would expect us to be investing in, a decent balance of growth and productivity investments. I would emphasize, you know, back to the question that someone asked earlier, automation is a huge part of our agenda.\n\nAnd what we like about those investments is we see sustained productivity as we reapportion team members to different parts of our operations. And so, we feel really confident in some of the more programmatic investments we're making around our automation agenda.\n\nAntonio Hernandez -- Barclays -- Analyst\n\nOK. Perfect. Thank you.\n\nOperator\n\nMy next question comes from Ken Goldman with JPMorgan. Please go ahead.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. You know, I wanted to ask about your guidance for the sales range of $55 billion to $57 billion. I do appreciate that there are six new plants coming on and that you'll have some, you know, additional pricing and some mix improvements.\n\nI guess one of the questions we're getting from investors this morning is, you know, is it reasonable to expect the high end of that range, just given some of the potential trade-down coming as consumers potentially, you know, face some more challenges and more importantly, where we're seeing chicken prices today? So, I guess I'm curious, you know, if you can expand a little bit perhaps on how much production the six new plants are expected to cumulatively add? I think that would help people really kind of maybe bridge the gap there to that higher end, perhaps?\n\nDonnie King -- President and Chief Executive Officer\n\nLet me start off, Ken, and say this. I mean, we feel very confident in the -- what we've laid out in terms of outlook. Could we move to the higher side? Perhaps. But we're guiding to have a really, really good year.\n\nYou know, we factored in things like inflation. We factored in growing share in both dollar and volume. We've included all those things in terms of the drought and the conditions that we're seeing in the beef segment, the strength of the dollar from an export position. So, in short, I would tell you that we've considered all those things in coming up with this plan.\n\nAnd we rolled it up as a team, and we all signed off on it. But I'll pass it to John and see if he wants to --\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nYeah, Donnie, I think that was a fair summary. I mean, you know, there's a balance in that projection between the volume growth and what we see from a sales growth from a pricing standpoint. And I think that we feel confident in the mix between those two things to achieve the range that we gave. You also asked a question about what's the capacity coming online with the new build.\n\nAnd I think without going into details of each of those operations, a little bit of that is dependent on the timing of when things come online in '23. But I think overall, what we want you to take away is that we feel confident in the range at this standpoint, you know, as a roll-up of multiple factors that go into the numbers.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you. And then a quick follow-up. You obviously have done really well with getting your productivity at an accelerated pace.\n\nI don't think -- and forgive me if I missed this, you did talk about productivity after '23. Previously, you had kind of guided into '24. Is it fair to assume that there will be still significant productivity savings after '23 now that you've pulled those forward a little bit? And if so, when might we get a little bit of color on the dollar percentage amount there?\n\nDonnie King -- President and Chief Executive Officer\n\nSo, great question. You know, first thing I would say to you is we had a good '22, and we feel very good about delivering a year early in '23. Our nature is that we are -- have a continuous improvement mindset. So, we will identify and continue to identify opportunities to become more productive, become more efficient to run lines at rate better to automate, do all those type of things that will continue to bring money to the bottom line.\n\nWe feel good about that, and I think you could expect that we would have another program or continuation of this program. I don't know what that is at this moment. John, anything?\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nNo, nothing to add, Donnie. Thanks.\n\nOperator\n\nOur next question comes from Peter Galbo with Bank of America. Please go ahead.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Good morning. Thanks for taking the question.\n\nDonnie King -- President and Chief Executive Officer\n\nGood morning, Peter.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nJohn, I just wanted to maybe clarify a couple of points you made on the volume growth assumptions between some of the segments. I think what you're calling for in chicken is maybe like a 5% growth in '23, just given the weekly slaughter levels. Just wanted to check that. And then on beef, I wanted to make sure I heard you correctly, you know, even with USDA kind of calling for down mid single digit on volumes, you were thinking you could be relatively stable.\n\nI don't know if that meant flat for the year or how you were thinking about that.\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nSure. I think, look, we've kind of tried to give some overall indications on volume as it relates to the various segments. And there's a lot of factors that go into the sales and AOI numbers we're looking at, part of which is volume. I think in our poultry business, we do feel comfortable about the sequential growth directionally speaking, that we're talking about as we head into FY '23.\n\nAnd I think on the beef business, you know, even amid the total environment and USDA calling out the harvest, I think what I'd point to is some of the investments we make in terms of our business model around our relationships with suppliers, investments in kind of the value-added parts of our business, and, you know, continuing to grow in specific channels. I think we see it as critical, you know, to preserving the outlook for '23. Shane, maybe you have a little bit to add on the beef segment.\n\nShane Miller -- Group President, Fresh Meat\n\nYeah. Peter, I think one of the things to keep in mind, too, when you look at beef is you're lapping, you know, a period a year ago with still a COVID-induced reduction in volumes. And we've seen our operations get back to -- we're getting five days of animals harvested, processed in five days and six days really turned into a flex day. So, on top of that, from the supply component, you're right.\n\nI mean, we are in the middle of the drought still. And we're seeing drought-induced movement into the feed yards continues to show lower weights at placement, which, in a sense, means that cattle are being pulled forward and so forth. So, as you look forward here into the next several months, I mean we're still going to have plenty of animals to work through.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nGot it. No. Thanks. That's very helpful.\n\nAnd, Donnie, I guess just to follow up on Ken's last question around chicken. You know, just given that you have transitioned more of your contracts to a more variable pricing structure, what we've seen in the spot markets in terms of pricing, can you just kind of remind us where you stand today in terms of how commodity markets or commodity chicken markets might impact pricing relative to history where maybe it wasn't as impactful to your business?\n\nDonnie King -- President and Chief Executive Officer\n\nLet me -- I'll mention a few things, and then I'll let David add some additional color. Yes, we feel very good about that. I would remind you that in our portfolio, the percentage of our portfolio that is value-added is significant. And a significant portion of that is branded.\n\nAnd so, we have a lot more discretion with that. Some of the pricing variability is essentially more associated with some of the segments like fresh chicken or things like that. But we feel very good. And, you know, if you go back and look at us through history, you will find when the market goes up really high in breast meat -- and I think a quarter or so ago, breast meat was trading at around $2.60 and you can buy that for about $0.90 today.\n\nYou know what, we never got the high of that based on our model, and we never get the lows either. So, we trade within a range here, and we have -- on purpose and have more -- or better, more predictable results. David?\n\nDavid Bray -- Group President, Poultry\n\nDonnie, I think that was perfect, especially when you talked about our exposure and the amount of big bird breast meat that we actually have a part of. But the other piece to that is we have great customers at Tyson Foods. And what we've done within our variable pricing is provided us the opportunity to have more consistent conversations with them about the things that make their prices go up and the things that make their prices go down. And we'll continue to have those conversations despite soft times and seasonality.\n\nSo, a lot of progress has been made against that. And again, we've done a lot of work to shift into more of a value-added mix.\n\nOperator\n\nOur next question comes from Ken Zaslow with BMO. Please go ahead.\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nHey. Good morning, guys.\n\nDonnie King -- President and Chief Executive Officer\n\nGood morning, Ken.\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nGood morning.\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nHey, John, Stewart, can you kind of tell us, as you enter the new role, what is your key actions you expect to do within the next, call it, six to 12 months, and how you think that role for you will evolve? And what contribution you will actually have to the changes that need to be done?\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nHey, Ken. This is John. Maybe let me answer that question first. And I think the first thing I'd point out, just as it relates to kind of the overall leadership team here, as you know, I've been on the executive team for going on a few years now and involved in the senior leadership level for more than that.\n\nSo, I don't think from a capital allocation standpoint or a strategy standpoint, you should expect too many significant changes or departures from how things have been handled in the past. I guess that's the first point I'd make. You know, Stewart and I are sitting here next to each other. You know, stylistically, you might see a few differences between the two of us.\n\nBut I think, you know, overall, I think the direction of the company stays the same. I think, you know, check back with me in a quarter or two to see if there's any, you know, new ideas. But I think overall, I'll just provide the perspective that I think, you know, these leadership moves are kind of both for continuity rather than radical change of any kind.\n\nStewart Glendinning -- Group President, Prepared Foods\n\nYeah. Ken, maybe first just with the background point. I spent 13 years before this in the beer business, 10 of those as an executive officer, four of those as the CFO running the branded businesses. So, I'm coming to this business with a good knowledge of brands, and I'm excited to run what is a powerful part of our portfolio.\n\nWhen I look at the business, I see huge opportunity mainly because the platform is so strong. You know, starting off, if you look at the volume performance of prepared foods over the last number of years, while share has been good, volume could be stronger. And so, as I started to this job, I see real opportunity for volume improvement, particularly in the food service business. And I'm pressing hard against that.\n\nThat means filling the orders we already have and it means selling out the capacity that exists in our network. And both of those have a big opportunity in our company. I also, by the way, look at our cost structures and believe that we've got the ability to run our business in a leaner way and still achieve the growth goals that we want to see in the company. And then, I'd probably finish up by saying that I further believe that on the innovation side, we have lots of runway and lots of opportunity to press hard in the market.\n\nSo, I come into role with both confidence and believing that we have a strong pathway ahead.\n\nDonnie King -- President and Chief Executive Officer\n\nIf I might, Ken, just a couple of things. Stewart touched in fairly great detail, you know, his prior experience, and he does have great experience coming into Tyson. But John Randal, you know, he's had experience outside of Tyson. He's had escalating levels of responsibility and banking and venture capitalism prior to joining Tyson.\n\nBut you may not know that within Tyson, for the last four years, he's led the M&A strategy, ventures, and other areas of the company. So -- but don't forget about the fact that, you know, he's been involved in this business essentially his whole life. So, a lot of experience there. Let me mention Amy Tu, which you didn't ask about very specifically.\n\nBut Amy came to us with a great deal of global leadership outside of Tyson with Boeing and Walmart. She has strong experience in M&A, strategy, and commercial, as well as the legal background. And she's a very talented person. And, you know, I'm very happy with what I'm seeing out of all three of these today, and I think they will make us a better Tyson as we move forward.\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nGreat. I was not minimizing the experience. I just wanted to see the actions, particularly in prepared foods because I sense that, you know, you're in the 8% margin and you're kind of wanting to go to that 8% to 10%. But it sounds like there's a little bit of a touch on operational efficiencies.\n\nMy second question would be, as I think about the longer term, and I know there was an allusion to how you can actually get back to the midpoint of the range. What are the concrete actions that you can do? Or is it really dependent on the market in terms of just making sure that China remains a key exporter? Because that's the single biggest thing that's changed over the last couple of years. So, is it the new environment that you think will get you back there? Or do you think that there is internal actions that can be taken to put you back into that margin structure? And with that, I thank you guys.\n\nDonnie King -- President and Chief Executive Officer\n\nLet me -- Ken, thank you. Let me just say a couple of things. We think we have a bit of a different business model than we had, let's say, in 2015, when we went through the drought last time. It's already been talked about today in terms of our relationship with these producers that provide us with this better quality grading animals that we have.\n\nI think it's also important to remind you about the global demand is better than previous cycles. And people outside the United States are looking for high-quality, grain-fed U.S. beef. And so, we're able to meet that.\n\nBut we've also invested heavily to be able to take boxed beef up the value chain with our investment most recently in Eagle Mountain, Utah, and also in Columbia, South Carolina. So, we continue to take beef and pork up the value chain. And so, we feel better. We feel -- you know, the drought is real.\n\nWe see that. We're not kidding ourselves about that. But we intend to manage through it and perform better than we did the last time through. Shane?\n\nShane Miller -- Group President, Fresh Meat\n\nYeah. Thanks for the question. Donnie, I think you hit on all the key points. The only thing I would mention is, you know, no matter what the market conditions are or the cattle supply, we feel good about all these investments to differentiate our beef business model.\n\nAnd on top of that, if you think about the investments that we've made and we are making into our supply chain on beef and cattle sustainability, these are key important topics that our customers. And, ultimately, the consumer are asking about. And we feel really good about what we're doing there, telling the story back up into the feed yard, but even further back into the ranch and to maintain and preserve resources and have focused on sustainability for the future.\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nThanks very much. Appreciate it. Thank you, guys.\n\nDonnie King -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Donnie King for any closing remarks.\n\nDonnie King -- President and Chief Executive Officer\n\nWe have a powerful and diverse portfolio across proteins, channels, and geographies. We are improving operational efficiencies and have a team that is positioned to take advantage of the opportunities in front of us. For these reasons, we are confident we will grow revenue and maintain strong profitability in fiscal year 2023 and have future long-term growth ahead of us. At Tyson, we're focused on making food affordable, accessible, and nutritious for customers and consumers around the world.\n\nThanks again for your interest in Tyson Foods. We look forward to speaking again soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrandon Tucker -- Senior Manager, Investor Relations\n\nDonnie King -- President and Chief Executive Officer\n\nJohn R. Tyson -- Executive Vice President and Chief Financial Officer\n\nAdam Samuelson -- Goldman Sachs -- Analyst\n\nShane Miller -- Group President, Fresh Meat\n\nDavid Bray -- Group President, Poultry\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nStewart Glendinning -- Group President, Prepared Foods\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nAntonio Hernandez -- Barclays -- Analyst\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nKen Zaslow -- BMO Capital Markets -- Analyst\n\nMore TSN analysis\n\nAll earnings call transcripts"
}