{
  "companyName": "Sun Country Airlines Holdings, Inc.",
  "companyTicker": "SNCY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/sun-country-airlines-holdings-inc-sncy-q3-2022-ear/",
  "content": "Sun Country Airlines Holdings, Inc. (SNCY 2.06%)\nQ3 2022 Earnings Call\nNov 01, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the Sun Country Airlines third quarter 2022 earnings call. My name is Liz, and I will be your operator for today's call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I will now turn the call over to Chris Allen, director of investor relations. Mr. Allen, you may begin.\n\nChris Allen -- Director of Investor Relations\n\nThank you. I'm joined today by Jude Bricker, our chief executive officer; Dave Davis, president and chief financial officer; and a group of others help answer questions. Before we begin, I would like to remind everyone that during this call the company may make forward-looking -- certain statements that constitute forward-looking statements. Our remarks today may include forward-looking statements which are based on management's current beliefs, expectations, and assumptions and are subject to risks and uncertainties.\n\nActual results may differ materially. We encourage you to review the risk factors and cautionary statements outlined in our earnings release on our most recent SEC filings. We assume no obligation to update any forward-looking statements. You can find our third quarter earnings press release on the Investor Relations portion of our website at ir.suncountry.com.\n\nWith that said, I would now like to turn the call over to Jude.\n\nJude Bricker -- Chief Executive Officer\n\nThanks, Chris. Good afternoon, everybody. We have much to be excited about in our 3Q results. I'm particularly pleased though with our performance operationally.\n\nSince July 1st, we've run a 99.8% controllable completion factor with 83% A14. Today, it's been 96 days since we had a cancellation. This would block our growth of over 15% versus the same quarter in 2019. Operational results like these are a team effort, and I'm really proud of what our folks were able to deliver after coming through a tough spring.Since the demand environment's rapid recovery began earlier this year, our focus of Sun Country has been to staff for growth to restore passenger fleet utilization to pre-pandemic levels.\n\nWe continue to find sufficient new hires to meet our goals. However, particularly in the case of pilots, we continue to work through training overhang. Last quarter, we were constrained primarily by first-star officers, this quarter captain availability has become the constraining input. As our rapid hiring works through our training program, we expect fleet utilization to continue to improve into the beginning of 2023.\n\nIncreased utilization is very valuable in this demand environment. Our scheduled service TRASM in 3Q improved versus 2019 by over 46%. Our TRASM improvement exceeds that of the industry as a whole due to our sculpted scheduling and the strength of the Sun Country's brand in our local market. Based on our sales for travel into 2023 in industry schedules, we anticipate yield strength to continue for the foreseeable future.In scheduled service, we're still seeing strength across all our markets, leisure, VFR, international, domestic, peak, and off-peak.\n\nOur charter business continues to show yield improvements as well. Due to the lower cost of incremental capacity adds in the strong yield environment, we expect margins to widen in the next year. The West Coast of Florida is an important destination for us, particularly in the winter travel season. Our thoughts go out to the people of that region as they work to recover from the tragedy of the Ian.\n\nFor Sun Country, anticipating the demand recovery to that region is challenging. Typically, Fort Myers in particular is an increasingly larger part of our network through our March peak. We've made cuts through the end of the year and continue to monitor bookings through the first quarter. Our customers will travel.\n\nHowever, we have less certainty about historically reliable demand. We've launched two new markets into Florida, and we'll redeploy capacity to other sunny destinations. However, the uncertainty is why we have a wider guide than usual for the fourth quarter. We expect the region to fully recover, and we'll be there along the way.\n\nOne benefit of our model that's good to highlight in a rising rate environment is our flexible fleet strategy. We buy used aircraft in the spot market, so prices will adjust to finance costs, global weakness, and a strong dollar. And the timing of our deliveries will be in response to our staffing levels. Based on our current fleet commitments, we expect the fleet to grow to 54 aircraft, while also reducing net interest expense in '23 over '22.\n\nTo summarize, we're not limited by opportunities, capital nor aircraft. And I'm pleased with the progress we're making on staffing 4Q and 2023 are setting up very well for us. And with that, I'll turn it over to Dave.\n\nDave Davis -- President and Chief Financial Officer\n\nThanks, Jude. Before I get into a discussion of our results, I want to point out that I'll be making comparisons about last year, as well as 2019, in some cases. We've been quicker to get back to a more normalized environment and year-over-year changes are often more indicative of our progress at this point. Sun Country posted an adjusted operating income of approximately $16 million for the quarter in an adjusted EPS of $0.12 per share.\n\nAdjusted operating margin was 7.2%, well ahead of our prior guidance. We achieved these results despite continued industry challenges, including third-quarter fuel prices being 75% higher than last year, lingering under capacity driven by staffing issues, and the impact of Hurricane Ian in the State of Florida. Let me start with a discussion of our revenue and capacity. Third-quarter revenue totaled $221.7 million, a 28% increase versus last year and 29% better than 2019.\n\nWe estimate Hurricane Ian drove about $1 million in lost revenue during the third quarter. Demand continues to be robust. Q3 scheduled service revenue was $152.5 million, a 34% increase year over year. Q3 scheduled service TRASM increased a very strong 39% versus last year, and 46% versus Q3 of 2019.\n\nScheduled service TRASM continue to improve within the quarter as July increased 33%, August 39%, and September 55% versus the same period last year. Total fare increased 16% versus last year to $167.73. Combination of higher fares and an increase in scheduled service load factor of almost 10 percentage points year over year is indicative of the strong leisure demand environment that we're -- that we continue to see. Charter revenue for the quarter was $42.9 million, a 27% increase year over year, driven by a large increase in flying under our long-term contracts, such as for MLS and Caesars.\n\nQ3 charter flying under our long-term contracts made up 80% of our charter block hours. While we've been able to sequentially grow our ad-hoc flying, capacity remains constrained as we focus resources on other flying. As we continue to make progress toward normalized pilot staffing levels, there's a large opportunity and simply returning to historical levels of ad-hoc flying. Versus the third quarter of last year, ad-hoc charter flying is almost 70% lower.\n\nCargo revenue for the quarter of $23.7 million was 3% lower than Q3 of '21. This reduction is due entirely to a one-time payment from Amazon in Q3 of last year for flying that had been done soon after we started our cargo operations but had not yet been billed. Total block hours grew 2% year over year and 15% versus 2019. Since Q3 of '21, our average passenger aircraft count grew 12% and our cargo aircraft count remained flat.\n\nAs was the case in Q2, we're still working through the process of expanding our pilot production pipeline. As such, the utilization of our fleet was 6.4 hours in the third quarter of this year versus seven hours last year. On a normalized basis, we expect aircraft utilization to be on the order of eight hours per day, which provides us with significant opportunity for very high-margin earnings growth as we return utilization to normal levels. We're planning for fleet growth through the remainder of 2022 and into 2023.\n\nThe aircraft we have already purchased, one entered service in Q3 and five more will enter service during Q4 and Q1 of '23. Additionally, we're in the process of acquiring three aircrafts to be delivered during Q4 of '23 and Q1 of '24. And those aircraft will enter service in early '24. We continue to pursue opportunistic purchases of aircraft to support our capacity growth.\n\nLet me turn now to costs. Our Q3 adjusted CASM increased 18% on flat total ASMs versus the same period last year. The increase in our nonfuel CASM is largely driven by the fact that our aircraft utilization remains lower than target in the impact of our new pilot agreement, which we signed at the end of last year. We paid an average of $3.93 per gallon for fuel in Q3 '22, to 75% higher year over year.\n\nAs a reminder, given our differentiated business model, we pass on approximately a third of our total fuel usage to our cargo and charter customers. We've been able to offset a large portion of our higher costs through continued growth and improved unit revenues. Turning now to our guidance for Q4. We're expecting to grow block hours between 9% and 12% versus the same period in 2021 as we've consistently seen leisure demand remains very strong.\n\nWe expect total revenue to increase between 27% and 33% year over year to $220 million to $230 million. At $3.75 jet fuel, we'd anticipate an operating margin of between 4% and 8% in the fourth quarter. We're giving a little wider guidance range in our numbers as usually the case. As Jude mentioned, we're still assessing the impact of Hurricane Ian on our bookings in Southwest Florida during Q4.\n\nFinally, we announced that the Sun Country board of directors has authorized us to repurchase up to $50 million worth of Sun Country's shares. Our intent is in the near term is to enter into a $25 million accelerated share repurchase agreement, allowing us to quickly acquire a portion of these shares. Apollo does not intend to sell shares as part of the buyback program. Our balance sheet is very strong, with $318 million in total liquidity as of October 31st, which includes $25 million in an undrawn revolver.\n\nAt the end of the third quarter, our net debt-to-EBITDA ratio was three times which is among the lowest for airlines in the US. We've invested heavily in our staff members, purchased the new aircraft we need to grow, and steadily paid down our aircraft debt as it comes due. We've used Sun Country's shares as a good investment, especially at current values, and we have sufficient liquidity to return capital to our shareholders in a prudent manner. We believe the fundamentals of our business remain strong, and as we continue to demonstrate our model is highly resilient to changes in macroeconomic conditions.\n\nOur focus is and will remain on profitable growth. With that, I'll open it up for questions.\n\nOperator\n\nAt this time, we will conduct the question-and-answer session. [Operator instructions] Please stand by while we compile the Q&A roster. Our first question comes from Ravi Shanker at Morgan Stanley. Your line is now open.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nThank you. Good afternoon, gents. Dave, your unique seasonality kind of gives you probably a little more kind of forward look than many of your peers maybe into '23 even. Can you give us an update on what your kind of booking curve looks like for like January or maybe even beyond that in the spring break if you're having?\n\nJude Bricker -- Chief Executive Officer\n\nHey, Ravi, it's Jude. We're selling through May right now and we've seen the fair improvements that we've seen in the reported period continue out through the entire selling cycle. So, you know, it's too early, obviously, to make predictions on year-over-three or year-over-TRASM improvements into that period. But there's no sign of any slowdown in the leisure space.\n\nKeep in mind, while we do have a leisure focus, we are fairly focused geographically, particularly in the wintertime with Minneapolis origination in the surrounding region into you know, sunny destinations across the south, Mexico and Caribbean. So, from what we're seeing, it looks really good.\n\nDave Davis -- President and Chief Financial Officer\n\nYeah, yeah. No slowdown like we sort of talked about previously, neither bookings or in TRASM growth.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nGreat. And then maybe as a follow-up, can you remind us what the economic sensitivity of the charter business looks like? I mean, it sounds like if you're shipping like sports teams around the country, it doesn't sound particularly macro-sensitive. But how has it done in previous recessions?\n\nDave Davis -- President and Chief Financial Officer\n\nI mean, I think particularly as the business is now configured, it's probably even more resilient than it has been in the past, which it typically is. I mean, the vast bulk of our flying now is under contract and that's under contract for things like Major League Sports, some casino flying, which proves to be pretty resilient during recessions. Some other sort of specialty stuff that we're doing under contract. So, I think it's probably very resilient -- in recessionary periods., you know, even some of the ad-hoc stuff, we think we can get back even if we sort of enter into a recessionary mode, the military stuff, and so forth.\n\nSo, that business I think is going to be -- will be strong in all conditions.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nVery helpful. I'll pass it along. Thank you.\n\nOperator\n\nThank you. Please hold while we prepare the next queue. The next question is from Duane Pfennigwerth. Duane, the queue is open.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nHey, thank you. So, maybe you could give us some detailed thoughts about 2023. But I'm just wondering, you know, hypothetically, if we had a blank sheet of paper, you know, where would you be deploying the most incremental capacity across the three segments? You know, where are you seeing the highest incremental margin opportunity across the three segments today?\n\nJude Bricker -- Chief Executive Officer\n\nScheduled service, particularly. So, it's a seasonal function. Hey, Duane, it's Jude by the way. Scheduled service in our peak periods, is clearly the best opportunity that we have.\n\nIt's also the one that's being cut the most due to crew availability because a lot of the other segments are long-term contracts, which is great. But it's also, you know, when we have these kind of really rapid yield recovery environments like we're in today, we can't put a lot of capacity into these peak periods. So, they're cut pretty heavily. But in the summertime, you know, it's our big city connectivity we really outperformed.\n\nI think that's consistent with what the whole industry is seeing. And in the wintertime, it's the very well-established leisure destinations that tend to consume a big portion of our network like Minneapolis to Cancun, Fort Myers, Orlando, Vegas, LA, Phoenix. And that's where -- that's where we put incremental capacity and it would -- it wouldn't affect the yield in those markets. And it could absorb a tremendous amount based on the bookings we're seeing.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nThat makes a lot of sense. Thanks for that. And then just on maybe charter and cargo, is you accounted for, you know, the same way across those segments and maybe within charter, do you have, you know, some charter agreements where, you know, fuel is a pass-through and others where it might be, you know, reported differently, just if you could help us think about how fuel flows through those two segments?\n\nDave Davis -- President and Chief Financial Officer\n\nYeah. So, on the charter side, it's typically not a straight pass-through. When an agreement is signed with a charter customer, there's typically a reference price that's inherent in the per block hour rate that the contract is set at. Then if fuel goes up, there is additional reimbursement from the charter customer, which is a revenue item.\n\nOn the cargo side, that is in fact a straight pass-through with Amazon paying for the fuel and therefore the fuel cost netting out not showing up in our fuel line.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nOK. Very clear. Thank you.\n\nOperator\n\nStand by for the next question. The next question is Thomas Fitzgerald with Cowen. Thomas, your line is live.\n\nThomas Fitzgerald -- Cowen and Company -- Analyst\n\nHi. Thanks very much for the time. Just two quick ones for me. I was just wondering if you could provide a little bit more color on just the hiring and training pipeline and how's that going.\n\nAs well, just also wanted to curious if you could just talk about the benefit you're seeing from highest interest rates that we saw the interest income line and it really jumped this quarter. So, thanks very much.\n\nJude Bricker -- Chief Executive Officer\n\nHey, Tom. Yeah, I mean, I'll take the last and first, which is just to say, I was just calling it out because it will be probably an outlier in the industry. And that is to say, we don't have any requirements for debt in support of any of our capex, and we don't have a lot of capex planned for next year. And also, with the spot market being the source of airplanes, we expect, you know, if you did see a global recession or, you know, even regional recessions around the world, then there would be more and cheaper airplanes coming available to our benefit.\n\nOn the first part, you know, we're hiring full classes every month. So, we're getting all the new hires we need, there's not a whole lot of, you know, adding to that wouldn't help us that much, because now we're to the stage where we have sufficient FOs, we just need to transition FOs into the captain seat. And the process is taking several months to kind of get through -- gearing up our new hire process into being able to handle classes of the side that we're doing about 20 to 25 a month, and then gearing up all the infrastructure we need in order to upgrade FOs into captains. So, that's ongoing.\n\nYou know, I think what everybody really wants to hear is when we're going to kind of get back to where utilization is what it is and the -- is what it was, and we have the pilots we need to fly this fleet to its optimal level. And we're still probably several months out, you know, say, six months until we kind of get caught up to ourselves. Keep in mind, the fleet grew for us about 70% since pre-pandemic levels, because we onboarded a whole cargo fleet through the pandemic. So, we got a lot of catching up to do and it's probably going to take us another six months.\n\nBut the encouraging part is, we build out the infrastructure, we opened a training center this month with two new SIMs. We have the SIM instructors, we have the check airman we need, we have the new hires we need. It's just about getting everybody through the pipeline. And so, we have line of sight on finishing up and get back to where we need to be.\n\nAnd, you know, a lot of my commentary is really around -- that flying that's going to be facilitated by that crew growth is really, really valuable in this environment. As we pointed out it's the flying that has been cut the heaviest because of crew shortages.\n\nOperator\n\nAll right. [Operator instructions] The next question is from Michael Linenberg. Michael with Deutsche Bank. Your line is open.\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nYeah. Hey, good afternoon, everyone. Well, congratulations on being the first to announce the pro-shareholder initiative. So, that's great in the industry.\n\nJude Bricker -- Chief Executive Officer\n\nThank you, Michael.\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nYep. You're welcome. With respect to the excise tax on share repos, does that -- that doesn't kick in until January 1st, 2023. Is that right? Or is it before that?\n\nDave Davis -- President and Chief Financial Officer\n\nNo, that's right. So, basically, we're structuring this is, is our intent when we don't have the paperwork totally finalized, but we're very, very close, is to do a $25 million ASR and then $25 million open market. the ASR portion, the shares at auction, the vast bulk of them will be delivered to us very quickly, which means, we'll basically be able to take possession before that excise tax kicks in on that full -- on that first 25.\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nGreat. That's fantastic news. My second question, Jude I just want to go back to, you know, you did call out captain availability, and I'm not sure if it's just that you aggressively hired a lot of first officers and that resulted in an imbalance on crews or if you're still seeing some more senior pilots defect to other carriers? Can you just elaborate on that?\n\nJude Bricker -- Chief Executive Officer\n\nYeah, that's the easy one. I mean, we're seeing attrition below what we had expected it to be. So, we're not losing captains. We're losing some FOs, but for the most part, our captains' attrition is de minimis, it's just about giving them into the less seat at this point.\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nOK, great. And then, Dave, I'll just squeeze in a quick one on cash taxes, when I think about, you know, some of the losses that you and others have incurred. I mean, you've been mostly profitable over the last year, year and a half, you were the first back to profitability. But should -- you know, your cash taxes, is that going to be still? That's going to be a very low rate when we think about from a cash flow perspective.\n\nI just -- if you can just remind us on your status on it. Thank you. Thanks for taking my questions.\n\nJude Bricker -- Chief Executive Officer\n\nThanks, Mike.\n\nDave Davis -- President and Chief Financial Officer\n\nYeah. So, the answer on the cash taxes piece is effectively we will be close to full cash taxpayers. And here-here's why. While we had a sufficient where we had a significant NOL that we sort of carried through from, you know, from many years ago.\n\nWe also have a TRA agreement in place with our largest shareholder where basically the value of that NOL is essentially paid out to the -- to our shareholders over, you know, as we generate earnings. So, effectively if you look at the cash flow of the business, we'd look like full cash taxpayers.\n\nOperator\n\nThe next question is from Christopher Stathoulopoulos from Susquehanna. Chris, you're live.\n\nChris Stathoulopoulos\n\nThank you. Good afternoon. So, Dave, the eight-hour utilization target you mentioned in your prepared remarks, is that based on the active fleet today or with the additional aircraft that you're planning on taking in? Also, what's the ceiling that you believe you can comfortably run the fleet at into 2020 upgrade?\n\nDave Davis -- President and Chief Financial Officer\n\nYeah, well the eight-hour number is sort of our -- is where we would like the fleet utilization to be. So, like I said, we're in the 6s now, we're going to be taking additional aircraft into service as we add pilots, that'll sort of stay flattish, and then start to drift up in 2023. And we ultimately hope sometime later in '23 to be at that eight-hour number.We were doing like nine-hour utilization numbers in 2019, which is probably unsustainably high because, at that time, we were doing some flying red-eye stuff and other things that really wasn't that great. So, we're probably not going to be doing that anymore.\n\nSo, I think if we're hitting eight hours utilization, that's where we need to be and that's a '23 into the second half of '23 number.\n\nJude Bricker -- Chief Executive Officer\n\nI will comment that our utilization is somewhat a function of the fuel price. So, as fuel prices rise, marginal flying is cut, and therefore, we were able to manage pass-through more effectively than most carriers. And as fuel prices fall, we can increase utilization to absorb the increased marginal opportunity. So, eight hours is kind of where we would like to be.\n\nBut, you know, that number could be higher or lower, depending on where fuel goes.\n\nDave Davis -- President and Chief Financial Officer\n\nYeah, and one other thing, I think, because it's -- you know, the model is a little bit different than some others. So, remember, the utilization is not a steady utilization day by day. It is very, very dependent on peak periods. So, into the --, you know, low teens hours per day utilization at peak times, and then significantly lower than that on trough days.\n\nSo, we're trying to keep the peak utilization as high as possible and the troughs are going to be lower troughs than they typically would be. And the average of those things is what's leading to the -- to the lower utilization than we want to see.\n\nChris Stathoulopoulos\n\nOK. And the follow-up, so, Jude, with the ATSA with Amazon, are there -- just remind us if there any contractual minimums with that flying? And then how soon in advance do, you know, how much you're going to be flying? So, for example, at this point, you have the schedule in place for this year's peak season. Thank you.\n\nJude Bricker -- Chief Executive Officer\n\nSure, Chris. So, there's no minimums., you know, right now the flying, because the pilots would be more efficient flying something else is probably, we would like to be a little bit smaller and, you know, in the immediate future. But there are no minimums in the contract. And in the schedule cycle isn't delineated clearly, but we're on a pretty good pace of about 90 days, for 90 days.\n\nSo, 90 days out, we're planning the schedule for the 90 -- 91st to 180th day, and that kind of repeats itself. And the schedule is very fluid, the volumes have been pretty consistent, but the schedule as to where the airplanes fly and when they go, it's pretty fluid. So, this -- these schedules move around quite a lot.And so, you know, I think one of the main things is that we're one of the carriers, the few carriers, perhaps, that can do this for them because it's so -- you know, it's also a schedule carrier where you're used to so consistent planning. It's just a very fluid environment in cargo.\n\nDave Davis -- President and Chief Financial Officer\n\nYeah. One other thing that to point out, though, is, while there are no flying minimums, the revenue from Amazon comes in the form of both a fixed payment per aircraft, not utilization-dependent, and then a per-block-hour number. So, while there aren't minimums there is a fixed payment for aircraft that we receive simply for operating the airplane.\n\nChris Stathoulopoulos\n\nOK. Thank you.\n\nOperator\n\nAll right. If there aren't any further questions, that does conclude our Q&A section of the call. I will now turn it back over to your CEO, Jude Bricker.\n\nJude Bricker -- Chief Executive Officer\n\nThanks for your interest, everybody. I hope you have a great afternoon, and we'll talk to you again at the end of the year. Thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Allen -- Director of Investor Relations\n\nJude Bricker -- Chief Executive Officer\n\nDave Davis -- President and Chief Financial Officer\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nThomas Fitzgerald -- Cowen and Company -- Analyst\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nChris Stathoulopoulos\n\nMore SNCY analysis\n\nAll earnings call transcripts"
}