{
  "companyName": "CarParts.com, Inc.",
  "companyTicker": "PRTS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/carpartscom-inc-prts-q3-2022-earnings-call-transcr/",
  "content": "CarParts.com, Inc. (PRTS 5.39%)\nQ3 2022 Earnings Call\nNov 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the CarParts.com third quarter 2022 conference call. [Operator instructions] Please note this call is being recorded. I would now like to pass the conference over to our host, Tina Mirfarsi, vice president of communications and culture. Please go ahead.\n\nTina Mirfarsi -- Vice President, Communications and Culture\n\nHello, everyone. Thank you for joining the call today to discuss our third quarter 2022 results. Joining me today from the company are David Miniane, chief executive officer, and Ryan Lockwood, chief financial officer. The prepared remarks and responses to your questions could contain certain forward-looking statements related to the business under the federal securities laws.\n\nActual results may differ materially from those contained in or implied by these forward-looking statements due to the risks and uncertainties associated with the business. For a discussion of the material risks and other important factors that could affect results, please refer to the CarParts.com annual report on Form 10-K and 10-Q as filed with the SEC, both of which can be found on the Investor Relations website. On the call, both GAAP and non-GAAP financial measures will be discussed. A reconciliation of GAAP to non-GAAP financial measures is provided in the CarParts.com press release issued today.\n\nWith that, I would now like to turn the call over to David.\n\nDavid Meniane -- Chief Operating & Financial Officer\n\nThank you, Tina, and good afternoon, everyone. As reported in today's release for Q3 2022, our team achieved our best third-quarter sales on record of $165 million, up 16% versus the same period last year and marking our 11th quarter in a row of double-digit year-over-year sales growth. On a two-year stack, revenues were up 37%. Like many throughout the United States, our customers are not immune from the inflationary pressures causing them to tighten their belts.\n\nHowever, we have two things working in our favor. First, many of our items are less discretionary as consumers push to keep their vehicles on the road longer. And second, we believe that as wallets continue to be pressured by high interest rates and inflation, some customers who will previously do it from e-customers will step into the do-it-yourself space in order to save money. Regardless of the circumstances that bring customers to CarParts.com, we remain committed to simplifying their journey and removing the stress from auto repair and maintenance.\n\nTowards this endeavor, our team has continued executing on our four areas of focus: outstanding customer service, operational excellence, financial discipline, and innovation. Number one, outstanding customer service. Whether it is placing an order over the phone with one of our trained agents or helping connect a customer to a certified mechanic, simplifying and removing the friction of auto repair is at the forefront of everything we do. We're excited to announce that we have successfully upgraded to a new customer service platform on CarParts.com that allows shoppers to get better support in real time with email and chat right from their mobile device.\n\nAs a reminder, over one-third of our e-commerce revenues come from repeat customers and we will continue to focus on improving our experience to get that number higher over the long term. Number two, operational excellence. Aligning people process and strategy with the needs of our customers is in our DNA. We continue to optimize our supply chain and invest in new tools to find operational efficiencies in our distribution centers, whether it is with inventory placement strategies or smarter technologies, we're striving to get more out of our current network to deliver a constantly improving customer experience while making our operation more efficient.\n\nOn the technology front, we're happy to report that we have officially completed our ERP upgrade. As many of you know, our legacy system was over 15 years old and we're extremely thankful for the amazing work of our technology and business teams over the last two years to get us to a best-in-class platform. Number three, financial discipline. Our business is built on positive unit economics.\n\nWe focus on optimizing the profitability of every transaction and maximizing gross profit dollars. While revenues and gross margin percentage may fluctuate, our overall goal is to always optimize for dollars. Internally, we like to say you can't deposit percentages in the bank. As reported in today's release, we generated another quarter of strong adjusted EBITDA of 6.3 million, up 173% from a year ago.\n\nIn times of market uncertainty, profitable growth and free cash flow generation are more important than ever and where we continue to focus our energy and resources. Number four, innovation. The path to disrupting our industry is by growing our addressable market and getting our customers to come back to CarParts.com for all their repair and maintenance needs. Last quarter, we launched a new do it for me capability on our website, where customers in select markets can see installation pricing and book an appointment for certain part names at a certified repair shop in their area.\n\nWe recently surpassed 1,500 bookings with this service and are finding from our customers that this is a compelling value proposition. Of course, it's still very early for this new solution, but we believe that continued momentum will allow us to refine and optimize the technology and logistics to provide a seamless customer experience. From a pricing standpoint in some cases, shopping on our website may offer customers an opportunity to pay less for parts and labor than they would for just the parts at a brick and mortar or dealership. We believe this is a highly compelling offering, especially in times when consumers are trying to be mindful of their spend and we are working on the messaging and test markets.\n\nRyan will now discuss our financial results.\n\nRyan Lockwood -- Chief Financial Officer\n\nIn Q3, we generated revenue of $165 million, up 16% from the prior-year period. On a two-year stack, revenues increased 37%. For the month of October, we continue to see double-digit year-over-year revenue growth. We remain committed to balancing growth, profitability, and free cash flow generation.\n\nGross profit for the quarter was $56.1 million, up 19%, with gross margins improving 70 basis points to 34.1% this year versus 33.4% last year in the same period. The improved gross margin continues to reflect purchasing and freight optimization, as well as our use of advanced pricing algorithms, all being driven by our data science and supply chain teams. Net loss for the quarter was $0.9 million mostly driven by non-cash expenses. Adjusted EBITDA in Q3 was up 173% from the same period last year to $6.3 million.\n\nOur unyielding focus on balancing growth with profitability and free cash flow generation resulted in a company record for third-quarter adjusted EBITDA. Now turning to the balance sheet. At the quarter end, our cash position was $16.7 million and our inventory was $155 million. As supply chain pressures ease, we will continue to reduce excess safety stock, which will flow to cash over time.\n\nAnd as a result, we believe we have ample liquidity and no intention or need to raise capital at current valuations. We continue to focus on self-funded growth. And at the end of Q3, we had $59 million available on a revolving credit facility with an option to expand to $150 million depending on our inventory levels. On the fulfillment side, we are now at over 1 million square feet of fully built-out warehouse space that can reach 98% of our customers within two-day transit time.\n\nWe continue to invest in best-in-class technology tools to drive operational efficiencies throughout our network, but most importantly, bring in the best talent to build a world-class supply chain. While we intend on expanding our footprint in the coming years to get closer to our customers, at this point, we see an opportunity to get more shipments out of our existing network. And with that, I'd like to turn it back to David for some closing remarks.\n\nDavid Meniane -- Chief Operating & Financial Officer\n\nThank you, Ryan, and everyone, for joining today's call. Q3 was the 11th quarter of double-digit year-over-year growth for our company. This performance would not have been possible without the incredible dedication from all our teams across the globe. We continue to focus on our customers, our people, and our core business.\n\nWe are grateful to be working with such an amazing group of people. There's a lot happening in the macroeconomic environment. We intend on balancing our investments to be more streamlined without compromising on building an extraordinary business and growing the intrinsic value of our company. We believe that this will benefit our shareholders in the years to come.\n\nWe see staying laser-focused on positive unit economics, free cash flow generation, operational efficiencies and delivering an outstanding customer experience as key to building an exceptional and durable company for our long-term stakeholders. Thank you again to all our team members for coming to work each day, ready to crush it. And as we say at CarParts.com, get after it. I'll now turn it over to the operator to open it up for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Thomas Forte from DAD Co.\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nDave and Ryan, congrats on a really good quarter. One question, one follow-up. So can you talk about your current marketing strategy and what your thoughts are at a high level on your current customer acquisition costs and maybe how that's faring versus recent trends?\n\nRyan Lockwood -- Chief Financial Officer\n\nSure, Tom. I'll take the first part. Generically speaking, as a percent of sales, ad spend was basically flat. From a marketing strategy basis, nothing has particularly changed.\n\nI don't know, David, do you want to elaborate?\n\nDavid Meniane -- Chief Operating & Financial Officer\n\nNo. I think a couple of things, Tom. Obviously, historically, we've been mostly focused on performance marketing. Now over the next couple of years, I think there's an opportunity to invest in customer experience.\n\nThe way we think about it is everything is part of an ecosystem. Like if you think of our supply chain, getting closer to the customer or our assortment expanding to have collision and mechanical parts on top of traditional marketing. I think there's an opportunity to bring all of this together to deliver an outstanding customer experience. And I think for us, it's still early, and there's an opportunity to capture more and more customers over the long term.\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nGreat. So for my follow-up question. It seems like you're doing an amazing job of operating the business as efficiently as possible to improve your near-term profitability. Are there other areas you've identified that could potentially improve your near-term profitability even more?\n\nRyan Lockwood -- Chief Financial Officer\n\nTom, thanks for the question. Obviously, for us, and as David already mentioned in his prepared remarks, we're laser focused on the balance between growth and profitability, specifically focusing on gross profit dollars. That obviously flows down to the remainder of the P&L. We're very, very laser-focused on how we allocate capital.\n\nAnd I think taking a step back for us, the number one priority is maintaining a strong foundation for the business, and we have no reason to raise capital at these levels. That's why financial discipline is so important to us.\n\nOperator\n\nOur next question comes from the line of Ryan Meyers from Lake Street Capital Markets.\n\nRyan Meyers -- Lake Street Capital Markets -- Analyst\n\nRyan, you kind of alluded to this a little bit over the last question. But given the strength that you guys had adjusted EBITDA this quarter, what was kind of the big driver that allowed you to sort of buck your seasonal pattern, whereas profitability is a little bit weaker in the second half of the year? And then do you sort of expect us to continue here in the fourth quarter?\n\nRyan Lockwood -- Chief Financial Officer\n\nThat's a great question. Back half profitability being a little bit lighter is really more specifically around Q4. All the carriers introduce a holiday surcharge and actually started earlier than ever this year. And then also, it's a little bit of the revenue weakness that you'll see at the top line in the fourth quarter because of people deferring spend to do Christmas purchases or travel.\n\nThird quarter, I think historically, we've had fairly OK profitability at the bottom line or fairly consistent.\n\nRyan Meyers -- Lake Street Capital Markets -- Analyst\n\nGot it. Makes sense. And then kind of as we think about growth maybe in the fourth quarter and then on the out year, is there any sort of change in the outlook, especially kind of as you guys focused a little bit more on profitability? Or are we still safe to assume this double-digit top-line growth for the foreseeable future?\n\nRyan Lockwood -- Chief Financial Officer\n\nSure. As I mentioned in my prepared remarks, first month of Q4, we continue to see double-digit growth. But at the end of the day, we really try to not let the tail wag the dog. Our focus is going to be on gross profit dollars and balancing that revenue growth and profitability through that focus.\n\nSo I think we'll kind of see how revenues turn out for the remainder of this quarter and next year. The real key is that we're focused on the profitability in a nominal basis and not worrying so much about the percentages.\n\nOperator\n\nOur next question comes from the line of Dillon Heslin from ROTH Capital Partners.\n\nDillon Heslin -- ROTH Capital Partners -- Analyst\n\nI wanted to pass on my congratulations as well. If I could start for the first one on operating cost. Just that's the second quarter in a row, I believe you've seen sequential decline. So I just wanted to talk about where you're getting that efficiency from and what's sustainable there, just given that in that same three quarters, you've actually grown your distribution footprint?\n\nRyan Lockwood -- Chief Financial Officer\n\nThanks. Great question. The way to think about operating expenses, the majority of our operating expenses are variable. So when we drive efficiencies through the business, whether it's marketing or fulfillment or call center, that flows to the bottom line.\n\nThe fixed portion, obviously, we try to maintain through generic financial discipline, such as making sure every head count is really going to add an ROI or every technology contract is going to have an identifiable ROI. So it's something that we're going to continue to do as we try to drive forward long-term profitability at the bottom line.\n\nDillon Heslin -- ROTH Capital Partners -- Analyst\n\nGot it. And as a follow-up, with the mobile mechanic, the 1,500 bookings, I think you mentioned. What is that on a base of like how many customers was that available to that actually like interacted with the offering?\n\nDavid Meniane -- Chief Operating & Financial Officer\n\nSo I'll cover the do it for me. So the 1,500 bookings that we had were traditional mechanics, so not mobile mechanic. It's us connecting a customer that's on CarParts.com is looking for a place or a mechanic to do that repair. It is 1,500 customer.\n\nEach booking is an individual customer. Now the way it's working right now is in test markets for certain part names. So it's a little hard to break out. But I think that over time, this is probably one of the biggest opportunities and the biggest game changer for our company.\n\nNow it doesn't contribute to the top line and probably won't contribute to the top line in 2023. But we made a big push to get this going. And the team has done an exceptional job. I think what it does is it really expands the total addressable market and the number of customers that we can reach.\n\nSo I'm glad you're calling it out because I think it's a big move for us. it's going to be a long-term process, and it's still very early, but I'm excited about it.\n\nOperator\n\nOur next question comes from the line of Ryan Sigdahl from Craig-Hallum.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nRyan, I appreciate the comments on October trends. Curious, I know it's only a few days week here in November, but anything notable from a directional at least trend line in the business in November thus far?\n\nRyan Lockwood -- Chief Financial Officer\n\nNothing notable. For us, again, going back to it, the focus is going to be on maximizing gross profit dollars. I don't want to get too hung up on the double-digit percentage. It's really about nominal gross profit dollars, the way we look at it internally.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nHelpful. As you look at the consumer activity, the data you have, anything jump out that surprised you either puts or takes? Have you seen any faster return to retail, so to speak, from consumers or within the online market share dynamics?\n\nDavid Meniane -- Chief Operating & Financial Officer\n\nYes. Ryan, it's David. I think, yes, if you're talking about the macro, I'm glad you're bringing it up because it's something that's been popping up a lot and want to make sure we address it. I think we're doing a lot of things right between our supply chain, our technology investments and the team that we've built over the last four years.\n\nBut to your point, like our customers are not immune to inflation. And we're definitely acknowledging the fact that the macro around us is changing or evolving. I think what's important is for companies like us, especially after experiencing hypergrowth or transformation is to acknowledge that the environment is changing. Now for me, I think we can keep the same aggressive mindset and be laser-focused on building a great business, but at the same time, kind of playing defensive moves and the fiscally conservative and create resilience in the business.\n\nSo we mentioned it a couple of times in the remarks. And I think I just want to emphasize the fact that the focus is on profitability, free cash flow, doubling down on the fundamentals and servicing our customers. I also think that you're going to see some of our competition not as ready for the macroeconomic environment as we are, and there might be an opportunity for us to capture market share. There's always an opportunity for us to take business away from our competition.\n\nAnd that's the intention. That's the focus for the next few years is let's take share.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nOn the do it for me test. So it sounds like good reception early from the customers. But what are you hearing from the repair shop partners that you're sending work to? What's their feedback?\n\nDavid Meniane -- Chief Operating & Financial Officer\n\nThe feedback has been pretty good. Ultimately, traditionally, the mechanics are not out there looking for business. A lot of it is local. So I think what we offer those partner mechanics as an opportunity to capture business that they wouldn't capture otherwise.\n\nThe other thing, too, is because they're not capturing the margin on the parts that they sell, we're allowing them to charge a slightly higher price and have the margin on the labor to make up for that loss. I think it's still early, but I think what I wanted to emphasize is that this is -- this is an initiative that we've been talking about for a while. And for the last 7 months, we've basically made like a big push. I wanted to make sure that people understand, yes, we have now over 1,000 customers that are going through the experience, and it's working.\n\nI think there's plenty more opportunities for us to grow that business. But at a minimum, we're starting to see traction and to see that there's a need for that.\n\nRyan Lockwood -- Chief Financial Officer\n\nYes. And, Ryan, if I -- Ryan, this is Ryan. If I can jump in. One thing that's interesting is even though the mechanic may charge a little bit more on the labor, our customers are still getting a huge benefit.\n\nSo I recently looked at one application, a customer through our website could get a headlight installed fully through one of our certified repair shops that we're partnered with and do that for cheaper than driving to a local brick-and-mortar, buying the park, coming home and realizing they don't know how to install it. So especially going to recession, I think that's a very compelling offering. So the mechanics are winning, our customers are winning. Obviously, we're going to sell more parts.\n\nIt feels like a very good offering for everybody.\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nYes. No. We're excited about the opportunity there. One more on pricing.\n\nSo we've heard a lot of your big box competitors basically say we've taken a lot of price hasn't impacted demand. We have pricing power and especially in the nondiscretionary categories that you guys primarily play in mechanical and collision especially so. So I guess, have you taken price? Do you think there's more opportunity to take price going forward?\n\nDavid Meniane -- Chief Operating & Financial Officer\n\nYes. I think it really depends on the part name and the category and the environment. Obviously, in November and December, typically you have a little less pricing power because to Ryan's point, some of the spend gets deferred. I think we've done a good job at building those -- the data science capabilities, and we constantly evaluate pricing basically in real time.\n\nA lot of times it goes up, sometimes it goes down. Net-net, I think we've done a pretty decent job at absorbing the impact of inflation and transportation costs. But it's a constant evolution. And obviously, we've got to focus on delivering an experience versus trying to be always the lowest price.\n\nSo I think the main focus for us now and long term is to figure more value to the customer in terms of quality, in terms of service levels and not just pricing.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTina Mirfarsi -- Vice President, Communications and Culture\n\nDavid Meniane -- Chief Operating & Financial Officer\n\nRyan Lockwood -- Chief Financial Officer\n\nThomas Forte -- D.A. Davidson -- Analyst\n\nRyan Meyers -- Lake Street Capital Markets -- Analyst\n\nDillon Heslin -- ROTH Capital Partners -- Analyst\n\nRyan Sigdahl -- Craig-Hallum Capital Group -- Analyst\n\nMore PRTS analysis\n\nAll earnings call transcripts"
}