{
  "companyName": "Turtle Beach",
  "companyTicker": "HEAR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/turtle-beach-hear-q3-2022-earnings-call-transcript/",
  "content": "Turtle Beach (HEAR 2.87%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the Turtle Beach third quarter 2022 conference call. My name is Daniel and I will be your operator for today's call. At this time, all participants are in a listen-only mode. Later we will conduct a question-and-answer session.\n\n[Operator instructions] Delivering today's prepared remarks are chairman and chief executive officer, Juergen Stark; and chief financial officer, John Hanson. Following their prepared remarks, the management team will open up the call for any questions. As a reminder, the conference call is being recorded. I will now turn the call over to Alex Thompson.\n\nAlex, you may begin.\n\nAlex Thompson -- Investor Relations\n\nThank you, Daniel. On today's call, we will be referring to the press release filed this afternoon that details the company's third quarter 2022 results, which can be downloaded from the investor relations page at corp.turtlebeach.com, where you'll also find the latest earnings presentation that supplements information discussed on today's call. Finally, a recording of the call will be available on the investors section of the company's website later today. Please be aware that some of the comments made during this call may include forward-looking statements within the meaning of the federal securities laws.\n\nStatements about the company's beliefs and expectations containing words such as may, will, could, believe, expect, anticipate, and similar expressions constitute forward-looking statements. These statements involve risks and uncertainties regarding the company's operations and future results that could cause Turtle Beach Corporation's results to differ materially from management's current expectations. While the company believes that its expectations are based upon reasonable assumptions, numerous factors may affect actual results and may cause results to differ materially. So, the company encourages you to review the safe harbor statements and risk factors contained in today's press release and in its filings with Securities and Exchange Commission, including, without limitation, its annual report on Form 10-K and other periodic reports, which identify specific risk factors that also may cause actual results or events to differ materially from those described in our forward-looking statements.\n\nThe company does not undertake to publicly update or revise any forward-looking statements after this conference call. The company also notes that on this call, they will be discussing non-GAAP financial information. The company is providing that information as a supplement to information prepared in accordance with the accounting principles generally accepted in the United States, or GAAP. You can find a reconciliation of these metrics to the company's reported GAAP results in the reconciliation tables provided in today's earnings release and presentation.\n\nAnd now, I'll turn the call over to Juergen Stark, the company's chairman and chief executive officer. Juergen?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nThanks Alex. Good afternoon, everyone and thank you for joining us. In the third quarter, we announced multiple new gaming and simulation products, made progress on our key strategic priorities and executed to deliver financial and operational results that were in line with our expectations against very challenging market and operating conditions. We continue to believe that the gaming market is a great market to be a leader in, despite the difficult year, driven by a slowdown in consumer demand, retail channel inventory reductions, heavy competitive discounting, a strong dollar and continued global logistics and supply chain challenges, including high freight rates.\n\nWhile these challenges persist, we are seeing signs of sequential improvement in the gaming market. Per MPD, the third quarter council gaming headset market in the US was down 17% year over year, comparing that to the second quarter of 2022, which was down 27% year over year. The third quarter showed some recovery. Additionally, the improved supply of new generation councils provided multiple months of double-digit growth in council hardware.\n\nAgainst this backdrop for our third quarter 2022, we delivered net revenue of $51.3 million, up 24% sequentially from Q2 and an adjusted EBITDA loss of $6.9 million versus a loss of $12.1 million in Q2. As you may recall, we faced a difficult comp from a year ago as our third quarter 2021 was at the second highest third quarter revenues in the company's history. As we discussed last quarter, in light of the poor macroeconomic conditions, we proactively and quickly took steps to reduce our operating expenses, which were down 16% on a recurring basis in Q3. In the third quarter of 2022, we continued our position as the number one council gaming headset provider again leading the category by far.\n\nOur new wireless models have done very well as five of the six models in our latest Stealth series of products made the top 10 list of best-selling wireless headsets. We also announced the availability of the multi-platform Stealth 600 and Stealth 700 Gen 2 MAX series, and the Stealth 600 Gen 2 USB gaming headset for PlayStation. The PlayStation models follow the successful launch of our Gen 2 MAX and USB models for Xbox earlier this year where both gamers and reviewers raved about the products. In fact, since our new Stealth wireless series launched, IGN one of the world's leading gaming and entertainment publications, reviewed the Stealth 700 Gen 2 MAX and gave it IGN's Editor's Choice Award.\n\nIGN also named the 700 Gen 2 MAX, the best Xbox series XNS gaming headset, as well as the best wireless Xbox headset. In our Rocket PC gaming portfolio, we've continued to expand our line of award-winning PC gaming mice, keyboards, and headsets with new products that deliver the performance PC gamer's desire and leverage RGB lighting to create the most beautiful desktop for gamers available. In August, we announced the availability of the new Kone XP Air wireless customizable RGB gaming mouse. The Kone's expertly crafted ergonomics deliver supreme comfort with great text specs, and showcase our IMO technology to create a unique 3D RGB lighting effect on the mouse.\n\nFor PC gaming and keyboards, we expanded ROCCAT's iconic Vulcan line with two new models, the Vulcan 2 Mini and the Vulcan 2 Max. Both models introduced ground bear breaking first-to-market features, including the world's first dual LED smart keys plus new Titan II optical switches. Beyond their ridiculously fast responsiveness, the new Titan II switches showcase ROCCAT's IMO RGB lighting better than ever. The Vulcan II MAX also comes with an innovative translucent risk rest, which combined with the dual LED switches is stunning.\n\nIn fact, the Vulcan II MAX has been named the most beautiful gaming keyboard by multiple leading gaming publications. The Vulcan II MINI is the compact version with a footprint 65% the size of a standard keyboard. Many keyboards are a rapidly growing segment, so we now have a great option for gamers wanting a keyboard in a smaller footprint. We also unveiled our flagship ROCCAT PC headset, the Syn Max Air, which delivers a premium wireless 3D audio experience perfect for gamers and streamers in need of high quality audio with unique RGB infused lighting.\n\nThe Syn Max Air combined decades of Turtle Beach's audio expertise and exclusive gaming audio features with ROCCAT's beautiful design. Great specs, meaningful innovations and stunning design are the pillars of our ROCCAT portfolio, and I'm convinced that our expanded portfolio enables PC gamers to create gaming desktops that are as stunningly beautiful as they are functional. We've been taking everything we know about running the world's best-selling council headset business, and putting that expertise into controllers. We continue to expand our controller family with additional products that offer game winning controls and features at a variety of price points and for more systems.\n\nWe added a new Arctic Camo colorway to the recon controller line and also launched the Recon React-R Gaming controller, which offers gamers many of the same features, but at a more affordable price. The response to our first wave of Xbox and PC controllers continues to be very positive. And from this, we've now launched our first cloud and mobile gaming controllers. The Recon Cloud hybrid controller, which takes the recon controller's excellent ergonomic shape, and adds a unique phone clip and lagged free Bluetooth, so gamers on compatible Android devices can experience the same game winning controls while gaming on the go.\n\nThe Recon Cloud also works as a wired controller with Xbox and Windows PCs and offers, offers gamers, Turtle Beach exclusive audio features like superhuman hearing. Our second mobile product is the recently announced Adam Controller. The Adam is an ultraportable mobile gaming controller with a unique versatile two piece design that fits any Android phone, the two pieces magnetically clipped together for compact travel. For the gaming simulation category, we launched the VelocityOne Rudder, which perfectly complements the award-winning VelocityOne flight yoke and throttle quadrant, and gives fans and enthusiasts the ultimate modern simulation control set up for large and small planes of every type.\n\nFor gamers that want to fly fighter jets and space simulation, we announce the VelocityOne Flight Stick, which combines the latest technologies with an incredible array of buttons and controls and customizable lighting to take flight sticks into the future. Leveraging our global business as a leading gaming hardware provider, the successful expansion and diversification of our portfolio over the past years from council gaming headsets into a broad array of council and PC gaming accessories is enabling us to continue to expand revenues outside of our market-leading council headset business to what we expect will be over 30% of revenues in Q4. I'll return with more commentary on the remainder of the year and thoughts on 2023 after John takes us through the financials. John?\n\nJohn Hanson -- Chief Financial Officer\n\nHey, thanks Juergen, and good afternoon, everyone. For the third quarter, revenue was $51.3 million down as expected from the second highest third quarter in our history. The year-over-year decline reflects lower demand as consumers cut back on their discretionary spend and retailers continue to reduce channel inventories. As we stated on the Q2 earnings call, we increase promotional program spend in Q3 due to these market conditions.\n\nIn the third quarter, gross margins were 14.1%, including an incremental inventory provision for potential excess component and product inventory relating to pandemic driven supply chain and logistics impacts. Excluding this provision, gross margins were 24.5% compared to 34.3% in the year ago quarter. The decrease was primarily due to the highly promotional retail environment, high freight cost and reduction in this fixed cost leverage. High freight rates relative to free pandemic levels reduced gross margins by roughly 5%.\n\nFreight rates have been declining recently, which will reduce that impact as products arriving at the lower freight rates move through inventory. Operating expenses in the third quarter were $21 million, compared to $27.8 million in the year ago period, a decrease of 24%. Third quarter recurring operating expenses declined 16% year over year. A result of the proactive expense management programs that we initiated earlier in the year, as well as alignment of expenses to lower market demand.\n\nOur third quarter adjusted EBITDA loss was $6.9 million, compared to an adjusted EBITDA of 6.7 million in the year ago period. The year-over-year variance is primarily driven by the items I've covered above, plus a $2.3 million adverse impact from foreign exchange. Adjusted net loss for the third quarter 2022 was $7.7 million or 47 cents per diluted share, compared to adjusted net income of $4.8 million or 26 cents per diluted share in the year ago period. We expect our effective tax rate for the full year to be approximately 25% and a Q4 share count of approximately $18.5 million and full year average share count of approximately $17 million.\n\nTurning to the balance sheet at September 30, 2022, we had $10.5 million of cash and $44.6 million of borrowings outstanding on our revolving credit line. Inventories at September 30, 2022 were $118.4 million, compared to $113.3 million at September 30, 2021. The elevated inventory levels reflect lower than expected consumer demand later than normal holiday load in and lower retail inventory levels, as well as our goal of maintaining product availability amid continuing global supply chain and logistics challenges. We continue to expect a significant reduction in our inventory by the end of the year as our inventory levels transition back to more normalized levels.\n\nAs we noted in the earnings release, the company intends to file its Form 10 Q pending completion of a goodwill analysis that may impact goodwill valuation on the balance sheet and have a non-cash impact on GAAP net income and GAAP EPS accordingly. Now, I'll turn the call back over to Juergen for some additional comments. Juergen?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nThanks, John. We expect the confluence of factors including consumer spending caution, channel inventory compression, abnormally high competitive discounting and exorbitant freight rates, which have impacted our business and many others this year to subside during 2023. That combined with strong new product launches and our proactive reductions in spend should enable us to return to revenue growth and positive EBITDA in 2023, even if consumer demand remains subdued. In light of the market and operational conditions we've discussed, we expect full year 2022 revenues to be approximately $250 million within, but at the low end of our previously communicated guidance range of $250 to $275 million.\n\nThis reflects an expectation that retailers will keep their inventory levels well below normal through holiday. We expected adjusted EBITDA to be approximately negative $15 million with gross margins in the mid-twenties range. I mentioned that the gaming accessory market is showing improvements in the year over year sell through comps over the past few months, and we believe those will continue into the fourth quarter, particularly given how weak the fourth quarter of 2021 was for gaming, We anticipate higher quality AAA game releases this year against poor quality launches last year. Indeed, the recently launched Call of Duty has much better reviews and just set a franchise record for opening weekend sales.\n\nThe supply of Xbox and PlayStation Councils is also showing improvement with double digit year over year growth the past few months, and as a good indication of continued gamer engagement. Steam just broke its record for concurrent users at over 30 million, which is up 12% from a year ago and has resumed steadily climbing since late July. Of course, we've also continued to expand and diversify our product portfolio, including multiple products added since Q4 last year. As I've outlined, we have been and continue to be very diligent on spending.\n\nAs discussed, we've produced opex earlier this year, despite running with an already lean structure for the full year, we expect to deliver roughly 13% in recurring opex reduction year over year with flow forward benefit into 2023. We have taken prudent and careful actions to reduce expenses where possible while continuing to develop, launch and market great products to position our business well for the future. Thinking forward to 2023, in addition to lower opex, freight rates have come down significantly, but those lower costs really start flowing through the p and l next year. While we don't expect freight rates to return to pre pandemic levels, we would expect the five plus percent gross margin impact to come down significantly with the resulting benefit to EBITDA.\n\nPromotional activity has been much higher than usual this year as the entire category has worked to reduce inventory levels. We expect that to improve in 2023 as inventories continue to come down, and we believe that the retail inventory reductions made in 2022 have reset retailer inventories to a very low level so that even flat sell through in 2023 would result in revenue growth. In fact, if consumer demand for gaming accessories starts to pick up, which we believe is possible next year, retailers may increase their inventory levels and thereby provide an incremental benefit to revenue. Just as retail inventory reductions this year are having an incremental negative impact on revenue, while it's difficult to predict macroeconomic conditions for 2023, we believe that gaming is a category can perform well even in a recession as it has in the past.\n\nAnd the industry analysts are forecasting growth in gamers and gaming markets, including DFC expect PlayStation five sales to set a record next year. Those factors combined with our continued strong product launches are why we expect revenue growth and return to positive EBITDA in 2023, even if consumer demand remains subdued. Our priorities right now are straightforward, deliver the best possible financial results in a very difficult and challenging environment while continuing to execute on our long term strategy to position us even better when the gaming market rebounds. The key pillar of that strategy remain the same.\n\nFirst, continue to lead the council gaming headset market where we have maintained leadership by far for 12 consecutive years. Second, continue to expand our PC gaming portfolio of headsets, keyboards, and mice, and grow our share in the 3.6 billion PC accessories market. Third, drive continued growth in gamepad controller and gaming simulation categories that we entered in 2021 and fourth, continue to identify and selectively evaluate other growth opportunities, including new product categories and expanding in target geographies as we have with Korea and Japan. The overall objective is to drive growth in line with our 10 to 20% annual long term growth target and do so at 10 plus percent EBIT margins.\n\nFinally, I want to thank the great team at Turtle Beach for their continued hard work and dedication. With that, let's turn to our Q and A.\n\nOperator\n\nThank you. [Operator instructions] And our first question comes from Jack Vander Aarde with Maxim Group. Your line is now open.\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nGreat. Thanks. Hi, Juergen. Hi, John.\n\nI appreciate the update. Thanks for taking my questions. So Juergen, I appreciate the helpful color on 2023. Just, wondering, maybe if I could dig into a little bit more just in terms of how you see it playing it out, how the year plays out, assuming consumer demand just gradually begins to improve and retail inventories are slightly increasing throughout the year.\n\nIs any particular seasonality changes in terms of revenue mix, how you'd expect that to balance out? And then I'll have a follow up.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nSure, Jack. Hi. First of all, on seasonality, it's always hard to judge as you go into the year. This year's been somewhat unusual with a very, you know, slow Q1 driven by a week Q4 for the whole category in holiday 2021.\n\nSo I think the best modeling assumption right now is that the seasonality will be normal next year, but I do believe that the overall market will continue to improve next year in gaming. A key barometer, by the way, for Q1 through Q3 next year is Q4 this year. Recall that that Q4 can -- has a -- is impacted by how well the games do and that a strong holiday typically foreshadows a strong Q1 through q3, and, and the opposite happens as well. If Q4 is weak, then the following year until the new games launch also are impacted by that.\n\nSo I mentioned that the new Call of Duty release has much better reviews and, you know, we were very pleased to see that that it's set an opening weekend record and also broke the record, I believe, on the PlayStation five store, so that that's a good first sign. There's more good games coming but I think that'll have a positive effect on 2023. One other important dynamic in terms of the top line that I mentioned you have this double negative effect when demand goes down because not only do you need to sell less products to retailers to fulfil the demand, but they also take their inventory levels down even if they maintain the same weeks of supply. Retailers haven't maintained the same weeks of supply on top of all of that this year.\n\nThey've reduced, you know, anywhere from two to eight weeks of supply from their normal targets that has a large incremental effect on revenues because on top of the decline in sell through and reduction in normal inventory, you're also not selling as they, as they wind their inventory levels, which are now well below normal. So we expect that they will retailers will run through holiday, conservatively and lean, not lean to the point of stocking out by the way, but just below, what we expect will be many weeks below their normal target levels. So if next year, I mentioned, even if sell through is flat next year, the fact that there's not that negative impact from additional channel -- retail channel inventory compression because you reach limits, the retailers can't keep taking weeks of supply out of their targets. And I -- we think we're at those limits now.\n\nAnd we could have a double positive effect as well. If sell through starts going up and they become a less conservative on the inventory, then you're selling in not only the higher consumer demand, but also an increase in the weeks of supply for retailers. So, sorry for the long answer, but that that's kind of an overview on the top of what we expect next year.\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nNo, I appreciate the added color and if assuming one of those is positive or even if you get the double positive effect, is there a chance we see 2023 revenue look similar to 2020 and 2021? Or we -- I guess I don't want to get ahead of my skis here, but it seems like that's possible if demand returns and these double positives play out.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nThat's going to depend a lot on how the overall economy does. That's why we were -- even citing that at flat sell through next year. So similar consumer demand, we'd still see a revenue increase. It's way too early before holiday to make a call on how the overall industry in the games environment is going to be next year.\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nGotcha. And just one more for me. You mentioned, as part of your long term plan and what you're focused on, you're exploring entering new product lines or categories, which you've done quite successfully recently. Just any idea of what you might be looking at or what, what can we maybe expect of a natural or something that makes sense that you don't currently have today?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nSure. So, this year late last year, we entered flight simulation as a new category and the first council controllers, and we obviously expanded our PC accessories line up and also launched a set of mics. So those are, some new categories next year or last year at an expansion in the PC category. This year we've continued to expand in PC and we've launched mobile controllers.\n\nSo those are what we just recently announced, that's a kind of a separate additional tam for mobile gamers. And one natural extension, which we fully have in the works for next year is racing simulation. Same types of products and skills and engineering that we've demonstrated the ability to do extremely well within the flight simulation category, really kind of raising the bar and redefining simulation products for flight simmers. And we're working on doing that with racing simulation with a target of sometime late next year.\n\nThere are other hardware categories, including controllers for other platforms that we'll look at. And, we've got kind of a strategic map of where else we can go that's complimentary to our current businesses, and like the rest of our expansions can fully leverage the global leadership position we've had for many years in council gaming headsets with all those retail relationships and all the fans we've generated from that.\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nExcellent. Well, I appreciate it, Juergen. Thank you. I'll hop back into queue.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nThanks, Jack.\n\nOperator\n\nThank you. Our next question comes from Andrew Northcutt with Oppenheimer. Your line is now open.\n\nAndrew Rogers -- Oppenheimer and Company -- Analyst\n\nHi, this is Andrew on for Martin. Thanks for taking the questions. I just have two. First, how should we think about the puts and takes for gross margins in 2023? And then second one, could you please comment on the choice of a new board member Terry Jimenez, and why haven't we seen a principal from [Inaudible] yet?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nSure. So on the gross margins, so this year's gross margins were heavily impacted by two factors. One is a very competitive promotional environment to reduce inventories. We expect that that will get better next year, so that should have some positive impact on gross margins.\n\nThe other big factor we discussed was high freight rates, and freight rates have come down quite a bit. Freight rates this year we expect will have an over 5% negative impact on gross margins. So we don't expect freight rates to go back to pre-pandemic levels, but they have been coming down quite a bit in the past few months, and you don't -- you won't see that in the P&L yet in Q4 because those products have to arrive, go through the inventory and get sold out to retail. So we'd expect gross margin impact from freight rates to start coming down next year.\n\nAnd both of those items have significant impact on gross margins. And then the new board member, Terry, he's joined now that is in place of a [Inaudible] person at their recommendation. So we've brought him on as the fourth new board member and he's joined our first board meeting last week.\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from Franco Granda with D.A. Davidson. Your line is now open.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nHi. Good afternoon everyone. Thanks for letting me ask a couple questions here. For Juergen, earlier in the call you talked about some of the new releases being beneficial to fourth quarter given into next year, if they do well eventually.\n\nAlthough there's a long way to go to be able to gauge how well the game will do, as you mentioned, Call of Duty just has the record first weekend. Have you seen any data on what that did for your own sales for the weekend?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nI won't comment on recent sales because we're covering the numbers through the end of Q3, but I will tell you that in the past when we've seen highly successful game launches or not successful game launches, it has a flow through impact on how the whole market does. It's not a direct impact. So we've had -- I remember some years ago, I believe it was 2016 but it might have been 2015, where Call of Duty sales were down something like 40% and the impact on the overall market for council giving me headsets was about 10% in Q4. So it's not a perfect comp, but there is, maybe about a quarter flow through into council headsets.\n\nThe reason for that, by the way, is that council had a lot of the sales are existing gamers who upgrade models throughout the year, and some new gamers and a highly successful game launch will tend to either prompt people who are gamers and you really want to have a headset for Call of Duty, because it's multiplayer and also attract some new gamers in. So for us, having Call of Duty have much better reviews and set some records right out of the gate is a positive indicator.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nI appreciate all that color. It's really helpful. So in that case, I guess it's your guidance for $2.50 for the year, does that contemplate what happened this past weekend with Call Duty or is that still to be a [Inaudible]\n\nJohn Hanson -- Chief Financial Officer\n\nNo, we're -- we take obviously our guidance reflects the latest available information, sell through channel inventory, all of that. We try to provide the most accurate read that we can with all of the latest information.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nGot it. OK, perfect. And then just one more from me. You recently announced a lot of products for mobile and obviously are you still growing your PC line-up quite a bit? Can you, I guess -- are you at the point where you could parse out the revenue composition across mobile console and PC?\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nSo we just announced and launched one, and I think the other product is still, we've announced it but it's still coming, two mobile controllers. So way too early to report anything on mobile separately. And note that while mobile, it's got a set of customers that are our mobile gamers, both -- or the recon cloud controller, which is really cloud and mobile also works on Xbox. It's kind of very, very unique in that -- you can get an Xbox a player who wants to use in an Xbox, but then has very good capability to take it with and play the same games on mobile that they play on the Xbox.\n\nSo it's also not clear that you can kind of clearly draw a line between those two. The expansion in the mobile is really just nice addition to the controller portfolio that allows gamers to be used using controllers for cloud and mobile gaming.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nGot it. And I guess I was referring mainly to the fact that you had already announced some mobile headphones earlier this year, but that's all right. That answers my question. Thank you so much.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nYeah, I get it. And same thing with mobile headphones, by the way. I mean, you can use them for non-mobile gaming, right? So it's just an additional product set to give our fans and our customers a way to also use products when they're solely mobile.\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nHelpful. Thank you.\n\nOperator\n\nThank you. [Operator instructions] I would now like to turn the conference back over to Juergen Stark for any closing remarks.\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nThank you. We look forward to speaking with our investors and analysts again next year on our fourth quarter earnings call, and we hope you all have a great holiday season. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlex Thompson -- Investor Relations\n\nJuergen Stark -- Chairman and Chief Executive Officer\n\nJohn Hanson -- Chief Financial Officer\n\nJack Vander Aarde -- Maxim Group -- Analyst\n\nAndrew Rogers -- Oppenheimer and Company -- Analyst\n\nFranco Granda -- D.A. Davidson -- Analyst\n\nMore HEAR analysis\n\nAll earnings call transcripts"
}