{
  "companyName": "Workday",
  "companyTicker": "WDAY",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/26/workday-wday-q2-2023-earnings-call-transcript/",
  "content": "Workday (WDAY -0.27%)\nQ2 2023 Earnings Call\nAug 25, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to Workday's second quarter fiscal year 2023 earnings call. [Operator instructions] And with that, I will now hand it over to Justin Furby, vice president of investor relations. Please proceed.\n\nJustin Furby -- Vice President, Investor Relations\n\nThank you, operator. Welcome to Workday's second quarter fiscal 2023 earnings conference call. On the call, we have Aneel Bhusri and Chano Fernandez, our co-CEOs, Barbara Larson, our CFO, and Pete Schlampp, our chief strategy officer. Following prepared remarks, we will take questions.\n\nOur press release was issued after close of market and is posted on our website, where this call is being simultaneously webcast. Before we get started, we want to emphasize that some of our statements on this call, particularly our guidance, are based on the information we have as of today and include forward-looking statements regarding our financial results applications, customer demand, operations and other matters. These statements are subject to risks, uncertainties and assumptions, including those related to the impacts of the ongoing COVID-19 pandemic and recent macroeconomic events on our business and global economic conditions. Please refer to the press release and the risk factors and documents we file with the Securities and Exchange Commission, including our 2022 annual report on Form 10-K and our most recent quarterly report on Form 10-Q for additional information on risks, uncertainties and assumptions that may cause actual results to differ materially from those set forth in such statements.\n\nIn addition, during today's call, we will discuss non-GAAP financial measures, which we believe are useful as supplemental measures of Workday's performance. These non-GAAP measures should be considered in addition to and not as a substitute for or in isolation from GAAP results. You can find additional disclosures regarding these non-GAAP measures, including reconciliations with comparable GAAP results in our earnings press release, in our investor presentation and on the investor relations page of our website. The webcast replay of this call will be available for the next 90 days on our company website under the investor relations link.\n\nAdditionally, our quarterly investor presentation will be posted on our investor relations website following this call. Also, the customers' page of our website includes a list of selected customers and is updated monthly. Our third quarter fiscal 2023 quiet period begins on October 15, 2022. Unless otherwise stated, all financial comparisons in this call will be to our results for the comparable period of our fiscal 2022.\n\nWith that, I'll hand the call over to Aneel.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nThank you, Justin, and welcome to Workday's second quarter fiscal '23 earnings conference call. I'm pleased to report that Workday delivered a strong second quarter, thanks to healthy demand across all product areas and geographies. Additionally, we closed on two of the larger deals that had pushed from Q1, which we referenced on last quarter's call. Our results, which outperformed across our key operating metrics underscore the continued importance of digital transformation for finance and HR.\n\nAnd even with the uncertainty in this environment, we remain confident in our long-term growth prospects because Workday continues to serve as a mission-critical partner to our customers with a proven track record of success. Before I turn it over to Chano, who will share more on our go-to-market success and Barbara who will provide specifics on our Q2 financial results and outlook, I'd like to share some second quarter highlights. We had another strong quarter for Workday HCM, where the migration to the cloud continues with notable customer additions, including Electrolux, First Student, Groupe Adeo, Korean Air, and Raymond James. And as always, customer success remains a key differentiator for Workday.\n\nIn Q2, we had several HCM go-lives, including Cox Enterprises, Southwest Airlines and United Overseas Bank. Turning to Workday Financial Management. We saw very strong growth in the second quarter as we added two Fortune 500 core financial management customers, and I'm very excited to share that one of those was Salesforce, the global leader in CRM. Already a longtime Workday HCM customer and partner, Salesforce's expanded use of Workday now includes Workday Financial Management along with accounting center, Workday Adaptive Planning, Prism Analytics and more.\n\nOur growing partnership reinforces the opportunity we have to help support customers in the cloud. With this broad relationship, Salesforce becomes one of an increasing number of high-profile customers to expand from Workday HCM to both HCM and financial management. Other new financial management customers in Q2 included American Electric Power, which was the second of our Q2 Fortune 500 wins, Apex Fund Company, Dave & Busters, Express LLC, and the state of Vermont, while key go-lives in Q2 included Comerica Bank, RSM and the University of Virginia. In addition to the strong growth from our core suite of HCM and finance applications, Q2 also saw notable momentum across our broader portfolio of solutions.\n\nWorkday Adaptive Planning recently celebrated its four-year anniversary as part of Workday, and I'm happy to share that we now serve more than 6,000 planning customers, including over 20% of the Fortune 500. It was also our second full quarter with VNDLY as part of Workday, and we're already seeing solid results as it's opening up new opportunities for us to expand our relationship with customers who want to embrace a more holistic workforce strategy. We also continue to see strong adoption of Workday Extend and Prism Analytics as both solutions are providing organizations, including the office of the CIO, with the ability to adapt in today's changing world. With Extend, customers build apps that are tailored for their unique use cases, which can eliminate the need for other custom development tools.\n\nOver the last year, we have more than doubled the number of customers and now have more than 750 applications that have been developed on the Workday platform. And Prism Analytics, with now more than 1,000 customers, is enabling organizations to bring operational data into Workday to drive real-time business insights. These solutions are not only critical to our customer community but are enabling a new level of engagement with our partner community as well. And speaking of our customer community, customer service has always been one of our core values.\n\nAs a result, we strive to maintain a customer satisfaction rating of over 95%, and I'm pleased to announce that in 2022, we surpassed this rating again as we have for more than a decade. This achievement is a direct testament to the amazing work of our employees and their commitment to helping our customers thrive. We look forward to sharing more about our product innovation, customer success and market opportunity in September at Workday Rising, our annual customer conference. This will mark the first time since 2019 that we're able to hold Workday Rising in-person, and we are so excited to get more than 9,000 members of the Workday community together in Orlando with thousands attending virtually for what is always a special event.\n\nIn closing, we had a strong second quarter and the first half of the year. While we recognize that the current environment will likely moderate the pace of growth in the second half of the year, we firmly believe that the strong gets stronger during periods of economic uncertainty. And we will continue to manage the business with that mindset and expectation, all in support of driving enduring growth for many years to come. With that, over to you, Chano.\n\nChano Fernandez -- Co-Chief Executive Officer\n\nThank you, Aneel, and thank you to everyone for joining today's call. I want to begin by expressing my sincere thanks to the entire global organization for an incredible Q2. Every one of our nearly 17,000 workmates really leaned in and drove this result, and I couldn't be prouder of our execution. Great job, team.\n\nOur strong Q2 results were driven by momentum across several of our key growth initiatives, including customer base, international, medium enterprise and the office of the CFO, a testament to our strategy and the significant long-term opportunity that we have ahead. In addition, as Aneel mentioned, we closed the two largest deals that slipped out of Q1. And while the near-term market environment remains uncertain and we are not immune to it, we continue to see organizations of all sizes prioritizing their investments with Workday to continue their digital backbone transformation and drive increased agility and flexibility. From a geographic standpoint, we executed incredibly well across our global markets.\n\nIn the U.S., we saw healthy growth in the large enterprise, including five Fortune 500 core HCM or FINS wins, and in the medium enterprise, our suite approach continues to resonate, driving another quarter of very strong results. International performance was again a highlight as our investment in key regions and the ongoing journey to the cloud are resulting in significant growth. In EMEA, we had outperformance across a number of key countries, including France, Germany and the United Kingdom. And finally, in APJ, we had very solid performance in strategic markets like Japan and Australia.\n\nAs you know, we go to market with land-and-expand sales motions, and both things drove healthy growth in Q2. Aneel already mentioned several of our core HCM and FINS wins, many of which were new customers to Workday. We also closed several strategic deals across our emerging land motions, including planning-first wins at ExxonMobil and Ninja Van and a Peakon-first led win at a 300,000-plus employee global organization headquartered in Europe. In addition to strengthening our land motion, our customer base sales teams in Q2 once again drove very strong results, including solid renewals and meaningful acceleration in new ACV with broad-based strength across a number of solutions, including core FINS, Extend, Peakon, learning, payroll and talent optimization.\n\nWe're also seeing momentum built within our planning-first customers who are expanding their footprint by adding core HCM and financials. Carle Health is a great example of this. They started as a planning-first relationship and expanded their footprint to include core FINS in Q2. Industry is another area of significant opportunity and investment, and I am pleased to share that financial services is our first industry to exceed $1 billion in annual recurring revenue.\n\nSome of our most strategic transactions and go-lives in Q2 came out of our financial services team, including new lands that Aneel referenced at Raymond James and Apex Fund, expansion deals at Bank of Montreal and Cushman & Wakefield and go-lives at United Overseas Bank and Comerica. Other established industries, including healthcare and education and government also saw continued momentum and we are gaining steam in verticals such as retail/hospitality and technology/media, where wins included Salesforce, Avalara and GoPuff. Needless to say, we have several other industries that are on the path to $1 billion and beyond. Our expanding partner ecosystem is becoming an increasingly important driver of our growth and industry success, and the excitement we're seeing within our partner community for the joint opportunity in front of us was on full display recently at Altitude, our annual partner event.\n\nStrategic system integrators such as Accenture, Deloitte, KPMG, and PwC are not only ensuring successful deployment, but also serving as an innovation engine addressing our customers' needs. Together, we're also targeting industry accelerators with specific solutions and use cases. We look forward to sharing a lot more on this at Workday Rising in a few weeks. As we move through the second half of the year, we expect the environment to remain uncertain.\n\nAnd we see signs that in certain deal cycles, particularly some of our more strategic opportunities, there is increased scrutiny and potentially longer sales cycles, as buyers do extra work before making investment decisions during these uncertain times. The good news is that when companies go through their due diligence, we typically come out on top, given the compelling return on investment and reduced total cost of ownership that our solutions provide, our track record of successful deployments of scale and our reference base of thousands of customers who can speak to the meaningful business value that Workday delivers. With that, I will turn it over to our CFO, Barbara Larson. Over to you, Barbara.\n\nBarbara Larson -- Chief Financial Officer\n\nThanks, Chano, and good afternoon, everyone. As Aneel and Chano mentioned, we delivered a strong Q2 as enterprises of all sizes increasingly realize the need for a flexible, modern finance and HR solutions to navigate their businesses and drive change during these uncertain times. Subscription revenue in Q2 was $1.37 billion, up 23% year over year, and professional services revenue was $168 million, up 15%. Total revenue outside of the U.S.\n\nwas $383 million, representing 25% of total revenue. 24-month backlog at the end of the second quarter was $8.37 billion, growth of 22%. The outperformance was driven by strong new ACV across both our land and expand sales motions along with solid renewals with growth and net revenue retention rates over 95% and over 100%, respectively. Total subscription revenue backlog at the end of Q2 was $13.47 billion, up 27%.\n\nOur non-GAAP operating income for the second quarter was $302 million, resulting in non-GAAP operating margin of 19.6%. Margin overachievement was driven by a combination of topline overperformance, the timing of certain projects and some favorable expense variances. Q2 operating cash flow was $114 million, which reflects typical seasonality from our annual merit cycle increase. In addition, with the final two days of the quarter falling over a weekend, we saw roughly $40 million of collections shipped out of Q2 into early Q3, which will have a positive impact on our third quarter cash flow.\n\nOur largest investments continue to be in our people and attracting top talent to Workday. During the quarter, we successfully added approximately 1,000 net new employees, ending Q2 with a global workforce of more than 16,900. Our hiring was focused on adding key talent across strategic growth areas of the business, notably go-to-market resources and product innovation roles. Overall, we're extremely proud of the strong companywide execution in Q2 and remain focused on leveraging our leadership position to drive sustainable 20% plus subscription revenue growth on our path to $10 billion in revenue.\n\nTurning now to guidance, which reflects the momentum in our business and the mission-critical nature of our solutions, while also balancing an uncertain macro environment, which Aneel and Chano described. With that context, we are maintaining our guidance for FY '23 subscription revenue of $5.537 billion to $5.557 billion, representing 22% year-over-year growth. We expect Q3 subscription revenue to be $1.418 billion to $1.420 billion, 21% year-over-year growth. We still expect professional services revenue to be $650 million in FY '23, as we continue to tightly align with our growing partner ecosystem to help ensure our customers have successful implementations that support the highest levels of customer satisfaction and business value.\n\nFor Q3, we expect professional services revenue of $164 million. We expect 24-month backlog to grow approximately 19% year over year in Q3. We now expect FY '23 non-GAAP operating margin of 19%, reflecting a more measured pace of hiring in the second half of the year as we continue to monitor the macroeconomic environment. Investing for long-term growth alongside ongoing expense discipline remains our priority.\n\nWe continue to have confidence in the strength of our business model and in achieving 25% non-GAAP operating margin and 35% operating cash flow margin at $10 billion in revenue. For Q3, we expect non-GAAP operating margin of 18%. GAAP margins for the third quarter and the full year are expected to be approximately 22 and 23 percentage points lower, respectively, than the non-GAAP margin. The FY '23 non-GAAP tax rate remains at 19%.\n\nWe're raising our FY '23 guidance for operating cash flow to $1.64 billion. We now expect capital expenditures of $450 million this year to support our customer growth and continued business expansion. As a reminder, during the third quarter, we plan to pay off the principal balance of our $1.15 billion convertible debt in cash. When this occurs, our non-GAAP diluted share count will decrease by roughly 8 million shares.\n\nDue to the late Q3 timing, this share reduction will not be fully reflected in our non-GAAP weighted average share count until Q4. And finally, I'll close by thanking our amazing employees, customers and partners for their continued support and hard work. We look forward to seeing you on September 13, either in-person or virtually, for our Financial Analyst Day, part of the broader Workday Rising program being held in Orlando, Florida, where we'll share more insights on our strategic product initiatives and long-term market opportunity. With that, I'll turn it over to the operator to begin Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from Kash Rangan with Goldman Sachs. Please proceed.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you very much. What a delightful way to spend Thursday afternoon, listening to your earnings conference call. Aneel and Chano and the rest of the team, a couple of things in my mind. One is previous quarter, you were one of the first companies to talk about deal slippage, etc.\n\nAnd how did that end up for this July quarter? What were the certain customer behaviors you saw in the month of July? And also, a question philosophically, as we open up and you have your first in-person user conference in a few years, what are the opportunities that are afforded to Workday as you enter calendar '23 as a result of doing all the in-person activities that you couldn't do as we were all working through this pandemic, be it growth rate acceleration, new product adoption strategy, what not. Just curious to get your thoughts. Congratulations, again.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nSo I'll answer the first part and then hand it over to Chano. We did not see a slowdown in July, Kash. We did have a few deals slipped from Q1 to Q2, but Doug Robinson and the team closed those deals. We are very cognizant of macro environment heading into the second half of the year, and so we are taking a cautious stance on hiring, but we didn't see any slowdown in July.\n\nIt was about as strong a month as we could have hoped for. Rising is a great opportunity for us. We always do better when we're in-person. It's just that simple.\n\nIt's a chance to get reconnected with customers, make sure we're doing a good job for them, but equally importantly, as the product portfolio has grown, it's a chance to showcase some of the newer products and have that customer base motion continue to thrive. So Chano, anything you want to add?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nThank you, Aneel. Thank you, Kash. As Aneel commented, we saw strength across the whole quarter from beginning to end, but we're clearly seeing more uncertainty and excluding the pipeline going forward. Regarding to Rising, we are very excited.\n\nAfter three years, certainly, and it's about ensuring great relationship with the customer community and that bodes very well with Workday. And clearly, as customer base becomes a larger part of our business, this is a more opportunity and a great opportunity for us to build some good pipeline.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nFabulous. Thank you. Congrats.\n\nOperator\n\nOur next question comes from Mark Murphy with J.P. Morgan. Please proceed.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you very much. It's impressive to see these two big Fortune 500 core financial wins. Do you get the sense that the COVID lockjam is somehow clearing up there, despite all the recession headlines? Or do you see many finance teams still kind of lacking the smooth sailing they might need to do a cloud migration? And perhaps, you would have a little extra core FINS pipeline building up that might get released at some point, if that's the case. And then, Barbara, just curious if there's any sense for the magnitude of change on the hiring pace that you're contemplating for the rest of the year?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nI'll ask Pete to answer the first question on the financial side. I'm sure there was definitely some pent-up demand, but Pete, do you want to --\n\nPete Schlampp\n\nMark, good to talk to you. Right now, from what we're seeing, we're not seeing any difference in demand for our HCM and financials from what we've been seeing in the past, and that's obviously good news as we saw here in Q2. But what we will say is, as we go into more uncertain economic environments which are likely happening, then typically in those situations, buyers on the financial management side tend to delay those deals a little bit longer. So that's just based upon our experience being in this market for a while, and that's what we're kind of expecting to have happen going forward.\n\nBarbara Larson -- Chief Financial Officer\n\nAnd then, Mark, it's Barbara. On your question on the hires, I'm not providing a specific target other than to say, we expect fewer hires compared to the first half in the second half. So we'll continue to be flexible and disciplined based on the environment we see in the second half.\n\nPete Schlampp\n\nUnderstood. Thank you very much.\n\nOperator\n\nOur next question comes from Kirk Materne with Evercore ISI. Please proceed.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nYeah. Thank you very much. I'll echo the congrats on the quarter. Actually, maybe this one, it sort of echoes Mark's question.\n\nBut I was curious, when you look at the pipeline build right now relative to what's -- you guys can't control what sort of happens at the end of the deal cycle necessarily. But I was just kind of curious if the macro is having any impact at the front end of the funnel? Are you still seeing the same number of deals come in? When Doug's talking about sort of companies may be taking a pause, is it sort of just at the end? And I guess, is there anything you can do to make your products more modular in nature so that they can continue through the process without getting sort of stuck at one point within the sales funnel.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nChano?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nThank you, Kirk. We felt good about the new pipeline build that we saw in the quarter across solutions and across geographies and barring any meaningful changes in the macro, we feel good about the pipeline we have for the second half. Certainly, we are never satisfied, and we are focused on continuing to build pipeline, particularly with some of the faster sales motions like our customer base motion and our land first motions because we can certainly create new opportunities, and we can still close them within the fiscal.\n\nOperator\n\nOur next question comes from Brad Sills with Bank of America. Please proceed.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. I wanted to ask a question about a comment you made earlier, Aneel, on a couple of the FINS wins being planning-first customers. Is there another set of the installed base of other modules around FINS that's brewing here that we could also see some upgrades that could come from? And then just any commentary on that planning-first pipeline as kind of a leading indicator potentially for more FINS additions.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nYes. Well, we're now up over 6,000 planning customers, and each one of those to me is an opportunity to sell our core financial products. And that is probably the one land product in the world of finance that we can go in with first and have it be meaningful. And it's played out that way, and it plays out the way more and more.\n\nThe more we get into financial planning and we continue to workforce planning, but the more we do financial planning, it's a great way in. But that's probably the one app that's our lead into core financials.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Aneel.\n\nOperator\n\nOur next question comes from Michael Turrin with Wells Fargo. Please proceed.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHey, there, and congrats on the results here from me as well. You started somewhat an investment cycle ahead of all the uncertainty. I'm just wondering if there's anything you'd point back to that you're finding is able to provide a bit of a favorable offset. It sounds like you're not seeing as much of the shift in buying behavior as others across software pointing to? And maybe as a second part of the question, if you do see demand signals start to slow, you did have some comments suggesting second half growth could still moderate.\n\nHow quickly are you able to toggle toward expense control and dial back as needed?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nThank you. What I'd say on the first part of the question, we know -- who knows how the future is going to play out. But I think one thing that's different about Workday and some of the other cloud companies is that we're still very lightly penetrated in our installed base. When I look at how much revenue we drive, it's not as high as some of our peers in the cloud, and so that's always a good place to sell during tough economic times.\n\nYour customers are already committed to Workday. They're already happy, and there -- and so I would say, we're less about toggling about expenses, more about toggling to a different sales strategy. And then, I think what we're also doing is, we're dusting off the TCO analysis that we used to do many years ago during the '08, '09 collapse where we had to prove out our TCO in order to even get invited to the game. This market has not been about TCO, it's been about digital transformation, but we do have a very compelling TCO story as well.\n\nChano, Pete or Barbara, you want add anything? Do you want to talk about the expenses, Barbara?\n\nBarbara Larson -- Chief Financial Officer\n\nYes, I think on the expenses, as we said, we're moderating the pace of hiring in the second half -- being cautious going into the second half, but we're going to continue to add resources. At the same time, we're going to be flexible based on the environment we see in the second half. So we feel confident if we need to toggle some of that hiring down in the second half that we can do that.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Keith Weiss with Morgan Stanley. Please proceed.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nExcellent. Thank you guys for taking the question, and really great quarter you guys put up. And I think you could probably see kind of in all our questions -- a lot of us are trying to figure out like how do you guys pull this off while a lot of other of your peers are struggling? And Aneel, I think you're trying to get at it and you're talking a little bit about being more likely penetrated into the base. I was wondering if you could expand on that because a lot of us think of you guys as having a really good presence and a big presence in HCM, particularly in the U.S., maybe a little bit less so in Europe.\n\nBuilds are definitely on the come. What do you mean by lightly penetrated in the days? It's just that there's a lot more to upsell and a lot more product to give to your customers. Can you give -- and why is that such an advantage at a time like this?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nWell, I would just echo what I said in the previous answer. A happy customer is always an easier sale than a net new customer that doesn't have experience working with you. In terms of penetration, I'll turn that over to Chano to talk about where we are. Chano and Doug really were the drivers of our back to the base motion, and it's still relatively new for us.\n\nIt's only a few years old versus, I think, other companies have had it more land and expand where we don't really have that opportunity. We land expanded and then we want to add more modules. Chano?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nYes, that's correct, Keith. I would say first that our key growth drivers played out well during the quarter, both customer base, international, the office of the CFO, and media enterprise, they all behave pretty well across geographies and across different solutions. In terms of the penetration, as you know, we've been focusing more on the customer base because we've been heavily net new during a very long time, and we've been doing investments there that are paying off. And clearly, we've also been innovating and adding a significant number of solutions.\n\nSo as Aneel was saying, when customers are happy and seeing value and we are focusing on showing the return on investment on those solutions, they tend to buy more and that is exactly what is happening across the segments. And clearly there, our penetration is lower when you compare to other peers that have been more heavily focused on customer base for a longer period. But I would say, both of the net new logos and customers we've never done business with and customer base behaves very strong this quarter. Having said all that, as we are saying, we're starting to see a bit more scrutiny, particularly on the larger deal cycles where customers will go a little bit more to another cycle of approval or a better reassurance of the full implementation projects or whatever that most likely will inventing or potentially some of the sales cycles on the larger transformational transactional deals around each financials.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nGot it. And if I could just sneak in a last one for Barbara. You guys have talked about sort of more conservatism in the back half guidance. And I'm assuming the outperformance that you guys saw in Q2, particularly in like that 24-month backlog, would have normally translated into sort of a raise of the guidance and you didn't raise the guidance.\n\nCan you give us some kind of sense of the magnitude of that conservatism in the back half now?\n\nBarbara Larson -- Chief Financial Officer\n\nYes. I'll just say, coming off a quarter as strong as Q2, we would have liked to have been able to raise our outlook for the full year. But while we outperformed and the business remains resilient, we also see evidence of increased scrutiny in certain sales cycle. So our outlook assumes a continuation of this in the second half.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nThat was very helpful.\n\nOperator\n\nOur next question comes from Alex Zukin with Wolfe Research. Please proceed.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys. Since Keith asked both of the exact question I was going to ask, I'll try to basically do it kind of go at it a different way. It feels like, Aneel, what you're saying is that there's a lot of surface area that you have left to kind of go after inside of your client base. And based on the TCO analysis, I'm assuming there's also an opportunity for a lot of your customers to consolidate, particularly on the HCM side from many point solutions to a platform, how is that message kind of resonating in your conversations? And how long before that type of a playbook can be run at the financials level? I realize and obviously, you're going in with the full suite right away.\n\nBut just walk us through those dynamics, if you could.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nWell, I'll just offer up a high-level view that happy customers are the most important thing that we have, right? I mean if you have a happy customer, they're just inclined to buy from you. And what we've seen, especially in large enterprises, they typically don't tie the HR and financials decision together. There are separate decisions, and a lot of these solutions like planning are also separate decisions. So as long as we keep that base happy, when these customers look for new solutions, we do have quite a bit of surface area, especially in the HR base, where we've got over, I think, 4,000 HR customers and 1,400 finance customers so that you can just see where that gap is.\n\nBut also every time we come out with a new module, that's either something we built or an acquisition, it's an opportunity to go back to that base.\n\nPete Schlampp\n\nOne thing I'd add there, Aneel, just to give everybody some perspective on it is we've got 22 SKUs in our HCM portfolio, and we've talked about the fact that 14 of them have been made generally available in the last four years, just to give you some perspective on that. What you can read into that is, you've got a large percentage of SKUs that are not penetrated into that base yet. It's what we've been working on for years, and we do -- just to repeat again what Aneel and Chano said, which is focusing on making our customers happy, delivering the value that we've been talking about delivering to them, makes them want to buy more things from us. And so, that's a key part of that strategy.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. And then, maybe just as a follow-up. I want to clarify because I want to drill in on this. Aneel, it sounds like what you're saying is July has been really good, but then from what I think Chano and Barbara are saying is that there is more scrutiny on sales cycles.\n\nThere's more conservatism in the guide. But I guess, is that something you're actually seeing or you are preparing to see and adding a kind of heightened level of conservatism in the assumptions that you're making around close rates in pipeline generation, etc.?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nI think Chano is best to answer that one.\n\nChano Fernandez -- Co-Chief Executive Officer\n\nYes. Alex, I will reassure July has been very strong. But in terms of the sales cycle moving forward, particularly in some of the larger ones around HCM and FINS, we are seeing some more scrutiny or grade in those sales cycles. As you can imagine, some of those cycles are long.\n\nSo we definitely have different stages that they move from one to another, we can get some milestones. And it's kind of easy for us to check on the pace that those deals are moving. And as you can see, some of things are clearly and lengthening or potentially lengthening on the sales cycle.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nGot it. Perfect. Thank you, guys.\n\nOperator\n\nOur next question comes from Scott Berg with Needham. Please proceed.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Congrats on a good quarter, and I'll change it up from the macro questions at the moment, leave those for later. I had a question on the announcement during the quarter about your new FedRAMP status, in particular at the moderate security impact level. How should we think about that opportunity in Fed? I know you guys had some general success in the government angle as a whole throughout the domestic United States, but is that something that can be meaningful over time? Or is it really just kind of a maybe a smaller incremental opportunity?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nIt can be very meaningful over time, but it's going to take some time for it to develop. Those sales cycles are longer than commercial sales cycles. They always have been. And so, now as we have gotten that FedRAMP certification, now the sales cycles begin and they can be 12, 18, 24 month sales cycles.\n\nBut it's a meaningful opportunity. There's a lot of ex-PeopleSoft customers still running PeopleSoft there. So it's one that we invested in because we see it as a big opportunity, but also going to be patient in that it takes a while for the pipeline to develop. Pete, do you want anything?\n\nPete Schlampp\n\nI think you said it very well. We see it as an over $2 billion opportunity for the business, and something that we've been investing in for a while. It will take us some time to see that pay off because of these longer sales cycles. And we're -- I think also the government is -- should be a great customer for us, another customer that we can sell more things into than just core HCM over time.\n\nOperator\n\nOur next question comes from Brent Bracelin with Piper Sandler. Please proceed.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGood afternoon. Thanks for taking the question. Obviously, with increased scrutiny around larger deals, I appreciate that, but we're also seeing belt tightening across the broader enterprise. My question here with your focus around cross-sell, what's the narrative around cost savings, vendor consolidation to bundle HCM and FINS.\n\nWith some of your larger customers, you're starting to get some high higher-profile Fortune 500 wins there. Love to hear if there's an appetite to further consolidate vendors from a cost savings perspective to bundle HCM and FINS, specifically with some large U.S. customers.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nWell, that trend is definitely happening, and we saw it happen with a series of big financial wins in the second quarter, but I wouldn't underestimate the strength of our medium enterprise business. And I don't see the same belt tightening in the medium enterprise business, and they tend to buy the whole platform. So it's a pretty healthy market for us. It's kind of our run rate business, and they tend to want to have fewer vendors as possible because they don't want to spend all the money on best-of-breed and integration.\n\nChano, anything you want to add?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nVery well said, Aneel. I would just say that some of the larger customers, they do retire double-digit number of legacy systems. So what we're trying to do right now, as Aneel was mentioning before, is ensuring that they understand very well the total cost of ownership and the benefits that our solutions will provide and the return on investments. And of course, we're getting in contact with other customers that have already implemented and really seen those become intangible.\n\nSo that's the playbook we are putting in play. We've gone before some of these downturn cycles. Some of us are unfortunately old, but there is an advantage of that at times. And the whole management team, and we've seen that working before, as Aneel mentioned.\n\nSo we're playing that playbook.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nAppreciate the color. Thank you.\n\nOperator\n\nOur next question comes from Brad Zelnick with Deutsche Bank. Please proceed.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Thank you so much for taking my question and congrats on a great set of results. I want to follow up on Keith and Alex's line of questioning about happy customers, but also maybe from a little bit of a different angle. As you presumably still have the large renewal cohort flowing through the model that we talked about last year, is the current environment in any way impeding the magnitude of expansion that you would otherwise expect upon renewal? And in fact that factoring into what appears to be a conservative backlog guide for Q3 understandably so, just given the environment.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nBarbara?\n\nBarbara Larson -- Chief Financial Officer\n\nSo for the backlog guide in Q3, our guidance takes into account the best view of the business that we see it today and that's reflected in our 24-month backlog guide for Q3. Keep in mind, the timing of renewals can fluctuate from quarter-to-quarter and have an impact on that backlog growth. And if you recall at the beginning of the year, we did discuss our expectation for the renewal base to return to a more normalized rate of growth for the full year, which continues to be our view.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Any color, though, on just the expansion rate that you're seeing upon renewal?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nIt remains very strong, Brad. I think it is a testament to the mission-critical of our applications and the customer satisfaction and the renewal ratios remain very good and very healthy across the board.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nExcellent. Fantastic to hear. Thank you.\n\nOperator\n\nOur next question comes from Ari Terjanian with Cleveland Research. Please proceed.\n\nAri Terjanian -- Cleveland Research Company -- Analyst\n\nGood afternoon, and thanks for taking my question. Congrats on the results. Just wanted to follow up on some of the Fortune 500 wins in the quarter. What do you think finally drove those to go over the goal line? And more broadly, what's the timeline you're thinking about for go-lives for those? And the reason I'm asking, just wondering when -- if and when you think there could be more of a halo effect from some of these higher profile wins?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nI'm going to assume you mean on the finance side because on the HR side, we've always had a stream of Fortune 500 wins. And I think at this point, we're over 50% of that -- well over 50% of the Fortune 500 running us for HCM. On the finance side, I think it's a combination of the systems aging. It's a combination of our product becoming more mature, new products like accounting center that are really strategic to customers and Prism Analytics.\n\nSo now we've got the full suite, and people have to modernize. They really don't have a choice. But I don't -- I mean, I think this is -- it's just a healthy run rate business as opposed to this moment in time where it's going to go through the roof or I don't -- it's not that kind of business. But the more data points we have of customers choosing us than going live, obviously, the better we are.\n\nComerica went live this past quarter. That was -- that's a fantastic reference for us. A big regional bank going live is a great data point for us. Most of these projects are 12 months to 18 months.\n\nIt all depends on the scope of what they're trying to do, and so it's a pretty reasonable time frame to get these projects live. If it's a smaller scale implementation, just core accounting, it can be done in less than a year. But if it's a series of modules, 12 to 15 to 18 months is pretty reasonable.\n\nOperator\n\nWe have time for one more question, and our final question will come from DJ Hynes with Canaccord. Please proceed.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, congrats on the quarter. Chano, when you talk about scrutiny on deals, we've heard that from a lot of companies now. For Workday, what exactly does that mean? I mean, is it haggling on price? Is it more reference checks? Is it about implementation timelines and processes? Like what's involved there? Any color would be interesting to me.\n\nChano Fernandez -- Co-Chief Executive Officer\n\nYes. Thank you for the question, DJ. It can vary, but you can think about it sometimes. It's just more scrutiny around the implementation time frame and the readiness they have on their side or on the partner side or on our side in terms of resources.\n\nIt also means many times prioritization on projects, and which usually that happens, we typically come on top because we are mission-critical and because again, on the ROI and the TCO, but you are competing other project. It also means an additional level of approval or two additional levels of approvals of going up to the board, depending on the level of approval. So those are some of the things that it typically means around business case, around management approvals around prioritization of projects and around reinsurance in terms of success and implementations and availability of resources and cost of opportunities and impact on potentially other investments or opportunities they are managing or considering.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYeah, yeah. OK. It makes sense. Thanks for the color.\n\nOperator\n\nI will turn the call back over to management for closing comments.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nEverybody, have a good night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJustin Furby -- Vice President, Investor Relations\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nChano Fernandez -- Co-Chief Executive Officer\n\nBarbara Larson -- Chief Financial Officer\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nPete Schlampp\n\nKirk Materne -- Evercore ISI -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nAri Terjanian -- Cleveland Research Company -- Analyst\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nMore WDAY analysis\n\nAll earnings call transcripts"
}