{
  "companyName": "Algonquin Power & Utilities Corp.",
  "companyTicker": "AQN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/algonquin-power-utilities-corp-aqn-q2-2022-earning/",
  "content": "Algonquin Power & Utilities Corp. (AQN -0.76%)\nQ2 2022 Earnings Call\nAug 12, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to the Q2 Algonquin Power & Utilities Corporation earnings call. [Operator instructions] I would not like to turn a call over to Amelia Tsang. Please go ahead.\n\nAmelia Tsang -- Investor Relations\n\nThank you. Good morning, everyone, and thanks for joining us this morning for our second quarter 2022 earnings conference call. Presenting on the call today are Arun Banskota, our president and CEO; and Arthur Kacprzak, our chief financial officer. Also joining us this morning for the question-and-answer part of the call will be Jeff Norman, our chief development officer; and Johnny Johnston, our chief operating officer.\n\nTo accompany our earnings call today, we have a supplemental webcast presentation available on our website, algonquinpowerandutilities.com. Our financial statements and management discussion and analysis are also available on the website as well as on SEDAR and EDGAR. Before continuing the call, we would like to remind you that our discussion during the call will include certain forward-looking information, including, but not limited to, our expectations regarding earnings, capital expenditures, pending acquisitions, asset recycling, growth, and pending legislation. At the end of the call, I will read a notice regarding both forward-looking information and non-GAAP measures.\n\nPlease also refer to our most recent MD&A filed on SEDAR and EDGAR, and available on our website for additional important information on these items. On our call this morning, Arun will provide an overview of our Q2 performance. Arthur will follow with the financial results, and then Arun will conclude with an update on our strategic plan for the business. We will then open the lines for questions.\n\nI ask that you restrict your questions to two and then requeue, if you have any additional questions to allow others the opportunity to participate. And with that, I'll turn it over to Arun.\n\nArun Banskota -- President and Chief Executive Officer\n\nThank you, Amelia, and a very good morning to those who have been able to join us on the call and online. I am pleased to report that we are on track with the following key financial metrics. Q2 adjusted EBITDA was $289.3 million or 18% increase year over year, and our Q2 adjusted net earnings per share was $0.16, compared to last year's $15. We reported a strong second quarter as our businesses delivered solid operations, which Arthur will go into more detail.\n\nWe see ourselves as a business built from long-lived assets and strong operations, and we've consistently been able to produce stable financial results. We remain confident in our plans to continue delivering strong returns to our shareholders. We continue to focus on Algonquin's three strategic pillars, growth, operational excellence, and sustainability. And I will provide more details on each of these pillars.\n\nWe have high confidence in our five-year $12.4 billion capital plan, given the large proportion of growth that is organic and the number of growth levers we have. One of the most important growth levers in our regulated business is deploying capital to benefit our customers and investing in our rate base. In the second quarter, the Missouri Public Service Commission issued its final report and order resulting in a total revenue increase of $39.5 million with new rates implemented on June 1, 2022. We believe the settlement represents a fair outcome for customers and the company.\n\nAlso during the quarter, Senate Bill 745 was signed by the Governor in Missouri, which modifies Plant-In-Service Accounting or PISA. This bill also puts into law, a property tax tracker, which is expected to enhance our Missouri utilities ability to earn their authorized returns. Another growth lever on the regulated side is from our acquisitions. As many of you know, earlier this year, we closed on the acquisition of Liberty New York Water, which services over 127,000 customer connections across seven counties in Southeastern New York.\n\nWith the close of Liberty New York Water, the water sector currently represents approximately 45% of our total customer connections or approximately 15% of the regulated business EBITDA and is our fastest growing modality on this measure. Given the increased need for clean, safe, reliable water, and wastewater services, especially in states like Arizona with a growing population, we have started construction of a wastewater reclamation facility with a capacity of 4 million gallons per day, next the pending 2.8 billion acquisition of Kentucky Power Company and AEP Kentucky Transmission Company. First, we want to extend our thoughts to the many individuals and families who have been impacted by the recent flooding in Eastern Kentucky. To support relief efforts, Liberty recently donated $50,000 and we continue to monitor the situation to see how we can best support the needs of the local communities.\n\nOn May 3, 2022, the Kentucky Power Public Services Commission, KPSC, issued an order that required certain changes to the proposed operating and ownership agreements relating to the Mitchell coal plant. On July 1, 2022, the Public Service Commission of West Virginia issued an order on the operating and ownership agreements related to Mitchell that was inconsistent with the KPSC's order. The closing of the Kentucky Power transaction is subject to the satisfaction of certain conditions precedent, which include those relating to the approval of the Mitchell agreements by the KPSC, West Virginia PSC, and FERC. We are in discussions with AEP to identify a resolution that will work for the parties upon which we expect the Kentucky Power transaction to close in the second half of 2022.\n\nWe remain firmly committed to this transaction and look forward to bringing the benefits of our local operating model to the customers and communities of Eastern Kentucky. Turning to the growth levers for our renewable business, we continue to be active on the renewables front and thought I'd provide you with a few project updates as we continue to execute on our greenfield pipeline. During the quarter, the latest project to achieve commercial operations was a 175-megawatt Blue Hill facility in Saskatchewan with all the energy under a 25-year contract with SaskPower. We are pleased to bring low-cost renewable generation to communities and contribute to a cleaner power supply for Saskatchewan.\n\nWe are proud of our long-lived assets and at the end of Q2, we have approximately 82% of our output sold under long-term contracts with production weighted average remaining contract life of approximately 12 years. Construction continues to progress on the wind side our Deerfield II project is in full construction with over 100 individuals now engaged on the site. Foundations, substation, and collector work is in progress and turbine deliveries have started. Our Sandy Ridge 2 project is also ramping up construction with 45 individuals now engaged on site.\n\nPublic and private road improvements are in progress and foundation work is starting with the first bore occurring in July and turbine deliveries expected to start in August. On the solar side with respect to the U.S. executive order regarding a two-year tariff exemption for solar panels, which is announced in June. We believe that this can be divided into two categories.\n\nFirst, there are current projects with solar panel deliveries before the 24 months tariff free period expires. The two-year exemption allows panel procurement activities to resume or restart giving greater certainty to the completion of the current active projects, and the timing and cost impacts. These projects include New Market Solar, The four Chevron projects, and Carvers Creek. Of these New Market Solar, and two of the four Chevron projects are under construction.\n\nThe second category would be future projects with solar panel deliveries after the 24-month period. These include the remaining solar projects outlined in our five-year capital plan. We believe a potential consequence of the investigation could be caused passed through to PPA pricing in the industry. As this consistent with our development philosophy, we generally try to finalize the most significant equipment supply agreements, the EPC contract, and the offtake contract as close together as possible in an effort to protect the margins we expect.\n\nI also want to give you an update on our Sandhill RNG renewable natural gas projects, which is represents the company's first investment in the non-regulated renewable natural gas space. Earlier this month, we achieved commercial operations at two of the four projects. The remaining two projects are in late-stage development and are expected to reach commercial operations in 2023. The Sandhill portfolio of projects in Wisconsin gives us an opportunity to apply our expertise in renewable development to an energy generation method known for its extremely low net carbon intensity and gives us a strategic foothold in a highly attractive sector of the RNG market.\n\nAccording to U.S. Environmental Protection Agency Report, Wisconsin represents the state with a thick and largest universe of RNG opportunities and we are excited to utilize Sandhill as a potential RNG growth platform. Moving on now to operational excellence. In a mission critical industry, safety and reliability are always key areas of focus.\n\nWe strive to keep our customers and communities safe, while maintaining our system reliability and resiliency. On a trailing 12-month basis, our key performance indicators of lost time injuries and recordable injuries are in the top decile rate when compared to our industry peers. In addition to being recognized by the American Gas Association as a top safety performer in 2021, winning the AGA Safety Achievement Award for the lowest incident rate in the medium communist and utilities category, we are recently recognized by the Canadian Gas Association and was awarded a 2021 safety awards for excellence appropriately acronymed SAFE for employee safety. Recipients of the SAFE awards have demonstrated an outstanding dedication to safety.\n\nWe continue to monitor rising costs and the consequent costs of living challenges. We invest in our network to deliver mission critical services to our communities while keeping customer affordability top of mind. We are helping our customers through energy efficiency programs such as the one in Massachusetts, where Liberty received approval for a 21 million three year energy efficiency plan. Our largest commitment ever to energy efficiency in that state, where we are committed to serving over 6,400 residential and low-income customers over the next three years.\n\nWe remain focused on managing affordability for our customers through opex to capex conversion opportunities. We are also focused on cost management within the utilities. In fact, we've brought down our operations and maintenance efficiency ratio that's our operating cost as a proportion of our revenues from 66% back in 2012 to around 42% in 2021. And we're aiming to bring that down further to around 35% by 2026, as we indicated at our last Investor Day.\n\nAnd finally, we remain firmly committed to sustainability through the inclusion of environmental, social, and governance values in our corporate strategy and operations. We continue to make meaningful progress in driving sustainable business practices across each of our businesses. Our efforts to date are reflected in our low greenhouse gas emissions intensity are on a revenue basis of 0.0011 of carbon dioxide equivalent per dollar of 2021 revenue. This is a 15% improvement from the previous year.\n\nIn fact, when we look back over the last five years since 2017, we have made meaningful reductions of our Scope 1 and 2 emissions. Our revenue-based emission intensity has decreased by 48% and we have reduced our overall emissions by 38%. This is a direct result of our Greening the Fleet initiatives, significant growth in our renewable businesses, and a dedicated focus throughout the company to reduce overall emissions. We also continue to improve our ESG data reporting.\n\nDuring the quarter, we updated our ESG data hub and published our ESG performance index, which contains our key 2021 ESG metrics, including our Scope 1, 2, and 3 emissions, which can be found on our website. Lastly, the company launched a new Employee Engagement Survey with a strong employee participation rate of 81%. We recognize that engagement is a journey and the most important part of the survey is employee feedback that allows for continuous improvement. The survey results highlight our team at Liberty is committed to employee safety and being a good corporate citizen.\n\nAnd that we are focused on development, growth, diversity, equity, and inclusive and belonging attributes that are directly connected to our guiding principles. With that, I'll pass it over to Arthur who'll speak to our second quarter 2022 financial results. Arthur.\n\nArthur Kacprzak -- Chief Financial Officer\n\nThank you, Arun, and good morning everyone. In the second quarter, we delivered solid results, reflective of the strength and resiliency of our core businesses. Our second quarter 2022 consolidated adjusted EBITDA was 289.3 million, which is up approximately 18% from the $244.9 million we reported for the same period last year. The regulated services group delivered $185.9 million in operating profit in the current quarter, which compares to $161.1 million in the same quarter last year, an increase of $24.8 million or 15%.\n\nThis increase reflects the normalization of our operations as well as the implementation of new rates across some of our utility systems, which added approximately $7.1 million as compared to the prior year. This was partially offset by a one-time catchup of distributions received from our San Antonio water system investment recorded at a prior year. The increase in operating profit also reflects the addition of Liberty New York Water, which was acquired in January. As a reminder, this utility is impacted by seasonality and is expected to earn over 60% of its operating profit during the peak summer months, primarily in the third quarter.\n\nThe renewable energy group reported first quarter divisional operating profit of 117.9 million, which compares to 97 million in the same quarter last year, representing an increase of 20.9 million or 22%. Existing wind and solar generation facilities added approximately 14.2 million to operating profit and generation from newly commissioned facilities and investments added 4.1 million. In general, results benefited from increased production from our renewables fleet which was in line with long-term averages as compared to approximately 12% below long-term averages experienced for the same period last year. The higher production was partially offset by higher operating costs as well as underperformance from our investment in the Texas Coastal Wind Facilities, which continue to experience high basis costs with the imposition by ERCOT of a generic transmission constraint in the vicinity of the facilities.\n\nIt appears more likely however that the area congestion will be mitigated over time. Lastly, our renewable energy group benefited from incremental dividends received from our investment in Atlantica, which continues to provide strong results. Corporate administrative expenses have increased by approximately 3 million in the second quarter relating primarily to higher staffing expenses as well as timing of expenses incurred relative to the comparative period. In total, our Q2 adjusted net earnings per share came in at $0.16, which compares to $0.15 in the prior year, a 7% increase.\n\nMoving onto our capital plan for the year. For 2022, Algonquin is targeting to spend over $4.3 billion in capital with the majority related to the completion completed acquisition of Liberty New York Water and the pending acquisition of Kentucky Power. Our capital plan remains on track. Year to date we have invested over $1.2 billion including 609 million of capital deployed for the closing of Liberty New York water, and over 400 million into organic investments to improve the safety, reliability, and resiliency of the network.\n\nWe continue to make good progress on our financing plan for the year, which is predicated on in maintaining our strong and resilient balance sheet targeting a BBB investment grade credit rating. To that end, I'm pleased to report that Moody's has assigned an inaugural Baa2 long-term issuer rating to Liberty Utilities Co, the primary holding company of our regulated business. We believe that this rating will further broaden our access to the debt capital markets for our regulated business and will further support our competitive cost of capital. As we look forward to completion over '22 financing plan, we have a diversity of potential funding sources available to us.\n\nThe renewable asset monetization process we commenced earlier this year is continuing to progress well, with strong interest received from the market. We are seeking to issue utility tariff bonds under Missouri securitization statute for costs related to last year's Midwest extreme weather event and balances related to the retirement of the Asbury coal plant. We expect the decision by the Missouri public service commission on the quantum of the financeable later this month. Our DRIP program continues to see strong uptake, and we expect to reactivate our ATM program with both programs supporting base equity needs.\n\nLastly, we continue to monitor the hybrid market on both sides of the border, which has recently seen some positive momentum. Our liquidity position also remains strong, ending the quarter with approximately $2.4 billion of available liquidity. During the quarter, our regulated group upsized and extended its revolving credit facility, increasing it from 500 million to 1 billion for a five-year term. The extension was well oversubscribed highlighting, strong support for the company's credit in the bank market.\n\nAlso subsequent to the quarter, our renewable energy group extended its revolving credit facility for additional five years along with meaningful improvements in pricing and terms. Along with strong liquidity, we are also well-positioned against short-term interest rate shocks with approximately 84% of our debt being fixed and limited near-term refinancing expected. Before turning things over to Arun, I'd like to provide a brief update on our 2022 adjusted net EPS guidance. We continue to expect our 2022 adjusted net EPS to be within a range of $0.72 to $0.77.\n\nThese expectations are based on underlying assumptions including normalized weather pattern, resource production, and realized pricing at a renewable facilities consistent with long-term averages. We have also assumed that the acquisition of Kentucky Power will be completed in the second half of 2022, and there'll be no impact from COVID-19 on operations. We look forward to continuing to deliver solid earnings, which along with our history of dividend growth, we believe will continue to drive strong return for our shareholders. With that, I will now hand it back to Arun to outline strategic plans.\n\nArun Banskota -- President and Chief Executive Officer\n\nThank you, Arthur. Before we close out our prepared comments this morning, I want to give an update on our strategic initiatives. I'm excited about the prospect for Algonquin's regulated and renewable businesses, which are both well-positioned to contribute to and benefit from the decarbonization transformation that is currently underway and which will only accelerate over the coming years. With our increased scale of 4,000 megawatts, we expect to get incremental benefits including improved negotiating power, lower transaction costs, and access to greater opportunities.\n\nThis includes the opportunity to partner with institutional investors who wish to invest in long-term contracted sustainable assets by selling down a portion of our assets and earning a recurring operating fee. As I mentioned on our last call, we have formally comments our inaugural asset recycling process with a portfolio of assets in the range of approximately 750 megawatts. The portfolio consists of four wind assets located in Canada and the U.S. The process continues to advance and we have received strong interest.\n\nAs you can appreciate, we are not at the stage where we can provide a fulsome update and we look forward to giving you details as a process concludes. Key objectives for us are increasing the scale of our development and operational platform, together with increasing the amount of internally generated cash for future growth. Asset recycling is part of our enhanced renewable plan, and we expect this to occur on a recurring basis. Before wrapping up my formal remarks, I want to comment on the Inflation Reduction Act of 2022.\n\nWe are pleased to see continued progress toward the passes of the Inflation Reduction Act, which is necessary to continue driving the push toward Greening the Fleet. Many provisions in the draft legislation could provide tailwinds to Algonquin and help accelerate the clean energy transition. The 10-year extension of the PTC and ITC would provide significant opportunities for continued investment in renewable energy throughout the United States. Within the renewable business, PTC and ITC benefits are expected to be split between customers and developers.\n\nOur active greenfield development platform will ensure we have projects in the pipeline and the ability to participate in this benefits, if the legislation is passed. From our previously announced 3.6 billion renewable capital plan, approximately 2.4 billion in projects stand to benefit from increased levels for PTC and ITC. While the remainder of our late stage projects already had a 100% PTC and 30% ITC strategies, all of the wind solar stores and renewable natural gas projects in our early days greenfield pipeline are expected to benefit from the new legislation if passed. As a reminder, at our last Investor Day, we announced a 3,800 megawatt of greenfield pipeline and a 1,700-megawatt hour of storage pipeline.\n\nIn addition, future Greening the Fleet initiatives within the regulated business should become even more economic for rate bearers, increasing the scale of our potential investment opportunities. Going into the second half of the year, we've continued to make steady progress on both sides of our business. On the regular design, we have closed on Liberty New York Water and are progressing toward closing of Kentucky Power. On the renewable side, we are excited about the growth prospect and believe that there are a number of positive tailwinds that support renewables growth, especially given the current environment of higher gas and commodity prices where renewables represent the lowest priced form of generation.\n\nOur three strategic pillars of operational excellence, growth, and sustainability will be a key foundation as we continue to build the business and seek to deliver steady earnings, dividend growth, and long-term shareholder value. With that, I will turn the call over to the operator for any questions from those on the line.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Dariusz Lozny from Bank of America. Please go ahead.\n\nDariusz Lozny -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning. And thank you for taking my question. I just wanted to maybe discuss a little bit more detail the progress of talks on the sale of Kentucky Power.\n\nYou mentioned that you continue to expect the transaction to close in the second half of the year. Can you just give a little bit of color or clarity as to the pace of talks at the moment, sort of like what the next upcoming gating items might be? And any other maybe detail as far as within the second half, what would it be, the early partner, perhaps the middle or later part of the second half of the year that you might expect the transaction to close?\n\nArun Banskota -- President and Chief Executive Officer\n\nSure, Dariusz. Great question, obviously, right. So look, we -- as you know, we received the order from Kentucky back in May, and then on July 1, we received an order from the West Virginia Commission and those two orders were clearly inconsistent. And so, what we are doing is working closely with AEP as a seller to come up with a resolution to those inconsistencies.\n\nAnd there are questions whether we go back to the commissions or cover everything in a filing in front of FERC. So all of those questions remain outstanding and that is the reason why we've said we, while we remain confident in our ability to close the transaction, given the regulatory requirements, we basically said the second half of 2022 just to remain on the safe side.\n\nDariusz Lozny -- Bank of America Merrill Lynch -- Analyst\n\nOK. Got it. Thank you for that color. One more, if I can, just pivoting to the R&G acquisition that you announced.\n\nCan you give a little bit of detail on what might be a run rate contribution from that project once it's fully up and running across all sites in 2023 and perhaps what the, any kind of metrics around the actual deal like what type of EBITDA multiple or any other metrics that we could think about?\n\nArun Banskota -- President and Chief Executive Officer\n\nGood. Great question, Dariusz. I'll have Jeff respond to that.\n\nJeff Norman -- Chief Development Officer\n\nHey, Dariusz. I think the first thing to keep in mind is that we do treat this as an opportunity to learn and build our business. So, we don't expect it to be a significant contributor, but it is an important piece of our building out in RNG and learning. I can't answer the specific EBITDA run rate numbers, but in terms of once the two facilities have COD two more facilities are expected in 2023, which will give us approximately 500 MMBtu per day for around 155,000 per year.\n\nAnd so to give you a little bit of idea on scale, we're certainly happy to follow up with the EBITDA run rate.\n\nArthur Kacprzak -- Chief Financial Officer\n\nYeah. We'll certainly follow up. Dariusz, the only couple of items the reason we're excited about this transaction is that it's in Wisconsin, and like I said, in my prepared remarks, the second highest number of potential RNG opportunities. So, we see this really as a development platform to grow our RNG business and especially given the significant negative carbon intensity say from dairy farms of as much as negative 400.\n\nThis would represent a pretty sizable way to green our natural gas fleet. The only other color I'll give you is that. We also have projects in front of four different commissions on the regulative side of the business, and we're working through those regulatory processes to get those projects online as well.\n\nDariusz Lozny -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you guys very much. I'll turn it over here.\n\nArthur Kacprzak -- Chief Financial Officer\n\nSure.\n\nOperator\n\n[Operator instructions] Our following question is from Ben Pham from BMO. Please go ahead.\n\nBen Pham -- BMO Capital Markets -- Analyst\n\nHi. Thank you. I wanted to follow up. You mentioned renewable asset sales, so last quarter was just wondering if you had an update on timing or progress with that?\n\nArun Banskota -- President and Chief Executive Officer\n\nSure. Ben look, we are making very, very solid progress on the process. I think from a macro perspective, what we're seeing is very strong interest, especially from a lot of large financial players wanting to buy into long-lived, well-contracted sustainable infrastructure. And also given some of global issues happening around Europe and Asia, we in fact see an even stronger interest in these assets that are in North America.\n\nSo, we have seen a robust level of interest, and the process continues with management presentations all of those kinds of things, and we in fact looking forward hopefully to making you announcement sometimes in the second half of the year.\n\nBen Pham -- BMO Capital Markets -- Analyst\n\nOK. That's great. And I heard part of the last question around the inconsistencies in O&M on Mitchell. I may be to expand on that was, is it inconsistent -- is it mostly really the calculation of the transfer value of just book value, salvage value? Was that the one that was, I know, it's probably more of a deeper answer than that, but was that the gist of it?\n\nArthur Kacprzak -- Chief Financial Officer\n\nWell, for the most part, yes, I mean, there's also issues around operating of the assets between now and the end of 2028 when for Kentucky Power purposes the asset retires, but primarily you absolutely right. It's around the valuation.\n\nBen Pham -- BMO Capital Markets -- Analyst\n\nOK. And I mean, is it just -- maybe using simples to general a statement, but is it really just taking out the president of that O&M in your transaction and then really the transfer value, you can sort it out by 2028. I mean, just not kick it down the road, but it's just something you can deal with in a few years?\n\nArun Banskota -- President and Chief Executive Officer\n\nAnd we can certainly do that. However, from a risk perspective, we want to make sure there's more of a certainty as was in our transaction documents. And again, we are working very constructively with AP to come to a resolution. And like I said earlier in my prepared remarks as well, we remain highly confident that we are going to arrive at a conclusion.\n\nThat works for all parties, and finally, especially the customers of Eastern Kentucky.\n\nBen Pham -- BMO Capital Markets -- Analyst\n\nOK. That's very helpful. Thank you.\n\nOperator\n\nThank you. [Operator instructions] And we have no further questions registered at this time. I would not like to turn a meeting back over to Arun.\n\nArun Banskota -- President and Chief Executive Officer\n\nThank you, operator. Thank you very much for those who participated for taking the time on our call today. And with that, please stay on the line for our disclaimer.\n\nAmelia Tsang -- Investor Relations\n\nOur discussion during this call contains certain forward-looking information, including, but not limited to our expectations regarding earnings, capital expenditures, pending acquisitions, asset recycling growth, and pending legislation. This forward-looking information is based on certain assumptions, including those described in our most recent MD&A filed on CEDAR and EDGAR and available on our website, and is subject to risk and uncertainties that could cause actual results to differ materially from historical results or results anticipated by the forward-looking information. The forward-looking information provided during this call speaks only as of the date of this call and is based on the plans, beliefs, estimates, projections, expectations, opinions, and assumptions of management as of today's date. There could be no assurance that for looking information will prove to be accurate, and you should not place undue reliance on forward-looking information.\n\nWe disclaim any obligation to update any forward-looking information or to explain any material difference between subsequent, actual events and such forward-looking information except as required by applicable law. In addition, during the course of this call, we may have referred to certain non-GAAP measures and ratios, including, but not limited to, adjust in at earnings per share for adjusted net EPS, adjusted EBITDA, adjusted funds from operations, and divisional operating profit. There is no standardized measure on such non-GAAP measures. And consequently, our method of calculating these measures may differ from methods used by other companies, and therefore, they may not be comparable to similar measures presented by other companies.\n\nFor more information about both forward-looking information and non-GAAP measures including a reconciliation and non-GAAP financial measures to the correspondent GAAP measures, please refer to our most recent MD&A filed on CEDAR in Canada and EDGAR in the United States, and available on our website. And that concludes the conference call. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAmelia Tsang -- Investor Relations\n\nArun Banskota -- President and Chief Executive Officer\n\nArthur Kacprzak -- Chief Financial Officer\n\nDariusz Lozny -- Bank of America Merrill Lynch -- Analyst\n\nJeff Norman -- Chief Development Officer\n\nBen Pham -- BMO Capital Markets -- Analyst\n\nMore AQN analysis\n\nAll earnings call transcripts"
}