{
  "companyName": "Grocery Outlet",
  "companyTicker": "GO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/grocery-outlet-go-q3-2022-earnings-call-transcript/",
  "content": "Grocery Outlet (GO -0.44%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Grocery Outlet third quarter 2022 earnings results conference call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Arvind Bhatia, vice president of investor relations. Please go ahead, sir.\n\nArvind Bhatia -- Vice President, Investor Relations\n\nThank you. Good afternoon, and thank you for joining us on today's call to discuss Grocery Outlet's third quarter 2022 financial results. Joining me on today's call are Grocery Outlet's chief executive officer, Eric Lindberg; president, RJ Sheedy; and chief financial officer, Charles Bracher. Following our prepared remarks, we will open the call for questions.\n\nThis conference call is being webcast live, and a recording will be available via telephone playback for approximately two weeks. It will also be archived in the investor relations section of our website. Participants on this call will make forward-looking statements, including our outlook for fiscal 2022 and future performance. These forward-looking statements are subject to various risks and uncertainties that could cause our actual results to differ materially from these statements.\n\nA description of these factors can be found in this afternoon's press release, as well as in our periodic reports we file with the SEC, all of which may be found on our website at investors.groceryoutlet.com or on sec.gov. We undertake no obligation to revise or update any forward-looking statements or information. These statements are estimates only and not a guarantee of future performance. During our call, we will also reference certain non-GAAP financial information, including adjusted items.\n\nReconciliations of GAAP to non-GAAP measures, as well as the description, limitations, and rationale for using each measure may be found in the supplemental financial tables included in this afternoon's press release and our SEC filings and the investors tab on our website. With that, it is my pleasure to turn the call over to Eric.\n\nEric Lindberg -- Chief Executive Officer\n\nThanks, Arvind. Good afternoon, everyone, and thank you for joining us. Before we jump into a discussion of our strong third quarter results, I'd like to comment on the leadership transition we announced this afternoon. As you may have seen, I plan to move to the role of chairman of the board, and RJ will become president and chief executive officer effective January 1.\n\nThis announcement is a culmination of careful and thoughtful succession planning with the board to ensure a seamless transition of the CEO role. RJ joined the company in early 2012 and has held key leadership positions in the area of strategy, purchasing and planning, marketing and operations and has served as president since 2019. When RJ joined us, the business was roughly $1 billion in sales and over 170 stores. Over the 10 years, RJ has played an integral role in both building and executing our strategic vision as we have tripled top line and grown to more than 430 locations.\n\nRJ and I have worked closely for many years, and he is more than ready to take this next step. His leadership style exemplifies our culture and values. He is passionate about the business and his collaborative on term approach resonates with and inspires our team. I am confident that there is no one better to lead Grocery Outlet into the next chapter of growth than RJ.\n\nI look forward to working closely with him and with the executive team in my future role as chairman, and I am immensely grateful for the opportunity to have led such a remarkable group of people. While I will move away from day to day, I will continue to be invested both emotionally and finding Grocery Outlet success as chairman of the board. As part of this transition, I also want to thank Erik Ragatz, our current chairman, for his many years of leadership and valuable advice and friendship. The company will continue to benefit from Erik's guidance as he moves into the role of lead independent director.\n\nAs you'll hear throughout the call, our business is performing well, and our value-oriented model is positioned to continue gaining share. Our growth runway is long with the potential for more than 10 times the store count we have today, and we have the right strategic initiatives to fuel sustained comp sales growth. I am extremely pleased with our third quarter results and the continued momentum in our business. We are seeing an increase in new customers to our stores.\n\nExisting customers are spending more with us. Third quarter sales grew 19%, driven primarily by strong comparable store sales growth of 15%, as well as contribution from new stores opened over the last year. We were also encouraged to see an uptick in transaction count and balanced contribution between traffic and ticket. We delivered gross margin with our expectation as we continue to benefit from our dynamic and opportunistic model.\n\nBetter-than-expected top line and gross profit dollar growth resulted in bottom line results that exceeded expectations. Based on our third quarter results and quarter-to-date trends, we are raising our full year guidance, which Charles will discuss shortly. Turning now to our store expansion strategy. We opened six stores in the third quarter, ending with 431 locations.\n\nWe remain pleased with the new store trends, as well as recent vintages continuing to ramp in line with our blended underwriting model. Especially encouraging has been the progress of our Mid-Atlantic market, where we continue to invest in and build the brand. As store count increases and the consumer awareness grows, we are seeing higher traffic, which is fueling top line trends, including comparable store sales growth that is above company average. In terms of future store growth, we remain pleased with the real estate opportunities we are seeing as we continue to identify new sites across our existing and new markets.\n\nOur real estate construction and new store teams remain extremely active, and we are encouraged by the quality of our sites in our pipeline over the next 24 months. That said, we continue to face various headwinds in opening new stores on a timely basis, including permitting and inspection delays, equipment and labor availability and utility-related lead times. As a result, two fourth quarter openings have been pushed back into 2023. While it's difficult to predict exactly when those store opening challenges might ease, we will continue to adapt and remain nimble as we work our way toward our normalized target of 10% annual unit growth.\n\nWith respect to our pipeline of future operators, our entrepreneurial model and our positive momentum are contributing to a strong inbound interest from prospective IOs. We are seeing a healthy number of qualified candidates apply for our aspiring operator and training program and the quality of recent graduates is strong. At the same time, IO's operating existing stores have been energized by our momentum, increasing customer traffic and improving operating conditions. This renewed enthusiasm was evident throughout our regional operator meeting we held in late September.\n\nOur leadership team visited 10 cities over six days to share recent business updates, collaborate on holiday execution, respond to the operator's questions and feedback. Throughout the meeting, I were enthusiastic about the expanded merchandise assortment and strategy heading into the holiday season, the health of the opportunistic inventory and experience and the ongoing investments that we're making in technology and infrastructure. Before I turn the call over to RJ, I just wanted to take a moment to again thank our extended Grocery Outlet family, which includes our IOs, their employees and all of our team members across the corporate office, field and supply chain. This truly is a unique company with dedicated and passionate people who care deeply about each other and the communities we serve.\n\nI'm so proud of what we have accomplished and even more excited about the opportunities in front of us. As I transition my role, I look forward to contributing in new ways as we fulfill our mission of Touching Lives for the Better in the years ahead. With that, I'll turn the call over to RJ.\n\nRJ Sheedy -- President\n\nThanks, Eric. I am grateful and honored to be assuming the role of president and CEO, as well as joining the board of directors. I want to first say thank you to Eric for his contributions and commitment to Grocery Outlet over the past three decades. His leadership and vision have inspired to solve.\n\nIt's been a privilege to work alongside him, and I look forward to our continued partnership as we transition into our new roles. I joined Grocery Outlet because of its mission and model and incredible people culture. We provide access to affordable quality food, and we save customers money to live better lives. We reduced food waste through our supplier partnerships and opportunistic sourcing.\n\nWe provide opportunities for independent operators and their employees, as well as our team members. And we, together with our operators, give back to the communities in which we live and operate. As we grow and reach new customers, so does our impact. I'm so excited and humbled to be a part of this effort, working in partnership with our operators and our amazing team.\n\nour business fundamentals remain healthy, and we are seeing several positive consumer trends. spending from our core customers are up, indicating stronger retention with an expanding share of wallet. We are also gaining new customers as shoppers increasingly seek out value. In addition, overall satisfaction among both our core and tertiary customers remain strong.\n\nAnd lastly, awareness of an intent to shop grocery outlet over the next 12 months have increased. We believe our positive consumer and top line trends are the result of disciplined focus on our three primary comp growth drivers: No. 1, providing our customers with the deepest value and a unique treasure hunt assortment of quality products; No. 2, supporting our operators in delivering a WOW! shopping experience; and No.\n\n3, driving customer awareness and engagement through company and operator marketing efforts. Let me provide an update across these initiatives, starting with the strength of our assortment. We have great product variety across departments. Our inventory position is healthy, and our pipeline of opportunistic profit is strong.\n\nIn addition, we are pleased with the ongoing sales contribution from our expanded assortment and we'll continue to selectively add items based on customer demand. As we approach the holiday season, we are well positioned in key seasonal categories from both opportunistic deal flow and strategic SKU expansion. We are capitalizing on increased store traffic by delivering customers the deepest value for their holiday shopping at a time when they need it most. True to the Grocery Outlet model, our seasonal offering will provide customers unmatched savings and convenience within a fun treasure hunt shopping environment.\n\nOur operators continue to execute at a high level and serve their communities with passion and dedication. They are the best ambassadors of our brand, and we are excited to continue to support them in ways that allow them to grow their business and reach new customers. In addition to ongoing investments in store improvements and fixtures, we continue to strengthen our marketing, technology and infrastructure in ways that benefit IOs. Example specific to technology.\n\nAs we first shared with you last year, we continue to make steady progress on planned upgrades to our financial system, inventory platform and operating applications. These enhancements will provide additional functionality and scalability to support key areas of our business, including purchasing, inventory management and store operations. I'm particularly excited about the store facing improvements that will enable operators to make smarter decisions and operate more efficiently to drive sales and profit growth. These new applications are being developed in partnership with our IOs, and we are excited for the planned implementation in the middle of next year.\n\nTurning now to marketing. We continue to utilize a test-and-learn approach to inform our strategy and allocate investments. As part of that effort, we are more effectively leveraging data, including market and store-level attributes to gauge media effectiveness across markets and channels. Complementing this is the personal connection that our operators have with their communities and customers.\n\nConsumers are particularly receptive right now to our local IO and value messaging, and we are seeing it in our results. With respect to our digital efforts, we have developed and tested our new personalization app and we are excited for customers to begin using it. The app will soon be available to download and use in our Washington test stores. As a reminder, this new program will give customers access to new trending and top-selling items on a real-time basis, as well as curated product recommendations based on their preferences.\n\nIt will also track customer savings and provide opportunities for them to win what they saved by shopping at Grocery Outlet. Our operators have expressed a lot of enthusiasm for the user interface and functionality and are excited to see customers use it in their high customer engagement will provide us with robust customer shopping data, which will further enhance our current marketing efforts and improve operating results over time. Last, with regards to e-commerce, we continue to expand our reach and capture incremental customers through our online partnerships. Today, substantially all our stores are live with both Instacart and DoorDash, and we expect to have a majority of stores up on Uber Eats by the end of this week.\n\nWhile we are still early in our e-commerce journey, we remain excited for the access this new channel provides to a more convenience-based customer. In closing, I want to thank Eric again for his successful leadership of Grocery Outlet. This is a special company that has our mission of Touching Lives for the Better at its core. I'm proud of what we have accomplished this year, and I couldn't be more excited about the tremendous opportunity that lies ahead.\n\nBefore I turn it over to Charles, I'd also like to take a moment to thank our independent operators, our supplier partners and our corporate teams for their passion, dedication and ongoing commitment to serving our customers and communities every day. I will now turn it over to Charles for a financial update.\n\nCharles Bracher -- Chief Financial Officer\n\nThanks, RJ, and good afternoon, everyone. I will begin with a discussion of our third quarter results, followed by comments regarding the fourth quarter and our revised guidance for the fiscal year. We delivered strong third quarter results, which exceeded plan on both the top and bottom lines. Comparable store sales accelerated to 15.4%, driven by higher traffic and ticket.\n\nOur comp store sales growth resulted from a 7.9% increase in transaction count and 6.9% higher Strong comp and new store performance drove 19.4% growth in net sales to $918.2 million. During the third quarter, we opened six new stores, ending with 431 locations. Third quarter gross profit increased 18.4% to $280.6 million. We were pleased with our third quarter gross margin performance of 30.6% which was in line with expectations.\n\nHeadwinds related to product and supply chain costs persist, but our purchasing and planning team continues to do a fantastic job, delivering a compelling product assortment to customers at deep value along with healthy margins. Turning to expenses. Third quarter SG&A increased 18.7% to $227.5 million compared to the third quarter of last year. The increase reflected $21.6 million in higher store-related expenses and $14.2 million in increased corporate-related costs.\n\nStore-related expenses were driven by higher commission payments to IOs, reflecting strong gross profit growth, as well as higher store occupancy costs due to new store expansion. Corporate-related expenses increased mostly due to higher incentive compensation, reflecting stronger financial performance versus the prior year. As a percentage of sales, SG&A decreased 10 basis points as leverage on store cost was largely offset by higher incentive compensation expense. D&A increased 10.9% to $19.4 million and share-based compensation was $9.1 million, reflecting the impact of grants made in the past 12 months, as well as current expectations related to our performance-based share awards.\n\nNet interest expense increased 21.5% to $4.8 million due to the impact of higher interest rates on our variable cost debt. This was partially offset by the $75 million principal prepayment on our senior term loan in April this year. Our effective tax rate was 12%, which is below our normalized rate of approximately 28% due to excess tax benefits related to the exercise and vesting of equity awards. As a result of these factors, GAAP net income for the third quarter was $17.5 million or $0.17 per diluted share.\n\nAdjusted EBITDA increased 15% to $59.1 million for the quarter, reflecting 6.4% of sales. Adjusted net income increased 14.2% to $26.8 million and adjusted diluted earnings per share was $0.27 based on an average of 100.5 million diluted shares. Turning to our balance sheet. Our liquidity remains strong as we ended the quarter with $107.3 million of cash.\n\nInventory grew 4% from the second quarter to $332 million and remains healthy in terms of quantity, mix and turnover. Our third quarter capex, net of tenant improvement allowances, was $32.1 million, reflecting new store growth, continued upgrades to our existing fleet and ongoing technology and infrastructure investments. Next, I'd like to touch on our fourth quarter trends and update you on our full year outlook. We remain pleased with our top line momentum, as well as the strength of our seasonal assortment.\n\nAs a result, we expect comp sales growth of 12% in the fourth quarter, and we are raising our fiscal 2022 comp guidance to approximately 11%. In terms of unit growth, we expect to open 10 new stores in the fourth quarter and 26 net new stores for the year. Based on our comp sales and new store expectations, we are raising our fiscal 2022 sales guidance to approximately $3.55 billion. With respect to margins, we expect fourth quarter gross margins of approximately 30% which reflects normal fourth quarter seasonality due to holiday product mix and targeted price investments.\n\nFor the full year, we expect gross margins of approximately 30.5%. In terms of expenses, we expect fourth quarter SG&A as a percentage of sales to be down year over year due to the impact of store expense leverage from fixed cost and I/O commissions partially offset by higher incentive compensation expense. For the full year, we are increasing our adjusted EBITDA guidance to approximately $224 million. Further, we expect D&A of approximately $76 million for the year and share-based compensation of approximately $32 million, up slightly from prior guidance, reflecting performance expectations for our share-based awards.\n\nWe continue to expect net interest expense of approximately $19 million for the full year, reflecting a run rate of $6.5 million for the fourth quarter based on interest rates. Lastly, we forecast a normalized tax rate of 28% and average diluted shares outstanding of approximately $101 million for the fourth quarter. Taking all these factors into account, we are raising our full year adjusted EPS guidance to approximately $1 per share. In summary, we are pleased with our solid year-to-date performance and continued momentum in the fourth quarter.\n\nCustomers are seeking out value more than ever and our incredible family of IOs and team members is delivering on their behalf. Before we begin Q&A, I'd like to take a moment to thank Eric for his leadership in the indelible mark he has left on Grocery Outlet. We have a strong foundation and are incredibly well optioned to drive long-term growth and shareholder value as we move forward. And now I would like to turn the call over to the operator to begin Q&A.\n\nOperator\n\n[Operator instructions] The first question we have is from Robbie Ohmes from Bank of America. Apologies, the first question we have is from Oliver Chen from Cowen and Company.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, everybody. Congrats, Eric and RJ. Good quarter as well. As we think ahead to the store growth pipeline, you called out some puts and takes in terms of what you're seeing with encouraging availability.\n\nYou had also lots of supply chain considerations. What are your thoughts for how the availability and the supply chain environment store growth as we look to next year as well. And then, would love your thoughts on independent operators and the temporary commission adjustment program, as well as rising interest rates. How have those interplayed with what you're seeing in terms of the health of the IOs and the environment we're in now.\n\nEric Lindberg -- Chief Executive Officer\n\nYes. Thanks, Oliver, for the question. So I'll start on that. Yes, I would say pipeline is really healthy.\n\nWe are seeing plenty of stores look out the next 24 months. That pipeline is healthy. So the good news is that we're not really seeing an issue of real estate availability. I would say that the issue does remain that the delays for timing for a host of issues that I detailed on the prepared remarks.\n\nIt's real. It doesn't seem to be letting up. We are still working toward and pretty confident in that goal of 10% unit growth. We look at it as a temporary sort of bump in the road.\n\nWe're 400 stores. We've got decades of growth toward sort of filling out sort of our goals. No reason we can't exist in every market. We've talked about that a lot.\n\nWe're in nine states today. But the construction challenges, they persist. And it's everything from labor availability to materials to things like just getting power connected to stores. So I think we're not alone in stating that has been a challenge, but we're going to work through it and we'll get back to that 10%.\n\nI feel really confident in that. And this will be a blip that we're dealing with in these last couple of years. Relative to IOs, look, I'd say they're doing really well. Our strong results are benefiting -- they're participating in the upside.\n\nGross profit growth, 18% that gets split with IOs. Traffic in in-stock is getting healthier. Variety is really strong. It's as healthy as it's been.\n\nAnd we and -- they are super focused on driving sales and healthy margins. So relative to your question, our job is really to make sure the operators can grow through all of their years of being an operator, particularly the early years of starting a new business, it's not easy. Some ramp fast, some ramp slow. So our job is to make sure we're supporting them, and that's the program you referenced.\n\nSo that's alive and well, and we're doing everything we can to make sure those stores get up to run rate volumes.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you. Best regards.\n\nOperator\n\nThank you. The next question we have is from Krisztina Katai from Deutsche Bank.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nHi, good afternoon and congratulations on a very strong quarter. And congrats, RJ and Eric on the promotion. So I wanted to ask about a few of your initiatives that you mentioned on -- in your prepared remarks. One of them is on marketing and just really focusing on delivering a consistent value message.\n\nAnd then two, just on SKU expansion and data analytics. So can you just maybe tell us where you are seeing some of the benefits in terms of sales lift and how you're thinking about the opportunity as you head into 2023?\n\nRJ Sheedy -- President\n\nYes, sure. Thanks, Krisztina. I'll take that. This is RJ.\n\nSo just to start with marketing. For us, it is about providing a consistent message of value and quality across the assortment as we referenced in the comments. Inventory is really strong. Health and opportunistic is really strong.\n\nWe have great representation of our everyday items, so just feel really good about the health of the inventory. And then as a result, what we're able to message to consumers at this time of year, holiday shopping, important time for them and the food that they're buying and particularly so right now, looking for value, and we're able to offer that. So as a reminder, from a marketing standpoint, Grocery Outlet centralized marketing, a lot of tools and information that we push out complemented by operators. They continue to be a strong voice in their communities.\n\nAnd then, that partnership really sets us apart from the rest, we think, in terms of value in local and the personalization that the operators bring to it. We're really excited about our personalization app. So that will allow us to be even more targeted and specific to consumers. We're just on the verge here of going live in our Washington test stores, and that will help us speak more specifically to what customers are buying, the items that they like, the items that we know they like maybe they haven't found yet.\n\nAnd so, really look forward to use of that and then the data that it provides to be even more effective with our marketing efforts. In terms of SKU expansion, pleased with the progress we continue to make. We added another 150 items or so this past quarter. So year-to-date puts us close to 500, 700 over the past 12 months.\n\nHoliday time period is always a time when we're strategically introducing items, so feel good about the assortment we're representing now. I'd point to a few other recent examples. We have a test underway right now with grab and go home meal replacement items, early weeks still, but I'm pleased so far with the results. We continue to focus on NOSH, natural organic specialty healthy.\n\nThat continues to be a growth driver for us. And then, looking forward to as we've done, we will continue to strategically add items and categories. We think we've got a nice well round in assortment, but always opportunities as consumer trends and supplier assortments change.\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nThat's great. Thank you so much and enjoy your holidays.\n\nRJ Sheedy -- President\n\nThanks. You too.\n\nOperator\n\nThe next question we have is from Simeon Gutman from Morgan Stanley.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey, guys. Good afternoon, everyone. Simeon Gutman. So first maybe more with a technical modeling question, the flow through in Q3 and then implied in Q4, can you talk about, I guess, what if anything is changing at the margin? It looks a little bit, I guess, lighter on the incremental sales.\n\nAnd I know we've got some of the components, but curious if there's something high level we should be thinking about.\n\nCharles Bracher -- Chief Financial Officer\n\nYes, Simeon, it's Charles. Let me just talk to sort of the -- our expectations with respect to Q4, specific to gross margin and SG&A. As you heard in my prepared remarks, we expect Q4 gross margins of 30.3%, which is very typical in terms of our fourth quarter seasonal holiday mix impact. So that's, again, down 30 bps sequentially from the third quarter, reflecting that holiday mix.\n\nAlso, reflecting the fact that at the time when customers are really looking for savings, we are being especially sharp with respect to our seasonal assortment and pricing and expect to lead the market in terms of value. And so, as you compare against last year from a gross margin perspective, if you recall, Q4 last year, a bit of an anomaly for us at 30.9%. And -- but overall, I feel really good about how we're managing our margin with respect to the cost inflation environment we're dealing with. As it relates to SG&A, looking at the fourth quarter, we are expecting to see a bit more SG&A leverage in Q4 compared to Q3.\n\nI'd say overall, the same fundamental SG&A driver we're seeing, which is we are getting fixed cost leverage on the higher comps that we're delivering. That's being partially offset by higher incentive compensation. But specific to Q4, also expecting that commission expense is a leverage driver. Again, back to the higher Q4 gross margin we saw last year.\n\nSo of course, that's getting shared 50-50 with IO. So it really is that year over year Q4 margin rate differential, which will drive a little bit more SG&A leverage in Q4.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. Maybe the quick follow-up on Erik, just on timing. I apologize if I missed in prepared remarks, just stepping down the continuity with the IOs. And then, RJ, what does your bench look like in the next six to 12 months? Is it change at all from what it looks like today?\n\nEric Lindberg -- Chief Executive Officer\n\nYes. Simeon, Eric. I'll start, and then RJ can follow up. We're starting to transition immediately.\n\nIt will be effective first day of January 2023. And in terms of plan to have continuity with IOs. Part of what I'll be doing is spending some time each month out operationally in the stores, keeping the relationship with IOs, attending the IO meeting, which we'll have in February, the supplier conference in March and just being present at sort of bigger company meetings and maintaining relationships. But biggest thing I'll be doing will be supporting RJ, making this a seamless transition and just making sure that goes well.\n\nRJ Sheedy -- President\n\nSimeon, in terms of team and what might change, I'd say we have a great team, so no changes there. Naturally, some reporting changes as Erik to his new role, but otherwise, we got a great group leading this company. And then, I'd comment just more in general, looking forward, I've been with the business for quite a while now, have played a leading role in setting our strategy and growth initiatives. So no changes to strategy.\n\nThat will remain consistent as well the list of growth opportunities initiatives that we've been talking about for a while now. Continue to focus on our comp growth drivers of providing the deepest value, the unique treasure hunt, supporting operators and delivering the WOW! experience in the stores, driving customer awareness and engagement through marketing everything around new stores. So you'll continue to hear a lot of consistency from us and our efforts to continue to grow this business.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question we have is from Robbie Ohmes from Bank of America\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Can you hear me?\n\nEric Lindberg -- Chief Executive Officer\n\nYes, we can hear you fine.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nExcellent. Thanks. And RJ, congrats; and Eric, congrats as well. So my first question is the new customers that you are seeing anything different about them demographically that you can speak to? And where do you think they're coming from?\n\nUnknown speaker\n\nYes. So I'll take that one, Robbie. Yes. So we are very encouraged by what we're seeing with customers.\n\nMore new customers, also just note again, an increase in trip frequency overall spend is up, satisfaction levels are high, intend to shop high. So we feel really, really good about that. In terms of demographics, I'd say, continue to see a healthy mix. And as you know, the demographic range is quite broad.\n\nSo we appeal to a very broad set of consumers. I will note that we have seen, on average, a slightly higher income customer shopping and within our customers shopping at Grocery Outlet suggests us to trade-down behavioral change there for those customers that are feeling the pinch inflation. We do continue to see strength with lower income customers as well. we're more of a necessity item.\n\nAnd so, customers are looking for value and the things that they need to buy. And then, just one other final note. As we ask customers, what are the most important shopping criteria and the things that draw them to Grocery Outlet, we've seen a higher percentage of customers ranking low prices and unexpectedly great deals within that top set of things that they're looking for and why they're choosing to shop Grocery Outlet. So all really consistent with what we're seeing out in the market and some of those trends around inflation and consumers looking to save money.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nThat's helpful. And then, my second question is maybe a little bit of an intermediate-term question. What would it take -- your same-store sales at a really high rate. What kind of environment or what dynamics would you guys need to see the adjusted EBITDA margin instead of sort of flatlining around 6.5%, heading back over seven again.\n\nWhat -- when could we see something like that happen? And what combination of things would you guys need to see that happen?\n\nCharles Bracher -- Chief Financial Officer\n\nYes, Robbie, it's Charles. Let me tackle that one. I would say we feel great about the health of the business and how we're positioned heading into next year, still unclear to us exactly what the the backdrop will be presented with from an inflationary standpoint and potential recession here. But for us, we continue to orient around the long-term algorithm that we've always talked about being consistent so that low single-digit comp, 10% unit growth and stable margins.\n\nSo as you think about why stable margins, EBITDA margins over time. For us, it is about sharing those gross margin gains 50-50 with the IOs. And then, importantly, reinvesting in infrastructure and everything that we need to do to support future growth. So we feel great about how things are going and kind of where we're positioned heading into the year.\n\nBut we continue to think about that long-term algorithm is the one that's right for the business over the long term.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you.\n\nCharles Bracher -- Chief Financial Officer\n\nThanks, Robbie.\n\nOperator\n\nThe next question we have is from Leah Jordan from Goldman Sachs.\n\nLeah Jordan -- Goldman Sachs -- Analyst\n\nHi. Good afternoon. I just wanted to follow up on the gross margin discussion. What is the current view of your buying environment? And how has that evolved from the strong level that you mentioned last quarter? And then, the other pieces around kind of promotions, what is the current view of the promotional environment? And what are your expectations going into next year?\n\nRJ Sheedy -- President\n\nLeah, yes, I'll hit the first part, and then I'll pass it over to Eric to talk about promotions. In terms of supply, continue to be encouraged by the pipeline of deals that we're seeing. It's very broad-based. It's across all categories.\n\nI'd say the environment is just generally very positive right now from a buying standpoint. We have seen momentum grow throughout the year and continues into the quarter that we're in right now. So we feel really good about that. And as a result, inventory is healthy, and we're delivering customers great value for their holiday shop at a time when they need it most.\n\nIn terms of what we're seeing from suppliers, I'd mention a few things. One, forecasting challenges persist due to inconsistency in demand and supply chain challenges. So that yields opportunities for us. Product innovation is healthy.\n\nWe are seeing new items, brand extensions brand and label changes. So again, a good thing for our business. A lot of additional capacity has come online. And this, in many cases, has been mismatched with demand.\n\nand back to inconsistency. So we've seen some product and opportunities from that. And then, in general, I'd say suppliers are just very actively adjusting products and assortment. So whether it's to meet the ongoing changes in consumer needs and behaviors, or in some cases, throughout this year, inflation related with packaging sizes, availability and other changes.\n\nSo all these things very favorable for us and ultimately, our customers. So just feeling really, really good about opportunistic supply.\n\nEric Lindberg -- Chief Executive Officer\n\nYes. Leah, just briefly on the second part of your question, what are we seeing in terms of competition and promotional environment. It's pretty consistent. I wouldn't say it's changed a lot since our answer -- and that is that the promotional environment remains really stable.\n\nI'd say the traditional retailers are being pretty rational as they think about pricing still increasing because of all the cost pressure. They're being targeted on some of their specific offering discounts. Obviously, we've all seen the nonfood retailers sort of moving through heavy excess inventories. But relative to folks that we compare against and compete against, we've seen promotions being a lot more selective, I would say, probably not back to the levels that we saw in 2019.\n\nAnd just keep in mind, this model is super flexible, enables us to be very nimble and react to changes in that promotional environment as we see fit. But who knows when that changes. I don't have a crystal ball into next year. But for now, it's a very stable environment.\n\nLeah Jordan -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nOperator\n\n[Operator instructions] The next question we have is from Jeremy Hamblin from Craig-Hallum Capital Group.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nThanks for taking the question and congrats to both of you. I had two questions here. First is in terms of unit development as we look ahead to next year, fair to assume that some of these headwinds continue into next year and maybe not quite back to that 10% growth algorithm? And then secondly, I wanted to just understand a little bit more, it's been several quarters now that the Mid-Atlantic region has been outperforming. And any additional color that you can share on why you think that's the case? And is it less competition? Is there something about why the brand is resonating so well in that market?\n\nEric Lindberg -- Chief Executive Officer\n\nYes, Jeremy, Eric here. You heard me answer Oliver's questions, I won't repeat all of that. I would just say, yes, fair to say that a lot of the timing issues that we've detailed remain in place. Are they going to get better? Yes, we think they are.\n\nWhen? We're not exactly sure. So we're going to continue to adapt, keep signing up stores, putting through real estate and make sure we've got a really good slate of stores to open in the next 24 months. The is getting really good traction. We'll be near 30 stores, 30-plus stores at the end of the year.\n\nWe've put a lot into -- you've heard us in the past years talk about building the scale and the ability to open these stores and market and recruit IOs. We've done that a lot in the last couple of years. We feel like that foundation is set. The brand is starting to get nice awareness, something that's approaching the awareness numbers we have out in the West.\n\nSo that feels good. We put additional marketing into the market, which has been received very well. We're hearing back from the IOs through their customers and through surveys is the values are appreciated. The stores are incredibly relevant.\n\nThey love the model. They love the brands, particularly the NOSH, particularly So these are all the things that we thought would occur once you start to get a little bit more scale, a little bit more brand awareness. And we'd see that continuing as we add additional stores there and expand some of the geography where we're currently serving. So it's all good news.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks. Best wishes, guys.\n\nEric Lindberg -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext question we have is from John Heinbockel from Guggenheim.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nHey, guys. I wanted to start on the question. Where do you think you need to get to \"have scale\" and an ability to more significantly expand product assortment? And where would you -- when you think about items added right, you've added 700 items over the last year. How many items would you like to add on the East Coast, right, maybe relative to that as you move to scale, right, maybe get to, I don't know, 50 or 60 locations or more.\n\nEric Lindberg -- Chief Executive Officer\n\nJohn, 70 stores feels like scale -- the beginning of scale for us, quickly approaching that with the additions. I'll let RJ talk a little bit about sort of the desired variety in the east.\n\nRJ Sheedy -- President\n\nYes. When we talk about SKU expansion, John, it's not specific to the West. So those item counts for the most part available chainwide. Of course, we do have regional differences and different -- certainly different assortments as it relates to opportunistic product in the warehouse.\n\nBut to Eric's point, as we open more stores, it does help from an inventory standpoint, both in terms of localized assortment volume for everyday items and then for opportunistic as well and just being able to move more product through the system. I wouldn't say there's a specific number or end state as it relates to variety. That's -- in all stores, that's the number that we've seen continue to grow and for the better. We've been able to maximize space within the stores, increase inventory turns.\n\nThat's been done through both system enhancements and just the way that we manage inventory. And so, excited for all of the store growth ahead of us in the East and how it helps us from a merchandising and buying standpoint.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nMaybe secondly, right, when you think about your transition, what will you spend more time on, right, than you have been? What do you spend less on, right? And I guess, how do you tackle the CEO role in a way that is different, if at all, than Eric's?\n\nRJ Sheedy -- President\n\nYes. So I -- just in terms of where Eric has been more focused, I'd point to operator relationships, real estate, has certainly been heavily involved in the company vision, infrastructure. So I'd point to those areas as we've certainly been involved, but look for my level of attention and focus to increase stepping into the CEO seat. As you know, John, I've had direct responsibility for purchasing planning, supply chain, marketing operations, technology, lots of different operating parts of the business together with strategy.\n\nAnd Eric and I and the rest of the team managed this business in strong partnership, collaboration and feel really good about continuity within the team overall. To the second part of your question, I think a similar answer to the one that I gave previously, no major changes to strategy, no major changes to initiatives. We do follow what we have. We'll continue to follow a disciplined annual strategic planning process.\n\nIt's always a balance of near-term and long-term view. So none of that changes. And as we move forward here, we'll continue to keep you updated on future initiatives and the evolution of the business.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nThank you.\n\nRJ Sheedy -- President\n\nThank you.\n\nEric Lindberg -- Chief Executive Officer\n\nThanks, John.\n\nOperator\n\nThe next question is from Joe Feldman from Telsey Advisory Group.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nYeah. Hey, guys. Thanks for taking the question. I wanted to ask on the digital side.\n\nI know it's still emerging and small. But I'm wondering if you're seeing any patterns with the way customers are interacting with you that are -- those that are using digital? Are there certain products they're trending toward or certain maybe basket size or are the higher-end consumers, lower end consumers? Like any kind of trends you could talk about with regard to the digital side of things?\n\nRJ Sheedy -- President\n\nYes. Yes, I'd say more specifically, the difference that we're seeing is just the makeup of the customer base. So we talk about the incrementality of e-commerce and what it's offered to us so far is still early. Again, just rolled out with -- well, with Instacart earlier this year and then more recently, DoorDash, and we're just on the verge here with Uber.\n\nBut it is a more convenience-based customer. So that would be the biggest difference that I would point to between the three platform partners that we're working with. They each have slightly different use cases, customer groups, reasons and occasions for which they're shopping online. So we see some slight differences there.\n\nOverall, we do see a bigger basket in terms of what they're shopping, I'd say, pretty broad representation of our assortment. And so, they're finding all items gravitating, of course, the value in the deals that we're providing, and those are across all categories. So nothing so specific in terms of the basket itself or the mix. But overall, pleased.\n\nIt's been a nice rollout for us, seamless for the operators, incremental sales and profit dollars for both Grocery Outlet and IOs. And we'll keep you posted on future enhancements. We've been focused on rolling out with these three partners and then certainly plenty of opportunity as it relates to different forms of e-commerce delivery, pickup and other enhancements that we look to make from an online merchandising and ultimate customer experience.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nThat's great. And then, just another one on -- with regard to inflation, I was kind of curious if you could share how much it maybe contributed to sales, or asked another way, how you're thinking about it going forward as well? Just especially heading into next year, and what's kind of -- I assume it's baked into the guidance, but just kind of what level might be baked into.\n\nEric Lindberg -- Chief Executive Officer\n\nYes. We're not going to provide a whole lot of guidance on next year until Q4. I'd say, look, this model is one that I would describe as really resilient. It works well and a whole bunch of different macro environment backdrops.\n\nJust looking back over history, you can see some really stable comps in margins throughout the year. So that to us says that this flexibility is definitely an advantage. Particularly on next year and what we're thinking about inflation, we're really expecting disinflation. Prices have gone up quickly and stayed.\n\nI think they'll be a little bit sticky and people will not repeal those and pull them back as quickly. So I think the pricing will be a little bit more sticky. We're not expecting deflation, but we would expect to see some disinflation. And then, look, no crystal ball on recession, that's tied into that question as well.\n\nWe just know that when customers are pressed hard on purchasing power of shines. Every situation is a little bit different. But the last time we had a pretty strong recession, '08, '09, we had some really nice numbers. So we will just continue to focus on delivering value to the customers and take what we get relative to the backdrop.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nSounds great. Thanks. Good luck with the quarter and congrats to you guys, to RJ, especially.\n\nRJ Sheedy -- President\n\nThanks, Joe.\n\nOperator\n\nThank you. The next question we have is from Mark Carden from UBS.\n\nMark Carden -- UBS -- Analyst\n\nGood afternoon. Thanks so much for taking my question. First, congratulations to both of you, Eric and RJ, the transition and next quarter. When you look at your traffic trajectory, how does it compare with what you saw in the early days of the '08, '09 recession? As the acceleration come at a similar pace? Is trade down coming any faster this time around? And what tools do you think will be most impactful in holding on to your new shoppers longer term?\n\nEric Lindberg -- Chief Executive Officer\n\nI'd say it's really different. The business is much more mature now. Just the offering, marketing, our brand awareness today versus 10, 11, 12 years ago. I'd say the offering, the variety, the freshness, the NOSH, some of the categories we've been talking about for a few years are much more developed.\n\nJust the store count from 120 or 130 back then to 430 now. The brand awareness, we repurposed the brand once or twice since then. So I would say similar patterns in terms of new customers coming in, perhaps you'd call it, trade down people moving from regular retail, traditional down into grocery out looking for value. That's pretty similar.\n\nBut it's just -- it's a different business with a lot of the same themes. It's just -- I'd rather have the model we have today than the one we had in '08 or '09 because we're just so much more advanced in what we offer and how we take care of the customer.\n\nMark Carden -- UBS -- Analyst\n\nFair enough. And then, as a quick follow-up, can you talk through what you saw from a monthly cadence perspective on your comp? Presumably, you saw a pretty big spike mid-quarter. Where do you think the biggest source of upside was relative to what you might have expected three months back?\n\nCharles Bracher -- Chief Financial Officer\n\nYes, Mark, it's Charles. Definitely, the acceleration we saw was related to traffic as you think about the Q2 to Q3 trends. Really pleased with the overall health of comp and how balanced it was and we slice and dice it across vintage stores, geography, departments, it was very healthy. In terms of the cadence over the quarter, it was also quite consistent.\n\nSo I just feel really good about the momentum that we're seeing in the business and that nice uptick in traffic that we saw from Q2 to Q3. So like where we stand in Q4 here, still cognizant of the fact that it is a fluid environment. There's a lot here to play out in terms of exactly where inflation goes and the impact of Fed raising rates and consumer confidence. So all those things being a bit more prudent as you probably saw with respect to our Q4 three-year stacked comp expectations.\n\nBut again, really happy with the health of the comp base.\n\nMark Carden -- UBS -- Analyst\n\nThanks so much. Good luck.\n\nCharles Bracher -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. The next question he is from Mike Baker from D.A. Davidson.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nOK. Two real quick because it's getting close here to the hour. One, any thoughts, any color on units per transaction or we know that the ticket was up, but was it all inflation driven? Or are you seeing more unit transaction really what I'm getting at. Anything that tells us that the consumer is trading down or buying fewer items per trip or anything along those lines that gives us insight into consumer?\n\nCharles Bracher -- Chief Financial Officer\n\nYes. Mike, it's Charles. I'd say overall, if you look at the basket, very similar trends in Q3 relative to Q2. So to your point, it's coming from higher AURs.\n\nUnits are down slightly versus last year. Again, we're comparing against a COVID elevated base and higher levels of trip consolidation last year. But that overall -- so the aggregate unit number holding steady for the past three quarters and again, slightly ahead of where it was pre-pandemic. So feels really good to us.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nOK. That's helpful. And then thinking about 2023 and the comments you just made about prices being sticky, there are some costs that might come down. First of all, presumably, you're lapping some big incentive comp this year.\n\nin transportation, supply chain costs, maybe they don't go down, but they don't go up as much. It's unclear exactly what happens there. But I guess the point is, is there an opportunity for some margin enhancement next year if prices are sticky and you don't have the same level of cost increases that we're seeing in 2022 on a couple of different lines.\n\nCharles Bracher -- Chief Financial Officer\n\nYes. Yes, perhaps, again, we don't want to get in front of ourselves and actually provide specific guidance right now. We'll do that in our normal cadence on the Q4 call. But yes, when you look at this year, we are, of course, seeing better comp growth, but that's coming with slightly lower gross margins and EBITDA margins as we feel the impact of cost inflation, as well as higher incentive compensation, as we've talked about on the SG&A line.\n\nSo as we think about next year and beyond, back to the long-term algorithm would we see those things normalize over time. It's just not a matter of if, but when.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nWell, if I could squeeze in one more follow-up then. So the margins are down a little bit versus pre pandemic, they were -- EBITDA was 7% right in that range. They are down a little bit because of some of those costs. So when you say stable, is it stable from a new base, which we've been this year and last year around $6.3 million? Or is it stable versus where it was pre-pandemic?\n\nCharles Bracher -- Chief Financial Officer\n\nWe would say that we are confident that we can get back to those pre-inflation margins over time. So when you think about 2019 as a benchmark of a 30.8% gross margin, 6.6% EBITDA margins, we're fully confident that we'll get back to that -- to those levels over time.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nVery helpful. I appreciate the color. Thank you.\n\nCharles Bracher -- Chief Financial Officer\n\nSure.\n\nOperator\n\nThank you. The next question we have is from Corey Tarlowe from Jefferies.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nHi, good afternoon. Thanks for taking my question and congrats, Eric and RJ on the new roles.\n\nRJ Sheedy -- President\n\nThank you.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nSo firstly, I was wondering if you could just talk about labor availability, what that looks like at present as you look to open your new stores throughout the remainder of this year?\n\nEric Lindberg -- Chief Executive Officer\n\nYes. So if you're talking about IO availability, really strong, continued momentum on the recruiting side and the trading side, lots of people interested. Those numbers from last year are up this year. We think it's purely the opportunity of people telling people and then the recruiting efforts.\n\nIn terms of labor in the stores, still challenging, still expensive. I would say it's not as tight as it was this time last year or even at the beginning of this year. But I would not say from our trips and travels out with the stores and our regional conference we just did that we're out of the woods yet on labor. We would anticipate that getting a little bit easier next year, but it's been slow to recover for the operators.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGot it. And then, Charles, could you just talk a little bit more about inventory and how you're expecting that to evolve throughout the remainder of this year?\n\nCharles Bracher -- Chief Financial Officer\n\nYes. We feel really good about the health of inventory here in the fourth quarter. So again, up 4% versus Q2, up more significantly year over year. Again, keep in mind that with our model, those inventory changes are not necessarily linear.\n\nSo comparing versus is a bit skewed for a variety of reasons. But feel great about where we're positioned here for the fourth quarter and just the health across categories and items and again, back to the strength of the holiday assortment that we're putting forth. And would expect it as we exit the year to come down modestly from where we entered the quarter.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGreat. Thank you very much. And best of luck.\n\nCharles Bracher -- Chief Financial Officer\n\nThank you.\n\nEric Lindberg -- Chief Executive Officer\n\nThanks, Corey.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of our question-and-answer session. I would now like to turn the floor back over to Eric Lindberg for closing comments. Please go ahead, sir.\n\nEric Lindberg -- Chief Executive Officer\n\nThanks, operator. Thanks, everyone, for joining us. Thanks for your time. Look forward to catching up with you shortly, and we'll talk to you soon.\n\nBye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nArvind Bhatia -- Vice President, Investor Relations\n\nEric Lindberg -- Chief Executive Officer\n\nRJ Sheedy -- President\n\nCharles Bracher -- Chief Financial Officer\n\nOliver Chen -- Cowen and Company -- Analyst\n\nKrisztina Katai -- Deutsche Bank -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nUnknown speaker\n\nLeah Jordan -- Goldman Sachs -- Analyst\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nMark Carden -- UBS -- Analyst\n\nMike Baker -- D.A. Davidson -- Analyst\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nMore GO analysis\n\nAll earnings call transcripts"
}