{
  "companyName": "Ship Finance International",
  "companyTicker": "SFL",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/ship-finance-international-sfl-q2-2022-earnings-ca/",
  "content": "Ship Finance International (SFL 0.44%)\nQ2 2022 Earnings Call\nAug 17, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the second quarter 2022 SFL Corporation earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Ole Hjertaker.\n\nPlease go ahead.\n\nOle Hjertaker -- Chief Executive Officer\n\nThank you, and welcome, everyone, to our second quarter conference call. I will start the call by briefly going through the highlights of the quarter. And following that, our CFO, Aksel Olesen, will take us through the financials. And then, the call will be concluded with the opening up for questions.\n\nOur chief operating officer, Trym Sjolie, will also be present the Q&A session. Before we begin our presentation, I would like to note that this conference call will contain forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. Words such as expects, anticipates, intends, estimates or similar expressions are intended to identify these forward-looking statements.\n\nForward-looking statements are not guarantees of future performance. These statements are based on our current plans and expectations and are inherently subject to risks and uncertainties that could cause future activities and results or operations to be materially different from those set forth in the forward-looking statements. Important factors that could cause actual results to differ include, but are not limited to, conditions in the shipping, offshore and credit markets. You should therefore not place undue reliance on these forward-looking statements.\n\nPlease refer to our filings with the Securities and Exchange Commission for more detailed discussions on the risks and uncertainties, which may have a direct bearing on our operating results and our financial condition. The total charter revenues in the quarter were $165 million with the vast majority for vessels on long-term charters and only 17% for vessels employed on short-term charters or in the spot market. The EBITDA equivalent cash flow in the quarter was approximately $124 million. And over the last 12 months, the EBITDA equivalent has been approximately $476 million.\n\nThe net income came in at around $57 million in the quarter or $0.45 per share. This includes a gain on sale of vessels of $13 million in the quarter and also positive mark-to-market on interest rate swaps and equity in Suezmax. The announced dividend of $0.23 per share is an increase of 4.5% over last quarter's dividend and represents a dividend yield of around 8.7% based on closing price yesterday. This is our 74th quarterly dividend.\n\nAnd over the years, we have paid more than $28 per share in dividends or nearly $2.5 billion in total, and we have an increasing fixed rate charter backlog supporting continued dividend capacity going forward. Our fixed rate backlog has increased significantly over the last year and stands at approximately $3.6 billion from owned and managed vessels after recent acquisitions and charters, providing continued cash flow visibility going forward. The backlog figures excludes revenues from the vessels traded in the short-term market and also exclude any contribution from future profit share optionality. Today, we announced the acquisition of four modern eco-design Suezmax tankers.\n\nPurchase prices agreed to $222.5 million, and we expect to take the delivery of the vessels very shortly and within the next two months. Concurrently, we have agreed to charter the vessels to a subsidiary of Koch Industries, an investment-grade U.S.-based industrial conglomerate. The transaction is adding $250 million to a fixed rate charter backlog, and we are pleased to go -- to further expand our presence in the tanker market at what we believe is an attractive point in the cycle with historic low order book in the segment. The transaction also demonstrates our standing in the market as a high-quality provider of transportation services, including technical management, vessel operations and vetting for industry-leading customers.\n\nWe expect full cash flow effect from the vessels early in the fourth quarter with an estimated annual EBITDA contribution of approximately $30 million. The sale of the last two VLCCs on charter to Frontline marks the end of an era, and demonstrates the transformation SFL have gone through over the last few years. Initially, Frontline was our only customer and the fleet consisted of nearly 50 crude oil tankers, but all have been sold and the proceeds have been used to reinvest in newer and more efficient assets. We also sold a 19-year-old 1,700 TEU container vessel, MSC Alice, early in the quarter.\n\nAnd in total, the sales generated net cash proceeds of $48.5 million after repayment of associated debt. And we recorded a gain of more than $30 million in the quarter relating to these sales. We had a strong cash position of $224 million at the end of the second quarter, and we have increased liquidity through refinancings of some assets where we have secured new strong charters, but the debt was amortized to low levels. This enables us to move swiftly on transactions like the four Suezmaxes we announced today, and we are continuously looking for further opportunities to build our portfolio with accretive assets.\n\nWe also own two harsh environment drilling rigs, Linus and Hercules, which have been chartered to subsidiaries of Seadrill for a number of years. In connection with Seadrill's emergence from Chapter 11 in the first quarter, it was agreed that the long-term drilling contract for Linus with ConocoPhillips will be assigned from Seadrill to an SFL subsidiary. This represents a backlog of more than $450 million at today's charter rate, and the change will be effective as soon as customer in Norwegian regulatory approvals have been obtained OCL Technology is managing this for us, and the process is going very smoothly. We therefore expect it to be completed before the end of this quarter.\n\nThe harsh environment semisubmersible rig, Hercules, will remain on charter to Seadrill, while it is finalizing a drilling contract with an oil major before redelivery to SFL in Norway currently estimated in the fourth quarter. The rig is marketed for new charter opportunities in 2023 following completion of its special product survey expected in the first quarter of '23. This rig will be managed by OCL Drilling, and there is good progress on new charter opportunities. The rig is one of only a handful of rigs fully equipped to drill in the harshest arctic environment, and market analysts are positive to market prospects with several new tenders expected in the near term, particularly in Norway.\n\nWe will, of course, follow with the market very closely and we will announce future employment in due course. Including today's transaction are backlog from owned and manage shipping assets stands at $3.7 billion, up from $3.6 billion in the previous quarter. Over the years, we have changed both fleet composition and structure, and we now have 75 merited assets in our portfolio. As I mentioned earlier, over the years, we have gone from a single asset class chartered to one single customer to a diversified fleet and multiple counterparties.\n\nAnd over time, the mix of assets and charter backlog has varied from 100% tankers to nearly 60% offshore 10 years ago to container vessels now being the largest segment with 54% of the backlog. Most of the vessels are on long-term charters. And in the quarter, only 17% of charter hire was from vessels in the spot market. Also, we have nearly 90% of charter revenues from our shipping assets on time charter contracts and only 10% on bareboat or dry lease.\n\nIn addition to fixed rate charter revenues, we have had significant contribution to cash flow from profit share over the time, both relating to charter rates and fuel savings. The aggregate profit share was $24 million last 12 months and $5.2 million in the second quarter. We do not have a set mix in the portfolio, focus is on evaluating deal opportunities across the segments and try to do the right transaction from a risk-reward perspective. Over time, we believe this will balance itself out.\n\nBut we try to be careful and conservative in our investments with a focus on technology and transition over time to more fuel-efficient vessels. The strength of our counterparties and diversification is key when we assess our portfolio and quality of our contracted backlog. And the list speaks for itself with market-leading operators like Maersk, Hapag-Lloyd, ConocoPhillips, P66, Koch and Volkswagen, to name a few. Relatively few of our customers are intermediaries where we have had -- where we've less visibility on the use of the assets and quality of operations.\n\nStrategically, this also gives us access to more deal flow opportunities such as the repeat business with Maersk, MSC, Evergreen, and Trafigura, for example. Our strategy has therefore been to maintain a strong technical and commercial operating platform in cooperation with a sister companies in the Seatankers Group. This gives us the ability to offer a wider range of services to our customers from structured financing to full service time charters. And with full control over vessel maintenance and performance, including energy efficiency and emission minimizing efforts, we can impact improvements to our vessels through the life of the assets, and not only be passively owning vessels employed on bareboat where the customer may not always have an incentive to make such improvements.\n\nIn addition, we can retain more of the residual value in the assets when we charter out on time charter basis, and in the current environment with rising raw material costs and inflation driving replacement cost for vessels, this values for the benefit of SFL and our stakeholders. For bareboat deals, this value is usually retained by the charterer through fixed price purchase options. And with that, I will give the word over to our CFO, Aksel Olesen, who will take us through the financial highlights for the quarter.\n\nAksel Olesen -- Chief Financial Officer\n\nThank you, Mr. Hjertaker. On this slide, we have shown our pro forma illustration of cash flows for the second quarter. Please note that this is only a guideline to assess the company's performance and is not in accordance with U.S.\n\nGAAP and also net of extraordinary and noncash items. In the second quarter, the liner fleet generated gross charter hire of approximately $89 million, including approximately $3.8 million in profit share contribution related to fuel savings on some of our large container vessels. At the end of the second quarter, SFL's liner fleet backlog was approximately $2.4 billion, with an average remaining charter term of approximately 4.9 or 7.5 years if weighted by charter hire. In the second quarter, SFL has a fleet of 16 crude oil products and chemical tankers with majority employed on long-term charters.\n\nThe tanker fleet generated approximately $35 million in gross charter during the quarter compared to $30 million in the previous quarter as several Trafigura vessels at the first full quarter of revenue, as well as two Suezmax tankers and two smaller chemical tankers trading in the spot and short-term charter market. The net charter hire from these vessels was approximately $6.6 million in the second quarter compared to approximately $3.5 million in the first quarter. Furthermore, the company expects the recent announced Suezmax tankers on charter to cost -- to have full cash flow effect from early in the fourth quarter with an estimated EBITDA contribution of $7.5 million per quarter. The company has 15 dry bulk carriers, of which 10 were employed on long-term charters during the quarter.\n\nSFL generated approximately $31 million in gross charter hire from the dry bulk fleet in the second quarter, including $1.4 million of profit share. five vessels were employed in the spot and short-term market and contributed approximately $13.4 million in net charter hire during the second quarter compared to approximately $8 million in the previous quarter. As well on two drilling rigs, which have been charted out of subsidiaries of Seadrill on variable terms. In the second quarter, the company received a charter hire of approximately $10 million from the rigs.\n\nThis summarizes an adjusted EBITDA of approximately $124 million for the second quarter compared to $119 million in the first quarter. We then move on to the profit and loss statement as reported on the certificate. As we have described in previous earnings calls, our accounting statements are different from those of a traditional shipping company, that our business strategy focuses on long-term charter contracts. A large part of our activities are classified as capital leasing.\n\nTherefore, a significant portion of our charter revenues are excluded from U.S. GAAP operating revenues. This includes repayment of investment in sales types, direct financing leases and leaseback assets and revenues from entities classified as investment in fleets for accounting purposes. So for the second quarter, we report total operating revenues according to U.S.\n\nGAAP of approximately $153 million, which is less than approximately $165 million of charter hire actually received for the reasons just mentioned. The company recorded a gain of approximately $13.2 million following the sale of the feeder container vessel, MSC Alice, and the two front container vessel during the quarter. Also, the company recorded profit share income of approximately $1.4 million from our 8x capesize drybulk vessels in addition to approximately $3.8 million from fuel saving arrangements for some of our large containers. Furthermore, the company recorded a $3.7 million gain related to positive mark-to-market effects related to interest rate swaps.\n\nAt quarter end, approximately 75% of our debt were swapped or fixed, and based on our assumptions, we estimate that a one percentage increase in interest rates from current levels equals approximately $0.02 per share in lower distributable cash flow per quarter and vice versa. The majority of our corporate debt is fixed, and when evaluating new investment opportunities, we take a conservative approach when assuming the interest rate costs during the life of the project, we generally seek to fix the interest rates back-to-back if the fixed charter duration will include an interest rate adjustment in the charter rates. Also, the company recorded a $1.2 million gain related to positive mark-to-market effects related to equity and debt investments, a gain from redemption of funds of $1.4 million and a decrease of $900,000 in credit loss provisions. So overall, and according to U.S.\n\nGAAP, the company reported a net profit of approximately $57.4 million or $0.45 per share. Moving on to the balance sheet. At quarter end, SFL had approximately $224 million of cash and cash equivalents. And in addition, we also expect to free up approximately $50 million from the refinancing of 10 dry bulk vessels during the third quarter.\n\nFurthermore, the company has marketable securities of approximately $21 million based on market prices at the end of the quarter. The company had four debt-free vessels at quarter end with a combined charter value of approximately $74.5 million based on average broker appraisals. The approximately $240 million of remaining capex on our four-car carriers under construction is expected to be financed by senior debt facilities similar to SFL's other assets with long-term charters. And we expect the senior bank financing for the recently announced Suezmax tankers on charter to subsidiaries of Koch Industries were concluded during the fourth quarter.\n\nBased on Q2 numbers, the company had a book to equity ratio of approximately 29.1%. Then to conclude. The board has declared a cash dividend of $0.23 per share for the quarter, the fourth consecutive dividend increase, and over the past 12 months, the dividend has been increased at more than 50%. The recent sale of the two VLCCs on charter to Frontline represents a milestone for the company, and this was our first and sole customer and all our vessels for crude oil tankers.\n\nToday, we have a diversified fleet of modern assets on long-term charters to multiple industry-leading counterparties. Through recent acquisitions, we have established new business relationships with exclusive customers, such as Trafigura, Hapag-Lloyd, ConocoPhillips, and most recently, Koch Industries. The recent transactions also confirm our commitment to continuously improve the quality of the fleet by disposing of older less economical assets and reinvest in modern and more fuel-efficient assets. Following our recent investments and charter arrangements this year, we have added more than $1.3 billion to the fixed charter rate backlog which now stands at $3.7 billion, providing us with strong visibility on future cash flow, debt service and continued distribution capacity.\n\nAnd with a strong balance sheet and significant investment capacity, SFL is very well positioned to execute on new accretive investments as we continue to create shareholder value. Finally, we have seen a strong recovery in the offshore drilling market since the beginning of the year. And our two harsh environment drilling rigs are well positioned to benefit from the increased activity level in the sector. One rig is employed on long-term market adjusted charter rate, while the other rig is available for new contracts in 2023.\n\nAnd with that, I give the word back to the operator, who will open the line for questions.\n\nOperator\n\n[Operator instructions] And the first question comes from the line of Liam Burke from B. Riley Financial. Your line is open. Please ask your question.\n\nLiam Burke -- B. Riley Financial -- Analyst\n\nYes, thank you. Asset values and certain vessel classes are exceedingly high. You mentioned low order books in some sectors. Are there any particular assets that you see would be attractive sales to raise additional cash?\n\nOle Hjertaker -- Chief Executive Officer\n\nWell, as we say here, everything is for sale at the right price. Of course, our main focus is long-term charters, and of course, to service those long-term charters, you need to keep those assets. We do have some assets with shorter charters and also some assets that are currently trading in the spot market. We, for instance, have five Supramax bulkers that have been on long-term charter and has come back from those.\n\nThe last one was delivered earlier this year. We have two chemical carriers that also came off a charter earlier this year. So we have some assets from time to time. But of course, it's all about timing and getting sort of the right bang for the bucks.\n\nSo we evaluate that all the time. And just -- sort of just when I joined SFL, it's 16 years ago now, we had around 50 vessels. In the meantime -- and right now, we have 75. But in the meantime, we have purchased 125 vessels and sold 100 vessels.\n\nSo I would say this is sort of a natural part of the business. And of course, our focus is to reinvest and in newer, more modern vessels, and this is going to continue, I would say, gradually over the next period.\n\nAksel Olesen -- Chief Financial Officer\n\nYes. I'm also adding to that. We have a very strong liquidity position currently and also released some additional cash through refinancing of our assets. So I think we were in position to grow.\n\nLiam Burke -- B. Riley Financial -- Analyst\n\nFair enough. When you're looking on the acquisition side, you mentioned that the tanker cycle is looking very attractive there. Would that be more where you would want to invest in the larger VLCCs or Suezmaxes vis-a-vis where the purchase of a container vessel might -- where they are in the cycle be less attractive?\n\nOle Hjertaker -- Chief Executive Officer\n\nWell, you can say academically, we would invest in any sector. It's all about how you structure the transaction, how you manage risk. So you could say we would still look at container ships, but it's got to be with very strong counterparties and structured so we can effectively amortize it over the charter period to more of a mid-cycle depreciated value. So that all goes into that equation before we decide on how we're going to go forward with an acquisition or not.\n\nSo we'll look at all segments at any one time. And I think from our side, we believe that's a strength having a diversified asset approach or market approach because what we have seen over time is that companies that are in one segment only are almost programmed to go bankrupt almost. Because what we see is that, typically, when the capital markets are open and when the banks are eager to lend money, that's typically at the top of the market. So while -- when you're lowering the cycle in a segment, there is no way you can raise equity and banks are reluctant, so it's so tempting to take the money at the top of the market and reinvest in the wrong assets.\n\nSo what we do instead, we look at all these segments at the same time, and therefore, try to -- if we think that things are running a little bit too fast in one segment, we switch your attention to other segments. But still, even if we are high in the cycle, then we will try to be very, very focused on risk mitigation factors before we decide to invest despite, call it, the normal cycle movements than the others than if we believe we are lower in the cycle. But back to your point, we think tanker market looks interesting. We wouldn't mind do more on the tanker side, but it has to be in combination with the right asset with the right counterparty with the right charter rate structure where we can, again, depreciate it down to the right level.\n\nSo we look at that all the time.\n\nLiam Burke -- B. Riley Financial -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. Dear speakers, there are no further questions. And I would like to hand over back to Ole Hjertaker for closing remarks.\n\nOle Hjertaker -- Chief Executive Officer\n\nYes. Then I would like to thank everyone for participating in this conference call, and also thank the SFL teams on board the vessels and onshore for their continued efforts in delivering value for our stakeholders. If you do have any follow-up questions, there are contact details in the press release or you can get in touch with us through the contact pages on our web page, www.sflcorp.com. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nOle Hjertaker -- Chief Executive Officer\n\nAksel Olesen -- Chief Financial Officer\n\nLiam Burke -- B. Riley Financial -- Analyst\n\nMore SFL analysis\n\nAll earnings call transcripts"
}