{
  "companyName": "ZimVie Inc.",
  "companyTicker": "ZIMV",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/zimvie-inc-zimv-q3-2022-earnings-call-transcript/",
  "content": "ZimVie Inc. (ZIMV 1.19%)\nQ3 2022 Earnings Call\nNov 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to ZimVie's third quarter 2022 earnings conference call. [Operator instructions] As a reminder, this call is being recorded for replay purposes. I would now like to turn the call over to Marissa Bych from Gilmartin Group Investor Relations for a few introductory comments.\n\nMarissa Bych -- Investor Relations\n\nThank you all for joining today's call. Earlier today, ZimVie released financial results for the quarter ended September 30, 2022. A copy of the press release is available on the company's website, zimvie.com as well as on sec.gov. Before we begin, I'd like to remind you that management will make comments during the call that include forward-looking statements.\n\nActual results may differ materially from those indicated by the forward-looking statements due to a variety of risks and uncertainties. Please refer to the company's 2021 Form 10-K and subsequent SEC filings for a detailed discussion of these risks and uncertainties. Additionally, the discussion on this call will include certain non-GAAP financial measures. Reconciliations of these measures to the most directly comparable GAAP financial measures are included within the earnings release and/or the investor deck issued today found on the Investor Relations section of the company's website, zimvie.com.\n\nThis conference call contains time-sensitive information and is accurate only as of the live broadcast today, November 9, 2022. ZimVie disclaims any intention or obligation, except as required by law, to update or revise any financial projections or forward-looking statements whether because of new information, future events or otherwise. And with that, I will turn the call over to Vafa Jamali, president and chief executive officer of ZimVie.\n\nVafa Jamali -- President and Chief Executive Officer\n\nGood afternoon, and thank you all for joining us. I'm on the call today with Rich Heppenstall, our chief financial officer. I'd like to kick off our call by providing an update on the operational progress we've made post separation and then reviewing our financial performance for the quarter ended September 30, 2022. It remains early days for ZimVie, and we're very pleased with the progress we've made on both the operational and organizational fronts in this short period of time.\n\nDespite a challenging macro environment and significant technical pressure to our shares as a function of post-spin trading dynamics, we remain confident in executing the long-range turnaround plan that we instituted earlier this year and see significant opportunity ahead. During our Investor Day in February, we identified three key priorities building a strong foundation for the future of ZimVie. First, we committed to establishing a world-class leadership team with the right talent across the organization to drive long-term growth. Today, our team is intact, bringing collective vision, an experience to drive value for ZimVie, its employees and its patients.\n\nSecond, we committed to optimizing systems and operations. To this end, we successfully separated operating from our former parent, Zimmer Biomet. We've also identified the greatest opportunities facing us that helped us sustain operational excellence. We are now implementing work streams to capitalize on these opportunities.\n\nAreas of focus here include inventory management, facility consolidation, manufacturing excellence, and creating a nimble organizational structure. Our third priority is to create a portfolio of innovation to address sustained growth across both our spine and dental portfolios. On this front, we've already launched several new and next-generation products in the market, all in the short period of time since the spin-off. Last week, we launched our next-generation TSX dental implant designed for immediate extraction and loading protocols as well as placement predictability and primary stability in the soft and dense bone.\n\nWe're hearing strong early feedback and engagement trends from the field. This launch comes off the heels of our T3 PRO and Encode Emergence launches in June, both of which have seen strong demand in the first few months of availability. These products offer an optimized implant experience for both dentists and patients. And we are excited to share that we'll have additional iterations to our product portfolio into 2023 and beyond.\n\nWe also recently announced the launch of an exciting new innovation in our spine business, the Virage Navigation System, which allows the navigation of bone preparation instruments and poly axle screws in the spine as compatible with commercially available navigation systems. This compatibility with third-party navigation system supports our desire to be more active in the minimally invasive MIS procedures, where we believe innovation can help improve overall patient outcomes. We will continue to evolve our spine portfolio, innovating on and around our existing solutions such as our differentiated motion preservation devices like our Mobi-C Cervical Disc to improve physician experience and workflow while building on our long-standing track record of excellent patient outcomes. This includes exploring opportunities to expand our presence and compatibility in the ASC setting.\n\nEnabling technology remains an area of significant interest to us. And we see a real unmet need and substantial opportunity to drive pull-through of our current core spine portfolio and our differentiated motion preservation solutions. And we hope to provide additional updates here in the future. Turning to our performance in the quarter.\n\nWe delivered $213.3 million in total third-party net sales, declining 11% on a reported basis and 7% on a constant currency basis. Our results in the quarter were impacted to an extent by a stronger-than-typical summer seasonality in the July and August months, partially offset by a more favorable September volume. Rich will provide greater detail on our quarterly performance shortly. Before I turn over the line, I want to reemphasize our steadfast dedication to innovating and executing across our business segments to drive future growth.\n\nOur mission is to advance clinical technologies foundational to restoring daily life. And we will continue to bring innovative products to market to drive our top line and create shareholder value while addressing real patient needs in the dental and spine markets. I will now hand over the line to Rich Heppenstall, our chief financial officer.\n\nRich Heppenstall -- Chief Financial Officer\n\nThanks, Vafa, and good afternoon, everyone. I'll begin by reviewing our third quarter 2022 results, and we'll then close by providing commentary on our outlook for the full year 2022. Beginning with sales, total third-party net sales for third quarter of 2022 were $213.3 million, a decrease of 10.6% on a reported basis and a decrease of 6.8% in constant currency. Excluding the negative impact of foreign exchange, third-party net sales revenue were $222.1 million.\n\nShifting on to our key segments. Global dental third-party net sales were $105.1 million, representing a 3.9% decrease on a reported basis and a 1.6% increase in constant currency as compared to the prior-year period. Our performance was primarily driven by growth in implants and biomaterials, offset by a decline in capital sales and foreign currency exchange headwinds, primarily net sales denominated in Europe. Our Q3 sales were also negatively impacted by approximately $1 million equating to roughly one percentage point of growth in the quarter due to a one-day shutdown of our Palm Beach Gardens facility during Hurricane Ian.\n\nIn the U.S., dental third-party net sales of $66.7 million decreased by 1.1%, hampered by the loss of one shipping day from the hurricane, as mentioned earlier. Outside of the U.S., sales of $38.4 million decreased by 8.4% on a reported basis but increased 5.8% in constant currency. Our outside the U.S. net sales also grew sequentially following a weaker Q2 as we saw a bounce back in procedure volumes in September following the prolonged vacation season in July and August.\n\nGlobal spine's third-party net sales were $108.2 million, a 16.4% decrease on a reported basis and a 13.9% decrease in constant currency when compared to the prior-year period. The decrease in spine sales was driven by the exit of certain unprofitable markets in late 2021, product discontinuation from our brand rationalization program, the impact of the net sales retained by Zimmer Biomet until we complete our separation activities in certain markets, moderately greater procedure seasonality in July and August and continued competitive pressures. When adjusting for the exit of certain unprofitable markets in late 2021, the discontinuation of products as part of brand rationalization, and the net sales retained by Zimmer Biomet, spine sales decreased by 10.3% and 7.7% on a reported and constant currency basis, respectively. Adjusted gross profit was $155.0 million, compared to $153.7 million in the prior-year period.\n\nAdjusted gross margin was 72.7%, an increase of 830 basis points when, compared to 64.4% in Q3 of 2021. The increase in gross margin versus prior year is driven by an overall reduction in year-over-year inventory charges as we continue to operationalize the business and the release in the current quarter of a spin-related contingency with Zimmer Biomet. Although we are pleased with the progress we have made spin to-date on our operational initiatives and optimizing inventory management is a key component of our margin expansion objectives, there is also a lot of work for us to be done for us to realize our objectives and to normalize volatility. As of today, we continue to expect 2022 gross margins to be in the mid-60s.\n\nAdjusted research and development expenses of $12.1 million or 5.7% as a percentage of third-party sales in line with 5.8% in the prior-year period. Adjusted selling, general and administrative expenses of $128.8 million or 60.4% of third-party net sales was roughly flat year-over-year in dollar terms and higher by 610 basis points as a percentage of sales. Lower variable selling expenses from lower net sales and the favorable impact of organizational realignment initiatives undertaken at the end of Q2 were offset by higher discretionary spending as COVID restrictions were lifted and higher information technology spending to support decoupling initiatives in the quarter. Adjusted EBITDA of $29.4 million or 13.8% of third-party sales reflects an increase of 390 basis points from 9.9% in the prior year.\n\nThe increase is primarily due to higher gross margin, partially offset by higher selling, general and administrative expenses as a percentage of revenue as previously discussed. Adjusted earnings per share was $0.49 on a fully diluted weighted average share count of 26.2 million shares due to higher year-over-year profitability, a lower tax rate from a change in jurisdictional profit mix, partially offset by higher interest expense. Touching on working capital and liquidity. We continue to make progress on capitalizing on the strength of assets on our balance sheet with a focus on optimizing the allocation of capital and the monetization of certain assets to drive cash and thus increase financial flexibility.\n\nOur efforts have resulted in a reduction in net inventory of $22.6 million since December 2021 and a significant reduction of approximately $20 million in the planned amount of capital spent on spine instruments, now expected to be $15 million for the full year 2022. We ended the third quarter with approximately $116 million of cash and equivalents, a reduction of $14 million from $130 million at June 2022. The reduction in cash from prior quarter is due to the impact of foreign exchange translation on our euro-denominated cash balances, payments to purchase certain assets retained by Zimmer Biomet at spin and a reduction in related party and accounts payable balances. Our cash balance at quarter end includes approximately $16 million of cash earmarked to settle certain post spin-related transactions and to fund ERP implementations to decouple from our prior parent company, down from $22 million at June 30.\n\nI'll now turn to our full year outlook for 2022. We are maintaining our full year 2022 total net sales guidance of $915 million to $930 million. Please note that based on current trends in our business, we expect to end the year near the lower end of this range due to macroeconomic pressures, including ongoing foreign exchange headwinds and uncertainty around procedural volumes. We are also maintaining our full year 2022 adjusted EBITDA margin guidance of 13.1% to 13.6% and expect to be toward the higher end of this range.\n\nAdjusted earnings per share guidance of $1.80 to $2 per share remains the same as previously guided. Before I close and hand back over to Vafa, I want to reiterate that we continue to make progress executing on our disciplined financial framework and our initiatives to operationalize the business by controlling expenses, rationalizing our real estate and geographic footprints, scrutinizing capital investment and monetizing the underlying strength of assets on our balance sheet. We look forward to continuing to update you on our progress in upcoming quarters. With that, I'll now turn the call back over to Vafa.\n\nVafa Jamali -- President and Chief Executive Officer\n\nThank you very much, Rich. In summary, we are very pleased to be doing what we committed to do from the time of our spin, which is to ensure that we have the right team in place to drive value for stakeholders, optimize our systems as a stand-alone entity and operate the company with greater efficiency, while leveraging our differentiated therapies and innovating around our core to set the stage for future growth. This remains our priority as we continue our mission to transform patients' lives. With that, I would like to thank you for your time and open it up for any questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] I'm showing we have a question coming from the line of Robbie Marcus with J.P. Morgan.\n\nLilia-Celine Breton Lozada -- JPMorgan Chase and Company -- Analyst\n\nHi. This is actually Lily on for Robbie. Thanks for taking the question. So you came ahead on both EPS and EBITDA, though reiterated the guide which implies a slightly softer fourth quarter.\n\nSo are there any sort of headwinds or dynamics that we should be keeping in mind for the fourth quarter?\n\nRich Heppenstall -- Chief Financial Officer\n\nYes. Not necessarily. What we are seeing is in the fourth quarter around EPS, and I'll address that one first, is obviously with the Fed continuing to raise interest rates, interest rates continue to be a little bit higher. And then in the third quarter, we did have kind of that ongoing tax benefit from the benefit that we realized in Q2.\n\nRelative to EBITDA, what I would say there is we do expect to be at the higher end of the range. What we're still seeing is as we continue through the year that there's a fair amount of choppiness in the income statement as evidenced in Q3 as we look to decouple from Zimmer Biomet. And so we're affirming the full year EBITDA guidance. We expect to be at the top end of that range, but there's just some cleanup and some choppiness that we still need to kind of continue to work through.\n\nBut are on track to our objectives.\n\nLilia-Celine Breton Lozada -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's helpful. So I guess we're about a month into fourth quarter. So can you talk about how you're seeing some of these dynamics like macro headwinds, staffing, and volume trends progressing to the end of the year?\n\nVafa Jamali -- President and Chief Executive Officer\n\nSure. So the summer was affected, and it's Vafa here. And September got a lot more predictable, and we're seeing that continue through the balance of the year. Staffing has been quite a bit better than in the past.\n\nSo I think that we're getting to be -- to a point where we're much more predictable, the business is much more predictable. There's still some on the dental side of things. I think we're seeing that there is some scrutiny, a little bit around what does the macroeconomic environment mean for dental implants so far. Implants have shown to be more resilient as far as we see it, less selective than some of the other categories that are within dental.\n\nSo overall, we're feeling a lot more predictable, a lot more comfortable about the fourth quarter.\n\nLilia-Celine Breton Lozada -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. And I am showing no further questions at this time. I would now like to turn the call back over to Vafa Jamali for any closing remarks.\n\nVafa Jamali -- President and Chief Executive Officer\n\nThanks very much for listening to the -- this quarter's earnings report. We look forward to continuing to show progress for ZimVie, and we appreciate the questions. Thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMarissa Bych -- Investor Relations\n\nVafa Jamali -- President and Chief Executive Officer\n\nRich Heppenstall -- Chief Financial Officer\n\nLilia-Celine Breton Lozada -- JPMorgan Chase and Company -- Analyst\n\nMore ZIMV analysis\n\nAll earnings call transcripts"
}