{
  "companyName": "Remitly Global, Inc.",
  "companyTicker": "RELY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/remitly-global-inc-rely-q3-2022-earnings-call-tran/",
  "content": "Remitly Global, Inc. (RELY 4.95%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Remitly's Q3 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to turn the conference over to your host today, Stephen Shulstein, vice president, investor relations. Please go ahead.\n\nStephen Shulstein -- Vice President, Investor Relations\n\nThank you. Good afternoon and thank you for joining us for Remitly's third quarter 2022 earnings call. Joining me on the call today are Matt Oppenheimer, co-founder and chief executive officer of Remitly; and Hemanth Munipalli, our chief financial officer. Our results and additional management commentary are available in our earnings release and presentation slides, which can be found at ir.remitly.com.\n\nPlease note that this call will be simultaneously webcast on the investor relations website. Before we start, I would like to remind you that we will be making forward-looking statements within the meaning of the federal securities laws, including, but not limited to, statements regarding Remitly's future financial results and management's expectations and plans. These statements are neither promises nor guarantees and involve risks and uncertainties that may cause actual results to vary materially from those presented here. You should not place undue reliance on any forward-looking statements.\n\nPlease refer to our earnings release and SEC filings for more information regarding the risk factors that may affect our results. Any forward-looking statements made in this conference call, including responses to your questions, are based on current expectations as of today, and Remitly assumes no obligation to update them or revise them, whether as a result of new developments or otherwise, except as required by law. The following presentation contains non-GAAP financial measures. For a reconciliation of each of these non-GAAP financial measures to the most directly comparable GAAP metric, please see our earnings press release, which is also available on the IR section of our website.\n\nNow, I will turn the call over to Matt to begin.\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nThank you, Stephen, and thank you all for joining us to discuss our strong third quarter results and progress on our strategic priorities as we continue our track record of consistent execution. Our focus on our customers and the resilience of remittances through economic cycles has positioned us well to deliver sustainable, long-term results for all of our stakeholders. We are committed to delivering outsized revenue growth and returns for many years to come, while at the same time ensuring Remitly is positioned to benefit from increasing scale across our expense base. We are very proud of the progress we've made since our IPO.\n\nOn Slide 4, you can see that we have made great strides across many dimensions of our business. We now serve 3.8 million quarterly active users, adding more than 1.2 million since our IPO. Our geographic footprint is now over 170 countries, up from 135. We provide service to approximately 4,200 corridors, an increase of 2,400 corridors in the past year alone.\n\nOur third quarter annualized send volume now stands at $30 billion. This growth has resulted in significant scale as we look to become the largest remittance provider with complementary products for immigrants and their families. We have delivered a track record of consistent execution versus expectations. And finally, we have done all of this while maintaining our unique customer-centric culture with an authentic focus on ESG priorities across our business.\n\nNow, let's turn to a brief overview of our third quarter results. Our track record of solid execution continuing in the third quarter as shown on Slide 5. Our active customer base increased by 49% year over year to more than 3.8 million. Revenue increase increased 40% year over year to $169 million, above our expectations.\n\nThis is exceptionally strong growth at our scale. This growth was driven by increases in active customers as we continue to take share from legacy providers, subscale digital providers, and the informal remittance market as more transactions shift digital. Repeat transactions from loyal customers also contributed to growth. Given that Remitly has only 2% of the global remittance market combined with a very strong product offering that drives repeat usage, these new and repeat customers will drive revenue growth for many quarters to come.\n\nOur revenue continues to be highly visible and predictable due to high customer loyalty and the nondiscretionary nature of remittance transactions. As a result of this strong top-line performance and our outlook for the fourth quarter, we are once again increasing our revenue outlook for 2020. Our adjusted EBITDA performance in the third quarter was also above expectations. We delivered strong efficiencies in our marketing investments and drove robust active customer growth.\n\nGiven that the fourth quarter provides the greatest seasonal opportunity to acquire even more new customers at strong unit economics, we are maintaining our 2022 adjusted EBITDA outlook. Consistent with what we saw last quarter, our customers remain resilient in the face of a volatile macro environment as you can see on Slide 6. Remittances tend to perform well across economic cycles, and digital adoption remains a long-term tailwind for Remitly. The reasons that remittances performed well over economic cycles is due to their nondiscretionary function and the determination of our customers to send money back home on a regular basis, no matter the obstacles they face.\n\nWe saw this clearly during COVID, for example, when many of our customers who work in jobs such as hospitality were impacted by shutdowns, were able to quickly pivot to finding other sources of income, such as food delivery. The diversity of our customers across various occupations from blue collar to white collar and now in more than 25% countries lowers the risks of potential changes in specific areas of local economy. We consistently monitor the underlying transaction and send volume trends, and we have continued to see resilience in our customer base and loyalty to Remitly. We do not see reductions in transactions per customer or average transaction set that are not driven by shift in customer disbursement preferences.\n\nWe believe our customer is prioritizing sending money back home to family and friends over other more discretionary spending. While our send volume per active customer is down year over year. This was primarily due to the increasing mix of new customers versus existing customers in the third quarter and foreign currency translation headwinds. Excluding new customers in both periods and on a constant-currency basis, send volume per active customer was up slightly in the third quarter year over year.\n\nWe also surveyed our customers last month and found that nine in 10 customers expect to spend the same amount of money or more in 2023 versus 2022. Similarly, most customers say they expect to send money abroad at the same frequency or more often than they did in the past year. This is similar to findings found in our second quarter survey and gives us confidence that our customers continue to prioritize remittances. So, the primary driver of results, foreign currency movements, particularly the recent strength in the US dollar, do impact our business in numerous way.\n\nFirst, in certain markets, especially those with larger transaction [Inaudible] we see customers taking advantage of the ability to get more local currency to their families and friends. Second, we believe the strength of the US dollar and the strength in other developed market currencies versus emerging market currencies make it easier to acquire new customers in certain markets. Finally, year-over-year growth in our revenue metrics were negatively impacted by foreign currency translation as our international business continued to grow and currencies such as the British pound and euro weakened against the US dollar. Turning to some key trends in our three largest perceived markets: Mexico, Philippines, and India.\n\nIn Mexico, our largest received market by revenue, we are seeing consistent customer behavior as the vast majority of customers are sending money back home to family for basic household needs. The customers that send to Mexico tend to be less affluent, and we continue to see strong employment trends for lower-wage occupations, especially in the US. In fact, the Mexican central bank reported that remittances to Mexico reached a record high in July as Mexican families received $5.3 billion from abroad, an annual increase of 17%. The strong trend continued in August, with remittances to Mexico up 8%.\n\nOur growth in Mexico was significantly higher in these industry numbers as we continue to take market share. Customers in the Philippines continue to shift their disbursement preferences to mobile wallets and other digital received methods, which we are encouraging and leading with our digital-first approach. We support customers if and when they're ready to make the shift to digital received with our highly localized marketing and product experience. Finally, in India, as the rupee depreciated materially against the US dollar and other currencies, we saw very strong year-over-year growth in both send volume to India and new customers in the quarter.\n\nWhile these three large received countries remain very important to our business, it's important to keep in mind that we continue to diversify our corridor portfolio across both send and receive countries. We saw this diversification play out in the third quarter as more than 50% of new customers acquired in the third quarter were sending to countries outside of Mexico, Philippines, and India. Given our high-retention rate, adding new customers tends to be the leading indicator of revenue growth for the quarters and years to come. And as a result, we expect our revenue to become even more diversified across corridors.\n\nIn the third quarter, we made progress across our investment priorities as you can see on Slide 7. We are very focused on new customer acquisition at strong unit economics, geographic expansion, remittance product enhancements, and complementary new products. With these priorities, we are laying the foundation for sustainable, outsized growth and returns for many years to come. Consistent with the second quarter, we were able to drive significant customer acquisition efficiencies in the third quarter as you can see on Friday.\n\nWe continued to manage customer acquisition cost via elasticity testing and a focus on lower-cost channel all while maintaining strong new customer acquisition growth. As a result, CAC improved 18% sequentially from the second quarter and 19% year over year from the third quarter of last year. Our increasing brand awareness in both the U.S. and international markets, along with rapid scaling of active customers, is driving efficiency and resulting in word-of-mouth network effect.\n\nWe have seen a moderate softening in the competitiveness of the advertising environment in the third quarter, both sequentially and year over year, and we were able to take advantage to drive even further efficiency. As we look ahead to the fourth quarter, we would expect customer acquisition cost to increase sequentially but declined year over year as we remain focused on driving efficiencies across the marketing funnel. The fourth quarter is typically the most seasonally expensive media quarter, while also providing the best opportunity for us to acquire new customers as the holiday season drive additional sending behavior across remittance corridors. Our geographic expansion is accelerating, as you can see on Slide 9.\n\nAt the end of the third quarter, we serve customers in more than 170 countries and territories worldwide. We now serve nearly 4,200 corridors, and we added approximately 1,000 corridors in the third quarter alone. Another record quarterly geographic expansion for us. We also saw an opportunity to further expand into complementary geographies in the Middle East and Europe with the pending acquisition of Rewire.\n\nIt is important to note that it is both the number of corridors we serve and the quality of the disbursement network that drive new customer growth and repeat sending behavior. As a result of the quality of our network and the foundational investments we have made, in general, every new send country we add results in more than 150 new corridors, allowing us to continue to scale rapidly. Our disbursement options within our global network continue to grow and remain an important driver of customer loyalty. Our growing network of banks, mobile wallets, and cash pickup locations allows our customers to choose what works best for them.\n\nAs digital payout options continue to grow in adoption, we are pleased to be able to add more than 170 million mobile wallets in the third quarter. This expansion includes our launch of Paytm in India, one of the largest mobile wallet providers in that market. We also expanded our relationship with Visa by making Visa Direct available to Remitly customers in Canada. This provides another convenient disbursement option for our customers.\n\nWe continue to believe the quality of our network and our focus on customer preference and disbursement options remains a compelling differentiator. The focus on improving the customer experience and delivering peace of mind drives our investments in our remittance platform as you can see on Slide 10. We made significant progress in the quarter on reducing customer friction as we enhanced a number of key features to drive peace of mind. These investments drive retention and product differentiation and will ultimately lower customer service costs as customers will contact us less frequently.\n\nSome key examples in the third quarter that helped drive customer peace of mind included reducing customer pain points by expanding rapid refunds to Visa and MasterCard in the U.S. and enhancements to the customer experience in the send funnel by allowing global customers to import their recipient contact or scan their card to add it as a payment method in their profile. Our global uptime of 99.96% in the third quarter reflects our commitment to our customers as downtimes are among the worst-case scenarios for our customers, ranging from losing trust when new customers are shopping around, to devastating for existing customers, especially during a family emergency. We continue to have high customer ratings in both the iOS App Store and Google Play Store.\n\nAnd as we continue to scale, we believe we'll be able to make investments in our platform that other competitors will simply be unable to make. This drives an increasing preference for Remitly service and delivers peace of mind to our customers. We talked last quarter about narrowing our focus to complementary products to deepen relationships with remittance customers as you can see on Slide 11. We believe our product strategy will result in a deeper and stickier relationship with our customers over time, which will drive even more business to our remittance platform and increase retention of existing customers.\n\nWe continue to iterate and test demand for additional products that solve critical problems for our immigrant customers and their families and are pleased with the progress so far. Our pending acquisition of Rewire and their account-based incremental platform will help us execute and accelerate this product strategy. In addition, the critical investments we are making across our platform will ensure we can serve our customers across multiple products with the same peace of mind that we deliver with our remittance product. The portfolio of four strategic investment areas positions us to drive sustainable growth in the near medium and long term as seen on Slide 12.\n\nThe overlapping return profiles and our strong balance sheet gives us the confidence that we can deliver on our promises to customers, shareholders, and employees. Before I turn the call over to Hemanth, I'd like to return to our vision on Slide 13. Our vision is to transform the lives of immigrants and their families by providing the most trusted financial services on the planet. This is what drives us and energizes us and will remain our North Star.\n\nA focus on the long term and our customers also drives our commitment to ESG. As part of this commitment, we will publish more about our ESG strategy soon, and we plan to provide additional reporting across ESG metrics in 2023. In addition, as part of our commitment to ESG, we made our second annual contribution to Pledge 1% of approximately 182,000 shares during the third quarter. It is our strong belief that our ESG programs and initiatives ultimately improve our product, our ability to serve customers, and our employees' experience with us.\n\nThis is what drives a long-term sustainable business that delivers returns for all stakeholders. With that, I'll turn the call to Hemanth, who will provide more details on our financial results and outlook. \n\nHemanth Munipalli -- Chief Financial Officer\n\nThank you, Matt. I am pleased with our strong third quarter results, our continued track record of execution, and the resilience of our customers. This has allowed us to raise our revenue outlook for 2022 once again. Over the past quarter, I've also had the opportunity to dive deeper across Remitly's significant growth opportunities and our investments that I'm excited and confident about the return potential.\n\nWith that, let's turn into the details of our third quarter results. I'll begin by reviewing the drivers of our third quarter financial performance and then will provide more detail on our outlook for 2022. As a reminder, I will discuss non-GAAP operating expenses and adjusted EBITDA in my remarks. These metrics exclude items such as stock-based compensation, the donation of common stock in connection with our Pledge 1% commitment, and transaction costs related to acquisitions.\n\nReconciliations to GAAP results are included in the earnings release. Beginning on Slide 15 with our high-level, top-line performance, active customers grew by 49% year over year to more than 3.8 million. Sending volume grew 44% year over year to approximately $7.5 billion, all resulting in revenue growth of 40% year over year to $169 million, which was above our expectations. As you can see on Slide 16, a number of factors drove the strong 49% active customer growth, including setting another record number for new customer acquisitions in the quarter and higher retention of existing customers who in many cases continued to transact with us over many years.\n\nOur differentiated product, highly effective marketing, and increasing global scale all contributed to the outsized active customer growth we saw in the quarter. We also believe in the strength in the U.S. dollar. It helped drive incremental new customers to Remitly in certain markets.\n\nWe saw pretty good strength in new customer acquisition on the USA to Mexico and USA to India corridors, where we delivered record new customers and surpassed the previous new customer record set at the beginning of the pandemic. This was driven by marketing efficiencies at new scale, including improved referrals and word of mouth, upper funnel investments, localized promotions, and product and landing page optimization. We also saw a strong growth in some of our newer and smaller corridors, including to Africa, where we benefited from a sub-Saharan Africa awareness campaign and additional scale. Turning to Slide 17, robust growth in active customers and high retention drove to 40% year-over-year revenue growth that we delivered in the quarter as we continue our multiyear track record of healthy double-digit revenue growth.\n\nRevenue growth in the quarter was impacted by approximately 300 basis points unfavorably due to foreign currency translation, as we saw the British pound and euro decline against the US dollar. Turning to transaction expense on Slide 18. Transaction expense was $70 million, up 41% on revenue, compared with 39% of revenue in the third quarter of last year. We saw higher-than-expected fraud loss rate in the third quarter as we onboarded a record number of new customers who generally have a higher risk profile.\n\nHowever, the fraud losses were well within our guardrails for new customers, and we continue to invest in improving our fraud and risk systems while at the same time improving our customer experience. We continued to see leverage on send-in destination fees in the third quarter as we globally scale and were able to drive better terms with our payment and disbursement partners. On a year-to-date basis, transaction expense as a percent of revenue has improved by 140 basis points. Over the long term, we expect to continue to benefit from increasing scale and improved position on fraud losses, although we expect some variability in transaction expense from quarter to quarter.\n\nNow, I will turn to our non-GAAP operating expenses on Slide 19, which reflects the investments we're making to allow us to scale our remittance business and execute on our long-term strategy of delivering complementary new products to immigrants and their families. Overall, we saw moderation in year-over-year opex growth rates in the third quarter as compared with the second quarter, including in both technology and development and G&A expenses. As Matt discussed earlier, we also continue to drive efficiencies in customer acquisition costs. Our marketing expense of which the vast majority is targeted at new customer acquisition was $40 million in the quarter and it reflected a 100-basis-point year-over-year improvement as a percent of revenue.\n\nThis leverage was driven by marketing efficiencies and customer acquisition while at the same time delivering a record number of new customers to Remitly. Our efficiencies came from elasticity testing, improved overall brand awareness, and a moderately less competitive advertising market. We plan to continue to invest in high-return marketing with a highly disciplined focus on driving efficiency gains. Customer support and operations expense was $18 million in the third quarter and was up 70 basis points year over year on a percentage of revenue basis.\n\nThe primary driver of this increase was due to higher-than-expected number of new customers added in the quarter. New cohorts of customers on average contact us at a significantly higher rate than older cohorts. It is our goal to drive this contact rate down over time as we make technology investments in our product, payment, and disbursement networks to deliver peace of mind for our customers. As we scale, we expect new customers to be a smaller proportion of active customers.\n\nWe also expect our peace of mind product enhancements to drive contact rates lower. Both of these factors should help drive leverage in customer support costs over the medium term. Technology and development expense was $22 million in the third quarter and was essentially flat year over year as a percentage of revenue. Our investments allow us to deliver peace of mind, drive retention and loyalty, and enable the development of complementary new products.\n\nThis ultimately deepens our relationships with our customers and provides additional revenue opportunities. As we mentioned on our last call, we expect technology and development expense to increase as a percentage of revenue in 2022 compared with 2021 as we prioritize product improvements, new product development, and corridor additions. G&A expense was $22 million in the third quarter. Our year-over-year growth rate in G&A expense has moderated as we begin to anniversary the ramp in public company expenses.\n\nWe expect the year-over-year growth rate in G&A expense to continue to moderate in the fourth quarter. Turning to Slide 20. Adjusted EBITDA, which excludes stock-based compensation expense, the donation of common stock in connection with Pledge 1%, and transaction costs was negative approximately $4 million in the third quarter of 2022. Our adjusted EBITDA performance was better than we expected, primarily due to higher-than-expected revenue and lower customer acquisition costs.\n\nThird quarter GAAP net loss was $33 million, compared to a $13 million net loss in the third quarter of 2021. The increase in net loss was primarily due to $21 million incremental stock-based compensation expense. Turning to our balance sheet. Working capital at the end of the quarter was approximately $450 million and replaced cash in our balance sheet of $376 million.\n\nOur strong balance sheet is a key differentiator from many other competitors, especially subscale ones, and allows us to execute our strategic priorities to drive long-term profitable growth. Moving to our 2022 outlook on Slide 21. We expect revenue to be between $635 million and $640 million. This is a $10 million increase to the midpoint from our prior outlook and implies a year-over-year growth rate of 38% to 40%.\n\nWe're increasing our outlook to reflect the strong performance we delivered in the third quarter with both existing customers and new customers. Our strong new customer growth during the first three quarters of the year will be a tailwind for growth in the fourth quarter 2023 and beyond. We're maintaining our adjusted EBITDA outlook for 2022 at negative $35 million to negative $30 million. Due to seasonally strong new customer acquisition in the fourth quarter, we expect the fourth quarter to have lower adjusted EBITDA than the third quarter.\n\nWhile acquiring these new customers in the quarter impact short-term profitability, we fully expect these customers will continue to drive relatively strong growth going forward. As I've also now completed my first 90 days, I'm even more confident that we have an attractive investment return profile that I look forward to discussing when we provide guidance for 2023 early next year. We're executing strongly with financial discipline and continue to build an attractive return profile with the momentum of our strong revenue growth, predictable and resilient customer behavior, global scale, operating leverage opportunities, and a healthy balance sheet. With that, Matt and I will open up the call for your questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] One moment for our first question. Our first question comes from the line of Tien-Tsin Huang with J.P. Morgan.\n\nYour line is open. Please go ahead.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nThanks so much. Good results here. Good afternoon. Just a really big increase in customers added sequentially here from a notional standpoint.\n\nSo, I just want to make sure I heard this correctly or maybe you can explain. How much of it is a function of the growth in the quarters, which stepped up, again, two quarters in a row versus attracting users from existing quarters and the marketing efforts there? And I think I heard you mention that there are some users being opportunistic with FX, which makes sense as well. So just kind of understand some of that. And is there any risk of pull forward as well given what you've studied?\n\nHemanth Munipalli -- Chief Financial Officer\n\nYeah. Thanks, Tien-Tsin. It's a good question. First of all, like, really pleased with our growth in our customers overall.\n\nAnd it's, frankly, a global sort of growth that we've seen, I'd say, broadly broad-based across the corridors. We certainly saw some -- obviously, we're strong in certain markets from the USA to Philippines, Mexico, India being some of our stronger corridors. So, we did see with the FX, to your point as well, where we saw some increased demand and new customer activity relating to that FX impacts. But, you know, that's, I'd say, on a broad basis, growth was everywhere.\n\nWe saw 50% of new customer activity coming outside from a send market perspective outside of India, Philippines, and Mexico as well. So, we're pretty pleased with that overall. In terms of your question about whether there was any pull forward, we do think there may be a slight pull forward in terms of demand, but we don't think it's material enough at this point. Just want to reinforce that we're seeing pretty consistent customer behavior across the board.\n\nAnd so, we don't expect a major impact due to the pull-forward effect.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nOK.\n\nHemanth Munipalli -- Chief Financial Officer\n\nMatt, anything further to add?\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nNo, Tien-Tsin, I think the only thing I'd add is appreciating up on new customers because it was a record quarter in terms of new customer adds. And we're also excited that we did it with, you know, an 18% decline impact from Q2 and 19% decline from Q1 or sorry, Q3 2021. And so that's what enabled us to not only bank a lot of new customers, which is going to -- which bodes well for not only this quarter's growth and hence our improvement in terms of revenue guidance but also gives us more confidence going into '23 not only around growth but the levers that we can pull around growth and profitability given that we're banking a lot of new customers that have strong paybacks and therefore flow through to transaction margin and then ultimately give us flexibility from that standpoint. So, really excited.\n\nAnd I think in terms of the sustainability, some of it is due to the less competitive advertising environment, but I think we've done a better job testing the elasticity and if we've got a great marketing team in place. Our CMO has been in the seat for less than a year in her role. The creative execution, the creative velocity, and just the opportunity seems very large right now. So excited about what that represents in the quarters to come.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nYeah. No, thanks for that. And that, you know, it really stood out, and the CAC piece is important as you said because we're clearly getting questions from investors around Western Unions, if you don't mind me mentioning them and their stated strategy to improve digital customer acquisition. So, have you -- doesn't seem like you're seeing any effects there.\n\nAnd I don't know from a marketing perspective, another fourth quarter comment was pretty clear. Is that opportunistic on your side? Or is that -- are you seeing some need to maybe step up some marketing, you know, given what Western Union is trying to do in some ways to replicate your model? Thank you.\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nYeah. Thanks, Tien-Tsin. I think that as we look into Q4, as we mentioned in the remarks, I think that it's a unique time where a lot of customers send money back home. And so, there's a demand capture, from being able to capture a lot of new customers in Q4.\n\nThat again, will give us a lot of optionality both in terms of revenue growth and being able to flow that down to the bottom line. And so, we want to be able to capture that. It does mean more of an investment in Q4, but it's less driven by the competitive dynamics and more driven by the fact that we're continuing to have record number of new customers at improving unit economics. And so, we think it's prudent to continue to test that elasticity.\n\nBut banking out a lot of these new customers that we can serve in 2023, that gives us a lot of optionality as a business.\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nMakes sense. Thanks, Matt. Thanks, Hemanth.\n\nOperator\n\nThank you. One moment for our next question, please. Our next question comes from the line of Andrew Schmidt with Citi. Your line is open.\n\nAndrew Schmidt -- Citi -- Analyst\n\nHey, Matt, Hemanth, Stephen. Thanks for taking my questions and appreciate all the good commentary here. I want to start out just with -- just a question on, you know, where the share gains are coming from. And I know you mentioned the sources -- traditional source in your prepared remarks, but curious if there's been any change in terms of proportion of where your wins are coming from.\n\nAnd then just as a corollary to that, it sounds like part of the efficiency in marketing is also being a little bit more efficient with your customer acquisition channels, particularly referrals. Maybe a comment on how the -- just the customer acquisition channel mix is changing over time as well. Thanks a lot.\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nYeah.\n\nHemanth Munipalli -- Chief Financial Officer\n\nWhy don't I? Andrew, nice to connect with you. I'd say – so, let me start with the second question, and then maybe Matt and I can cover the share gain. I'd say in terms of efficiency and marketing, which is broadly your question, a lot of it is really through optimization that I think the marketing team has been executing really, really strongly. And there's upper funnel, there's elasticity testing, there is what we're doing at a local level.\n\nIt's really pretty broad-based and this team has really been in place only for the last six, nine months with a new leadership team in place, and they've been doing a phenomenal job there. So, I'd say there's a ton of work happening in marketing that's driving optimization and driving efficiency in marketing. To the other factors, we're also seeing in terms of CAC efficiency. One, we talked about referrals.\n\nI think referrals is obviously one that's hard to sort of measure and attribute to. But we do think with that -- are increasing scale that it's increasingly becoming a beneficial factor for us as we think about marketing expenditures. So, there's definitely that, bit of that happening. Again, hard to kind of point out exact numbers and attribution to that.\n\nThe third piece, which again, I just sort of point that out, we had that in prepared remarks as well, is that the market has been less competitive. So, there has been a little bit of that that's been benefiting us. We'll have to see where that goes. Obviously, Q4 is going to be a seasonably high spend in terms of marketing for many of our competitors as well, and we'll continue to watch that.\n\nBut we're really pleased with, you know, the things that we're controlling in terms of just driving optimization and marketing spend, which has been at a great [Inaudible]\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nYeah. I think that's great. The only thing I'd add, Andrew, it's a great question. I think that if you look at where we're gaining share from, it's important to anchor ourselves in the fact that it's still a very, very fragmented market.\n\nAnd as we continue to gain share, although again we mentioned we have 2% of the $1.6 trillion at send, there are word-of-mouth network effects, as we mentioned, that gives us, you know, operating leverage from a business standpoint and from a customer standpoint. Just really organic, you know, additions to – efficient organic additions to using Remitly. And we measure things like brand awareness and other things that are signals for that that I think bodes well for continued efficient growth. But it is a broad-based, you know, acquisition across both legacy players, as well as subscale players, both subscale legacy and subscale digital, which is where a lot of the market resides.\n\nAnd I think it's harder for those companies to build real, reliable peace of mind that delivers for customers on a consistent basis, which is something that I think we do well. And that shows up in, you know, fast transfers without any sort of friction and cutting through a lot of complexity that's inherent in international payments that we're good at and we're continuing to get better at with our scale size and growth rate and ability to invest in every aspect of friction that customers may face.\n\nAndrew Schmidt -- Citi -- Analyst\n\nVery helpful. Thank you, Matt and Hemanth. And just quick follow-up on the implied fourth quarter outlook, it seems like just on a quarter-over-quarter basis, a little bit of a decel revenue growth despite fourth quarter being typically seasonally stronger. I just want to be clear, is there something that you're seeing in the environment that might cause pause or [Audio gap] caution? Is it conservatism around potential pull forward or is it just nature in terms of, let's call it your normal kind of outlook algorithm that does kind of embed our level of prudence? Just curious, just as we characterize to see the setup here.\n\nThanks a lot.\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nYeah. Yeah. It's -- Andrew, to that, I'd say, you know, we are broadly assuming pretty consistent drivers of sort of the macro elements in our Q4 outlook. So, we're not baking in anything different fundamentally from Q3.\n\nTo your question on deceleration on the revenue line, again, I just want to reinforce that being seasonally strong with a high customer growth expectation that we have there, that doesn't directly translate into revenues to that effect in that quarter, right? So, this is what we expect to get in subsequent quarters. So, we -- so that's sort of how the timeline of how revenues will flow into our P&L. So, Q4 doesn't have any sort of deceleration built in from the perspective of sort of any decreased expectation on new customer activity.\n\nAndrew Schmidt -- Citi -- Analyst\n\nPerfect. Very helpful. Thank you very much.\n\nOperator\n\nThank you. And one moment for our next question. Our next question comes from the line of Ramsey El-Assal with Barclays. Your line is open.\n\nPlease go ahead.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thanks for taking my question this evening. And forgive me if you covered this. I was -- missed the first part of the call.\n\nI wanted to ask about your quarter expansion, which has been a really impressive trend. How should we think about the kind of longer-term path there? Is it fruitful to just kind of add more corridors indefinitely? Or is this a type of thing where you have a target in mind when you reach a certain point, a certain scale in terms of the number of corridors, you'll then say, \"We've got what we need out of this. We can move on?\"\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nThanks, Ramsey. I'll take that one. And thank you for joining, especially during busy earnings season. So, you may have heard earlier in the remarks foundationally and then I'll address your question, we had 1,000 corridors last quarter alone.\n\nAnd if you look at -- we've added 1,800 corridors to -- sorry, we've gone from 1,800 corridors to 4,200 corridors since our IPO. So, your question is right in terms of how do we think about continued corridor expansion. And I'd say a couple of things. One, we're very intentional when we think about our corridor expansion playbook.\n\nAnd what I mean by that is there's a lot of companies that go very broad, very fast. And we've been very intentional about adding new countries and new corridors in a really methodological approach. And the corridors that we launched a year or two ago are the ones that are driving growth now, just like the corridors we're launching now are going to be the ones that are going to be driving growth in, you know, the quarters and years to come. But we're going to do that intentionally.\n\nSo, you can get a sense of just looking at a map of where remittances flow versus where we're at now. We have opportunities in APAC. You may have seen that we just launched Japan and New Zealand as origination corridors. We also are in the process of acquiring Rewire, which is an Israeli-based remittance company.\n\nThey also have a presence in Europe. So, that will help us, you know, with our first Middle East origination country. And then on the West [Inaudible] side, Asia, Africa, and Latin America primarily is where our customers send money to. And we see opportunities there primarily to improve the quality of our network.\n\nBut there are opportunities to continue to add countries as well. And given that we now send over 150 receive countries, each time we add a new send country, it gives us 150 new corridors given that customers can send from that one new send country to 150 receive. So, from an operational leverage and efficiency standpoint, it gets more efficient. And as we do it -- you mentioned we do it in perpetuity.\n\nThere will come a time where we have expanded everywhere, but we're a long ways away from that, and we've got really clear, I think, paths for continued sustainable expansion and growth given our methodological corridor expansion approach and strategy.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGreat. Thank you for that. And one follow-up for me. Could you give us an update on the Remitly for developers? Sort of how is uptake trending? How is the pipeline developing, that type of thing?\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nYeah, absolutely, Ramsey. I'm really glad you asked about that. So, when we -- what I'm going to first call it is B2B, business to business. We refer to a variety of product offerings that we're offering to businesses.\n\nAnd so, you mentioned Remitly for developers, which is the one that we have partnered with, as we mentioned, companies like Meta to be able to do fund disbursement with our network. And what we've seen interestingly with many businesses as we look at the broader pipeline is that they think they just want access to this disbursement network, but they quickly realize there's a lot more complexity to remittances and international payments than just the disbursement networks on FX flow of funds that are part of the RFD product as well. It's also our [Inaudible], our pricing, our risk product, our access and management, our payment disbursement, and then all of that localized and managed across 4,000 corridors, as we just talked about given the localization that's important within remittances. And so, this platform is hard to build, and it's part of what makes remittances defensible, and that's being validated as businesses get to know remittances and international payments in more depth.\n\nSo accordingly, we're now offering an embedded B2B product. And this product is designed for organizations like banks, credit unions, Neobanks to offer a really simple and trusted international payments to their end customers. And it's more fully leveraging the really strong platform we built to accelerate growth. So, excited about the B2B space broadly, and important to understand the strategic context and what we're learning from businesses because it's validating not only to the complexity that's inherent in remittances but also to the platform that we've built that can potentially add even more value to other businesses.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nFantastic. Thanks so much.\n\nOperator\n\nThank you.\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nThanks, Ramsey.\n\nOperator\n\nThank you. And one moment for our next question. Our next question comes from the line of Robert Napoli with William Blair. Your line is open.\n\nPlease go ahead.\n\nRobert Napoli -- William Blair -- Analyst\n\nThank you, and thank you for the question. Congratulations on the quarter. Really impressive additions of new customers and corridors. Good to see.\n\nJust the -- maybe a little color on Rewire and your diversification efforts. I mean, as it relates to the diversification efforts, if you can give us any color on Rewire and is M&A going to become a more steady way, I guess, of entering new countries or corridors?\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nThanks, Bob. Yeah, it's great to hear from you. And a timely question because I just got back from Tel Aviv and seeing the team at Rewire. And again, that acquisition is pending regulatory approval.\n\nSo, it's not closed yet, but we're excited about the two strategic rationales for that deal. The first being that it, as I mentioned, will help us expand to Israel, where we don't originate remittances from yet, as well as continue to grow our European business, where they have a presence. So, complementary from a geographic standpoint. And then the second is when you think about complementary new products, they have a history and DNA and team that is both built some interesting products like a remittance product that's linked to a stored value but also just has a track record of innovating in that space.\n\nAnd so, really excited about that acquisition once we get the requisite regulatory approvals. But -- and when you look more broadly in M&A, I think that we are always looking at ways to continue to grow efficiently, whether that's organic, inorganic, but excited about what we have to talk about today, which is the Rewire acquisition.\n\nRobert Napoli -- William Blair -- Analyst\n\nThank you. And then just a follow-up on retention. I mean, I'm really kind of surprised to hear less competition in the market, but have you seen any change in your customer retention like the waterfall? I mean, how confident are you? And there's unit economics as it relates to retention and margins, etc.?\n\nHemanth Munipalli -- Chief Financial Officer\n\nYeah. Thanks for the question. I think it's one that we look at obviously pretty closely. I would say in terms of retention, I think, the metric we have shared before is that we've got 90% revenue retention.\n\nWe feel -- we think we're right in that range so we don't have any fundamental changes we're seeing in sort of the new customer behavioral cohorts that would indicate any change in that. So, that's sort of the -- that's kind of where we sit on retention. On the unit economics, a piece of it. Certainly, it's an interesting quarter for us.\n\nWe've been super pleased with the increase in new customers. And what that drives actually is some impact in the P&L. We touched a little bit in terms of potential impact on transaction costs with some of the fraud levels being a little bit elevated. We also talked about customer service expenses getting impacted because new customers contact us a lot more.\n\nBut if you strip that out and look at the core fundamentals of the business, the unit economics is pretty consistent and stable, and we continue to see a profile that's very interesting with opportunities to continue to improve. So, I think Q3, because just for the significance of the new customer additions, was fantastic to see along with lower marketing costs and higher efficiencies. You know, we saw the impacts flow through the panel, but the fundamental unit economics is pretty stable.\n\nRobert Napoli -- William Blair -- Analyst\n\nThank you. Appreciate it.\n\nOperator\n\nOne moment for our next question. Our next question comes from the line of Will Nance with Goldman Sachs. Your line is open. Please go ahead.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nHey, guys. Thanks for taking the question. You know, at first, I wanted to ask about, you know, why we weren't flowing the revenue beat into the fourth quarter guidance. I think you guys have addressed that quite well.\n\nAnd so, I mean, instead of that, I'll ask this. I mean, you guys sound really optimistic about what you're seeing from a customer acquisition standpoint. If we fast forward three months from now and the investments that you're planning on making in the fourth quarter to, you know, continue to accelerate customer acquisition pay off, and, you know, theoretically, that leads to a much better than expected new customer additions in the fourth quarter as well. I mean, could you just spend a little bit of time on some of just the geography of how where that flows through on the P&L? So, I mean, you've touched on higher fraud costs, obviously higher marketing, hopefully, higher revenue in future quarters.\n\nBut, you know, when we think about things like, you know, higher fraud costs running through promotional first transactions free, things like that, just what are some things to look out for so investors can kind of be prepped for what to expect in a very strong organic growth quarter?\n\nHemanth Munipalli -- Chief Financial Officer\n\nYeah, I mean, I think you really touched on key elements [Technical difficulty] P&L. And [Technical difficulty] it is something we – we're a little bit elevated during the period that we're driving a lot of new customers. We do see increased customer contacts in that period of time. It's actually pretty significantly higher but then starts dropping down materially as well.\n\nSo those are some of the key elements that you can think of from a unit economics perspective. Our marketing efficiencies, we believe we've made some -- you know, we made some significant improvements over the last couple of quarters. We do see line of sight for continued improvements. But having said that, there's a lot that's happening in market, as well as [Technical difficulty] we want to be thoughtful of when we think about marketing spend.\n\nThe bottom line on marketing, too, I want to just reinforce is that we've continued to maintain that high ROI expectation on marketing. So, when you look at our LTV and GAAP ratios, we monitor that all the time. They're well within the range of where we want us to be from a payback perspective.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nGot it. That makes sense –\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nThe one thing I'd add, Will, I think –\n\nWill Nance -- Goldman Sachs -- Analyst\n\nYeah.\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nYeah. And I think that answers the core of your question, Will. I think the strategic perspective that I've had is, as I mentioned earlier, but it's because we're seeing great -- you know, record addition -- we saw record additions of new customers in Q3 and we're optimistic on that front in Q4. What it also does because of the payback dynamics and the strong repeat behavior, the strong retention that we're seeing is that that eventually flows down to transaction profit.\n\nAnd I think that that gives us when I say optionality in '23, it -- you know, we have a sustainable business that we can then decide as we go into '23 how we think about to continue [Technical difficulty] vision over the long term while also being mindful of the profitability dynamics. So, we're being efficient when it comes to acquisition in Q4. We're also making the investments to give us that optionality as we head into 2023.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nYes. No, that all makes a ton of sense. And, you know, I appreciate all the color that you guys gave on kind of one year out from the IPO in the slides. Super interesting.\n\nYou mentioned the top three corridors and the percentage of new customers coming from outside of those corridors. I'm just wondering if you could kind of update us on the size of that from a revenue or send volume perspective today and where do the -- how much of the top three corridors contributing today and where was that kind of a year ago?\n\nHemanth Munipalli -- Chief Financial Officer\n\nYeah, those are obviously stats that we don't share. I would say we continue to have a significant amount of revenues from our top X number of quarters, if you will, that obviously, North America originated. But we're seeing increasing mix toward international as well. So, more to come on that, and we'll be at a point where we can talk more about it.\n\nBut I think I would say the growth from new customer activity is it's going to [Technical difficulty] revenue concentration continues to be more toward the North American business.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nUnderstood. Appreciate you taking all my questions and nice results today.\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nThanks, Will.\n\nHemanth Munipalli -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. And one moment for our last question. And our last question comes from the line of Alex Markgraff with KeyBanc. Your line is open.\n\nPlease go ahead.\n\nAlex Markgraff -- KeyBanc Capital Markets -- Analyst\n\nHi, team. Thanks for taking the question. Maybe a couple here. Just kind of on the same note around the impact of new customers as it relates to transaction margin this quarter versus last.\n\nI was curious if you could characterize how much the sequential decline is related to new customers. As I recall from last quarter, there is some commentary around, you know, more stable transaction margins. I assume that was kind of excluding the impact of any new customers. So, maybe just any sort of commentary there.\n\nYou know, if you were to strip out the impact of the, you know, record net adds to that commentary around stable margins hold.\n\nHemanth Munipalli -- Chief Financial Officer\n\nYeah, it was a great question. Yeah, we've been looking at that pretty closely as well. I would say that if you strip the effect of new customers out, we're broadly stable at the levels that we've been historically. And the other thing to just mention in terms of sort of transaction fraud loss impacts in Q3 that we also had obviously unpredictable sort of one-time localized effects, which are well within our overall guardrails, but these are things we see from time to time.\n\nSo that was probably more of the effect than the build on new customer impact. When you strip those out, we're pretty much in line with a stable trend on transaction margins and in line with what we've seen historically.\n\nAlex Markgraff -- KeyBanc Capital Markets -- Analyst\n\nOK. That's really helpful. And then just lastly, around CAC. I'm curious when I think about some of the localized marketing efforts, is there any sort of FX tailwind that you all are realizing with that more localized marketing spend?\n\nHemanth Munipalli -- Chief Financial Officer\n\nThere is going to be some translational impacts that we're seeing when it comes to the FX impacts on our overall spend. Again, given the nature of our business and to my earlier commentary that we have quite a bit of concentration in terms of our -- on the revenue side of the business, out of the US. The international mix has less of an overall impact, but it does impact us from a translation perspective and operationally in certain areas.\n\nAlex Markgraff -- KeyBanc Capital Markets -- Analyst\n\nOK. Super helpful. Thanks, guys.\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nThank you.\n\nHemanth Munipalli -- Chief Financial Officer\n\nThanks, Alex.\n\nOperator\n\nThank you. And this does conclude today's question-and-answer session. And I would like to turn the conference back over to CEO Matt Oppenheimer for any further remarks.\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nGreat. Thanks so much. So -- and thanks everybody for the really thoughtful questions. As we always do at Remitly, I'd like to end the call by highlighting another one of our amazing customers.\n\nAnd this customer's name is April. April joined Remitly in June of 2022 and sends money from the U.S. to family in Kenya. And April shared, \"I would highly recommend Remitly for sending money as fast and reliable.\n\nI send money to Kenya once or twice a month. And my people have received it safely.\" April is one of our now millions of customers that we want to thank for using Remitly and specifically April for recommending Remitly to others. We're super excited about the rest of the year and beyond and look forward to sharing our progress as we continue to execute our vision of transforming lives of immigrants and their family [Audio gap] financial services on the planet.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStephen Shulstein -- Vice President, Investor Relations\n\nMatt Oppenheimer -- Co-Founder and Chief Executive Officer\n\nHemanth Munipalli -- Chief Financial Officer\n\nTien-Tsin Huang -- J.P. Morgan -- Analyst\n\nAndrew Schmidt -- Citi -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nRobert Napoli -- William Blair -- Analyst\n\nWill Nance -- Goldman Sachs -- Analyst\n\nAlex Markgraff -- KeyBanc Capital Markets -- Analyst\n\nMore RELY analysis\n\nAll earnings call transcripts"
}