{
  "companyName": "Scotts Miracle-Gro",
  "companyTicker": "SMG",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/scotts-miracle-gro-smg-q4-2022-earnings-call-trans/",
  "content": "Scotts Miracle-Gro (SMG -0.02%)\nQ4 2022 Earnings Call\nNov 02, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Q4 2022 The Scotts Miracle-Gro Company earnings conference call. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Kelly Berry. Please go ahead.\n\nKelly Berry -- Vice President, Investor Relations\n\nGood morning, everyone. Welcome to The Scotts Miracle-Gro Company's fourth quarter earnings conference call. Today's comments from Jim and Dave have been prerecorded. After their comments, we'll take your questions.\n\nI want to remind everyone that our comments today will include forward-looking statements and so our actual results could differ materially from what we discuss. I'd refer you to our Form 10-K, which is filed with the Securities and Exchange Commission, so that you may familiarize yourself with the full range of risk factors that could impact our results. This call is being recorded, and an archived version of the call will be stored on the Investor Relations portion of our corporate website, scottsmiraclegro.com. We have a lot of ground to cover, so I'll turn the call over to Jim Hagedorn to begin.\n\nJim?\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nThanks, Kelly, and good morning, everyone. I don't think I have to revisit everything we faced this past fiscal year or in the previous two. We're in unusual times. During the pandemic, we responded to the unprecedented challenges with winning strategies to manage all the craziness that came with it.\n\nWe did so by delivering record results. Now we're in the aftermath of the peak COVID years facing record inflation, supply chain disruption, war in Ukraine, and a steep downturn in the cannabis industry. It's a messy situation. But here's what I know.\n\nWe get -- and the leadership team is on it. We have our organization headed in the right direction. My confidence stems from the work we did in the back half of fiscal '22 to improve our cost structure. It also is grounded in our plans for '23.\n\nIf there is a doubt about our willingness to bold and decisive steps to orient our company to the realities of today, I can assure you we're doing what's necessary to reduce debt and restore acceptable levels of profitability. I'm optimistic we will remain within the bounds of our bank covenants. I know you're looking for guidance. Dave Evans will explain how we see the year shaping up in the U.S.\n\nConsumer and Hawthorne segments. We're focused on hitting EBITDA and free cash flow targets. In fact, our management incentive program for fiscal '23 and is based on leverage related metrics. For fiscal '22, we finished at six times debt-to-EBITDA.\n\nWe're comfortable with our leverage trajectory to remain compliant for the first six months and have a clear path into the fours by the end of the fiscal year. The personal goal of mine and Mike Lukemire is to get to four and a half times. This will position us to move leverage back to our normal levels in the 3s by the close of '24. As for cash flow, we continue to project $1 billion of free cash flow by the end of fiscal '24.\n\nIt's worth emphasizing that much of our leverage improvement is about timing. As the calendar changes, so will our leverage we will naturally and significantly delever in the intermediate term. Our road map this year is based on three major themes. First, we're strengthening the balance sheet, paying down debt, improving free cash flow, and tightly managing operations.\n\nWe made significant progress with cost-outs in fiscal '22, and we're making further reductions in fiscal '23 to give us more room to responsibly manage leverage and move us toward our targets. Second, we're confident in the consumer business. Lawn and garden is a steady mature business that historically is a strong cash flow generator. We emerged from fiscal '22 reaffirming the strength of our brands, the power of our retail relationships, and continued high consumer engagement.\n\nThese represent strengths and we'll capitalize on them. Third, we're remaking Hawthorne. It's not lost on me that this business has been a drag on earnings. I want to emphasize that we believe in the future of the cannabis industry and its eventual turnaround.\n\nThere is a huge amount of value that will be unlocked in Hawthorne once this rebound occurs. But I also know that we need to overhaul Hawthorne to adjust the current realities and to protect core SMG from the cannabis downturn. I'll explain shortly how we are integrating Hawthorne into Scotts Miracle-Gro, reconfiguring its lighting portfolio, and revamping its organizational structure. Before I go much further, I have a few comments about our fourth quarter.\n\nWe did what we said we'd do. We revised our guidance multiple times last year, more than I recall in a single year. But the fourth quarter proved we can be agile enough to make an impact quickly. We made the quarter, we landed within our EPS guidance, we overachieved free cash flow expectations, and we stayed within our leverage threshold.\n\nIt was a good way to end the year, and I'd like to think that just the start of a trend. I want to express my heartfelt appreciation for our banks, retailers, and other partners for helping make it happen. It's been an especially hard six months for our associates. And I have a personal message for them as I know many of them are listening to this call.\n\nI want to thank you for your commitment and loyalty. Your resilience is outstanding and will go a long way in contributing to our long-term success. Words can't express how much I appreciate your support. And when we get these challenging times behind us, I will not forget all your help in turning around the company.\n\nNow let's get back to the themes, starting with the balance sheet and leverage improvement. Our SG&A for fiscal '23 is budgeted to be below fiscal '19. We have minimized capital expenditures and put M&A activities on hold. Our accomplishments thus far can be credited to the cross-functional Project Springboard team we announced last quarter.\n\nThe team quickly achieved over $100 million in annualized savings as a result of extensive actions that included reducing our footprints, tightening variable spending, and eliminating hundreds of jobs starting at the highest levels. Our management ranks have been reduced by 35%. In addition, the Springboard team executed asset sales and a large sale-leaseback of our Hawthorne facility in Vancouver, Washington to generate incremental cash for debt reduction. This year, Springboard's [Inaudible] is to get our leverage into the fours at the end of fiscal '23 and into the threes by the close of '24.\n\nSpringboard 2.0, as I call it, will help us further streamline, reduce working capital and conserve cash. We are taking a hard look at how we operate, what we prioritize and where we invest. We are driving operational efficiencies to the fullest extent. Among Springboard 2.0's focus areas are inventory reduction, where we expect to realize at least $400 million in cash flow benefit this year by limiting production and selling through current inventory, and another $85 million in cost outs to be realized in fiscal '23 and '24.\n\nThe team has so far identified $60 million of this $85 million target. In addition, we believe we have at least $15 million of benefit from commodities as compared to earlier assumptions. The majority of these savings will come from our supply chain, including reducing warehouse space companywide, enhancing productivity through strategic material substitutions that do not impact product quality, improve labor efficiencies and resizing Hawthorne operations. These cost reductions can potentially improve our leverage and give us runway to operate, especially given the economic uncertainty.\n\nWhile indications are that the consumer remains resilient and our category is essential to their lives, no one knows where the economy is headed. The greatest economic mines have given wide-ranging predictions on what to expect. But even if the economy goes into recession, history shows that consumers turn to our products. During the recessionary period of 2008 to 2010, we realized year-over-year consumer sales increases of 2%, 15% and 6%, respectively.\n\nI'd sum things up this way, we are leaner, less layered, and higher performing. We are more competitive and focused. We will execute with precision and speed. For those who know me, I refer to our Wall Street Journal article from the 1990s where my family's Miracle-Gro took over Scotts.\n\nThe gist was how the leadership of the Hagedorn family would bring thriftiness and an entrepreneurial spirit to the new entity. These are elements we are embedding into our culture. And the people who are part of our company must buy into this approach, and I'm convinced it will be a better company as a result. Now let's talk about my second theme, the U.S.\n\nconsumer business. The fundamentals of our U.S. consumer business are strong. Our brands are everything.\n\nThey are iconic and loved by consumers. We have great partnerships with our retail partners. We have the best sales force and field execution in the industry. and we have the leading market share.\n\nCompared to the pre-COVID year of 2019, our market share has increased or stayed flat in almost all categories. There are not many brands out there that can boast of brand awareness scores of 70% to 90%, we can. Consumers are engaged and have a high intent to stay. 80% of the 20 million new gardeners who entered the category during COVID continue to be in it.\n\nOur recent Federal Reserve report on consumer behavior indicated people are emphasizing leisure time and for many, this includes time at home. Our plan is to capitalize on these strengths. I believe we're being reasonable with this year's sales forecast by assuming we'll be flat in POS units in the U.S. consumer business, with the exception of a 10% hike in units in fertilizer and seed, which were down nearly 20% last year and represent one of our most weather-dependent businesses.\n\nPoor weather was a factor in suppressing early season consumer sales last year, in large part due to an unusual polar effect that hit the Midwest and Northeast in March. Current weather models are showing, despite the ongoing dry conditions in the West, more normal conditions in many of our key markets. Now I don't want anyone to think we're cutting so deep that we're harming the core business. We will respect and protect it.\n\nWe've heard from our largest investors that this business is as good as they come, and we agree. We will not take any actions that negatively impact its health or integrity. In fact, we're investing in lawn and garden, take innovation, long a tenant of our success. We will continue to drive product development that meets evolving consumer needs, such as drought-tolerance solutions and cost-effective, sustainable ingredients with greater or equal efficacy.\n\nWe are also continuing to invest in sales and marketing, ensuring our salespeople and consumer-facing teams have the tools and resources they need to deliver on our plan. The key to regaining 10% in the more profitable sales mix of fertilizers and seeds is our strategy to engage consumers earlier at the very start of the season. We will front-load our marketing and promotional spend to drive early consumer traffic and augment it with execution at the field level and with the cooperation of our retailers. Given the economy, retailers are concerned about foot traffic, especially early in their fiscal year.\n\nLawn and garden plays a critical role in driving a high percentage of their overall transactions in the spring. Our brands are the catalyst for their early foot traffic and sales. A third of our annual business occurs in March and April, historically, confirming it's a critical time to engage with consumers. We also know that consumers who make their first purchase before May spend twice as much in the category.\n\nOur retailers are committed to joint promotions, advertising, and other activities. The combination of our media, retailer media, and price promotion has a three to five-times multiplier effect on POS lift versus promotion or media alone. Look no further than what we did this fall. In a two-week period, we executed joint efforts on our fall fertilizer business with a key retail partner.\n\nThe result was over a 50% increase in POS units from prior year, a microcosm of what we expect this spring. I want to emphasize that we'll be driving attachment with our brands in live goods, soils, plant food, and controls, too. It's important to remind you that live goods continues to be a key category for us and continues to grow at rates faster than many other lawn and garden categories. When consumers buy plants and add products to their carts, they mostly buy our brands.\n\nWe will undertake promotions and campaigns on the benefits of gardening, too. Inflation is an opportunity for consumers to grow food at home and anticipated product shortage due to drought can further encourage more DIY planting. I want to address gross margin. Due to a variety of factors in fiscal '22, our margin rate declined for the second consecutive year and is now nearly six points below its historical norm.\n\nWe expect a further decline in fiscal '23. This is not acceptable. We have line of sight to meaningful margin rate improvement by the close of fiscal '24, and Dave will talk more about this in his comments. We believe we can get gross margin back to historical levels through a softening of commodity costs, supply chain efficiencies, and productivity improvements with trade.\n\nBut if we still have a gap, we aren't ruling out pricing to get gross margin back where it needs to be. Let's turn to Hawthorne, my third theme. We have a number of strategic levers we could pursue with Hawthorne but we put them on hold until cannabis oversupply issues subside. Our first order of business is to return Hawthorne to profitability, knowing that its long-term growth rates are still greater than those of our core business.\n\nThat's the big reason we got into this business in the first place. But for now, we've given Hawthorne an aggressive profit goal. Given we expect sales to be modestly down for the full year we will get Hawthorne's profitability back through cost reductions alone. I told you last quarter that I believe we could achieve savings of $65 million in Hawthorne.\n\nWe started work in fiscal '22 by closing multiple distribution centers, selling assets, and reducing the workforce. More cost-efficiency efforts are still underway. Hawthorne will operate as a business unit, much like our lawns, gardens, and control business units. This will allow us to capitalize on the synergies of the parent company and significantly drive operating efficiencies.\n\nWe will absorb Hawthorne into Scotts Miracle-Gro in a manner that preserves its unique culture and core strengths because we believe in the business model and its long-term potential. Customer-facing teams will continue to work directly with hydro retailers and growers. No other company can do what Hawthorne does. We are the partner to growers.\n\nWe understand their challenges, and we have the products and solutions to help them be more efficient, productive, and successful. We also know, as does everyone else in this industry, that things are beyond tough. Many players are just trying to survive. Oversupply along with inconsistent state regulatory approaches and a lack of federal action on safe banking, 280E, and other issues are contributing to the prolonged downturn.\n\nThis is what I have to say directly to our Hawthorne customers, we are not abandoning ship. We are tightening up, but not giving up. We'll ride this out with you and be ready for the market when it rebounds, and it will. The U.S.\n\ncannabis industry matters. Its economic impact on the American economy is nearly $100 billion this year and is expected to rise to $158 billion by 2026. It supports just over half a million full-time jobs, and more people are consuming cannabis with expectations of around 71 million consumers by 2030. More states continue to legalize it in some form.\n\nThinking about the immediate opportunities ahead for Hawthorne, you can expect us to continue to innovate with Gavita and capitalize on the upside of the Agrolux Wega LED technology that we launched in early '22 and for the professional horticulture space. In the short time since it's launched, the Wega has delivered over $60 million in new ProHort sales and catapulted its market share in the LED greenhouse growing space. Tightening up Hawthorne includes rationalizing the Lighting brand portfolio. We will exit high-pressure sodium and high-intensity discharge lighting to focus on LEDs, where this industry is moving because of the energy and cost savings.\n\nThe business community as well as consumers are increasingly focused on sustainability, and this fits with where our things are headed. We will also exit the Lux brand as a continuation of the portfolio reduction that began this summer with the sunsetting of sun systems. When we acquired Lux, the cannabis market was in a much different place. Our strategy was to expand upon our industry-leading Gavita brand.\n\nThe Lux team improved our marketing savvy to growers with credible influencers and brought us technologies that can be integrated into our Gavita offering, but we believe the Wega can be the mid-tier option as a replacement to Lux. I'll now address a few elephants in the room. My family is the largest shareholder in this company. This is more than a job for me.\n\nThis company is my family legacy. I've been part of this business most of my life. And I'll do what it takes to set this company up for ongoing success and long-term shareholder value. You have my commitment.\n\nI will and have been making tough choices. I will do what is required. Regarding the dividend, we have no plans to touch it based on what we see today. The truth is that cutting the dividend entirely or even by a percentage does not move leverage that much.\n\nWe've heard feedback from investors around this topic. Most of our largest shareholders have told us in clear terms that we should not cut the dividend unless absolutely necessary. And here's what I think about issuing more equity. Based on our current view, I do not believe it will be necessary.\n\nAs always, we will evaluate our options and do what is required. Regarding the concept of selling assets, we've looked at it and we'll continue to do so. But given the circumstances and other considerations, it's not optimal for our company right now. Our Board will explore these kinds of opportunities on an ongoing basis and determine if and when it's in the best interest of our company and shareholders.\n\nOne final item is an update on our search for a permanent CFO. We have focused on external candidates who are innovative thinkers, have deep experience, and are capable of working with our team. we are close to making a decision. I want to thank Dave for stepping in from the Board.\n\nI asked him to serve as interim CFO because he knows our company well and is a talented financial operator. He's brought tremendous value and provided the financial leadership our company needed in this transition period. I know it's come with a great deal of work and stress. Words cannot express my full appreciation for his partnership and support.\n\nI'll close with this. We continually talk to our largest shareholders and take what they say to heart. We are making changes across the organization and creating stronger conditions for the success of our core business in addition to reimagining Hawthorne. At the same time, we are highly confident in our brands and that of the consumer.\n\nWe have embraced our reality and evolved accordingly. Dave, I'll now turn it over to you. Thank you.\n\nDave Evans -- Interim Chief Financial Officer\n\nThanks, Jim. I'll take a deeper dive into the P&L and balance sheet for fiscal '22 and provide direction for fiscal '23. As you likely know, this is my second time stepping in as CFO role at Scotts. My previous experiences and relationships have allowed me to hit the ground running.\n\nIt's clearly been a challenging time for the business, but over the past two months I've been here, it's been inspiring to see the commitment and dedication of our associates. I understand the predictability and credibility in our financial projections are important drivers of our market performance. Our repeated changes to guidance in fiscal '22 and the late summer correction to free cash flow primarily resulted from the unexpected and sudden volatility in the U.S. consumer market and the pace in which we reacted, driving down costs and implementing operational changes.\n\nWe're bringing more rigor to our sales and cash flow forecasting and improving processes to better translate changes and operational assumptions to balance sheet forecast. This is imperative when running in a constrained manner. We can now better assess our position at an early stage and respond in a swift and coordinated manner. Moving on to results.\n\nU.S. Consumer sales were down 18% for the quarter, ending the year down 8%. This was in line with our fiscal year guidance of down 8% to 9%. I'll spend a few moments on this as it's a particularly important context for fiscal '23.\n\nThe 8% decline in fiscal '22 sales was driven by a 15% decline in volume and mix, offset by a 7% benefit from year-over-year pricing. The 15% decline related to volume and mix is a function of unit volume declines across most categories. The most pronounced and our most weather-sensitive categories, lawn fertilizers and grass seed. It also reflects a challenging year-over-year comp where in fiscal '21, the retail channel ended the year in a heavier retail inventory position than it started.\n\nThe 7% benefit from pricing reflects the cumulative benefit of actions taken in August of '21 and January, April, and August of '22. We've been making every effort to manage the value equation with the consumers by minimizing price increases, while at the same time, attempting to keep pace with cost inflation. Transitioning to Hawthorne. Sales were down 49% for the quarter.\n\nThe entire cannabis industry is under immense pressure due to oversupply, limited enforcement, and inadequate public policy. As expected, the overall run rate for Hawthorne improved slightly in the fourth quarter, driven by innovation in our horticultural lighting business. Jim talked about Wega, our new LED product that drove the improvement in sales in the fourth quarter. The rest of the Hawthorn portfolio experienced a decline in the fourth quarter, similar to what we realized in our third quarter.\n\nThe fourth quarter results put Hawthorn full year sales down 50% compared to fiscal '21. Moving on to gross margin rate. The adjusted gross margin rate for the quarter was about 1,400 basis points below last year, which brings the full year decline to about 400 basis points, in line with our expectations. Just like we mentioned in the third quarter, the largest driver of the fourth quarter gross margin decline was fixed cost deleverage, stemming from the volume miss in both segments.\n\nWarehousing and manufacturing costs are largely fixed in the short term, and these fixed costs were spread over fewer units in the quarter. On a full year basis, fixed cost deleverage was also the largest driver of the decline in gross margin rate. This is fairly punitive in fiscal '22 as both sides of the equation moved against us. Our sales volume was clearly down, but at the same time, our fixed costs grew as we expanded our supply chain footprint and inventories.\n\nAs we reported all year, rising commodity costs also impacted the gross margin rate. The inflation we've experienced has impacted us across the board on every commodity we purchase. Our top raw materials all saw double-digit increases for the year, some in excess of 40%. We've been consistent in our approach to managing this record-high inflation.\n\nOur pricing actions have been designed to offset the dollar impact of commodity inflation, but not necessarily rate. Similar to our third quarter results, SG&A was down 27% in the fourth quarter versus last year, leaving us down 18% for the full year. This result was slightly better than our latest guidance, driven by continued momentum from Springboard initiatives. The three key themes driving the SG&A savings in Q4 are the same as what we shared last quarter, incentive compensation, headcount restructuring, and spending reductions.\n\nAdjusted EBITDA for the year was $558 million, down from $903 million in fiscal '21. The combination of lower EBITDA and higher borrowing levels resulted in a leverage ratio of about six times debt to EBITDA at year-end. Though this amount of leverage was expected, we're clearly unsatisfied with the results. I'll discuss our leverage outlook and my comments around fiscal '23.\n\nMoving down the P&L. In fiscal '21, we acquired a 50% equity interest in Bonnie Plants, a leading provider of live vegetables, herbs, and fruit. Bonnie's 2022 fiscal year finished in July, the first month of our fourth quarter. Bonnie's sales saw a late surge and landed down only 1%.\n\nHowever, Bonnie experienced high inflation across their entire cost structure, especially in their fuel costs that began to increase during their peak selling season. They did not have visibility into the folks extended their cost increases and time to adequately adjust their pricing and SG&A costs. These cost pressures translated to a $13 million loss in equity earnings on our P&L. The Bonnie team is working hard on a plan for fiscal '23 to address their overall profitability, no different from us.\n\nJim covered the operating changes that we are making in the Hawthorne Lighting category. Sunsetting HBS and Lux to focus on Gavita LED resulted in an inventory and intangible asset restructuring charge of $110 million for the quarter. We also recognized additional net charges of $19 million, which primarily consisted of employee termination benefits and other restructuring activities stemming from the continued efforts of Project Springboard. Below the operating line, interest expense was $13 million higher in the quarter and $39 million higher for the fiscal year.\n\nThe change was driven by higher borrowing levels. Our full year adjusted effective tax rate landed at approximately 22%. The favorable rate is due to a benefit from discrete items related to the vesting of long-term share-based compensation. On the bottom line, we had a GAAP loss per share of $3.97 in the quarter, compared to a loss of $0.86 last year.\n\nThe number includes the impairment and restructuring charges that I described earlier. The non-GAAP adjusted loss per share, which excludes impairment, restructuring, and other nonrecurring charges, was $2.04 in the quarter, compared with a loss of $0.82 a year ago. This brought our full year non-GAAP earnings per share to $4.10, right in line with our latest guidance. We ended fiscal 2022 with negative free cash flow of $243 million, better than our latest guidance of negative $275 million to $325 million.\n\nThere were two primary drivers of the negative cash flow. First, inventories were up $200 million or nearly $300 million when excluding the Hawthorne inventory write-downs. The increase was driven equally by additional physical inventory quantities and higher commodity costs. Inventory was trending higher going into the third quarter, but the operations team quickly adjusted their raw material purchases and production plans.\n\nThis quick pivot enabled us to limit the inventory increase for the year. The second driver of negative cash flow was a decline in accounts payable of approximately $170 million. This decline was a result of the change in purchasing and production plans that we just covered. Fewer purchases in the third and fourth quarters translated to lower accounts payable at year-end.\n\nI'll switch gears now to our outlook for fiscal '23. As we look forward to fiscal '23, our primary objectives will be to generate strong EBITDA and cash flow and to strengthen the balance sheet while maintaining quarterly compliance with our credit agreement covenants. Since these are our primary objectives, my comments for fiscal '23 will center around these metrics. Jim has provided justification for optimism in our U.S.\n\nconsumer business, starting with consumer purchases of our products at the store shelf. The fact that our products performed well in the last recession, combined with discrete and incremental marketing and promotional programs, both ours and retailers and an assumption of more normal weather in the spring supports cautious optimism. But there's also significant uncertainty surrounding factors we don't control. To the positive, households still appear to be in good shape in spending at a healthy clip.\n\nBut inflation is at a 40-year high and taking an increasingly larger toll on household income and savings. And within that broader context, we've taken significant price increases across all of our categories. Transitioning from consumer purchase activity or POS to our sales, we are confident in our retailers' commitment to the category. We've made informed macro-level assumptions relating to their inventory positions next year, but can't anticipate with certainty external factors which may influence their decisions 10 months out.\n\nAnd as it relates to pricing, we successfully executed the August 1st price increase, as described on our third quarter call. We now expect the net impact of year-over-year price increases to be high single digits, roughly offsetting the dollar impact of increased commodities, more on commodities in a moment. For Hawthorne sales, we're making the assumption that we have reached the industry trough in the fourth quarter and anticipate sales at the start of the year to mirror the run rate we ended with in fiscal '22. We expect this to be followed by a seasonal increase in the spring, followed by year-over-year growth in the fourth quarter as the industry slowly recovers.\n\nAs you're all aware, the lack of visibility into this market makes it challenging to declare the trough with certainty. All these factors and assumptions in aggregate lead to an expectation of low single-digit percentage growth in consolidated net sales in fiscal '23. Moving down to gross margin rate. We see two primary headwinds in '23.\n\nWe increased year-over-year commodity costs and reduced fixed-cost leverage. We expect these to be partially offset by cost savings initiatives driven by Springboard. Approximately two-thirds of the commodities that will run through our P&L in fiscal '23 have either already been purchased, manufactured or hedged. And with three years of rising costs, about a third of our cost of sales are now driven by assumptions subject to market forces.\n\nWhile our assumptions for fiscal '23 are supported by balanced market insights, some uncertainty remains. That uncertainty, risk or opportunity will manifest itself in the later stages of fiscal '23, given inventories currently on hand and hedges. Certain commodities examples being resins, pellets and international freight have slightly moderated in recent weeks. Those trends may not extend to our larger inputs related to fertilizers and energy-derived products given the uncertain global environment.\n\nThe second headwind relates to reduced fixed cost leverage, which in fiscal '23 is a function of lower production. We ended fiscal '22 with consolidated inventory of $1.3 billion, net of reserves. We expect to exit fiscal '23 with a decline of at least $400 million. To help drive this reduction, we'll be producing less, which will result in fixed-cost deleverage.\n\nWe expect these two gross margin rate headwinds and to be partially mitigated by Springboard supply chain initiatives. These initiatives include rightsizing our supply chain footprint, product rationalization efforts, principally in Hawthorne, and improved labor efficiencies. Mix should also benefit us in '23. All of these factors combined will result in a net decline in our consolidated gross margin rate in fiscal '23.\n\nMoving down to SG&A. We expect a year-over-year decline, more than offsetting the impact of inflationary increases and the potential for reinstating incentive compensation. The decline will be driven by Springboard initiatives. Speaking of Springboard, as Jim discussed, Springboard 1.0 yielded more than $100 million of improvements.\n\nWe're targeting an additional $85 million in our 2.0 initiative. While we're still in the early days, we've already identified discrete initiatives to realize more than two-thirds of this target. The majority of the benefits identified to date relate to supply chain initiatives that Jim and I previously discussed. Summing up the collective assumptions for revenue, margin, and SG&A, we are committed to delivering low single-digit percentage growth in adjusted non-GAAP operating income.\n\nAdjustments from operating income to EBITDA are expected to be about $25 million higher in fiscal '23 than fiscal '22, primarily due to increased depreciation and a change to pay short-term variable compensation if targets are achieved, mostly in shares rather than cash. Below operating income, we expect interest expense to increase $35 million to $40 million. The increase is being driven by higher interest rates, partially offset by lower average debt. We expect our effective tax rate to be 25% to 26% and share count to modestly increase.\n\nWe remain committed to generating $1 billion in free cash flow over the next two years. Leverage will remain elevated over the next two or three quarters. However, given the normal seasonality of our business, our credit agreement amendment allows for a step-up in maximum leverage from 6.25 to 6.5 times debt-to-EBITDA for the second and third fiscal quarters. With properly corralling pacing of our initiatives, and assumptions, we will remain below the maximum level stipulated by our credit agreements.\n\nAs Jim said in his comments, we are targeting to reduce our debt-to-EBITDA ratio into the fours by year-end. Well, this is not our traditional format for guidance, this is also not a traditional year for both internal and external factors. In summary, we've been diligently assessing each of these operating variables and implications to our fiscal '23 plan. We continue to take actions to mitigate risk and solidify our position going into next fiscal year and beyond.\n\nAnd the direction we provide for next year is aligned with our priorities. Strong focus on EBITDA and cash flow to strengthen the balance sheet while maintaining compliance with our credit agreement covenants. Now I'll turn the call over to the operator for your questions. Thank you.\n\nOperator\n\n[Operator instructions] And our first question comes from William Reuter with Bank of America.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning. My first question is with regard to inventory levels at retail and preseason orders, I know last year, we came into the year heavy. Can you give us a little more color on where they are right now? And I think last time you've been -- last quarter, you've been optimistic that since POS was pretty decent that we'd have a pretty preseason order.\n\nDid that shake out how you expected it to?\n\nMike Lukemire -- President and Chief Operating Officer\n\nThis is Mike Lukemire. The preseason order is pretty well fixed to about the same level of build as we did in the previous year. So it's really not POS based. It's really about being ready for the season to break.\n\nSo we look at the same levels of shipments basically as we saw last year.\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nBut I'd say we came out of the year, Bill, down slightly. So I would call it a tailwind on inventory. And I think a pretty significant commitment to next year and that build has already started. So I think sort of in line with what we wanted and non inventory problem exiting the year, if that answers the question.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nIt does. And then one follow-up. With regard to your input costs, it seems like some of them have come down, some remain relatively elevated you just pushed through a relatively large price increase. Historically, I know you guys didn't do a lot of NC price increases.\n\nDo you feel like the environment is such that if your input costs did rise throughout the season that you would have the ability to go back to retailers with subsequent price increases?\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nLook, I'll sort of take the beginning and then see who -- if anybody wants to add to it. So Hagedorn here. First, the answer is yes. And so that's the big headline.\n\nAnd it is true that we have not done -- I think maybe in my entire time here, it's a onetime other that we took in season pricing and I don't think we've ever taken more than two increases during a seasonal year. I think that -- listen, I'm not into the self-criticism exactly, except that I think we've been pretty decent at covering our sort of dollar cost. The problem is that's been pretty dilutive to our margin over the, call it, last year plus. And so I think we're still -- there was a good article last couple of days in The Times just about large branded companies and sort of trying to remedy sort of similar issues where they've gotten behind on margin.\n\nWhat's clear to me is that the gross margin is our fuel. We need it are our consumer branded company. And we need that for our own activation efforts, plus we help the retailers fund their efforts. And so we get behind on it like we've done, I think it's pretty bad.\n\nNow the other side of that, I've talked to most of our large retailers in the last week at the very senior level. So either it's the CEO and/or the merchant teams. I think there is a concern. And I don't mean this in a bad way.\n\nIt just means that nobody really knows what to expect from the consumer and the level of sensitivity to pricing. And I think this is the great question going into '23, not just for us, but for other branded good companies is what is that balance or what people would, I guess, call elasticity. We don't really know. And -- so we're going to have to sort of deal with the sort of sensitivities that people have on what can the consumer bear.\n\nBut I would say that the work we're doing I aim, and I've told folks here that this is not optional. We need to get as quickly as possible back to historic margin rates. And Dave -- actually, if you go back, Dave has done quite a bit of work on this. They're pretty stable with us and higher.\n\nAnd so if we can't get back there through our efforts, then we're going to need to deal with pricing. I think it's very much fair for retailers to say, you guys deal with your stuff first before you expect us and/or the consumer to pay for margin issues, which -- a lot of which are driven by cost of goods, which we think will soften. We hope this. Our forecasting tells us that.\n\nAnd then other things that Mike and his crew are doing within the supply chain to take cost out of the system. But if we can't cover that gap, we will come back for pricing. It's just that important for us. I don't know, Dave?\n\nDave Evans -- Interim Chief Financial Officer\n\nNo. Jim, I think you just stated it perfectly right. Nothing more to add.\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nMike, anything you'd add?\n\nMike Lukemire -- President and Chief Operating Officer\n\nI would agree with that.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. Very helpful. Thanks for taking the questions, as always.\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nThank you, sir.\n\nOperator\n\nOur next question comes from Jeff Zekauskas with J.P. Morgan.\n\nJeff Zekauskas -- JPMorgan Chase and Company -- Analyst\n\nThanks very much. Just three brief questions. Your deferred taxes were, I don't know, negative $183 million this year. Why is that? And what might they be next year? Second, do you have to drop your production roughly by 10% next year to hit your inventory targets? And then lastly, can you analyze your recent interest expense of $40 million that you forecast? And if you do break your covenants, what happens to incremental interest expense?\n\nDave Evans -- Interim Chief Financial Officer\n\nAll right. Let me start here. I go in reverse. Yes.\n\nI mean -- so deferred taxes grew a bit this year. you'll see our effective tax rate was also kind of unusually low this year. The biggest single factor driving the change in deferred taxes was the impairments that we took this year. So clearly, as we begin the new year, we're not anticipating warrant impairments.\n\nSo I wouldn't anticipate a similar type of change in the balance sheet next year on our deferred taxes. The second question was on production. Yes, so we are targeting a minimum of $400 million reduction in inventory this year, and that will be driving a reduction in our production forecast and the reduction be in the order of magnitude of 15%. So you really got to look by that's like a really super broad number.\n\nYou have to look at and understand it for each major product category because the percentage of fixed cost is different, whether you're looking at our long fertilizers or growing media. It's a whole different type of model, but broadly to answer your question, about a 15% reduction. The third question on interest expense. Yes.\n\nSo interest expense is up significantly from '21 to '22. We see a further increase from '22 to '23, principally rate-driven. On a year-over-year basis, we would expect our average debt to be down in September 30, '23 relative to '22. So it is principally rate-driven.\n\nAs we said in our scripts, we anticipate, given the broad array of assumptions that we've made, that our EBITDA and debt levels will allow us to navigate the covenants throughout the year. But I would also say that we're not -- we are prepared that if changes would occur during the year, we also won't be caught flat floated. Does that answer your questions?\n\nJeff Zekauskas -- JPMorgan Chase and Company -- Analyst\n\nSo if the covenants were broken, what would that do to your interest expense?\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nThat will drive them down.\n\nDave Evans -- Interim Chief Financial Officer\n\nYeah. And we're going on the basis that we're not going to break the covenant because we've got a plan that either -- we believe our plan won't result in that. And should it -- should we find ourselves down the road, then we're readily prepared to ensure we don't break the covenants by taking other actions.\n\nJeff Zekauskas -- JPMorgan Chase and Company -- Analyst\n\nYou said that you generated about $1 billion in free cash flow over the next two years. Can you do a split, what's in '23 and what's in '24 in rough terms?\n\nDave Evans -- Interim Chief Financial Officer\n\nYeah. We're really not -- look, I'm going to be fairly imprecise on this because we're -- there's so many change in variables. But I would say, what you'll see is that $1 billion clearly will be front loaded to '23 because a good portion of that $1 billion relates to inventory reduction. So provided we achieved our operating plan with the sales and the production plans that we have today, we would see a large majority of that happen this fiscal year.\n\nJeff Zekauskas -- JPMorgan Chase and Company -- Analyst\n\nThank you very much. Well.\n\nOperator\n\nOur next question comes from Carla Casella with J.P. Morgan.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nAll right. Thank you, Bill and Jeff asked a couple of my questions already, specifically on that cash flow. But have you said how much of the $1 billion cash flow is from the working capital release alone? And is it mostly just inventory? Or do you see a significant increase from the payables as well?\n\nDave Evans -- Interim Chief Financial Officer\n\nLook, when we look over a period of 2 years, we think anywhere from 40% to up to 50% of the $1 billion could come from inventory reduction. We really anticipate working capital to move fairly in line with our volume.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. So second and third quarter then weighted as well in the season?\n\nDave Evans -- Interim Chief Financial Officer\n\nYeah.\n\nWe would see our inventory -- look, we'll start to see a decline in Q2, but then we should really see the big decline in inventory in Q3 and then Q4. You're not going to see or any meaningful change in inventory from September 30th to December 31st as we prepare for the season.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. And then you did that sale-leaseback at Hawthorne, and you mentioned -- it sounds like you're not looking to do asset sales right now, but you could consider in the future. So I was just wondering, can you just give us a sense for what are your kind of the biggest chunks of assets that you could look to if you need to in the future?\n\nDave Evans -- Interim Chief Financial Officer\n\nYeah. Carla, great question. And I would say that we've done a fairly exhaustive review of our assets to try to identify potential opportunities. And the sale-leaseback was actually executed in the late summer months, and that was actually a facility that we aim to get out of in kind of the near midterm anyways.\n\nAnd so what we effectively were able to do through the sale-leaseback is accelerate the cash benefit move that today. In general, we're not on a broad brush basis, looking to kind of sell and just refinance our assets that are core to our business. This was kind of a different situation. We are looking at other assets that aren't core to our business, and we've taken some other modest actions to divest those, but nothing that's individually significant.\n\nWe've talked in the past about other assets that we have, and I'd just give you the assurance that management and the Board are looking at all of those, and things that commonly come up are Hawthorne, Bonnie Plants. And I would just say that as a team, we feel very committed to those assets at this point. We feel that they're critical to our strategic vision for the future. And we also feel that when we looked at the amount of value that we can get in today's market and the speed with which we can monetize them really didn't make them attractive opportunities for rapidly delevering our balance sheet.\n\nSo I think the message is twofold. One, we did an exhaustive review; and two, the conclusion of that is, at this point, today, we don't see any big items. We're looking at smaller items.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. And then so do you own -- aside from those broader like brand assets, do you own most of your -- or any of your distribution warehousing manufacturing facilities that might be available for sale-leaseback?\n\nDave Evans -- Interim Chief Financial Officer\n\nDifferentiate -- distribution is primarily, if not wholly leased -- manufacturing is -- look, we contract produce some of our some of our items, but the vast majority we produce and what we produce, it's owned it.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. And then if I can, just a follow-up on -- you talked about fixed costs and a lot about fixed cost leverage and deleverage. Can you talk about what -- how you look at this now? And what percentage of costs are fixed or I mean given that so many of the other costs are moving around, given commodity inputs, maybe is there a way to look at a dollar amount of costs that are fixed, to get a sense of -- to compare versus the $85 million in savings you expect to generate this year from Project Springboard?\n\nDave Evans -- Interim Chief Financial Officer\n\nYeah. Just like in broad strokes, I would say in the near term, 30% to 35% of our production asset -- of our manufacturing and distribution costs are fixed, OK? But that's a very near-term look because through Springboard, we're looking at effectively we're addressing everything as if we're variable, and we're attacking these items. And in part, that's why some of our Springboard savings won't even be realized entirely in '23 because to the extent that we're addressing these near-term fixed cost is longer-term variable cost, we are resizing that supply chain footprint and reducing some of those costs. Is that -- does that answer your question, Carla?\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nYeah, that helps. Thank you. And the 35% production [Inaudible], manufacturing, distribution aspect, that's mostly then cost of goods sold?\n\nDave Evans -- Interim Chief Financial Officer\n\nYeah. That would be embedded within our cost of goods sold. So that is like our manufacturing facilities would be an example of that.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nOur next question comes from Eric Bosshard with Cleveland Research.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nGood morning.\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nHi, Eric.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nTwo things, if I could. First of all, the 5% EBITDA growth guidance for '23, I'm just trying to understand sort of what the key pressure points are the key drivers to support that. Dave, you're pretty clear about the 15% production cut, and there's obviously also higher costs still embedded in inventory that you're working through. I understand Springboard on the other side provides benefit to this.\n\nI guess as I look through the consumer demand, your guidance on sales and price seem like -- those are the key variables of achieving that 5% EBITDA growth. Is that the right way to think about that? Or how do you think about the key achievements in getting to that 5% EBITDA growth guidance for '23?\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nWell, I'll start and hand it over to Dave. I think the sales assumptions and the Springboard savings are probably the things that are what are being worked. The assumptions in sales, at least I think from our point of view, and again, I've talked this through with retailers. We just looked at last year, Eric, as being just a pretty tough year.\n\nWe had an approach on our advertising as I think most people are aware that not to do the sort of heavy early season like we're going to be doing this coming year and work more when the weather is good, we spend the advertising we activate, and we do this all based on sort of two weeks ahead kind of look of the world, which was a much more real-time approach to sort of promotion at the retail level. I was having a conversation with the retailer last night. And it was -- if we're sniping kind of in how we marketed previously. It felt like we came home with not having hitting any bad guys and with all of our ammo still in our sort of containers.\n\nWe just didn't get clean shots last year. And that was California, Texas, again, this is so easily checked that I don't think I'm seeing anything that most people don't know. Texas was very cold kind of until it wasn't. The Midwest and Northeast, a polar vortex sort of was un-forecast hit us in sort of late March and didn't really form until toward the end of April.\n\nSo when we look at the forecast and we say flat to last year, and we get half of the decline back in launch, which we think was like their core season was really how important the Midwest, Northeast is to our long -- and Texas for that matter, to our long fertilizer season. So we don't get that back. We get half of what we missed. And we think the forecast is good for that.\n\nWe think the retailer collaboration -- and I mean this in the -- at the deepest level, and I am like really thankful for the positive attitude of our retail partners in this, that is very motivated to make the -- I mean, I think everybody is apprehensive just because of all the chatter on the economy. But I do think that they're highly committed in a very positive way, and we all want this to work. So the work between our marketing group, our sales group, the merchant teams at the retailers, just it couldn't be better. And so we think that it's a fairly conservative forecast.\n\nThis gets back to the sales. But I think if Dave was sort of doing magic on me, he'd say, yes. But it's still -- a lot is counting on that. There's -- and look, Eric, where I'm a lot on this -- I mean, just before Dave handcuffs me here, getting through the first half, which is really inventory load for us on the sales side is kind of everything for us right now, at least for me.\n\nIt gives us room. We naturally delever at that period of time. And we don't really count on anything from the consumer at that point. It's just get the load in, the retailers are motivated.\n\nWe're motivated. It's kind of all -- I think at that point, it's going to be -- the second half of the year is going to be that half year that it's all about the consumer. And so I'm just trying to get there and we'll know at that point where the consumer is at, whether it's Dave said, it was knows. But I want to just get back to Springboard then which is the other side -- go ahead.\n\nYeah. You take --\n\nDave Evans -- Interim Chief Financial Officer\n\nSo look, so I think if in the end here, I mean, I think the team has built tremendous plans to give us confidence in the top line for next year. But as a CFO, I'm saying, \"Yes, but I want to have some hedge against this. And so I go back to Springboard is kind of our insurance policy. And I'd say Springboard is -- we're doing the right time for the business to exit this cycle as a stronger, better, leaner company, but it's also getting us with our insurance.\n\nAnd I just want to emphasize that I've been extremely tough on the team here with Springboard that, Eric, these Springboard savings, they're real. You will see them on our P&L. If you look at the $100 million that we took in Springboard 1.0 and you look at the '21 P&L to the '23 P&L, you'll find those. This isn't just some -- we're offsetting inflation kind of minimizing the rate of increase.\n\nThese are real reductions. At the same time, I'd say what we're committing to in the next $85 million, of which we're well along, but we still have work to do. Those are real savings. And so that, to me, takes a little bit of a hard edge off of if we're just slightly off on the top line because of this uncertainty, we've got some insurance against that.\n\nAnd that's why specifically not providing detailed guidance on sales margin, SG&A because we're going to manage down to EBITDA, and we're going to take out insurance. We're going to be able to offset some risks if they, in fact, do come.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nOK. Can you just square for me -- you talk about a conservative forecast. You talked about the consumer that's apprehensive. And then the guidance assumes, I think, seven points of pricing U.S.\n\nConsumer in '22 and another seven to nine in '23. It seems like the pricing assumption for an apprehensive consumer is optimistic. Tell me your perspective on that, if you would?\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nWhat do I think? I didn't know this question would come from you, but like I figured in the shower this morning, it would come from someone. And I can tell you, last night was a really great night for me. I got out of this place. I went and visited with the very senior members of one of our most important retail partners.\n\nThe apprehension, for sure, is there. And I think you can read it anywhere you want. But nobody knows the answer to that. We took pricing in last summer.\n\nI think that's our only tranche of pricing. I think you're saying when does it show up, products will be more expensive. But I think products are more expensive anywhere you go and that's really the issue, which is not just us. The problem with our pricing, Eric, is we've covered our dollars pretty well.\n\nIt has been pretty significantly dilutive after all this time on our margin rate. And for sure, products are more expensive, and they are with everything, a cup of coffee, a gallon of gasoline, a kilowatt hour of electricity, natural gas, I don't care what it is. That's the world we're living in. We didn't take enough pricing to cover our margin percent.\n\nAnd so should everybody be nervous about it, I guess. But that's really the world we're in, and we're not unique there. Does it involve some, I think, moderate risk? Yes, we're going to be promoting significantly harder going into next season. We are going to be promotionally levered with our retail partners.\n\nAnd so people will get value relative to sort of sticker price. Lots of things are happening that I think will sort of offset that. And I think we look at this and say, somebody buys a bag of fertilizer, and it's a couple of bucks more expense, is that enough to not do it? We did not see a shift to private label. And Dave is parting me a no -- just throw it out there.\n\nOh, eight to 10, which is during the last recessionary period, people were driven toward cheaper home improvement projects relative to cabinetry and appliances and all the other expensive projects people could do. So look, I think we have a reasonable history to look back of. I think we look at our products and say, when people buy something once or twice a year, does it -- and it's more expensive, is it enough not to buy it? I don't think we have history on that. But we're going to know sort of seven, eight months from now.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nFair enough. And then that's fair enough. I understand. The last just housekeeping for Dave.\n\nThe EBITDA growth, is that pretty consistent through the year in order to sustain the leverage ratio where you are now? Or is it more back-half loaded?\n\nDave Evans -- Interim Chief Financial Officer\n\nDo you mean the delta between operating income and EBITDA or --\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nI mean the -- I assume to sustain the six times leverage you're at now through the year, especially through the first half where leverage normally increases and currently it won't this year. The math, I think, suggests that the EBITDA growth quarter to quarter has to be consistent each quarter has to show some degree of EBITDA growth. Am I thinking it right or am I missing something?\n\nDave Evans -- Interim Chief Financial Officer\n\nEric, you're looking at it a way -- I'm not sure I can answer that live on this call here. I just -- I just haven't looked at it that way. I can just tell you that the EBITDA growth that we have built in our plan is today. I mean we're not presenting a plan that says we're going to be in default.\n\nI mean, representing a plant as we will be in compliance.\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nBut I also don't think we're saying it stays at six either. I think it stays within the 6.25, 6.5 limits that we have with our banking group.\n\nDave Evans -- Interim Chief Financial Officer\n\nYeah. That's exactly right. So look, it's going to hang north of six or around until we get to the third quarter of the season. And I'll just remind you that our leverage covenant goes up to 6.5 starting next quarter.\n\nSo we'll get a little bit more room here in Q2, it goes to 6.5. So that's the answer.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nOK. Thank you. Thank you.\n\nOperator\n\nOur next question comes from Chris Carey with Wells Fargo.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nHi. So just quick ones for me. The POS number that you put out there flat, is that a volume number? Or is that a value number? And then I can't quite tell. Are you basically saying POS flat and you'll see how inventories shake out, you can't really predict that? From a shipment standpoint, you can...\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nNow what we're seeing --\n\nDave Evans -- Interim Chief Financial Officer\n\nYeah, Chris. Let me try to answer that. If you're talking about '23, when Jim referred to in the script flat or plus 10 in ferts and seed, he's referring to POS and POS units. OK? So then -- and if you go back and kind of read my script, again, I was trying to kind of translate from POS units to our sales by then incorporating in assumptions regarding retailer inventory and pricing, the other elements of that.\n\nDoes that answer your question, Chris? [Inaudible] Operator?\n\nOperator\n\nExcuse me, Chris Carey. You may proceed.\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nHey, Chris. Are you still there?\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Kelly Berry for any closing remarks.\n\nKelly Berry -- Vice President, Investor Relations\n\nThanks, Precilla, and thanks, everyone, for joining us today. I know we didn't get to some of your questions. So please feel free to call me directly or email me in the coming days, and we'll get to you. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKelly Berry -- Vice President, Investor Relations\n\nJim Hagedorn -- Chairman and Chief Executive Officer\n\nDave Evans -- Interim Chief Financial Officer\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nMike Lukemire -- President and Chief Operating Officer\n\nJeff Zekauskas -- JPMorgan Chase and Company -- Analyst\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nMore SMG analysis\n\nAll earnings call transcripts"
}