{
  "companyName": "CarMax",
  "companyTicker": "KMX",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/29/carmax-kmx-q2-2023-earnings-call-transcript/",
  "content": "CarMax (KMX -0.60%)\nQ2 2023 Earnings Call\nSep 29, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day and welcome to the CarMax second quarter fiscal year 2023 earnings release conference call. Today's conference is being recorded. At this time, I would like to turn the conference over to David Lowenstein. Please go ahead.\n\nDavid Lowenstein -- Assistant Vice President, Investor Relations\n\nThank you, Samara. Good morning and thank you, everyone, for joining our fiscal 2023 second quarter earnings conference call. I'm here today with Bill Nash, our president and CEO; Enrique Mayor-Mora, our executive vice president and CFO; and Jon Daniels, our senior vice president, CarMax Auto Finance Operations. Let me remind you our statements today that are not statements of historical fact, including statements regarding the company's future business plans, prospects and financial performance, are forward-looking statements we make pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.\n\nThese statements are based on our current knowledge, expectations and assumptions and are subject to substantial risks and uncertainties that could cause actual results to differ materially from our expectations. In providing projections and other forward-looking statements, we disclaim any intent or obligation to update them. For additional information on important factors that could affect these expectations, please see our Form 8-K filed with the SEC this morning and our annual report on Form 10-K for the fiscal year ended February 28, 2022, previously filed with the SEC. Should you have any follow-up questions after the call, please feel free to contact our investor relations department at 8047470422 extension 7865.\n\nLastly, let me thank you in advance for asking only one question and getting back in the queue for more follow-ups. Bill?\n\nBill Nash -- President and Chief Executive Officer\n\nGreat. Thank you, David. Good morning, everyone, and thanks for joining us. Before I get started, I want to share that my thoughts are with our associates, their families and communities that are being impacted by Hurricane Ian.\n\nWe have a significant number of stores in the storm's path, and as always, the safety of our associates is our top priority. We've taken steps to support our associates and our communities, and we will continue to monitor the situation and take actions to provide assistance as needed. Now to our results. This quarter reflects widespread pressure the used car industry is facing.\n\nMacro factors, including vehicle affordability that stem from persistent and broad inflation, climbing interest rates and low consumer confidence, all led to a marketwide decline in used auto sales. In addition, wholesale values were affected by steep depreciation in the quarter. Despite the impact of these factors on our results, we continued to grow market share. We also continue to make progress on the key initiatives that will further strengthen our competitive differentiation over time.\n\nWe have weathered a number of difficult cycles in our history and each time, we have successfully managed through them and have leveraged key learnings to further strengthen our operating model. We remain on track to achieve our long-term strategy and goals. For the second quarter of FY '23, our diversified business model delivered total sales of $8.1 billion, up 2% compared with last year's second quarter, driven by growth in average selling prices, partially offset by lower retail and wholesale volume. In our retail business, total unit sales in the second quarter declined 6.4%, and used unit comps were down 8.3% versus the second quarter last year.\n\nOur performance was impacted by the macro factors that I mentioned previously. We believe industry sales were also impacted by a shift in consumer spending prioritization from large purchases to smaller discretionary items. In response to the current environment and consumer demand, we have continued to offer a higher mix of lower-priced vehicles. We began the second quarter with a low single-digit decline in comp sales during the June that reflected a continuation of softer although improving sales, which we discussed on our last earnings call.\n\nComps then fell sharply at the beginning of July with August ending in mid-teen declines. Last quarter, we reported market share data. We will do that again this quarter as the data provides additional context and highlights our performance relative to the industry. Based on external data, we continued to gain share through July, the latest period for which title data is available.\n\nWe reported second quarter retail gross profit per used unit of $22.82, up $97 per unit versus the prior year period, a reflection of our ability to manage used margin in any environment. We continue to focus on striking the right balance between covering cost increases, managing margin and passing along efficiencies to consumers to support vehicle affordability. Wholesale unit sales were down 15.1% versus the second quarter last year, partially as a result of our deliberate decision to reallocate some older vehicles from wholesale to retail to meet consumer demand for lower-priced vehicles. We estimate that without this shift, our wholesale units would have been down less than 10%.\n\nPerformance was also impacted by depreciation of about $2,500 and as we intentionally slow buys in reaction to rapidly changing market conditions. Wholesale gross profit per unit was $881, down from $1,005 a year ago and reflected softening market conditions, as well as our decision to retail a higher mix of older used vehicles. Our ability to source these vehicles from consumers is a competitive advantage. But relative to younger vehicles, more of them fall out during the reconditioning process as they are not able to meet our standards for consumer sales.\n\nWhen that happens, we wholesale those vehicles, often at lower-than-normal margins. In the third quarter, we have been focused on aligning our offers to current conditions and adjusting inventory to more efficiently incorporate older vehicles. Buying vehicles at appropriate prices per market conditions is one of our core competencies. We bought approximately 343,000 vehicles from consumers and dealers during the second quarter.\n\nWhile down 8% versus last year's period, this was up approximately 50% from the second quarter of FY '21 and reflects customers' responsiveness to both our nationwide online instant offer tool and our offers. We purchased approximately 323,000 cars from consumers in the quarter, down 11% versus last year's record results. We also sourced approximately 20,000 vehicles through Max offer, our digital appraisal product for dealers. This was up 130% versus last year's period and up 18% compared to this year's first quarter.\n\nOur self-sufficiency remained above 70% during the quarter. We remain focused on providing the most customer-centric experience in the industry with a leading e-commerce platform that integrates buying and selling cars with our best-in-class store experience. In regard to our second quarter online metrics, approximately 11% of retail unit sales were online, up from 9% in the prior year's quarter. Approximately 53% of retail unit sales were omni sales this quarter, down slightly from 55% in the prior year's quarter.\n\nOur wholesale auctions remain virtual. So 100% of wholesale sales, which represents 21% of total revenue, are considered online transactions. Total revenue resulting from online transactions was approximately 30%. This is up from 28% in last year's second quarter.\n\nCarMax Auto Finance or CAF delivered income of $183 million, down from $200 million during the same period last year. As a reminder, last year's quarter benefited from a reduced provision coming out of the pandemic. We will continue to provide strong credit offers to our customers as we move rates with the market. Jon will provide more detail on customer financing, the loan loss provision and CAF contributions in a few minutes.\n\nAt this point, I'd like to turn the call over to Enrique, who will provide more information on our second quarter financial performance, as well as the steps we are taking to further align our expenses to the current sales environment. Enrique?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nThanks, Bill, and good morning, everyone. Second quarter net earnings per diluted share was $0.79, down from $1.72 a year ago. Total gross profit was $737 million, down 9.6% from last year's second quarter. This decrease was driven primarily by wholesale vehicle margin of $141 million, which was down 26%.\n\nThe year-over-year decrease was driven by both lower volume and margin per unit. As Bill noted, we faced sharp depreciation throughout the quarter and have been adjusting accordingly to better position ourselves to manage through the current environment. Total used vehicle margin was down slightly at $495 million, a decrease of 2%. Total used unit volume of negative 6.4% was largely offset by higher margin per unit.\n\nOther gross profit was $102 million, down 15% from last year's second quarter. This decrease was driven primarily by the effect of lower retail unit sale on service. Service results declined $13 million as lower sales and secondarily, impacts from inflationary pressures drove a deleverage in results. EPP fell by 3% or $3 million, reflecting the combined effects of stronger margins, stable penetration at approximately 60% and the decline in retail unit sales.\n\nThird-party finance fees were flat over last year's second quarter as lower volumes in fee-generating Tier 2 were offset by lower Tier 3 volume for which we pay a fee. On the SG&A front, expenses for the second quarter increased to $666 million, up 16% from the prior year's quarter, reflecting a slowdown from the year-over-year increase during the first quarter. Approximately 3 points of the increase this quarter reflects a change in an accounting estimate in the prior year quarter. SG&A as a percent of gross profit deleveraged to 90.4% from 70.4% during the second quarter last year.\n\nA key contributor of deleverage was a 9.6% decrease in total gross margin dollars compared to last year's quarter. The increase in SG&A dollars over last year was mainly due to two factors. First, a $50 million increase in other overhead. The primary drivers of this increase include investments to advance our technology platforms, strategic and growth initiatives, a $14 million onetime impact from a prior year change in an accounting estimate related to non-GAAP uncollectible receivables, and a variety of other smaller cost headwinds.\n\nSecond, a $34 million increase in compensation and benefits excluding share-based compensation, primarily driven by the annualization of the strong growth in staffing we experienced in the back half of last year as well as wage pressures. Partially offsetting this increase was a $4 million decrease in share-based compensation. During our first quarter earnings call, we discussed how we have actively taken steps to better align our staffing expenses in our stores and Customer Experience Centers, or CECs, to the sales levels we were experiencing at the time. However, as Bill noted, sales declined sharply in the second quarter versus our expectations starting in July.\n\nAccordingly, during the second quarter, we pulled additional levers to further align our expenses to our sales levels. We expect these savings will materialize more fully in the coming quarters. This included further reducing staffing through attrition in our stores and CECs, pausing on a portion of the hiring and contractor utilization in our corporate offices, as well as better aligning marketing spend to sales. In regard to marketing, our intent is to continue to maintain a strong level of investment on a per-unit basis that is at least consistent with the full year FY '22 levels.\n\nFor the second quarter, total marketing dollars were flat year-over-year but reflected a robust investment on a per-unit basis. As part of our omnichannel journey, we have reduced the variable cost component of our operating structure. Given the macro environment, our near-term priority will be on allocating resources toward those initiatives that will further drive efficiency and effectiveness across our fixed costs. At the same time, we will continue to selectively invest in customer-facing initiatives that will enhance our omnichannel experience and support our long-term growth.\n\nFrom a capital structure perspective, we ended the quarter with an adjusted debt-to-capital ratio in the middle of our targeted range of 35% to 45%. During the second quarter, we repurchased approximately 1.7 million shares for $163 million. Now I'd like to turn the call over to Jon.\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nThanks, Enrique, and good morning, everyone. Once again, the CarMax Auto Finance business delivered solid results while transitioning from a lending environment that has seen historically low levels of credit loss and extremely favorable funding costs. During the second quarter, CAF's net loans originated was over $2.3 billion. CAF's penetration in the second quarter net of three-day payoffs was 41.2% compared with 43% last year and 39.3% in Q1.\n\nThe weighted average contract rate charged to new customers was 9.4%, which was higher than the 8.5% in last year's second quarter and the 9% seen in Q1. This rate increase, combined with the quarter-over-quarter increase in penetration, reflects CAF's ability to strategically pass along a portion of the added funding cost to consumers while still providing highly competitive offers. Our lending partners continue to complement each other in also providing attractive credit offers. Our Tier 2 penetration rate was consistent with last year at 21.6%, and Tier 3 accounted for 6% of used unit sales compared with 7.2% a year ago.\n\nAlthough the lower credit consumer continues to show demand by actively shopping and applying for credit, they continue to be challenged with affordability and being able to complete the purchase. CAF income for the quarter was $183 million, a decrease of 8.6% or $17 million from the same period last year. Last year, our loan loss provision of $35 million was a significant tailwind as the overall performance of the consumer remained remarkably strong. This quarter's $76 million provision results in an ending reserve balance of $478 million or 2.92% of managed receivables, up from 2.85% last quarter.\n\nThis 7 basis point adjustment is once again predominantly attributed to the proportionately higher quarterly volume of Tier 2 and Tier 3 loan originations compared to the preexisting $16 billion portfolio. Of note, as the macroeconomic conditions pose a challenge to the credit consumer, we remain confident in our ability to leverage our vast experience and robust credit platform to ensure our Tier 1 credit losses remain comfortably within our targeted operating range of 2% to 2.5%. As we've seen last quarter, our provision headwind was significantly offset by our total interest margin, which grew $31 million year over year. Our margin of 7.29% was up 11 basis points from last year's second quarter and was supported by a $9.4 million benefit from our hedging strategy.\n\nRegarding our industry-leading online finance experience, during the quarter, we significantly expanded our prequalification product launched in March. As a reminder, this unique multi-lender product results in no impact to your credit score and generates customized real-time credit decisions on our full inventory. As of the end of the second quarter, this product was available to over 50% of our consumers and is expected to go nationwide during the third quarter. Now I'll turn the call back over to Bill.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you, Jon. Thank you, Enrique. Given the realities of the macro environment, we will further sharpen our focus on driving additional operational efficiencies as we continue to navigate the near-term pressures facing the used car industry. At the same time, we will remain focused on continuing our work to achieve our long-term goals, including further improving our omnichannel experience for both our customers and associates, as well as growing our diversified business model.\n\nSome of our key initiatives include: first, we are leveraging data science, automation and AI to improve efficiency and effectiveness within our customer experience centers. During the second quarter, we expanded our associate-facing guided action software from chat to phone calls and developed additional work streams for our consumer-facing digital assistant. Over time, we anticipate these tools will enable us to reduce associate time spent per customer as we enhance our ability to provide live interactions at the highest-value moments. Second, as Jon mentioned, we continue to scale our industry-leading finance-based shopping experience.\n\nThis best-in-class prequalification product leverages a streamlined, simple application and generates multi-lender credit terms on cards within our retail inventory in just minutes. With this tool, customers have all the information they need to quickly understand APRs and monthly payments across different contract terms and effortlessly compare vehicles to ultimately secure the right financing options for them. Third, we are expanding MaxOffer to acquire vehicles and build on our market-leading position as a buyer of cars. As a reminder, buying directly from consumers and dealers lowers our acquisition costs, enhances our inventory selection and provides profitable incremental wholesale volume.\n\nWe are currently live in over 40 markets and anticipate launching additional markets later this year. Finally, we are upgrading our auction experience to be even more user-friendly. We're testing a modernized vehicle detail page to be mobile-friendly and efficiently display the most relevant information dealers need to preview our wholesale inventory, similar to how customers shop our retail inventory. We're also testing AI capabilities to enhance our online vehicle condition reporting.\n\nIn addition, we have rolled out self-service checkout capabilities nationwide. These tools will enable us to drive incremental operational efficiencies as we continue to scale our wholesale volume, all while providing an even better experience to our wholesale dealers. As I close, I want to reiterate that while the market conditions and consumer behaviors remain challenging, we believe that these pressures are transitory and that our foundation remains strong. We are well-positioned to navigate this environment as we have during challenging times in the past and remain excited about the future of our diversified business.\n\nWith that, we'll be happy to take your questions. Samara?\n\nOperator\n\nThank you. [Operator instructions] And we'll take our first question from Craig Kennison with Baird. Please go ahead.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nHi, good morning. Thanks for taking my question. I'm sure there will be several macro questions, but I'd like to ask about your sourcing tools. I'm a little surprised to see an 11% drop in vehicles sourced from consumers given the secular momentum you've had with your online instant appraisal tool.\n\nCan you shed a little more light on the traction you're seeing with that online instant appraisal tool and whether the slower pace is a function of slower traffic online? Or is it a decision to buy more selectively?\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. Good morning, Craig, thank you for the question. Look, I think it goes back to a couple of things. First of all, we're really excited about both our online offer tool and the MaxOffer that I talked about earlier.\n\nWhile we did see a decline, the environment -- I mean, I think the biggest factors of that decline, one, which I already highlighted, was the fact that we're moving which kind of changed the retail selectivity, taking some of those wholesale cars and putting them over in retail, which if you take that out, it would then mean our decline was less than 10%. Depreciation, you know, you followed us long enough. Any time we get a depreciating market, we're lowering our offers. That has an impact on what you ultimately end up buying from consumers.\n\nAnd I would say the third thing, which is a smaller than the other two, but we actually -- we slowed some of our buys in certain pockets, in certain geographic areas, in certain price points either because we didn't need the cars for just because of the dynamics of the changing -- the quickly changing environment. So I think those are the three factors that led to the decline.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nThank you.\n\nBill Nash -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nWe'll take our next question from Brian Nagel with Oppenheimer. Please go ahead.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi, good morning. Thanks for taking my question. So I wanted to focus on just the trend in the quarter with the used car unit sales. So Bill, you talked in your prepared comments about the market slowdown that began in July.\n\nSo my question there is, is there anything -- look, the macro pressures are very well documented out there, but is there anything you noticed in particular that could explain that slowdown. Do you see some variability geographically or across the product spectrum? And then as a quick follow-up within that question, any comments on how the business is tracking here into Q3 and September in particular?\n\nBill Nash -- President and Chief Executive Officer\n\nYeah, Brian. It's a great question. If you remember the last call, I talked a little bit about June and how we were feeling good about June because it was doing better than the first quarter. And as I said, we saw a big dropoff in July.\n\nAnd then that softness continued into August, where we ended up in a mid-teen decline for comps. And there's not one single thing that I can point to that we can say, oh, because of this happened in July is why we saw the dropoff. I mean there's lots of, I think, pressures out there. I talked about the broad inflationary pressures.\n\nObviously, consumers are having to make decisions. Groceries are higher than ever. I think we've seen more interest rates increases. Consumer confidence, certainly during the quarter, all-time low as far as recent history, I mean even lower than the height of the pandemic.\n\nSo I just think consumers are prioritizing their spend a little differently. But there's not one single thing that I can point to, like, oh, this happened, and that's why we saw the decline. I think it's just a continuation, kind of the deterioration of the overall consumer. Moving into September, we're seeing the same softness that we saw in August.\n\nAnd I would tell you even more recently, just given the hurricane, as you can imagine, that's contributing to additional softness as well. Now the thing with hurricanes or any weather events, you -- generally, we'll get that back later on. But as far as September goes, it will absolutely put pressure. We have about 20 -- see 22 stores are currently closed and have been closed for varying amounts of time.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nWe've also seen on the wholesale side and just from a depreciation standpoint just a continuation of that depreciating environment that we saw in the first quarter as well. So that has continued into September.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nGreat. Can I ask a follow-up? I'll make it quick, I apologize. But just -- so you're talking about the depreciation in the wholesale. I mean, should that lead then to more attractive prices in the used car business and potentially undermine what has been a significant challenge for consumers?\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. I think you're thinking about it the right way, Brian. In fact, I believe this is probably the first quarter where the gap between used and new got a little bit wider in, gosh, probably six or seven quarters. So it will take some time.\n\nBut I think depreciation and prices correcting on used will absolutely benefit the used market over time. But I think we got to keep in perspective, this quarter was challenging. I mean we haven't seen $2,500 in depreciation. That rivals -- in absolute dollars, that rivals back what we saw at the height of the Great Recession, that rivals what we saw at the peak of Omni.\n\nSo it's a very unusual thing and brings challenges, but I think that we've proven over time that we've been able to navigate those and that we'll do it better than pretty much anyone.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nI appreciate it. Thank you.\n\nBill Nash -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nAnd our next question comes from Sharon Zackfia with William Blair. Please go ahead.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nHi, good morning. So I've followed the company long enough to see you guys navigate a lot of different cycles. And congratulations on continuing to gain market share, although I'm sure it's small solace with the comp trends that you're seeing. I guess, historically, you haven't been a company that really has done layoffs materially, if at all.\n\nObviously, you slowed, it sounds like, staffing, acquisitions and open hires. But I'm curious, just given the retraction and profitability here where you've kind of erased, I think, seven years of profit in this quarter, I mean, how do we think about those initiatives Enrique that you talked about in terms of slowing SG&A spend? Because -- and there are certainly scenarios that I can get to where SG&A spend exceeds gross profit in the back half of the year and as we go into kind of the seasonally slower time. So help us think about kind of how much money you can take out right now, whether that's in SG&A as a percent of gross profit or SG&A dollar growth. Just any kind of barometer to be mark-to-market, where sales are, we have an idea of where that SG&A spend is kind of coming in?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYeah. Thanks for the question, Sharon. And our objective is on winning in the long term, and that really requires that we remain focused on making the right investments to continue to differentiate ourselves from our competitors. So we have an active and accretive portfolio of omni-related initiatives that we've been investing in, and we've been able to do that in large part because of our strong balance sheet and our performance.\n\nBut that being said, certainly, with the current macro environment, we have started to pull the levers I mentioned in my prepared remarks to better align our cost structure to the current environment. And we're also going to be tilting our resources more toward initiatives that drive efficiencies that I talked about and Bill talked about in our prepared remarks as well. So we'll be slowing some of the velocity down on our growth-related investments but certainly not pulling back. So I think we're doing the right things at the current moment in terms of better managing our costs.\n\nWe have a strong and active eye on the consumer, and we stand very experienced in managing through these cycles. But we also want to make sure that when the industry picks back up, that we're in a really strong position to capture the upside. So I think in terms of the balance of the year and how to look at SG&A, we do expect the levers that we pulled during the second quarter will start to manifest themselves more fully over the next few quarters. I think the other component, certainly in any kind of SG&A leverage, is purely just the gross profit, right, and where that stands to be in the fourth quarter and moving into next year.\n\nThat's another factor. What we can control certainly very strongly is the SG&A. So we feel good that we pulled the levers -- the appropriate levers for the time being.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. And Sharon, the only other thing I would add to that is that we're absolutely entering this from a position of strength. And to Enrique's point, there's lots of leverage. I mean just from the expense side, there's a lot of growth expense that we're continuing right now to prepare ourselves for the future.\n\nThere's these initiatives, there's advertising, there's variable spend. All of those we can still pull on, not to mention there's a whole host of other levers just for -- to preserve cash, if that's ever needed. So I think where we are at this point is, look, we pulled the levers. We know it's a challenging time.\n\nWe're coming at this from a position of strength. There's initiatives that we know that will help us both in the near term and the long term. Let's get them done. And so when this market turns, and it will turn, when it turns, we'll be able to take off because we've already done these things.\n\nBut we will keep absolutely an eye to the outside environment.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nCan I just ask a follow-up? Just given the mid-teens decline in comp trends we've seen, I guess, over the last three months, I mean, can you kind of mark-to-market for us what that is in terms of SG&A as a percent of gross profit? I mean, have you let it go over 100? Or is that a kind of mark where you would say, OK, now we have to pull back more?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYeah. No. I think like we've said, we pulled back on the levers that we can control right now. We think we're better aligned with the current environment.\n\nYou're going to see those savings manifest themselves kind of moving forward. We did pull those longer levers kind of halfway through the second quarter, so you don't fully see it in this quarter's P&L. But moving forward, we should start to see more of those savings.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. And I think, Sharon, the way to think about it is, look, we had in absolute dollars an improvement in SG&A from the first to second, as Enrique talked about. We would expect these dollars to manifest more. You'll see a reduction there.\n\nThe other wildcard in the equation that was just gross profit dollars, and that's going to be driven by the macro factors, as Enrique talked about.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nThank you for that.\n\nBill Nash -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nWe'll take our next question from Michael Montani with Evercore. Please go ahead.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nHi there. Thanks for taking the question. So the first question I have is just around the wholesale side if we should assume kind of similar trends in terms of volume and GPU pressure to start the third quarter on wholesale given the challenging macro.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah, Michael. Good morning. So in previous calls, I've talked about -- because I've gotten asked questions about retail margin and wholesale margin. And what I've said in previous quarters is all else being equal, we feel pretty good about keeping strong retail margins.\n\nWholesale would be coming under pressure. And if we're going to enter into a depreciating environment, that's going to cause the pressure like I talked about before. The other reason I mentioned that it could come under pressure is just because of that retail selectivity and because we're moving some cars -- older cars over to retail and then the corresponding what we call kicks. You say, OK, let's retail this car, you go build it.\n\nOr you start to build and realize, OK, we can't get this to the standards. We then move that back to wholesale, and we generally perform worse on those than the normal wholesale. So we knew there was going to be some pressure. I think if you look at recent performance, let's call it -- certainly, last year, I think every quarter last year, on a GPU standpoint for wholesale was over $1,000.\n\nAnd then you look at the year before that, I think we had another quarter that was over $1,000. If you look at that and then compare it to the five years prior to that, they were probably equal or more quarters in the last year than we had in the last five years over $1,000. And that's because of the massive appreciation that we saw last year. So I think the way to think about it going forward is probably more in line with what you would normally see the average wholesale that we make in any given quarter over a three-, four-, five-year period.\n\nI think that's the way to think about it, especially in this depreciating environment, especially as we continue to push more or try to push some more of these older vehicles over just from an affordability standpoint.\n\nOperator\n\nAnd we'll take our next question from Adam Jonas with Morgan Stanley. Please go ahead.\n\nAdam Jonas -- Morgan Stanley -- Analyst\n\nHey Bill, I'm sure your team is following the proposed rulemaking from the FTC, the motor vehicle dealers trade regulation rule that's now collecting comments. And it aimed to increase transparency on pricing and advertising and some downstream stuff like aftermarket add-on. So if this rulemaking is approved, I know there's going to be a lot of puts and takes. Have you guys done any preliminary work on what impact this might have on CarMax in terms of compliance costs or SG&A expense or any potential revenue impacts? Thanks.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. Adam, it's a great question. Obviously, we commented during the comment period as many folks did just because the requirements in some cases are a little onerous. We started to look at it, obviously, whatever ultimately gets decided, we will make sure that we do follow.\n\nBut we haven't put -- or we aren't prepared at this point to really talk about additional expenses or anything. Because again, to your point, it's so much up in the air and there's so much discussion and debate about it. There's a lot that's really unknown.\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nOne thing I will add, though, I mean, to your point, the verbiage you used, that transparency and clarity around pricing, add-on products, etc., I think our business model sets us up perfectly for that. We already are very transparent, honest online. We can show our EPP products online the pricing there. So I think we're in a great position to do that.\n\nAnd obviously, we'll do whatever is required.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. And I think the more the bigger complications for us and I think really needs to be looked at as some of the requirements on signing paperwork, physical signatures, managers, that kind of thing. Well, everybody is operating in a world of online. So again, it will be interesting to see how it pans out.\n\nOperator\n\nWe'll take our next question from John Murphy with Bank of America. Please go ahead.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning, guys. I just wanted to ask a question on pricing. I mean the year-over-year comparisons are always relevant.\n\nBut sequentially, as things are changing here, they might be more relevant than typically. When you look at the retail price, yours was down about 2% sequentially quarter-over-quarter, but wholesale was down 7%. I mean -- and you talked about doing sort of more older vehicles in that -- in the retail side. So I mean that 2% is absorbing even lower-priced vehicles.\n\nSo the gap actually may be even larger between those two. Bill, what are you seeing in the market where retail pricing, we're hearing this from a lot of other folks, is holding up a fair amount better than wholesale pricing? I mean, do you think that the market is sort of anticipating and dealers are anticipating some kind of weakness or looking to maintain grosses? It just seems like there's -- things are softening but a lot more on the wholesale than they are on the retail side.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. John, I think some of it has to do with timing. I mean if you think about it, although there was depreciation in the quarter and although, as you pointed out, we have an older vehicle mix, both of those bring down your overall retail prices. But it wasn't enough to offset when comparing to like a year ago.\n\nSo if you think about it, we ended last year with an appreciation of about $7,500. We've only experienced about $2,500 in depreciation. So that dynamic will become less and less as we get later into the year. But you're still -- there just wasn't enough to offset that overall appreciation, which is why you still see us above last year.\n\nI think the other thing that you got to think about is a lot of the cars that were sold in the second quarter were bought -- actually, a majority of them were bought prior to the quarter even starting. So they're at a higher price. So I think there's some -- there's definitely some timing there. On the wholesale side, obviously, if you're moving some of the nicer, more expensive stuff into retail, that's going to impact your wholesale a little bit more.\n\nAnd so I think that's the dynamic that you have going on there.\n\nOperator\n\nWe'll take our next question from Chris Bottiglieri with BNP Paribas. Please go ahead.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nHey guys, thanks for taking the question. I'm still a little lost on kind of how these hedges affect profitability. I don't know if you quantified it this quarter. And then, two, just like given -- like bigger-picture question, trying to think the impact over the next couple of years.\n\nLike given the decline in used volumes, the tightening in the securitization market and spreads and kind of defaults picking up a bit. Can you just kind of maybe refresh us on how the fluctuations in these areas impact loan originations, net margins so we can better model the cadence of CAF going forward?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nMaybe I'll jump in first on the hedge. Very similar dynamics to what we saw in the first quarter, right? So the vast majority of our receivables are funded through the ABS market, as we know. We have accounting hedges on those. However, we do have alternative financing vehicles with our banking partners -- our long-standing banking partners.\n\nAnd a portion of those receivables have a cash flow hedge but not an accounting hedge, and that's really due to our desire to maintain flexibility in our funding profile. So those receivables are going to get mark-to-market every quarter like they did last quarter. And really, where you see a change or a benefit or a potential hit is when there are sharp and material rises or decreases in interest rates. And that's exactly what happened again this quarter.\n\nSo we would only expect this again to be material for CAF during periods of material changes. And it's very similar to the first quarter. We saw sharp changes in movements in the interest rates, and that's what happened. So -- and it was $9 million, the same amount from the first quarter.\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nGreat. And I'll touch on your other question, Chris, and correct me if I don't cover everything you asked. But with regard to just overall interest margin, obviously, rising cost of funds that we've said -- I think we signaled last quarter, you could begin to see a change in our net interest margin. Maybe it's hit a peak.\n\nIt could come down. And again, that's where our accounting -- the way that we do our accounting benefits us. Obviously, as the margin increases over time, that higher-margin receivable continues to hang around for longer. But obviously, our margins have tightened.\n\nHad the hedge not been in there, we probably would have seen a downturn this quarter, and we're obviously going to be in a tighter environment. So we will maybe continue to see that come down. We're obviously on our side continuing to manage margins very carefully through our pricing. So we'll do what we can but still remain competitive for our customers.\n\nSo again, I think there will be pressure on our net interest margin going forward. But again, we'll manage that as well as we can.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nGotcha. Thank you very much.\n\nOperator\n\nWe'll take our next question from Rajat Gupta with J.P. Morgan. Please go ahead.\n\nRajat Gupta -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for taking the question. Maybe just a couple of quick ones here. First, on retail GPU, Bill, if I heard you correctly, you mentioned that you believe you could still maintain the current retail GPU level in the current pricing environment in the next few quarters.\n\nDid I hear that correctly? I just want to clarify that, and I have a follow-up. Thanks.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. So Rajat, when I was speaking that I was talking about earlier. Although I do feel good about being able to maintain strong retail margins, but I always will caveat that with, depending on a lot of different things, sales elasticity, what competitors are doing, inventory levels, our own inventory levels. So there's a lot that goes into it.\n\nBut we really are still realizing some nice benefits from -- although we've lapped self-sufficiency, we still feel like there's a little bit there. But then the fact that we are selling these older vehicles gives us a little bit more margin. And this quarter, we were able to pass along some of it to the consumers in the form of offsetting some of the inflationary pressures, as well as take a little bit more. So again, we feel good about our retail margins than where they are today, and we'll just continue to watch some of the more other external factors as we go forward.\n\nRajat Gupta -- JPMorgan Chase and Company -- Analyst\n\nGot it. And maybe just to follow-up on Enrique's comments around advertising. It looks like you want to still maintain a healthy advertising spend per unit. But I'm just curious, like in terms of like the focus of the company right now, is it more to make sure we're able to continue to gain market share? Or is it more around managing overall profitability with maybe higher interest rates or maybe lack of pricing discounts? Just as curious as to like what's really the strategy in the near term.\n\nIs it -- is there one for the other? Or you think you could get both at the same time in terms of volume and profitability? Thanks.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. So I'll answer and then I'll let -- I'll just give you some thoughts, and if Enrique has any more. But as far as advertising goes, as Enrique said, look, we still are -- we're really excited about this industry and where the industry is going. Granted, we've got some challenging things right now.\n\nBut we still want to continue to invest in advertising. We're going to do it. We kind of think about it on a per-unit level. So ultimately, advertising as a whole will come down if the sales are down.\n\nBut we feel like continuing to invest in the business. Now obviously, you may change where you spend it. For this quarter, the majority of it was awareness. And from an acquisition standpoint, it was more customers versus buying vehicles.\n\nBut it's also one that we can continue to monitor. Everything we do from an advertising standpoint, we measure ROI. And so we have certain targets that we're going to have -- if we see things that aren't panning out, we'll certainly pull back or pivot to something else that is. So Enrique, you have any thoughts on that?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYeah. What I would say is compared to a few years ago, the marketing team overall has done a tremendous job of really giving us a line of sight into profitability and the dollars we're investing in, how that then translates to an ROI. So we feel really good about the investments we've been making over the past couple of years. If you compare ourselves to two years ago, I think we've increased the dollars per unit by over 50%, right? And that's because we feel really good about our ability to get visibility.\n\nSo I think we can continue to drive awareness, and at the same time, drive that profitability. So we had, I think we can get the best of both worlds.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. I think the other thing that's important to remember, too, Rajat, is we had a lot of great things going on. I'll give you an example. The prequalification that both Jon and I talked about, we haven't even marketed that yet.\n\nAnd so that's an area for opportunity. So again, as we think about advertising, it really allows us to kind of say, OK, what do we want to highlight? Do we want to highlight online offers? Do we want to highlight the omni experience? Do we want to highlight being able to buy online? Do we want to highlight prequalification? There's lots of things. So we're constantly moving it around. So again, that's kind of how we're thinking about it.\n\nRajat Gupta -- JPMorgan Chase and Company -- Analyst\n\nMaybe just on the cash base, are you still able to -- do you feel comfortable being able to continue to pass on interest rate increases to the consumer? Or is that also going to be more thoughtful based on just more competitive lenders out there?\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nYeah. Rajat, I appreciate the question. Yeah, as I said in my prepared remarks, I was extremely pleased with the penetration we had. It did show that we were able to pass along some of the increases on to our customers yet still manage the elasticity, capture the volume that we could.\n\nAgain, three things we're trying to manage here is stay highly competitive for our consumers from our offer standpoint, manage that margin and then make sure that we can capture the right amount of sales. And it's a delicate balance, but I think we've done a great job, and I think we'll continue to do that.\n\nOperator\n\nAnd we'll take our next question from Seth Basham with Wedbush Securities. Please go ahead.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot. My first question is on CAF and just thinking about your loan loss reserves and where you're at right now. What does that imply for what you're reserving, what your allowance rate is for your core Tier 1 securitized managed receivables?\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nYeah. So right now, we are comfortably set within the 2% to 2.5% range. The increase that you saw, as I mentioned, is predominantly coming from that Tier 2 and Tier 3 volume. That's a larger percentage in the new originations than it is in the portfolio.\n\nSo we feel real good about staying in that targeted range, and that's reflected in the reserve.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. So you haven't really taken up your allowance rate for those receivables despite the fact that we've seen collateral values come in sharply and the macro environment deteriorate. How should we think about dynamics there and the potential for higher loan losses for those core receivables?\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nYeah. We modeled that pretty extensively. And we felt like, again, assuming there isn't just an absolute plummeting of the values, you've got people that are buying vehicles on our books that bought it five years ago, three years ago. So there's a -- obviously, it's been a slow ramp up, and hopefully, it's a slow ramp down.\n\nBut modeling that, it really was relatively immaterial in a $477 million reserve. So we feel we are well reserved. We can absolutely absorb that in what we have today. So we've considered it, but we think we've got the right reserve as it sits today.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nWe'll take our next question from Joe Enderlin with Stephens. Please go ahead.\n\nJoe Enderlin -- Stephens, Inc. -- Analyst\n\nHey guys, thanks for taking our question. So a question for the older vehicle mix. As the vehicle spot normalizes, could you see these older vehicles remain part of the mix to support higher GPUs than historical levels? Or how are you thinking about that moving forward?\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. No, it's a great question. It's -- the great thing about that is we -- now that we have so much more of that inventory available, we can put out whatever the customer wants. So as we go forward and maybe get to a more normalized area or period.\n\nIf consumers are looking for this, we can -- we now have a source to make sure that we put it out there. So I think this also will benefit us. If you think about the fact that new cars right now, there aren't as many being sold. There'll have to be something that fills that gap.\n\nThis is a great -- I think this will be a great tool to do that. So again, we'll put out there whatever the consumers want.\n\nJoe Enderlin -- Stephens, Inc. -- Analyst\n\nGot it. Thank you, guys.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] And we'll take our next question from David Whiston with Morningstar. Please go ahead.\n\nDavid Whiston -- Morningstar -- Analyst\n\nThanks. Good morning. Buyback spending was roughly flat from Q1. Stock's obviously a lot cheaper now, but of course, there's macroeconomic pressures, which can make one want to conserve cash.\n\nIt's that delicate balance. But do you anticipate being able to be at least flat in second half versus first half? Are you going to pull back on buybacks or be even more aggressive?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nHey, David, thanks for the question. And as you pointed out, in the second quarter, we are on the same pace as we were in the first quarter, so continue to buy back our shares. What I'd tell you is that our capital allocation philosophy remains, first and foremost, our cash goes into growing the core business, so that's our retail business, that's our wholesale business, it's our CAF business, and making sure those are in a position to continue to grow. From there, we also look for growth opportunities, investments that we make, and then we return capital back to shareholders.\n\nSo our philosophy has remained the same.\n\nDavid Whiston -- Morningstar -- Analyst\n\nOK. And just on your SG&A control, I just want to make sure I understand the comment you made earlier on staffing. Are you doing any replacement hiring if someone does leave voluntarily?\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. So we absolutely -- we don't have a pause on hiring at this point. We are very strategic. We have a prioritization of hiring.\n\nSo as folks leave in the positions -- critical positions, we absolutely will replace them. But at the same time, if you have a vacancy, you want to make sure, OK, is this something that's supporting our near-term initiatives, that kind of thing. But while we've prioritized, we have not paused overall hiring.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYeah. And just to be clear, that managing headcount is also done through attrition as well, right? It's how we've been managing that. So we'll see those benefits again more sharply as we progress into the future quarters.\n\nDavid Whiston -- Morningstar -- Analyst\n\nOK. Thank you.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd it appears there are no further questions at this time. I'd like to turn the conference back to Bill Nash for any additional or closing remarks.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you. As always, I want to thank our associates for everything they do, how they take care of each other and the customers and the communities. Again, my thoughts are definitely with those being impacted by the hurricane. Please, please stay safe.\n\nThank you all for joining the call, and we'll talk again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid Lowenstein -- Assistant Vice President, Investor Relations\n\nBill Nash -- President and Chief Executive Officer\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nMichael Montani -- Evercore ISI -- Analyst\n\nAdam Jonas -- Morgan Stanley -- Analyst\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nRajat Gupta -- JPMorgan Chase and Company -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nJoe Enderlin -- Stephens, Inc. -- Analyst\n\nDavid Whiston -- Morningstar -- Analyst\n\nMore KMX analysis\n\nAll earnings call transcripts"
}