{
  "companyName": "Aveanna Healthcare Holdings Inc.",
  "companyTicker": "AVAH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/aveanna-healthcare-holdings-inc-avah-q2-2022-earni/",
  "content": "Aveanna Healthcare Holdings Inc. (AVAH 15.45%)\nQ2 2022 Earnings Call\nAug 11, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to Aveanna Healthcare Holdings second quarter 2022 earnings conference call. Today's call is being recorded, and we have allocated one hour for prepared remarks and Q&A. At this time, I'd like to turn the call over to Shannon Drake, Aveanna's chief legal officer and corporate secretary. Thank you.\n\nYou may now begin.\n\nShannon Drake -- Investor Relations\n\nThank you, operator. Good morning, everyone, and thank you for joining us today. Speaking on today's call are Rod Windley, Aveanna's executive chairman; Tony Strange, Aveanna's chief executive officer and president; David Afshar, Aveanna's chief financial officer; and Jeff Shaner, Aveanna's chief operating officer. We issued our earnings press release and filed our 10-Q yesterday.\n\nThese documents are available on the Investor Relations section of our website at www.aveanna.com as well as on the SEC's website at www.sec.gov. A replay of this call will be available until August 18, 2022. We want to remind anyone who may be listening to a replay of this call that all statements made are as of today, August 11, 2022. Today's call may contain forward-looking statements, which may be identified by the use of words such as may, could, expect, plan and other similar words and expressions.\n\nAll forward-looking statements made today are based on management's current beliefs and assumptions about our business and the environment in which we operate. These statements are subject to risks and uncertainties that could cause our actual results to materially differ from those expressed or implied on today's call. Except as required by federal securities laws, Aveanna will not publicly update or revise any forward-looking statements subsequent to the date made as a result of new information, future events or changes in circumstances. Also, we supplement our financial results reported in accordance with GAAP and with certain non-GAAP financial measures.\n\nA reconciliation of any non-GAAP measure mentioned during our call to the most comparable GAAP measure is available in our earnings press release and Form 10-Q, both of which are available on our website and the SEC's website or as otherwise available separately on our website. Following today's prepared remarks, we will open the call to questions. Please limit your initial comments to one question and one follow-up so that we can accommodate as many callers as possible in the allotted time. With that, I'll turn the call over to Aveanna's chief executive officer, Tony Strange.\n\nTony?\n\nTony Strange -- Chief Executive Officer and President\n\nThanks, Shannon. Good morning, and thank you for joining Aveanna's second quarter 2022 earnings call. Before we begin our call, I'd like to say thank you to the 35,000 Aveannic caregivers and employees who continue to provide exceptional service to the 87,000 patients under the company's care. These are unprecedented times, and it is only through your commitment to our families that we're able to meet the needs of the patients that we serve.\n\nMoving on to the quarter. On July 19, 2022, we issued a press release to preannounce results for the second quarter and reduce our guidance for the full year, primarily driven by the COVID-induced disruption in the labor markets, further exacerbated by record high inflation. Our results for the quarter are in line with those lowered expectations set forth in the July release. But before we get into those results, I'd like to spend a few minutes on the overall environment by providing some insight into ongoing pressures in the labor market as well as positive momentum in reimbursement.\n\nThe labor market related to our business continues to be challenging across all of our business segments, but particularly challenging in our private duty segment. While we don't break down private duty between skilled nursing services and unskilled personal care, the labor disruption is quite different. Approximately 60% of our PDS revenues are derived through skilled nursing services requiring one nurse, primarily LPNs, at one patient's bedside for 10- to 12-hour shifts. These skilled nursing -- the skilled nursing business is where we're experiencing the greatest disruption in available caregivers.\n\nHistorically, these nurses have been willing to work for hourly wages that might be slightly below where skilled nursing facilities and other healthcare providers could pay due to the desirability to take care of one patient at a time in the comfort of the patient's home. However, during the second quarter, we've seen a significant shift in this dynamic driven by two factors: one, inflation has driven our workforce to seek employment that can and will pay higher wages; and two, more and more healthcare providers are willing to hire LPNs in this environment to replace or avoid paying higher rates for travel and temporary agency RNs. Given that our reimbursement is fixed, we do not have the ability to raise wages without a corresponding increase in payment rate. On a positive note, while labor shortage exists everywhere, the challenges on the unskilled business are materially less difficult than those in the skilled care.\n\nAs a result, our unskilled business continues to generate positive volume growth and continues to play an increasing role in the delivery of home and community-based care. Our home health and hospice business is also dependent on the ability to hire RNs and LPNs. And while we have similar constraints related to the competitive environment, we have greater flexibility to increase wages given the variable reimbursement models. The significant shortage of nurses in the U.S.\n\nwill continue for the foreseeable future. Nursing schools are operating at capacity and the time line that it will take to increase that capacity will necessitate looking elsewhere to increase nursing capacity in the U.S. We're encouraging the current administration to reverse some of the immigration orders put into place by previous administrations that had the unintended consequence of making it more difficult for nurses from other countries to come to the U.S. for employment.\n\nIn the meantime, our most effective lever is to push reimbursement rates to allow us to pay higher wages, which brings me to our next topic, the reimbursement environment. As we mentioned in our press release in July, we continue to have positive momentum regarding rate increases with our Medicaid and Medicaid managed care payers. As is public information, the State of Virginia increased Medicaid reimbursement for private duty services by approximately 70% effective July 1 of this year in an effort to expedite the discharge of medically fragile children from hospitals and to avoid costly readmissions. And while Virginia is not a particularly large state for us, we passed a meaningful portion of this rate increase into wages of existing and new caregivers and are experiencing positive growth in the state with Medicaid recipients, which is exactly the outcome that the state intended.\n\nIn another of our larger states, effective July 1, we implemented a rate increase of approximately 50%. Roughly half of the increase will be on an hourly basis as rate. The other half of the increase is tied to value-based pricing agreement. The agreement is based on two quality metrics: staffing goals and a measure for unplanned hospitalizations, both of which are largely in our control.\n\nThis value-based contract provides us with flexibility to be more competitive with wages while protecting gross margins. In this one example, we immediately passed through significant wage increases and are seeing early signs of growth within this payer around 5% to 7% pre and post the increase. I provide these two examples as evidence that significant changes in rate can drive volume. We are firm believers that Aveanna can add value to payers, we have the data, the skill and the willingness to accept risk in value-based pricing agreements.\n\nWe currently have five of these types of agreements in place and expect this trend to continue. I'd like to thank our government and payer relations team. Mike Young and the entire team have done an outstanding job driving change not only through rate increases, but by creating upside through value-based pricing. On the other side of the equation, we were not successful in getting a rate increase passed in California.\n\nThe industry put forth a compelling argument and had support from the state's children's hospitals. However, in the final hours prior to finalizing the budget, the private duty rate increase was removed. We will mount an all-out effort and press for meaningful rate relief during the spring legislative session in 2023. And with continued support from the children's hospitals across the state and ongoing pressure to get patients out of higher-cost settings, we're confident that we can lead a successful effort.\n\nWe're also continuing to receive interest from states who are exploring alternative caregiver models, such as Colorado and Arizona, whereby we are allowed to pay parents and/or their designee to provide certain levels of care to those patients. We fully support these programs and have seen firsthand in Colorado and Arizona that they can be effective in getting patients home and avoiding rehospitalizations in a very efficient manner. We expect to see other states continue to follow in their footsteps. Turning to the Medicare environment.\n\nThe final rule for hospice was published two weeks ago, and it was about 110 basis points better than anticipated. The industry pushed back on the proposed rules citing that relying on cost report data from 2019 did not adequately account for the current rate of inflation. The industry still contends that the 3.8% increase is still not sufficient given the higher cost. However, I believe that CMS did understand that there was validity to the argument and adjusted the final rule accordingly.\n\nThe home health proposed rule currently provides for a net reduction to reimbursement of 4.2%. Given the struggle to staff patients at current reimbursement rates, we find it difficult to imagine in any scenario where rates are lowered for the industry to meet the needs of the fastest-growing and most vulnerable segment of the population in the U.S. The industry is making the same arguments made during the hospice rulemaking process, and we expect to get clarity on the final rule at some point in September. The hospice rule will be accretive to our results in 2022.\n\nHowever, the net of the hospice final rule and the proposed home health rule would result in a reduction of approximately $7 million to $8 million on an annualized basis beginning in '23 if the rule was implemented as proposed. The demand for home and community-based care has never been higher. Rod and I have been in this business for almost 35 years, and for the first time, we have payers, both state governments and managed care organizations, reaching out and asking what can be done to create more capacity. We've been -- we have a waiting list for new admissions in every branch.\n\nWe have several examples of how value-based contracts can provide benefits to both payer and provider. But with all that said, we're still in a firefight today. I do believe that home and community-based care will solidify its role as a value-added provider in the healthcare continuum. Aveanna is a comprehensive platform with a diverse payer base.\n\nWe provide a cost-effective alternative to higher cost care. We provide this care in the most desirable setting, the comfort of the patient's home. We believe that we are a long-term solution in the face of rising healthcare costs. And for this reason, I believe that current home care valuations driven by these transitory disruptions create an excellent opportunity to create value for all investors.\n\nSo let's turn to our results. As I mentioned earlier, our results for Q2 were in line with the expectations that we laid out in July. Revenues for the quarter were $443 million and adjusted EBITDA was $37 million or 8.3% of revenue. The key takeaways from the quarter are volume, volume and volume.\n\nAs discussed, we need to increase caregiver wages on average 15% to 25% in certain markets that we serve. We will systematically go through state by state and contract by contract and adjust reimbursement rates in such a way that will allow us to be competitive on wage. In the meantime, gross margins continued to be stable at 32.7% for the quarter, which is up from Q1 of 2022 and the full year of 2021. Jeff will provide further granularity on our segment results in his remarks.\n\nFrom a liquidity standpoint, we have placed hedges on all of our debt in one form or another to protect the company against the rising interest rates. We expect cash flow to be negative for the year driven by lower EBITDA expectations as well as approximately $40 million of onetime cash uses. Even on lower volumes, we see our way to positive cash flow and have sufficient liquidity to get us there between our delayed draw term loan and mostly undrawn revolver. Dave will provide further detail around our cash flow and leverage in just a moment.\n\nIn summary, while we do not like being in a position where we're forced to chase rate, we fully understand that in the short run, it is the most immediate solution. In the meantime, we will adjust costs where appropriate, protect our gross margins and manage our cash flows. I am confident in our team to make the necessary adjustments to navigate this difficult environment. And as I said before, home care is a solution, and those that have the perseverance to weather this storm will be rewarded.\n\nWith that, I'll turn the call over to Jeff.\n\nJeff Shaner -- Chief Operating Officer\n\nThank you, Tony. I am proud of the resilience of our Aveanna operating teams in the face of continued turbulent labor markets and the highest inflation experienced in over three decades. Our Aveanna leaders remain focused on the task at hand, bringing medically fragile pediatric and geriatric patients home and staffing their cases with highly skilled caregivers. As Tony mentioned, we are actively shifting caregiver capacity to those preferred payers that value our services and are willing to pay us premium rates for preferred staffing and reduced unplanned hospitalizations.\n\nMore to come on that front as I detail each of the three business segments. Now let's move into our Q2 operating indicators, starting with our private duty segment. We produced $348 million of revenue during the quarter. Revenue was driven by approximately 9.6 million hours of care, which was flat from Q1.\n\nPDS volumes continued to be constrained by the turbulent labor markets, primarily driven by the shortage of RNs and LPNs. We saw improvement in our unskilled workers and family caregiver employment trends during the quarter, but that was offset by the continued disruption to core nursing trends. Our Q2 revenue per hour of $36.24 was up $0.99 from Q2 of 2021 or 2.7%. We continue to experience significant rate improvements in 2022, and I'm proud to say we've achieved 20 PDS rate increases year to date.\n\nThese rate wins include state Medicaid PDS rates as well as Medicaid managed care organizations specific Aveanna rate increases. As most of our state legislatures have completed their 2022 legislative sessions, we have now turned our focus to the 2023 legislative process for future rate improvements and program expansion opportunities. We have a full slate of 2023 legislative and managed care organization preferred payer initiatives to execute on. I look forward to engaging states like California to help solve overcrowded children's hospitals and relieve exhausted families who are struggling to care for their medically fragile child at home.\n\nWe have numerous examples of how increased reimbursement rates have a positive impact on nurse staffing levels and reduced hospitalizations. In the end, higher private duty services reimbursement rates are the primary answer to employing more nurses and bringing more patients home. We also have an update on the Arizona Medicaid system and its Licensed Health Aide, LHA, program expansion that we highlighted recently. As you remember, this important program supports family caregivers with appropriate compensation for the unskilled care being provided to a loved one.\n\nThe LHA program is in addition to the skilled nursing care being provided by Aveanna nurse. I am proud to report that we admitted our first Arizona LHA family in July and have over a dozen families currently being credentialed. I expect this important program to continue to expand across many other states, including Washington State that has endorsed a similar family caregiver program. Washington State has stated their goal to begin this program by the end of this year.\n\nTurning to our cost of labor and gross margin metrics. We achieved $101.4 million of gross margin or 29.1%. Our wage rate of $25.68 per hour reflects the commitment we've made to passing through our rate wins to our caregivers. Our Q2 spread per hour was $10.56, in line with our expectations.\n\nWe experienced numerous private duty service rate wins effective July 1 and will continue to actively pass through these increases in the form of additional wages and benefits to our caregivers. Now moving on to our home health and hospice segment for Q2, where the impact of high inflation and increased caregiver wages, mileage applied pressure on our gross margins. We stand firm with the National Association for Home Care and Hospice and our industry peers and our fight against the 2023 proposed home health rate cuts. This is the wrong time to be cutting reimbursement to the most effective, highest quality and patient preferred healthcare setting.\n\nAs previously announced, we have completed our transition to the home-care home-base operating system and now have all 96 home health and hospice locations operating on the home-care home-base model. We are actively implementing the metalogics analytics tools to ensure that we are improving quality outcomes while balancing the need for effective cost controls. During the quarter, we produced $61.4 million in revenue, a 22.6% increase over the prior period. The biggest driver of revenue growth was the impact of the Comfort Care acquisition, offset by continued labor pressures.\n\nQ2 revenue was driven by 12,400 total admissions, approximately 62% being episodic and 12,300 total episodes of care. While volume was down from Q1, having the system transition now behind us, allows our home health and hospice leaders to fully focus on growth. To support this growth effort, we added sales leadership and sales resources in core Southeastern markets. We are committed to being a growth-oriented geriatric provider and look to getting back to mid-single-digit organic growth rates in the back half of this year.\n\nRevenue per episode for the quarter was $3,004, up 3.7% from Q1. This increase was driven by better episodic management and demonstrates the value of being fully transitioned to home-care home-base. From a cost and margin perspective, Q2 gross margins were 48.2%. Gross margin in the quarter was impacted by higher wages and mileage driven by the current inflationary trends.\n\nHome health visits per episode and cost per visit are generally in line with our expectations and gives us confidence that we can manage the home health and hospice segment gross margins in the 48% to 50% range. Now moving on to our Aveanna medical solutions segment results for Q2. During the quarter, we produced $33.5 million of revenue. Revenue was driven by approximately 78,000 unique patients served and revenue per UPS of $430.10.\n\nWhile volume and rate were consistent with Q1, I am proud of our medical solutions team as they continued to fight through unprecedented supply chain disruption driven by the previously announced Abbott recall. Aveanna has emerged from this event as the leading national provider of interim nutrition for clinically complex patients. Once the enteral supply chain returns to a more normal environment, our medical solutions business is well positioned for accelerated organic growth trends. Turning to our cost of goods and gross margin metrics.\n\nWe achieved $14.1 million in gross margin dollars or 41.9%. Gross margins have stabilized in the 41% to 43% range. We continue to evaluate ways to be more efficient and effective in our back office to leverage our overhead as we continue to grow. While other enteral providers decided to exit the market, we see this opportunity to expand our national enteral presence and to further our payer partnerships.\n\nLong term, we remain confident in the value proposition our medical solutions business generates for patients, payers and referral sources. In summary, we continue to fight through a difficult labor and supply chain environment while keeping our patients care at the center of everything we do. We will continue to pass through wage improvements and other benefits to our caregivers in the ongoing effort to better improve core volumes. While we expected Q2 volumes to have improved, we are actively addressing our overhead by business line to be more in line with our current trends.\n\nWe plan to have our overhead reductions identified and actioned by the end of Q3, and we expect these changes to improve our bottom line results while still giving us the operational platform and flexibility we need to deliver on our mission. As we look forward, we are committed to being a growth-oriented company, and all of our collective efforts are dedicated to making this happen. These are unprecedented times in healthcare, but Aveanna was created to revolutionize the way home care is delivered one patient at a time, and that's exactly what we're going to do. I look forward to updating you again on our Q3 operating results in the coming months.\n\nWith that, I'd like to turn the call over to Dave for additional color on the quarter.\n\nDave Afshar -- Chief Financial Officer\n\nThanks, Jeff. I'd like to start off by saying a big thank you to our entire corporate support team for what each of you do every day to support our operators and caregivers. Doing everything we can to make it easier to run our business, recruit and retain caregivers and provide high-quality care to our patients is job one. So a big thank you to the corporate team for all you do for Aveanna.\n\nI'm sure topics such as cash flow, liquidity and credit-related items are on the minds of our equity holders and lenders. Tony and Jeff have already provided color on our consolidated and segment level results, so I'll jump right into these other topics. With respect to cash flow, free cash flow was negative $57 million for the six months ended July 2, 2022. Bear in mind, though, that this included onetime usages of cash during the first half of $11.7 million to purchase an interest rate cap and $3.5 million of repayments of CMS advances received by certain of our acquired companies.\n\nFree cash deficit for the first six months was funded by $30 million of net borrowings on our securitization facility, $15 million of borrowings on our revolver and $12 million of cash from the balance sheet. Thinking about the rest of the year, free cash will be negative, but we'll be working hard to keep cash burn as low as possible as we focus on sources of cash from working capital, including driving incremental dollars into the door related to accounts receivable. Bear in mind, we must still repay $25 million to the IRS for deferred payroll taxes at the end of December. And looking forward to 2023, we expect to make significant progress toward breaking even from a free cash perspective.\n\nAnd while we're in a more limited M&A environment, integration and system transition costs are expected to be significantly lower in '23 than '22, and our '23 cash flow will not be negatively impacted by the repayment of CMS advances, deferred payroll taxes or the purchase of the interest rate cap, all of which will be $40 million for 2022. On the debt service front, we had approximately $1.43 billion of variable rate debt at the end of Q2. Of this amount, $520 million is hedged with fixed rate swaps and $880 million is subject to an interest rate cap, which applies and limits further exposure to increases in LIBOR above 3%. Accordingly, substantially all of our variable rate debt was hedged at the end of Q2.\n\nAnd one last item I would mention related to our debt is that we have no material term loan maturities until July 2028. From a liquidity perspective, we feel good about our ability to bridge our way to 2023. At the end of the second quarter, we had $185 million of total liquidity considering cash balances and availability under our revolver. And with the recent $25 million increase in capacity under our securitization facility as well as a $60 million draw on the delayed draw term loan, we've increased our liquidity in August to approximately $270 million.\n\nAnd as a reminder, we have limited covenant requirements under our revolving credit facility and do not anticipate any concerns for the foreseeable future. Before finishing up, I wanted to provide a few comments on the $470 million goodwill impairment that we recorded during the second quarter. We've been discussing the challenges we've been seeing in the labor markets and overall operating environment in 2022, and based on our second quarter results and revised forward-looking expectations, we provided updated fiscal year 2022 earnings guidance to the public markets on July 19. Our lowered guidance, in addition to the sustained decline in our stock price prompted us to perform an interim goodwill impairment analysis, which considers a number of inputs, including estimated fair value of the company's reporting units based on a market approach and a discounted cash flow approach.\n\nThe result of the impairment assessment was the $470 million impairment charge that we recorded in the second quarter. As I wrap up, I'd say that as we navigate our way through the challenging macro trends and headwinds we're currently facing, we believe that we will continue to have ample liquidity to fund our operations and think our credit facilities are appropriately hedged against the rising interest rate environment. We're looking forward to the future, and we'll continue to deliver on our important mission for our patients, our caregivers and our payer partners one patient at a time. And with that, I'd like to turn it over to the operator for questions.\n\nOperator\n\n[Operator instructions] And our first question comes from the line of Joanna Gajuk with Bank of America.\n\nJoanna Gajuk -- Bank of America Merrill Lynch -- Analyst\n\nSo I guess maybe a follow-up first. So talking about these rates in states coming in much better -- so I appreciate you mentioned Virginia specifically, but it sounds like it's a small state for the company. But then you mentioned another state that had also a 50% increase in rate. So would you be willing to tell us the state? Or maybe more importantly, like how meaningful is this state to the company? And also I want to clarify.\n\nDid I hear right -- you talk about volumes in that state improving 5% to 6% after the rate increase. So can you also give us the magnitude of things in Virginia after you had the 70% increase?\n\nTony Strange -- Chief Executive Officer and President\n\nI think we -- I gave a couple of examples in my remarks. One was Virginia and the other one I just listed as one of our larger states. Both -- and you're correct, Virginia is not a particularly large state for us. However, we have seen positive volume growth in Virginia related to Medicaid probably in the 3% to 5% range early on after we were able to pass on the wages.\n\nIn the other larger state example that I gave, with that particular payer, we're seeing even more substantial volume growth, kind of in that 5% to 7% range. In terms of quantifying either of those states, I'm not going to call that out because we've already given guidance -- when we early released in July, we gave our guidance of $1.785 billion in revenue -- or not less than $1.785 billion in revenue and not less than $150 million in EBITDA. And we're not trying to provide further guidance today or an outlook for 2022. But anecdotally, both examples of where there have been material rate increases have given us the flexibility to pass those wages on to caregivers in a meaningful way that would bring them back from other higher-paying jobs back into home care.\n\nJoanna Gajuk -- Bank of America Merrill Lynch -- Analyst\n\nOK. So I guess, yes, it's good to hear that you saw volumes picking up in Virginia and the other state that is even larger, so I guess more meaningful. So that's good to hear. And I guess that was my follow-up.\n\nBut the other question I had was on the covenants. So I appreciate you don't need the requirement because you didn't draw on the revolver. But I guess under the credit agreement, I'm sure there's some adjustments. So could you tell us what is the current first lien leverage under the calculation that's required by your credit agreement? Because I guess I'm coming up with 6.6 times when you adjust for this additional debt that you draw on.\n\nAnd I guess it would go to over 7 times -- 7.3 times, I guess, at the end of the year using the guidance, the $150 million EBITDA guidance. So I was just trying to think how this fits with the covenant that calls for a 7.6. I guess it's only -- you have to only look at that if you draw a third of your revolver. But just in case, I guess, you have to, just trying to understand the math here.\n\nDave Afshar -- Chief Financial Officer\n\nSure, Joanna. And actually -- so the last part you just mentioned is, is that the 7.6 limitation doesn't become operative unless we are using more than one-third of the overall credit facility. The revolver is subject to a $15 million carve-out for letters of credit. We don't disclose our specific first lien leverage metric, but we have a significant amount of room in the covenant more so than you think or that you mentioned there because the securitization doesn't roll into the calculation for credit adjusted leverage.\n\nSo that leverage ratio is much lower than what you mentioned, and we have a significant amount of room there. So I don't think it's a concern right now.\n\nOperator\n\nOur next question comes from the line of Brian Tanquilut with Jefferies.\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nTony, I guess a follow-up to Joanna's question. As I think about the remaining states, the big states that have not raised rates for you guys as we think about the fiscal '23 legislative sessions in these dates. Any color in terms of magnitude that you can share with us so that we can think of 2023 as -- kind of like what the potential upside is to overall rates for the business?\n\nTony Strange -- Chief Executive Officer and President\n\nWell, I want to stop short of trying to give you predictions of what I think personally will happen. I felt like we had a pretty good shot at getting a rate increase in California this year, and that didn't pan out. I do believe that the state of California has to do something in '23. We have -- I have not seen children's hospitals come out and get involved in the political process as much as we saw in 2022.\n\nThey're making a lot of noise about not being able to get patients out of the hospital. So this is just my opinion. I think California is going to have to do something either in the interim or something legislatively in '23 because there is a crisis brewing in California. And as I go around the horn with our other states -- I gave you one example of the one state that's material for us.\n\nOur large states -- I think we've been pretty open about it -- Texas, Pennsylvania, Colorado, Florida, California, all of those states are pretty actively trying to figure out ways to solve this problem. I think we've used Colorado several times as an example of being very innovative in their approach and using alternative caregivers to take care of patients. On the other side, I think Pennsylvania has been very proactive in trying to stay ahead of rate and wage issues. We've had -- Florida is more of a Medicaid managed care state for us, and we find the payers in Florida to be proactive.\n\nSo I think around our horn, I think -- we feel like we're being pulled along by payers and not in such a way where we have to go fight with payers. I think all of our payer partners, both state governments as well as our managed care organizations, I believe that they understand the issues today and they understand that we're part of the solution and are trying to be helpful and constructive of coming up with better ways to pay or more dollars to get -- to create more capacity. Jeff, anything –\n\nJeff Shaner -- Chief Operating Officer\n\nTony, I guess, well said. Brian, I think it is not if, it's just when. And I think in every single state we're working with, it is just a matter of when. And I think Tony's point on California is well said.\n\nIt's not a matter of if California is going to raise their PDN rate. It's just a matter of when we accomplish that. And I think we and the industry, specifically the PDN industry, have locked arms with the children's hospitals to ensure that, that is a successful outcome. And so like Tony, I felt good about 2022 and our rate opportunities, both on a legislative standpoint as well as on a managed Medicare.\n\nAnd I feel just as good or better about '23. And I think we are prepared as an organization to execute on those plans.\n\nTony Strange -- Chief Executive Officer and President\n\nWell, California -- we've used California as an example. California has a history of when they do make a rate increase, it is significant. In 2018, California raised their private duty rate by 50% in one stroke of the pen. So when that rate comes, it should be meaningful.\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nThat makes a lot of sense. I guess my follow-up -- as we think about those comments both of you guys just made, so is this just a situation where the demand is there. We just need to weather the storm and labor, and they'll be driven by rate. And eventually, we'll get back to the run rate growth that you were thinking about maybe 18 months ago.\n\nTony Strange -- Chief Executive Officer and President\n\nI think so. I think when we -- when you said 18 months ago, we were talking about growth rates that were in the 5% to 6% companywide. Our PDN growth rate was probably in that 3% to 4% range. Our home health was growing, call it, 10% -- 8%, 9%, 10%.\n\nThe same with the AMS. I think when the world and the labor markets normalize and the rates can be adjusted to reflect whatever is going to be the new normal wage rate, I do believe we'll get back to that growth in that 5% to 6% range year over year. And the reason I have confidence in that is because when you think about the place for all of home care, not just Aveanna or private duty or even home health -- home health and hospice and private duty services and medical solutions, these are all cost-effective alternatives. And in the larger scheme of trying to control overall healthcare costs, we are a mechanism by which costs can be reduced.\n\nAnd for those reasons, I think we're going to take a leadership position going forward. And we feel confident that those growth rates will return. In the meantime, the labor markets are very choppy and disrupted, and we're just going to have to weather that storm.\n\nOperator\n\nThe next question comes from the line of Matt Borsch of BMO Capital Markets.\n\nMatt Borsch -- BMO Capital Markets -- Analyst\n\nYes. Just on background, if you could. Can you remind us how much of your PDM revenue is driven directly from reimbursement under state Medicare program versus through the MCOs? And maybe on which side do you think you've made more progress in terms of reporting the issue?\n\nTony Strange -- Chief Executive Officer and President\n\nThat's a great question, Matt. And we have talked publicly, generically about that. So if you look at the overall company, MCOs make up a large -- Medicare managed care makes up a larger portion than does straight Medicaid. Within -- even within the private duty segment, the MCO breakout is slightly larger than the Medicaid.\n\nBut Medicaid -- stand-alone Medicaid is still a meaningful piece of that business. As it relates to the second part of the question, I think we have had similar success both with state Medicaid systems as well as managed care organizations. However, the Medicaid managed care organizations have the ability to move faster. For example, they don't have to wait for a legislative year.\n\nTexas, for example, their legislative process is every two years. A state -- a Medicaid managed care organization can move immediately when they need to. As a matter of fact, I made the comment about our payer relations team. Jeff and Mike Young and his whole team did a really nice job in moving one of the larger Medicaid MCOs in a meaningful way in an off-cycle type of rate change.\n\nAnd I think that's the benefit of dealing with the MCOs as they have a little more flexibility as to how and when they move rate.\n\nJeff Shaner -- Chief Operating Officer\n\nMatt, the only thing I would add is -- this is Jeff -- is the conversation is the same. Whether we're talking to a legislature or a managed Medicaid senior leader, it's the same conversation. To move -- to increase staffing and to get kids home, and more importantly, keep them home, we have to pass through wage rates, significant wage rate, in the tune of $4, $5, $6, $7 an hour. And so it's really the same conversation we're having.\n\nI think Tony said it well. The only real difference is in a Medicaid legislative, everyone gets the rate increase. So we and our peers share in that rate increase. When we're negotiating with managed care organizations, that rate increase is specific to Aveanna.\n\nTony Strange -- Chief Executive Officer and President\n\nThat's a great point.\n\nMatt Borsch -- BMO Capital Markets -- Analyst\n\nAnd I guess the Virginia example is not so much that it impacts the fundamentals, but as a sort of a test state for -- when you get the rate you're looking for, how that has immediate impact on your revenue. Is that -- am I'm looking at that in the right way?\n\nJeff Shaner -- Chief Operating Officer\n\nYes. And, Matt, as Tony mentioned, it was effective July 1, and we passed through wage July 1. So we didn't -- I think you've heard us in historical times talk about we -- sometimes we would delay that wage pass-through a few weeks or a month. In these times, we announced our wage pass-through, as probably the market did as well -- but we announced our wage pass-through literally the week of July 4.\n\nAnd so it just demonstrates how powerful it is to get incremental wage and other benefits like mileage reimbursement and things like that into the hands of the caregivers as fast as humanly possible. And as Tony said, I'm pleased with the first five or six weeks we've had in Virginia. It is a smaller part of our Medicaid business, but we've had meaningful movement in our staffing rates, our ability to bring kids home, and eventually, to be able to admit new children to our services.\n\nMatt Borsch -- BMO Capital Markets -- Analyst\n\nMy last thing, just to follow-up on. Do you think your scale, particularly in the PDS, PDM segment gives you specific advantages of any short relative to smaller players in weathering the current storm? I'm sort of curious to see how this is going to shake out as we go into next year for the whole industry.\n\nTony Strange -- Chief Executive Officer and President\n\nWell, Matt, I'm going to brag on our operating team and our government payer relations team. I do believe that our scale really does matter. And this team went to one of our larger MCO players and said, \"Guys, in order for us to be the partner that you want and need us to be, this is the rate that we have to be paid in order to fulfill your objectives.\" And in a matter of two to three weeks -- I think our size and scale gave us the ability to negotiate that rate and that value-based pricing contract in such a way that I don't think we could have done that if we weren't a relevant provider in that particular state.\n\nJeff Shaner -- Chief Operating Officer\n\nAnd, Matt, I would just add. It's a difference between being a partner and a vendor. And I think with our size and scale, we can be a partner to these managed care organizations. And we are talking to hundreds of managed care organizations on a weekly basis.\n\nTony mentioned that we've had five value-based contracts from Q4 through year to date -- through the end of July. I expect we'll have another two or three between now and the end of the year. So it will be almost 10 value-based contracts in our PDS segment. And I believe as time moves on, that will continue to grow and grow significantly.\n\nOperator\n\nOur next question is from the line of A.J. Rice with Credit Suisse.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nI appreciate the comment about the $7 million to $8 million of headwind if the rate reduction, I guess, in home health goes through. Are you thinking about -- I guess, I'd ask any updated thoughts on whether you'll be successful in getting any modification on that? And then second, are you looking at activities you can undertake that would mitigate some of that? Is any of that in the planning? Or do you wait and see how it all plays out first?\n\nTony Strange -- Chief Executive Officer and President\n\nWell, A.J., my guess as to what the outcome is going to be is probably worth about the same as yours. And I don't have any line of sight as to whether we'll be successful or not. I do feel with conviction that the industry has right on its side. I do understand the rule-making process and how the market basket update is calculated.\n\nAnd that is relying on cost report data from 2019 and at best 2020. And given the inflation that's going through right now, that cost report data is not reflective of what it takes to hire caregivers today. And I think we saw that in the hospice rulemaking process, whether it was adequate or not, I think CMS acknowledged the fact that there needed to be an adjustment made. We're hoping that we can get the same clarity with CMS on the home health rule.\n\nAs to what the outcome is going to be, I can't predict that. As it relates to adjustments -- I think our stance is we need to do the right thing and take care of the patient and provide the patient with the level of care that the physicians' orders require, and we'll want to do that in the most efficient manner possible. With that said, there are levers within the business that affect both reimbursement rate and profitability. We'll always try to be transparent and provide the level of care that the patient needs.\n\nJeff made a -- in his comments, he did talk about the final implementation of home-care home-base. We've digested that very quietly over the last year and we have it fully implemented throughout all of our home health and hospice businesses. We believe that the system will allow us to manage data that's going to allow us to be more efficient in the delivery of care as well as provide us with support that would allow us to need less overhead. And I think regardless of what the outcome is with the proposed rate change, I think those things will allow us to be more efficient going forward.\n\nSo regardless of whether we get a large rate cut or a better rate cut or no rate cut, I think we can -- well, there's opportunities for us to be more efficient.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nOK. And obviously, the focus is sort of weathering the current labor storm and getting some clarity around some of these rate updates. But a long-term part of the story had been funding consolidation opportunities. And post clarity on the rate update for home health, there likely will be a new round of deals available.\n\nHas the company thought about -- obviously, you're spending time talking about your leverage situation today. Any thoughts about how you might participate in that consolidation if it reaccelerates? Or are we just in a holding pattern here for the next year or so as things play out?\n\nRod Windley -- Executive Chairman\n\nA.J., it's Rod. We've kind of -- I think everybody has kind of done this. We pushed our big focus of M&A basically into a neutral position. But that doesn't mean that we're not doing smaller tuck-ins.\n\nSo there's -- I will tell you that all the wage disruption and the proposed Medicare cuts are putting pressure on the mom and pops. So I can tell you that there is certainly a lot of activity in that area. And so we'll continue to look for tuck-in acquisitions in markets where we can grow that business. So I would say our M&A activity is greatly muted, but it's concentrating on the smaller end of the scale.\n\nTony Strange -- Chief Executive Officer and President\n\nAnd, Rod, would you agree that we're going to -- that sellers' expectations will get -- we'll have to get adjusted based on the outcome --\n\nRod Windley -- Executive Chairman\n\nWill calm down.\n\nTony Strange -- Chief Executive Officer and President\n\nBased on the outcome of the proposed rule? So to your point, A.J., if the rule stands, it's probably going to accelerate consolidation, but probably at a lower price.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nI guess, I make it sure I make it clear. I was thinking about -- and maybe you guys have something in mind. What would your capacity be to do transactions? You're talking about on the smaller scale, obviously. But I mean, could you still -- as you think about the cash flow prospects and within the parameters of the covenants you've already talked about, would you still do $50 million or $100 million of deals over the next few years saying that things will open back up in '23? Or what is the capacity you think of the company to do it in the current configuration?\n\nTony Strange -- Chief Executive Officer and President\n\nWell, Dave mentioned in his remarks we've drawn down -- we replenished the cash that we used to buy Comfort Care and Accredited. We replenished that cash on the balance sheet. So we have that cash available. Valuations are coming down.\n\nThere is additional debt. However, we'd want to do that in such a way that we could delever at the same time. So the answer is, yes, if the right opportunity would present itself, we have the capacity to move forward. Now to Rod's point, it's probably not large transformational type acquisitions, but it's strategic regional, local opportunities where we can add to an existing geography, we can further leverage our overhead.\n\nAnd then also don't forget that we still have great equity partners. We have both Bain and J.H. Whitney and other -- a couple of other large investors that have indicated interest. That -- should the right opportunity present itself, we've got folks that are ready and able to write checks.\n\nWe're not -- yes, I think our M&A activity has slowed down, but we're not sitting on the sidelines.\n\nOperator\n\nOur next question is coming from the line of Sarah James with Barclays.\n\nSarah James -- Barclays -- Analyst\n\nYou talked earlier about some regulatory changes in certain states that allow you to hire family members. How impactful could that be to hours? And how much of your book is in states that still hasn't made that shift to allow family members to be paid?\n\nJeff Shaner -- Chief Operating Officer\n\nYes. And that's a great question, Sarah. This is Jeff. Yes, I think we saw -- and Tony talked about Colorado being innovative in nature.\n\nColorado was one of the first states to really endorse kind of the full suite of not only skilled care therapy in the home, enteral nutrition in the home, but also the idea of a family member who's already staying home with their love one, but probably not able to work or on some form of unemployment or welfare, moving to a Medicaid-type reimbursement where they would be involved. And so we think of Colorado as kind of -- really the inventor, if you will, of this. We've had a few states at it in the last year, primarily Arizona and New Hampshire. We're not in New Hampshire today, but certainly we're in Arizona.\n\nWe talked about that. We mentioned in our comments Washington State has very, very openly talked with the industry about adding it between now and the end of the year. And we're currently in negotiations -- or not innovation, we're currently in conversations with the department heads in Washington State. Right now, it's hours for families that are also on private duty.\n\nSo it's incremental hours for families who are already receiving private-duty nursing. So think of the population primarily being families who have a medically fragile child at home, but are receiving some kind of nursing services at home. And we see that being the primary patient base that most states are targeting because of the significant needs that those families need. But I think -- we use the word many states.\n\nI think the reality is with the environment today with labor and the amount of staffing that the industry is not able to do, I think we could see this getting up to 50 states, certainly 30, 40 states from a handful today over the next kind of two to three years. And certainly, Aveanna has endorsed it. The industry has endorsed that the family caregiver model is a necessary model in today's world. And so we're certainly championing it.\n\nSarah James -- Barclays -- Analyst\n\nGreat. And then maybe I could take A.J.'s question just a little bit different of a way. You guys talked earlier about this being a period -- obviously, there's some great challenges. You have to make it through.\n\nAnd you talked about not sitting on the sideline for the right acquisition. But what would you need to see macro or internally to go back to just your normal pace of M&A, where it's not this big strategic transformational, you can't miss that opportunity, but just to get back to that steady pace of normal growth?\n\nTony Strange -- Chief Executive Officer and President\n\nYes. So that's a thoughtful question here. So I think it's a cascading effect. And I think if you go all the way back to the top, what we really need to see is our volume growth return to that 5% to 6%.\n\nAnd what will happen when that is the case, our infrastructure is such that when we're growing 5% to 6% year over year, our gross margins have been very steady and we can hold on to that gross margin. And then our EBITDA will adjust on its own probably back into that $200 million run rate. When we're back in that $200-plus million run rate, I think everything then becomes more stable, where we can start looking out and start being a little more strategic as it relates to just an M&A pipeline. But it really has to start with that return to normalized growth, which is going to be driven by the combination of rate and increased wages.\n\nOperator\n\nOur next question is from the line of Pito Chickering with Deutsche Bank.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nI'll take another shot at Joanna's pricing question. I appreciate the commentary on the positive rate increases you guys got in Virginia as well as some of those contracts. But can you provide color on what's the blended price increase you got as of July 1 across your portfolio? And then any color on how your PDS hours has been, again, across your whole portfolio in July versus 2Q with those increases?\n\nJeff Shaner -- Chief Operating Officer\n\nYes. Peter, this is Jeff. I think the way to think about it is pre-COVID and kind of the disruption labor markets. We expected rate to be in that 1%, maybe 1.25%.\n\nSpecifically, I'm talking private duty service here for a minute. And I think that was what we were seeing in our trends. In this environment, that number, we felt, like would be between 1.25% and 2%. I think we're seeing getting closer to the upside of that, being in the high 1%, pushing 2%.\n\nI think as it relates to volumes -- I think in Tony's comments you really saw -- we are seeing volume improvement directly tied to significant rate improvements. And by significant, I don't mean getting a 1% or 2% cost of living adjustment in the market. I mean 15%, 18%, 20% in a state or 15%, 20%, 25% rate increase in one payer. And we're able to see that movement.\n\nAs we think of July, our volumes in PDN had been not terribly different than they were at the end of the quarter in Q2. So our overall volumes in PDN have not increased from where they were in Q2. As Tony talked and I think we validate, we see our unskilled and our family caregiver volumes increasing. But until we stabilize -- we're in 30 Medicaid states in our PDS business.\n\nUntil we stabilize enough of the states related to the LPN and RN, we're still -- there's still enough churn in the states where we've not received meaningful rate increases that, that business has not gotten back to positive organic growth rates.\n\nRod Windley -- Executive Chairman\n\nAnd it might be helpful, Pito, that when we think about rate increases, we think about states and sometimes even contract by contract as being its own ecosystem. So we don't take rate increases that we receive in one state and then pass along wage increases to eight other states and try to use that one rate increase to help other issues. So a matter of fact, in the example that Jeff was giving, in some of our Medicaid managed care organizations, sometimes we pay -- our wage differential is different between one payer to another. And so a nurse that works for payer A, that works with patients with payer A might get paid one rate and a nurse that works with payer B patient might get paid a totally separate rate that's less.\n\nAnd so we -- Jeff made the comment that we are moving capacity to those places and payers that recognize the quality and the value that we can bring. Sometimes that's one contract by one contract, even patient by patient.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nOK. Fair enough. And then on the guidance, you provided your guidance on the first quarter essentially halfway through 2Q and then sort of cut it after the quarter ended, which implies the back half of the quarter in 2Q was worse than the first half. Mathematically, you're assuming that the first half EBITDA is the same as the second half EBITDA, but the trend is down during the back half of 2Q.\n\nI'm just assuming what do you assume differently, sort of ramping from where we exited 2Q to get to sort of equality in the back half of the year?\n\nTony Strange -- Chief Executive Officer and President\n\nIt's all of the above of everything you just said. And yes, if you wanted to dissect a quarter -- when we gave the guidance kind of late in Q1, we had begun to see -- coming out of omicron, we had begun to see a little bit of improvement as we went through kind of April. And we had seen hours improve, as one would expect them to do in Q2. If you recall, it was late April, early May when we started seeing gas prices go up and hit the $4.50-plus or the $5 range.\n\nWe saw inflation really kind of take off late April, early May. We saw a substantial difference in our ability to hire caregivers and retain caregivers probably around the -- toward the end of May is when that really changed. So to your point, there is some downside. We saw a significant downside in the second half of the quarter versus the first half of the quarter.\n\nNow to your point, we also haven't adjusted our outlook for some of these rate improvements that Jeff has been talking about. So we kind of held that guidance the way we put it out there. And just to refresh everybody's memory, what we guided to was revenues of not less than $1.785 billion and EBITDA not less than $150 million. And so we haven't updated that guidance at all.\n\nBut those are the moving pieces that go into the second half of the year. Hopefully, that helps.\n\nOperator\n\nOur next question is from the line of Ben Hendrix of RBC Capital Markets.\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nYou've talked extensively about your commitment to preserving the PDN gross margin in the 30% context. But in your negotiations with states and MCOs, are you seeing any pushback urging you to meet them halfway and sacrifice some margin, especially amid increased involvement from children's hospitals and other health systems to -- around improving discharges?\n\nTony Strange -- Chief Executive Officer and President\n\nA thoughtful question, Ben. The answer is no, because we can demonstrate pretty carefully -- because that number you're talking, the gross margin number, that doesn't include any of the overhead associated with the scheduling of the patient, the clinical management of the patient, the overseeing of the physician's orders. All of those kind of things are hard costs. And we have the ability to outline those costs for our payer partners.\n\nAnd so I think – and, Jeff, jump in here. I think our partners believe that a 30% margin is probably fair.\n\nJeff Shaner -- Chief Operating Officer\n\nYes. Ben, we haven't -- that hasn't come up at all in any of our discussions. It's really the conversation of we're asking for some number of $8 or $10 more per hour, including value-based components. And it's the commitment to that preferred payer that we will move the needle by passing through a significant portion of that rate increase to the caregiver.\n\nAnd that's really where our conversations are. We can tell the payer -- specific managed care payer and legislatures: \"This is what we're paying LPNs today. This is what the market is. That's the delta.\n\nWe will pass that delta through via the rate increase.\" And we have. And we've been able to show them that soon as the contract is signed, that we're able to get kids out of the hospital, and more importantly, increase staffing rates. And that's what they want. They want to keep the kids home.\n\nIt's still a difference of a few hundred dollars a day at home with a company like Aveanna versus $3,000 or $4,000 a day in a NICU, PICU and the NICU, PICU beds are full. So it's not a hard proposition to sell. It's really passing through that wage to the caregiver, and we've been effective in doing that.\n\nTony Strange -- Chief Executive Officer and President\n\nAnd, Ben -- I mean, when I say that we can quantify this for our payer partners -- and I'll use one example. I mean, it costs between 1% and 1.5% of revenue to bill and collect in this business. And we can go through that same exercise and show what it costs to run payroll, show what it costs to run the branch overhead, the scheduling function. And so when you go through all that, a 30% gross margin is not unreasonable.\n\nOperator\n\nOur final question today comes from the line of Lisa Gill with J.P. Morgan.\n\nUnknown speaker\n\nThis is Andrew on for Lisa. I just had a quick question. Other than wage increases, are there any actions that the company is taking to tackle retention and recruitment for managing labor. Just wondering if there's anything other than the anticipated reimbursement increases that you're looking at to handle labor headwinds?\n\nJeff Shaner -- Chief Operating Officer\n\nAnd your question is specifically to the private duty services or just in general?\n\nUnknown speaker\n\nPrivate duty services.\n\nJeff Shaner -- Chief Operating Officer\n\nYes -- no, I think that's the main lever in that business, right, because it is an hour of reimbursement for an hour of wage. In our home health and hospice segments, we have other levers that we can manage for that gross margin. But in this business, no, it's pretty straightforward. And it's primarily driven by wage, right? In the PDS business segment, it's really -- the wage rate is the #1 driver of hire and retention.\n\nOperator\n\nAt this time, we've reached the end of our question-and-answer session. I will now turn the floor back to Tony Strange for closing remarks.\n\nTony Strange -- Chief Executive Officer and President\n\nThanks, operator. And I want to thank everybody for joining our call today. And again, I want to state -- we believe that home care is a solution, not a problem. And we think that Aveanna is well positioned.\n\nWe're a comprehensive provider. We have a very diverse payer background. And we have a leadership team that has been through this fight on more than one occasion. With that, we think that home care creates a tremendous opportunity to create value for all investors and shareholders alike.\n\nSo with that, thank you for attending our call, and we look forward to updating you on our future progress.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nShannon Drake -- Investor Relations\n\nTony Strange -- Chief Executive Officer and President\n\nJeff Shaner -- Chief Operating Officer\n\nDave Afshar -- Chief Financial Officer\n\nJoanna Gajuk -- Bank of America Merrill Lynch -- Analyst\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nMatt Borsch -- BMO Capital Markets -- Analyst\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nRod Windley -- Executive Chairman\n\nSarah James -- Barclays -- Analyst\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nUnknown speaker\n\nMore AVAH analysis\n\nAll earnings call transcripts"
}