{
  "companyName": "Skechers",
  "companyTicker": "SKX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/skechers-skx-q3-2022-earnings-call-transcript/",
  "content": "Skechers (SKX 0.14%)\nQ3 2022 Earnings Call\nOct 25, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings. Welcome to Skechers third quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn this conference over to Skechers.\n\nThank you. You may begin.\n\nUnknown speaker\n\nThank you, everyone, for joining us on Skechers conference call today. I will now read the safe harbor statement. Certain statements contain herein, including without limitation, statements addressing the belief, plans, objective, estimates or expectations of the company or future results or events may constitute forward-looking statements that involve risks and uncertainties. Specifically, the COVID-19 pandemic have had and is currently having a significant impact on the company's business, financial conditions, cash flow and results of operations.\n\nSuch forward-looking statements with respect to the COVID-19 pandemic include, without limitation, the company's plans in response to this pandemic. At this time, there is significant uncertainty about the duration and extent of the impact of the COVID-19 pandemic. The dynamic nature of these circumstances means that what is said on this call could change at any time and as a result, actual results could differ materially from those contemplated by such forward-looking statements. Additional forward-looking statements involve known and unknown risks, including, but not limited to, global, national and local economic, business and market conditions, including the impact of inflation, Russia's war with Ukraine and supply chain delays and disruption in general and specifically as they apply to the retail industry and the company.\n\nThere can be no assurance that the actual future results, performance or achievements expressed or implied by any of our forward-looking statements will occur. Users of forward-looking statements are encouraged to review the company's filings with the U.S. Securities and Exchange Commission, including the most recent annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all other reports filed with the SEC as required by federal securities laws for a description of all other significant risk factors that may affect the company's business, financial conditions, cash flows and results of operations. With that, I would like to turn the call over to Skechers' chief operating officer, David Weinberg; and chief financial officer, John Vandemore.\n\nDavid?\n\nDavid Weinberg -- Chief Operating Officer\n\nThank you for joining us today on our third quarter 2022 conference call. Before we discuss our business in detail, I would like to thank Footwear News for naming Skechers as Company of the Year for the third time in our 30-year history. This honor wouldn't have been possible without the collective energy, dedication and creativity of the entire Skechers organization, both here in Southern California, as well as in every Skechers showroom, office, logistics center and retail store around the world. The Skechers team worked extremely hard this year alongside our loyal partners globally, be it our accounts, distributors, factories and vendors.\n\nFrom the bottom of our hearts, thank you for your enthusiasm and collaboration as we work through the challenges of the last couple of years. We are optimistic that the COVID-related restrictions are easing with only a few markets around the world still facing temporary closures and restrictions, and that freight costs are beginning to decline. However, macroeconomic headwinds, including foreign currency exchange rates, and congestion within our distribution centers due to the strong demand for our product, and supply chain disruptions over the past year impacted our reported results in the third quarter, and we expect will remain a factor into the new year. While we focused on working through these challenges, we remained a go-to source for consumers and our partners around the world resulting in a new quarterly sales record of $1.88 billion for the third quarter.\n\nWe are proud of this achievement, which was driven by double-digit increases in EMEA and the Americas and high single-digit growth in APAC, bringing our international business to 60% of our total sales. As we see improvements from supply chain, logistic costs, distribution center congestion, particularly in North America, foreign currency exchange rates and closures in China, we believe we will achieve continued revenue growth. Our ongoing success of record annual sales in 2021 and this year's three consecutive quarterly sales records is rooted in our talented team. Our core design principles, comfort, innovation, style and quality at a reasonable price by which every pair is measured.\n\nOur focused marketing efforts, our deep distribution network, and our determination to deliver our product as quickly as possible to our consumers. Years ago, we recognized the need for comfortable footwear and as the third largest athletic footwear company in the world, we are widely known for our comfort technology products. As consumers have truly come to view Casual as the new normal, we are in a unique position with our extensive offering. Always looking for new ways to meet our customers' needs, we extended our Skechers Arch Fit technology into a wider offering of styles, introduced Skechers hands-free slip-ins, the ultimate and ready-to-go footwear for men, women and children and expanded our fashion collection within our Skechers Street offering and collaborations.\n\nInnovation is the core of our Performance division, and it's never looked stronger, including the gripping outsoles and comfort upper of our Viper Court Pickleball collection, and the awards given to the MaxRoad 5 by both Men's Health and SELF magazines. Also, this month, the Razor 4 an update to the technical running shoe that Meb wore in his Boston Marathon win was released with Hyper Burst Pro, the latest evolution of our signature ultra-lightweight resilient cushioning foam. We are always focused on meeting the demands of our wholesale partners globally and our consumers who shop at our approximately 4,450 Skechers retail stores worldwide and through our expanding e-commerce footprint, all to ensure Skechers, The Comfort Technology Company is the leading choice and is available when and where consumers want. Total sales growth of 21% or 27% on a constant currency basis was the result of increases in our international and domestic businesses of 25% and 15%, respectively.\n\nBy region, EMEA saw improvements of 48% and the Americas grew 16%. We are also particularly pleased with our APAC sales growth of 9% or 17% on a constant currency basis, which includes China decreasing by 19% or a not so strong double-digit 13% in constant currency. Despite China's Zero COVID policy, we remain confident in the long-term success for Skechers in this country. In the quarter, our wholesale business increased 26% due to double-digit growth both in domestic and international.\n\nThe international growth was led by a 59% increase in EMEA, an 18% increase in the Americas and an 8% increase in APAC. Overall, wholesale sales were driven by increases in unit volume of 25% and an average selling price per unit of 1%. The Americas wholesale sales growth was due primarily to a 15% increase within our U.S. wholesale business where we saw improvements across genders and multiple categories, most notably our sport, casual and work lines as well as the unit price.\n\nCanada and Mexico, our two largest American markets outside the United States, also achieved double-digit growth, and every Latin American country also saw sales improvements, except Chile, which is experiencing significant economic volatility. Growth in EMEA wholesale was primarily driven by double-digit improvements across all European countries, as well as growth within our distributors, primarily driven by the Middle East, Turkey and Scandinavia, partially offset by the continued cessation of shipments to Russia. APAC wholesale sales increased primarily due to strength within our distributors, as well as India and Singapore, and the addition of the Philippines, which transitioned from a distributor in 2021. The increases were partially offset by decreases in China and Japan due to COVID-related lockdown measures.\n\nTurning to our Direct-to-Consumer business, which is a key focus area for the company, as we look to create more opportunities to showcase the broad range of Skechers products and connect directly with consumers. Sales increased 12% in the quarter due to growth of 14% in the Americas, 10% in APAC and 6% in EMEA. Domestic Direct-to-Consumer sales increased 15%, primarily due to strong double-digit growth in our digital commerce channel. International Direct-to-Consumer sales grew in nearly every country, partially offset by declines in China, which was impacted by the temporary closures of just over 10% of our company-owned stores and Chile due to economic volatility.\n\nIn total, Direct-to-Consumer unit volume increased 11% and average selling price was essentially flat. In the third quarter, we opened 76 company-owned Skechers stores including 46 in China, eight big box stores in the United States, a flagship store in Madrid and our first store in Rotterdam. We also expanded and relocated two stores in key Lima malls, Jockey Plaza, and Plaza Norte. We closed 34 locations in the quarter, including 21 in China and two concept stores in the United States.\n\nWe ended the quarter with 4,458 Skechers stores worldwide of which 3,054 were third-party stores, including 177 that opened in the third quarter, 129 of which were in China, 12 in India and five in South Korea. In the fourth quarter to date, we've opened 14 company-owned stores, including one big box store in the United States and five stores in China. For the remainder of the year, we plan to open an additional 35 to 45 company-owned locations. In the third quarter, we launched new e-commerce sites in Poland and Switzerland.\n\nAnd this month, we launched our site in Japan. We also plan to launch several more e-commerce sites in the coming year. We are pleased with our record sales achievement in the third quarter, driven by the continued strong demand for our comfort technology products. With double-digit growth across our wholesale and Direct-to-Consumer businesses, sales increased in nearly every market, except those that faced either COVID-related lockdown measures or significant economic volatility.\n\nThis is a testament to our product and marketing resonating globally, as well as our determination to both deliver our footwear to consumers as quickly as possible and the efforts we have made to improve our infrastructure, including our network of distribution centers, some of which are being impacted by the supply chain challenges. The expansion of our LEED certified Gold 2.6 million square foot North American distribution center is in the final process of integration with our existing system. This is expected to improve processing volumes and efficiencies over the course of 2023. With international representing 60% of our total sales, we remain focused on our infrastructure abroad.\n\nWe plan to begin shipments out of two new distribution centers in the first half of 2023. This includes a new 427,000 square foot distribution center in Vancouver, which will result in improved shipping times in Canada, as well as some reduced pressure on our Rancho Belago facility. As we celebrate our tenth year of business in India, we began the first phase of our 1.1 million square foot IGBC Platinum pre-certified distribution center outside Mumbai, which is planned to be operational by mid-2023. This quarter, we also began Phase 2 of our China distribution center which is expected to be complete in 2024.\n\nLast month, we held our first in-person global product conference since COVID at the newly finished initial phase of our corporate headquarters in Southern California, and this month, our key retail partners joined us for 2023 buy meetings. The expanded building on Pacific Coast Highway is now home to our many showrooms serving to highlight our extensive comfort technology footwear. To support and drive awareness to our diverse product offering, we have an equally diverse team of ambassadors appearing in our marketing campaigns. From pop superstar Ava Max to lifestyle guru, Martha Stewart, retired athlete Sugar Ray Leonard and Tony Romo to elite major championship golfers, Brooke Henderson and Matt Fitzpatrick and local celebrities who launched in the third quarter, including Myleene Klass in the U.K.\n\nand Vanessa Mai and Michael Ballack in Germany. Skechers marketing campaigns appeared on billboards in Panama and Chile, buses in Greece, across buildings on high streets in Spain and Portugal, elevated kiosks in China and malls in Canada, Hungary and Colombia, as well as Skechers shoes on the seat of influencers and key opinion leaders, on the catwalk in Berlin, and on covers and within the pages of fashion magazines worldwide, where consumers shop, be it on their phones or in malls or where they visit, be it in stadiums or tourist centers or where they commute buses, trams and subways, Skechers is everywhere, driving demand. There's no doubt that macroeconomic issues remain, but we believe our unique position as a brand that delivers on comfort, style, innovation and quality at a reasonable price will continue to resonate with consumers in the U.S. and around the world.\n\nAnd now I would like to turn the call over to John for more details on our financial results.\n\nJohn Vandemore -- Chief Financial Officer\n\nThank you, David, and good afternoon, everyone. Skechers again achieved a new quarterly sales record of $1.88 billion, growing 21% on an as-reported basis and 27% on a constant currency basis. We saw double-digit growth in both our wholesale and Direct-to-Consumer segments. In fact, we saw double-digit growth in nearly every country, demonstrating the broad-based consumer demand for our comfort technology products and the strength of the Skechers brand around the world.\n\nWe remain focused on executing our long-term growth strategy and delivering a diverse assortment of innovative, comfortable products for consumers across the globe, even as we navigate historic headwinds from supply chain disruptions, ongoing COVID-related restrictions, inflationary pressures and growing uncertainty around the macroeconomic environment and its impact on consumers. I want to first provide an update on COVID-related supply chain dynamics and their impact on our results in the quarter. One year ago, we began experiencing container shortages, factory closures and severe port congestion. Those conditions led to elongated order time line and tremendous concern about product availability, which prompted more substantial backlog volume.\n\nThen about midyear, we experienced significant improvement in transit times and port throughput. This resulted in capacity challenges in distribution networks across the industry due to a meaningfully increased arrival rate for goods. Consequently, we experienced and continue to experience processing constraints at our distribution centers, leading to cost inefficiencies as we work to mitigate the impact of these disruptions on our customers. In the third quarter, this gave rise to approximately $50 million of incremental logistics costs globally which weighed heavily on our results.\n\nIn addition, more significant than expected COVID-related challenges in the Asia Pacific region, particularly in China, and adverse foreign currency fluctuations further weighed on expected results, which were below our earnings guidance. While we are disappointed with the lack of earnings flow-through from our better-than-expected sales in the quarter, we are confident that supporting our customers was the right decision for our brand. Further, we believe the corrective actions we have taken and are taking to accelerate additional capacity and adjust future orders will ultimately resolve the situation and restore efficiencies. Now let's review our third quarter financial results.\n\nWholesale sales increased 26% year-over-year to $1.19 billion, led by 33% growth internationally and 15% growth domestically. Broad strength extended across regions with notable growth in EMEA and the Americas as well as in APAC, excluding China. Collectively, we saw a double-digit increase in units sold, and higher average selling prices per unit, reflecting strong demand for our distinctive product portfolio at compelling price points. Direct-to-Consumer sales increased 12% year over year to $686.8 million, with 15% growth domestically and 9% growth internationally, driven by double-digit increases in units sold and strength in both our retail stores and digital platforms.\n\nAs one of our key long-term growth strategies, the investments we are making in our Direct-to-Consumer segment are yielding strong results, as we continue to expand our international online presence and enhance our omnichannel capabilities. This further enables us to build direct relationships with our loyal consumers, showcase the breadth and depth of our product portfolio, attract new consumers and above all else, deliver great products. We are excited about the growth opportunities ahead and meeting the needs of our consumers whenever and however they choose. Now turning to our regional sales.\n\nIn the Americas, sales for the third quarter increased 16% year over year to $948 million, supported by growth across all channels. As we work to alleviate the congestion in our domestic distribution network, we expect sustained consumer demand for our products and brand resonance will continue to drive growth across the region in the fourth quarter. In EMEA, sales increased 48% year over year to $469.8 million, primarily driven by strength in our wholesale segment, which benefited from improvements in product availability compared to last year's European port congestion. In APAC, sales increased 9% year over year to $460.6 million, driven by strength in distributor markets, as well as India, Singapore and Malaysia, partially offset by a decline in China.\n\nExcluding China, sales grew 60%. In China, sales declined 19% as over 10% of our stores were temporarily closed at one point. We expect ongoing COVID-related lockdowns and restrictions to continue to impact our operations into 2023. This, however, does not diminish our view of the Chinese market long term, where the Skechers brand is uniquely positioned with our distinctive products and attractive value proposition.\n\nThird quarter gross margins decreased 280 basis points year over year, 47.1%, predominantly due to elevated freight costs, as well as an unfavorable mix impact from higher distributor sales, partially offset by improved pricing. Operating expenses increased $123.3 million or 20%, but decreased approximately 30 basis points as a percentage of sales year over year. Selling expenses increased $23 million or 18%, but improved 20 basis points as a percentage of sales. The dollar increase was primarily due to higher demand creation expenses in digital and brand marketing globally.\n\nGeneral and administrative expenses increased $100.2 million or 20%, but decreased 20 basis points as a percentage of sales year over year. We incurred approximately $50 million of incremental logistics costs globally to minimize disruptions in delivering product to our customers and also saw increased volume driven distribution expenses. Earnings from operations decreased 11% compared to 2021, and our operating margin for the quarter was 6.9% as compared with 9.4% in the prior year. Earnings per share were $0.55 per diluted share on 156.2 million diluted shares outstanding, a 17% decrease year over year.\n\nThis includes a negative $0.09 impact from foreign currency fluctuations year over year. Our effective tax rate for the third quarter was 17.9% compared to 15.6% in the prior year. And now turning to our balance sheet. We ended the quarter with $681.5 million in cash, cash equivalents and investments.\n\nThis is a decrease of $500.2 million or 42% from September 30, 2021, as we continue to invest in working capital to drive sales and ensure we have product available in the right place and at the right time to meet consumer demand. Inventory was $1.78 billion, an increase of 45% or $549 million compared to the prior year period, reflecting the supply chain conditions I previously mentioned. We are optimistic that inventories will gradually return to normalized levels as supply chain volatility diminishes. Accounts receivable at quarter end were $933.9 million, an increase of $175.2 million from September 30, 2021, resulting from higher wholesale sales.\n\nCapital expenditures for the quarter were $100.1 million, of which $42.1 million related to the expansion of our distribution infrastructure globally, $30.8 million related to investments in our retail stores and Direct-to-Consumer technologies, and $17.7 million related primarily to our new product design center. During the third quarter, we also repurchased 639,000 shares of our Class A common stock at a cost of $25 million. We will continue to deploy our capital consistent with our philosophy toward maintaining a strong balance sheet and making investments in our business, while opportunistically providing direct returns to shareholders in the form of share repurchases. Now turning to guidance.\n\nFor the fourth quarter, we expect sales in the range of $1.725 billion to $1.775 billion and net earnings per diluted share in the range of $0.30 to $0.40. We anticipate sequential gross margin improvements in the fourth quarter and that our effective tax rate for the year will be between 19% and 20%. This guidance also includes the continuing impact of inefficiency in our distribution network associated with supply chain congestion, as well as ongoing COVID-related operating limitations particularly in the Asia Pacific region. For the fiscal year 2022, we expect total capital expenditures to be between $300 million and $325 million as we continue to invest in our strategic priorities.\n\nIn the face of innumerable challenges, we are encouraged by the strong consumer demand for our comfort technology products, which delivered double-digit growth in nearly every country and across all distribution channels. This is a testament to our brand, our people and our products. Our long-term growth strategy remains intact and we believe will demonstrate the resilience of our business model through these challenging times. We are steadfast in our focus on delivering innovative, stylish, comfortable products at attractive price points to consumers around the world.\n\nWith that, I will now turn the call over to David for closing remarks.\n\nDavid Weinberg -- Chief Operating Officer\n\nThank you, John. Three quarters of record growth during a period of continued macroeconomic challenges is a clear indication of the ongoing relevance of Skechers, the desire for quality and comfort by consumers and the determination of our entire organization to meet the needs and demands of our customers. While we look ahead to our goal of $10 billion in annual sales by 2026, we remain focused on the here and now, delivering fresh product as quickly as possible, creating awareness of the innovations and features in each collection, and increasing the opportunities to shop our brand, be it at our expanded network of Direct-to-Consumer locations including a retail base of approximately 4,450 locations or through visible spaces within third-party stores. We are honored to receive our third Company of the Year award for Footwear News in our 30th year of business.\n\nThe excitement of our first year has grown over three decades and resonates throughout our talented and dedicated team. We're looking forward to continuing our growth momentum as a more experienced organization and a brand known around the world for its unique portfolio of comfort collections. We recognize the volatility and dynamic situation we are presently in, but we believe in the strength of our brands and the long-term position of Skechers. Now I'd like to turn the call over to the operator for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Jay Sole with UBS. Please proceed.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you so much. My question is about gross margin. John, you called out some of the drivers.\n\nI think you mentioned freight and logistics, foreign exchange, mix, ASPs, but can you give us an idea of sort of like the magnitude of each of those. And really, what I'm trying to get at is how much of those was really onetime in nature that you expect to get back in a year or two? And also within SG&A, you mentioned logistics costs were also in SG&A. I think you called out $50 million. Do you consider that like a sort of a onetime expense as well? And how should we think about that going forward? Thank you.\n\nJohn Vandemore -- Chief Financial Officer\n\nHi, Jay. On gross margin, I mean, really far and away, the cost driver has been really for the full year, freight and logistics, it's by far the most significant driver. We were able to offset some of that with pricing. As we've mentioned before, we're still catching up a bit on price increases in our wholesale segment, and that was a very strong segment for us this quarter.\n\nSo that catch-up is still underway. We do expect it to fully materialize over the course of Q4 and Q1. But we still didn't have enough pricing to offset the freight and logistics in the fourth quarter. And then there was some mix.\n\nOur distributor business was very, very strong in the quarter, which is a great thing to see from those markets. But as you know, the distributor business has a dilutive gross margin, a very good operating margin, but a dilutive gross margin. So we did suffer a bit from mix effects there. In regards to the incremental $50 million we quantified, I think most of that long term is going to go away as efficiency works its way back into the system.\n\nBut as we mentioned and we have mentioned for a while now, we're experiencing severe congestion from supply chain issues, and that's giving rise to the need to spend in order to make sure we're preserving as best we can our customer delivery windows and working our way through that inventory. So it will linger as long as those issues linger, though, we do expect they will begin to become less prominent as we move through Q4 in the early part of 2023. The only caution I'd give is, this is clearly a ramification from COVID's effect on the supply chain, which, as we noted in our prepared comments, has been both extreme and extremely volatile. And so some of this is going to be subject to where the supply chain normalizes out and when that happens.\n\nThe one note I would give you, though, on the plus side, and I think David mentioned in his remarks, we are starting to see some favorable trends on freight rates, container rates. That it will work its way into the P&L over time, because we're still -- we still have the inventory that we imported under the higher rate structures. But in terms of green shoots in the supply chain, that's one of the more encouraging ones we've seen.\n\nDavid Weinberg -- Chief Operating Officer\n\nYeah, Jay. In addition, part of that issue with the distribution centers is we were expanding them at a time where it was difficult to get parts, and we would have been complete a lot earlier and not have to run the duplicate costs, both in the U.S. and places like Panama. If we were to get equipment earlier and had a broader tail up to speed earlier.\n\nWe continue to work on both of them. And as we move into one structure and get the learning curve under our belt and back into the facility is complete, we should level out significantly given the existing volume. Obviously, if the volume continues as it can with us to grow at an outsized volume, we may have to play more catch-up in the future in some markets.\n\nJay Sole -- UBS -- Analyst\n\nGot it. OK. And then if I can just follow up with one more. Just on the inventory.\n\nCan you give us a little bit of an idea of maybe where it's located? Is it in China? Is it in the U.S.? Is it in transit? And are you comfortable with the level in the sense that you think you'll be able to sell most of it at full price? And maybe when do you think the inventory growth rate will get back in line with the sales growth rate?\n\nJohn Vandemore -- Chief Financial Officer\n\nYeah. In terms of the growth we experienced this quarter, two notable observations. Almost none of it was in the Asia Pacific region, which is obviously as we mentioned, remains under some COVID duress. So it was predominantly in the U.S.\n\nand to a lesser degree, in Europe. We do feel very good about the inventory. As we noted, it's all arrived within the last couple of months. And so it is good inventory that we fully expect to be able to sell through at regular prices.\n\nWe don't have any real concerns about that. We have seen a material shift out of in-transit into on hand, but that's part of the issue we're talking about here is, you saw throughput improved dramatically and you saw transit times improve dramatically. And that just brought a lot of product onshore at a rate that's far more significant than we've historically observed. So that also was a contributing factor to the congestion we mentioned.\n\nDavid Weinberg -- Chief Operating Officer\n\nYeah, Jay, you should notice, I think, just want to point out from my own perspective, that what happened during the pandemic and the closedown is that we moved out our buying process by a few months from what would normally be somewhere in the neighborhood of four, four and a half months to like six, six and a half, even out to seven months trying to get everything in on time with the congestion at the ports and the issues we were having with our factories. That all came in at one time. So it's not -- under normal circumstances, we would have been at a more normal inventory rate and rate of growth. But as John said, they are relatively new.\n\nThey all just got here. They're all predominantly spoken for, given the flows we've seen, as we slowed down buying on the tail end until we catch up to the process. So we've now taken our supply chain and moved it back a few months, and we have absorbed all the inventory, so we'll be shipping out of hand. And now that we've expanded our facility and have taken it in, it should be easier for us to process.\n\nAnd I will tell you, the one caveat with that, obviously, is how good does demand stay over the next few months. And the way we started in October, gives me personally a lot of confidence in the fact that we'll move it out on a very regular basis.\n\nJay Sole -- UBS -- Analyst\n\nOK. Thank you so much.\n\nOperator\n\nOur next question is from Laurent Vasilescu with BNP Paribas. Please proceed.\n\nLaurent Vasilescu -- Exane BNP Paribas -- Analyst\n\nGood afternoon. Thank you very much for taking my questions, John and David. I'd love to ask about FY '22 EPS guidance. If I look at the midpoint today versus the midpoint 90 days ago, looks like you lowered it by about $0.25.\n\nJohn, I'd love for you to kind of give us the bridge on that, like how much of it is incremental from that fact -- from the congestion charges and maybe even China, so we can understand the magnitude of the cut.\n\nJohn Vandemore -- Chief Financial Officer\n\nThanks, Laurent. I will shy away from giving you a penny by penny walk through, but let me give you the big factors in order of size and scale. First is going to be the freight and logistics. We planned for, we believe, an adequate amount of that.\n\nSo that's working its way into the guide. Secondarily, China has not recovered at the pace we had originally expected. Unfortunately, that market continues to be challenged by COVID. We're looking for some early signs that things are starting to recover.\n\nBut I believe as long as lockdowns and other restrictions on operations are in place, it's going to inhibit China from fully recovering. And then FX. FX is another headwind, but those are the three most significant factors we're dealing with.\n\nLaurent Vasilescu -- Exane BNP Paribas -- Analyst\n\nOK. Understood. Thank you for that, John. And then I know you're not prepared to talk about 2023, but I don't know if you can give us some color on just the wholesale order book for spring 2023, like how do we think about it domestic versus international? And then one thing that surprised me with the ASPs both on wholesale and DTC, were up around 1%.\n\nI don't know if there was -- it was due to increased markdowns. But how do we think about ASPs in the order book versus cost going forward for at least maybe spring 2023? And again, I know you're not guiding for 2023, but just some color there would be super helpful. Thank you.\n\nJohn Vandemore -- Chief Financial Officer\n\nYeah. I would say relative to 2023 so far, I'm encouraged by what we see. There's certainly some nervousness in the marketplace, which we've spoken about. I think it's also important to keep in mind domestically Q1 of this year, which will be our comp in Q1, domestically next year is a really high bar.\n\nI would say many of our conversations with our partners are very encouraging. As David noted, demand from our Direct-to-Consumer business remains very encouraging. So as I sit here today, I'm actually optimistic that '23, will, certainly, at the very least, be less bad than everybody is talking about. And we see some very encouraging signs across the landscape.\n\nThere are also some big unknowns though. I think, again, the Asia Pacific region is going to be a big unknown for us given how COVID has continued to have an effect on that marketplace. But overall, I would consider our view to be cautiously optimistic and getting more optimistic as we continue to see demand at the consumer level fairly robust for Skechers. On ASPs, you need to be very careful there, because we do have a significant number of foreign exchange mixes in there.\n\nI don't have the number right in front of me, but hundreds of basis points better would have been the ASP increase or not for FX. So as you know, some of our key markets were also those most significantly impacted by negative foreign currency movements. And with nearly 60% of our sales from outside the United States, that FX impact is going to be felt throughout, our key metrics and ASPs were certainly one area. Otherwise, on a constant currency basis, we actually felt pretty good about ASP performance.\n\nAlthough, again, we're still playing a little bit of catch-up on the wholesale side, which we expect to get behind after the fourth quarter.\n\nLaurent Vasilescu -- Exane BNP Paribas -- Analyst\n\nVery clear. Thank you very much, John.\n\nOperator\n\nOur next question is from Alex Straton with Morgan Stanley. Please proceed.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much for taking my question. I wanted to focus on the top line first. So can you guys just talk to us about the sales deceleration you have embedded in the fourth quarter guidance.\n\nIf we're calculating it right, it looks like it's going down to like a 9% three-year CAGR underlying growth rate, and that compares to the first quarter through the third at like a low teens number. we're just having trouble reconciling that against what sounds like super strong demand. So is that just all that -- all FX? Or how should we think about that?\n\nJohn Vandemore -- Chief Financial Officer\n\nThe most significant factor is certainly FX. I think year-on-year, we're losing nearly $100 million of top line revenue on FX. Some of that we had previously anticipated. Some of that we have not.\n\nWe are cautiously evaluating where every market stands relative to kind of the macroeconomic climate. Probably the few big swing factors in there for us are where does FX go from here? How does China evolve over the course of the quarter? And how much volatility is in that market because of COVID? One of the other markets that, obviously, for us has historically been very key, but has some of its own challenges. This past quarter was Chile, a very good market, a very robust market for us, normally, undergoing some political and macroeconomic headwinds. So that was a challenge.\n\nAnd then in all honesty, we're cautious about how the supply chain performs. And so we've probably baked in a little bit more than average conservatism there. That being said, I'd say if you look back at this quarter, it's still so hard to replicate the growth that we put up in the face of all the exigencies we faced this quarter. And in all honestly, it could have been even better than that were it not for some of the challenges we felt on supply chain.\n\nSo we feel really, really good about where demand is, and that's why we've said as long as demand stays where it is at, we feel incredibly optimistic about our 2026 objective of $10 billion and more.\n\nDavid Weinberg -- Chief Operating Officer\n\nYeah. I would also point out that the quarter will likely change in its dynamic somewhat. We always have a very big back half of Q4, which is anticipation of spring, which is a lot of spring product that delivers some in the U.S. and significantly more overseas as they transition.\n\nGiven the extent that a lot of wholesale customers are backed up now in their own DCs, I do feel that they will take some more in the first quarter than the fourth quarter, because they won't be able to transition into their new season quite as quickly as in the past, just given their own inventory holdings. So should that dynamic change, it could also change some of the dynamics in the fourth quarter.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question is from Gaby Carbone with Deutsche Bank. Please proceed.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nHi, good afternoon, thanks for taking our question. Just curious if you can maybe just dig in on the health of the U.S. consumer a little more. What you're seeing now maybe versus a few months ago? I mean you're obviously experiencing very good demand.\n\nAnd any changes to note in consumer spending behavior?\n\nJohn Vandemore -- Chief Financial Officer\n\nThe only thing I'd note, honestly, Gaby, is what we've mentioned for really the last couple of months, which is that the data does not reveal to us at least a significant slowdown in consumers' willingness to spend on the Skechers brand. We felt like this quarter was potentially prone to some risks on the consumer side and none of that materialized. In fact, I would characterize our outperformance on the domestic -- consumer side, in particular, as really, really strong, particularly in e-commerce, but really across the board. And then as David mentioned, early signals from Q4 also very positive.\n\nSo I would say we're continuing to see strength across at least our brands and within the gender profiles of our brand, and really haven't detected any meaningful change, which is to say things continue to remain very encouraging.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nThank you for that. And then just a quick follow-up. It sounds like you really aren't seeing any pressure from the increasing promotional environment. Is that a fair statement?\n\nJohn Vandemore -- Chief Financial Officer\n\nWell, as David puts it. Absolutes never really work well in business because it's never absolutely the case one way or the other. We're certainly seeing more promotions in the environment. And we're not going to sit idly by while others promote and be off price significantly.\n\nBut I wouldn't characterize it as a significant level of promotionality. So we are offering promotions in a targeted way. We'll deploy them when we feel it's appropriate. But what we have seen is that it's also been accompanying very strong demand at the consumer level.\n\nSo it's been effective. And it isn't by any extent from our perspective, at least at this stage, extreme or beyond what I would consider to be average.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nAll right. Thank you very much.\n\nOperator\n\nOur next question is from Jim Duffy with Stifel. Please proceed.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nThank you. Hi, David. Hi, John. You mentioned you're working to alleviate supply chain congestion in North America.\n\nDespite those challenges, your wholesale revenue very strong. What's the state of channel inventories? Are they lower than you'd like them to be, just given those challenges? As you work through the throughput issues, is there more channel fill opportunity? Or is the congestion simply just adding logistics costs and channel inventories are in a good place and you're hoping to relieve some of those additional costs?\n\nJohn Vandemore -- Chief Financial Officer\n\nWell, Jim, I will give you my perspective, and I'm sure David will share his. I think if you look at wholesale channel inventories right now, and this is -- it's never the same for every single partner, but they generally look pretty stable. If you look back relative to 2019, they're very close to those levels. So there's no extreme buildup or drawdown that we're seeing.\n\nWe are seeing supply chain challenges all the way through the system. So it's not simply in our own distribution. We're also seeing it downstream. And so we know that many of our partners are similarly dealing with some congestion issues.\n\nWe'd like them to have more. And in fact, if you step back and look at Q3, Q3, without congestion, we would have certainly been able to deliver an even more significant domestic wholesale growth. But we also want them to be healthy, and we don't want inventory to start backing up. And to date, that's certainly not what we've seen.\n\nWe continue to see good sell-throughs. We're doing everything we can to make sure we're shipping on time and in full, and that's what gave rise to some of the costs that we talked about. But we also need to be cognizant of the fact that our partners need to be able to ingest that inventory.\n\nDavid Weinberg -- Chief Operating Officer\n\nYeah, I think that's true. We don't talk in terms of anybody with having too little inventory, certainly in our industry. I think to our benefit and what we feel good about is that when space is made available, whether it's by a promotional cadence or sales in general, as things open up, we are one of the first calls to deliver the next inventory, because our stuff does so well at wholesale and for their own retail. So I think we're checking well, which gives us an opening -- to any openings for inventory and open to buys and open to ship, which is just as important nowadays.\n\nSo I think keeping in high demand is a key for us. So we have the inventory. We've taken it in early just so we'll be available to all our customers. And as they sell down, we're certainly moving it very quickly to them.\n\nSo we could actually pick up the pace should sales continue to be strong through the fourth quarter.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nGot it. And then, John, the incremental $50 million of expense you identified for the third quarter. If I understand you correctly, that's in addition to the higher trans-ocean rates on a year-to-year basis?\n\nJohn Vandemore -- Chief Financial Officer\n\nYeah. Unfortunately, yes, that's purely dealing with on-hand inventories once product has landed.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nGot it. OK. And any thoughts on what that figure might be for the fourth quarter? I'm trying to put my arms around what is the potential recapture opportunities hopefully, someday soon we get back to a more normalized environment.\n\nJohn Vandemore -- Chief Financial Officer\n\nWell, I'll tell you, we are certainly making that our priority, but it's also important to make sure that we're delivering to customers, and we're honoring our commitments to get them the product that they need to sell through to survive. So we're trying to balance those two. I don't want to give specifics, but I would say we certainly expect a lesser impact in Q4 than we had in Q3, because so far, we view Q3 as kind of the epitome of the congestion issues, but it's still going to be a material impact. And as I noted in response to Laurent's comment, it's certainly one of the factors that's causing our change in guidance, because we want to make sure we've adequately incorporated that into our expected results.\n\nBut I assure you, we're going to do everything we can to minimize that while honoring our commitments to customers to get them the goods they need, particularly in this holiday season.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\n[Operator instructions] Our next question is from Omar Saad with Evercore ISI. Please proceed.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nGood afternoon. Thanks for taking my question. Most of them have been answered. I was hoping though, you could dive in on the strong DTC trends, maybe separate out e-comm versus stores, what you're seeing there? Is that kind of uniform to -- across markets? And then I have one follow-up.\n\nThanks.\n\nJohn Vandemore -- Chief Financial Officer\n\nYeah. I would say not uniform across markets. We definitely saw outsized growth on the digital side of things. But again, as you've heard us say before, we think those are very tightly integrated at the consumer level.\n\nIt's also not a fair comparison, because as David noted, this year, we are in the process of lighting up markets with an online Direct-to-Consumer offering that we've never had before. So in many markets, that's -- it's an unfair comparison. What I would say is it's apparent to us that the Skechers brand remains in demand at the consumer level. We're seeing that in stores.\n\nWe're seeing that really across store formats, which is something we haven't seen in a while, which is very encouraging. And we're seeing it in nearly every market. Again, the one drawback on the Direct-to-Consumer side of things would have been in China, which is just facing some difficult conditions as we noted. At one point, we had nearly 10% of our stores shuttered because of COVID.\n\nSo that market is simply struggling to cope with the dynamics of COVID. But overall, we definitely were pleased with what we saw in-store, online, in the communion between those two. And it continues in the early part of this period to show similar trends, which we're excited to see.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nGot it. Could you actually elaborate on that comment you just made about putting in some products that you've never had before into the DTC channel, maybe a little bit more what you're talking about there?\n\nJohn Vandemore -- Chief Financial Officer\n\nWell, I'm sorry, it's not product. It's actually lighting up sites that we haven't had before. So just if you look to last year in the same quarter, we did not have sites in Belgium, France, Italy, the Netherlands, Poland, Spain -- Spain we had one, but Switzerland. So again, we've been on this road map of launching our Direct-to-Consumer online offering.\n\nAnd so we're getting to a Direct-to-Consumer online relationship with many consumers in these markets that we've never had the ability to perform in before, and that's very encouraging.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nAnd then quickly, John, any product trends or category shifts to call out as we kind of return to come out of COVID and the lockdown kind of lifestyle. Are you seeing any shifts in your business, certain parts of the -- certain categories of footwear outperforming and underperforming?\n\nJohn Vandemore -- Chief Financial Officer\n\nNo shifts really, but I say that with an incredibly encouraging backdrop in that, we've seen comfort and Casual continue to resonate strongly. We think consumers are very much appreciating our focus on those two domains. In particular, it evidences itself in the uptake they have for our new technologies. When we put them into the marketplace where they've received very strong demand.\n\nI'd say the only notable change versus the last couple of years in the third quarter was really saw kids come back in a more meaningful way than we had seen in the previous couple of years, because COVID obviously played with school and school attendance. We saw a much more traditional curvature of demand on the kids side that is associated with back-to-school. And that was refreshing. That was good to see, because it clearly is an indication to us that there's some normalcy returning to the retail cadence of things, which is, in our view, good.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThanks for the color. Good luck for holiday.\n\nJohn Vandemore -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question is from Tom Nikic with Wedbush Securities. Please proceed.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nHey guys, thanks for taking my question. I was hoping -- can you give us a little bit more color around Q4, like gross margin versus SG&A? I mean it kind of seems like to get to your guidance given where the revenues are going to be, it seems like either gross margin has to get a lot better or the year-over-year growth rate for opex needs to slow pretty dramatically. I know you said, I think, sequential improvement in gross margins. But like is there any more color you could give us there? Like gross margins up year over year, down year over year a little bit? Like I guess any help there would be helpful.\n\nThanks.\n\nJohn Vandemore -- Chief Financial Officer\n\nSure. Although, I'll note, Tom, there's no reason we couldn't achieve both. But I would say in terms of the plan that we've given you, our goal for the entirety of this year has been to catch up on the gross margin side and our objective is certainly to do that this quarter. Now we may not make it 100% or we may get close, maybe a little bit better than that.\n\nBut I would guide toward a gross margin that's very close to or on top of prior year. That's been the objective of the pricing that we installed previous in the year and how we've gone about pricing in our Direct-to-Consumer channel as well. And so that's probably the one improvement that is key to understanding our guidance. We have, as we said, incorporated some excess costs from supply chain similar to this quarter to incorporate what we know about how the supply chain is expected to behave.\n\nWe'll have to see how things evolve to determine whether or not that's too much or too little. But right now, we think we've been appropriately conservative in incorporating those costs into our expectations for Q4.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nGot it. OK. And if I could just ask one more question on China. Obviously, that's been a tough market and it sounds like one of -- or maybe two of your really big competitors are still struggling there and you all talked about really challenging market conditions.\n\nI mean I guess just kind of like how do you sort of see the recovery in China progressing? Like -- I mean do we think like your China business is up next year? Or like -- just any help around China would be great.\n\nJohn Vandemore -- Chief Financial Officer\n\nWell, let me say first about this year. I mean, I still think Skechers is performing better than almost any other Western brand in that market. The decline we spoke about in Q3, it's important to note that that has a very heavy influence from FX. You almost take 600 basis points out of that just on FX alone.\n\nSo if you look at it on a constant currency basis, the market, I think they held up really well. If you take a deeper slice of that, e-com was nearly flat, and that's one of the most significant channels for us there. So that was great. Obviously, stores not being open inhibits their ability to sell and transact.\n\nConsumers not being able to be in malls and out shopping, severely inhibits our ability to convert there, and that was the drag in the quarter. We're cautiously optimistic that Q4 will be better, and Q1 will be better after that. It's certainly a longer recovery path than we had originally expected. But I see no reason why next year can't put us right back into the track we've been on in China, which is a fairly sizable growth path now.\n\nThat's all subject to what happens with COVID and political environments being what they are. So you have to take that with a fairly heavy caveat. But in terms of the base business, demand for the brand, the product resonance, we feel really good about all those things we can control. And I think our team there is doing as good a job as anyone navigating that.\n\nAnd that's why, at least in terms of the Western brands, we feel like we continue to outperform. We certainly haven't seen some of the more drastic impacts that others spoke about very recently, and we're encouraged by that.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nUnderstood. Thanks John, and good luck this holiday season.\n\nJohn Vandemore -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nOur next question is from John Kernan with Cowen and Company. Please proceed.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nGood afternoon. Thanks for taking my question. John, $1.8 billion in inventory on the balance sheet at the end of Q3, it's up about $800 million from where it was in 2009. I think 2019, I think sales were up about $500 million from the same quarter.\n\nWhen do we think inventory dollar trends come down more in line with sales trends? Is it the first half of next year? When does inventory peak on the balance sheet?\n\nJohn Vandemore -- Chief Financial Officer\n\nWell, I mean, that's difficult to say. I think it's important to keep in mind that a portion of that inventory build is purely cost based, right? You can't incur the type of freight escalation and logistics escalation we've had over the last year without it impacting your on-hand balances, because it just flows through that way. I would say, if we think about it from a unit perspective, which is a more modest growth than what we saw on the dollar side of it, we do expect things to begin ticking down. Now some of that is going to be contingent upon how the supply chain unfolds.\n\nBecause, again, this is not a situation where inventory backed up, because of a lack of demand. That's definitely not the situation we're in. And so it really has to do with logistics and timing, all the things that we've had a very tough time predicting well over the last couple of years. So again, we prefer it to be lower than it is.\n\nWe would prefer to have put less into working capital over the last year than we have. But by the same token, we want to make sure we have the product available to meet consumer needs. And I would expect it to get better or to be -- those two relationships come better in the line over the course of this year. But in terms of the exact timing, that's too contingent upon how the supply chain performs for me to give you an educated guess.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nSure. And certainly, the whole sector seems to be in a similar position. I guess you brought up the point that a lot of it, the increase is cost base, how does this affect gross margin as this comes off the balance sheet and onto the income statement into Q4 and the first half of next year?\n\nJohn Vandemore -- Chief Financial Officer\n\nWell, I mean, it's already in the effects we've been seeing on the gross margin side of things. Again, the inventory turns over relatively quickly in the context of our overall sales performance. So we think it's incorporated into both the costing that is underpinning our guidance, but also the pricing actions we've already taken to offset that that we expect to materialize in the quarter. So again, I think we're going to be dealing with this inventory costed at this level for at least another quarter and a half, but our expectation is, both in terms of what we're seeing on freight and logistics rates coming down, as well as selling through the inventory that we have, that it will remedy itself over time.\n\nThe counterpoint I just mentioned against that, because we've often said this is, we're not looking for a windfall on gross margins. We're looking to make sure we protect our gross margins. So while we'll try to capture as much of that as we can, if promotionality comes back or there's changes on the pricing horizon, we'll have to be flexible about that going forward. Because it's important to keep in mind that we've got to be true to our goal of being a good price for the value we offer, and that's going to be important.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nVery helpful. Thanks, guys.\n\nJohn Vandemore -- Chief Financial Officer\n\nThanks, John.\n\nOperator\n\nOur next question is from Sam Poser with Williams Trading. Please proceed.\n\nSam Poser -- Williams Trading -- Analyst\n\nGood evening. Thanks for taking my questions. I want to just go back to the G&A, please. And with $600 million in G&A in the quarter, $603 million, is that really -- I mean, is that sort of a top kind of number? I mean -- or is this a number that could go to -- it was up $100 million from last year.\n\nIs that a number that could be up -- we could be looking at $650 in Q4? Or is this something where like that $600 million, maybe a little bit higher is sort of how to think about it, sort of more in absolute terms?\n\nJohn Vandemore -- Chief Financial Officer\n\nYeah. I think the first thing I'd note is within that $600 million you mentioned is the supply chain costs that we've mentioned, that $50 million we quantified. So we definitely don't view that as ordinary course G&A. The second is we don't really think about it in dollar terms, because that doesn't equate with how that G&A performs, particularly the volume oriented.\n\nWhat I would point out is, believe it or not, even with that $50 million of excess costs in there, G&A as a percentage of sales actually levered year over year. And that's how we tend to think about it. There's a piece of G&A that is stable. It reflects just the natural operations of the business, the corporate environment, design, development, etc.\n\nBut then there's also a piece that is very volume-influenced. And then in this quarter, as we mentioned, there was that $50 million that was in excess of what we would have normally expected. So I think if you kind of use those parameters, you'd understand that it should be in line with the sales performance, but also in this quarter, that relative measure that sales -- G&A as a percentage of sales was aggravated by that $50 million.\n\nSam Poser -- Williams Trading -- Analyst\n\nGotcha. Thank you. And then I've got two more. One, what is your optimum forward weeks of supply back of pre-COVID running around average like 15 right now, you're running around over 20.\n\nAnd so I don't -- I'm not really thinking about it on a year-over-year basis, I'm more thinking about it if it's settling down. And then that leads me to the last part of my question regarding timing of orders -- timing of your orders. And it spanning in December, will you be taking orders for like back to that four to four and a half month window there or are you taking it further out and then allowing some of it to flow through from what's already here and what's still coming, I guess, based on when you took orders recently for spring?\n\nDavid Weinberg -- Chief Operating Officer\n\nSam, I think those both run together. We're going to be more reactive as we -- and as reactive as we can be to what happens in the supply chain. If we could get back to four months with the confidence that it'll be here on time, so we can deliver on time, we will certainly push toward that direction as we get through the end of the year. Right now, there are some different issues as far as the supply chain is concerned, even though container costs are coming down, they're coming down because the demand for space has come down so dramatically that sailings have been canceled, moved around, and it does increase to what we feel a comfort factor would be for time in transit.\n\nSo to the extent we get more back to normal, we'll be going more hand to mouth, so that we can calculate the type of on-hand inventory and the turns that you were talking about before, if we can get a real solid handle on the transit times.\n\nSam Poser -- Williams Trading -- Analyst\n\nOK. And then with your backup, I mean, with the congestion at the DCs and getting the expansion to the U.S. DC and the other DCs up and going. I mean is this something we really should be thinking about that like these incremental costs are going to continue through the first quarter of next year.\n\nAnd that's when they should -- if they're going to ease up, that's when we should think about at the earliest they're really going to start easing just given the way everything is happening right now and the timing of getting everything you have in sort of internally up and running?\n\nDavid Weinberg -- Chief Operating Officer\n\nWell, I'm more an optimist and a hopeful person than John. He's more a numbers guy. So I will tell you, my perspective is that they start to come down. The question is the rate they start to come down.\n\nThe way I think about it is when things started to open up as far as the port was concerned, we started to receive inventory from the port at a rate more than double of our peak at any time since those places were open. Going through all that and having received all that inventory, and I hope inventory very close to a peak here. But even if it's not at a peak, which I believe it is, it's the flow through. So in other words, we won't be receiving given our buying patterns, no matter what, unless a significant extreme change, and the supply chain comes in and we won't be receiving inventory at that rate.\n\nSo that's one expense that goes away and looking for additional space and trying to move it out and just unload all those containers for somewhat efficiencies. And we've already got those under our belt. So if anything, we will not be looking for more space. We will not be expanding.\n\nWe will get rid of the excess cost of the new part of the distribution center, which is not a storage facility for the most part, but it's an operational facility. So while we're training on it and getting up and going, we have duplicate costs. So hopefully, by the end of the year, early part of next year, a significant piece of those costs go away. So if you think about not paying overtime, not trying to work all of seven days a week to receive all those shoes and ship the maximum amount we can.\n\nI do believe we're coming into a more efficient use of the distribution center. And that would include here the U.S. and parts of South America, where we're expanding, assuming we can get all the equipment in. There's still some final touches both in South America and here in the U.S.\n\nthat are waiting for our builders and our installers to get final pieces to get it done, so we can move this along. Under normal circumstances, we would have done in the U.S. last December or January, a big piece of that was they were running late, because of the supply chain. Their own supply chain and their own personnel issues to bring stuff in to be installed.\n\nAnd then we stalled back because we had all that stuff to receive and try to get out the door and hire a significant amount of people, people weren't as available. So right now, we don't feel we need any more, certainly not a significant amount of people. We will be reducing overtime. We won't be receiving that much.\n\nSo I think we're getting to a much more steady stream of product, and it should start to flow through the G&A as we move through this year and into next quarter.\n\nOperator\n\nOur final question is from Rick Patel with Raymond James. Please proceed.\n\nRick Patel -- Raymond James -- Analyst\n\nThank you and good afternoon, everyone. Can you talk about the underlying trends in Europe? It seems performance there was really strong in the third quarter on better product availability versus last year. But just given some of the macro headlines that we've been seeing across Europe and the U.K. in particular, I'm curious if you're seeing any changes in the way that wholesale accounts or consumers are behaving in Europe versus what you were seeing about three months ago?\n\nDavid Weinberg -- Chief Operating Officer\n\nObviously, it's up. We've had a great quarter. So that's what we saw, and nothing has changed in October. And nothing has changed anecdotically with our meetings with some of our larger accounts as to what their needs are and what -- how we're selling through and how they feel about their order backlog.\n\nSo while we, as everybody else, read the headlines and see what's going on in some of them. For our particular case and the particular product offerings we have there and the stuff we're delivering, we continue through current time in October, as we did both for the last quarter.\n\nJohn Vandemore -- Chief Financial Officer\n\nYeah. I would just add to that, Rick. I mean keep in mind as well that the numbers we spoke about in kind of our EMEA and Europe, region were also severely impacted by foreign currency. So they were significantly better even than as reported on a constant currency basis.\n\nSo I think we continue to see good trends for our brand in Europe. There's obviously a lot of concern in that market over the macroeconomic environment. But so far, we have yet to see that meaningfully materialize in our business, either on the wholesale side or on the Direct-to-Consumer side when taken as a whole.\n\nRick Patel -- Raymond James -- Analyst\n\nI appreciate it. Good luck this holiday.\n\nDavid Weinberg -- Chief Operating Officer\n\nThanks.\n\nJohn Vandemore -- Chief Financial Officer\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nUnknown speaker\n\nDavid Weinberg -- Chief Operating Officer\n\nJohn Vandemore -- Chief Financial Officer\n\nJay Sole -- UBS -- Analyst\n\nLaurent Vasilescu -- Exane BNP Paribas -- Analyst\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nOmar Saad -- Evercore ISI -- Analyst\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nSam Poser -- Williams Trading -- Analyst\n\nRick Patel -- Raymond James -- Analyst\n\nMore SKX analysis\n\nAll earnings call transcripts"
}