{
  "companyName": "Stratasys",
  "companyTicker": "SSYS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/stratasys-ssys-q3-2022-earnings-call-transcript/",
  "content": "Stratasys (SSYS 2.95%)\nQ3 2022 Earnings Call\nNov 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to today's conference call to discuss Stratasys' third quarter 2022 financial results. My name is Donna, and I'm your operator for today's call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation.\n\n[Operator instructions] I'd now like to turn the call over to Yonah Lloyd, chief communications officer and vice president of investor relations for Stratasys. Thank you. Mr. Lloyd, please go ahead.\n\nYonah Lloyd -- Chief Communications Officer and Vice President of Investor Relations\n\nGood morning, everyone, and thank you for joining us to discuss our 2022 third quarter financial results. On the call with us today are our CEO, Dr. Yoav Zeif; and our CFO, Eitan Zamir. I would like to remind you that access to today's call, including the slide presentation, is available online at the web address provided in our press release.\n\nIn addition, a replay of today's call, including access to the presentation, will also be available and can be accessed through the investor relations section of our website. Please note that some of the information you will hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding our expectations as to our future revenue, gross margin, operating expenses, taxes, and other future financial performance and our expectations for our business outlook. All statements that speak to future performance, events, expectations, or results are forward-looking statements. Actual results or trends could differ materially from our forecast.\n\nFor risks that could cause actual results to be materially different from those set forth in forward-looking statements, please refer to the risk factors discussed or referenced in Stratasys' annual report on Form 20-F for the 2021 year. Please also refer to our operating and financial review and prospects for 2021 and for the third quarter of 2022, which are included as Item 5 of our annual report on Form 20-F for 2021 and in Exhibit 99.2 to the report on Form 6-K that we are furnishing to the SEC today, respectively. Please also see the press release that announces our earnings for the third quarter of 2022, which is attached as Exhibit 99.1 to a separate report on Form 6-K that we are furnishing to the SEC today. Our reports on Form 6-K that we furnished to the SEC on a quarterly basis and throughout the year, provide updated current information regarding our operating results and material developments concerning our company.\n\nStratasys assumes no obligation to update any forward-looking statements or information, which speak as of their respective dates. As in previous quarters, today's call will include GAAP and non-GAAP financial measures. The non-GAAP financial measures should be read in combination with our GAAP metrics to evaluate our performance. Non-GAAP to GAAP reconciliations are provided in tables in our slide presentation and today's press release.\n\nI will now turn the call over to our chief executive officer, Dr. Yoav Zeif. Yoav?\n\nYoav Zeif -- Chief Executive Officer\n\nThank you, Yonah. Good morning, everyone and thank you for joining us. Our results this quarter demonstrate the ongoing solid business performance and fiscal health of Stratasys. We delivered our highest third quarter revenue in seven years, as well as five consecutive quarters of positive earnings, demonstrating our unique capabilities to generate profitable growth, and we believe we can continue generating sustained operating profitability for the foreseeable future, assuming no further material deterioration of the broader economic environment.\n\nIt is a compelling time to be a leader in 3D printing. In fact, many of the challenges facing our target industries today, are the same factors that ultimately justify accelerating the transition from traditional to additive manufacturing. This includes the ability to adapt rapidly and cost effectively to logistics bottlenecks, higher transportation costs, new sustainability requirements and faster product innovation times. Stratasys continues to expand our customer reach across our technologies and our vision of the future of additive manufacturing is more robust than ever.\n\nWe continue to have strong engagement with both our installed base and new customers for our leading FDM and PolyJet offering, as well as our three newer technologies. However, the opportunities that we have, also come with some obstacles in the current macro space. Customers are facing challenges today that are impacting their purchasing behavior. The market has slowed, resulting in longer sales cycles and occasional deferral of orders.\n\nTo that point, we remain laser-focused on controlling what we can to be best positioned to effectively execute sustained profitable growth. Importantly, we have a broad global diverse set of offerings across a multitude of systems and materials. The steady contributions from our organic technologies and the incremental revenues from our new technologies enable us to deliver consistent growth with improving margins. We also enhanced our results through a relentless focus on costs.\n\nWe are tightly managing our cost structure as evidenced by the ongoing improved efficiency in our opex spending, reflected in the year-over-year 130 basis points improvement this quarter in opex as a percentage of revenue. We expect to continue finding efficiencies in the business to further demonstrate the resiliency of our model. As a reminder, our main OEM business is to deliver polymer-based 3D printing solutions through hardware, materials, software, and services, with a focus on shifting more of our revenues from prototyping to manufacturing. Revenue in our OEM business, this quarter, was up approximately 10% year over year at constant currency.\n\nOverall, revenues were up 7.8%, excluding divestitures and on a constant-currency basis, driven by our highest third quarter system revenue in six years, which grew 18.9% adjusted for FX and divestiture compared to the third quarter of 2021. We believe that the contribution from our new technologies, SaaS, P3, and Neo, has more than doubled our addressable market and opened up new use cases and opportunities to replace traditional manufacturing across verticals. We are expanding and improving our line of FDM systems and materials, as well as starting to see the positive progress on P3 and SaaS, our more recently launched mass production solution. FDM delivered solid growth this quarter and is still the largest technology in 3D printing today.\n\nA recent proof point of the continued demand for FDM is a repeat sale this third quarter to a global automotive OEM for more of our industrial manufacturing grade F900 system. Furthermore, to fund additional growth, we ended the quarter with a strong balance sheet that includes no debt -- this continues to support our growth through organic investments, as well as accretive acquisition opportunities that we uncover, including early stage but highly compelling technology-driven businesses that we believe will contribute to our growth by leveraging our infrastructure. Now, let me turn to some of the exciting achievements and milestones reached since the end of the first half of 2022. We believe that a comprehensive materials offering that competes with and even improves on traditional manufacturing is key for taking 3D printing into true production applications.\n\nWe are very excited to update you about our progress on this material journey across all of our technologies. In August, we agreed to acquire Covestro's additive manufacturing materials business, which includes R&D facilities and activities, global development and sales teams across Europe, the U.S., China, a portfolio of 60 additive manufacturing materials, and an extensive IP portfolio. With hundreds of patents and patents pending, Covestro is an example of a business we believe can thrive as it leverages our infrastructure and relationships. It has been an important part of our third-party materials ecosystem, as we are already a distributor of their Somos resins that are available for use in our Neo and Origin One 3D printers.\n\nAdding this business to the Stratasys portfolio provides us ability to offer more complete solutions to customers, accelerate next-generation material development and expand our already differentiated materials offering in terms of lithography, DLP resins, and powders. Closing remains on track for the end of the first quarter of 2023 and is expected to be immediately accretive. For FDM, we announced availability of 13 new validated materials and our open AM software. This includes several materials from Covestro and partners like Victrex and Kimya, it also includes several existing materials now available in new colors.\n\nFor materials like ULTEM 9085 thermoplastic, this is significant, because it makes it easier for our customers to use 3D printed production parts in more customer-facing applications, where static matters such as in commercial aircraft and train and car interiors. These 13 materials represent a tremendous acceleration in the pace of new materials innovation for FDM, opening up new applications far faster than ever before. We also introduced two new validated industrial materials for the Origin One printer in the quarter. P3 Stretch 475 is a new resin from our partner, Henkel Loctite that adds a softer elastomer to our portfolio, which our customers have requested.\n\nFor example, we have a large automotive customer that has been using the material for end-use door seals. In addition, we introduced P3 Deflect 120, which is our first validated material for Evonik. P3 Deflect 120 is designed to stay strong at high temperatures ideal for applications like molds in manufacturing. We are also excited to have reached key milestones in the dental industry which is the largest manufacturing target market in 3D printing today in terms of the amount of materials consumed, and it continues to grow.\n\nI'm happy to share that Stratasys has recently received FDA 510(k) approval of a new revolutionary resin for our J5 DentaJet that we believe will be a disruptive growth driver for us in the dental industry. 3D printing of dental is particularly exciting as it is only in its ground floor stage. It is a $5 billion addressable market today and growing, and we plan to take a meaningful share over time. We are currently working with several leading industry partners to prepare for its commercialization and look forward to officially launching the solution at LMT Lab Day in Chicago at the end of this coming February.\n\nThis is a great example of how we are expanding the PolyJet end market universe, and believe that it has a promising future for non-prototype and use parts in medical, dental, and fashion applications. In addition to these strategic initiatives, we invested in one company and acquired another that will enhance our capabilities in the area of artificial intelligence for 3D printing. Both reflect our strategic plan to incubate innovative technologies by bringing them under our umbrella, cultivating their advancement, and positioning them to contribute to our overall long-term growth, and both will be available to our customers in 2023. First, we invested $10 million out of $15 million raised by medtech start-up, Axial3D.\n\nAxial3D AI-powered cloud-based 3D printing platform enables healthcare providers to easily segment CT and MRI scans for anatomic models at a fraction of the cost and time of other solutions. 3D printed model created with our digital anatomy and J5 MediJet systems are used for pre-surgical planning in many leading hospitals to improve surgery success rates and patient recovery time. We are now working with Axial3D on a joint offering that we believe will remove barriers to entry for the majority of hospitals in many of our key markets, allowing our solution to truly become a standard part of patient care. We look forward to sharing more at the upcoming RSNA trade show later this year.\n\nSecond, we acquired Riven, a cloud-based software company for additive manufacturing. We know Riven well, having watched them grow as one of our connectivity partners. Their cloud-based solution will be fully integrated into our GrabCAD additive manufacturing platform. Riven Technology helps customers weekly inspect, diagnose, and automatically correct deviations between CAD5 and actual printed parts within a closed-loop additive manufacturing process.\n\nThis means -- every step in the process is interconnected from inspection to diagnosis to correction. The latest version in testing uses artificial intelligence to actually predict and readjust model changes in advance. The result is more accurate production runs in much less time, weeks or even months of potential improvement, and at a lower cost; key areas for focus for the manufacturing industry. These are just two examples of companies joining our platform that we believe will help drive our innovation vision forward.\n\nTo sum up, we are laying meaningful foundation for further growth, and we are proud of the expansion of our capabilities this quarter through new technologies and materials that will drive our industry leadership for the long term. I will now turn the call over to our CFO, Eitan Zamir, to share the financial results and update our outlook for the rest of 2022. Eitan?\n\nEitan Zamir -- Chief Financial Officer\n\nThank you, Yoav, and good morning, everyone. We achieved solid results against an increasingly challenging backdrop in the quarter. And as we've shared, growth within our OEM business was even stronger, up almost 10% and on a constant currency as compared to the third quarter of 2021. We are particularly proud of the improvement in opex as a percent of revenue, which shows the progress that we are making on driving efficiencies across the platform.\n\nIn general, our results demonstrate the resilience our diversified offering provides. Now, let me dive deeper into the numbers. For the third quarter, consolidated revenue of $162.2 million was up 2%, and revenue adjusted for divestitures and at constant currency was up 7.8% from the prior-year period. Product revenue in the third quarter rose by 3% and to $112.1 million compared to the same period last year or by 10.5%, excluding divestitures and on a constant-currency basis.\n\nWithin product revenue, system revenue grew by 7.7% to $56.3 million compared to the same period last year, and increased by 18.9%, excluding divestitures, and on a constant-currency basis. Consumable revenue declined by 1.4% to $55.8 million compared to the same period last year, but grew by 3.4%, excluding divestitures, and on a constant-currency basis. Aside from FX and MakerBot, consumable spending was impacted by the general slowdown in the market, especially for materials used for P3. Additionally, there is a natural lead time between hardware purchases and consumables.\n\nAnd given the lower hardware sales for the five years prior to 2021, it takes time for our installed base to drive sales back to the level before that time period. The good news is now that hardware sales have been growing again, we expect consumables to grow steadily beginning next quarter and beyond. Service revenue was $50.1 million, down 4.1% as compared to the same period last year, and up by 2.1%, excluding divestitures on a constant-currency basis. Within service revenue, customer support revenue grew 4.7% compared to the same period last year, and increased by 9% on a constant-currency basis.\n\nNow turning to gross margin, GAAP gross margin was 43.6% for the quarter, compared to 42.9% for the same period last year. Non-GAAP gross margin was 48.5% for the quarter, compared to 48.2% for the same period last year. Gross margins benefited from operational efficiencies and the divestment of MakerBot during the quarter partially offset by the FX impact. GAAP operating expenses were $86.4 million, compared to $90.1 million during the same period last year.\n\nNon-GAAP operating expenses were $74.2 million, compared to $74.9 million during the same period last year. Non-GAAP operating expenses were 45.8% of revenue for the quarter, compared to 47.1% for the same period last year, as we continue to focus on operational efficiency improvement. Last quarter, we noted that the incremental revenue came with an implied cost of only 25%, an improvement from 35% in the Q1 period. This quarter, we are pleased to note an improved efficiency of our model, where the additional operating expenses were actually negative instead of the historical range in the mid-to-high 40%, clearly a driver of the improved margin profile.\n\nRegarding our consolidated earnings, operating loss for the quarter was $15.6 million, compared to a loss of $21.9 million for the same period last year. Non-GAAP operating income for the quarter was $4.5 million, compared to $1.8 million for the same period last year. The increase reflects our business scalability and improves operational efficiency which once again resulted in gross margin growth and lower operating expenses. GAAP net income for the quarter was $18.7 million or $0.28 per diluted share, compared to a net loss of $18.1 million or $0.28 per diluted share for the same period last year.\n\nGAAP net income included $39.1 million gain from the deconsolidation of MakerBot. Non-GAAP net income for the quarter was $3.3 million, or $0.05 per diluted share, compared to a net income of $0.5 million or $0.01 per diluted share in the same period last year. Adjusted EBITDA of $9.9 million compared to $7.8 million in the same period last year reflected our improved profitability level. We used $18.4 million of cash in our operations during the third quarter, compared to generating $3 million of cash from operations in the same quarter last year.\n\nThe use of cash was primarily driven by deliberately increased inventory purchases. We ended the quarter with $349 million in cash, cash equivalents, and short-term deposits compared to $441.5 million at the end of the second quarter of 2022. During the quarter, we used cash to make investments in companies that we believe will help further advance our strategic goal. Our balance sheet and cash generation profile remain strong, and we are well-funded and well-positioned to capitalize on value-enhancing market opportunities as they are identified.\n\nNow, let me turn to our outlook for 2022. I would note that our guidance now excludes any further contributions from MakerBot as the merger with Ultimaker is now closed. As Yoav described earlier, market conditions have become more challenging since our last update, and currency exchange rates continue to pressure the business. We believe this challenging backdrop will continue for the balance of the year and well into next, primarily affecting our prototyping business.\n\nThe impacts include delayed purchases of systems and materials, longer sales cycle, and overall inflationary and recessionary concerns reflected in buyers' behavior. Given our year-to-date results and current visibility of our end market, we are updating our full year revenue guidance as follows. Our previous guidance was provided before the MakerBot divestiture closed. MakerBot divestiture reduces our guidance by $17 million, bringing us to $658 million to $668 million.\n\nIn addition to MakerBot divestiture, we are further updating our guidance to $648 million to $652 million as we are impacted by delays in purchasing activities by our customers and continuing FX challenges. The new guidance represents approximately 10% full year growth over 2021 after adjusting for the MakerBot divestiture. From a gross margin perspective, we continue to expect full year 2022 to be flat to slightly higher as compared to 2021. As a reminder, we expect our margins to get back over 50% and once the current macro headwinds pass.\n\nIn 2022, we now expect our operating expenses to be approximately $5 million to $10 million higher than 2021. This improvement from previous guidance is primarily due to the impact of the MakerBot divestiture and improved opex efficiency. We continue to expect non-GAAP operating margins to be slightly above 2% for the full year. Longer term, we expect non-GAAP operating margin to achieve double-digit as our growth plan unfolds.\n\nWe now anticipate a GAAP net loss of $48 million to $39 million or $0.72 to $0.59 per diluted share and non-GAAP net income to $6 million to $8 million or $0.09 to $0.12 per diluted share. Adjusted EBITDA is now expected to be in the range of $34 million to $37 million down from $38 million to $41 million. Capital expenditures are now expected to range between $15 million to $20 million, down from $20 million to $25 million. We're encouraged by the level of engagement with our customers and remain confident in our growth potential, and we will continue to monitor global issues that can have an impact.\n\nWith that, let me turn the call back over to Yoav for closing remarks. Yoav?\n\nYoav Zeif -- Chief Executive Officer\n\nThank you, Eitan. The challenges our customers and our business face today, in many ways, highlight the benefits of additive manufacturing going forward, resulting in confidence for the years ahead even as we navigate the current environment. With our robust balance sheet, we continue to invest in an expanded portfolio of hardware, materials, and software solutions that should allow us to meaningfully increase our set of applications to capture a wider range of customers, a development and adoption of 3D printing growth, and we drive additive manufacturing to scale. I want to thank our global teams for rising to the challenge and helping drive continued profitability as our business continues to grow.\n\nThe relentless focus on execution and investment for growth and ongoing profitability today is expected to drive outperformance and create long-term shareholder value. With that, let's open it up for questions. Operator?\n\nOperator\n\nThank you. The floor is now open for questions. [Operator instructions] The first question today is coming from Shannon Cross of Credit Suisse. Please go ahead.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you very much. I was wondering if you can just provide some more color on what your customers are saying in terms of both geographic, as well as the size and vertical of customers in terms of the selling of purchases, but also where people are looking at investing, how customers are thinking about 2023 budgets in terms of capex. Maybe timing of deferred purchases. Do they expect that will come back fairly quickly, or is this a longtime deferred kind of decision? Just whatever you can do to, sort of, frame the current outlook from a customer perspective.\n\nAnd then I have a follow-up. Thank you.\n\nEitan Zamir -- Chief Financial Officer\n\nThanks, Shannon. Thank you for the question. Yoav?\n\nYoav Zeif -- Chief Executive Officer\n\nWell, we are optimistic. It's a challenging time, but the good side of challenging times that this crystallized the differentiation. And in those times, the guys that -- or the players that will shine are those that have those long-term relationships with strong installed base and are part of the daily activities of the customers, but also the part of their long-term plan. And in that sense, we're in a great position because we have direct discussion with our customers.\n\nThey are long-term plans. Yes, there are delays. There is an economic global slowdown, no doubt. But it's not that they are going back and said, \"Sorry, we are not interested.\" It's just about the base of adoption, but it exists.\n\nAnd we have a great example from this quarter like what we mentioned, the auto player, the automotive player OEM deal. It's a major deal, which is a continuation for a long-term plan. So, long-term plans are exactly as we envision them with some delay. In terms of -- and geographies, I would say automotive is doing well.\n\nAerospace is gaining some traction, but in a slower pace. Education is doing very well. Defense is doing very well by government. And also, the whole medical, dental is doing quite well.\n\nOf course, there are impacts there -- we see some impact there as well, but they are doing well. In terms of geography. Surprisingly, Europe is doing well, despite the fact that it's in the middle of the war and a lot of pressure on the FX. But in terms of real results, Europe is doing well.\n\nAlso, the U.S., but in all geographies, we see those, I would say, increasing or longer sales cycles.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nGreat. It sounds like you're probably gaining some share in Europe. Can you talk a bit more about the gross margin? What the drivers are? There are obviously many puts and takes between pricing and mix and commodity costs and all of that, if you could talk both on product, as well as materials and maybe lay out a bit more about how you think gross margin will trend. Thank you.\n\nEitan Zamir -- Chief Financial Officer\n\nHI, Shannon, it's Eitan. Thanks for the great question. Starting with the results, as you probably saw, we improved our gross margin from Q3 2021, which was 48.2% and 48.5%, which is really a great success in terms of everything that is going on in the world. This improvement, this trend is, we believe, is sustainable.\n\nAgain, we cannot speak about the macro, and we cannot expect exactly how things will go globally. But as far as it's concerned with us, managing our business, managing our operational efficiencies, increasing revenue, which naturally helps to improve gross margin, all these aspects that are within our control, these are things that we're very focused, and you can see the results this quarter. Another thing to add, as we've discussed in previous calls, we've increased deliberately increased our inventory. That helps us to better balance the shipment fee to air and some other aspects that impact gross margin, and it impacts our COGS in a positive way, so we can better manage the logistics and the shipments, and that's something that we've been doing in the last few quarters.\n\nAnd also, this quarter, and that's reflected in the good gross margin results. And we continue the trend -- this trend to -- we plan this trend to continue. Also, taking into account the divestments and other elements is the divestment of MakerBot, which positively impact our gross margin level.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. The next question is coming from Greg Palm of Craig-Hallum. Please go ahead.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nYes. Thanks for taking the questions here. I guess just kind of following up on the last thinking there. I'm just trying to figure out what your actual visibility levels are.\n\nObviously, the last couple of weeks of a quarter or of a year-end are especially important for the business. And so, I guess what I'm trying to figure out, is the reduction in guidance specifically a byproduct of some bigger projects that you think are going to get pushed out, or is it just the expectation that you might not get the same magnitude of a budget flush this year than you would have been in previous years?\n\nEitan Zamir -- Chief Financial Officer\n\nHi Greg. Thank you. We are in a good shape in terms of visibility. Stratasys is a very well-organized company, and we are running forecast and quite accurate one and models, and we're in good shape.\n\nThe last few weeks of the quarter, it's all about unexpected delays. So, this is the situation. So, we have a longer sales cycle. We have a certain amount of delays because some of our customers are saying, \"OK, OK, but I'll take it next quarter.\" So, we baked it all into our model, and we decided that we better be in a safer mode and adjust our plan, and also to balance our inventory to make sure that we are learning quarter by quarter.\n\nBut by this, I would say, longer sales cycles, and therefore, we adjusted the guidance. We don't see that the demand is moving. We just see a longer sales cycle. So, it's relatively a small adjustment, as you can see, which, when you calculate it, it's this uncertainty level that can happen at the end of the quarter in terms of delay.\n\nBut if you take the overall guidance change that we have implemented, it was 7% of our sales. So, it's really smaller jump.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nYes. Understood. And I guess kind of looking forward, if we assume that this environment stays the same or potentially worsen, I guess, what kind of levers do you have internally to sustain this level of profitability? And I guess, under a more challenging macro, are you still comfortable with your double-digit operating margin target looking out a couple of years, or is there a risk that gets pushed?\n\nEitan Zamir -- Chief Financial Officer\n\nYeah.\n\nYoav Zeif -- Chief Executive Officer\n\nOK. Go ahead, Eitan. Go ahead.\n\nEitan Zamir -- Chief Financial Officer\n\nHi, Greg. So, our long-term plan that we've discussed also in previous calls, we still stand behind it. We believe that we have created the right infrastructure to get to the over 50% gross margin and double-digit operating profit in the mid to long term, doubling our addressable market that we've discussed in previous calls by the addition of the new technologies and everything else that we've discussed and we'll discuss today. That puts us -- gives us a lot of confidence on the ability to get to that result with respect to profitability.\n\nNaturally, it is impacted by the revenue growth, but there is a lot on management and building -- on building the right business model that, as you can see in the last few quarters, that works. We managed to remain or to increase our profitability level even in a challenging environment, even with everything that is going on. You can see that this is the fifth consecutive quarter with profit, and the profit actually increased compared to the last few quarters. So that's something that is -- a lot of it is within our control and our focus.\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nOK. Makes sense. Appreciate that. Best of luck.\n\nThanks.\n\nOperator\n\nThank you. The next question is coming from Troy Jensen of Lake Street Capital. Please go ahead.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nHey, gentlemen. First off, congrats on good results here in a tough environment.\n\nYoav Zeif -- Chief Executive Officer\n\nThanks.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nMaybe starting with you -- you're very welcome. I guess, I got a couple of questions on Covestro. So, as you know, a lot of your competitors use the DSM Somos resins in their printers. And I don't think there's too many case studies of competitors, system companies using other system companies material.\n\nSo, I'd just love to know your conviction whether or not you can kind of maintain all of the DSM Somos revenues that are going through your competitors' business models.\n\nEitan Zamir -- Chief Financial Officer\n\nThank you, Troy. It's a great opportunity to share our vision about material. One of the most important obstacles in our journey toward manufacturing is all about materials. Materials today are not sufficient, not in terms of -- mainly in terms of variety, but also in terms of, say, the profile of the material to replace real manufacturing.\n\nAnd here, we are in a journey to transform it. And Covestro is the super important growth engine for us for the future, both in SaaS -- between three technologies: in SaaS, in DLP, and in powder because they have unique talent, know-how, and patents that we will leverage with our new technology. So, this is the big picture. Now to your question.\n\nOf course, we checked it from all possible angles, and we are going to grow this business and there is -- I would even share with you that it's not that there is a retaliation from the customers. On the contrary, the moment Stratasys acquired it, and we have more attention and more knowledge into additive manufacturing, they approach me proactively and want to look for collaboration and doing things together for the long term. So, we're in a good shape there. And you will see that our infrastructure will leverage Covestro both on the material side but also on the hardware side because it's also a driver for hardware.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nAll right. Perfect. Good luck with that. So, my follow-up, I guess, on the new products, I'm always focused on Origin and H350.\n\nI guess my checks always indicate that Origin is really doing extremely well for you guys. H350 may be a little bit more complex sale. I just want to get your thoughts on how those two products are meeting your expectations.\n\nYoav Zeif -- Chief Executive Officer\n\nWe are, like you, monitoring it, but -- on a daily basis. Good traction on both. There is a need in the market for those technologies, which is basic. And we have good technologies with very clear competitive edge in both of them.\n\nBoth technologies are ramping up according to plan. Of course, the ramp-up of Origin is faster, very impressive and faster than SaaS because of the nature of the technology. It's technology that is easier to use when known in the industry where the high-speed sintering, the powder, the new powder, the future of powder is something quite new in our business. And we make sure that the ramp-up of SaaS, which meets our expectations and plans, is a big success.\n\nSo, we ensure that the adoption is being done in the right way and our customers are successful. So, it's controlling and it's going well.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nKeep up the good work, gentlemen.\n\nOperator\n\nThank you. The next question is coming from Brian Drab of William Blair. Please go ahead.\n\nTyler Hutin -- William Blair and Company -- Analyst\n\nHi. This is Tyler Hutin on for Brian. Good morning. Thanks for taking my question.\n\nJust want to start off with the usage rate of your manufacturing machines. And I know, obviously, there's macro headwinds that would play into this. But as the hardware -- as your installed base picks up and you get more usage out of these manufacturing machines, does that give you any more visibility into your gross margin target of 50%? And then I have a follow-up.\n\nYoav Zeif -- Chief Executive Officer\n\nI can answer. Tyler, thank you for the question. We are monitoring the utilization of our system through the connectivity mainly through GrabCAD, and we have a good -- by the way, it's a great dataset for us to understand what's going on in the market. We are not sharing it, but I can give the high-level direction -- in terms of the high-level direction.\n\nPrototyping is more sensitive – or at least what we are seeing. Prototyping is more sensitive to slowdown in terms of utilization. Manufacturing is less sensitive. And overall, in terms of consumption of consumables manufacturing, because it's an ongoing operation, consumed in our, what we call unit economic model, between three to five times than a prototyping.\n\nSo, it's really a transformation in terms of our industry. And of course, it has an impact on the gross margin. I'll let Eitan share it.\n\nEitan Zamir -- Chief Financial Officer\n\nYeah. The utilization of manufacturing materials will definitely have a positive impact on our gross margin. We expect to see this more in the coming quarters and years as manufacturing -- and production becomes more and more toward manufacturing. And as we said in the past, when manufacturing percentage of our total revenue will grow, that will have a positive impact on our gross margin.\n\nTyler Hutin -- William Blair and Company -- Analyst\n\nOK. Thank you for that. And yeah, you had nice even sequential improvement in gross margin. I was just wondering if you could quantify kind of what the macro headwinds were from inflation and supply chain disruptions, the headwind going toward gross margin? Thank you.\n\nYoav Zeif -- Chief Executive Officer\n\nEitan?\n\nEitan Zamir -- Chief Financial Officer\n\nSure. So, high level, as we mentioned, the net impact is a growth of -- from 48.2% to 48.5% year over year. But to your point, there were a more significant trends. One is higher revenue, had a positive impact on our gross margin.\n\nWe increased prices, which over the year from Q3 2021 over the last year that had a positive impact on our gross margin. On the other hand, the cost and logistics had a negative impact of roughly 200 basis points, give or take. And we also have the positive impact of the exclusion of MakerBot. It was only one month, only the month of September since the deal closed at the end of August, but that had a slightly positive impact on our gross margin.\n\nThese are the main items that impacted the gross margin trend.\n\nTyler Hutin -- William Blair and Company -- Analyst\n\nOK. Thank you for all that and good luck going forward.\n\nOperator\n\nThank you. The next question is coming from Paul Chung of J.P. Morgan. Please go ahead.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nHi, thanks for taking my question. So just on the opex side, you had a minimal bump this year. Can you talk about kind of the opex discipline you're driving here? And as we think about kind of the pace of opex growth maybe as a percentage of revenues next year, what do you think we should expect in what range? And what are some of the efficiencies you're kind of focused on next year?\n\nEitan Zamir -- Chief Financial Officer\n\nThank you. Maybe I'll start with the mid to longer-term opex as a percentage. As we plan and this is, in a sense, pure math, but there is a detailed plan to get there. So, the pure math, if we plan to reach double-digit operating income within the next few years, and we plan to get 50% plus gross margin, that means that opex will have to go to 40 level and maybe a little bit even lower, right? So that's a journey.\n\nAnd it is step-by-step improving -- continue to improving our scalability. If you will look on the last four, five, six quarters of opex as a percentage of revenue, you will see a continuing improvement. So, 0.5% or maybe up to 1% every quarter, improvement -- the improvement of opex as a percentage of revenue, down to a level of 45.8% that you see this quarter, this journey will continue. It will take a few years to get to the 40 levels.\n\nBut we believe that this is -- we will continue to see improvement as we continue in our journey and as the business scales.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nGreat. That's super helpful. And then -- just a follow-up on the consumables purchases. Can you, kind of, quantify how below trend they are? And how are the teams looking to kind of drive consumables higher in the coming quarters and into 2023? And you mentioned the benefits of kind of strong system sales over the years -- over the last couple of years.\n\nSo, how does that kind of play in? And talk about the initial successes you're seeing with the expansion of consumables and what materials are seeing nice momentum and your expectations for kind of a gross margin uplift as well. Thank you.\n\nYoav Zeif -- Chief Executive Officer\n\nThank you for the question. We are optimistic about our consumable offering, and it will be a driver -- one of the drivers which will increase our gross margin over time. And we'll make sure that we are a company with a 50% -- above 50% gross margin and 10% operating income. So, this is an essential part in our five years plan.\n\nIn terms of the way we look at consumables, there is the long term and the short term. In the short term, we have challenges because of the slowdown and because of, as I shared the impact on prototyping, most of the main reasons for the results of the consumable in Q3 were the FX, which has an impact of around $5.1 million only in this quarter, some supply chain rollbacks, challenges, both in production and supply chain and the MakerBot divestiture, but we are coming back to growth in Q4, and that's the short term. Now, I'll take it to the long term. It is one of our growth drivers.\n\nThat's why we are investing in Covestro. That's why we have an open material. We are leading the industry with our open material license. Hybrid model, this is why we just introduced now 13 new materials in FDM that usually will take us between three to four years, and we did it in one shot, that's your PerFORM, high-end materials for manufacturing.\n\nAnd on top of it, there is this long-term impact we call it the life cycle impact. And what do we mean by the life cycle impact? This is the in and out of consumption of materials in this pool. Look at it like the baby boomers that were born in '45 and then in 2010, they went to pension, and then you have a decline in their consumption because they went and started their pension period or retirement period. Same here, you need to make sure that new hardware is getting in when [Inaudible] out there, it's going out.\n\nWe are very optimistic because the model is working, and we will see growth going forward. But of course, the pool was not filled enough during the weak times of 2019 and 2020, especially the COVID time. But we are optimistic, consumable is essential for us, and it will drive our gross margin higher. On top of this, we are -- and that's one of the reasons of Covestro, but not -- the only one we are going to be disruptive with our material.\n\nAnd a good example is our denture material as we are coming with a solution that we disrupt the market. We disrupt the market because it will have property that does not exist today in this market.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. The next question is coming from Wamsi Mohan of Bank of America. Please go ahead.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nYes, thank you so much. I know you're not providing an outlook here for 2023, but just given what your comments were about demand trajectory and macro caution and some customer deferrals. I was just thinking, is it reasonable to assume at this point in time normal seasonality for the first quarter off of your fourth quarter guidance, or should we be anticipating something that's either better than seasonal or worse than seasonal? And I have a follow-up question.\n\nYoav Zeif -- Chief Executive Officer\n\nThank you, Wamsi. It's a bit too early to speak about Q1 2023 and the entire year of 2023. I can say that we're very confident about our ability to grow, but we should be mindful of the situation in the global markets and the macroeconomics. So, providing a detailed forecast for 2023 will be -- it's too early for that.\n\nBut I think it's important to note, we truly believe that we are -- with our diversified portfolio and the technologies that we have, we have the ability to grow in 2023. It's only a matter of being more mindful of the situation, the uncertainty that is currently in the world. And the profitability in addition to the revenue growth, the profitability, this is something that is more within our control. We believe that we should be able to sustain profitability and even improve it based on the model that we've built.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you for that. As my follow-up, the cash on your balance sheet, and I know you have a very strong liquidity position, but the cash went down about $93 million. Can you talk about what all items bridge that because you've had divestitures and acquisitions in the quarter, and obviously, you're operating at elevated inventory levels? Can you just walk us through what are the moving pieces that got you to that cash level? And as we think about cash burn rate, potentially in a weaker demand environment, how should we think about the quarterly run rate of cash burn as well? Thank you.\n\nYoav Zeif -- Chief Executive Officer\n\nThank you, Wamsi. So, cash flow, as a starting point, I would say that we started this journey with a significant cash balance with no debt, which is something that is one of our strengths, especially when we enter into this potential recession that puts us in a very, very good position to continue our journey and to continue to grow with that healthy cash position. With respect to the quarter -- and maybe a little bit some of the other questions that you raised. So, with respect to the quarter, this quarter, we paid for certain M&A, for certain transactions.\n\nMakerBot is the largest in this quarter we paid, and that's something that was announced in the last few quarters in certain press releases. As part of the investment in the new business with Ultimaker, both companies invested, Stratasys invested in this new company roughly $47 million. We also invested, as mentioned earlier on the call, in a few other businesses, which is roughly $10 million to $20 million that were invested in those smaller investments. And then, obviously, we have the operating cash flow that was 80 million.\n\nAnd we have other smaller items that are more on the normal, kind of, level capex, and so on. That's basically the bridge that gets you to the roughly 90 million that were used this quarter. But the vast majority is M&A related, which is significant driver in our future and in our growth. With respect to the excess cash burn rate, and I would start with saying, if you look on the last few years, we had significant positive operating income -- sorry, positive operating cash flow in both 2020 and 2021.\n\nThe two years of COVID, we generated roughly more than $60 million of positive operating cash flow combined, which reflects our ability or basically reflects the trend that our business generates positive cash flow. The trend that you see this quarter and for the last few quarters is something that is deliberately and managed by us. It is focused on increasing inventory to put us in a better position to supply the demand. We have a few new technologies, as you know, and altogether, we believe that we need the right level of inventory to support the demand, to better manage our gross margins in an optimized way.\n\nI mentioned this, I believe, as an answer to one of the questions earlier. And that's basically the way we look at it. But on a normalized quarter, our business generates operating cash flow that's important to some extent.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you so much.\n\nOperator\n\nThank you. The next question is coming from Ananda Baruah of Loop Capital. Please go ahead.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nYeah. Good morning, guys. Thanks for taking the -- I guess, good afternoon for you and good morning to us. Thanks for taking the question here.\n\nTwo, if I could. Yoav, just going back to one of your earlier comments, sounds like you think manufacturing holds it better than prototyping going through macro here. Do you think that -- inside of manufacturing, do you think it's consumables or equipment sales that would hold up better inside the manufacturing? And then I just have a quick follow-up. Thanks.\n\nYoav Zeif -- Chief Executive Officer\n\nGood morning, Ananda. Thank you for the question. Yes, manufacturing is less sensitive because it become more critical for your customer. And, of course, number one is consumables because they need to produce and only then hardware.\n\nSo, the moment they adopt the new technology, although is important, but still more sensitive than consumables to economic pressure. But overall, we are -- have been doubled the addressable market, and we have every month, every week, a greater position in manufacturing. That's what make us so resilient. And we are optimistic because we see that our customers are willing to explore and to take this journey with us.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nYeah, that's helpful. I mean it's actually going to be interesting as well. I won't go into diet track, but it will be interesting to see sort of the contribution from the newer technology can allow you to grow through '23 if macro really is persistent. I think we're all looking forward to finding that out with you.\n\nJust a quick follow-up is on services revenue. How is that -- so if macro becomes very persistent as we go through 2023, how sticky is that customer support? Like what's really the driver? It's sort of at this $50 million level a quarter. Is this the right way to think about it regardless of what happens with a macro? Just context there. And that's it for me.\n\nThanks a lot.\n\nYoav Zeif -- Chief Executive Officer\n\nThank you, Ananda. Remember, in our model, materials and service are lagging after hardware, and the most important driver to value our performance is hardware. If you don't have the box or the machine at the customer's place, you will not consume materials and you will not pay for service, a very simple equation. And when you look at it -- the fact that we transformed the ratio of hardware within our sales, and you see quarter over quarter over quarter for the last 10 quarters, we are increasing the sales of hardware means that we are good with service because service is being driven by hardware.\n\nThat's the bottom line. That's the model.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nAnd if equipment takes a little bit of a hit from a few quarters from macro in 2023, it would seem -- what you just said would seem to suggest the installed base of the hardware could still support current service levels, current support levels. Would that be accurate?\n\nYoav Zeif -- Chief Executive Officer\n\nAccurate. It's not the marginal that drives it. It's the installed base, it's overall hardware in the pool.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nUnderstood. Awesome. Thanks a lot. Appreciate it.\n\nOperator\n\nThank you. The next question is coming from Jim Ricchiuti of Needham and Company. Please go ahead.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nThank you. Hello, Yoav, and Eitan. Wanted to go back to a comment you made about consumables, if I heard you correctly, growing in Q4. What I'm trying to do is reconcile that comment.\n\nWhat you're suggesting, I think, is continued challenging demand in prototyping. Are you anticipating just an acceleration in manufacturing-related consumables revenue? And -- or maybe is pricing playing a role in this?\n\nEitan Zamir -- Chief Financial Officer\n\nThank you, Jim, for the question. It's a process, and it's not in one or two quarters. We look at this more holistically. We look on the next quarter but also into 2023.\n\nWhen we think about the new technologies, and Yoav related to this earlier about the lag period and the model, the -- what we call the baby boom model, that we believe is very similar here. That's something that will take a few more quarters to be reflected on our financials. That's one of the growth engines or the reason we believe that consumable will grow in the next quarter, starting Q4. We do raise prices.\n\nI mentioned this earlier, we did this a few times during the last year, and we will continue to do that. So that's another element. Taking into account the Covestro acquisition, that's something that will have a significant impact on our consumables and on our business, as Yoav mentioned, not only the business that was acquired, but also the existing business and the other technologies that can benefit from that acquisition. When we take all this into account, we have a confidence about our ability to grow consumables.\n\nIt might be a small or limited growth in Q4. But as we enter into 2023, we believe that we'll be able to see more significantly a considerable growth.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nThank you. My follow-up is just on that $13 million of customer-related delays, how much of that was in Q3 versus Q4? And when you describe them as delays, the presumption is that these orders will come back in the next one to two quarters. Is that the case, or is there the risk that these longer sales cycles result in rolling delays as we think about the business over the next quarter or so?\n\nEitan Zamir -- Chief Financial Officer\n\nAll right. So, Jim, maybe as a start, I would say that the $13 million that you related to FX is also part of it. So, the headwinds that we see on the FX side are higher than the ones that were known three months ago, last time we spoke. So that's one of the elements within the $13 million.\n\nThat's one comment. Second, that reduction reflects the uncertainty that currently exist in the market. This is the estimate that we put into our Q4 guidance, but it's hard to say exactly how much it will actually be. However, we do consider this as a delay.\n\nSo, it may be pushed into Q1 2023, that at least our expectation.\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. The next question is coming from Noelle Dilts of Stifel. Please go ahead.\n\nNoelle Dilts -- Stifel Financial Corp. -- Analyst\n\nHi. Thanks. A lot of my questions have been answered. So, I just have one, but it's kind of multipart.\n\nSo, one, I was hoping you could just expand on how you're thinking about acquisitions in the current -- in the weaker macro environment? Are you a little bit more cautious given the economic headwinds, or do you think you might maybe accelerate some M&A just given that there may be assets out there that are attractively priced?And I guess the second part of this is, just it feels like they're we're in a period where, given where the group is trading, you could see some consolidation, whether that's across kind of the public companies or fields similar to what we saw with Nikon and SLM. So, if you could just give me some thoughts on how you're thinking about the potential for consolidation? That would be great. Thank you.\n\nYoav Zeif -- Chief Executive Officer\n\nThank you. Thanks for the question. We are in a great position in terms of our balance sheet to be deconsolidated of this industry. For two main reasons.\n\nOne is the balance sheet position. But the other one is that in tough times and in macroeconomic challenges or slowdown, it's also an opportunity. It's an opportunity because it's differentiating the strong player with strong infrastructure that can stand and win versus others that have more challenges. And I think that's a good opportunity just to share three factors that will make sure that we are the one that will capture the additive manufacturing opportunity in mass production because we are in the best position, both financially in terms of the infrastructure, in terms of the offering.\n\nAnd I want to relate to three very important factors. One is our foundation as a company. The second one is the fact that we have the most resilient business, as reflected in our profitability within the industry, and the third one is a promising future that we have and the leading position in attractive use cases. I'll go one by one because it has implication to our position as the consolidator.\n\nThe first one is the foundation. We are laser-focused. We are going for polymer manufacturing, and we focus on the largest profit pool in this industry with differentiated technologies. We don't have even one machine that is a commodity, which is very unique, and it is reflected in our gross margin because if you are not differentiated, you have low gross margin.\n\nThis is the name of the game. The other things in our fundamental is those five leading technology with those -- with clear competitive edge, put us in a position in front of the customer, where we are not selling a machine, we are solving the customer product plan because we are agnostic between technologies. We can offer our customers what he really needs to be successful. The third thing in our foundation is the full solution of hardware, software, material, services, with clear synergies across there because if you are with Stratasys, you are using the same software, you are using the same material.\n\nYou have the same application engineer that you are facing. It's quite significant advantage. And we do it for use cases. Those are our growth engine.\n\nWe have a very strong growth engine, where we focus on manufacturing use cases, supported by the best go-to-market our industry in terms of the network and the largest installed base that is happy to work with us and to have repeated sales. But we cannot do it if we wouldn't have a resilient business model, practically the most resilient business model in our industry because we are having continuous growth all over geographies, verticals, technologies, and we are driving this weak hardware, which will carry software, which will carry material in which we carry service we did. We have the leading gross margin, as I said before. That's resiliency because it means that we have resources to invest, and it's a reflection of our customers' appreciation to our value proposition.\n\nThey are willing to pay. That's why we have this high gross margin. When you are with limited differentiation, you will have lower gross margin. And that's what we see around that.\n\nAnd last but not least, in terms of the resiliency of our business model is the fact that we are the most diversified company, both in terms of geographies, technologies, customers. We, by definition, do not have customers where we have high dependency. We don't have any material dependency on two or three or five customers which puts us in a very good position in hard economic times. And then, the third factor is about our promising future.\n\nWe build the foundation. We have a resilient model. And then, when you go out there, and build your future, it's all about focusing on the most attractive use cases. We have the broadest polymer manufacturing offering for use cases, in automotive and aerospace, like jigs and fixtures with proven results.\n\nWe have now -- we built it over the last three years, the most extensive offering and technologies and disruptive one, in dental, and you will see it in the near future, like the denture solution that we are going to launch. We have a unique position in medical and the material really differentiate us because we will have already the largest material portfolio in polymer manufacturing with this hybrid model that will secure our gross margin for many years. Combine this with a unique software offering and mainly with a team that has a spirit and culture, which is above and beyond, otherwise, we wouldn't be able to cope with those challenges. And that put us in a situation where, I believe, we will be the first additive manufacturing company that will pass the 1 billion scale milestone, I call it, with the 50% and above gross margin and 10% operating income.\n\nSo that puts us back to your question in a great position to consolidate the industry.\n\nNoelle Dilts -- Stifel Financial Corp. -- Analyst\n\nGreat points. Thank you very much.\n\nOperator\n\nThank you. At this time, I'd like to turn the floor back over to management, for any additional or closing comments.\n\nYonah Lloyd -- Chief Communications Officer and Vice President of Investor Relations\n\nThank you for joining us. Looking forward to updating you again, next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nYonah Lloyd -- Chief Communications Officer and Vice President of Investor Relations\n\nYoav Zeif -- Chief Executive Officer\n\nEitan Zamir -- Chief Financial Officer\n\nShannon Cross -- Credit Suisse -- Analyst\n\nGreg Palm -- Craig-Hallum Capital Group -- Analyst\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nTyler Hutin -- William Blair and Company -- Analyst\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nJim Ricchiuti -- Needham and Company -- Analyst\n\nNoelle Dilts -- Stifel Financial Corp. -- Analyst\n\nMore SSYS analysis\n\nAll earnings call transcripts"
}