{
  "companyName": "KLA-Tencor",
  "companyTicker": "KLAC",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/kla-tencor-klac-q1-2023-earnings-call-transcript/",
  "content": "KLA-Tencor (KLAC -0.74%)\nQ1 2023 Earnings Call\nOct 26, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Brittany, and I will be your conference operator today. At this time, I would like to welcome everyone to the KLA Corporation September quarter 2022 earnings conference call and webcast. [Operator instructions] Thank you.\n\nI will now turn the call over to Kevin Kessel, vice president of investor relations and market analytics. Please go ahead.\n\nKevin Kessel -- Vice President, Investor Relations and Market Analytics\n\nThank you, and welcome to KLA's fiscal Q1 2023 earnings call to discuss the results of the September quarter and our December quarter outlook. Joining me is Rick Wallace, our chief executive officer; and Bren Higgins, our chief financial officer. During this call, we will discuss our results released today after the market close in the form of a press release, shareholder letter and slide deck, which can all be found on the KLA IR website. Today's discussion is presented on a non-GAAP financial basis, unless otherwise specified.\n\nWhenever references are made to full year business performance, they are calendar year references. A detailed reconciliation of GAAP to non-GAAP results is in the earnings material posted on our website. Our IR website also contains future investor events, as well as presentations, corporate governance information and links to our SEC filings, including our most recent annual report and quarterly reports on Forms 10-K and 10-Q. Our comments today are subject to risks and uncertainties reflected in the risk factor disclosure in our SEC filings.\n\nAny forward-looking statements, including those we make on the call today, are also subject to those risks, and KLA cannot guarantee those forward-looking statements will come true. Our actual results may differ significantly from those projected in our forward-looking statements. Our CEO, Rick Wallace, will begin the call with some brief quarterly comments and highlights before discussing the semiconductor industry demand environment, including our business in China. Bren Higgins, our CFO, will conclude with the financial highlights, as well as our guidance and outlook.\n\nI will now turn the call over to our CEO, Rick Wallace. Rick?\n\nRick Wallace -- Chief Executive Officer\n\nThank you all for joining us today. I'll spend some time sharing highlights of KLA's performance in the quarter, touch on our business in China and provide a brief perspective on the overall semiconductor demand environment. Before we get into details, I'd like to first acknowledge our global KLA teams who have continued to demonstrate perseverance in navigating dynamic challenges to deliver for our customers. Their commitment is evident in our results.\n\nKLA's September quarter demonstrates strong customer demand across major product groups. Specifically for this quarter, record revenue of $2.7 billion was at the top of the guidance range, growing 31% on a year-over-year basis and 10% sequentially. Quarterly non-GAAP net income topped $1 billion for the first time. GAAP earnings per share was $7.20 and non-GAAP EPS was $7.06, each above guidance ranges.\n\nOur performance is a reflection of the increasingly essential role Process Control plays in the development of enabling technology and the long-term product road maps of our customers. As drivers for semiconductor demand continue to diversify beyond traditional PC and consumer-facing markets, Process Control is considered critical in enabling customers to execute on node and technology transitions. As this demand backdrop continues to evolve, our KLA operating model ensures focus on delivering for our customers, navigating supply chain challenges and continued investment in R&D. Now I will quickly summarize key highlights for the quarter.\n\nFirst, KLA continues to deliver strong relative outperformance versus peers and is positioned to be one of the fastest-growing Tier 1 WFE equipment suppliers in calendar 2022, substantially outperforming expected overall WFE market growth. Second, our Patterning systems revenue grew 49% sequentially and 67% on a year-over-year basis. Third, KLA delivered strong quarterly revenue in our SPTS segment. KLA has intensified efforts in advanced packaging and automotive electronics, leveraging the combined portfolios of both the Semiconductor Process Control and EPC groups.\n\nFourth, the KLA Services business grew to $529 million in the September quarter, up 16% year over year. Finally, operating cash flow topped $1 billion for the first time, and we generated quarterly free cash flow of $927 million and free cash flow margin of 34%. For the 12 months ended September 30, 2022, total free cash flow grew from 37% to $3.14 billion. Total capital returns in the quarter were $278 million, comprising $90 million in share repurchases and $188 million in dividends paid.\n\nTotal capital returns over 12 months ended September 30 were $5.2 billion or 166% of free cash flow and included $4.6 billion in share repurchases and $664 million in dividends. Early in October, the U.S. government issued new regulations to control aspects of the U.S. semiconductor industry trade with China.\n\nSpecific to KLA, a meaningful amount of our business in China is focused on legacy node investment, which is not the focus of the recent export restrictions. However, our system and service revenue will be adversely impacted going forward as we are unable to provide systems and support to certain customers for certain end users. We are assessing the broader implications and engaging collaboratively with the U.S. government to provide the necessary information about our products and services to fully determine the impact on our business operations moving forward.\n\nAs we look at the industry demand environment, growth for the semiconductor industry has evolved to be more strategic with more diverse end market mix. For the near term, the recognized excess inventories driven by a slowdown in consumer electronics markets, such as PC and mobility, is having an impact on semiconductor device pricing, particularly in Memory. As a result, semiconductor customers are adjusting CY '23 capex budgets lower, with the largest impact to date coming from Memory customers. However, long-term growth for the semiconductor equipment industry continues due to the prioritization of R&D investment at the leading edge, continued investment in legacy nodes and growth in enabling technologies such as advanced packaging.\n\nConsidering all factors, KLA's long-term targets announced at our Investor Day in June remain intact. In summary, KLA's September quarter results demonstrate sustainable outperformance and highlight the critical nature of KLA's products and services. Our teams continue to navigate and execute against dynamic challenges, and KLA remains well-positioned with a comprehensive portfolio to meet evolving customer requirements. The KLA operating model and our strategic objectives are the foundation for our sustained technology leadership, wide competitive moat, leading financial performance, strong free cash flow generation and consistent returns to shareholders.\n\nNow our CFO, Bren Higgins, will review our September quarterly financial highlights and outlook. Bren?\n\nBren Higgins -- Chief Financial Officer\n\nThank you. As you heard from Rick, KLA's September quarter results were strong, better than expected and demonstrated our consistent successful execution. While supply chain challenges continue in certain areas and are still limiting output, we have seen marginal improvement as new supplier capacity has come online to meet our requirements. Our continued focus on meeting customer needs while expanding market leadership, growing revenue, sustaining industry-leading growth and operating margins, generating strong free cash flow and maintaining our long-term strategy of assertive capital allocation is what makes us successful.\n\nQuarterly revenue was $2.724 billion at the top of the guided range of $2.475 billion to $2.725 billion. Non-GAAP diluted EPS was $7.06, above the guided range of $5.70 to $6.80. GAAP diluted EPS was $7.20. Non-GAAP gross margin was 40 basis points, above the midpoint of guidance at 63.4% at Semiconductor Process Control systems, which carry stronger gross margins delivered virtually all the revenue upside from the guidance midpoint.\n\nNon-GAAP operating expenses were $526 million, slightly below our expectation of $530 million for the quarter. Non-GAAP operating margin was strong at 44.1%. Quarterly non-GAAP net income topped the $1 billion level for the first time ever. GAAP net income was $1.03 billion.\n\nCash flow from operations was $1.01 billion. And free cash flow was $927 million, resulting in a free cash flow conversion of 92% and a free cash flow margin of 34%. The breakdown of revenue by reportable segments and end markets in major products and regions can be found within the shareholder letter and slides. Switching to the balance sheet, KLA ended the quarter with almost $3 billion in total cash, debt of $6.3 billion and a flexible and attractive bond maturity profile supported by strong investment-grade ratings from all three agencies.\n\nOur balance sheet offers a unique capability to fund our growth strategies, both organic and inorganic, and providing ongoing attractive capital returns to shareholders. Over the last 12 months, KLA has returned $5.2 billion to shareholders, including $4.6 billion in share repurchases and $664 million in dividends paid with total capital returns amounting to 166% of free cash flow. Turning to our outlook. KLA continues to deliver sequential growth and strong relative financial performance.\n\nBased on the midpoint of our December quarter guidance, KLA is positioned for mid-20% revenue growth for the total company in calendar '22, with Semiconductor Process Control systems growing several points faster than the company average. Furthermore, this business is expected to significantly outperform the overall WFE industry growth, which is currently projected to be up mid- to high single digits to the low $90 billion range. Looking ahead, we expect industry spending to slow. Though early, we are planning our business based on the expectation of CY '23 WFE declining approximately 20% based on increasing global macroeconomic concerns and recent public statements from several customers, particularly in Memory, and the impact of the new U.S.\n\ngovernment regulations on native China investment. This WFE estimate reflects our current tops-down assessment of industry demand as follows. In Memory, we expect WFE investment to decline by more than the market as Memory customers respond to lower consumer demand by cutting production and factory utilizations to bring device supply in line with demand. We expect Foundry/Logic to decline less than the overall market.\n\nSpecific to KLA, we are still assessing the impact of the new China export regulations. Our preliminary assessment for the combined gross direct impact on our revenue based on our existing backlog and sales funnel forecast is in the range of approximately $600 million to $900 million in calendar '23. This reflects systems and service impact with service representing approximately 10% to 15% of the total. This estimate is before any potential system reallocation for products where supply is meaningfully below current demand, which has resulted in significant lead time to other customers.\n\nGiven our backlog and forecast, we expect that we will be able to reallocate certain tools to other customers as we move through next year. KLA's unique broad portfolio differentiation and primary value proposition is focused on enabling technology transitions, which our customers continue to invest in regardless of business environment. While capacity plans can change, technology road map investment tends to be more resilient. This adds additional confidence in our business expectations as customers align shipment slots with road map requirements.\n\nIn this environment, we will continue to focus on meeting customer requirements, maintaining a high level of investment in R&D to advance our product road maps and KLA's market leadership and delivering strong relative revenue growth and financial performance. Our December quarter guidance is as follows. Total revenue is expected to be in the range of $2.8 billion, plus or minus $150 million. The gross direct impact of the new China regulations on the December quarter revenue guidance is approximately $100 million.\n\nFoundry/Logic is forecasted to be approximately 76%, and Memory is expected to be around 24% of Semi PC systems revenue. Within Memory, DRAM is expected to be about 55% of the segment mix and NAND 45%. We forecast non-GAAP gross margin to be in the range of 61.5% to 63.5% due primarily to expected product and segment mix. Looking ahead, KLA will continue to balance investments in technology and infrastructure to support our long-term growth objectives with the expectation of a softening near-term outlook.\n\nAs a result, operating expenses will grow to approximately $550 million in the December quarter with growth in quarterly operating expenses expected to flatten out as we move through calendar '23. Other model assumptions for the December quarter include other income and expense net of approximately $66 million and an effective tax rate of approximately 13.5%. Finally, GAAP diluted EPS is expected to be in the range of $5.94 to $7.34 and non-GAAP diluted EPS in the range of $6.30 to $7.70. EPS guidance is based on a fully diluted share count of approximately 140 million shares.\n\nIn conclusion, although the CY '23 outlook for WFE demand has softened, we remain confident that the secular trends driving long-term semiconductor industry demand and investments in WFE are durable and compelling. Broad-based customer demand, the increasing strategic role semiconductors are playing in influencing national industrial policy and simultaneous investments supporting growing semiconductor content across technology nodes remain important trends. These are long-term secular growth drivers for the industry as technology investment and node transitions reflect the value that semiconductors in our industry have in lowering costs for our customers and enabling a broader application universe for semiconductor-based technology across multiple end markets. For KLA, considering our strong track record of execution and the power of our portfolio strategy, we have confidence in our ability to continue to deliver sustainable relative outperformance.\n\nWe will continue to maintain a high level of investment in our product development road maps to enable market share expansion and support customers' technology road maps and multiyear investment plans. This provides an element of stability that shores up our confidence in the demand outlook for the future. These factors, combined with the KLA operating model that guides our execution, positions us to continue to deliver strong relative performance as we execute our strategic objectives. These objectives fuel our growth, consistent operational excellence and differentiation across the diverse product and service offering.\n\nThey are also the foundation of our sustained technology leadership, wide competitive moat, industry-leading financial performance, history of robust free cash flow generation and consistent and growing capital returns to shareholders. And with that, I'll turn the call back over to Kevin to begin the Q&A session. Kevin?\n\nKevin Kessel -- Vice President, Investor Relations and Market Analytics\n\nThanks, Bren. Operator, can you please queue for questions?\n\nOperator\n\n[Operator instructions] We'll now take our first question from Harlan Sur with J.P. Morgan. Your line is now open.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nHi. Good afternoon. Congratulations on the solid quarterly execution and strong free cash flow. As you mentioned, the team has been outperforming WFE and Process Control spending growth for the last few years.\n\nNo different this year, right? I mean it looks like given your December quarter guidance, your Process Control systems business is going to be up like 30% to 35% when WFE is only up high single digit. I know in the last downturn, like 2019, not as severe, but has potentially 2023 is, but you guys actually grew your Process Control and services revenues when WFE was down back then. So kind of given all of this, like do you think guys just provide some sort of rough framework for thinking about the team's revenue and earnings power potential with industry spending down about 20% next year?\n\nBren Higgins -- Chief Financial Officer\n\nYeah, Harlan. It's Bren. Thank you for the comments, and I'll start here, and Rick can join after. So I think the way to think about KLA performance is typically, historically, most of the volatility we've seen in WFE has been in the Memory space.\n\nAnd as you know, Process Control intensity and Memory is quite a bit lower than it is in Foundry and Logic. So I think you have to go back a couple of decades. I think we've outperformed WFE in any down year that WFE has had. So I think that that's always been an anchor for us.\n\nWe also tend to support customers that are investing in their road maps, right? So as they pull back on their capacity investments, they continue to invest in technology, and so there's a certain amount of business that -- with KLA that continues to happen almost irrespective of their revenue levels. So that tends to be a factor for us as well. And then finally, customers usually continue to run the installed base, and so service is -- continues to operate. We have a contract strain that is the majority of the revenue of 75% plus of the revenue.\n\nAnd so while they're pulling back on capex investments, they still tend to run the installed bases pretty heavily. And given how they buy Process Control generally in terms of buying what they need and rely on us to maximize uptime for those systems that it tends to also be an anchor as we move through down periods in the capex environment.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for that. And then on my follow-up, good to see the strong EUV mask inspection shipments and Patterning segment was up almost 70% year over year. I think that's reflective of the strong EUV adoption this year.\n\nAnd despite the weaker WFE backdrop for next year, I think that the EUV lithography outlook continues to be strong, right? I mean continued penetration of EUV into Memory and Logic and Foundry, and so this should bode well or continue to bode well for your mask inspection demand. But I know last year the mask inspection segment underperformed positive control on growth. What's the team's outlook for your mask inspection business this year and next year, given the relatively better fundamental outlook in lithography?\n\nBren Higgins -- Chief Financial Officer\n\nSo yeah, Harlan, you have it right. So this year is actually a very strong year for reticle inspection. I would expect reticle inspection to outperform the overall Semi PC business within the company. So a very strong year and certainly driven by EUV as 90% plus of EUV reticles in production are running through KLA systems.\n\nAs we look at next year, I think that there will be continued demand there as you see the -- start to see more investment in the three-nanometer node. So I would expect the rapid business to probably continue to perform better than Semi PC. There's also some investment in infrastructure that's happening in some of the legacy mask inspection and new infrastructure that's being built in China to support the legacy reticles, and so there's also an aspect of investment that's happening there as well. So I would expect it to have another good year this year, a strong year in '22, but also a strong year '23 as well.\n\nRick Wallace -- Chief Executive Officer\n\nYeah. And one other thing, Harlan, I think that -- one of the things that contributed to our strength is share gain due to new capabilities on our products. So part of what we were in development for was continuing extending the 6xx product to be able to serve more of the EUV market. So as we do that, we saw some performance.\n\nSo overall, the segment is good, and then we had some -- the benefit of some share gain as well.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nAwesome. Insightful. Thank you.\n\nOperator\n\nWe will take our next question from Krish Sankar with Cowen and Company. Your line is open.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nYeah, hi. Thanks for taking my question. And Rick, just wanted to follow up on the earlier question. I understand you guys typically outperform Process Control like a normal cyclical downturn.\n\nBut if you overlay the fact that some of your peers had supply issues, which you of course did not, and Process Control tends to be more early cyclical. If you overlay those two components do you still expect your Process Control revenue to outperform WFE next year? And then I have a follow-up.\n\nRick Wallace -- Chief Executive Officer\n\nWe do for two reasons. One it is true that some of them had more challenges than we did, but we had our own. We could have shipped -- we built backlog, we could have shipped more if we had more capacity. But the other thing is the decline in WFE is going to be based more in Memory than in Foundry and Logic.\n\nSo that alone helps us in terms of the mix. So I think we're in pretty good position to outperform WFE. Nobody really knows, of course, what '23 is going to look like. But with that setup, we're in pretty good shape.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Got it. Very helpful, Rick. And then just a follow-up on services.\n\nWhat percentage of your services is from China or domestic China? And also if WFE is down 20%, what do you think happens to service business next year? Thank you.\n\nBren Higgins -- Chief Financial Officer\n\nYeah. I don't think we've broken that out. I would say it's less than -- if our systems business in China and Semi PC is somewhere between 20% and 25%, I would expect the service stream is less because it's less developed, right? It's newer in terms of the investment that's happened, and so it would be lower than as a mix of service revenue than that is a mix of system revenue. I would expect service to continue to grow next year.\n\nI think it will be below the -- in that WFE environment, it'd be below what our long-term growth rate target of 12% to 14%. I think it will probably be somewhere in single digits. There is a little bit of an FX headwind that happens to service as you have the strong dollar but you have a lot of service revenues denominated in local currencies. You gave a little bit of a natural hedge because you also have cost denominated as well.\n\nBut there is a little bit of a headwind that's coming on service revenue growth from FX. But I think we'll probably be somewhere in kind of mid-to high single-digit service growth given expectations of WFE that are down 20%.\n\nRick Wallace -- Chief Executive Officer\n\nYeah. Krish, when we set the '26 plan at our Investor Day, we didn't know when, but we anticipated there'd be this digestion period of WFE just based on the historic growth, so we're still modeling the targets that we set out for '26. And we didn't know when, but it seems like it's coming in '23, and we weren't sure if it was '23 or '24, but it was going to be in that period. But overall, we feel pretty good about where we are positioned relative to that longer-term trend line.\n\nAnd as Bren said, we'll go under it, but then we've got a lot of systems that are shipping now, for example, that will come off warranty. And so they'll be going into services as we move forward, and feel pretty good about where we are relative to the long-term services plan.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Thanks, Rick. Thanks, Bren. Very helpful.\n\nOperator\n\nWe will take our next question from C.J. Muse with Evercore. Your line is open.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYeah, good afternoon. Thank you for taking the question. I guess first question, I was hoping you could speak to changes in backlog over the last three months, how you're kind of incorporating the changes around domestic China embargo. And when are you expecting to get back to kind of your normalized lead times of six to seven months?\n\nRick Wallace -- Chief Executive Officer\n\nYeah, C.J., it's a good question. And we'll have the specific numbers in the 10-Q, which we'll likely file on -- probably by the end of this week. But we did grow backlog a little bit. So remaining performance obligations will be somewhere in the mid-13 range.\n\nSo some modest growth of 13.1 as a reference point in the June quarter. We did scrub a little bit of the backlog given the new China regulations. I think there's more work to be done there as we move into the December quarter. It's still fairly fluid, and we're working through our own assessment of the new regulations and engaging with the government about how to think about certain situations there.\n\nSo I would expect to see a little bit come out. Certainly, we grew it a little bit this quarter, and I expect a little bit more effort or a little bit more there as we move into the December quarter.\n\nBren Higgins -- Chief Financial Officer\n\nSo I think from a lead time point of view, it's been a very across certain products. And we have certain products that are high-end sort of technology-enabling products like broadband plasma inspection, our retical inspection tools, our Voyager laser scanning system, SP7 Surfscan products. Those lead times remain very extended. I think it will take some time because we're dependent on incremental capacity to come online to be able to work through some of that backlog.\n\nAnd I would expect those customers to stay in the queue given the long-term sort of demand dynamics around that -- those particular products. But as it relates to some of our more capacity-centric products, I would expect some normalization as we move into '23. I think certainly, we're still constrained today in a lot of areas, and I would expect that we'll see that continue for a little while. But I think as we move through '23, we'll get up with a little bit more flexibility and more normalization on certain more capacity-centric product.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nVery, very helpful. As a quick follow-up, I think you talked about $100 million of gross risk related to the China impact for December. And, I guess -- what does the net number look like there? I mean should we just be pulling out kind of $10 million to $15 million from service to reflect that and that you're perhaps repurposing the remaining tools so the net effect is much less? Or how should we think about that?\n\nBren Higgins -- Chief Financial Officer\n\nYeah, I think, the easiest way to think about it approximately -- without the new regulations, our guidance would have been approximately $100 million higher, right? I think the mix that I talked about earlier in terms of service versus system is about the same in this quarter versus the longer term. And the ability to reallocate those systems in the short run a little bit harder. So I think that as we move into next year, we'll -- I think we'll be able to reallocate more, including some of what we expected here. But, I think, in the shorter run, much harder for us to do.\n\nSo I think the easiest way to think about it is the way I described it.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nWe'll take our next question from Vivek Arya with Bank of America Securities. Your line is open.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThank you for taking my question. Just one more on China. Can you help us put this $600 million to $900 million in context with what you're currently doing. In the last 12 months, China sales were about $2.8 billion.\n\nObviously, it's both domestic and multi. So is this $600 million to 900 million derisk enough? And how much is left and what is left once the $600 million to $900 million goes out of your addressable opportunity next year?\n\nBren Higgins -- Chief Financial Officer\n\nYeah. It's -- I think it's derisked. We try to provide a range to give you some perspective. Certainly, there's some forecast but it's part of that.\n\nBut as we looked at what we have in backlog and we looked at what we expect to book over the course of '23 for the affected customers, we were able to go tool by tool to come up with the range that I provided. And service is roughly 10% to 15% of that. We will see as we move forward. Again, we're at a very preliminary stage in terms of working through the regulations and also engaging with customers.\n\nThere's the possibility that we're able to get some of that back as we move forward, but we'll have to see how that plays out. As I said in the prepared remarks, it is tied to the legacy parts of our business, which are really unaffected by the new regulations. Most of what was considered 14-nanometer and below was already derisked from our plans because we were dealing with similar guidance back in the June quarter. And so what -- the biggest part of the change was the restrictions on the Memory business.\n\nAnd so, I think, we feel pretty good about the range given where we are, the range we provided.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nAnd just as a follow-up, I had a longer-term more conceptual question. I know we are far away from '24. But as people look forward and especially this topic of WFE intensity, in the last two years, it grows about 15% to 16%. But before that, the industry used to be around the 13%, 14% level.\n\nDo you think as the industry recovers, we kind of stay at the 13%, 14%? Or do you think there's a case to be made that WFE intensity can start to recover back to the levels that we have seen in the last two years?\n\nRick Wallace -- Chief Executive Officer\n\nYeah. I mean when we look at the longer term -- and it's a great question. And actually, that's the one that I think is the one that we've been spending a lot of time thinking about. The intensity is related to a couple of factors, obviously, but one of them is the challenge with the advanced technology nodes associated with it.\n\nAnd I think part of why it went back up was that scaling resumed, and scaling has resumed both in what we've seen in Logic/Foundry but also in Memory. So I do think it is going to trend slightly higher than it was, that it will be in '19 -- or '23, but it will go back up. Whether it goes all the way back up, it's not exactly clear, but I do think there's going to be pressure on that for people, everybody that's trying to move forward in technology. And the one thing that we know will happen during '23 even if there's a slowdown in capacity, there won't be a slowdown in technology advancement because everybody knows the way you get out of the downturn is by having newer products.\n\nSo I think it does trend back up. Whether it goes back all the way, we'll wait and see. But I think there's some improvement in capital intensity, and then we're on the strong belief that Process Control intensity will hold on to some of the gains that we've made and potentially build on them as we bring new products in.\n\nBren Higgins -- Chief Financial Officer\n\nYeah. Fundamental to our thesis was that we would see semiconductor revenue grow, and WFE would grow slightly faster. So you'd have a flat to up trend line in WFE intensity that would be faster than semiconductor revenue, predicated on the things that Rick talked about, but also that a lot of the dynamics in the industry that drove significant efficiency in WFE have been worked out of the system. And what I mean by that is things like wafer transitions or normal wafer transitions, the consolidation that we saw in the industry and so on because some of the bigger factors.\n\nSo our view is that there will be a lot of pressure for customers to try to keep it from growing, but that we were growing faster than it is. But most of what is talked about different customers is to keep it from growing faster, not to keep it from -- to drive it down. And so I think that there's -- we think the long-term assumption that's there is, I think, a fairly straight down the middle assumption in terms of how we think about long-term growth.\n\nRick Wallace -- Chief Executive Officer\n\nYeah. And there's one additional fact. When you look at the regionalization efforts and you think about new fabs around the world, they will tend to be slightly less efficient, which will drive up the efficiency, and those numbers are not really in anything in calendar '23.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks very much.\n\nOperator\n\nWe will take our next question from Joe Moore with Morgan Stanley. Your line is open.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. I wonder if you could talk a little bit about the export restrictions. You guys have talked about seeing the Logic restrictions coming, I think, before, and I heard from anyone else.\n\nWhere were you surprised on the Logic side? And then as a bigger picture question. The fact that this could affect the multinationals, but the multinationals immediately have a license for a year, do you think that gives any kind of pause to investing in Chinese fabs for the multinationals, who could find themselves with large assets that they're unable to upgrade if there's a change in policy? Just can you kind of assess how your customers are talking about all of this?\n\nRick Wallace -- Chief Executive Officer\n\nYeah, Joe, this is not an area where we're going to provide much insight. I think from the standpoint, I think what you meant is that we see the Memory restrictions coming, right, because we talked about the Logic ones. We were not surprised by the export controls that were implemented. And as we've mentioned, we've been working with the government officials as they've implemented those.\n\nSo we're not surprised by that. When I talk to customers about their plans in China, I think, a lot of what they're doing is trying to figure out what are the implications of those extensions and what's the long-term viability. So I would say that it's a much better question to ask them than us. And ultimately, from our standpoint, frankly, it doesn't matter that much because if they choose not to invest there, what they're doing is investing to support demand and they'll move that investment to where they could do it.\n\nSo that's kind of the way they're talking about it and what we're seeing. So I think from our standpoint, a lot of the -- now that this has happened, we're in a much better position to not speculate but support as we move forward.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nWe will take our next question from Joe Quatrochi with Wells Fargo. Your line is open.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nYeah. Thanks for taking my question. Last quarter, you had talked about productivity, your manufacturing staying relatively similar rates in the second half into the first half of next year. Is that still how you're thinking about? And maybe in that context, how do you think about that relative to gross margin?\n\nBren Higgins -- Chief Financial Officer\n\nYeah. Look, we -- as you see in the guidance, right, we have another step-up in output expectations out of the factories and are still driving to deliver into the first part of the year. I mean, certainly, there's been some customer churn that we've seen. Most of -- sort of adjustments to our outlook are more from a top-down perspective in terms of engagement with certain customers and also public information.\n\nI think we'll have to see how it plays through. But right now, we are driving the factories to continue to deliver against what our customers have asked us for. So I think we'll have to see how it plays out, but we start to see some rescheduling as we move into '23. I think those are still questions out there, given just the dynamics we're seeing on the macro front and what we're hearing from customers.\n\nBut for now, I think our view on the first part is somewhat consistent with what I've said in the past. But I'll have more to say about half to half in the March guidance when we get there.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nThat's helpful. And then just as a follow-up. Maybe going back to the Investor Day. Now with the new China export restrictions in limiting some of the emerging China customers, how do you think about that maybe changing the long-term growth CAGR that you outlined at the Analyst Day in terms of WFE, your capital intensity? Does it change given those guys are maybe trying to ramp up on the technology front and so spending a little bit more than, say, some of the more mature customers?\n\nRick Wallace -- Chief Executive Officer\n\nWell, it really goes back to the -- it's a good question, and we had contemplated rationalization of WFE in support of the overall industry. So that's really how I think about that is that, ultimately, there -- most of our customers end up having pretty strict investment forecast based on their belief of the capital intensity that they can afford, and you aggregate that up to the industry. And it kind of goes back to, well, what are your assumptions about semiconductor industry growth? What are your assumptions about capital intensity and what are your assumptions about Process Control. Those are all in the band of what we considered when we looked at the investment that was going to happen there.\n\nSo yes, it may be that there was some investment without the revenue to support it. But eventually, it was going to get rationalized. And then we go back to believe in the semiconductor industry growth. You believe in, overall, the question we answered earlier on capital intensity.\n\nSo it's pretty much baked in the numbers. The reason we set it out for '26 instead of sooner was, as I mentioned before, we felt like there was going to be some kind of digestion period, which we're now facing into, so you kind of get there. As I mentioned, there will be some investment that when you look at some of this regionalization that hasn't happened yet that would have been upside to that plan, and now I think you end up it kind of all blends together. So if you believe the semiconductor growth, I don't think capital intensity goes down, and we feel pretty good about Process Control and our share, that's supportive of the numbers that we laid out.\n\nIn addition, Bren already talked about the services, which is another big part of it. So a very long way to say we feel like we're still on target for our '26 plan.\n\nBren Higgins -- Chief Financial Officer\n\nYeah. You left out the EPC part, too. I think that's one where certainly we're feeling pressure this year and would expect to see more volatility in that part of the business given its proximity to consumers. But we still have an expectation that through SAM growth there that we will see similar growth rates there as well.\n\nSo we talked about '21 to '26 overall. Rick said we modeled some of the -- some softness in between, but we still feel good about the underlying assumptions of what we laid out.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nPerfect. Thank you.\n\nOperator\n\nWe will take our next question from Sidney Ho with Deutsche Bank. Your line is open.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nThanks for taking my question. So I have two questions. The first one is the near term. If I look at your December quarter guidance, can you help us with the growth difference between SPC and EPC? And I know this EDC was down quite a bit quarter over quarter, maybe just seasonality in Q1.\n\nAnd then related to that, if you can unpack the guidance for gross margin a little bit, it's down about 100 basis points at the midpoint, can you talk about the pluses and minuses and specifically related to revenue impact of the China regulation? Does that have a gross impact on gross margin? And I have a follow-up.\n\nBren Higgins -- Chief Financial Officer\n\nOh, good question. So in terms of guidance for December, all the incremental revenue is coming just about all that's likely to come from our Semi Process Control business. I would think there'd be some impact from the new China regulations on service and the ability to grow service quarter to quarter. EPC was down.\n\nI think it will be up modestly quarter to quarter, but the bulk of the revenue increase will come from Semi PC. So I think in terms of gross margin in the September quarter, it was most of the upside, and I think we did better overall in Semi PC than we expected, and EPC was a little bit weaker on the margin than we thought going into the quarter. So we had a very strong mix of business. We had a significant sequential growth in Patterning.\n\nPatterning includes reticle inspection, which tends to be a richer product line from a gross margin point of view. So that was the biggest impact that drove the upside. I think as we look at December, again, it will come back to mix dynamics in terms of how we model the business. We're kind of operating in line with the long-term range that I've talked about is somewhere between 63%, plus or minus 50 basis points or so, and we've been operating fairly consistent with that if you look at the broader picture of calendar '22.\n\nSo we'll see how it plays out. We've certainly been driving the business at a higher level in terms of output expectations. If you just go back to June, what was the consensus expectation for WFE both this year but also into '23? So that's certainly been a factor in terms of how we've been sizing our business in terms of our ability to support and to ship. And as we move into '23 and we see some of that, it could create a little bit of inventory exposure from an excess inventory point of view.\n\nSo it could have some incremental reserve exposure there as well that we contemplated as we thought about December. So those are the puts and takes. I think the China regs in terms of impact on gross margin, it's more of a revenue impact. I don't think there's anything incremental from a gross margin point of view one way or the other.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nThat's helpful. Great. My follow-up question is back to a cycle question here. In prior down cycles, KLA usually outperformed initially because customers want improved yields, maybe continue to invest in R&D.\n\nBut essentially, the downturn -- eventually, the downturn would catch up after several quarters, maybe just Memory gets capex at first and then time Foundry/Logic comes later. Remind us of why you think this time could be different. And what kind of visibility into 2023 do you have right now just based on cancellation and rescheduling, those kind of things? Thank you.\n\nBren Higgins -- Chief Financial Officer\n\nSo we haven't had any cancellations. And there has -- the rescheduling that there's been, I'll call it, churn in our backlog management, but backlog grew quarter to quarter. I would expect that we'll see more cancellations as we move into '23. But what we said in terms of guidance of the industry down approximately 20% or so and given our expectations around the mix of business and so on and the history that we would expect KLA to perform well in that environment from a share of WFE point of view.\n\nSo I think to your other point, look, it depends on how long these soft periods last in terms of how customers ultimately adjust and then what are the demand drivers as they come out of it. But as I said before, we're much more levered to our customers' technology road maps than the increment of capacity. We're certainly doing much better in capacity investment than we used to do, particularly around some of the issues we talked about at Investor Day due to higher design starts and less reuse and so on. So those are all factors for us that are positive from a capacity point of view.\n\nBut at the end of the day, the biggest part of KLA's business is exposed to development and ramping up production. So as long as technology road maps hold together, we feel pretty good about how we're positioned.\n\nRick Wallace -- Chief Executive Officer\n\nYeah. And let me add to that. I mean, at Investor Day, we talked more about our exposure, as Bren said, and the ability we have to scale when there's capacity. I think the other thing that's changed, particularly with EUV is we're actually more an enabling technology now.\n\nAnd before, we might have been more about yield management. And now with some of our products, particularly in BBP and in rapid, those are the tools that our customers have repeatedly said, no matter what happens in this downturn, keep us on your list. We want those tools. So I think that we've broadened from being primarily a company associated with ramping yields to one of enabling technology, particularly around EUV and then in capacity.\n\nSo I think we have better exposure, which is why we feel pretty good about how our products are holding up and the fact that we are getting very clear signals from customers that are saying, we understand we're slowing overall, but please do not take us out of the list. We need those tools, and we need them as soon as we can get them.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nWe will take our next question from Timothy Arcuri with UBS. Your line is now open.\n\nTim Arcuri -- UBS -- Analyst\n\nThanks a lot. Bren, I also had a question on Process Control systems. And I ask because 2023 is going to be kind of a weird year because there's about $4 billion to $5 billion worth of deferred WFE just from two of your peers that should have been WFE this year but really is going to become WFE next year, and that sort of optically creates maybe like a little bit of a headwind for your WFE share. So I'm wondering if you can sort of help sift through that and maybe size what your PC systems would be for calendar '23.\n\nIt seems like $6 billion is a pretty reasonable bogey, but I'm wondering if you like that number or not.\n\nBren Higgins -- Chief Financial Officer\n\nTim, I don't want to guide '23. We're a little bit early on that. I think you're right that there is some of the deferred revenue dynamic that will maybe skew the numbers a bit. But I think also given the things that we just said about how we're positioned into '23 from a backlog point of view and from a technology point of view that we feel pretty comfortable with our share of WFE continuing.\n\nBut also, I think, we feel very good about the actual market share within Process Control and the -- we think, some tailwinds there as well. So, I think, against the backdrop that you're talking about. If you're thinking WFE is somewhere in the $75 billion-ish range or so, the kinds of numbers are reasonable that you're mentioning. But I'll have the ability, I think, to provide a little bit more clarity around how we see that as we move into guidance for '23 in January.\n\nTim Arcuri -- UBS -- Analyst\n\nCool. Thanks. And then, Rick, I had one for you. There was a question earlier about WFE intensity.\n\nAnd if you take -- the China restrictions are taking like between $7 billion and $9 billion out of WFE for next year, maybe some of that gets replaced somewhere else. But you see all the wafers and all the yields. So would you agree that maybe domestic China WFE has sort of inflated WFE intensity to some degree over the past couple of years? And maybe it's fair to take like a 50% multiplayer? I mean I don't want a number, but just the idea that you should take some sort of a handicap toward the WFE is the dollars because the productivity of those dollars is not equivalent to dollars being spent beyond China. I'm just sort of wondering how you kind of think about that.\n\nThanks, Rick.\n\nRick Wallace -- Chief Executive Officer\n\nYeah, Tim. No, I think that's true. I think that is absolutely the case that you have a situation where there was additional WFE. But it's interesting because that investment didn't really utilize EUV, so that wasn't particularly capital-intensive investment on a relative basis.\n\nSo in fact, they were prevented from it. So I think over time, there is going to be more pressure on everybody that stays on the technology road maps to invest in technology that leverages, frankly, more to KLA, whether it's in Logic, Foundry or Memory. And so that's why, as we said, we modeled that. It is true that will come out, but it will over time be replaced.\n\nSo I think, sure, the capital intensity was probably running a bit hot because of that, but that's going to get reset. So I don't think we go back into where we were, but I don't think we go all the way down either. I think it's somewhere in between, and that's how we modeled our 2026 plan.\n\nBren Higgins -- Chief Financial Officer\n\nYeah, I would say it's more efficient today than it was in 2016 when we saw all this escalation in investment. So there is a little bit more maturation there than what we have, let's say, five, six years ago. But generally, I would also agree. I think you also have to remember that there's investment that's happening in infrastructure to support legacy domestic consumption, right? And so you have wafer investment that's happening.\n\nYou have some reticle investment that's happening as well. So I think when you look at that, there is that question about how much of that is real demand versus more strategic investment. And so I think that that's -- there is some adjustment factor there, but it's probably a little bit different than what you might have thought five years ago or so. As you think about Process Control intensity, typically in legacy nodes, we tend to then do fairly well as facilities are starting up.\n\nBut Process Control intensity in the trailing edge, unless they're there are big drivers of some major change, doesn't really -- isn't really as high as it is at the leading edge. So when you think about Foundry, Logic, Process Control intensity at the trailing edge, it's more like Memory, maybe a little bit better than that in China, but it isn't like a leading-edge investment would provide. So it's a little bit different environment there from a KLA point of view.\n\nTim Arcuri -- UBS -- Analyst\n\nThank you, both.\n\nOperator\n\nWe will take our next question from Toshiya Hari with Goldman Sachs. Your line is open.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nGreat. Thanks so much. I had two questions as well. Bren, on the China impact, in calendar '23, which you sized at $600 million to $900 million, I think that was a gross number.\n\nSo just curious, given the fungibility of your tools and based on your current pipeline, roughly what percentage of that do you think you can repurpose and ship to other customers, at least on the systems side?\n\nBren Higgins -- Chief Financial Officer\n\nYeah. I think it's too early to tell, Toshiya. What we try to do, and I purposely use those words that was gross. I think as we move forward, there are certain products that we will be able to repurpose fairly easily, and there are other ones that might be a little bit more difficult depending that they're back to the sort of capacity versus technology discussion we had earlier.\n\nSo I'll have a clearer picture on how to think about that. But the way I thought about it was, as I said earlier, I looked at the backlog and I looked at our forecast in terms of expectation and timing of revenue and added up what we -- absent the new regulations, what -- how much revenue we would have, and that drove the range that I provided. And then we'll have to see also, as I said earlier, how as we progress here moving forward, what is truly kind of out and what is in as we start to work our way through and engage with customers and get a clearer picture from the government as we go through. So I think that's the best way I can size it right now is that impact, and I would expect for more higher end products where lead times are extended that we'll be able to reallocate some of those tools.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nGot it. That's helpful. And then as my follow-up, I wanted to get your thoughts on opex into calendar '23. I think it's fair to say that the WFE outlook has deteriorated over the past three months or so given Memory weakness and the export controls, your business is going to be a lot more resilient than the overall market.\n\nBut just given how the trajectory has potentially changed from a revenue perspective, I'm sure you're sort of thinking through and revisiting your footprint into '23. How should we think about opex? I think you talked about on a quarterly basis, things moderating into Q1. But for the full year, if you can provide some context, that would be helpful. Thank you.\n\nBren Higgins -- Chief Financial Officer\n\nYeah, I think, the easiest way to think about it right now is the flattening out. So as we get a clearer picture on what the revenue profile looks like for '23, we'll -- I'll have a better level of sort of quarter-to-quarter guidance. We've invested a lot over the last couple of years to support the revenue growth and to continue to invest in driving innovation and differentiation, which is so critical to KLA's go-to-market, and so we've made those investments. We want to get returns on those investments.\n\nSo we'll be careful and judicious about how we think about it. Obviously, the reality of the business environment is a factor, but also ensuring that we have the right products to meet our customers' road map requirements over the next few years is really critical. And I think the history at KLA has shown that in a soft period that our ability to invest and deliver what our customers need when they need it. It's been fundamental to our ability to go-to-market to have the portfolio and to share the value that we deliver.\n\nSo it will be a balancing act across all of those kinds of dynamics. But I think from a modeling point of view, you've got a model that it flattens out. There's also inflation pressures, right? We'll have a merit cycle, so we'll have to work through all of that as well, but my expectation right now is that you'll -- we're tapping the breaks and you'll see it flatten out.\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nAnd we do have time for one final question. And we'll take our final question from Atif Malik with Citi. Your line is now open.\n\nAtif Malik -- Citi -- Analyst\n\nHi. Thank you for taking my question. First, I just want to clarify if you and your peers cannot ship the spare parts and services to these projects, will these projects kind of like halt sometime next year as they run out of spare parts? And then I have a follow-up.\n\nBren Higgins -- Chief Financial Officer\n\nThe ability to support the tools, I can't speak for the peers. But I can just say for KLA systems, given the nature of our tools and the maintenance that's required to support them and the supply chain, which is fairly custom, that the ability to do maintenance is important to keeping the tools up and performing as designed and expected. So without service, it becomes very hard to utilize the tools that we've shipped.\n\nAtif Malik -- Citi -- Analyst\n\nGreat. And then the team talked about very nice bookings momentum on auto-related products on advanced packaging and silicon carbide at the Investor Day. Can you update us what you're seeing in the auto market that end market seems to be holding quite well right now and into next year?\n\nBren Higgins -- Chief Financial Officer\n\nYeah. I think in automotive, it's been a nice driver for our business, and we've seen meaningful growth really across not just what's gone on in our EPC group but also -- and you have exposure in a few different places, right? We have exposure in our SPTS business, which is for process in power and semiconductors but also in our Semi PC business. And so we have a few offerings that we tailored to support that market, and so we've seen nice growth there. And we're encouraged by the rising semiconductor content, just basic content in cars, let alone EUV enhanced content and assisted capabilities moving forward.\n\nSo I don't have the exact number in terms of what it is. I want to say it's about $700 million or so this year in '22 in terms of what we'll call kind of auto exposure from a revenue point of view, and we would expect to see that grow over time. And we're engaging at levels with our customers that are driving a different way of thinking about Process Control, given the reliability requirements in auto and the margin structure, the cost of defectivity, the cost of recall and so on.\n\nKevin Kessel -- Vice President, Investor Relations and Market Analytics\n\nAll right. We thank you and we appreciate. Yeah. Thanks so much for the questions, everyone.\n\nI appreciate your time on a busy earnings week, and we will be in touch. I'll turn the call back over to the operator to conclude.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin Kessel -- Vice President, Investor Relations and Market Analytics\n\nRick Wallace -- Chief Executive Officer\n\nBren Higgins -- Chief Financial Officer\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nTim Arcuri -- UBS -- Analyst\n\nToshi Hari -- Goldman Sachs -- Analyst\n\nAtif Malik -- Citi -- Analyst\n\nMore KLAC analysis\n\nAll earnings call transcripts"
}