{
  "companyName": "Acutus Medical, Inc.",
  "companyTicker": "AFIB",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/acutus-medical-inc-afib-q2-2022-earnings-call-tran/",
  "content": "Acutus Medical, Inc. (AFIB 9.52%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Acutus Medical second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this call may be recorded. I would now like to turn the call over to Caroline Corner, IR. You may begin.\n\nCaroline Corner -- Investor Relations\n\nThank you, operator. Welcome to Acutus' second quarter 2022 earnings call. Joining me on today's call is David Roman, chief executive officer and chief financial officer. This call will include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nAll statements made on this call do not relate to matters of historical fact should be considered forward-looking statements. Factors that may cause results to differ from these forward-looking statements are discussed under the Forward-Looking Statements section in the press release attached as an exhibit to Acutus' Form 8-K filed with the SEC today and also discussed in more detail under the Risk Factors section in Acutus' most recent filings with the SEC, including the risk factors described in Acutus' Form 10-K. Any forward-looking statements provided during this call, including projections for future performance, are based on management's expectations as of today. Acutus undertakes no obligation to update these statements except as required by applicable law.\n\nAcutus' press release for the second quarter 2022 results is also available on the Acutus website, www.acutusmedical.com under the Investors section and includes additional details about Acutus' financial results. The Acutus website also has Acutus' SEC filings, which you are encouraged to review. A recording of today's call will be available on the Acutus website by 5 p.m. Pacific Time.\n\nNow I'd like to turn the call over to David.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nThank you, Caroline, and good afternoon, everyone. I'm very excited to share a number of updates with you today on the outset of our strategic review, in addition to our normal quarterly business and financial update. We have a tremendous opportunity in front of us at Acutus with a best-in-class team, a strong capital position and multiple pathways to drive growth and achieve our vision of transforming electrophysiology and to create long-term shareholder value. It truly is a dynamic time here, and I'd like to thank our board of directors for their support and for their confidence in me to lead Acutus in the next phase of our evolution.\n\nWe're on a mission to build a patient and physician-centric company that challenges the current treatment paradigms and brings novel solutions to a large and growing unmet need. This is an ambitious journey, and strengthening our culture and putting our teams at the core of everything we do is critical to our success. I've been humbled and impressed with the reinvigorated energy and enthusiasm the Acutus team is bringing to the company every day, and I know this group has the spirit and commitment to drive this company forward. As discussed in our last call, our senior leadership team initiated an extensive strategic review of our end markets, our business direction and product development road map and cost structure.\n\nThis involves significant market research, physician engagement and validation with independent consultants. As I've moved into the CEO role, I spent an extensive amount of time with our customers to garner their direct feedback, fine-tune our value proposition and assess the required investments to win in this category. I'll spend a few minutes highlighting the takeaways I've gathered and then turn to the implications in our forward outlook. Overarching themes that arose from our review were that treatment paradigms for complex arrhythmia patients are early in their development, there is lower consensus on how to treat this patient cohort and both the diagnostics and therapeutic tools available today offer suboptimal outcomes.\n\nAt the same time, physicians acknowledge that barriers to adopting advanced mapping, diagnostics and therapy tools are not just due to the availability and maturity of the technology, but also the extent to which these technologies fit within existing workflows. To date, we have established a strong base of utilization having treated approximately 5,000 patients with AcQMap by providing physicians with a differentiated set of tools to treat complex arrhythmias. At the same time, it has become clearer through our strategic review that the adoption rate of AcQMap and associated products has been hindered by workflow and procedural inefficiencies versus peers. Improving the overall physician experience represents one of the primary barriers to unlocking faster adoption of our mapping and therapy system.\n\nComing out of this strategic review, we identified two foundational objectives that will guide our business and capital allocation in the future. The first is to drive adoption and utilization of the AcQMap diagnostic system and to augment this technology with ablation therapy. Our success will be measured in procedure volumes, console utilization and penetration in target therapeutic categories. We will achieve this through focused product development and continued execution on our sharpened commercial strategy with a priority on procedure volume over installed base growth.\n\nIn addition, we will look to complement our internal R&D initiatives through licensing, partnership and other business development activities. We also remain engaged with third-party advisors to continue to review strategic options, to enhance our business profile and to fund our long-term growth. The second is the strengthening at our operating and underlying financial performance. As we drive revenue growth, it is equally important that we improve our gross margins.\n\nWithout this, we will remain overly dependent on cutting operating expenses, which is simply not sustainable. Our restructuring program announced earlier this year helped to rightsize our operating expenses, and we will remain highly disciplined in every dollar we deploy to operating expense, capex and working capital. I will discuss some more specifics around the gross margin and operating priorities in the financial review later in the call. In support of our strategy to drive utilization, we have two near-term launches that we expect to have a material impact on user experience and workflow.\n\nFirst, our next-generation software platform, AcQMap 8.5; and second, the U.S. launch of the AcQBlate FORCE sensing ablation catheter and system. We received FDA clearance and CE Mark approval for AcQMap 8.5 in July of this year. We are selecting sites for product evaluation and a limited market release to test the real-world application.\n\nFrom there, we'll gather physician feedback and make the necessary refinements before moving to a full commercial launch in the fourth quarter of 2022 or early in 2023. This software release will add features that improve anatomy builds and catheter localization, which are two major features that should improve workflow and physician experience. With respect to our U.S. AcQBlate launch, we completed enrollment in our IDE study in early May, including 110 patients at 21 sites globally.\n\nAll 30-day patient follow-up visits are now complete, and the study endpoint data have been 100% adjudicated. We are very pleased with both the clinical and safety outcomes from this study, which we believe will help support adoption and drive increased revenue per procedure, higher overall utilization for AcQMap systems and drive a return to growth in our U.S. installed base starting next year. Our modular PMA submission commenced earlier this year and should be completed next month, which pays the way for U.S.\n\napproval and launch in the first half of 2023. Beyond 2023, there are several products and technology categories in our pipeline, including a next-generation console, mapping catheter and ablation catheter, significant upgrades to our software platforms that will enable contact and noncontact mapping in one session and pulsed field ablation, or PFA. We will provide updates on time lines of these programs as they progress. Putting this all together, we continue to see 2022 as a transition year where we reset our strategic priorities, focused our R&D programs on those products that enable higher utilization of AcQMap and address some of the key adoption barriers and establish a strong operational foundation.\n\nBeyond 2022, we expect our business to see progressive improvements in 2023 and even stronger performance in 2024. When combined with our operational improvement initiatives, this business trajectory will position us well for the future and allow us to maximize value for all stakeholders. Turning now to our second quarter results. Net revenue of $4.1 million increased 11% sequentially compared to the first quarter of 2022, but declined 13%, compared to the $4.7 million in the year ago second quarter.\n\nConsistent with our expectations, the sales decline versus the prior year was largely driven by lower capital equipment sales and lower stocking orders on new console installations. These factors were partially offset by strong year-over-year growth in procedure volumes and higher procedure penetration as revenue per case increased double-digits globally on an FX-neutral basis. Sales in the U.S. of $2 million, compared to $2.5 million in the second quarter of 2021, driven by lower capital equipment and new install-related orders.\n\nWe are pleased to see consistent procedure volumes and AcQMap adoption, as well as increased revenue per procedure despite a lower installed base and a tightening of commercial resources. Sales outside the United States, which include revenue through our distribution partner, Biotronik, were $2 million, compared to $2.2 million in Q2 2021, largely driven by FX headwinds and lower capital equipment sales. By product segment, disposable product revenue of $3.3 million declined 5% year over year despite growth in procedure volumes with 481 procedures performed globally in Q2 2022, up 20% from the second quarter of 2021. The second quarter of 2022 registered another record for Acutus and procedure volumes, and we are on track to see strong growth in Acutus mapping and therapy procedure volumes for the full year 2022.\n\nWe ended the second quarter of 2022 with an installed base of 75 systems globally, down on a sequential basis and up from 70% in the year ago second quarter. Continuing our strategy in the second quarter of 2022, we removed six systems from accounts, repositioning three of those into new accounts during Q2. Capital revenue of approximately $300,000 showed a slight improvement compared to the first quarter of 2022, but was down versus the $800,000 we recognized in the second quarter of 2021. Service and other revenue of $400,000 was flat on a year-over-year basis.\n\nNon-GAAP gross margin was negative 129% compared with negative 54% in the second quarter of 2021. The year-over-year change in our non-GAAP gross margin was primarily driven by two factors, including excess inventory charges for raw material components and manufacturing variances. Excluding inventory charges that largely relate to supply chain continuity initiatives, non-GAAP gross margin improved 25 points sequentially. As discussed earlier in the call, improving operational performance is a critical part of our strategic road map and the foundation of improved operating results is our gross margin.\n\nTo that end, we have initiated several work streams aimed at restructuring and optimizing our manufacturing operations that include: First, reducing our overhead burden. Our historical structure was set up to enable rapid prototype and product development activities, as well as scaling of the business. Our current volumes, and given our more focused product development road map, we have taken actions to minimize overhead and infrastructure, while preserving critical resources to prioritize product quality, engineering support and reliability. Second is streamlining manufacturing processes.\n\nWe see several opportunities to drive efficiencies in labor and materials, as well as automate certain steps in product manufacturing. This will require some upfront investment, but the payback is significant in the short to medium term and will have an overall positive impact on our financial position. Third is product design. Historically, we have not emphasized cost requirements in our R&D program, and we have prioritized speed to market.\n\nWith our next-generation mapping and ablation technologies, we were making design for reliability and manufacturing a critical requirement for our R&D and engineering teams. Among our existing portfolio, we are also identifying cost reduction opportunities such as bring certain manufacturing in-house. Non-GAAP operating expenses were approximately $19.7 million in the second quarter of 2022, down 9% from the same period last year. Higher SG&A related to investments in G&A and marketing was offset by lower sales expenses due to reduction in force and lower R&D expenses tied to the reprioritization of development programs.\n\nOur non-GAAP operating expenses are down 16% on a sequential basis compared to the prior quarter as we realized the benefits of our restructuring program. We expect non-GAAP operating expenses to continue to moderate through the rest of 2022 due to restructuring and cost management efforts. Excluding specified items, our non-GAAP net loss for the second quarter of 2022 was $26.2 million, compared to a non-GAAP net loss of $25 million. For the second quarter of 2021, our total cash and cash equivalents, including restricted cash at the end of Q2 2022 was $93.1 million.\n\nOn June 30, 2022, we completed the first closing of the sale of our left-heart access portfolio to Medtronic for $50 million in upfront cash consideration. We are also eligible for contingent consideration payments up to $37 million associated with certain manufacturing and regulatory milestones, which we expect to complete in the first half of next year. Further, we will receive four years of uncapped revenue-based earn-out payments starting in late 2023 or early 2024, depending on the timing of commercial transfer to Medtronic. Lastly, in addition to the first closing of our left-chart access portfolio sale, we closed a new debt facility with Deerfield Management for $35 million with a maturity date of June 30, 2027.\n\nThis was done in conjunction with the settlement of outstanding debt obligations under the 2019 credit agreement. Finally, for the full year 2022, we are seeing good progress in our strategy to drive procedure volume, utilization and case revenue share growth. This has resulted in year-to-date procedure volume growth of 23% and global revenue per procedure of around $5,700, up strong double-digits on an FX-neutral basis, driven by AcQBlate outside the U.S., higher mix of noncontact AcQMap procedures in the U.S. and accessory products.\n\nWe expect typical medtech seasonality in Q3, but overall should see continued growth in mapping procedures, utilization and revenue share for the full year 2022. Earlier this year, we set expectations for 2022 revenue to be flat to slightly up compared to the $17.3 million generated in 2021. As a reminder, this initial outlook did not contemplate the sale of our left-heart access portfolio, nor a significantly weakened euro. The significant change in FX now approximates a $500,000 headwind in comparison to our expectations set out earlier this year.\n\nIn addition, given our strategic focus and somewhat more challenging hospital capex market conditions, contribution from capital sales is coming in below our initial plan. The timing of commercial distribution transferred to Medtronic is also a variable in our outlook. Considering these factors, we project sales to decline modestly on a reported basis compared to 2021, with half of that impact coming from FX and half coming from lower capital equipment sales. As previously discussed, we expect 2022 to represent a floor in our organic revenue performance as this is a year that required a reset in our strategy and several key actions to strengthen our financial position.\n\nOverall, I'm proud of the progress we're making as a company, and I want to recognize and thank my Acutus colleagues and business partners around the world for their incredible commitment and dedication to our mission as we build a physician and patient-centric company bringing disruptive solutions to market. We appreciate your continued interest and support, and I will now turn the call back to the operator to facilitate our Q&A session. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from William Plovanic with Canaccord. Your line is open.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nHi. Great. Thanks. Can you hear me OK?\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nHey, Bill. Yeah. Good afternoon.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nHey, thanks, David. So two questions here, just real simple. One, kind of if you can answer, where are you tracking relative to your original expectations for kind of decrease or reducing your cash needs per quarter. I think you thought you'd get down to maybe $18 million to $20 million a quarter, if I did the math right.\n\nAnd do you still expect to get there? And then two, just can you help us understand like, I think now we're looking at the Medtronic kind of next pieces, a little more detail on what's the trigger for the next payment and how much and then the one after to pick in at $37 million? Just so we can understand -- it seems like you got a pretty good cash runway, but just want to get a little more clarity around that. Thanks.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nSure, Bill. So on your first question, the answer is yes. We are still tracking in that direction to see a significant reduction in our cash burn throughout the year. If you had a lot of moving parts here in the second quarter, but effectively our cash burn in Q1 was about $29 million cash burn in Q2, excluding a lot of those factors, whether transaction-related expenses, debt reduction, etc., was in the $26 million range.\n\nQ3 will include our renewal of our directors and officers insurance, which will continue to keep cash burn in the low-20s and then Q4 on a normalized basis should then result in that high teens number that you had referenced. Just to put a little bit more support behind that, most of our -- about over 50% of the company's expense really sits in indirect labor and headcount expense. Headcount for the company has been reduced from about 335 people at the end of last year to 235 people today, and that represents the vast majority of the reduction in cash burn. Other factors contributing to that reduction include a much more disciplined process for managing inventory for the first time.\n\nAnd I think, over a year, we're now seeing sequential monthly declines in our inventory balance and what we're bringing into the company from a raw material and purchasing perspective. With respect to the Medtronic contingent consideration payments, so the next step is that for the $37 million we've broken out into two pieces, most likely. The first relates to us becoming qualified as an OEM supplier to Medtronic, that will trigger the first $20 million. That should happen later this year or early next year.\n\nThe second $17 million relates to the filing for EU MDR for the products that Medtronic is acquiring. And that we believe will take place early next year as well. If for some reason that filing goes beyond June 30 of next year, it would be a $15 million, not a $17 million payment, but we fully expect to get the $37 million within the first half of next year and more likely in the first calendar quarter.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nAnd if I could just ask one more. Managing through these situations is never easy and kind of turnover tends to be a big challenge. And just kind of any color you'd like to provide on post the restructuring in the first quarter, kind of what has been attrition turnover look like in the employee base? And thanks for taking my questions.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nThanks, Bill. So one of the things that I think we experienced after the restructuring earlier in the year, was continued attrition in a number of areas, which wasn't terribly surprising to us given a dynamic market environment, especially here in Southern California and especially in some of our key areas like software and algorithm engineers. I have noticed, however, in the past couple of months that we have seen a really significant turn in the morale at the company. And the way I'm measuring that is, we have no return to work policy.\n\nThe building is much more full than it's been in a year. We did go through some additional leadership restructuring here in July, which I think was important to leaning out the organization and creating the right structure and also presenting for a lot of people in the organization a clear path forward. We are significantly increasing our internal promotions when we're looking to fill key roles. And that overall has had, I think, a very positive impact on the overall energy and morale of the company.\n\nSo it was one of my biggest concerns actually over the past several months, and I think we're starting to see a nice churn there.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nThanks for taking my questions.\n\nOperator\n\nOur next question comes from Robbie Marcus with J.P. Morgan. Your line is open.\n\nAllen Gong -- J.P. Morgan -- Analyst\n\nHi. This is actually Allen on for Robbie. I just had one quick question to start on the cadence of growth that you highlighted with sales down modestly versus 2021, but with normal seasonality in the third quarter. So I guess what kind of trends have you seen so far in July and into August to really drive that? And how should we think about potential upside or downside to that guidance range?\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nSure, Allen. Thanks for the question. So let me start with the guidance. What we said on the call was, down modestly, half of that related to FX, half related to capital.\n\nWe said on the call that FX was about $500,000. So the exact impact from FX on our latest forecast is about $540,000, and then I would put an equivalent amount of that on the capital impact. So down about $1 million year over year, putting revenue close the low-16s range. On the seasonality, most of that really is something we're seeing in Central Europe, both in our direct business and through our partner, Biotronik.\n\nWe're seeing a little bit less seasonality in the U.S. than we have seen in previous years. And obviously, last year was impacted by a heavy impact from the Delta variant. But overall, I would say, if I look at weekly procedure volumes in Q3 compared to Q2 across different areas, we're seeing some growth in some areas on a sequential basis and some decline in others, which I believe is not terribly surprising.\n\nWe have some visibility looking into September, which we think will show better trends in some of those areas. Procedures in Europe tend to get scheduled pretty far and advance. So we have some feel for what the September procedure schedule is going to look like. So we would expect to see progressive improvements throughout the quarter.\n\nBut I think from where we sit today, we would expect to see revenue to be down sequentially Q2 to Q3 and then up more significantly in Q4. And a lot of that variability Q3 to Q4 will come from capital. We do have very good visibility into capital shipments, especially in some of the outmarkets outside the U.S. where we have purchase orders but can't ship until we gain regulatory approval.\n\nSo our line of sight to that Q4 capital contribution is pretty good. So -- but I would expect it's off the $4 million -- $4.1 million, excuse me, that we did in Q2 to see some sequential decline in Q3 in sort of the mid- to high threes and then being in the high fours in Q4, something like that for the cadence of numbers throughout the rest of the year.\n\nAllen Gong -- J.P. Morgan -- Analyst\n\nGot it. And then when you talk about operating spend moderating going forward, is that across both SG&A and R&D? Should we think about a similar step down from 2Q to 3Q as we saw from 1Q to 2Q and then maybe a bit more stable in fourth quarter? Thank you.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nYeah. It will be in both areas. We did $19.7 million of operating expenses in Q2. We are tracking to a number closer to $18 million in Q3.\n\nWe will incur some further expenses related to restructuring in July of the third quarter, but that still puts us in that $18 million range for the third quarter. So I would expect further moderation into Q4 and then that being pretty close to what the run rate would be going forward. So you would see year-over-year declines in operating expenses through the first half of 2023 and then more modest growth in the second half of '23 going forward. And I would say modest, I mean, the low to mid-single digits.\n\nOperator -- Allen, did we answer all your questions?\n\nOperator\n\nOur next question comes from Marie Thibault with BTIG. Your line is open.\n\nMarie Thibault -- BTIG -- Analyst\n\nHi, David. Thanks for taking the questions, and congrats on a strong quarter, first quarter here as the permanent CEO. I did want to ask a little bit about the system placements. Could we get a little more detail on what geographies some of those system movements happened in? And how far along do you think you are in this valuation process of determining where some systems are being underutilized and could possibly be moved?\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nSure. Thanks for the question, Marie, and thanks for the kind words. So geographically, in the U.S., our installed base declined from 39% in Q1 to 37% in Q2. In our direct European business, our installed base went from 22% to 21%.\n\nAnd in our Biotronik territories, installed base went up by 1% from 16% to 17%. So total installed base, 77% to 75%. We commented on the call removing six that was in our direct business and then putting three back into service. We did remove some additional consoles in July, but I would say, we are -- Q3 should mark the completion of that effort.\n\nWe have really identified the consoles that were underutilized or in areas where we had a physician move or a number of other moving part dynamics. So I think Q3 will mark the end of sort of the console repositioning strategy, and I'm not sure we'll grow the installed base Q3 to Q4. But as we look to 2020, I'm not sure we'll grow the installed base Q3 to Q4, but as we look to 2023, especially on the heels of our AcQBlate launch in the U.S., which probably comes late in the first quarter or early second quarter, we would expect to see a resumption in growth in our installed base, especially in the U.S. Outside the U.S., where we are seeing continued very strong momentum, especially with our partner Biotronik, I think there probably is more likelihood of growth in our installed base as we grow the business with our full portfolio.\n\nAnd that's what gives us such a high degree of confidence that once we have AccuBlate in the U.S. that we should start to see a turn in the trajectory of our installed base and also our utilization.\n\nMarie Thibault -- BTIG -- Analyst\n\nOK. That's very encouraging. Thanks, David. And then maybe I'll ask a follow-up here on the AcQCross Qx launch, certainly got a lot of buzz during the quarter, at least when you press release some of that and the compatibility with Watchman.\n\nI would love to hear an update on how that launch is going, what you're hearing, I guess, from your partner as well on that launch. Thank you.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nYeah. So that launch is being fully executed within Acutus. That is one of the products that will transfer to Medtronic when they take over commercial distribution. And the early launch has been very encouraging.\n\nI think we did 11 or 15 procedures on Monday of this week alone, and we are seeing pretty strong uptake of that product thus far, and it actually had a pretty decent contribution in the second quarter, and that obviously helps expand our reach a little bit into structural. That's still EP, but you have a broader diversity of implanters, doing Watchman than you're doing ablation. So we've been very pleased with that contribution and are very confident that when that transfers to Medtronic, that will continue to drive very strong performance with that product as part of that broader septal crossing portfolio.\n\nMarie Thibault -- BTIG -- Analyst\n\nOK. Very good, David. Thanks for taking the questions.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nThanks, Marie.\n\nOperator\n\nOur next question comes from Amit Hazan with Goldman Sachs. Your line is open.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nThanks. It's Phil on for Amit. Thanks for taking the questions, David. Wanted to circle back to the first strategic review comment that you made about driving adoption utilization.\n\nI think the statement was sharpen on commercial strategy prioritized procedure volume over installed base growth. I'm just hoping you can elaborate a little bit more on how that's going to pragmatically be implemented reprioritization of kind of head count, I imagine, is within that, but other initiatives that are going to help drive that to supplement the product development side that you highlighted?\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nSure. So thanks for the question, Phil. And the commercial strategy that we have been executing to focus on procedure volumes, utilization and revenue per procedure, that's something that we've been executing since really the beginning of this year, really the end of the first quarter. And in support of that, we have realigned the incentives of the commercial organization around procedure volumes and utilization in cases where we are installing new capital, we are not paying out incentives upon the installation of new equipment we are only doing so after the completion of a certain number of procedures to align our objective of identifying the right high-value target accounts and then ensuring that our incentives match our strategic objectives.\n\nI would say, the bigger dynamic or element coming out of our strategic review was really about where we're going to focus our R&D programs. And if you look back at the company's history, over the past year or two around the time of the IPO, there was an extraordinary number of programs that this company had under development with an effort to build a broad portfolio. But the reality is, as we looked at our resources and tried to execute a litany of programs, a lot of the efforts of our R&D and engineering team was getting diluted across too many projects and not enough of those projects were really, really aligned to what the market need was that we're trying to solve. And one of the things that we really spend a lot of time doing in this strategic review was understanding why has the AcQMap ramp not achieve the original expectations that had been set forward.\n\nAnd encouragingly, on the one hand, everyone we spoke to reinforced our view that there is a significant unmet need here in complex ablations that isn't being solved by our competitors. And one of the conversations that I had that now has repeated itself several times and I've spoken to some very high-volume physicians who will say my experience with Acutus over the past several years has been kind of up and down and kind of mixed. And I like what you're doing, but I haven't really adopted this product in earnest. And the reason for that is all related to physician experience and workflow.\n\nAnd while we've been very focused and done, I think, a tremendously good job on driving clinical differentiation and filling a market unmet need. We haven't crossed the gap from technology and clinical value to day-to-day physician experience and workflow. And what we're trying to accomplish with our next several launches is to bring all the value that AcQMap brings from a diagnostic perspective to treating a large segment of the population that isn't well served and then make the physician experience as similar to what they're used to on a day-to-day basis to eliminate what's been a very significant barrier to adoption and, quite frankly, one that is probably bigger than we had initially contemplated. And when I have these conversations with doctors, what they still say to me is, while my experience has been up and down at times, I am very interested in continuing to work with you because you're the only company doing what you are trying to do.\n\nAnd I understand that companies go through different life cycles. And I am here to work with you and support you as you execute this going forward. And now, I've had that conversation half a dozen times. And I'm very encouraged that we're going after the right target.\n\nI think what has been missing is that user experience and user and workflow perspective, which we will start to address here in the second half of this year and into next year.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nVery comprehensive. Thank you. The second one I wanted to touch on was the more challenging hospital capex environment. Just hoping you could elaborate on that comment.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nYeah. The capital environment always has some challenges, especially for newer entrants who are trying to both get through capital committee and also prove value proposition. And the biggest thing that we are seeing is just the time lag of administrative reviews is extending and the number of layers of approvals is getting more cumbersome. So traditionally, when selling our capital, we rely on an EP physician champion, a lab manager and a CFO.\n\nWhat we're seeing now is a lab manager, an EP, a cardiovascular service line administrator, sometimes a purchasing manager and a CFO. So we're just seeing more levels of approval required to get through those capital committees, which means the time from initiating a conversation or a capital conversion process to when we're executing it is taking longer than we've seen in the past. And my sense is that those increased layers of review relate to tighter budgets. We haven't heard that explicitly, but it's more that the time to conversion is extending.\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nOK. Thanks again for all the color. Appreciate it.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nThanks, Phil.\n\nOperator\n\nOur next question comes from Javier Fonseca with Spartan Capital. Your line is open.\n\nJavier Fonseca -- Spartan Capital -- Analyst\n\nHello. Thanks for taking my question, and congrats on a solid quarter and the new sort of CEO. My question is along the lines of procedure volume and particularly in international markets. So has there been any sort of update on the AcQBlate penetration on mapping procedures in the EU? Because I know previously the number was around 70%.\n\nAnd I want to know if there's any update and what expectations for that metric going forward?\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nYeah. We did see that number dip a little bit in the second quarter from 70%, down into the 50%s. We have seen it here in July tick back up to 73%. There obviously -- given the number of systems we have installed in the field, we're obviously you're going to see some fluctuations depending on user patterns.\n\nBut we're seeing that trend very nicely back above 70% here in the third quarter. And I think that's a pretty good number to use on a go-forward basis. In the U.S., at least for our internal purposes, we are assuming a much lower penetration next year just because it's going to take some time to get through VAC committees at hospitals. We're going to have to build inventory and ramp that once we gain approval next year.\n\nBut I think 70% to 75% in Europe is a good number to use on a go-forward basis. And obviously, in the U.S., we envision getting there over time, but probably not in year one. OK. And a quick follow-up.\n\nAnd again, this is going out a bit past this year. And -- but assuming in 2023 with market entry in the United States, any sort of specific initiatives taken to -- coming at a lower number, but really putting up somewhere closer to 70% as more time in the U.S. market goes by? Yes. I mean I think that's a very fair assessment.\n\nSo if you look at how things went in Europe, we launched this product in the end of the first quarter of 2021. We actually got to 70% penetration pretty quickly by the end of last year, which is sort of an anomaly for how products launch in Europe. And again, that's off a small number of centers. In the U.S., we are going to use this launch really to accomplish three things.\n\nOne is to increase our revenue per case, right? Right now, we're giving up $2,500 to $3,000 per procedure for not having an ablation catheter. The second is, we do see higher utilization in accounts that have AcQBlate and who are using us as a closed system. And then the third is because of those two factors, we think that can drive an increase in our installed base. So I would look at -- we are going to put a lot of resources behind this launch and hit the accelerator as best we can.\n\nBut I would characterize it today as what will be a progressive and thoughtful launch through 2023 and thereafter.\n\nJavier Fonseca -- Spartan Capital -- Analyst\n\nThanks, David. Very comprehensive answer. Thanks, Dave.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nThanks, Javier.\n\nOperator\n\n[Operator instructions] Our next question comes from John Young with Canaccord. Your line is open.\n\nJohn Young -- Canaccord Genuity -- Analyst\n\nHey, David, John for Bill. Thanks for taking our follow-up. Just a quick question just on the PFA. Where do you stand today of the clinical progress? And just any time lines or any update there? Thank you.\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nYeah. So on PFA, we have completed the first 24 patients in our first-in-human experience. We did 15 patients in November of last year. And then following the remapping of those patients made some changes to our dosing strategy, we treated another nine patients in March of this year and have completed remapping on seven of those.\n\nWe will not complete the remapping on the last two just because of time, but all patients, all 24 patients remain arrhythmia free. Given that we've now completed our first in-human experience, we are taking a look at the data, working with our physician investigators to decide what exactly our path forward is going to be. Our program showed -- we're pretty pleased with how the results trended in the second cohort of patients versus the first cohort of patients. And now that we have the totality of that data, we're taking a look at the program and deciding our strategy on a go-forward basis.\n\nThe reason we're not providing a lot of specifics on timing for PFA or our magnetics program is, I think we've had a bit of a history of getting ahead of ourselves with respect to committing to product development time line. So we will give more specific updates as we firm up the exact plans with each of those programs and how we anticipate marshaling them forward. And I would like to say, we'll have more on this in November, but we're trying to take a prudent approach with respect to commitments around product development time lines.\n\nJohn Young -- Canaccord Genuity -- Analyst\n\nGreat. Thanks. And are there any safety results from those first initial first-in-human patients yet?\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nSo we're not ready to disclose those because we'll probably look for an opportunity actually to publish the results from this first-in-human experience. So we're not releasing any of the efficacy or safety data at this time.\n\nJohn Young -- Canaccord Genuity -- Analyst\n\nGreat. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCaroline Corner -- Investor Relations\n\nDavid Roman -- Chief Executive Officer and Chief Financial Officer\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nAllen Gong -- J.P. Morgan -- Analyst\n\nMarie Thibault -- BTIG -- Analyst\n\nPhil Coover -- Goldman Sachs -- Analyst\n\nJavier Fonseca -- Spartan Capital -- Analyst\n\nJohn Young -- Canaccord Genuity -- Analyst\n\nMore AFIB analysis\n\nAll earnings call transcripts"
}