{
  "companyName": "National Vision Holdings, Inc.",
  "companyTicker": "EYE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/national-vision-holdings-inc-eye-q2-2022-earnings/",
  "content": "National Vision Holdings, Inc. (EYE -0.15%)\nQ2 2022 Earnings Call\nAug 11, 2022, 10:00 a.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the National Vision second quarter 2022 financial results conference call. At this time, all participants are on a listen-only mode. After the speakers' presentations, there'll be a question-and-answer session. [Operator instructions] As a reminder, today's conference call is being recorded.\n\nI will now turn the call over to your host, Mr. David Mann, senior vice president of Investor Relations. Please go ahead.\n\nDavid Mann -- Vice President, Investor Relations\n\nThank you, and good morning, everyone. Welcome to National Vision second quarter 2022 earnings call. Joining me on the call today are Reade Fahs, our CEO; and Patrick Moore, COO, and CFO. Our earnings release issued this morning in the presentation, which will be referenced during the call, are both available on the investor section of our website, nationalvision.com, and a replay of the audio webcast will be archived on the investors' page after the call.\n\nBefore we begin, let me remind you that our earnings materials and today's presentation include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. These statements are subject to risks and uncertainties that could cause actual results to differ materially from our expectations and projections. These risks and uncertainties include but are not limited to the factors identified in the release in our filings with the Securities and Exchange Commission. The release and today's presentation also includes certain non-GAAP measures.\n\nReconciliation of these measures is included in our release in the supplemental presentation. We also would like to draw your attention to Slide 2 in today's presentation for additional information about forward-looking statements and non-GAAP measures. As a reminder, National Vision expects to provide certain supplemental materials for presentations for investor reference on the investors section of our website. Now let me turn the call over to Reade.\n\nReade Fahs -- Chief Executive Officer\n\nThank you, David. Good morning, everyone. Thank you all for joining us today. I hope you're all staying safe and healthy.\n\nTurning to Slide f4 in Q2 summary. For the second quarter, net revenue decreased 7.3% versus our record Q2 sales last year. And adjusted comparable store sales declined 12.4% compared to the record 76.7% increase in the second quarter of 2021. We delivered adjusted diluted EPS of $0.21 for the quarter.\n\nWe're pleased with the bottom line performance this quarter, which reflected the team's strong focus to manage expenses. We expected our second quarter performance would be impacted by the weaker consumer environment, as well as constraints on our exam capacity. As the quarter progressed, economic conditions for consumers further deteriorated. The macro headwinds, including higher inflation, weakened consumer confidence, and risks of recession, are continuing to pressure our lower income, predominantly uninsured customers, especially when compared to record demand last year.\n\nIn terms of constraints to our exam capacity, we feel incrementally better about our capacity situation. While exam capacity remains out of sync with our needs in many of our stores in certain markets, thereby affecting patient traffic, we're making a sequential progress toward improved retention and strong hiring, and continue to project exam capacity to gradually improve by year-end. Despite these challenges, we continued to focus on our growth initiatives. We opened 22 stores, including our 13 hundredth location, and now operate over 1000 stores in our two growth brands.\n\nWe continued our roll-out of remote medicine and are on track to operate in up to 300 stores by year-end. Also, we recently announced a multi-year extension of our current lens purchasing agreement with EssilorLuxottica. We're excited to extend this relationship with a key long-term partner, that allows us to continue to provide our patients and customers with world-class quality lenses at the low price they've come to expect from us. During the quarter, we repurchased $73 million worth of stock to continue our shareholder return program.\n\nFinally, in today's release, we updated our 2022 outlook. We've made significant progress in our cost alignment efforts that should temper the impact of the lower projected revenues on profitability for the year. In a few minutes, Patrick will provide more detail on our Q2 results and updated outlook. Turning to Slide 5.\n\nAs the chart shows, before the pandemic, our business demonstrated consistent performance over time, even amid broader economic challenges. During the great recession of 2008 in 2009, our business generated comps in the positive low to middle single-digits. During the pandemic, the historical consistency of the optical category has been impacted by macro headwinds, especially higher inflation, and temporary disruption to the purchase cycle that has been exacerbated by the multiple wave of COVID variants. The chart on Slide 6 highlights the volatile quarterly comp performance over the last few years and the purchase cycle disruption caused by the pandemic.\n\nTurning to Slide 7. The comp volatility was especially pronounced in the second quarter as the chart in the upper right shows. In addition to the disrupted purchase cycle article, optical consumer demand is being affected by inflationary pressures and a decline in consumer confidence, as well as lapping government stimulus from last year. During the quarter, we experienced modest improvement in comps each month, and as we are now in the third quarter, the back-to-school season has begun amid the ongoing economic uncertainties.\n\nFor us, the back-to-school season consists of two consumer segments, children getting classes for school, as well as a seasonal return of adult customers. While it's still quite early, we've seen a ramp in the traditional younger back-to-school patients. However, we're also experiencing weakness in broader seasonal traffic due to the macroeconomic environment and constraints to exam capacity. Let me expand a little more on what we are seeing in terms of consumer behavior.\n\nOur lower income, predominantly uninsured consumers, are feeling the greatest pressure. Demand softness is noticeably more pronounced for these customers who are paying out of pocket for our products and services. Last quarter, we noticed that we're seeing the beginnings of a trade down of higher income consumers into our stores, what we referred to in the past as nicer cars in the parking lot. We especially are seeing stronger trade-down behavior in markets where our stores are exposed to higher concentrations of higher-income consumers.\n\nWe continue to be in the early stages of this trade down and would expect it to build over time. As noted on our last call, we implemented a pricing change to our signature offer at America's Best in May. Thus far, the consumer reaction is consistent with our expectations. We continue to believe that the signature offer of two pairs of eyeglasses, including a free eye exam for 7995, represents industry-leading value to our consumers.\n\nIn the current inflationary environment, we believe our value offerings should be even more appealing to an even larger slice of the American public. The optical category has been inherently consistent over time due to the biology of the eye, and we believe we will see a return to a more stable and predictable environment in the future. Our business is also facing the challenge of constraints on exam capacity in certain markets. In other words, we cannot fulfill the demand for exam appointments in some stores due to the lack of an available optometrist.\n\nOur team is working hard to expand our exam capacity to mitigate this impact. This quarter, I'm pleased that we are making incremental progress on multiple fronts. First, our retention levels stabilized in Q2 and we are up versus last year. This is a testament to multiple recent initiatives to drive retention, which are being executed by a new level of clinical management.\n\nIn terms of hiring, our increased investments in recruiting continue to pay off. Year-to-date, we've experienced strong hiring of optometrists. We're beginning to see the wave of new hires who had delayed start dates, arrived to practice, and expect this benefit to begin to accrue in the third quarter. Lastly, we remain excited about our remote medicine initiative to help address our historical and ever-present need for optometrists to keep up with the demand for items that are stored.\n\nWith the accelerated roll-out, we are on target to operate remote medicine in up to 300 stores by year-end, which would represent nearly 30% of the stores in our growth brands. In stores that have operated remote exams for the longest period, we are continuing to see a significant ramp in operating productivity. We're extremely pleased with the increase in exam capacity being added by remote medicine, and the role it can play in serving more patients across both geography and time. Because of these initiatives, we expect that our exam capacity should gradually improve by year-end.\n\nSo we are in an unusual operating situation today, in that we are simultaneously facing both demand headwinds across our network of stores, given the current macro environment, as well as a supply challenge in a smaller subgroup of stores due to the constraints on exam capacity. But we see these as temporary, and we remain confident in the long-term strength of our business model. Shifting to Slide 8, in addition to our exam capacity and remote medicine efforts, we continue to progress other core growth initiatives. New stores remain a primary focus as we continue to see a sizable wide space opportunity.\n\nWe had 22 openings in the second quarter, including two more eyeglass world locations as we ramp up the expansion of this brand. We continue to plan to open at least 80 stores in 2022, and currently have a solid pipeline of specific locations for this year and into 2023. Marketing continues to be a key factor in driving traffic to our stores given the infrequent purchase cycle for eyeglasses. In the current environment of high inflation, we believe our value messaging will resonate with budget-conscious consumers.\n\nOur focus in 2022 has been to optimize our marketing investment, and we are pleased to be leveraging marketing expense in a difficult environment. Our participation in Vision Insurance programs continues to be a positive revenue driver, especially in the current environment. In the second quarter, we experienced growth in sales tied to Vision Insurance as insured consumers because the insurance funds most, or all of their purchases are not deterred from shopping in a tight economy. Our comps related to managed care were positive and continued to outperform comps from uninsured consumers.\n\nThis is a reversal from last year's period of economic stimulation when the uninsured business was stronger than the managed care business. We remain underdeveloped relative to the category and continued to see an ongoing opportunity here as managed care dollars and co-pays tend to go further in our stores than elsewhere. And before turning the call over to Patrick, let me comment on the exciting leadership update that we provided today. Patrick has been appointed chief operating officer in addition to his current role as CFO.\n\nPatrick has done great work as our CFO. He's been instrumental in our growth and success, especially in navigating National Vision through our IPO and important early years as a public company. Patrick has been a terrific partner to me, and I'm really looking forward to continuing to work with him in this new role as we look to drive growth, and accelerate our value creation initiatives. At year-end, Patrick will be stepping down as CFO.\n\nAs part of our planned succession, we are so pleased to be announcing Melissa Rasmussen will become National Vision's new CFO starting January 1st. As chief accounting officer, Melissa has been a vital member of our leadership team for the last three years. Melissa is an incredibly talented executive, and as we've worked on the succession plan for a while, I believe she will be an excellent CFO. At this point, let me turn the call over to Patrick for more detailed discussion of our financial results and the 2022 outlook.\n\nPatrick Moore -- Chief Financial Officer\n\nThank you, Reade, and good morning, everyone. It has been such an enormous privilege to be this company's CFO for the last eight years, and I look forward to continuing to contribute in my new position. I also want to say how pleased I am that Melissa will serve as our next CFO beginning in January. Melissa and I have worked side by side for the last three years, and she is an outstanding leader for the team.\n\nTogether, we are executing a seamless and effective transition. Now let's start on Slide 10 for some additional financial detail on the quarter. As a reminder, the second quarter of 2021 had the tailwinds to revenue and profitability from pent-up demand from store closures, the benefit of government stimulus, and an elevated average ticket. In Q2 2022, net revenue decreased 7.3% compared to 2021 due to macroeconomic headwinds, constraints to exempt capacity, and exceptional growth last year.\n\nThe timing of unearned revenue was inconsequential, this quarter benefiting revenue growth by 0.2%. During the quarter, we opened 20 new America's best stores, and 2 Eyeglass World stores for a 5.2% increase in store count. For our America's Best and Eyeglass World Growth Brands combined, unit growth increased 6.9% over the last year. Adjusted comparable store sales declined 12.4% versus 2021, compared to a record 76.7% increase in the second quarter of 2021.\n\nQ2 comparable store sales were impacted primarily by a decline in customer transactions. Average ticket declined slightly year-over-year. We remain encouraged by the fact that our average ticket has generally stabilized this year, helped by pricing actions and successful product introductions like blue light. Turning to Slide 11, as a percentage of net revenue cost applicable to revenue increased 310 basis points, or better than our expectations of a 400 to 450 basis point increase.\n\nThis increase was driven by deleveraging of optometrist-related costs, reduced eyeglass mix, and lower eyeglass margin. The better-than-expected performance primarily resulted from the relative stability of average ticket. Adjusted SG&A declined approximately 1% due to disciplined cost management this quarter. Adjusted SG&A expense percent of net revenue increased 280 basis points.\n\nThe key factors behind this increase were the deleverage of store payroll and occupancy expense from lower revenue, partially offset by lower incentive compensation and lower advertising investment. We now expect advertising to be slightly leveraged in 2022. Our store and marketing teams have done an excellent job realigning their cost structures to the current environment. Adjusted operating income decreased 58% to $28 million, and adjusted diluted EPS decreased 57% to $0.21.\n\nTurning to first half 2022 results on Slide 12. Compared to 2019, despite the challenges this year, net revenue increased approximately 17%, and adjusted diluted EPS increased 8%. Now turning to Slide 13, our balance sheet in liquidity remain strong. At the end of the second quarter, our cash balance was over $254 million, and total liquidity of nearly $550 million, when including available capacity from our revolver.\n\nWe ended the quarter with total debt of $569 million, net debt to adjusted EBITDA was 1.3 times. While our term loan debt has a variable lever-based interest rate, this debt is more than fully hedged, and further increases in our base rate above 1.8% would be helpful to our net interest expense and cash flows. Year-to-date, we funded $56 million in capital expenditures that were primarily focused on new store and customer-facing technology investments. We remain on track for 2022 CapEx in the range of $110 to $115 million, as we continue to invest in key growth initiatives, including our remote medicine roll-out.\n\nIn the second quarter, we continued our shareholder return program and repurchased 2.6 million shares for a total of $73 million, and have $50 million remaining under the current share repurchase authorization. Since the inception of our share repurchase program last November, we have repurchased 4.2 million shares for $150 million. At the end of the quarter, inventory per store grew less than 2% on a year-over-year basis. We are comfortable with the current level of inventories and their ability to support our 2022 growth plans.\n\nOur merchandizing, and distribution teams continue to execute very well to help us manage through the current challenging supply chain environment. Overall, we believe that our financial strength and our commitment to invest in our business remain a competitive advantage. Turning now to our outlook on Slide 14, and 15. I'll conclude with some commentary regarding our updated 2022 outlook, which we included in today's earnings release.\n\nAs we all know, the dynamic operating and macro environments are extremely uncertain. The updated fiscal 2022 outlook reflects the currently expected impacts related to macroeconomic factors, including inflation, geopolitical instability, and risk of recession, as well as the ongoing COVID 19 pandemic in constraints on exam capacity. Against the backdrop of what we know today, our updated 2022 outlook projects net revenue between $1.99 to $2.02 billion, adjusted comparable store sales growth compared to last year in a range of -6.5% to -8%, adjusted operating income between $85 to $100 million, and adjusted diluted EPS between $0.65 and $0.77, assuming $80.1 million weighted average diluted shares. I'd like to share some underlying assumptions in our outlook.\n\nGiven the uncertain environment, we continue to maintain a more conservative posture for our updated outlook. The high-end and low-end of the top End revenue ranges represent two potential scenarios for consumer demand for the rest of the year. At the high end of the ranges, we're assuming continued pressure on consumer demand over the remainder of the year, including a modest back-to-school season, as well as gradual improvement in exam capacity. At the low end of the ranges, our comparable store sales and revenue assumptions reflect further deterioration in the macro environment.\n\nCompared to the previous fiscal 2022 outlook provided in May, our updated outlook includes lower projected ranges for comps and net revenue to reflect the deteriorating macro environment, exam capacity, and current trends. Our update outlook also projects that the impact of these lower revenues is expected to be significantly offset by cost alignment efforts, primarily in-store payroll, advertising, and corporate overhead. The team has taken smart tactical actions to align costs with the revised near-term revenue outlook. Even amid the difficult macro backdrop, we are continuing to invest in the business, and key initiatives, and our store growth and capital expenditure plans remain unchanged.\n\nOur ongoing commitment to investment is further evidence of our confidence in the future of the business. As you model the second half of the year, we now expect comps to be in a negative mid-single digit range. The improving trend versus the first half performance reflects easier comparisons, moderating average ticket pressure, and increased exam capacity. We are projecting Q3 comps in the range of negative mid to high single digits, and Q4 in the negative mid to low single digits.\n\nStore openings this year will continue to be predominantly America's best locations, coupled with a doubling of eyeglass world openings, we are on track to open at least 80 stores, and we projected a few closings as is typical each year. I would like to express my thanks to our real estate team for successfully navigating the growing supply chain challenges to date. Let me share a couple other factors assume that our outlook for 2022, we're excited about the accelerated roll-out of our key remote medicine and EHR initiatives. As Reade noted earlier, we are seeing a significant ramp in operating productivity in remote medicine, such that we now anticipate incremental dilution to be approximately $3 million or one-half of our original estimate.\n\nWe continue to expect that the timing of unearned revenue will have a negative impact in 2022. We continue to estimate this 2022 impact on adjusted operating income to be about $9 million, with approximately half of the impact expected to be realized in Q3. As a reminder, unearned revenue recognition is a 7 to 10-day timing impact that can affect our quarter-to-quarter and annual comparisons. For full-year 2022, as a percentage of net revenue, we now expect cost applicable to revenue to increase 325 to 350 basis points versus last year, primarily due to the deleveraging of fixed cost, as well as the lapping of last year's record performance that benefited from product mix shift and an elevated ticket.\n\nFor Q3, cost applicable to revenue are expected to increase about 400 to 425 basis points versus last year. In terms of expenses, we continue to expect 2022 adjusted SG&A to increase between 125 and 150 basis points as a percentage of net revenue year-over-year. The SG&A increase primarily reflects sales deleveraging and to a lesser extent, higher levels of wage investments, with a partial offset from advertising leverage. To assist with modeling, we have also provided some additional assumptions on depreciation, and amortization, interest in tax rates.\n\nIn summary, while there are significant challenges in the current environment, I have every confidence in the underlying health of our business and our value proposition. We continue to view the current issues as transitory. In the interim, our management team is focused on what we can control, continuing to invest in key growth initiatives, and taking the necessary actions now to return the business to a growth trajectory. At this point, I'll turn the call back to Reade.\n\nReade Fahs -- Chief Executive Officer\n\nThank you, Patrick. Turning to Slide 16 in our Moment of Mission. For a Moment of Mission, let me introduce Dr. John Jett, an optometrist who is practiced for 28-years, including about seven years with National Vision, and it has performed remote exams in our stores for over a year.\n\nRecently, a female patient booked an appointment for a newly available remote exam with Dr. Jett in an America's Best Store. Her chief complaint was blurry vision, and she assumed she just needed new glasses. Because money was a concern, she put off seeing an eye doctor for some time.\n\nWhen she could afford to do so, which America's best affordability made possible sooner than other options, she scheduled a remote appointment with Dr. Jett on the day when an exam with an in-store doctor was not available. During the remote exam, performed from a location over 500 miles away from the store, Dr. Jett saw a medical condition on the retinal image that required urgent care.\n\nHe sent the patient to the emergency room immediately with a recommendation for a spinal tap. Within 2-hours, the patient was airlifted for emergency brain surgery, where a 2.5-inch tumor was removed. As we say, a routine eye exam is routine until it isn't. When every second counted for this patient's life, our remote capacity made it possible for Dr.\n\nJett to give her an exam that ultimately saved her life. When we talk about access to eyecare, this is what we're talking about. This is our mission, affordability, and access to eyecare, and its lifesaving best, and an example of how remote capabilities are making it possible for us to create greater affordability, greater accessibility, and ultimately make profound, even lifesaving impacts on patients' lives. I want to thank our entire team at National Vision, a network of optometrists, including those performing remote exams like Dr.\n\nJett, who provide much needed medical services to patients at our over 1300 storefronts every day. In summary, the key takeaways from today's calls are these. After 18 years of consistency and predictability, the pandemic era has temporarily made the optical market and consequently our business more volatile. We believe that the marketplace over time should return to trends more consistent with the pre-COVID era, especially as our customers eyes only continue to get worse with time, and we remain a low-cost provider of this medical necessity.\n\nWe operate in a highly fragmented industry with ongoing structural tailwinds such as an aging population, and increased eyestrain from such things as greater screen usage. And we believe that several initiatives, including our remote medicine roll-out, should help us to get our exempt capacity more in line with the demand that is there for exams at our stores. Thus, despite the current challenges, our confidence in our mid and longer-term prospects remains unchanged. This concludes our prepared remarks.\n\nAnd at this time, I'd like to turn the call back to the operator to start our Q&A session.\n\nOperator\n\nThank you. [Operator instruction] Our first question comes from Kathleen Rennick of Goldman Sachs. Your line is open.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nActually, this is Kate McShane from Goldman Sachs. Thanks for taking our question. We were interested in hearing a little bit more about the sequential improvement you could be seeing as a result of customers trading down. It sounds like it maybe was a little bit more than what you saw in Q1, but are there any more details around quantifying it that?\n\nReade Fahs -- Chief Executive Officer\n\nThank you, Kate. We are seeing nicer cars in the parking lot emerging gradually. And this is not out of line with sort of what we remember back from the 0809. And it is happening more in the markets where there are sort of wealthier consumers.\n\nWe're seeing that in a more pronounced way. So that is occurring. I will say sort of the comps throughout the month were improving modestly month-to-month for that. That was somewhat encouraging in nature.\n\nBut we're at the beginning stages of the nicer cars in the parking lot, and we expect that to build over time.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nOK. Thank you,  and as a follow-up question, we wanted to ask about price increases, which I think were implemented later in the first quarter, and the beginning of the second quarter. Just any kind of detail around the impact on the comp in the quarter, and for the second half, and what the U.S. response has been to that higher prices? It's been quite a while since you increase the exam price.\n\nReade Fahs -- Chief Executive Officer\n\nIt has been quite a while since we increased the price. I will say the effect has been right in line with our expectations. We feel that this was the smart thing to do. We're pleased with that, we're always in touch, we're very in touch with our store associates who were saying.\n\nThey actually were expecting it to be a bigger event, and it was a nonevent at the store level. To a low priced model, we believe the gap between us and our competition is going to only increase in these inflationary environment. But we think that was the right call, and we feel real good about it.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Simeon Gutman. Your line is open.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey, if you said Simeon, then I guess I can ask. Back to the case question. I guess you prefer not to answer regarding a price increase, like how much it's helping the comp? Just to clarify, and then can you discuss how it impacts the incremental margins? Meaning, do we get back to a average rate of incremental flow-through with the price increase? Does it help relative to history or does it not fully account for all the costs that are running through the business?\n\nPatrick Moore -- Chief Financial Officer\n\nHey, Simeon. Good morning, this is Patrick. Yeah, we had modeled. Obviously, you can do the math on the percentage increase on that base offer.\n\nAnd we had modeled a certain percentage of volume deterioration on a short-term basis where we were expecting to see net benefit out of that this year, and we are. So Reade was confirming that. As I look at that, as I kind of think more broadly and think about that entry-level pricing and what we're delivering to the customer in terms of value. It's at a margin this lower than the aggregate eyeglass margin, but it's still quite healthy.\n\nAnd we get a lot of customers that come in and take that base offer and also add one or two things to it as well. Pricing did help, net helped the second quarter based on that net advantage that I discussed.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. My follow-up, its more high-level looking at some metrics from 2019 compared to today. There's a couple of things that stand out. It looks like sales per store are not really higher versus that period.\n\nGross profit per store is down a little as well, and SG&A is up not on unreasonable amount, but it's having this pronounced effect on the [inaudible]. So there's a lot of deleverage and I'm sure you see the same thing. So in terms of explaining it, it either means maybe the business isn't gaining share, maybe you're opening too many stores. Either you're not raising price enough or you're under earning, and this all gets rectified next year.\n\nI know it maybe a combination of all the above, but curious how you look at these, the growth versus 19.\n\nPatrick Moore -- Chief Financial Officer\n\nYeah. And I think we've given some of these numbers before I'll update them here for you. As you think about 2022, there has been a large-scale impacts and frankly, body blows in the out of the gates, severe on the crime period. We disclosed a figure, I don't remember it offhand.\n\nWe have seen continued weakness, macro challenges. And we've kind of called out a couple hundred million in sales that, frankly, as we started the year we would have expected to see. And you've seen that as we've adjusted guidance. So to me, the big impact is the large headwinds that the business has faced this year beginning as early as January 1st.\n\nAnd we do not see that those headwinds are going to continue in that degree. So I think that it's a tough time to look at those metrics. I agree with you. We're obviously looking at the same things, and I think that as I think about the future, I go back to 2019 as a baseline.\n\nI think about where did we peak across the pandemic in 2021 when stimulus was high, volumes were high. And it's going to be somewhere between those two, probably not at the peak. But I do think we're going to see some improvements coming off 19.\n\nReade Fahs -- Chief Executive Officer\n\nAnd to another part of your question is, Simeon, we do not believe we're losing market share. We think we are holding our own in terms of market share, which we think is impressive given our consumer, and the impact of inflation on our consumer, and the fact that managed care is such a small part of our business, and also given the market share gains we've had in recent years. But we do not believe we're losing market share.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThanks, both. Appreciate it.\n\nOperator\n\nThank you. Our next question comes from Stephanie Wissink of Jefferies. Your line is open.\n\nStephanie Wissink -- Jefferies -- Analyst\n\nOne, we wanted to explore the supply and demand balance. And if you could just help us think through what percentage of opportunity do you think you're missing because of capacity, and how much do you think remote medicine can help close that gap? Give us some sense of maybe what you're implying in the back half guidance, but also how much you think you're leaving on the table with respect to just the capacity constraints you're experiencing.\n\nReade Fahs -- Chief Executive Officer\n\nYeah, we think sort of the macroeconomic environment, and the capacity issues are roughly in balance in terms of their impact on our business. And therefore, as we increase all the capacity, we are expecting that to be quite favorable for us. Again, we're pleased that retention is improving and up versus last year. We are having a very strong recruiting season, and as we accelerate remote, that should help as well.\n\nBut in essence, we see it sort of balanced and we see with remote a nice jump in productivity overall. So we're encouraged by that and we think it's important. \n\nPatrick Moore -- Chief Financial Officer\n\nYeah. I would just add one other point on remote. As we started the outset of the year, we discussed a figure of about $6 million of net dilution, and that's all the remote benefits to profitability less the start-up and ramp cost. We've effectively cut that in half as we move through the year based on what that initiative is providing us, especially in those markets where we started early in the year with remote that really needed the assistance from remote.\n\nStephanie Wissink -- Jefferies -- Analyst\n\nPatrick, if I could offer one follow-up. On the average ticket, it was really encouraging to see that stabilized from quarter-to-quarter. I also want to make sure we're hearing what you're saying about back-to-school with the children's business outperforming maybe some of the traditional seasonal adult business. Do you anticipate average ticket could dip in the third quarter before it recovers in the fourth quarter? Are you assuming that it stays quite stable, given a full quarter of the price increase in the base business?\n\nPatrick Moore -- Chief Financial Officer\n\nThanks for the question. So as we thought about ticket and gross margin, we are guiding toward a little dip in ticket. And there's some conservatism in that which I think is continues to be warranted. And a dip is seasonal, we do see with under 18 client customers being served, we see the ticket typically drop.\n\nAnd we're just also watching macro challenges for that a lower income consumer. So we do have it dipping somewhat through the third quarter. We're happy that in general it's significantly above 2019. We've taken some price increases along the way, we've added blue lights to lens options and we're seeing that on a pretty good take up.\n\nSo all in all, we've been really pleased with course ticket has stabilized this year, so any short term dip in that, we're really not that worried about it.\n\nOperator\n\nThank you. Our next question comes from Adrienne Yih off Barclays. Your line is open.\n\nAdrienne Yih -- Barclays -- Analyst\n\nGood morning. Thank you for taking my question. So, Reade, I'm going to go back to the exam capacity because that seems to be where you can get a lot of kind of incremental margin and profit flow-through. Where is the exam capacity today versus sort of more normalized? And then the remote medicine is offering up is going to be in 30% of stores, in 300 stores when it is fully rolled out.\n\nBut how much does that increase exam capacity? Because I'm assuming that being in the stores is going to be materially higher, kind of in a percentage of increases for the exam. And then, Patrick, where is your break-even point in the back half? How should we think about that for COGS, SG&A, and then the reduction you call that store payroll hours. And so I'm wondering, is that reduction in hours, or reduction in staffing, does that impact or the productivity of the stores that you're trying to achieve? Thank you very much.\n\nReade Fahs -- Chief Executive Officer\n\nI'll take the first part. Adrienne, you're right, Optometric capacity is a key focus area for us. And again, we're pleased that retention is up versus last year and improving. And we're pleased that our hiring is going very well, and remote is a key part of the improvement program that we have.\n\nWe are seeing incremental progress in exam capacity with every month, and we're expecting it to improve by year end. We don't go into a lot of detail on the exact specific productivity related to remote because it's an internal program that we have and like to keep it as such. But you're right, what are we believing is going to help us going forward is improvements in capacity. What are we seeing? We are seeing that occurring, and we're expecting continued improvement by the end of the year.\n\nPatrick Moore -- Chief Financial Officer\n\nYeah. On the break-even conflict is really where we've been for quite a while. It's in that 4% to 5% range in terms of a comp leverage point, we're obviously guiding significantly lower that in the second half of this year. But we have been, I think, making really nice, smart cost reduction decisions.\n\nA large component of our cost is store labor. And we do our best to match the labor to the level of demand that we're seeing and expecting our that's not easy. Our store teams have done a really nice job working through that. We're going to also leverage advertising in a year where I know that's betting most people would have expected we could do that.\n\nSo I've been really pleased with how our marketing teams have navigated that as well. And finally, we've taken some degree of cost out of some of the corporate areas, but frankly, not a lot. We're still focused on building 80 plus stores. We're focused on remote medicine rollout.\n\nWe're focused on omni channel initiatives around the edge. We're still moving forward, knowing that at some point the biology of the I think those are not referable, and we're going to be ready for it. So when I talk about smart cost reductions, it's we think they're well fitted now, but we also think they're not too deep such that we can't come back and accept demand when we see that improve.\n\nAdrienne Yih -- Barclays -- Analyst\n\nAnd then a really quick question on Walmart, the operated stores, are they performing in kind with your core and similar to your core?\n\nReade Fahs -- Chief Executive Officer\n\nYeah. The Walmart stores are roughly in line with the America's best stores in terms of comp performance.\n\nOperator\n\nThank you. Our next question comes from Michael Lasser of UBS. Your line is open.\n\nMichael Lasser -- UBS -- Analyst\n\nMy question. So we do understand that market share data is difficult to come by. You do have some publicly traded competitors that are generating positive growth. So what's driving your belief that you're not losing market share? And if you're not losing market share and it's just that core customer is deferring the purchase of a medical necessity that they'll eventually have to make.\n\nAnd you're going to improve your capacity. Is it reasonable for us to expect that when you get into a more normalized economic period, perhaps in 2023, that there's going to be outside comp gains to retrace some of what was lost this year?\n\nReade Fahs -- Chief Executive Officer\n\nI'll take the market share a piece of that. And Patrick will tie into your second part of your question. So our cross-referencing on market share relates to talking to some of the larger vendors who deal with all aspects of the industry, and sort of are touching all aspects of the industry. And they have reinforced to us that we are not losing market share from talking to the large insurers, and seeing where we are in terms of market share within their portfolio, and also watching the trends of online, which the recent data suggests that continuation of the online consumer is returning to stores, post-pandemic when stores reopened.\n\nSo those are the three factors that give us our confidence in our market share.\n\nPatrick Moore -- Chief Financial Officer\n\nI think the other thing that I would add is you have to be so careful with is good growth over what, and when did each of these competitors close reopen and gain traction again? We found that, as you look at just grow the rates this year, you've got really got to go back a couple of years and understand what was that growing over, which also contributes to at least neutral, maybe slightly possible market share? You know, I would say on the second question that 2022 has had multiple challenges, I hope would not repeat, we're not going to get into 2023 expectations today. We do know that this business is performing very well over the long term, and can grow through challenging economic times. So I'm still focused in the mode that we're going to have hopefully, less challenges next year, which kind of gets to how are we thinking about comps.\n\nReade Fahs -- Chief Executive Officer\n\nAnd to the first part of Patrick's comment. I am very proud of the crisp execution we had coming out of the pandemic. Amongst the first to reopen in a very safe, high protocol manner when others were not sort of opening as rapidly. Our ability to do eye exams when others were having constraints on their capacity.\n\nAnd so we are up against healthier numbers than many others had.\n\nMichael Lasser -- UBS -- Analyst\n\nOK. My follow-up question is on the long-term margin outlook, given some of the cost reductions that you've taken such that you'll be able to maintain your operating income outlook in the phase of lower than expected sales. Should we assume that your normalized margin over the long-term is going to be higher than what it was previously on the same level of productivity? Or as your sales come back, some of these costs might come back as well.\n\nReade Fahs -- Chief Executive Officer\n\nYeah. Mike, so if I think about the what transpired with margins, we saw margins improve nicely in 2019. And then this current chapter took hold, which was a period of ugly margins and stores were close, followed by explosive margins. I think that we're going to be north of 19, and not providing long-term guidance today.\n\nBut I will say that as we've mentioned, there've been some large impacts to margins this year, i'm still hopeful that we're going to see margin improvement. As I think about returning to positive comps, we're laughing away to investments. I think remote medicine is going to provide productivity, improved benefits. We've just secured a very critical long-term contract with a major hospital supplier that we discussed.\n\nAnd, frankly, we generally [inaudible] out some minor productivity gains every year, and we're still focused on leveraging advertising. So I think, ticket has stabilized as we see some improvement in demand, I think we're going to see a reversion back to better than 19 volumes. And at the end of the day, we've taken some cost out and I suspect that to play through as well.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. Our next question comes from Dylan Carden, William Blair. Your line is open.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nI'm just curious, you're speaking to obviously the macro headwinds, but there seem to be some sort of nuances as well, as it relates to capacity constraints. I'm wondering maybe even your price increases, and maybe even pullback in marketing if that's having some impact and sort of combined those non-macro issues. If you could just really speak to the magnitude as you understand it, that sort of embedded in your current performance. And then the [inaudible] eye, how long do you typically see this sort of lower income customer defer that purchase? We go back to other periods of economic uncertainty.\n\nThanks.\n\nReade Fahs -- Chief Executive Officer\n\nI'm really pleased you asked that because describing our business at a macro national level can be confusing. Because there are the brand is softening sort of nationally as the inflation and all is a national phenomenon. But our capacity issues are highly localized down to specific stores and markets. And so in those, there is underserved demand.\n\nThere's unserved demand where if we had exam capacity, we would be doing better because their customers we aren't serving and they're booking out further and further and in advance. And it's just harder in that way. So I think it's really important to point out the balance between that. So we're trying to describe things nationally and the localized demand that we could be serving if we had more capacity as we are continuing to progress possibly on a capacity front.\n\nWe watch our marketing very carefully, and we think we are getting that at the right level. And luckily it's a very sort of quantitative, a very quantitative art there. On your second question. So, we've found that a consumer can put off for many months not seeing well, it's frustrating, but so is not being able to pay your rent, and so one can put it off.\n\nAgain, what we found in the last recession was that some of our lowest income consumers did drop out and just said, I'm going to suffer through not being for till I'm a little bit more flush. And that was when sort of the nicer cars in the parking lot piece started to occur. And again, we're starting to see the beginnings of the nicer cars,and especially in markets where there's a lot of more wealthy consumers are around driving natural cars.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. Our next question comes from Zach Fadem of Wells Fargo. Your line is open.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nMorning. So this is now the second quarter in a row that you've knocked down your 22 outlook, even with some Q2 upside. So can you talk through the change in your back half assumptions, and what gives you the confidence today that you're now in the right place? And then second, Patrick, is there any extra detail you can share on the margin cadence from Q3 to Q4, and whether you're assuming positive operating income in Q4 despite the unearned revenue headwind?\n\nPatrick Moore -- Chief Financial Officer\n\nSure. Let me take both of those, Reade. If you go back to May, and think about our guidance, we set two, we set an upper range, and for that upper range, we indicated that would be gradually improving consumer demand. Significant hiring, and hiring for doctors at the lower end.\n\nWe said both of those would weaken. We did see consumer demand not improve. We actually saw it further degrade. And we did see some of our doctor hiring start dates still a bit.\n\nWe saw some increased vacation levels over what we saw historically felt, seen. And so we did come off the top end for sales and in comps. The new ranges, the scenarios, we expect demand for the rest of the year at the top of our range to be about where it is now. We do expect to see decent doctor hiring.\n\nSo we're you have started to see the beginnings of that with the new grads coming on board. And so that's kind of our top range. Bottom in the range is really less about doctors and far more about consumer demand. And that's why we've been working through some nice, disciplined, smart cost management decisions.\n\nSecond question, in terms of margins, Q3 to Q4. First, I'll talk about Q2 to Q3. So we do expect to see some deterioration in gross margin from Q2 to Q3. And that's really a function of eyeglass margin.\n\nI mentioned earlier, we were expecting to see a little bit of a ticket dip based on macro pressure in back-to-school. And also, when you doctors come on board, they have a low ramp, takes a little time for them to come up to speed, and so there's somewhat of an investment period there. We think that's what's probably driving on 3 to 2. And I think we have a better opportunity for margin to improve in Q4.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nGot it. And then you notch down the expected gross margin dilution from remote medicine. Should we read this as lower cost to implement? Or is this more about better uptake from consumers than expected? And then second, is there any way to quantify the productivity or throughput improvement per store, for remote medicine stores versus non remote medicine stores?\n\nPatrick Moore -- Chief Financial Officer\n\nSo the less dilution is about scaling a little more rapidly than we had originally planned when we put that first dilution figure out. So that is a things that are going well, less dilution. If not, we're scaling that back, less dilution. We have not really released productivity lifts, but because we really in about a year or so under [inaudible] to see what we're getting there.\n\nOur some markets where we really needed doctors, we were low on doctors, and we put remote in there earlier in the year. And that's provided double digit kind of benefits in terms of productivity. Not all markets will look like that, because some other markets had better levels of doctors capacity. But in the initial areas where we rolled it out, where we really needed the assistance from remote medicine capability, we did see significant impact.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nGot it. Appreciate the time. And Patrick, congrats on the new role.\n\nPatrick Moore -- Chief Financial Officer\n\nThank you very much.\n\nOperator\n\nThank you again. [Operator instruction] Our next question comes from Bob Drbul of Guggenheim Partners. Your line is open.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nFirst off, congrats, Patrick, Melissa, and David on your new roles. And I wanted to dig deeper into the traffic in stores. Can you expand on that with the introduction of remote? Is there going to be any cannibalization from your own customers? Do you expect more people coming in? And my follow up on a data analytics around remote. I'm just curious like either like other any additional data points collected that can be like potentially utilized, for example, to increase the penetration of digital sales? Or any color on that.\n\nThank you.\n\nReade Fahs -- Chief Executive Officer\n\nWell, just thinking about the patient journey, they get to the moment where they say, I am ready to act. My vision is now sufficiently bothering me that I need to book an appointment. And they are aware of our grand and our great value. And so they reach out to us if it is, you know, if we don't have a doctor available or if it's two or three weeks to get an appointment, they might be patient, and they might say, Well, I actually wanted to do this week, I'll see if I can find an exam someplace else nearby.\n\nSo the loss of a potential customers by not having an exam available when they want them because, you know, we are an impatient culture is what remote addresses in markets, where either they have to wait a few weeks or where they're we don't have a doctor in those specific minority of our market, but that's how the demand works, and there is a lot of data that we collect from remotes that we think could be of nice factor in various evolutions of our company in the future. We have lots of data is often something that is useful in many unexpected ways. And of course, the remote exam is highly digitized.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nGot it. And a quick follow up on optometrist in the industry. Is it the lack of the industry wide or you said is it like just trying to clarify, is it like poor location?\n\nReade Fahs -- Chief Executive Officer\n\nI mean, there are is a shortage of optometrists in America. An unusually high number of eye punches retired at the present time. If you're thinking of saying are going to retire in a year anyway, maybe I'll just throw in the [inaudible] now, I think the number is 2% to 3% of doors of independent doors shut during the pandemic. And frankly, I think what we're seeing among optometrists, something we're seeing in a lot of the workforce, was an increased desire for flexibility.\n\nSo, people who were five day doctors, when I say, you know what, I have decided I'd like to be a four day doctor. And so that's a factor in this. You know, the schools do not graduate any greater number of optometrists every year. So now, there is a need because there aren't as many.\n\nThe usual cycle of generation to retirement of new to retired has been thrown off, and there is an increased desire for flexibility in a variety of ways that we are addressing in a variety of ways, but it's different to different than it was pre-pandemic.\n\nOperator\n\nThank you. That concludes today's conference, I'd like to turn the call back over to Reade Fahs  for any closing remarks. \n\nReade Fahs -- Chief Executive Officer\n\nValerie, thank you very much for your great management of the call. And we'd like to thank everyone who joined us today, and all of our stakeholders for your continued support. We look forward to speaking with you again when we report our third quarter results. Thank you all very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid Mann -- Vice President, Investor Relations\n\nReade Fahs -- Chief Executive Officer\n\nPatrick Moore -- Chief Financial Officer\n\nKate McShane -- Goldman Sachs -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nStephanie Wissink -- Jefferies -- Analyst\n\nAdrienne Yih -- Barclays -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nDylan Carden -- William Blair and Company -- Analyst\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nMore EYE analysis\n\nAll earnings call transcripts"
}