{
  "companyName": "Tremor International Ltd",
  "companyTicker": "TRMR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/14/tremor-international-ltd-trmr-q3-2022-earnings-cal/",
  "content": "Tremor International Ltd (TRMR -1.53%)\nQ3 2022 Earnings Call\nNov 14, 2022, 9:00 a.m. ET\n\nOperator\n\nWelcome to Tremor International third quarter and nine months ended September 30th, 2022 conference call. [Operator instructions] This conference call is being recorded, and a replay of today's call will be made available on the investor relations section of Tremor's website and will remain posted there for the next 30 days. I will now hand it over to Billy Eckert, senior director of investor relations, for introductions and the reading of the safe harbor statement.\n\nBill Eckert -- Senior Director, Investor Relations\n\nThank you, operator. Good morning, everyone, and welcome to Tremor International's third quarter and nine months ended September 30th, 2022 earnings call. With us on today's call are Ofer Druker, Tremor's chief executive officer; and Sagi Niri, the company's chief financial officer. This morning, we issued a press release, which you can access on our website at investors.tremorinternational.com.\n\nDuring today's conference call, we will make forward-looking statements. All statements other than statements of historical fact could be deemed as forward-looking. We advise caution in reliance on forward-looking statements. These statements include, without limitation, statements and projections about our anticipated future financial results, including discussions about our revenue, margins, expenses, and guidance for full year 2022 and full year 2023, as well as future business; anticipated benefits of Tremor's strategic transactions and commercial partnerships; anticipated features and benefits of Tremor's products and service offerings; Tremor's positioning for future growth in both the U.S.\n\nand international markets in the fourth quarter of 2022 and beyond; Tremor's implementation of a substantial share repurchase program while also continuing to evaluate strategic opportunities to acquire companies and invest in technology, product sales, and marketing to further expand its platform; Tremor's medium- to long-term prospects; management's belief that Tremor is well positioned to benefit from anticipated future industry growth trends and company-specific catalysts; the potential negative impact of inflationary pressures, rising interest rates, geopolitical macroeconomic uncertainty, recession concerns, and the widespread global supply chain issues that have limited advertising activity and the anticipation that these challenges could continue to have an impact for the remainder of 2022 and beyond; the anticipated impact of the FIFA World Cup on Tremor's anticipated performance; the anticipated benefits from the company's investment in VIDAA and its enhanced strategic relationship with Hisense; the anticipated benefits and synergies from the Amobee acquisition and ability of Tremor to continue to recognize those synergies; Tremor's ability to continue to execute on cross-selling opportunities and its introduction of new technology products to a significantly larger customer base and addressable market; the timing to complete the technology integration of Amobee; and other statements concerning the expected development, performance, and market share of competitive performance relating to our products or services. All forward-looking statements are based on information available to us as of the date of this call. These statements involve known and unknown risks, uncertainties, and other factors that may cause our actual results to differ materially from those implied by these forward-looking statements, including unexpected changes in our business. More detailed information about these risk factors and additional risk factors are set forth in our filings with the U.S.\n\nSecurities and Exchange Commission, including, but not limited to, those risks and uncertainties listed in the section entitled risk factors in our most recent annual report on Form 20-F. Tremor does not intend to update or alter its forward-looking statements, whether as a result of new information, future events, or otherwise, except as required by law. Additionally, the company's press release and management's statements during this conference call will include discussions of certain measures and financial information in IFRS and non-IFRS terms. We refer you to the company's press release for additional details, including definitions of non-IFRS items and reconciliations of IFRS to non-IFRS results.\n\nAt this time, it is my pleasure to introduce Ofer Druker, chief executive officer of Tremor International. Ofer, please go ahead.\n\nOfer Druker -- Chief Executive Officer\n\nThank you, Billy, and welcome to everyone joining us today. I will begin by providing an overview of our results, business achievements, and strategy. Then we'll hand the call to our chief financial officer, Sagi Niri, to discuss our financials. We will then open the call for investor questions.\n\nQ3 was one of the most strategically important quarters in the history of our company. We accomplished several goals we have been working toward since late 2021 that further enhance our strength within CTV and data. We also gained new strategic linear TV capabilities, which we believe will enable several growth opportunities across a large addressable market while positioning us strongly for the future as CTV and linear continue to converge. First, we closed our acquisition of Amobee, which was the largest in our history.\n\nI am pleased to report that we successfully fulfilled significant cost-cutting measure and already realized the entire $50 million in total annual operating cost synergies we initially expected. Within the first 18 days of closing the acquisition, we were able to generate a positive adjusted EBITDA from Amobee. This is a major testament to our ability to successfully integrate companies and quickly realize benefits for our shareholders, as Amobee was a loss-making business when we acquired it. The acquisition significantly expands our financial scale, reach customer base and talent footprint, and enables strong cross-selling opportunities.\n\nTremor has a robust footprint in CTV and video, while Amobee's DSP has a strong omnichannel position, including across display, mobile, and performance. We believe the complementary nature of the two DSPs will enable Amobee customers to allocate more of their overall advertising budget to CTV and video and offer Tremor customers [Inaudible] self-service DSP tools and the added omnichannel and data capabilities. Additionally, a very minimal amount of advertising dollars spent across Amobee DSP were purchasing ad inventory from the Unruly SSP prior to the transition. Over time, we will work together with our Amobee's customers to enable them to realize the data advantages of our platform and cost-benefit of transacting end to end, which we believe can also drive added revenues and profitability to Tremor.\n\nAmobee also enhanced our technology footprint across enterprise self-service DSP, performance media buying, CTV, and advanced data for different stages of planning while adding very important new linear TV capabilities. As CTV and linear continue to converge, this new capability strongly and uniquely position us for future success within the industry, as I will elaborate on. Amobee Advanced TV planner, or ATV, give us a new ability to work and cooperate with traditional TV broadcasters. ATV assists broadcasters by providing a planning technology that they can offer through advertising partners to better understand how to optimally run campaigns on their inventory in order to reach their target audience.\n\nOur preexisting strength, the CTV and having an in-house SSP, enables strategic growth planning capabilities between digital and linear. We believe this capability will open several new opportunities and capabilities for Tremor and its partners because we can now work with them to utilize reach and blend campaigns across both media platforms. In August, we also closed our $25 million investment in VIDAA, a smart TV operating system and subsidiary of Hisense. We believe Hisense is now one of the leading innovative growth brands in the CTV manufacturing market, and they also acquired Toshiba TV subsidiary several years ago, which further expanded their reach.\n\nOur investment in VIDAA extended for multiply use the exclusive global agreements to share VIDAA's ACR data for global targeting and measurement across our platform. VIDAA also granted ad monetization exclusivity in the U.S., U.K., Canada, and Australia to our Unruly SSP and Spearad ad server for the next couple of years. The ACR agreement enables us to offer additional data sets and advertising opportunities to our customers, and it's expected to enhance our TV intelligence solutions. We also believe that data exclusivity creates new potential revenue opportunities for Tremor as peers, advertisers, and streaming providers are seeking this data for targeting and measurements.\n\nACR, or automatic content recognition, data is viewership data collected from the smart TV, which enables those with access to understand what content and commercial consumers were exposed to. With AVOD expected to continue growing, our ACR agreement with VIDAA positions us to take advantage of increased customer data for targeting and measurement purposes, which is critical within CTV. The data is also quite unique in the ecosystem, as many other major smart TV OEMs monetize ACR data in-house similar to a walled garden. Tremor now, through the agreement, has become a major enabler of smart TV ACR data to the open internet, a key differentiator and potential growth driver.\n\nAccording to Comscore, earlier in 2022, Hisense and Toshiba already accounted for approximately 10% of the U.S. smart TV OEM market. Market research agency Omdia also reported that for the first time, Hisense in Q2 2022 ranked second in the worldwide volume share of shipments. As Hisense works toward further penetrating the U.S.\n\nand global smart TV market, Tremor should further benefit from its investment in VIDAA. As VIDAA and Hisense continue to expand share, this anticipate increased TV distribution will make the ACR data even more desirable to advertisers and those seeking targeting and measurement capabilities. Tremor is also utilizing its end-to-end platform and leveraging its close relationship with VIDAA and its partners to exclusively monetize ad inventory shown within the FIFA+ app across connected TVs. VIDAA's partners will also distribute the FIFA+ app globally across their smart TV devices as well.\n\nBetween the combined reach of VIDAA and its partners, we believe Tremor will have ad monetization exclusivity on the FIFA+ across more than 100 million smart TVs globally during the FIFA World Cup. As part of this exciting large-scale project, FIFA also granted Tremor the global rights to monetize ads on its FIFA+ website and mobile inventory during the tournament. This project and combined which reflects a sizable revenue opportunity for us. We also anticipate additional sports-related opportunities in the future as Hisense has made sports sponsorship and exclusive sports content opportunities a key part of its growth and marketing strategy.\n\nIn addition to all these milestones we achieved in Q3, which position us strongly for the future, we also continue to expand our market share within CTVs. CTV spend across all platforms during Q3 was $73 million, which reflects an increase of 45% compared to Q3 2021. This $73 million also includes 18 days of results from Amobee. CTV is the fastest-growing segment within digital advertising, and we are incredibly pleased with our progress in growing and expanding our capabilities on this front.\n\nWe also generated continued margin strength, achieving an adjusted EBITDA margin of 46% as a percentage of contribution ex-TAC during Q3, which also includes 18 days of results from Amobee. This highlights the efficiency and resiliency of our technology platform and business model, which enable us to generate robust profitability and cash flow despite a continued challenging macroeconomic environment. Spending by advertisers during Q3 remains constrained by rising inflation, rising interest rates, supply chain constraints, the ongoing war in Ukraine, macroeconomic uncertainty, and recession concerns. We continue to expect these headwinds to persist for at least the remainder of 2022 and likely into 2023.\n\nJuly and August were particularly challenging months for advertising demand. That said, we saw results improve throughout the quarter and ended Q3 with a strong September. We have also seen some additional evidence of advertising demand from our customers increasing as a result of the U.S. midterm election cycle and fourth quarter seasonality.\n\nThis has been encouraging as we also believe we will experience added benefits related to several upcoming catalysts, which can help offset some of the expected negative macro headwinds. During the quarter, we also completed our previous $75 million share repurchase program and announced an additional 20 million share repurchase program that began on October 1st. In the quarter, we purchased approximately 6.4 million ordinary shares for a total investment of approximately 24.9 million pounds or $29.7 million. For the entire program, we repurchased around 13.8 million ordinary shares, which reflects roughly 9% of shares outstanding.\n\nOur ability to have repurchased a sizable amount of shares at what we believe are discounted levels while making a significant strategic acquisition and investment is a testament to our modest cash-generating ability and profitability. Finally, we continue to generate robust momentum across Tremor Video and Unruly, adding a significant number of supply side partners and new advertiser customers. During Q3, Unruly added 82 new supply partners, including 33 in the U.S. For the first nine months of 2022, Unruly added 232 new supply partners, including 104 in the U.S.\n\nSupply partners were added across both news and entertainment verticals and several formats, including online video, mobile, CTV, and over-the-top apps from leading broadcasters and Virtual Multichannel Video Programming Distributor businesses. Tremor Video, during Q3, added 56 new advertiser customers and 191 for the nine months ended September 30, 2022 across retail, automotive, and political verticals, as well as others. Despite the challenging macro backdrop, we continue to generate strong results and adoption across our technology ecosystem and reinforced our strategic position within the industry, which we believe positions us well for future growth. It is now my pleasure to turn the call over to Sagi to review our financial results.\n\nSagi Niri -- Chief Financial Officer\n\nThank you, Ofer. Today, I will review highlights and key financial and operational drivers of our Q3 and first nine months of 2022 performance, which include 18 days of results from our completed acquisition of Amobee. For the three months ended September 30, 2022, we generated contribution ex-TAC of $64.9 million, compared to $76.7 million in Q3 2021; alongside Q3 adjusted EBITDA of $30.1 million, compared to $42.3 million in Q3 2021. Our Q3 2022 figures include 18 days of results from our completed acquisition of Amobee.\n\nDuring July and August, we experienced pressure on our contribution ex-TAC due to a variety of macroeconomic challenges, which impacted advertising demand across several verticals and formats. However, we are encouraged by the results we generated in September and have seen initial evidence of potential recovering advertiser demand across our customer base to this point in the fourth quarter. We also continue to expand our share within CTV, as CTV spend on our platform, including 18 days of results from Amobee, was $73 million during Q3 2022, which was a record for us and reflected year-over-year growth of 45%, compared to CTV spend of $50.4 million during Q3 2021. We believe we are well positioned for future growth within CTV and video as programmatic transactions continue to increase in popularity across the advertising ecosystem, as AVOD continues to grow, and as we expect performance budgets to move toward CTV and programmatic in the future.\n\nAmobee also creates more CTV advertising cross-selling opportunities within a newly acquired customer base, and we expect the integration of Spearad, as well as our investment in VIDAA, to provide us ample opportunities to continue growing share within CTV and video. Including Amobee, video, including CTV, continue to reflect the overwhelming majority of total Q3 and nine-month 2022 contribution ex-TAC at approximately 87% and 81%, respectively. Our profitability remained strong as we generated a Q3 2022 adjusted EBITDA margin of 43% on a reported revenue basis and 46% on a net revenue basis, which includes 18 days of results from Amobee. For the nine months ended September 30, 2022, we generated contribution ex-TAC of $206.7 million, including 18 days of results from Amobee, compared to $213.4 million over the same prior-year period.\n\nOver the same period, CTV spend, including 18 days of results from Amobee, was $183.9 million, compared to $138.4 million during the first nine months of 2021, which reflected a record for us and a 33% year-over-year increase. During the first nine months of 2022, CTV spend, including 18 days of results from Amobee, reflected 39% of total spend and 44% of programmatic spend. We also generated adjusted EBITDA of $102.9 million during the first nine months of 2022, including 18 days of results from Amobee, compared to $107.2 million adjusted EBITDA in the same prior-year period. We generated an adjusted EBITDA margin of 45% on a reported revenue basis and 50% on a net revenue basis over the first nine months of 2022, including 18 days of results from Amobee.\n\nTurning to our cash flow, we generated net cash from operating activities of $12.6 million for Q3 2022 versus $44.6 million in Q3 2021. For the September 12 through September 30 period, Amobee contributed negative $13.8 million in net cash from operating activities to Tremor's Q3 2022 results. For the nine months ended September 30, 2022, we generated net cash from operating activities of $59.1 million, including 18 days of results from Amobee, versus $121.4 million in the nine months ended September 30, 2021. As of September 30, we had 109.1 million net cash following the closing of our VIDAA investment and Amobee acquisition, as well as the completion of our $75 million share repurchase program.\n\nAs we mentioned in the past, we secured a new 180 million credit facility in relation to the Amobee acquisition, under which we utilized 100 million in addition to existing cash resources to satisfy the purchase price. Within the new credit facility, we drew it closing $90 million from a secured Term Loan A, as well as $10 million from a revolving credit facility. The remaining $80 million on the revolving credit facility, alongside our existing cash resources, provide us ample liquidity for future potential strategic investment and initiatives. We experienced 99% free cash flow conversion for both the three and nine months ended September 30, 2022, including 18 days of results from Amobee.\n\nNon-IFRS diluted earnings per ordinary share was $0.11 for Q3 2022, including 18 days of results from Amobee, versus $0.21 in Q3 2021; and $0.42 for the nine months ended September 30, 2022, including 18 days of results from Amobee, versus $0.56 for the nine months ended September 30, 2021. As Ofer mentioned, we are very pleased to report that the Amobee integration is ahead of schedule and that we've already realized our initially anticipated $50 million in total annualized operating cost synergies on a combined pro forma basis. We fulfilled significant cost-cutting measures, successfully generating positive adjusted EBITDA from Amobee within the first 18 days of closing the acquisition. Most of the synergies to this point have come from the consolidation of human capital into one combined team, and we've reorganized Amobee employee base to focus efforts on the highest growth opportunities.\n\nWe focused on retaining key talent from Amobee in sales, marketing, product, and technology to enhance our product and fuel our future growth. Employee efficiency is a pivotal part of our operating model long-term strategy, as well as our integration strategy. This efficiency has also been a key enabler of our historically strong profitability and highlights our proficiency at managing the business, maximizing return on assets, and maximizing return on invested capital. We expect this efficiency will continue to be a strong future growth driver for us while also positioning us well during the challenging advertising demand environment.\n\nLaura Martin at Needham recently released a report stating that from Q4 2020 through Q2 2022, Tremor improved its trailing 12-month revenue per employee by approximately $297,000, which was the largest increase of any company within our ad tech coverage universe over that time period. According to Laura, our Q2 2022 productivity of around $623,000 per employee was second only to the Trade Desk at around $642,000 within our ad tech coverage universe and well above the mode value of $300,000 to $400,000. In our opinion, this proves that the largest companies in the space aren't necessarily the most productive in maximizing and improving employee utilization and maximizing their asset efficiency for their business and shareholders. We believe it also demonstrates that end-to-end solution with proficient management teams and operators tend to drive better results around efficiency.\n\nWe also believe our historically strong employee utilization served as a strong barometer for the success we expect to achieve with our newly integrated Amobee team members. In addition, we've also made progress in consolidating duplicate spend on vendor contracts and technology fees and services. As we work toward fully completing the integration, we believe we've identified an additional approximately $15 million in operating cost synergies and now believe we will realize approximately $65 million in total annualized operating cost synergy on a combined pro forma basis upon the completion of the integration. We also believe the integration will now be fully completed by the end of 2023, with the vast majority expected to be completed by the end of Q2 2023.\n\nGoing forward, our sales teams will continue to focus on introducing and demonstrating Tremor Video's platform capabilities to newly acquired Amobee customers to work toward capturing additional CTV and video budget while also introducing Tremor Video customers to our new Amobee DSP to offer opportunities to boost self-service spend across our ecosystem, as well as additional omnichannel capabilities. We will also introduce the end-to-end benefits of leveraging Unruly to advertisers running campaigns through Amobee. Very minimal amount of advertisers' dollars spent on Amobee DSP have purchased ad inventory through Unruly in the past. But as we work toward migrating some of this spend to Unruly, we believe we have the ability to capture take rates and profitability on both the DSP and SSP side while providing efficiency, as well as data and cost advantages, for customers.\n\nWe will also be working to expand our relationship and revenue footprint with linear TV broadcasters through our newly acquired ATV technology and position ourselves even more strongly as budgets are deployed across both linear and CTV. The new data-driven tools that we gained through the acquisition also enable us to provide desirable added benefits for current customers to expand their revenue relationship with us while offering us opportunities to also introduce these benefits to land and expand within a newly acquired customer base. They also further expand our technology ecosystem and product offering for advertisers, linear TV broadcasters, and CTV media customers where we can now assist them even more with planning and executing campaigns across CTV and linear TV, eliminating the need to leverage several partners or technology solution to accomplish this goal. Finally, I'll now turn to our outlook.\n\nFor full year 2022, we now expect contribution ex-TAC of approximately $310 million and adjusted EBITDA of approximately $140 million, including results from Amobee. This lowered guidance factors in continued challenging market conditions we've cited that have impacted advertiser demand. We continue to believe these challenges will impact results for the remainder of 2022 and into 2023 as well. We believe, however, that we will experience positive tailwinds in the fourth quarter related to anticipated increased advertiser spend associated with the FIFA World Cup, where we have a number of catalysts and important exclusivity.\n\nFor full year 2023, we now expect combined contribution ex-TAC of approximately $460 million and combined adjusted EBITDA of approximately $180 million, including results from Amobee. Despite ongoing market headwinds, the efficiency and benefits of our end-to-end operating model; continued focus on CTV, video, and data; strong fundamentals; powerful partnerships and differentiators; and recent milestones position us incredibly well to capitalize on future growth opportunities while continuing to generate high level of cash and profitability. Our newly enhanced suite of product solution allows us to holistically serve advertisers and media customers across linear and CTV in ways we believe no other single technology company can. I am very excited Tremor International near- and long-term future and positioning within the industry.\n\nWith my remarks completed, I'll turn the call back to Ofer.\n\nOfer Druker -- Chief Executive Officer\n\nThank you, Sagi. Over the last several months, despite ongoing challenging market conditions, we managed to execute on our long-term strategy, which we believe will help further enhance our position in video and data and further boost our already robust strengths within the CTV and TV ecosystem. We believe our efficient end-to-end operating model and continued focus on generating strong profitability and margin and significant level of cash flow enable critical flexibility for our business. This flexibility is even more important and a tremendous advantage during uncertain economic periods and uncertain advertising demand environments.\n\nWe expect all of these recent wins, alongside the preexisting strength of our end-to-end model, to create a strong flywheel effect that will empower our future growth through expanded relationships with both current and new customers. We are excited to continue executing on our long-term strategic vision and remain accurately focused on generating value for our customers and shareholders. Operator, we will now open the call to investors' questions.\n\nOperator\n\nAt this time, we will begin our question-and-answer session. [Operator instructions] Your first question comes from the line of Matt Swanson from RBC Capital Markets. Your line is open.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nAll right. Good morning. Thank you so much for taking my question. And thanks for giving that data point from Laura.\n\nYou know, I think it really highlights the efficient way that you've been able to grow this company. And so, to that point, could you just talk a little bit more about the early cost synergies from Amobee and any updates around thoughts around the integration that you made or discovered in the last couple of months? And then any updates or comments on what you've seen from, you know, early customer reaction on both sides from, you know, Tremors in the Amobee DSP or Amobee customers taking full stock. That'd be great.\n\nOfer Druker -- Chief Executive Officer\n\nThank you, Matt. I would start by, first of all, overlooking at what Amobee provided us, as we see it, and why we made this acquisition because I think that it's important also in this discussion. So, first of all, I think that the ATV platform, which is the Amobee TV planning tool, it's a very useful tool in this period of time. And when we're looking at that, CTV and linear TV are coming more and more together and people are trying to now to advertise or to plan their advertising budgets on both of these platforms side by side, basically.\n\nAnd with the increase of AVOD where we see Netflix and other guys that are coming into this world of supporting advertising video and streaming, we understand that also the advertisers will respond to that and will increase their spend also across CTV and streaming solutions. So, they will have to take into account their linear TV and also to spend -- when they are spending in cross-platform and digital. So, this is a very important element for us. And basically, Amobee, in their years, they couldn't provide this CTV engagement because they didn't have an SSP like us.\n\nWhen we got our SSP, basically, we can integrate it side by side with the linear TV and we can provide advertisers a much better view on their planning and also activation capabilities. So, for that, we are already seeing a very good positive response from the partners of Amobee in the past and our partners that are showing interest in that, and we are -- and they are going to adopt our tools in order to move forward with that. The second thing is their enterprise DSP, which Amobee basically built over many, many years, and they created a very strong partnership. We believe that it will help us basically to integrate these two activities or fasten them into one when they are bringing us more capabilities around omnichannel and performance, which are needed in the market.\n\nAnd we feel that there is a demand for that already when we are talking about cross-selling between the teams, while we can give them much more concrete products, capabilities around CTV. The third element is the massive, which both of the companies are strong teams that we are basically integrating now together. And I think that the offering, again, as I mentioned, about CTV on one side, the second side is performance in omnichannel, will bring us a lot of value. And the last point regarding that from our view is moving more and more budgets or working with advertisers and partners of Amobee to educate them and to teach them and to partner with them in order to explain to them what are the values if they are going to move basically to -- into end-to-end solution that we are offering and what price advantages they can get from that and other advantages which are technology wise and moving more and more budgets from Amobee to basically Unruly platform that can increase our revenues and net revenues and profit in the future.\n\nSo, this is -- everything that I just said is already underway, and we feel that the market is accepting it very well. And I think that the Amobee platform is like adding to us a lot of credibility, a lot of clients, about 500 clients worldwide, which are now integrating into our platforms and work. And I think that we move relatively fast in order to integrate it. And the idea is to basically finalize the integration of the technology element until the end of 2023.\n\nBut the major stuff will be in the end of the second quarter of 2023 when we will basically integrate the DSPs and the platform to be one platform. I hope that answer your question.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYeah, no, that was everything I was looking for and more. I guess, as a second, and this is for Sagi, thinking about the macro, I mean, the headwinds are all pretty apparent that we've seen from you and from peers, this being a challenging environment. But you also have some secular tailwinds, I think, particularly around CTV. And you kind of mentioned there are some catalysts among this more challenging macro picture.\n\nSo, how are you kind of balancing those two things when you think about guidance, especially for next year?\n\nSagi Niri -- Chief Financial Officer\n\nThanks, Matt. I think, you know, we are trying to be conservative on our guidance since, you know, the macroeconomic geopolitical issues are out there. We are trying to be cautious and, of course, looks bright through for the good and know the AVOD way. As you said, we are experiencing, you know, a very nice growth in our CTV market share, which we showed that we will continue on that.\n\nBut on the other hand, we have, as Ofer mentioned, some CTV clients which are seeing, because of, you know, inflations and recession, some headwinds to their business. And of course, it's affecting their ability or their advertising budgets that they are taking into the market. So, I think we are taking, you know, all of the different parameters that we anticipate in front of us. And we are trying to give, you know, the conservative and cautious guidance that we think that we can handle throughout Q4 2022 and into 2023.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nAll right. I appreciate the time and look forward to seeing you guys at the conference tomorrow.\n\nOfer Druker -- Chief Executive Officer\n\nThank you, Matt.\n\nOperator\n\nYour next question comes from the line of Laura Martin from Needham and Company. Your line is open.\n\nLaura Martin -- Needham and Company -- Analyst\n\nMorning. Couple of questions. So, why don't I start with the one, are revenue -- IFRS reported revenue went from down 7% to down 19%, even though we had 18 days of Amobee in that quarter. And now, we're -- you're projecting for the fourth quarter 18% growth.\n\nSo, if I strip out Amobee, what is the organic growth? And where I'm going is why are you comfortable with this huge deceleration in revenue that you can actually report positive growth in the fourth quarter on an organic basis?\n\nSagi Niri -- Chief Financial Officer\n\nNo. So, I think the guidance that we gave for Q4 and, of course, for full year 2023 is that we have Amobee on a consolidated basis. So, we are not seeing like a huge organic growth with our solo business. But as we said in the past, we are -- the minute we completed the acquisition of Amobee, we are looking at asset as one company, one platform.\n\nEverything is being consolidated into one sales team, one marketing team, one product and research and development team. So, we are not looking at it on a solo basis. We are looking on it in a group. And on a group level, this is the guidance that we gave.\n\nAnd we will not, by the way, in the future like will give an Amobee number or Tremor International number.\n\nLaura Martin -- Needham and Company -- Analyst\n\nRight. So, you're saying all of the growth in Q4 is because of Amobee. You are projecting negative same-store growth in Q4. That's what you're saying?\n\nSagi Niri -- Chief Financial Officer\n\nI'm not saying that like, you know, strictly forward. But yes, we are not seeing like a huge organic growth on our solo basis. But having said that, yes, we are not giving like a, you know, organic -- in our eyes, everything is becoming organic the minute we are consolidating the two companies into one.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. And then my other question was, you said in the press release that in the first eight weeks, because it's only been eight weeks since you [Technical difficulty] you achieved all 50 million projected synergies that was supposed to take 12 months, and then you're now projecting 65 million of synergies. Great. How exactly do you do that? How exactly -- what did you do to achieve 50 million of synergies in the first eight weeks of this owning this company?\n\nOfer Druker -- Chief Executive Officer\n\nSo, it's a few things that, of course, that are being done. First of all, analyzing what synergies where we can basically when we are [Technical difficulty] the company and restructuring it, we thought [Technical difficulty] And by the way, in the management also, we integrate managers from Amobee into the management team of Tremor, and we are building it in advance, the teams that we want to move forward with. And we are moving fast after this closing in order to release or to basically conduct the changes because we don't want the people to be like in there for a long time, not to feel safety about their positions, and so on. So, when we build this reorg and we build the structure that we want to keep, we basically conducted the change.\n\nAnd it's going for management across the teams until the bottom, because, first of all, we have experience in that. The second point is that we have experience in that in doing this moves and taking the decisions quickly. And the third element is also coming to the point that you mentioned a few weeks ago, Laura, which is we want to keep and stay effective and be efficient at the company. So, we are doing that very quickly because if not, you are getting into a situation that you are bleeding and you are in a situation that people are in uncertainty and you are not controlling the way.\n\nSo, I think that, again, it's reorg, building the teams in advance, moving fast after the closing, and with a very clear vision about what we want to build. And as I answered Matt, I think that we have a very good -- clear and good vision about what we want to do with Amobee assets into Tremor and how it's going to be combined to a very interesting and powerful company that can provide very unique services and solutions to partners in the U.S. and globally. So, I think that it's a mix of all these things that we've done, and I feel really reassured about this acquisition and the outcome of the reorganization that we done very quickly.\n\nIt was a major effort in Q3, but we done it because we believe that when we looked at that 2022 is basically a year that we want -- we wanted to conduct this strategic investment. Just for you to know, we also, in the few months before, we looked at other opportunities in the market and then we switched to Amobee because we wanted to acquire another demand for platform and to connect it to our -- basically our operation and platform. And that's what we've done. And in parallel to that, as you know, we concluded the investment in VIDAA.\n\nSo, the management and the teams worked very, very hard in order to conduct all these acquisitions. And of course, after signing -- signing, it's not a major event. After signing to conduct all this hard work in order to connect the platform, to connect the teams, to build the mutual vision, and to move forward as one company like Sagi just mentioned.\n\nSagi Niri -- Chief Financial Officer\n\nYes, and by the way --\n\nLaura Martin -- Needham and Company -- Analyst\n\nThank you very much.\n\nSagi Niri -- Chief Financial Officer\n\nLaura, just to make sure, it all happened in less than three weeks.\n\nOfer Druker -- Chief Executive Officer\n\nYeah.\n\nSagi Niri -- Chief Financial Officer\n\nWe just closed on the -- on September 12th.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. And so, we should expect to see a write-off if you're laying off people. Maybe I missed it in this press release because I sort of perused it, but -- so we should expect to see a write-off in the firing of the people and the through the income statement, right?\n\nOfer Druker -- Chief Executive Officer\n\nSagi.\n\nSagi Niri -- Chief Financial Officer\n\nYeah, you will see it as a restructuring line.\n\nLaura Martin -- Needham and Company -- Analyst\n\nOK. All right. Great. Thanks, guys.\n\nOfer Druker -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Mark Kelley from Stifel. Your line is open. Mr. Mark Kelley, your line is open.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nWould help if I took myself off mute. Thank you, and good morning, everybody. I was hoping you could talk about Amobee a little bit more, just in terms of how much of, you know, having Amobee in-house and being able to look under the hood a bit more has impacted your outlook for 2023. I totally get the macro stuff, but it also sounds like after July and August maybe things have stabilized and maybe even started to improve there.\n\nSo, just more color on the Amobee side would be great. And then second, can you talk about how much visibility you get into the World Cup spend? Is that something that you have visibility to upfront or is it more, you know, scatter and programmatically bought stuff? Thank you.\n\nOfer Druker -- Chief Executive Officer\n\nSo, maybe I will start with FIFA, and then I will move to Amobee. So, with the FIFA, I think that we have a very unique opportunity that in a regular year or regular period of time, not under this pressure of the macroeconomics, inflation, and so on, we can expect to generate much more revenues because we are talking here about being distributed on more than 100 million TVs globally, which I think it's a very unique achievement. And this is the first time that an event of this size and this importance globally is taking part also -- taking place also on CTV. So, I think that it's a major success of us connecting all the points of bringing the FIFA, bringing you basically -- partnering with VIDAA, bringing FIFA, bringing other partners to distribute the app basically globally and getting the rights to exclusive -- to exclusively monetize this app globally.\n\nWe have, of course, people that already place big -- place orders into the book to buy advertising around that. And we believe that a lot will come also programmatically because in the end of the day, when we are talking here about more than 100 million TVs, we believe that the adoption of the FIFA+ will be very high and people will engage with the application because people like to consume this content and it's important to them. I'm not from the U.S., for us as foreigners, we believe -- we like FIFA, and I am following this game from '72 basically. And I know that when you're looking at the U.S., it's just now growing and becoming more and more interesting and more efficient and more -- something that people are getting the attraction and looking at.\n\nSo, I believe that also in the U.S., we have nice adoption. One of the major issues that are like a cloud above it is the macroeconomic situation and also the fact that it's being done in Qatar that is basically raising some issues to some people and some companies and also the timing of the games. But in general, we really believe in this content that we are doing -- content distribution that we are doing that is unique, it's exclusive, and it's very powerful. And we believe in the power of growth of the CTV.\n\nAnd we think that we are doing a very unique stuff. But as Sagi said, we were conservative in our assessment of how much revenues it will bring us in the fourth quarter, and we are waiting for the games to start exactly in less than a week from now. So, on the 19th of this -- of November, the games are supposed to start in Qatar. Hopefully, there will be like a nice buzz, nice games, good couple of games that will basically bring a lot of attention to this tournament.\n\nRegarding Amobee, when we're looking at Amobee, and I will maybe repeat it myself a little bit, but I -- after looking at many companies in the industry, we looked at Amobee and we feel that this can really support us all the way from all the funnel from an advertising planning, discovery, discovery planning, activation, which is very important for us. And it's also adding to us adding additional capabilities around basically working with broadcasters that are running on linear and growing their streaming business. And I think that this is something which is opening to us a lot of new markets that we were not being able to address in the past when we were just Tremor. So, I think that when we look at that, we look at Amobee as a promise to get into working very closely with broadcasters -- major broadcasters that are already engaged with Amobee, by the way, globally.\n\nAnd we can add to them, as I mentioned, the activation and the digital side of the business and the planning, which is very meaningful. And I think that it will bring us a lot of success in the future. In general, I think that also when we are looking at Amobee, 500 clients globally, a very good reputation over the years that was built, very strong technology, investment in technology, and acquisition that they made over the years in order to strengthen it. And I think that they created a very good team of talented people that are working on this platform.\n\nAnd the combination with us will be able to basically provide us a lot of unique capabilities that we didn't have before and to strengthen our core capabilities that we have already around CTV. And our promise is basically to be able to do cross-selling like we did in the past with when we acquired Unruly, for example, and when we acquired the other one is to basically introduce the new capabilities to the customers of the company that we acquire and engage with them and move much more budgets basically to us in the future. So, it's a lot of effort that was done in Q3, and we believe that it will give us the benefit in the mid to long term and we are a long-term runners. We are not looking just on the other corner of the next few weeks, we are looking for the next year or so.\n\nAnd we believe that this acquisition will give us a very strong position in the world of CTV, in the work of CTV around broadcasters combined with linear TV, and will enable us to use our strengths with data, CTV, and so on in order to attract advertisers to buy and move and shift their budget of CTV to us basically in the future to Unruly. And when they are moving their budgets to Unruly, we, of course, can grow our business, grow our net revenues and profit. And this is the -- this was basically the target of this acquisition. And we achieved that.\n\nAnd it's coming together with VIDAA that will also basically give us the ACR data that is a great match, also, for basically introducing to clients, enabling them to buy targeting and to conduct measurement on our platform together with Hisense/VIDAA data, which is very meaningful because, as all of us know, ACR data is very unique in the market. It's a very rare commodity because most of the companies that got this data are using it as part of their walled gardens, and we can basically be one of the people that are serving the open web. And this is our -- basically, our target and our goal and our vision.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nYour next question comes from the line of Andrew Boone from JMP Securities. Your line is open.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nGood morning and thanks for taking my questions. I want to talk about two smaller line items that you guys have but clearly are getting impacted by macro. Can you help us understand the difference in terms of performance gross revenue in the kind of 41% downturn that we saw on 3Q? And then also just thinking about nonvideo programmatic revenue and trying to back into the number, and it looks like display or whatever is inclusive in that category is also down about 40%. And so, is there anything just to highlight there across those two categories? And then lastly, just turning to World Cup.\n\nFrequently, when media rights like this or purchase news exclusivity, is there anything to note just in terms of TAC or required payments you guys have just given the softness within the macroenvironment that we should be thinking about for 4Q? I'll leave it there. Thanks so much.\n\nSagi Niri -- Chief Financial Officer\n\nOK. Hey, Andrew. I'll answer the first one. I'm not sure I got it like 100% right, but to try to answer you.\n\nI think that, you know, our performance activity is not something that we are trying to be focused on. Of course, it's helping us. And we can help customers, advertisers, and agencies like growth activity. So, we can do whatever we want on the programmatic side of the business, and we can even benefit from our performance arm.\n\nI think that in the nine first months of 2022, performance activity did well or as well as it did in 2021. In Q3, we showed a little bit softness on the performance side as well. And again, it's relating to our B2C clients, which lowered their advertising budget due to inflation and recession. On your video question, so, again, we are heavily invested and we are focused on video format, which is the most growing and the most engaging.\n\nHaving said that, and as Ofer mentioned, Amobee has a much robust omnichannel DSP, which most of the advertising budget over there are being executed on display. So, this gives us a lot of opportunity taking the display abilities and Amobee features into our clients and cross-sell it and vice versa, to take all the CTV and video capabilities and knowledge that we have and allow them or cater them to Amobee client. So, I hope that this answer your question. Regarding the second question, I'm not sure you asked if we are -- if we have like guaranteed payment to FIFA with the deal.\n\nOfer Druker -- Chief Executive Officer\n\nYeah, I think so.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nYeah. Just as we think about your access to FIFA World Cup inventory, and especially considering just the softness within what I'm assuming of TPMs, are there any guarantees that we should be thinking about as we think about 4Q?\n\nSagi Niri -- Chief Financial Officer\n\nOK. So, just one thing to note or to understand. The investment in VIDAA gave us an amazing relationship with this company, which is the operating system of Hisense. Hisense is heavily invested into sport-exclusive sponsorship.\n\nAnd as part of that, VIDAA is benefiting to have some exclusive content. And from that, we are benefiting of being VIDAA exclusive partner on ACR data and, in major country, their inventory and monetization partner. We are enjoying that. So, to your question, we are not invested, you know, in dollars in that.\n\nWe are not -- we don't have any minimum guarantee, and we didn't -- it didn't cost us anything. We are just benefiting from this amazing relationship. So, it's only, you know, an upside for us.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nGreat. Thank you so much.\n\nSagi Niri -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Andrew Marok from Raymond James. Your line is open.\n\nAndrew Marok -- Raymond James -- Analyst\n\nThanks for taking my questions. One more on Amobee, if I could. I guess, to the extent that you have seen so far in the first 18 days, can you comment on the sensitivity of Amobee versus the core Tremor business to some of these macro trends? And then looking forward into 2023, can you just give us a little bit more color around your assumptions for macro and the shape of the recovery? Thank you.\n\nOfer Druker -- Chief Executive Officer\n\nRegarding Amorbee risk, I think that the -- or sensitivity, as you said, we are basically running on the same -- note, sometimes, the overlap of the clients is very minimal, as we indicated in the past. But we are talking about the same type of audience, basically, same types of clients, but sometimes different names, different businesses. So, I think that it's relatively the same. Regarding the macroeconomic forecast.\n\nAnd so, I think that it's a very big question that I wish that I knew the answer to that, basically. But we are -- what we, I think, feel that we need to do as management, we need to be cautious and we need to take into account these macroeconomics, turnovers, and changes will continue, at least for the next -- until the end of the second quarter of next year. So, it's very hard for us as a company to basically predict and know what will be the macroeconomic situation in this world. And I think that there are many people in this call will feel the same, but I think that what we are trying to do is to be committed to being conservative and not to provide -- and not to ignore it, and not to provide wishful thinking, but to be conservative in the way that we are looking at things.\n\nAnd so, having said that, you know, it's like as we indicated, we saw some uptick in the fourth quarter, which is usually happening. We feel that the -- also, the midterm elections contribute some revenues -- additional revenues to us. And we are looking forward to see what FIFA would bring, as I just mentioned. And hopefully, it will be meaningful.\n\nBut it's very hard to predict right now, and we need to be careful about the future and take our steps step by step in order to understand what's going on in this market. And as we see also from the stock exchange and what's going on, in general, in the world, every day is a new day and things are changing and moving to different directions. So, we need to be very careful about how we build our company and how we invest our resources and how we're sharing results or forecasts with the market, basically.\n\nAndrew Marok -- Raymond James -- Analyst\n\nOK. Thank you.\n\nOfer Druker -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour final question comes from the line of Daniel Cane from Toscafund. Your line is open.\n\nDaniel Cane -- Toscafund Asset Management -- Analyst\n\nHi. You've asserted on many occasions and including today the strength of your business model. But if we look at the evidence of Q2 and Q3 in terms of net revenue, we see negative trends that Tremor and much better performance coming from your U.S. [Inaudible] peers.\n\nI was wondering if you could give me some perspective around that. What do you think is happening at your peers compared with your own business?\n\nOfer Druker -- Chief Executive Officer\n\nDaniel, hi. First of all, I think that you know, our numbers also from the last few years, and also, you know that last year, we grew 64% compared to 2020. Between 2021 to 2020, we grew 64% organically, which was a massive number, basically reaching the best growth in the industry in any manner that you looked at. And we were also recognized as the growth -- the company to grow the fastest in 2021.\n\nI think that it's about the mix of advertisers that you've got, which is putting sometimes pressure on results. And we are putting a lot of emphasis on keeping our margins, keeping our profitability, as you know. And I think that when you look at that, if you are getting it from B2C, like we mentioned in the PR, it's something that we cannot basically replace or exchange very quickly. So, now, we believe that with Amobee, the -- basically, the dependency on these verticals will go lower because of the total revenues and clients that we got.\n\nBut in general, B2C was suffering from Q2 to Q3 from a lot of pressure in the market, and we felt it, and we basically acknowledged that to the market. So, I think that it's a -- everything is relative in life. And we look at that -- and we need to look at that in a perspective. And I think that in 2021, when we grew 64%, we created a very high bar.\n\nBut I think that the company is still generating profits. And we have like -- we committed and we done like two very important strategic events in the last quarter that will help us in the future. And I think that we are a long-term runners, we are not just looking around the corner. And we know that, basically, the investment that we've done and the integration that we are going to do and the quick response to Amobee integration, cutting costs and basically tending them to be a part of us very quickly will help us in the future.\n\nSo, again, I'm not -- I'm explaining that we grew the fastest last year. We suffer from a vertical that affected us, which is B2C mainly that basically went down because of the macroeconomic recession and inflation, that basically affected these clients to lower their spend in general and with us, and we felt it that's the major reason.\n\nDaniel Cane -- Toscafund Asset Management -- Analyst\n\nOK.\n\nOfer Druker -- Chief Executive Officer\n\nThank you, guys.\n\nSagi Niri -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThere are no further questions at this time. Mr. Ofer Druker, I turn the call back over to you.\n\nOfer Druker -- Chief Executive Officer\n\nThank you, everyone. Again, I want to say a few sentences just to conclude and summarize this call. I think that it's a very challenging days now because of what's going on in the market that we are not controlling, which is macroeconomic powers and forces that basically change and move the market and, of course, affecting our clients and affecting us, in general. We are looking at 2022 and we looked at the last two quarters, and from the beginning of the year, we worked very hard in order to fulfill our long-term strategy because I think that in the end of the day, companies are being judged and measured around the years, not just from quarter to quarter.\n\nWe are trying to build that -- we are trying to build our company for the long term. And I think that we achieved two major successes in the last quarter, which is the acquisition of Amobee in a very attractive price that is basically can be integrated into our business, already integrated our business, and we conducted the changes that were needed; and the VIDAA acquisition -- the VIDAA investment that is very massive, creating for us a lot of interesting opportunities, including the FIFA+ monetization opportunity. But more than that, ACR data exclusivity on their CTV media in the U.S., Canada, Australia, and U.K. for the next couple of years on one of the most growing CTV partners in the world.\n\nSo, I think that when we look at that, we are proud and we are -- we believe in our way going forward and this is what is important. And in this period of time, we need to do our best, of course, to keep generating profit, keep strengthening our position in the market. And that's what -- that is exactly what we are doing. So, thank you for your ongoing support, and thank you very much for this call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBill Eckert -- Senior Director, Investor Relations\n\nOfer Druker -- Chief Executive Officer\n\nSagi Niri -- Chief Financial Officer\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nLaura Martin -- Needham and Company -- Analyst\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nAndrew Marok -- Raymond James -- Analyst\n\nDaniel Cane -- Toscafund Asset Management -- Analyst\n\nMore TRMR analysis\n\nAll earnings call transcripts"
}