{
  "companyName": "GameStop",
  "companyTicker": "GME",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/07/gamestop-gme-q3-2022-earnings-call-transcript/",
  "content": "GameStop (GME 0.71%)\nQ3 2022 Earnings Call\nDec 07, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon and welcome to the GameStop third quarter 2022 earnings conference call. Please note that certain statements made during the call constitute forward-looking statements made pursuant to the Safe Harbor provisions of the Private Securities Litigation Act of 1995, as amended. Such forward-looking statements are subject to both known and unknown risks and uncertainties that could cause actual results to differ materially from such statements. These risks and uncertainties are described in the company's earnings press release and its filings with the SEC.\n\nThe forward-looking statements today are made as of the date of this call, and the company does not undertake any obligation to update the forward-looking statements. I will now turn the call over to GameStop CEO Matt Furlong.\n\nMatt Furlong -- Chief Executive Officer\n\nGood afternoon, everyone. I want to begin by acknowledging the dedication and focus of the teams managing our stores, fulfillment centers, and e-commerce platforms. As the holiday season begins, they are going the extra mile and working exceptionally hard to deliver for our customers. I also want to take the opportunity to acknowledge our stockholders, who continue to demonstrate unrivaled enthusiasm and support.\n\nAs we work to transform the company and do something unprecedented in the retail sector, that sustained passion is a major tailwind for us. Similar to last quarter. I'm going to spend some time at the outset of this call, recapping where we've been, where we are now, and where we're looking to go. Throughout 2021 and 2022, we were extremely focused on repairing our decayed foundation, reestablishing a culture of operational intensity, and setting the right long-term priority.\n\nThis translated to building a strong balance sheet, modernizing a crumbling infrastructure, and putting together teams that are now able to operate with the nimbleness and efficiency our stockholders and customers expect. Today, we're in the process of aligning corporate costs to our go-forward needs after completing the majority of necessary upgrades to our systems, fulfillment capabilities, and overall foundation. A large portion of our cost cuts will stem from reductions in corporate headcount that have been made during the back half of this calendar year. In some cases, individuals who helped us complete key initiatives have left on their own accord and are not being replaced.\n\nIn other cases, we've made the decision to eliminate or streamline parts of the organization where we can leverage the work completed over the past 18 months to operate with increased efficiency. We now have a firm understanding of the resources required to pursue opportunities in gaming, as well as high-potential growth categories like collectibles and pre-owned businesses. Looking ahead, we have two overarching priorities: achieving profitability in the near term and driving pragmatic growth over the long term. Now that the necessary investments have been made and we have identified the aforementioned opportunity set, we are going to be very judicious with respect to how we allocate capital to the core business.\n\nMaintaining a sizable cash position will maximize our optionality and keep us strong against the challenging economic backdrop. If a strategic asset or complimentary business becomes available in the right price range, we want to be able to explore those acquisitions. As a result of these steps and our planning, we believe GameStop is well positioned heading into 2023. We stand to benefit from our strong cash position, lack of debt, healthy inventory mix, shrinking cost structure, and disciplined focus on categories where we have competitive positioning.\n\nWe are also fortunate that the company's exposure to digital assets has been very modest, thanks to risk management efforts. The company has proactively minimized exposure to cryptocurrency risk throughout the year and does not currently hold a material balance of any token. Although we continue to believe there is long-term potential for digital assets in the gaming world, we have not, and will not, risk meaningful stockholder capital in the space. Let me now turn to our financial results for Q3.\n\nNet sales were $1.186 billion for the quarter, compared to $1.297 billion in the prior year's third quarter. Approximately $50 million of the decline is attributable to FX. Sales attributable to new and expanded brand relationships remained strong. Likewise, sales in the collectibles category remained strong on a year-to-date basis.\n\nSG&A with $387.9 million, or 32.7% of sales, compared to $421.5 million, or 32.5%, of sales in last year's third quarter. Notably, SG&A as a percentage of revenue was down on a sequential basis from 34.1% in Q2 of this year. We've also taken additional steps in recent weeks to further reduce SG&A on a go-forward basis now that significant improvements have been made to the core business. We reported a net loss of $94.7 million, or $0.31 per diluted share, compared to a net loss of $105.4 million, or $0.35, in the prior year's third quarter.\n\nAs with SG&A, we saw a healthy reduction in our net loss on a sequential basis versus Q2 of this year. Turning to the balance sheet. We ended the quarter with cash, cash equivalents, and marketable securities of $1.042 billion. We continue to maintain a strong cash position while sustaining strong in-stock levels for the busy holiday season.\n\nWith respect to inventory, we have strengthened our position in recent months by divesting a small percentage of merchandise that was acquired late in 2021 and early in 2022. Divestitures occurred in categories seeing soft customer demand over multiple quarters. Inventory was $1.131 billion at the close of Q3, compared to $1.141 billion at the close of the prior year's third quarter. At the close of the reporting period, we had no borrowings under our ABL facility and no debt other than a low-interest unsecured term loan associated with the French government's response to COVID-19.\n\nCapital expenditures for the quarter were $13 million, up $0.5 million from last year's third quarter. We anticipate capex will remain at similar or reduced levels now that the company has largely completed its period of heavy investment. In the third quarter, cash flow provided by operations was $177.3 million, compared to an outflow of $293.7 million during the same period last year. In terms of an outlook, we're not providing formal guidance at this time.\n\nIt is worth reiterating, however, that our goal is to achieve profitability in the near term. I want to finish by reiterating what we've said in the past. We're attempting to accomplish something unprecedented in the retail sector. We're seeking to transform a legacy brick-and-mortar business that was on the brink of bankruptcy into a retailer that meets customers' needs through our stores, e-commerce properties, and emerging sales channels.\n\nThis path carries risk and is taking time, but it is the path we are on. With that said, GameStop is a stronger business today than at any time in the recent past. I'll leave it there for this quarter. Thank you.\n\nOperator\n\nThis concludes today's conference. Thank you for your participation. You may now disconnect.\n\nDuration: 0 minutes\n\nMatt Furlong -- Chief Executive Officer\n\nMore GME analysis\n\nAll earnings call transcripts"
}