{
  "companyName": "Vail Resorts",
  "companyTicker": "MTN",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/28/vail-resorts-mtn-q4-2022-earnings-call-transcript/",
  "content": "Vail Resorts (MTN 0.17%)\nQ4 2022 Earnings Call\nSep 28, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the Vail Resorts fourth quarter earnings call. Today's conference is being recorded. At this time, I would like to turn the conference over to Kirsten Lynch, chief executive officer. Please go ahead.\n\nKirsten Lynch -- Chief Executive Officer\n\nThank you. Good afternoon, everyone. Welcome to our fiscal 2022 year-end earnings conference call. Joining me on the call this afternoon is Michael Barkin, our chief financial officer.\n\nBefore we begin, let me remind you that some information provided during this call may include forward-looking statements that are based on certain assumptions and subject to a number of risks and uncertainties as described in our SEC filings, and actual future results may vary materially. Forward-looking statements in our press release issued this afternoon, along with our remarks on this call, are made as of today, September 28, 2022, and we undertake no duty to update them as actual events unfold. Today's remarks also include certain non-GAAP financial measures. Reconciliations of these measures are provided in the tables included with our press release, which, along with our annual report on Form 10-K are filed this afternoon with the SEC and are also available on the investor relations section of our website at www.vailresorts.com.\n\nLet's turn to our fiscal 2022 and fourth quarter results. We are pleased with our overall results for the year, which highlights the stability and strength of our business model. As expected, results for the year significantly outperformed results from the prior year, primarily due to the greater impact of COVID-19 and related limitations and restrictions on results in the prior year. Despite the challenging early season conditions through the holiday period, staffing challenges and impacts related to COVID-19, results exceeded our original expectations for the year with fiscal 2022 resort reported EBITDA of approximately $837 million.\n\nThe strong performance was driven by the stability from our advanced commitment pass products with approximately 72% of skier visitation at our North American resorts coming from pass holders who committed in advance of the season strong destination guest visitation including demand for lift tickets and an improved guest experience from January through the remainder of the season, demonstrating strong underlying demand to be experienced at our resorts. Growth in visitation primarily occurred during off-peak periods, including weekdays and non holidays. Throughout the North American key season, our ancillary businesses continued to be capacity constrained by staffing and in the case of dining by operational restrictions associated with COVID-19. Performance in the fourth quarter of fiscal 2022 improved significantly from the prior year, driven by strong demand and visitation at our Australian resorts and the continued recovery in our North American summer operations following the start of the COVID-19 pandemic.\n\nOur Australian resorts experienced record visitation driven by strong demand following two years of COVID-19-related disruption, continued momentum in advanced commitment pass sales following the addition of Hotham and Falls Creek in April of 2019 and favorable early season conditions that continued throughout the quarter. Turning now to our 2022 season pass sales. Advanced commitment continues to be the foundation of our strategy, shifting guests from short-term refundable lift ticket purchases to a nonrefundable pass commitment before the season starts in exchange for value. We are very pleased with the results of our season pass sales to date, which demonstrates the strength of the guest experience, our network of mountain resorts and our commitment to continually investing in the guest experience.\n\nThrough September 23, 2022, North American ski season pass sales increased approximately 6% in units and 7% in sales dollars as compared to the period in the prior year through September 24, 2021, including sales for the Seven Springs Resorts in both periods and adjusted to eliminate the impact of foreign currency by applying an exchange rate of $0.76 between the Canadian dollar and U.S. dollar in both periods for Whistler Blackcomb pass sales. These results are particularly strong considering the company achieved growth of approximately 42% in units and 17% in sales dollars last year through September 17, 2021, compared to the prior year through September 18, 2020, excluding sales of the Seven Springs Resorts in both periods. Pass sales growth was driven by our renewing pass holders with particular strength in renewing pass product holders that were new to advanced commitment products last year, and we saw strong growth, particularly in destination markets.\n\nThe strongest product growth was from Epic Day Pass products attracting new pass holders who are lower frequency guests into advanced commitment products, including the new tier of products launched in 2022, 2023, with access to select regional and local resorts. Epic and Epic Local Pass products continue to represent the largest portion of our past products. with these products orienting to more higher frequency skiers and riders. As we expected, Epic and Epic Local Pass products were down approximately 10% in units versus the prior-year period after seeing growth of over 50% in the comparable prior-year period.\n\nWe expect the majority of our future growth in pass sales will continue to come from our Epic Day Pass products as we convert lower frequency lift ticket purchasers to our advanced commitment products. Pass sales dollars continue to benefit from the 7.5% initial price increase and subsequent incremental price increases relative to the 2021-2022 season, largely offset by the mix impact of the growth of new pass holders into Epic Day Pass products, including our new lower-priced Epic Day Pass offerings. Following the strong trade-up results last year, we are pleased that net migration among renewing pass product holders remains near neutral with minimal degradation relative to our spring pass sales. As we enter the final period for season pass sales, we expect our December 2022 growth rate to be relatively consistent with our September 2022 growth rate.\n\nWe continue to prioritize advanced commitment as the best way for guests to access our resorts. Similar to last year, lift ticket sales will be limited during the 2022, 2023 season in order to prioritize guests committing in advance and preserve the guest experience at each resort. We expect these lift ticket limitations will further support our resorts and communities on peak days. And we do not anticipate that the limitations will have a significant impact on our financial results.\n\nNow, I would like to turn the call over to Michael to further discuss our financial results and fiscal 2023 outlook.\n\nMichael Barkin -- Chief Financial Officer\n\nThanks, Kirsten, and good afternoon. As Kirsten mentioned, we are pleased with our results for fiscal year 2022. Net income attributable to Vail Resorts was $347.9 million or $8.55 per diluted share for fiscal year 2022 compared to net income attributable to Vail Resorts of $127.9 million or $3.13 per diluted share in the prior year. Resort reported EBITDA was $836.9 million in fiscal year 2022 compared to resort reported EBITDA of $544.7 million in the prior year.\n\nThis increase was primarily due to the greater impact of COVID-19 and related limitations and restrictions on results in the prior year. Moving now to our fiscal 2023 outlook. As we head into fiscal year 2023, we are encouraged by the strength in advanced commitment product sales and our continued focus on enhancing the guest and employee experience while maintaining cost discipline. Our employee investment of approximately $175 million to return to full staffing levels and operational footprint, along with our expected capital investment of over $300 million in calendar year 2022 are expected to further elevate the guest experience this season and increase the capacity of our resorts.\n\nDespite facing broad cost inflation and after incorporating our industry-leading wage investment, we expect meaningful growth for fiscal 2023 relative to fiscal 2022 and strong resort EBITDA margins. Our guidance for net income attributable to Vail Resorts is estimated to be between $321 million and $396 million for fiscal 2023. We estimate resort reported EBITDA for fiscal 2023 will be between $893 million and $947 million. We expect the operations of the Seven Springs Resorts and Andermatt-Sedrun to contribute approximately $22 million of resort reported EBITDA in fiscal year 2023, which is an incremental $4 million of resort reported EBITDA compared to fiscal year 2022, excluding acquisition and integration-related expenses, acquisition and integration-related expenses are expected to be an estimated $4 million in fiscal year 2023 associated with the resort acquisitions.\n\nWe estimate the resort EBITDA margin for fiscal 2023 will be approximately 31% using the midpoint of the guidance range. The guidance assumes a continuation of the current economic environment, normal weather conditions and no material impacts associated with COVID-19 and for the '22/'23 North American and European ski season or the 2022 and 2023 Australian ski seasons. The guidance also assumes a return to full staffing levels and operational footprints consistent with the expectations shared in the company's March 2022 investor conference presentation. The guidance assumes an exchange rate of $0.77 between the Canadian dollar and the U.S.\n\ndollar related to the operations of Whistler Blackcomb in Canada, an exchange rate of $0.70 between the Australian dollar and U.S. dollar related to the operations of Perisher, Falls Creek and Hotham in Australia, and an exchange rate of $1.02 between the Swiss franc and U.S. dollar related to the operations of Andermatt-Sedrun in Switzerland. While we are cognizant that the broader economic outlook remains uncertain, and there are challenging headwinds, including inflation, monetary policy in segments of the economy showing signs of slowdown, we remain encouraged by our season-to-date advanced commitment sales results.\n\nwhich demonstrate continued strength in demand for the experience at our resorts and the loyalty of our past product holders. We will monitor the macroeconomic environment as we head into the upcoming season and believe that we will continue to benefit from the stability and resilience of the business model, particularly with the strength, scale and affordability of our advanced commitment products and the diversification of our resort network. Our balance sheet and liquidity position remains strong. Our total cash and revolver availability as of July 31, 2022, was approximately $1.7 billion, with $1.1 billion of cash on hand, $417 million of U.S.\n\nrevolver availability under the Vail Holdings Credit Agreement and $220 million of revolver availability under the Whistler Credit Agreement. As of July 31, 2022, our net debt was 2x trailing 12 months total reported EBITDA. On August 31, 2022, the company entered into an amendment of the Vail Holdings Credit Agreement to extend the maturity date by two years to September 2026. The company declared a quarterly cash dividend of $1.91 per share of Vail Resorts' common stock that will be payable on October 24, 2022 to shareholders of record as of October 5, 2022, including shares repurchased during the fourth quarter for the year ended July 31, 2022, the company has repurchased 304,567 shares of common stock at an average price of $246.27 for a total of approximately $75 million.\n\nWe intend to maintain an opportunistic approach to share repurchases. We will continue to be disciplined stewards of our capital and remain committed to continuous investment in our people, strategic high-return capital projects strategic acquisition opportunities such as the recent additions of Andermatt-Sedrun and the Seven Springs Resorts and returning capital to our shareholders through our quarterly dividend and share repurchase program. As previously announced on August 3, 2022, the company closed on its purchase of a majority stake in Andermatt-Sedrun, marking the company's first strategic investment in and opportunity to operate a ski resort in Europe. Andermatt-Sedrun is a renowned destination ski resort in Central Switzerland, located less than 90 minutes from three of Switzerland's major metropolitan areas, Zurich, Lucerne and Lugano and approximately two hours from Milan, Italy.\n\nThe company acquired a 55% ownership stake in Andermatt-Sedrun, which controls and operates all of the resorts mountains or mountain and ski related assets, including lifts, most of the restaurants in a ski school operation. Vail Resorts' 149 million Swiss franc investment is comprised of 110 million Swiss franc investment into Andermatt-Sedrun directly for use in capital investments to enhance the guest experience on the mountain and 39 million Swiss franc paid to Andermatt Swiss Alps AG, which will be fully reinvested into the real estate developments in the base area. For the 2022, 2023 season, Epic Pass holders will receive unlimited and unrestricted access to Andermatt-Sedrun. Epic Local Pass holders will receive five days at the resort and Epic Day Pass holders with All Resorts Access will be able to visit during any of their days.\n\nI'll now turn the call back over to Kirsten.\n\nKirsten Lynch -- Chief Executive Officer\n\nThank you, Michael. The experience of our employees and guests is the core of our business model, and the company is using its financial resources and the stability it has created through its advanced commitment pass program to aggressively reinvest and deliver on our company mission of providing an experience of a lifetime. As previously announced, the company is making its largest ever investment in both its employees and its resorts. The company is investing approximately $175 million in our employees, making our frontline talent a strategic advantage, including industry-leading minimum wage plus career and leadership differentials across all 37 of our North American resorts, leadership development for frontline talent to build their careers at Vail Resorts, investments in affordable housing for our employees and expanding our human resources department to better serve our employees.\n\nThe company achieved full staffing levels for summer in North America and across our three Australian resorts for winter. While it is very early in our hiring process for North America winter season staffing, our hiring is currently on track for full staffing levels with strong volume of applications for seasonal frontline staff and strong retention of staff from last winter and this summer. We remain dedicated to delivering an exceptional guest experience, and we'll continue to prioritize reinvesting in the experience at our resorts. We are committed to consistently increasing capacity through lift, terrain and food and beverage expansion projects and are on track to complete 18 new or replacement lifts across 12 resorts in advance of the 2022, 2023 North American ski season is part of our onetime incremental investment this year to accelerate that strategy, which will meaningfully increase lift capacity at those lift locations.\n\nAt Vail Mountain, this includes the installation of a new four-person high-speed lift in the Sun Down Bowl and the replacement of a four-person lift with a new six-person high-speed lift in the Game Creek Bowl. At Whistler Blackcomb, this includes the replacement of the four-person high-speed Big Red Express lift with a new six-person high-speed lift and the replacement of the six-person Creekside Gondola with a new 10-person high-speed gondola. As discussed in prior announcements, we are also installing new or replacement lift at Breckenridge, Northstar, Heavenly, Stowe, Mount Snow, Attitash, Jack Frost, Big Boulder, Boston Mills and Brandywine. While 18 lift projects are on track for the 2022, 2023 season, three lift projects have been delayed and are expected to be completed in calendar year 2023, subject to approval.\n\nIn Park City, the Park City Planning Department approved a permit to upgrade the Eagle and Silverlode lifts at Park City Mountain in April of 2022, and the Planning Commission subsequently revoked that permit in June 2022. While the company is committed to resolving our permit to upgrade the Eagle and Silverlode lifts in Park City, the company intends to install the two previously purchased lifts at Whistler Blackcomb in calendar year 2023. Replacing the 4% high-speed Jersey Cream lift with a new six-person high-speed lift and replacing the four-person high-speed Fitzsimmons lift with a new 8-person high-speed lift. The Whistler Blackcomb installations remain subject to approval.\n\nThe lift-served expansion project in Bergman Bowl at Keystone is delayed due to a previously disclosed construction issue impacting an area where minimal construction was permitted. While Keystone's Bergman Bowl is planned to be open to guests for the 2022-2023 ski season, the lift installation is delayed with the goal for completion in advanced of the 2023-2024 ski season. Our capital plan for calendar year 2022 was previously expected to be approximately $327 million to $337 million. Due to the delays for the Park City and Keystone lift projects, we will be deferring approximately $10 million of capital from the calendar year 2022 to calendar year 2023.\n\nWe now expect our capital plan for the calendar year 2022 to be approximately $323 million to $333 million, including onetime investments in real estate-related projects, $4 million related to the addition of Andermatt-Sedrun and integration activities associated with the Seven Springs Resorts. In addition to the $10 million of costs deferred from calendar year 2022, the company expects to incur approximately $20 million in additional costs related to the Park City and Keystone lift projects which is included in our calendar year 2023 capital plan. In addition to this year's significant capacity expanding investments, we are excited to announce details of our calendar year 2023 capital plan. We expect our capital plan for calendar year 2023 to be approximately $180 million to $185 million, including $2 million of maintenance capital for Andermatt-Sedrun and excluding $1 million of onetime investments related to integration activities and $10 million of deferred capital associated with the Keystone and Park City projects.\n\nIncluding these onetime investments, our total capital plan for calendar year 2023 and is expected to be approximately $191 million to $196 million. This calendar year 2023 capital plan currently excludes growth capital investment at Andermatt-Sedrun, which we expect to announce along with further details on our calendar year 2023 capital plan in December 2022. At Breckenridge, we plan to upgrade the Peak 8 base area to enhance the beginner and children's experience and increase uphill capacity from this popular base area. The investment plan includes a new four-person high-speed five-chair to replace the existing two-person fixed-grip lift as well as significant improvements, including new teaching terrain and a transport carpet from the base to make the beginner experience more accessible.\n\nAs Stevens Pass, we are planning to replace the two-person fixed-grip Kehr's Chair lift with a new 4% lift which is designed to improve out of base capacity and guest experience. At Attitash, we plan to replace the three-person fixed-grip Summit Triple lift with a new 4% high-speed lift to increase uphill capacity and reduce guests' time on the longest lift at the resort. These projects are subject to regulatory approvals and are currently planned to be completed in time for the 2023-2024 North American winter season. Additionally, the company plans to expand parking across four resorts by more than 500 spaces to improve the guest experience.\n\nThe company is planning to introduce new technology for the 2023, 2024 North American ski season that will allow guests to store their pass product or lift ticket directly on their phone, eliminating the need for carrying plastic cards, visiting the ticket window or waiting to receive a pass or lift ticket in the mail. Once loaded on to their phones, guests can store their phone in their pocket and get scanned hands-free in the lift line using Bluetooth Low Energy technology. In addition to the significant enhancement of the guest experience, this technology will also reduce waste of printing plastic cards for pass products and lift tickets and RFID chips as a part of the company's commitment to zero. Even after launch, the company will continue to make plastic cards available to any guest who cannot or do not want to use their phones to store their pass product or lift ticket.\n\nThe company is also investing in networkwide scalable technology that will enhance our analytics, e-commerce and guest engagement tools to improve our ability to target our guest outreach, personalized messages and improve conversion. In closing, we are thrilled to see continued loyalty of our guests and the value proposition they see in our past products. Our advanced commitment strategy is core to the long-term growth and sustainability of our business and our focus on continuing to invest in the guest experience and our employees who deliver that experience day in and day out. With the North American ski season approaching, I want to thank all of our employees across all of our resorts for their work to welcome skiers and riders back to our resorts.\n\nWe are all committed to delivering an experience of a lifetime this coming season. At this time, Michael and I will be happy to answer your questions. Operator, we are now ready for questions.\n\nOperator\n\nThank you. [Operator instructions] We will take our first question from Shaun Kelley with Bank of America.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good afternoon, everyone. I just wanted to start with the pass purchasing. So just maybe a two-parter here would be.\n\nFirst of all, historically, you've been a little bit more conservative on maybe expecting a slowdown as we get further through the selling period. You've obviously been very successful at pulling people forward. So your commentary is more constructive than that. I think that is even into challenging comps.\n\nSo what gives you some of the confidence that trends can continue? So maybe that's kind of part one. And then part two, Kirsten, I just was hoping you could unpack if I caught it correctly, a comment in the script about full price Epic and Epic Local, those products being down a little bit relative to prior year. Just kind of what do you make of that? What could be the driver, if I caught that comment correctly?\n\nKirsten Lynch -- Chief Executive Officer\n\nThanks for the question, Shaun. I'll start with your second question first, which is about Epic and Epic Local passes. Those passes continue to represent the largest portion of our pass product portfolio. And as you know, they are oriented more to high-frequency skiers and riders where we are highly penetrated.\n\nSo as we expected, Epic and Epic Local were down about 10% in units versus prior year, and that's after seeing growth of over 50% in the comparable prior year, and that was on our expectations for Epic and Epic local. So I think it's important to note that we expect the majority of our future growth in pass will really come from Epic Day Pass as we convert both low-frequency lift ticket purchasers to advance commitment, but also guest that ski and ride at our lower-priced resorts and converting those individuals into our advanced commitment products. So Epic and Epic Local, we're on our expectations. In terms of our results and what we expect for the remainder of the season and the commentary that we expect our growth rate to be largely consistent.\n\nI would say that our results season to date are very encouraging to be up 6%, which was in line with our expectations and particularly given we were lapping 40% unit growth. The underlying dynamics that we are seeing this driven by renewing pass holders, particularly people who are first-time pass holders last year, demonstrating strong growth for us renewing our destination guests being a core driver and then Epic Day Pass. As we think about the remainder of the season, and what we typically see as we get -- move through the season as we start to -- we have strong underlying dynamics and then we start to see attracting more new guests into the program as we get closer to the start of the season. So at this point in time, feel good about our trends and what we expect them to be for the remainder of the selling cycle.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nMakes a lot of sense. Thanks. And then Kirsten, my follow-up would be on labor. Your comments were noted and very helpful.\n\nCan you just remind us of sort of what -- when do we get into the peak hiring window I assume we're rapidly approaching that? And then sort of what milestones are you watching for to kind of make sure that, that's in place? And any plans or contingency plans you have to kind of backfill any sort of last-minute shortfalls because we know you're trying to accomplish a lot in a very short period of time, just given the seasonality of the workforce in general?\n\nKirsten Lynch -- Chief Executive Officer\n\nThanks, Shaun. As you know, our employees are the core of our mission to create an experience of the lifetime, and we made a significant investment in our employees going into this season. When we look at our winter seasonal staffing, it is early, it will be ramping up significantly over the next couple of months as we head toward opening our resorts. And right now, the indicators are very strong.\n\nOne being, well, our results in terms of achieving full staffing over summer, we're very good. But we look at retention of our employees that worked at our resorts last winter. We look at retention of our employees that are working at our resorts over the summer. And both of those are very strong indicators.\n\nAnd then we look at the number of applicants for the job postings of new people that we need to hire. As you can imagine, we have pretty strong analytics around all of the measures and metrics that we're looking at and are disclosing this because we're feeling good about where we are in this process right now. I would highlight that it does ramp up over the next few months, though, as we get closer to the season. And so it is still early in the process but feeling good about where we are right now.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much.\n\nOperator\n\nAnd our next question comes from Laurent Vasilescu with BNP Paribas. Please go ahead.\n\nXian Siew -- Exane BNP Paribas -- Analyst\n\nHi, guys. It's Xian Siew on for Laurent. Thanks for the question. Maybe digging in a little bit more on the Epic Pass.\n\nYou mentioned how you expect the growth or the incremental growth to come mostly from the Epic Day. So should we expect, going forward, that mix remains like a headwind even if you're taking price or how should we think about, I guess, the mix and pricing going forward?\n\nKirsten Lynch -- Chief Executive Officer\n\nWell, yes, that is accurate assumption that what we are trying to do is move our low frequency lift ticket guest over into an advanced commitment because that is the core of the subscription model assumption that, that drives stability, loyalty, spend capture. And then we're trying to also move guests that go to some of our lower-priced resorts over into advanced commitment as well. So I would say that it's an accurate assumption under assume that the future growth will come from Epic Day Pass. In terms of pricing, I won't comment on that going forward, except that we as you know, have a significant amount of data and analytics.\n\nAand we are constantly looking at what are the levers to pull to achieve our business outcomes.\n\nXian Siew -- Exane BNP Paribas -- Analyst\n\nOK, got it. And then maybe a follow-up on retention. Can you maybe talk about, obviously, you had a big increase in units, as you mentioned last year. So how is, I guess, the retention of those new pass holders, any color there? Because I guess, if you -- this year, you don't have as many -- the incremental is coming mostly from Day and Epic Pass, I think local pass were down.\n\nIs it fair that some of those guys weren't renewing or how do we think about that? Thanks.\n\nKirsten Lynch -- Chief Executive Officer\n\nNo. I -- well, first of all, I would say, when we look at renewing pass holders, you can maybe think about it in two different buckets. The year 1 renewals or the new people who actually were new into the pass program last year, and then you have what I'll call our multiyear pass holders, people who've been in the pass program for years and years. Overall, our net migration among renewing pass holders remains near neutral with minimal degradation relative to our spring pass sales.\n\nSo I think that's an important metric. Our renewals were strong with both of the populations that I just mentioned. Our multiyear renewals were strong, and our year 1 first-time pass holders. The renewals among that group were strong as well.\n\nAnd I think that's an important underlying health of the business dynamic because it really validates our compelling resort network. It validates the guest experience, the investments that we make into the guest experience as well as the value that, that provides for our guests.\n\nXian Siew -- Exane BNP Paribas -- Analyst\n\nYeah. No, that's great to hear. Thanks so much.\n\nKirsten Lynch -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd we'll take our next question from Chris Woronka with Deutsche Bank. Please go ahead.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nYeah. Hey. Good afternoon, everyone. Thanks for taking the question.\n\nI was hoping we could talk for a minute about margins. I think you've guided to about 31% on resort margin at the midpoint. I think that's about where you were in fiscal '17, '18, '19. There's been a lot of changes to your business model since then with the volume and pricing and obviously inflation.\n\nI mean is that 31% kind of a -- do you think that's kind of a new run rate? Is there -- are there structural things that can make that go higher in the future or do you think that's the right way to base it?\n\nMichael Barkin -- Chief Financial Officer\n\nYeah. Thanks, Chris. I think, yeah, we're actually quite pleased to be able to guide to the 31% margin. We think that, that's really strong in the context in which we're operating.\n\nAnd I think important to remember that last year's actual margin was actually above what we guided to in part because yes, in part because we actually did not achieve the staffing levels that we wanted, and we did have strong business results, but we did wind up with a stronger-than-expected margin last year. And I think importantly, this year, as we look to return the business to full staffing and our full operating capacity to really focus on the guest experience, we're also doing that in a way that's very focused on the discipline across our P&L and how we're going to drive the most revenue growth with that full operating capacity, but also investing where we need to, to ensure the sustainability of our workforce and the investments that we want to make in the employee side. And of course, we're making a very significant onetime investment this year in our wage structure. And as we've shown over time, when you look at the long-term margin growth in this business, we've shown a strong ability through price and growth and cost discipline to expand margins over time, and we'll absolutely continue to focus on that going forward.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nOK. Thanks, Michael. And then just as a follow-up, you've talked about kind of an expectation that a lot of the growth going forward on past products is likely to come from the day pass. Is there any way to possibly also capture ancillary -- more ancillary stuff upfront with an advanced commitment? I know that's tricky.\n\nAnd I know there's some amount that spur the moment people will just do it. But is there any thought to possibly getting a little bit more of that locked into or is that just too difficult to do?\n\nKirsten Lynch -- Chief Executive Officer\n\nNo, Chris. I think absolutely that is our intention. And the premise of the lifetime valve model and subscribing our guests in advance of the season. And part of that assumption and data supports is that we will get the capture of the ancillary and the compounding effects of that.\n\nOne of the things you saw us do a couple of years ago, pre-COVID was announced an Epic Mountain Rewards incentive to our pass holders for a discount on ancillary businesses. And that benefit of being a subscriber, we absolutely leverage and intend to keep leveraging to increase that spend capture.\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nOK, very good. Thanks.\n\nKirsten Lynch -- Chief Executive Officer\n\nThanks, Chris.\n\nOperator\n\nAnd we'll take our next question from David Katz with Jefferies. Please go ahead.\n\nDavid Katz -- Jefferies -- Analyst\n\nHi. Afternoon, everyone. Thanks for taking my question. Can you talk a bit about Andermatt, I think it might be instructive just to get a sense for what your vision is for that and how it sort of weaves into the rest of the system potentially and what that could become longer term?\n\nMichael Barkin -- Chief Financial Officer\n\nYeah, I mean I think we're very excited about Andermatt joining the Vail Resorts network and the pass access that we've announced since the acquisition closed in early August. I think as we've talked about before, I think we feel like this is a really important moment for us to have the opportunity to wind up taking a majority stake and an operating position in a resort, you're right in one of the best ski regions in Europe and Central Switzerland. And it's -- yes, and we think that it's a quite remarkable resort both in terms of the ski experience, the capital that we're going to be able to invest in the deal that we ultimately structured with our partners as well as the base area development that has been done and is ongoing there to truly make it a premier destination in Europe. And we're very excited both about what Andermatt is today.\n\nAnd with the team that we have there and with our partners, making it one of the truly great destinations in Europe. And we do think it's an important first step for us as we consider future growth opportunities in Europe. We're going to be very focused on executing well in Andermatt for the guests that are visiting us there. And yes, certainly optimistic about what it serves as a starting point for us in Europe.\n\nDavid Katz -- Jefferies -- Analyst\n\nUnderstood. And so -- please.\n\nKirsten Lynch -- Chief Executive Officer\n\nJust to build on that, David. I agree with that. And I would just say in the short term, we are really focused on as newly into the European market, learning, building our success, building our relationships and our partnerships long term, if you look at the total addressable market in Europe and the size of it compared to North America, you can see the potential for the big unlock in growth and value creation.\n\nDavid Katz -- Jefferies -- Analyst\n\nSo if I may, just to follow that up, it sounds as though you're next move in Europe is probably to put more capital into that mountain before you would contemplate another one or sort of chew on this one and actualize this one a bit before you look at more?\n\nKirsten Lynch -- Chief Executive Officer\n\nWe're not...\n\nMichael Barkin -- Chief Financial Officer\n\nYeah, I mean I think we're -- go ahead. I was just going to say, no, we're very focused, as both Kirsten and I said, on executing well right, at Andermatt. It's a great resort with a lot of growth opportunities. I think importantly, if you remember from our announcement about the deal, the way that we structured the deal was actually oriented very much to reinvestment.\n\nSo the 149 million Swiss franc that we invested 110 million of that is injected directly into the business for future capital that we're already in the process of planning and plan to announce the first phase of, hopefully, in December. And yes, that's going to be very much the focus is both how we can invest to improve the resort, how we can partner with ASA in the base area and yet deliver the guest experience in the next few years and certainly start to introduce our Epic Pass holders to the resort, which will be a great opportunity for our guests.\n\nDavid Katz -- Jefferies -- Analyst\n\nPerfect. Thank you very much.\n\nKirsten Lynch -- Chief Executive Officer\n\nThanks, David.\n\nOperator\n\nAnd we'll take our next question from Omer Sander with J.P. Morgan. Please go ahead.\n\nOmer Sander -- JPMorgan Chase and Company -- Analyst\n\nHi, Kirsten. Hi, Michael. Thanks for taking my question. First, on ancillary revenues, how do you think about where this bucket trends maybe normalizes going forward? And how does the shift toward more past units and pass sales impact this?\n\nMichael Barkin -- Chief Financial Officer\n\nYeah, Omer, if I'm interpreting your question correctly, in terms of ancillary revenue, I think the biggest thing for this coming year is the return to the full capacity. As you know, over the last few years, we've had quite significant operating constraints primarily due to COVID and then last year due to some of our staffing challenges. And so a big part of our employee investment was to bring those businesses back to full capacity, which will be a big driver we anticipate of our revenue growth this year. And then more broadly on ancillary, certainly looking at differentiated strategies to continue to drive each of those businesses, and we'll continue to invest and innovate there.\n\nAs it relates to pass holders in ancillary, I think important to remember that we a few years ago, introduced our program called Epic Mountain Rewards, which gives pass holders a 20% discount on those ancillary products. And so that is a key part of our strategy and moving people into advanced commitment and then encouraging those guests to use those ancillary businesses to drive growth.\n\nOmer Sander -- JPMorgan Chase and Company -- Analyst\n\nOK, helpful. Thank you. And then maybe one, just pivoting, Kirsten, you talked about capacity in all these projects that are going on Park City Keystone, Breckenridge, Stevens Pass. How do you think about the total capacity that these projects can add after completion?\n\nKirsten Lynch -- Chief Executive Officer\n\nWhen I think about lift projects in particular, I think about improving the guest experience in terms of the upload capacity and the lift line wait times and the impact that, that has on our guest waiting in those lines. So putting in high capacity, high-speed lifts improves that experience by reducing that wait time for our guests.\n\nOperator\n\nAnd we will take our next question from Ben Chaiken with Credit Suisse. Please go ahead.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey. How is it going? Thanks for taking my question. On pass sales, did you guys see an acceleration after the announcement that window tickets would be limited? Was this -- did this trigger like a call to action? And was there any cohort in particular, was it renewals, single-day conversion or just new to Vail?\n\nKirsten Lynch -- Chief Executive Officer\n\nThe announcement about our lift ticket restrictions, hard to tell if there was really a meaningful call to action or impact because it's actually similar to how we've operated the last couple of seasons, and we're always focused on driving more guests into advanced commitment in earlier. So I think I would say hard to parse out if really that had any type of an impact.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nThat's helpful. And then pivoting a little bit. Canada was pretty much closed off to U.S. gears the last few years.\n\nSo in your guidance, did you assume a full recovery of that market? And then what data points are you looking at to make that decision? Are there hotel bookings? Just what kind of forward-looking do you have?\n\nMichael Barkin -- Chief Financial Officer\n\nYeah, Ben, we did assume a full recovery on Whistler Blackcomb. It certainly was impacted last year. And the biggest indicators that we're looking at are travel restrictions, which have largely been lifted at this point for Whistler Blackcomb. And yes, and so we're quite optimistic about the outlook in particular, because a lot of guests were not able to get there in the last few years in their normal travel schedule.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nGot you. That's all for me. Thank you.\n\nOperator\n\nWe'll take our next question from Ryan Sundby with William Blair.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nHey, guys. Thanks for the question. I wanted to follow up on the strength in the renewing pass holders that were new to Epic this year. Kirsten, how much of a surprise, I guess, if any, with that to you? And does it imply you should maybe take in the pass even more to encourage that first trial or is there a point where you start to do that and make the pass just too complex for the consumer to understand?\n\nKirsten Lynch -- Chief Executive Officer\n\nSorry, Ryan, can you repeat the second part of your question?\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nYeah, i's more around should you continue to evolve the pass to encourage trial or if you get to a point where it becomes too complex and the guest doesn't really understand how it works?\n\nKirsten Lynch -- Chief Executive Officer\n\nSo in terms of our renewing pass holders, we're incredibly pleased to see it. And overall, our results are on our expectations. So no, I would not say that, that was a surprise, highlighting, though, for all of you, the drivers of why we're able to grow 6% on top of 42% unit growth is this combination of strength that we see in our renewing pass holders in particular, those first-time pass holders that just joined last year, which, to me, I take as really great validation of the guest experience, the resort network, the investments we're making, the value that we have. We also saw the strength in destination and Epic Day Pass, but our overall results are in line with what we expected.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nOK, thanks. I just wanted to understand if we see more segmentation there is kind of the final product. And then it sounds like demand in Australia was great with macro and inflation becoming bigger headwinds. Is there anything to glean from that season in terms of the way it gets behaved either in terms of spending or behavior around length of stay, as you move through the quarter and beyond just to kind of project into the North American season?\n\nKirsten Lynch -- Chief Executive Officer\n\nAll three of our Australian resorts had record years. And I think that some pent-up demand because of COVID impact in Australia. We are always -- we have the benefit of having those three Australian resorts over our summer and their winter to really get learnings from, and we do always look at that and try to understand what implications that has for us going into this coming season. And I would say, right now, as we look forward into this coming season, feeling like the indicators for us are strong in terms of the pass growth, which is probably the single biggest indicator of demand for our experience, but also then mitigating risk that we may face with the economic uncertainty that's going on.\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nWe will take our next question from Patrick Scholes with Truist Securities. Please go ahead.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nHi. Good afternoon, everyone. Looks like today, you're sitting on about $1.1 billion of cash, and obviously, a substantial increase from pre-COVID levels, about $100 million. At what point do you get more confident that you can have a cash balance that's closer to those pre-COVID levels, and that's roughly $1 billion.\n\nAnd what would your priorities for that $1 billion of cash would be if you should get to that level of comfort?\n\nMichael Barkin -- Chief Financial Officer\n\nYeah. Thanks for the question, Patrick. I mean, I think we've taken a quite consistent stand on capital structure and capital allocation over time. And I think the expectation is that we'll continue to focus in the areas that we have.\n\nAnd in terms of capital allocation, we certainly whether it's cash on the balance sheet availability on credit facilities, we're really focused on the opportunity to reinvest in the business. And clearly, with our capital plan for last year, the capital plan we just announced this year, the employee investment that we're making as well as the two acquisitions, our ability to continue to invest internally in the business as well as to find strategic acquisitions as yes, where we're going to focus. I think as it relates to cash on the balance sheet and net debt, we continue to be in a very good spot. We're around two times net debt in total.\n\nAnd we continue to look at that to ensure that we keep an appropriate amount of leverage on the balance sheet and have the board's support as it relates to returning capital to shareholders with our primary tool being the quarterly dividend. And we've been quite aggressive in raising that as we've come out of COVID, and take an opportunistic moment to do share repurchases, which I think we'll continue to look at both as ways to return excess capital to shareholders.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nOK. OK, thank you. And my second question here. I'm wondering if you folks have any views on short-term rentals, certainly in many of the resort communities, there's a lot of controversy.\n\nWe've seen a lot of short-term rentals come on the market much more so than pre-COVID levels. And I'd have to imagine short-term rentals are sort of yin and the yang or a double-edged storage for you folks. One, certainly, it helps visitation and those visitors are obviously going to spend on your resorts. But on the other side, it really takes employee housing out of the market, which obviously, as we know, is a big issue, right? I wonder if you have any view on that issue at hand with the short-term rentals.\n\nThank you. \n\nKirsten Lynch -- Chief Executive Officer\n\nYeah. Thanks, Patrick. Not a view on short-term rentals, but a view on affordable housing for our employees, obviously, is a huge priority for us. And the key for us on that is really partnering in our mountain communities to try to solve that problem.\n\nWe believe it's gotten to the point where it is a crisis in our mountain communities and it has to be a top priority. And I think we've thankfully had some really strong success recently focused on that in partnership in Park City in the Canyons Village with a new affordable housing development that is going to provide affordable housing for over 440 of our employees. And then in Whistler Blackcomb, a great collaboration and partnership with the town to work on an affordable housing project for our fiscal year '24 that will come to fruition. So really, our key focus and priority is trying to find these opportunities in our mountain communities and to partner with our communities to create those opportunities so we can make sure that there are options for our employees.\n\nOperator\n\nAnd we'll take our next question from Jeff Stantial with Stifel. Please go ahead.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nHey. Good afternoon, everyone. Thanks for taking my questions. Just two quick ones for me.\n\nIf you look at guidance, it looks like it implies about 9% organic growth once you adjust for the M&A and the various headwinds and tailwinds that you've cited against the $837 million of resort reported. I guess what are the unique puts and takes you would call out that kind of factor into that 9% as compared to what you would view as, I guess, a \"normalized\" run rate organic growth, right? Let me know if that makes sense.\n\nMichael Barkin -- Chief Financial Officer\n\nYeah, I think it does make sense. I mean, I think the clear drivers kind of go back to what we actually presented in our March investor presentation where we have the large employee investment and wage investment that we're making offset that that's an increase on the cost side, but that's offset by significant growth that we're going to be able to achieve right, from a number of things. One is, last year, we had a number of headwinds in terms of Q1 impacts in Australia, a challenging early season in North America and some of the travel concerns in Whistler Blackcomb. So we're anticipating all of those come back to normal.\n\nWe're also getting the -- what we expect to be the full benefit of the full capacity of our ancillary businesses, particularly in food and beverage and ski and ride school as we return to full staffing and no COVID restrictions. So those pieces are big parts of the top-line growth story. And then, of course, we are anticipating price increases in this inflationary environment, which will also drive pieces of the revenue growth story. So those are really the big drivers of the top-line growth.\n\nAnd of course, the increase in wages will be the biggest driver on the cost side, along with, of course, we are facing inflation as everybody else is across our operating expense structure. I would say that the acquisition side is actually not as impactful this year outside of the acquisition and integration expenses because Seven Spring has performed so well last year, we actually were able to actualize a good portion of Seven Springs results last year, and those will continue into this year. And then, of course, we have the additional $4 million that we called out of additional Andermatt expected contribution this year. So those are the big pieces.\n\nI think yeah, we're quite, yeah, quite comfortable with the plan that we put together.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nOK, Understood. That's helpful. I guess just to hang on there for a second. Just to be clear, so kind of when I'm calculating the 9% baseline, I'm thinking about the fully adjusted when you reported it during the investor day, it was $832 million then, you've outpaced your initial full year 2022 guidance, but I'm taking the normalized kind of full year '22 after the labor investments after the catch up to full capacity after the normalized travel conditions kind of that normalized using that as a base line to calculate the growth rate.\n\nSo I guess with that in mind, do you mind kind of framing I guess how that 9% fairs from a normalized year?\n\nMichael Barkin -- Chief Financial Officer\n\nSo the largest difference is between kind of the normalized and for everybody else, I think we're referring to the investor conference presentation bridges that we provided back in March of 2022. The largest pieces that we had not included in that bridge, which are, of course, the bridge between that to our full year guidance were two pieces. One, what we anticipated from organic revenue growth, which, of course, is the combination of both our price increases and our volume expectations outside of the normalizing adjustments and then inflation essentially on non-wage areas of the business. And so those are the two pieces that would be incremental to the normalized to the normalized starting point.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nOK, understood. That's helpful. Thank you, Michael. And then for my follow-up, it looks like lodging EBITDA is being guided down year on year at the midpoint.\n\nJust curious if you can provide some more context on what's going on there?\n\nMichael Barkin -- Chief Financial Officer\n\nYeah. I mean, the biggest driver of that is that as we announced, we actually sold one of our properties, the Doubletree at Breckenridge, which was as with any hotel sale getting the proceeds. But of course, when you enter into a management agreement instead of an owned and operated situation, the EBITDA goes down. And so that's the primary driver of that change.\n\nI would say that the lodging business did quite well last year as did the rest of hospitality as it related to rate. And so we did not have some of the same constraints on lodging that we have in the rest of the business.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nOK, understood. Perfect. That's very helpful. Thank you very much.\n\nOperator\n\nAnd we will take our next question from Brandt Montour with Barclays. Please go ahead.\n\nBrandt Montour -- Barclays -- Analyst\n\nHello. Good evening, everyone. Thanks for taking my questions. So I wanted to circle back to the first question and I hope I'm not beating a dead horse here.\n\nBut the Epic and Epic Local being down this year, and I understand that that's in line with internal expectations. But from -- but your comments together, right, we noticed the -- like the highest frequency year. And it sounds like from your comments, this would be a skier that's not new to the program. So I guess, looking at all the data that you guys collect, who are these folks I guess that are leaving here at this point?\n\nKirsten Lynch -- Chief Executive Officer\n\nOK. So to clarify on Epic and Epic Local, that is the largest portion of our pass portfolio. It's comprised of both, Brandt, renewing pass holders as well as new people come into the pass program on Epic and Epic Local as well. Those guests tend to be high frequency skiers and riders.\n\nAnd so when you think about the total addressable market, we are highly penetrated in that market. And last year, Epic and Epic Local grew over 50% versus the prior year. So we saw a tremendous amount of growth in those two product lines. What we're seeing this year, as we expected, is that we're down about 10%.\n\nI noted earlier that we do have strong renewals overall that includes on Epic and Epic Local. And that when you think about the product line and how we're going to capture the majority of new people coming in incrementally to the pass program, their total addressable market that is remaining tends to be the lower frequency skiers or the skiers that are skiing at lower price point resorts in our portfolio. And really, so the majority of the growth that's going to come in the future is really going to come from that group because the addressable market of that group is so much bigger. Does that help clarify?\n\nBrandt Montour -- Barclays -- Analyst\n\nIt sounds like it's just really, really tough comparisons in that segment, if I'm able to maybe paraphrase. OK. Yeah, that's helpful. Thank you.\n\nAnd then just a second follow-up. The FX rates are obviously extremely volatile and everyone sort of has outsized attention to it right now. I was just curious if you guys have given or could give sort of a net or a net EBITDA sensitivity to a 1% change in your basket of currencies across Canadian dollar and the Aussie dollar specifically that would be helpful for us.\n\nMichael Barkin -- Chief Financial Officer\n\nNo, I appreciate the input. We've not put that out publicly, but I can certainly think about how we can help size that for you in the future. I mean I would say that the vast majority of our EBITDA revenue and guests continue to be U.S.-centric. Of course, we do have Whistler, which is a large resort, the largest in our portfolio.\n\nAnd then Australia has performed well, but continues to be, continues to be a relatively small part of the overall company. But we can certainly think about how to size that for you in the future.\n\nBrandt Montour -- Barclays -- Analyst\n\nOK, great. Thanks, guys.\n\nOperator\n\nIt appears there are no further questions at this time. I'd like to turn the conference back to Kirsten Lynch for any additional or closing remarks.\n\nKirsten Lynch -- Chief Executive Officer\n\nThank you, operator. This concludes our fiscal 2022 year-end earnings call. Thanks to everyone who joined us today. Please feel free to contact me or Michael directly should you have any further questions.\n\nThank you for your time this afternoon. Goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKirsten Lynch -- Chief Executive Officer\n\nMichael Barkin -- Chief Financial Officer\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nXian Siew -- Exane BNP Paribas -- Analyst\n\nChris Woronka -- Deutsche Bank -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nOmer Sander -- JPMorgan Chase and Company -- Analyst\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nRyan Sundby -- William Blair and Company -- Analyst\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nBrandt Montour -- Barclays -- Analyst\n\nMore MTN analysis\n\nAll earnings call transcripts"
}