{
  "companyName": "H.B. Fuller",
  "companyTicker": "FUL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/22/hb-fuller-ful-q3-2022-earnings-call-transcript/",
  "content": "H.B. Fuller (FUL -1.06%)\nQ3 2022 Earnings Call\nSep 22, 2022, 10:30 a.m. ET\n\nOperator\n\nGood morning. My name is Rob, and I will be your conference operator today. At this time, I would like to welcome everyone to the H.B. Fuller third quarter 2022 earnings conference call.\n\n[Operator instructions] Thank you. Steven Brazones, vice president, investor relations, you may begin your conference.\n\nSteven Brazones -- Vice President, Investor Relations\n\nThank you, operator. Welcome to H.B. Fuller's third quarter 2022 investor conference call. Presenting today are Jim Owens, president and chief executive officer, and John Corkrean, executive vice president and chief financial officer.\n\nAfter our prepared remarks, we will have a question-and-answer session. Before we begin, let me remind everyone that our comments today will include references to certain non-GAAP financial measures. These measures are supplemental to the results determined in accordance with GAAP. We believe that these measures are useful to investors in understanding our operating performance and to compare our performance with other companies.\n\nReconciliation of non-GAAP measures to the nearest GAAP measure are included in our earnings release. Unless otherwise noted, comments about revenue refer to organic revenue, and comments about EPS, EBITDA and profit margins refer to adjusted non-GAAP measures. We will also be making forward-looking statements during this call. These statements are based on current expectations and assumptions that are subject to risks and uncertainties.\n\nActual results could differ materially from these expectations due to factors covered in our earnings release, comments made during this call and the risk factors detailed in our filings with the Securities and Exchange Commission, all of which are available on our website at investors.hbfuller.com. I will now turn the call over to Jim Owens. Jim?\n\nJim Owens -- President and Chief Executive Officer\n\nThank you, Steven, and welcome, everyone. In the third quarter, we delivered 18% organic growth, 24% EBITDA growth and 34% EPS growth despite a challenging external environment. We are extremely pleased with our strong third quarter financial performance and the results achieved by our teams around the world. We continued to execute our strategy to drive organic growth and expand EBITDA margin.\n\nWe nimbly adjusted to short-term challenges from continued raw material inflation, slowing global economic demand conditions and currency headwinds. Our strategic mix shift to a more highly specified product portfolio through innovation, market share gains and customer collaboration, together with our responsible pricing actions, are delivering impressive results this year and position us very well for margin expansion in the year ahead and continued long-term profitable growth. In the third quarter, organic revenues increased 18% year on year, with all three of our global business units generating exceptional growth. As we expected, growth in volume is slowing as we progress throughout the year.\n\nThe declining trend in volume growth is largely being driven by slowing demand in Europe and in construction markets. Our market share gains continue, and we continue to outperform the competition in volume and organic growth. We expect these gains to not only endure but to continue to advance as we execute our strategy. Now, let me move on to review the performance in each of our segments in the third quarter.\n\nIn Hygiene, Health and Consumable Adhesives, organic revenue was up 23%, with strong organic growth across all end markets and particular strength in the packaging, hygiene, tissue and towel and health and beauty markets. Adjusted EBITDA for hygiene, health and consumable adhesives increased $17.3 million or 39% year on year. Adjusted EBITDA margin increased 250 basis points year on year to 14.5%. Hygiene, health and consumable adhesives led the group in margin expansion in the third quarter, a result of exceptional pricing execution and operational efficiencies.\n\nIn engineering adhesives, the strong organic growth trend continued with organic revenue growth of 17.5%, and nearly every end market contributing to the impressive results. Automotive, new energy and aerospace were particularly strong. Automobile production is increasing with improved microchip availability. This, coupled with the continued share gains in the electric vehicle market, are greatly benefiting engineering adhesives.\n\nAdjusted EBITDA increased 8% in engineering adhesives, and adjusted EBITDA margin increased 10 basis points from the prior quarter to 14.8% despite significantly higher raw material costs. In construction adhesives, the effects of the slowing global economic environment were the most pronounced, particularly in the roofing and flooring end markets. Despite this, organic revenue grew 7% year on year on strong pricing actions and strength in the utilities and infrastructure market. Adjusted EBITDA for construction adhesives was up 38% year on year, and adjusted EBITDA margin increased 180 basis points year-on-year to 14.2%.\n\nPricing actions and the strategic acquisitions of Apollo and Fourny at the beginning of the year drove the improvements. Geographically, Americas organic growth remained very strong, up 22% year on year. Customer demand remained strong and stable throughout the quarter. In EMEA, the continuing uncertainty about both the war in Ukraine and natural gas supply resulted in a slowdown in demand.\n\nWith that said, organic revenue still grew double digit, up 16% versus the third quarter of last year. In Asia Pacific, we began to see a rebound in demand during the third quarter. Easing lockdown restrictions in China and pent-up local demand led to organic revenue growth of 11.5%. From a profitability perspective, the strength of our strategy and strong execution drove significant improvement in the third quarter.\n\nOn a consolidated basis, adjusted EBITDA increased 24.4% year on year to $137.7 million. Adjusted EBITDA margin increased 120 basis points year on year and 60 basis points sequentially to 14.6%. Responsible pricing actions, which have more than offset raw material cost inflation, are increasing our margin and will result in further margin expansion in the quarter and the year ahead. Combined with our strategic shift to a more highly specified product portfolio, we are on track to further expand margins and achieve our long-term profitability targets.\n\nManagement of the pricing raw material dynamic is a core competency of the company and a competitive advantage in the adhesive market. During the third quarter, raw material cost inflation continued, but at a decelerating rate. Our price increases in the third quarter exceeded the $175 million level, which we committed to, and we're expecting an additional $40 million to $50 million of annualized price increase in the fourth quarter. We are beginning to see signs that raw material cost inflation may be leveling off in the fourth quarter.\n\nFrom a planning perspective, we're expecting stabilization of supply and pricing of raw materials. However, we are prepared to adjust pricing in the event raw material increases continue. It is important to note the unique capabilities we can leverage in a stabilizing raw material cost environment and a more competitive pricing landscape. In addition to our inherent price discipline, we also have breadth of technology and the capability to substitute adhesive technologies for customers to provide them with lower cost options, while maintaining or improving our margins.\n\nWith improved supply chain conditions, the opportunity to use these substitution capabilities greatly improves. This will be very beneficial for us and our customers. Now, let me turn the call over to John Corkrean to review our third quarter results in more detail and our updated outlook for the year.\n\nJohn Corkrean -- Executive Vice President and Chief Financial Officer\n\nThank you, Jim. I'll start with some comments on the financial results for the third quarter. Net revenue was up 13.8% versus same period last year. Currency had a negative impact of 6.6% and acquisitions had a positive impact of 2%.\n\nThe strengthening of the U.S. dollar since the beginning of the year has been historic and unforeseen, and it strengthened again throughout this last quarter. Since the beginning of the year, the euro is down approximately 15% and the Chinese renminbi, 8%. Needless to say, this has been a significant headwind for us this year, but we are still delivering impressive growth.\n\nAdjusting for currency and acquisitions, organic revenue was up 18.4%, with volumes relatively flat and pricing up 18.7%. All three GBUs had strong organic growth versus 2021, with HHC, up 23%, engineering adhesives, up 17.5%, and construction adhesives, up 7% year on year. Adjusted gross profit was up 27.3% year on year, reflecting strong pricing actions and operational efficiencies, and adjusted gross profit margin of 26.5% was up 280 basis points compared to the third quarter of last year. Adjusted selling, general and administrative expense was up year on year at 16.6% of revenue.\n\nGrowth in SG&A outpaced revenue growth due to higher variable compensation expense and higher travel-related expenses following the pandemic-driven slowdown in travel. Adjusted EBITDA for the quarter of $138 million was up 24% versus the same period last year. Adjusted earnings per share of $1.06 increased 34%, driven by pricing gains and operational efficiencies, which more than offset raw material cost increases, unfavorable currency and higher interest rates. Cash flow from operations was $58 million, up $49 million sequentially versus the second quarter, reflecting strong revenue growth and improving margins, but down versus last year due to temporarily higher year on year working capital requirements.\n\nBased on the normal seasonality of our business, we are planning for working capital to return to more normal levels by the end of the year and to be in the range of 16% to 17% of annualized net revenue, resulting in full year cash flow from operations similar to last year. Regarding our outlook for the rest of this year, we continue to remain on track to deliver results in line with or at the upper end of the full year guidance ranges we provided in the first quarter of the year with respect to organic revenue growth, adjusted EBITDA and adjusted EPS. I'd like to remind everybody that in both the fourth quarter and full fiscal year, we have an extra week of results. For fiscal 2022, we expect organic revenue growth to be in the range of 17% to 18%, excluding the impact of the extra week.\n\nThis is at the upper end of the range provided at the end of the second quarter. The extra week is estimated to positively impact full year revenue growth by approximately two percentage points. We now expect currency to have a negative impact on year-on-year revenue growth of 5% to 6% and acquisitions to have a positive impact of approximately 2%. Additionally, we expect full year adjusted EBITDA in the range of $540 million to $550 million.\n\nThis is above the range provided at the beginning of the year and at the upper end of the range provided after the first quarter and is particularly impressive given the significant currency headwinds we are experiencing this year, which impacted both the top and bottom line. The extra week is estimated to positively impact full year adjusted EBITDA growth by approximately two percentage points, consistent with the impact to revenue growth. Lastly, we expect fourth quarter adjusted EPS in the range of $1.15 to $1.30, resulting in a full year increase in adjusted EPS of between 19% and 23% versus fiscal 2021, reflecting strong underlying operating profit growth, offset by unfavorable currency and significantly higher interest rates. Regarding the latter, due to the significant increases in short-term interest rates, we are now expecting net interest expense of between $80 million and $85 million in fiscal year 2022 versus the previously provided guidance of between $75 million and $80 million.\n\nThis range includes the expectation of some opportunistic debt refinancing before the end of the fiscal year. With that, I will turn the call back to Jim Owens for some closing comments.\n\nJim Owens -- President and Chief Executive Officer\n\nThank you, John. 2022 will be a record year with EBITDA near $550 million, revenue of approximately $3.8 billion and EPS near $4.20. All of these numbers will be up between 15% and 20% versus 2021 and are a result of H.B. Fuller's strategy and the ability of our team to perform in challenging external environments.\n\nWe are outperforming our competition, and we will continue to do this, because of our ability to innovate and win market share across a broad range of end markets and geographies. We are well positioned for significant margin expansion and cash flow generation as we exit this year and enter 2023, as supply chain stabilize and raw material prices moderate. Despite external challenges, we are executing our strategy, and we are building momentum. We're delivering innovative value-added solutions to customers faster than our competition to drive market share gains, and we are retaining our market share gains.\n\nWe have effectively managed through unprecedented raw material inflation, regional disruptions and slowing economic demand and have a plan in place to expand EBITDA margins and cash flow generations as raw material prices stabilize and eventually begin to decrease. I could not be prouder of our team members for their dedication to our customers and their strength in executing in a challenging environment. We are tremendously well positioned. We are delivering impressive results in the short term, and we are solidly on track to deliver a strong finish to this year, a strong start to 2023 and to meet our long-term financial targets, which will drive significant returns for our shareholders.\n\nThat concludes our prepared remarks today. Operator, please open the line for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Vincent Anderson from Stifel. Your line is open.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nYeah. Good morning, everyone. So if you don't mind holding my hand for a minute here, from a modeling perspective, what has been the year-to-date dollar contribution from price? And then how much does that leave that's really already booked for 2023, just based on what has already been announced versus what you've realized year-to-date?\n\nJim Owens -- President and Chief Executive Officer\n\nYes. So John is better at holding people's hands than I am, Vincent. So I'll let him take you through. But in broad terms, including what we have lined up for this next quarter, it's about $500 million.\n\nAnd I would say, the impact to next year would be about 6% of revenue. So that's the broad way to look at it, but John can take you through quarter through quarter.\n\nJohn Corkrean -- Executive Vice President and Chief Financial Officer\n\nSure. So yes, Vincent, so I think on a year-to-date basis, we've seen approximately $400 million of price impact from the top line standpoint. And we would expect the Q4 number to be similar, not as high year-on-year. And then, from a carryover standpoint, I'd say, we would expect approximately 6% impact in 2023 from pricing carryover.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nOK. Perfect. And then, --\n\nJim Owens -- President and Chief Executive Officer\n\nI think the annualized number, if you look at it, Vincent, is about $550 million, $560 million. And the impact on next year is about $220 million, $230 million, so.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nOK. Perfect. That was pretty close then. So what market share gains are you most confident in? And maybe just more specifically, as you look at how you've positioned yourself to serve Europe from a reliability perspective, do you expect there to be some additional opportunities to take share there this winter if this energy crisis deepens?\n\nJim Owens -- President and Chief Executive Officer\n\nOK. Yes. The market share gains are innovation-driven, right? So and they're very broad-based. You were here during the investor day.\n\nThe work we're doing on EVs, battery encapsulants and other EV wins is very impressive and broadening. Our work in China in the automotive business is really impressive in terms of -- there's a lot of EV there, but there's also other opportunities that are moving forward. We are winning in the packaging area around beverage labeling because it's a -- the Ukraine crisis has made a reduction in raw material called casing that's exported around the world. That's enabled us to gain share with some synthetic products globally.\n\nThat's really been impressive. You saw the 4SG wins. So I got a whole long list, right? But there's wins in every one of our segments. And it's all driven by this innovation approach to understanding the trends in markets and then innovating first.\n\nAnd hopefully, that came out at investor day, but that's what's driving the market share wins. Specifically around Europe, I don't think there's necessarily a market share gain there that's sitting there for us. By being a great service provider, by being an effective team, we'll do a great job serving customers. Will there be some wins? Probably.\n\nBut I would say mostly, it's an innovation-driven strategy more than opportunistic around gas shortages.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nOK. Excellent. And then, if I could just sneak in one quick one. If you could just add maybe a little additional detail on what you saw in roofing this quarter?\n\nJim Owens -- President and Chief Executive Officer\n\nYes, roofing was -- it's been so strong for us. And if you look at the year-on-year numbers in CA, I think we only had 7% organic growth, which is pretty good organic growth. But we're up against the quarter last year where we were up almost 20% organically. So there's a little bit of up and down in roofing, and the biggest challenge for our customers is getting other materials.\n\nSo we see some pent-up demand in our roofing customers. Certain materials, they're not able to supply. But for us, it resulted in a slowdown because they had the adhesive they needed but didn't have some of the other materials. And again, ours is mostly commercial roofing.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nPerfect. All right. Thanks again.\n\nOperator\n\nYour next question comes from the line of David Begleiter from Deutsche Bank. Your line is open.\n\nAnthony Mercandetti -- Deutsche Bank -- Analyst\n\nHey, guys. Good morning. This is Anthony Mercandetti on for Dave. A couple of questions from me here.\n\nMaybe first on demand. Is there any additional color that you can provide on slowing demand by region and market? And maybe how your visibility on demand looks into the last two months of the year here?\n\nJim Owens -- President and Chief Executive Officer\n\nYes. So as I mentioned in the prepared comments, we definitely saw a market change in Europe in the quarter. So I would say, broadly, Europe slowed down in the third quarter, and we expect that to continue in the fourth quarter. And then, in North America, it was mostly construction downturn.\n\nAnd outside of that, we saw significant uptick in Asia. I think we had our first double-digit organic growth quarter in a long time, especially if you exclude the impacts of the pandemic. One quarter, I think we had a good quarter because of pandemic issues in China. But double-digit in organic growth in Asia is great to see.\n\nSo that was a nice uptick in the quarter. But most of the slowdown, sizable in Europe and then U.S. construction. And then, as far as visibility into the next quarter, we don't see dramatic changes.\n\nI would say, a little more slowdown as we enter this quarter into North America. Europe, sort of the same. We're anticipating it to get worse, but it's not like it's falling off the table.\n\nAnthony Mercandetti -- Deutsche Bank -- Analyst\n\nGot it. Very helpful. And then, maybe just one more for me on maybe price versus raws here. I know we said there's signs of deflation, would you say that raw material costs, they have peaked? And if so, are you still confident that the majority of your pricing will be sustained going forward?\n\nJim Owens -- President and Chief Executive Officer\n\nYes. Raw materials have definitely peaked, doesn't mean they can't come back. But Q2 was the peak. I think we expected a slight decline in Q3.\n\nWe saw a slight decline in the amount of inflation, right? It was a much lower level of inflation in Q3 than Q2. So Q2 was the peak. As I said in the commentary, we're expecting raws in Q4 net-net, some will be up, some will be down, to be relatively flat to Q3. And the second part of your question was -- oh, hold on to our price.\n\nYes, we're very confident in our pricing retention, right? As I mentioned before, a portion of our HHC business is indexed. So that will move a little bit with a lag. So it's part of our increases in Q4, what happened to raw materials in Q3 in HHC. But outside of that, it's -- there will be very strong stability in our pricing, certainly over the next 12 months, 18 months, eventually some of that works its way into the numbers.\n\nBut we'd expect really no giveback in the next -- in the coming few in short term.\n\nAnthony Mercandetti -- Deutsche Bank -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Mike Harrison from Seaport Research Partners. Your line is open.\n\nMike Harrison -- Seaport Research Partners -- Analyst\n\nHi. Good morning. Congrats on the nice quarter. Congrats on the nice quarter.\n\nI was wondering if you can give us the volume and price breakdown by segment for Q3. And then, maybe talk a little bit about your expectations for volume and pricing by segment as you look at the fourth quarter.\n\nJim Owens -- President and Chief Executive Officer\n\nYes. So as you know, we don't go through the specific details on volume and price. But as we showed overall, this was mostly price-driven. CA had volume declines, and EA and HHC were pretty solid.\n\nBut John, do you want to comment further on that?\n\nJohn Corkrean -- Executive Vice President and Chief Financial Officer\n\nYes, I think the pricing was up double digits in all three GBUs. Volume up mid-single digits in EA. Volume was flattish in HHC and then down mid-single digits in construction adhesives.\n\nJim Owens -- President and Chief Executive Officer\n\nYes. And if you look at those numbers in HHC and EA, ex Europe, they'd be a lot more positive, Mike. So Europe is the drag.\n\nMike Harrison -- Seaport Research Partners -- Analyst\n\nYes. And I guess, in terms of Q4, maybe on a consolidated basis compared to the flattish or slight decline that you saw in volume in Q3, is that expected to worsen? Or still kind of a flattish number?\n\nJim Owens -- President and Chief Executive Officer\n\nYes. We're planning for it to get worse. I don't think we see signs of it. But given the economic news out there, we definitely see some improvements in Asia.\n\nWe definitely have more market share gains that are coming through in our numbers. But I think if you think about what we've guided to, it's based on an expectation that volumes overall would be a little worse, right? But again, it's not like we see signs of that. We just know from what's out there economically in the news that it's a potential. So we're planning for it and hoping for an upside, but definitely some uptick in Asia and definitely some market share wins that are mitigating anything that's happening economically out there.\n\nMike Harrison -- Seaport Research Partners -- Analyst\n\nOK. And then, in the Construction business, I'm comparing this quarter, Q3, to what you saw in Q1. The revenue number was about $25 million higher, but the margin was pretty similar, even though I would have assumed that we would see some operating leverage and maybe some price/cost improvement. Can you talk about what you're seeing in terms of price/cost, operating leverage and mix in that construction business that it's maybe dragged on the margin performance compared to what we might have anticipated?\n\nJim Owens -- President and Chief Executive Officer\n\nYes. Well, again, margins are way up versus this time last year. And Q1 is a little bit of an odd quarter, Mike, in terms of the construction market. We're talking about December, January and February.\n\nSo comparing Q1 to Q3 is not -- so I like comparing Q3 to Q3 and Q1 to Q1 and year over year. It's up dramatically here versus a year ago. But John, would you say it's mostly mix? Is that the answer?\n\nJohn Corkrean -- Executive Vice President and Chief Financial Officer\n\nI would say, yes, it's mostly mix. I mean the roofing business had a lot of pent-up demand coming into this year and was -- really came out of the gate strong, which drove very nice margin improvement. But overall, the fundamentals in terms of pricing and other elements and impact, margins haven't changed.\n\nMike Harrison -- Seaport Research Partners -- Analyst\n\nAll right. Thanks very much.\n\nJim Owens -- President and Chief Executive Officer\n\nThanks, Mike.\n\nOperator\n\nYour next question comes from the line of Ghansham Panjabi from Baird. Your line is open.\n\nGhansham Panjabi -- Baird -- Analyst\n\nThank you. Good morning, everybody.\n\nJim Owens -- President and Chief Executive Officer\n\nHi, Ghansham.\n\nGhansham Panjabi -- Baird -- Analyst\n\nGood morning, Jim.I just want to go back to your confidence on pricing retention. Here we are with the unprecedented raw material inflation cycle. The numbers are significant in terms of pricing that you've instituted, customers have instituted. Raw materials have gone up significantly, and there's -- just based on your comments, it seems like we're sort of hitting that plateauing point and perhaps even some deceleration going into next year, just given the macro backdrop.\n\nSo I'm just trying to understand your confidence on being able to retain pricing in that scenario, which would be very different than what the industry has done historically. So why is that -- why would that be different?\n\nJim Owens -- President and Chief Executive Officer\n\nWell, I mean, historically, the industry has retained pricing. So I think adhesives are a small part of someone's overall costs. So the retention of pricing, certainly over the first 18 months, is normally a part of what we would see. And remember, our portfolio has shifted a lot more to highly specified applications.\n\nSo where competitive dynamics come into play is when people introduce new products, when there's alternates for substitution. And that's what I was trying to get across in my prepared comments. One of the things you'll see us do as smaller competitors aggressively go after opportunities is to substitute new raw materials or new adhesive technologies. So you can only do that in an environment where there's supply availability.\n\nBut we'll work with suppliers around the globe to introduce new products, introduce new technology, lower-cost raw materials that will manage our margins as that happens. But yes, there's no -- there's never been a giveback of price. Now, as I mentioned, I do have some customers that are on indexes. So they'll move up with a lag.\n\nThey'll still have a couple of quarters of increases, and you'll see those in numbers. But if raws come down, those will start to be a pushback on price that will be built into the contracts. But that's a small -- that's only a portion of our HHC business.\n\nGhansham Panjabi -- Baird -- Analyst\n\nOK. Great. And then, on the EA segment, which has historical -- I mean, it has some cyclical end markets that it's exposed to as well, how should we think about that as we cycle into fiscal year '23? I know there's a lot going on with auto OEM and big backlogs, etc. But what about the other end markets there?\n\nJim Owens -- President and Chief Executive Officer\n\nYes. So I think as you think about the business broadly, right, you got to worry about cyclicality. I think one of the things, when you dig into the details, we got a sizable auto business. We've got a solar business.\n\nWe've got an aerospace business. We have some of the products that are tied to commercial construction, others that are durable goods that consumers use. So they all cycle a little differently. So I would say there's not some broad cycle that this business will hit.\n\nRight now, we've got the benefit of automotive in that business that's helping. And then, you also have this geographic dynamic that's going on, right? What's happening now in Europe eventually will work its way out. But at the same time, we have a decent-sized Asia business that is showing good positive signs of life. And following the Chinese People's Congress, you would expect it to continue to move on in 2023.\n\nSo I guess the point is it's very diverse business, 30 different market segments, and they'll cycle differently across EA. So I don't feel like we have a -- so we look at each one of those separately. And we feel like right now, with what's going on in the world, they're all off phase a bit.\n\nGhansham Panjabi -- Baird -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nYour next question comes from the line of Eric Petrie from Citi. Your line is open.\n\nEric Petrie -- Citi -- Analyst\n\nHey. Good morning, Jim and John. So I think the largest adhesive competitor released organic sales growth target of 10% to 12%. You're at 17% to 18%.\n\nHow sustainable is that this year and next year? And how much of your portfolio would you say is spec and specified versus more substitutable on a pricing basis?\n\nJim Owens -- President and Chief Executive Officer\n\nYes. Yes, thanks for pointing that out, yes. In fact, our two largest competitors showed organic growth of 12% and 11% for the first half of the year versus our 18%, 19%. And biggest driver in the delta, some of that is pricing.\n\nWe do have a higher price impact, but there's a big volume difference, and it's all tied to this market segment innovation strategy that we have. And that's very sustainable. That's built into the business model of our approach to segmented by these 30 segments and finding those market segment trends. So those market segment trends, whether that's new ways in which e-commerce is going to be packaged, paper straws, new ways in which windows are produced, being on the front end of EV, understanding the new trends in electronics and making certain that we're doing the work there is all built into our business model.\n\nAnd I think you saw that when you were here in Willow Lake. That very intense focus segment by segment on being on the front end of change is really what's driving things. And Celeste and the team are very focused on that innovation growth strategy, and they're delivering on it quarter after quarter. It's not just the first half of this year.\n\nYou see it in the organic numbers over the last few years. And so, is it sustainable? I think it is. I think it's a sustainable competitive advantage that's going to continue. I can't spec the market, but that delta that you talked about in our organic growth versus competition, that's what we look to achieve.\n\nAnd Celeste and the team are doing a great job of delivering it.\n\nEric Petrie -- Citi -- Analyst\n\nOK. And then, a question maybe for John. How do you see debt paydown going forward in reaching that target of two to three times?\n\nJohn Corkrean -- Executive Vice President and Chief Financial Officer\n\nYes. So I think, Eric, as we said in our opening comments, we expect our full year operating cash flow for this year to be similar to last year. And I think that type of cash flow delivery would be expected next year. So I think you can sort of bake that into our expectations around debt pay down.\n\nWe obviously won't get to our target this year, but we think getting there toward the end of next year is in range. Of course, we'll also potentially have some bolt-on M&A. But I think that's -- our plan is continue the strong cash flow that we expect to deliver in the fourth quarter and have a similar cash flow next year to get us closer to our target by the end of next year.\n\nJim Owens -- President and Chief Executive Officer\n\nOr even better cash flow next year, right, depending on what happens with raws, right, as people mentioned earlier in this call, if that happens, that helps us liberate cash from working capital. But certainly, we're committed, Eric, in a very strong way to get to that two to three times. And we'll be in the low threes by the end of this year. We saw a big downtick this quarter, and you'll see another one next quarter.\n\nEric Petrie -- Citi -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nYour next question comes from the line of Rosemarie Morbelli from Gabelli Funds. Your line is open.\n\nRosemarie Morbelli -- Gabelli Funds -- Analyst\n\nThank you. Good morning, everyone, and congratulations on a great quarter.\n\nJim Owens -- President and Chief Executive Officer\n\nThanks, Rosemarie.\n\nRosemarie Morbelli -- Gabelli Funds -- Analyst\n\nJim, I was wondering if you could talk about the supply chain, whether it is really improving. And linked to the supply chain, what are you seeing in terms of your customers' inventories? Do you feel that they are building inventory? Or because of the looming recession, maybe they are not. Can you give us a better feel for what you see out there?\n\nJim Owens -- President and Chief Executive Officer\n\nYes. So supply chains are definitely improving, but they're still fragile, right? So I would say versus where we were the last three, four quarters, we're much better, but versus normal, we're not there yet. So I think there is some destocking that's going on in some markets, but it's not some great destocking. And I think generally speaking, customers are going to be very cautious here for a little bit of while on especially input materials like adhesives, right? So I don't think saving inventory on adhesives is going to be a big drive.\n\nNow, are there end products that are going to come out of the supply chain? Certainly, autos that are half built will get fully built, right? But there's also a lot of the supply chain that's not filled beyond our customers. So while there's some contraction that will happen in our supply chain, dealerships and downstream inventories are very low. So I think they're going to balance out as we look to the next few quarters, Rosemarie.\n\nRosemarie Morbelli -- Gabelli Funds -- Analyst\n\nAll right. And then, you talked about -- well, two questions, really in one. You talked about a small part of HHC being indexed. So if you could give us a feel for the size of that indexed piece of business.\n\nAnd then, if you could talk about the position of Fuller in a recession versus the way you were in the last one?\n\nJim Owens -- President and Chief Executive Officer\n\nI'm sorry, I missed the last question, Rosemarie. Can you say that?\n\nRosemarie Morbelli -- Gabelli Funds -- Analyst\n\nRegarding your position, should a recession come along in 2023, how much better are you positioned than you were in 2008, for example?\n\nJim Owens -- President and Chief Executive Officer\n\nYes, that's great. Yes. So I would say it's -- overall, this index case is maybe less than 15% of our total company, 20% to 30% of HHC. Yes, I mean, we are extremely well positioned, right? I've been in this industry for 36 years.\n\nAnd the work that Celeste and the team have done to manage our margins, to have this kind of gross margin expansion when inflation is going the way it is and currency is going the way it is, if you run the math, currency was a big drag on our EBITDA this quarter, and it will be this year. So our EBITDA is going to be up 17%, 18%. And it were going up a lot more if it wasn't for this -- just this translational currency impact. So the work the team has done and the position we're in is extremely solid.\n\nAnd as you point out, our margins will expand as recessionary impacts hit. So we're very well positioned for a significant margin expansion. And we also, as somebody -- as I think Vincent pointed out early on in the call, we also have this benefit of carryover price as we go into 2023. So we have this natural uplift in revenue that's going to happen as that price works its way through.\n\nSo yes, extremely well positioned. And I tried to make that point in the prepared comments. But as we look at Q4, and we're well positioned to weather whatever will come at us, right? And we're all preparing for the worst and hoping for the best, but I think we're in a really good position as we get there, and better than we've ever been.\n\nRosemarie Morbelli -- Gabelli Funds -- Analyst\n\nYep. Thanks. Good luck.\n\nJim Owens -- President and Chief Executive Officer\n\nThanks, Rosemary.\n\nOperator\n\nAnd your next question comes from the line of Vincent Anderson from Stifel. Your line is open.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nYeah, thanks. I just had a one last follow-up here. I mean your margins in HHC this quarter were pretty exceptional. And then, later in the call, you mentioned a lot of the price increase planned for 4Q is some of the raw materials that are passed through in that segment, if I heard correctly.\n\nSo given the lag, I guess, I'm even more surprised by the margins this quarter. And so, could you speak to that performance and if it reverts a little bit in 4Q, just on that price versus raws lag?\n\nJim Owens -- President and Chief Executive Officer\n\nYes. So I think, yes, there's not like something that happened all of a sudden in Q3. This has been an ongoing process of the team there doing a great job. So we didn't have an uptick in Q3.\n\nI'd expect things to be solid again in Q4, but not some big uptick in Q4. I think we expect a little bit of margin expansion in the EA business -- well, across all our businesses, we expect our margin expansion into Q4 because the dynamics are very positive. But I wouldn't say that's going to be overweighted in Q4 to HHC.\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nOK. All right. That's helpful. Thank you.\n\nJim Owens -- President and Chief Executive Officer\n\nThanks, Vincent.\n\nOperator\n\nAnd there are no further questions at this time. Mr. Jim Owens, I turn the call back over to you for some final closing remarks.\n\nJim Owens -- President and Chief Executive Officer\n\nGreat. Well, thanks, everybody, for your questions, your interest and for your support of H.B. Fuller. And thanks to Celeste and our teams around the world for the great results.\n\nThanks, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteven Brazones -- Vice President, Investor Relations\n\nJim Owens -- President and Chief Executive Officer\n\nJohn Corkrean -- Executive Vice President and Chief Financial Officer\n\nVincent Anderson -- Stifel Financial Corp. -- Analyst\n\nAnthony Mercandetti -- Deutsche Bank -- Analyst\n\nMike Harrison -- Seaport Research Partners -- Analyst\n\nGhansham Panjabi -- Baird -- Analyst\n\nEric Petrie -- Citi -- Analyst\n\nRosemarie Morbelli -- Gabelli Funds -- Analyst\n\nMore FUL analysis\n\nAll earnings call transcripts"
}