{
  "companyName": "Duluth Holdings",
  "companyTicker": "DLTH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/duluth-holdings-dlth-q2-2022-earnings-call-transcr/",
  "content": "Duluth Holdings (DLTH 1.98%)\nQ2 2022 Earnings Call\nSep 01, 2022, 9:30 a.m. ET\n\nOperator\n\nGood morning and welcome to the Duluth Holdings, Inc. second quarter 2022 conference call. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Nitza McKee.\n\nPlease go ahead.\n\nNitza McKee -- Investor Relations\n\nThank you, and welcome to today's call to discuss Duluth Trading's second quarter financial results. Our earnings release, which was issued this morning is available on our investor relations website at ir.duluthtrading.com under press releases. I am here today with Sam Sato, president and chief executive officer; and Dave Loretta, chief financial officer. On today's call, management will provide prepared remarks, and then, we will open the call to your questions.\n\nBefore we begin, I would like to remind you that the comments on today's call will include forward-looking statements, which can be identified by the use of words such as estimate, anticipate, expect, and similar phrases. Forward-looking statements by their nature involve estimates, projections, goals, forecasts, and assumptions, and are subject to risks and uncertainties that could cause actual results or outcomes to differ materially from those expressed in the forward-looking statements. Such risks and uncertainties include, but are not limited to those that are described in our most recent annual report on Form 10-K and other SEC filings as applicable. These forward-looking statements speak only as of the date of this conference call and should not be relied upon as predictions of future events.\n\nAnd with that, I'll turn the call over to Sam Sato, president, and chief executive officer. Sam?\n\nSam Sato -- President and Chief Executive Officer\n\nThank you, Nitza, and thank you for joining today's call. We're excited to share progress and updates on our key strategic initiatives as we move into the back half of the year and prepare for the fall-winter season. As you recall from last quarter's earnings call, we recently updated our brand positioning by introducing the Duluth by Duluth Trading and the AKHG sub-brand to our brand platform. We also launched our AKHG Women's Collection to fill the open space for innovative and technical outdoor clothing designed for women.\n\nThe brand positioning directly addresses our customer's desire for apparel and gear that meet their active work and outdoor recreational activities while staying true to the Duluth Trading heritage of standing for quality, durability, and problem-solving functionality. The customer response to our brand positioning has been strong and confirms our view of long-term growth potential embedded in our strategic plans. In particular, we see the women's apparel categories across our sub-brands having outsized expansion opportunities. During the second quarter, women's grew nearly 4% over last year and represented a nearly 30% increase from the pre-pandemic period in 2019.\n\nThe introduction of the Women's AKHG Collection was a key driver of this growth in Q2, but also contributing to the multi-year expansion is our core Duluth Garden and Wayforgers workwear collections. By focusing on both fit and function our broad size-inclusive options, and trusted technical designs continue to build loyal brand consumers. Moving to a more balanced assortment across men's and women's expands our addressable market potential and leverages the technical, and logistics investments we're making to support product offerings that appeal to a broader customer base. I'll share more regarding recent product launches and customer insights informing our growth strategy shortly.\n\nBut first, I'd like to touch on our recent results. Today we reported second quarter net sales of $141.5 million, a net income of $2.4 million, and earnings per share of $0.07. While these results fell short of our internal plans, as we were not immune to the heightened level of macro uncertainty and inflationary pressures impacting discretionary spending, we're encouraged by the healthy momentum in our direct channel, which posted a slight year-over-year increase in the quarter, and improved sequentially when compared to the 12% decline in Q1. Additionally, our cleaner inventory position this year weighed on the top line sales growth, with sales of clearance goods down roughly $13 million compared to the second quarter of last year.\n\nExcluding clearance goods, net sales in the quarter were up roughly 5% over last year. While we are seeing some signs of consumer spending softness with store traffic down to the prior year and customers' purchase behavior influenced more by promotional events, our product selling gross margins were nearly flat to last year, and the average transaction size for the retail channel also held firm. Additionally, store conversion rates increased from the prior year, supporting brand health and strong product acceptance. Dave will share more details on the gross profit margin for the quarter.\n\nBut nearly all of the 120 basis point decline was attributed to an isolated inventory write-down on goods damaged while in transit. Our overall inventory position is in good shape after shipping delays that impacted last year and the first quarter has mostly subsided. Importantly aligned with our strategic shift to carry meaningfully lower levels of clearance inventories, our end-of-season clearance represented roughly 8% of total inventory compared to 10% last year. We are entering the fall selling season clean and well positioned to capture demand.\n\nHaving said that, we are prudently adjusting our sales outlook for the back half of the year to reflect an evolving, yet uncertain macro and consumer operating environment. But we still do expect to recapture sales that were missed last year because of the significant shipping delays. As a reminder, we ended our second quarter last year with inventory levels down 20% against the prior year in which we missed sales in the second half due to these delays. As we enter the third quarter, our inventories are up 22% versus last year.\n\nAnd if you exclude in-transit inventory, our year-over-year inventory is up 13%. Importantly, nearly 90% of the increase in inventory is made up of year-round goods. With our total inventory in a much better position and with an improved flow of new seasonal receipts, we believe our better in-stock positions will support overall sales growth. We are managing expenses well in the face of inflationary headwinds and remain committed to the investments we previously discussed in support of our Big Dam Blueprint to build out our infrastructure and technical skill sets while also investing in our teams.\n\nProgress on our logistics expansion and automation project in our new fulfillment center in Adairsville, Georgia, is going well and is on track to be operational in mid-2023. We are in the final stages of adding capabilities to speed up inbound and outbound inventory flows in both our Belleville and Dubuque fulfillment centers, which will better support our needs as we enter the all-important peak holiday season. Additionally, we've kicked off a key technology project to upgrade our Microsoft ERP system to the current generation, which is an important piece of our technology initiative to advance our internal capabilities and build the foundation to support long-term growth. The new ERP system is expected to go live in mid-2023.\n\nFinally, we recently announced the hiring of a new chief technology and logistics officer, AJ Sutera. AJ has tremendous experience and expertise across the critical components of our strategy, and we're very excited to have AJ join the Duluth family. We are also committed to building our family of brands with the necessary awareness marketing, and customer data insights needed to flex our mix of advertising. The customers' adoption of digital platforms and influencer-based purchase behavior has never been greater and is informing our shift to prioritizing social media, and paid digital media to gain greater visibility in our sub-brands.\n\nThe best return on advertising spend comes from where we're able to leverage data models to identify specific customer segments to focus on purchase frequency within priority geographies. As we further develop our customer insight capabilities, we're refining our understanding of who makes up the most valuable Duluth Trading customer in terms of their initial purchase, spend frequency, and average transaction size. Our data tells us that customers who first purchased with a heavy promotional, or clearance discount typically have lower retention rates and lower overall spending. Over the last two years, many new buyers made up this profile and account for roughly 20% of our buyer file.\n\nThese buyers are more price driven and lead to lagging lifetime value. Buyers who first purchased was not on a steeply discounted transaction make up 80% of our buyer file and on average are worth twice the lifetime value. These customers are our conventional spenders who retain better and spend more than price-driven buyers. While new buyer acquisition is critical to our long-term success.\n\nMore important is acquiring conventional spend customers, even when that means we may acquire fewer new buyers annually than we have over the last two years. Once acquired our focus on messaging shifts to engagement and retention. Our marketing technology capabilities are allowing us to introduce new communication tracks, and enhance personalization through triggered, and transactional communication. Understanding the unmet needs, perceptions, attitudes, and purchase decisions of our target customers, our better informing are differentiated, and competitive offerings in-store and online to drive incrementality.\n\nAltogether, we've recently mapped a 12-month new customer journey program that begins with digitally driven prospecting through social media and paid search based on lookalike customer modeling. Next, we focus on an onboarding process designed to introduce Duluth brand values and share peer reviews, and customer picks, prioritize premium brand messaging and encourage new customers to follow and share our stories. Finally, with data-driven recommendations based on prior customers, we provide personalized offers for a second purchase to nurture loyalty and cross-brand selling. This intentional approach to building customer retention informs our marketing decision and test and learn acumen for ongoing refinement.\n\nThe early results of these efforts have led to a mid-single-digit increase in new conventional spend buyers. During the second quarter, we realized a high single-digit increase in website visits and nearly 70% of all visits came through mobile devices, generating just over half of total direct net sales. These results continue to give us confidence that investing in a digital-first strategy is the right way to go. The benefit of employing more targeted messaging in more real-time platforms is that our seasonal product categories have greater relevance and appeal during their best-selling time frames.\n\nWhen we can capture business that is buy now wear now, we not only meet our customers' real-time demand and fuel brand loyalty but drive higher sell throughs at full price, resulting in higher gross profit margins. This is a good segue into recent merchandising performance as we transition between our spring-summer season and our fall-winter season. Our seasonal categories, such as gardening, swim, shorts, and short-sleeved shirts are continuing to build year-over-year momentum in both Duluth workwear and AKHG outdoor recreational collections. Also, our proprietary fabrications that serve customers' needs in warmer climates, such as Dry on the Fly, Armachillo, and COOLMAX are among the strongest positive growth product sets for us.\n\nIncluded in these product categories are items within our first layer brands such as the Armachillo cooling bra, which has been selling extremely well along with the overall bra business that grew nearly 60% in the second quarter. Total women's first layer category grew nearly 20% in the quarter with continued strength in our No-Yank Tank collection. From a sub-brand standpoint, AKHG led the pack with total sales growth of 21% in the second quarter, followed by our first layer collection at 2%. Overall, Duluth by Duluth Trading was down in the quarter by 9% with the largest impact coming from less clearance sales.\n\nThe good news is we're already starting to see good demand for new fall products such as flannels, DuluthFlex Fire Hose Pants, and footwear items such as our Duluth Grindstone work boots and Jackpine Hikers. Our fall and winter season is poised for growth, with exciting new collaborations that include a sponsorship with the Green Bay Packers on a limited edition Duluth Game Day apparel assortment, and a partnership with Mossy Oak for the introduction of camouflage patterns and highly visible outerwear items for our hunting enthusiasts. We are also expanding one of our best and long-standing men's programs of long-tailed tees that will provide a wider assortment of fit, features, and colors to further command ownership in the workwear first-layer category. In the women's first layer business, we are introducing new silhouettes of our successful Line Tamer collection of bras and underwear that feature invisible, bonded seams, and super soft construction, providing the ultimate comfort and support our customers are asking for.\n\nLastly, we're excited to share the publication of Duluth Trading's first corporate responsibility report that articulates our commitment to critical aspects of our ESG initiatives. The report showcases where we delivered, how we are progressing, and the ways we plan to grow in our commitment to sustainability. Being a people-first organization that values diversity and inclusion and practices good corporate governance. As with any organization, we understand that we have work to do and strive for continuous improvement.\n\nWith guidance from our ESG steering committee and board of directors, our approach to reporting is to be straightforward, realistic, and not overstate, or obscure where we are in the process. As we demonstrate in the report, our responsibility goes beyond our own business, and I'm proud of the initiatives we have pursued and the meaningful progress our team has made. With that, I'll turn it over to Dave to provide more details on our second quarter results and discussion of our back half of the year outlook. Dave?\n\nDave Loretta -- Chief Financial Officer\n\nThanks, Sam, and good morning. For the second quarter, we reported net sales of $141.5 million, down 5.1%, compared to $149.1 million last year, and up 3% compared to the same period in 2020. The decrease in clearance sales between this year and last was roughly $13 million and was the contributing factor in our sales decline year over year. Our direct channel sales were up 0.1% from last year, while the retail channel was down 12%, driven by a decline in store traffic, partially offset by an improvement in-store conversion.\n\nAs we shared on our last call, better inventory balances combined with our new brand positioning and marketing support, drove sales growth in April and during the first six weeks of Q2. However, a slowdown leading into the Father's Day selling period impacted both channels. Our direct channel recovered in July with sales growth of mid-single digits driven by adjustments made in our digital advertising mix and continued focus on the new brand messaging. Additionally, direct sales and store markets outperformed non-store markets with strength coming from both established markets in the Midwest, and newer markets in the Southeast, and mountain states.\n\nAs Sam mentioned, our other strategic objective is to adjust our new customer prospecting to attract conventional spend buyers versus purely price-driven buyers. Early signs of progress here show a mid-single digit percent increase in the second quarter in conventional spend buyers. As we continue to strategically utilize deeper customer analytics to inform our media and messaging strategies, we expect our active buyer file will continue to shift slightly younger and will be reflective of customers whose long-term value is tied to our brand propositions. Our second quarter gross profit margin was 53.4% compared to 54.6% last year.\n\nThis represents a 7.1% decline in gross profit dollars from $81.4 million last year to $75.6 million this year. Of the 120 basis point decline, 110 basis points were related to inventory adjustments, most of which were the result of a one-time inventory write-down on goods that were damaged during transit to our fulfillment center. These goods were core men's underwear that is on a regular replenishment cycle and therefore it will not have an impact on sales. The remaining 10 basis point decline in gross profit margin was due to the impact of the selling mix between full-price, promotional, and clearance sales.\n\nAs we previously noted, our position in clearance goods is less than the prior year. And at the end of Q2 was 8% of total inventory compared to 10% last year. Importantly, as supply chain congestion has eased over the last six months, we are in a much better position on core year-round items and are seeing good inflows on our fall-winter seasonal items, giving us the confidence that we'll recapture a portion of the early seasonal demand that was missed last year due to shipping delays. Turning to expenses.\n\nSG&A for the second quarter increased 5% to $71.7 million, compared to $68.3 million last year. As a percentage of net sales, SG$A expense increased to 50.7%, compared to 45.8% last year. This included an increase of $700,000 in general and administrative expenses, $2.3 million in advertising and marketing expenses, and an increase of $400,000 in selling expenses. Selling expenses as a percentage of net sales increased 100 basis points to 15%, compared to 14% last year, driven by the higher hourly wage rates implemented across our store fleet and fulfillment center network in the back half of 2021.\n\nAdditionally, fuel surcharges on our outbound customer shipments contributed to the selling expense deleverage. We expect to realize a slight deleverage in selling expenses in the third quarter before analyzing the wage rate increases and realizing efficiency gains to offset the higher costs. In terms of the fuel surcharges, we are anticipating the elevated levels will continue throughout the year. Advertising and marketing costs as a percentage of net sales increased 210 basis points to 10.3%, compared to 8.2% last year.\n\nBecause of our increase in paid digital media advertising, as we continue to shift from traditional catalog marketing to brand and product messaging aimed at target customer audiences on social and search platforms. Overall, we expect our advertising and marketing costs will be slightly below last year for the back half of the year and we will realize leverage of 80 to 100 basis points to last year with all of that improvement coming in the fourth quarter. General and administrative expenses as a percentage of net sales increased 180 basis points to 25.4%, compared to 23.6% last year. The $700,000 increase from last year represents personnel and technology costs, as well as fixed costs for a Cherry Hills New Jersey store and Salt Lake City fulfillment center that opened in the back half of last year.\n\nWe expect a similar deleverage in our third quarter for the same reasons. For the fourth quarter, we expect to realize expense leverage in G&A in connection with anticipated sales growth. As of today, our store count stands at 65 with no planned store openings for the balance of the year. As we discussed previously, we are evaluating locations for potential store sites in 2023 and we'll share more details once we have more information on the timing.\n\nAdjusted EBITDA for the second quarter was 13.2 million, a 38% decrease from last year and 500 basis points of adjusted EBITDA margin contraction. Our net income was $2.4 million or $0.07 per diluted share, compared to $0.27 per diluted share reported in the second quarter last year. Moving on to the balance sheet, we ended the quarter with net working capital of $102.4 million, including $15 million in cash, and zero outstanding on our line of credit. Compared to the same period last year, we had $19 million in cash and zero outstanding on a line.\n\nDuring the second quarter, we took the opportunity at minimal cost and no increase in our borrowing rates to increase and extend our line of credit. With the amendment completed with our existing bank group, the facility now stands at 200 million in revolver capacity and expires in July of 2027. As of today, we have $5 million outstanding on the line of credit and expect to minimally increase our borrowings during the third and fourth quarters to fund our inventory ramp-up. As is typical for our seasonal liquidity needs.\n\nWe expect the borrowings to be paid down with an excess cash balance by year-end on the balance sheet. Our inventory level is 22% higher than last year at quarter end and is in a healthier position than last year at this time with a lower level of clearance and a higher mix of year-round goods. Our year-round mix drove roughly 90% of the increase. The increase in total inventory units is roughly 19% over last year with the delta to our total dollar increase reflecting higher average costs and a shift in the mix of balances with growth in our AKHG sub-brand.\n\nAs a reminder, delays on the inbound receipts we experienced last year resulted in an inventory decrease of 20% compared to the prior year. Our capital expenditures year-to-date of $19 million, including the cost of software implementation, are in line with our plans. Our outlook for the full year capex remains at $40 million and reflects the investments we're making in logistics automation, the expansion of our fulfillment network with the new facility in Adairsville, Georgia, and technology upgrades. We now expect free cash flow for 2022 will be flat to slightly positive.\n\nConsistent with our Big Dam Blueprint, the investments we're making across the business will facilitate an expanded and more automated distribution capacity, product, and brand development capabilities, and add to our customer insights, and data analytics to better inform our assortment and marketing mix. These investments are all focused on being more digitally led as a business and positioning our business to support continued organic growth and considering strategic acquisition opportunities down the road. To summarize our outlook for the third and fourth quarters. We expect sales and our direct channel to be up high single digits in the third and fourth quarters.\n\nFor retail sales, we expect to be down to the prior year, mid-single digits in the third and fourth quarters. We expect gross profit margin to be down roughly 120 basis points in the third quarter and down 50 basis points in the fourth quarter with the full year gross profit rate close to flat year over year. We plan to increase advertising expenses in the third quarter by roughly $2 million and decrease them in the fourth quarter by roughly $3 million compared to last year. With selling expenses, we expect the third and fourth quarters to be flat to up 30 basis points as a percentage of sales.\n\nOverhead expenses in the third quarter will increase as a percentage of sales by roughly 180 basis points and be down 150 to 200 basis points in the fourth quarter relative to last year as we gain leverage on sales growth. We are updating our full year guidance with net sales of $680 million to $705 million, adjusted EBITDA of 69 to 73 million, and EPS in the range of $0.61 to $0.71. In closing, while we recognize that consumer uncertainty has challenged our original business plans for 2022, we remain committed to driving demand and awareness and our multi-brand positioning, as well as committed to the capital investments necessary to unlock the company's full value creation potential. Our teams remain focused on what is in our control and making the adjustments needed to navigate a dynamic consumer environment.\n\nAnd with that, we'll open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] And the first question will be from Jonathan Komp from Robert Baird. Please go ahead.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nYeah. Hi. Thank you. Good morning.\n\nI want to just start on the changes to the guidance for the year. Could you maybe just break out how you've thought about roughly that $50 million reduction in the revenue guidance for the year? And as we think about the plans you just outlined for the second half and the sequential acceleration in both of your channels, can you just share more how you're thinking about modeling that in light of some of the uncertainties out there?\n\nDave Loretta -- Chief Financial Officer\n\nYeah. Hi, John, this is Dave. Certainly, the back half of the year as we look at it, always had a significant opportunity from year over year standpoint given the inventory shortages that we had last year. So despite some of the kind of macro headwinds that we know we're facing, we really feel like we're in a position with the inventory to recapture lost sales that were missed last year.\n\nAnd some of that was in a good part of Q3 where we know we didn't have an inventory, and we dialed down marketing in response to that. And then, continued with a greater delay in inventory in Q4. So those are -- that's the primary driver for we're seeing some of the inflection on sales growth rates heading into the back half of the year. I'll say quarter-to-date, we're trending similar to the overall Q2 down slightly in aggregate low single digits, but direct is outperforming retail, and retail has improved relative to where it was at the end of the second quarter.\n\nSo momentum is improving and the inventory position is really what's going to be a big driver of that sales growth in addition to putting into place the marketing tactics that we held off last year and doing.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nAnd just as a follow-up, could you maybe share what you're seeing in terms of promotions across the industry and just how you think about competitive promotional intensity impacting your business, especially as you ship your focus to more high-value customers?\n\nSam Sato -- President and Chief Executive Officer\n\nI mean -- we're happy with our gross margin performance. And despite the write-off that we talked about in the second quarter, our product margins are holding pretty, pretty strong, especially if you think about year-to-date, you take out some of the isolated items, we're up significantly year over year on gross margins on product selling, so. While we're seeing some customers shift to more promotional periods, we're holding our margin rates fairly healthy on that front. Average transaction value in the retail channel is strong and holding where we've been at conversion rates continues to be better than in prior years.\n\nAnd, we're just in a better in-stock position as well throughout this period of time now that the supply chain has been released. And I say on top of that, we're excited about the women's collections that are a lot of momentum. And with the launch of AKHG and the base layer categories. So I think, competitively we're feeling like we're in a good spot.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nGot it. Just the last one for me. Bigger picture question on the margin, Sam, the adjusted EBITDA margin for this year, I think now is guided a little bit below 2021. And so just thinking more broadly longer term, I know you have year your long-term targets for 14% to 15% adjusted EBITDA margin.\n\nAre those still viable and realistic in this environment? Or are there changes in the degree of spending, the intensity of some of the investments, or other efficiencies, do you see that still keep those relevant targets out to 2025? Thank you.\n\nDave Loretta -- Chief Financial Officer\n\nYeah. John, I mean, we're still seeing a high receptiveness for our products and selling performance. So I don't think that holds down some of our longer-term goals at this point. And we'll see how the back half of the year goes, and we'll refresh our long-term goals when we come out of this back half of this year, and share a perspective there.\n\nBut we don't see any underlying signs of not being able to achieve those operating margins in that time frame.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nOK. Fair enough. Thanks again.\n\nOperator\n\nAnd the next question will. Be from Jim Duffy from Stifel. Please go ahead.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nThank you. Good morning. Guys, because of so much of their earnings.\n\nSam Sato -- President and Chief Executive Officer\n\nGood morning Jim [Inaudible].\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nGood to speak with you. Guys, because so much of the earnings power is in the fourth quarter, there's going to be a lot of focus on the trajectory, momentum, and assumptions in the guide. I wanted to dig in some about just trends across the quarter and into the 3Q, you spoke about things slowing around Father's Day. Was that true for both retail and direct-to-consumer, or was that more of a retail comment?\n\nSam Sato -- President and Chief Executive Officer\n\nYeah. Jim, that was really more of a retail foot traffic situation where direct was coming out of the first quarter much stronger and pretty healthy now that direct, I think, also was impacted a bit by the slowdown, but relative to the trend it was on it was much better. So it's foot traffic to the stores is where we saw the slowdown materialize the most.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nPresumably may be some link with gas prices there. I'm curious, as gas prices came down into the third quarter, did you see any improvement in traffic trends in the retail locations?\n\nSam Sato -- President and Chief Executive Officer\n\nYeah. We have seen since August and through this past month, the trend improves from what it was on, whether that was gas prices or not, but when we do look at our customers those that live further away from the stores is where the impact was most and those that are closer to the stores had had a better performance. So I think that's probably a connection to possibly driving in gas prices.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nOK. And then the guide for the second half seemed to improve -- excuse me, imply improving retail productivity in 3Q, and 4Q. And it sounds like much of that is your belief that you're better in stock and in the better inventory position, and that should help conversion, what's assumed for traffic in this?\n\nSam Sato -- President and Chief Executive Officer\n\nWell, the assumption is that we'd still be down slightly to two last years. But we're talking mid-single digits versus the mid-teens that it was in the second quarter. And so continuing at the pace that we're now on right now where retail foot traffic is down again mid to high single digits instead of double digits. And that's what we're going to assume is going to continue through the back half of the year.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nAnd then from a tactical standpoint guide should store traffic remain challenged, or be more difficult than you'd anticipated, what's the philosophy around promotion? Do you see promotion as a tool to drive traffic? Or given your focus on acquiring consumers at full price is that something you hope to avoid?\n\nSam Sato -- President and Chief Executive Officer\n\nYeah. I mean, Jim, at a high level, we want clearance and promotions really to be just a necessary evil, so to speak, and continue to drive greater regular price business. And importantly drive engagement through our highest value most loyal consumers. And so while we're watching carefully the competitive landscape, we're watching some of the macroeconomic headwinds like gas prices, we're also going to make sure that we're prudently managing our costs, but also, ensuring that we're making the right pricing decisions to help our consumers.\n\nBut also not compromise our longer-term brand position. And so as I said in my prepared remarks, consumer purchasing behavior has shifted a bit more heavily toward our promotional time frames. But when you do the math and you look at the reduction of clearance sales at those really low margins, our gross product margins are remaining pretty healthy and near flat for the quarter. And we expect that it'll be similar as we get through the back half of the year.\n\nSo, we're going to be really thoughtful and purposeful about our pricing and promotional strategy more focused around the long term than any kind of near-term benefits that we may get from just taking severe price actions.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nUnderstood. I'll leave it at that. Thank you, guys.\n\nSam Sato -- President and Chief Executive Officer\n\nThanks, Jim.\n\nOperator\n\nThank you. And the next question is Dylan Carden with William Blair. Please go ahead.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nThanks a lot. Just kind of continuing on that same vein of sort of the outlook here. And I agree with Jim, that's kind of the crux of this, the deleverage or the reduction of $3 million in marketing spend in the fourth quarter. I'm just trying to kind of track that with having the inventory back in stock and having pulled back in marketing last year.\n\nI guess, what am I missing? They would stand to reason then that you would increase the dollar amount. I guess what's the nuance in that outlook?\n\nDave Loretta -- Chief Financial Officer\n\nYeah, some of that is really just the shift from the amount of dollars we had allocated last year in response to the inventory delays. So we are increasing our marketing in Q3 knowing that we're in a better position heading into the back half of the year. And so the reduction in Q4 is really just a shift. The minor decline is coming out of some of the TV national brand awareness areas of digital advertising that are not as efficient in the short term.\n\nWhat is efficient in the short term is digital spending. And that's where we are increasing quite a bit in both quarters. So digital, social, and paid search is where we're seeing the most near-term traction and driving traffic in sales. And so that's -- so it's more of a mixed opportunity in our overall spend to get to those sales.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nGot you. And then, just kind of the best way to ask this question. But is having the inventory enough here? I mean, it seems like we're kind of almost in a similar position that we were in coming into the second quarter where there was sort of anticipation, acceleration sales predicated on having certain inventory backed up by marketing, and like get all the enhancements to marketing, I agree with them. But is the guidance now reflective of simply just having core basic items that you didn't have last year, and kind of that customer is going to show up? Or is there a certain amount of kind of recovery still necessary in the broader economy to kind of hit the new targets? Does that make sense?\n\nSam Sato -- President and Chief Executive Officer\n\nYeah, Dylan, this is Sam. I would say a couple of things. One is when you look at our year-over-year comps, last year as we analyzed our business, we were pretty short on a big chunk of our core products and that represents over half of our business. And so the fact that we are going to be, or are and will continue to be in a much better in-stock position relative to our needs.\n\nAnd certainly, when you look at it year over year that absolutely gives us, greater confidence in the back half of the year. We really try not to build much into, the improvements in the macro conditions, it's so uncertain and so choppy that it just, it wouldn't be prudent of us to do that. And so we really believe that that combination of being in really good stock in our year-round goods coupled with the early reads we're getting on new products for fall in some big categories for us like flannels as an example. And then, the continued escalation of our women's business continues to give us confidence that in the back half we've got some opportunity for some expansion there relative to not only our current trends but is equally important relative to the year-over-year comparisons.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nOK. And then, finally here, just in closing, any sort of update on how wholesale is performing in this environment?\n\nSam Sato -- President and Chief Executive Officer\n\nYeah. Well, if specifically Tractor Supply, our results there, we continue to see positive momentum. In fact, we're in the process now of expanding our test to an additional 70 stores ahead of the peak holiday season, so we'll now be in 180 stores, and then online we recently partnered with them on an offer through their Loyalty Club membership and that resulted in thousands of new buck-naked customers from Tractor Supply. So we continue to work closely with them.\n\nThey've been great partners and continue to look forward to expanding that business.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nAnd is that -- does that customer -- how does that customer match up with that kind of core customer? You're kind of speaking to speaking with talking to speaking with directly do some of these new engagement tactics, is that a more, I guess, agricultural working-class customers that line up pretty closely with whom you are trying to get on the other side of the retail business?\n\nSam Sato -- President and Chief Executive Officer\n\nYeah, I think I think at high-level lines up really well with us. It's a segment of that consumer, so to your point around this agricultural farming industry that's only a subset of the more high-level consumer we're focused on. But certainly, within demographics, socio graphic, economic standings, and whatnot, it fits really nicely within where Duluth continues to target our engagement and customer journey strategy.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nVery good. Awesome. Thanks, guys.\n\nSam Sato -- President and Chief Executive Officer\n\nThank you.\n\nDave Loretta -- Chief Financial Officer\n\nThanks, Dylan.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNitza McKee -- Investor Relations\n\nSam Sato -- President and Chief Executive Officer\n\nDave Loretta -- Chief Financial Officer\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nDylan Carden -- William Blair and Company -- Analyst\n\nMore DLTH analysis\n\nAll earnings call transcripts"
}