{
  "companyName": "Phillips 66",
  "companyTicker": "PSX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/phillips-66-psx-q3-2022-earnings-call-transcript/",
  "content": "Phillips 66 (PSX -0.03%)\nQ3 2022 Earnings Call\nNov 01, 2022, 12:00 p.m. ET\n\nOperator\n\nWelcome to the third quarter 2022 Phillips 66 earnings conference call. My name is Sylvie and I will be your operator for today's call. [Operator instructions] Please note that this conference is being recorded. I will now turn the call over to Jeff Dietert, vice president, investor relations.\n\nJeff, you may begin.\n\nJeff Dietert -- Vice President, Investor Relations\n\nGood morning and welcome to Phillips 66 third quarter earnings conference call. Participants on today's call include Mark Lashier, president and CEO; Kevin Mitchell, EVP and CFO; Brian Mandell, EVP, Marketing and Commercial; Tim Roberts, EVP, Midstream and Chemicals; and Rich Harbison, SVP, Refining. Today's presentation material can be found on the investor relations section of the Phillips 66 website, along with supplemental financial and operating information. We provided supplemental information this morning for Chemicals, Refining and Marketing and Midstream.\n\nThe remaining supplemental information will be available with the 10-Q filing. We'll return to the normal supplemental release next quarter. Slide 2 contains our safe harbor statement. We will be making forward-looking statements during today's call.\n\nActual results may differ materially from today's comments. Factors that could cause actual results to differ are included here as well as in our SEC filings. Before we begin our discussion, I would like to highlight that we will be hosting an investor day in New York on November 9. With that, I'll turn the call over to Mark.\n\nMark Lashier -- President and Chief Executive Officer\n\nThanks, Jeff. Our third quarter results reflect the continued favorable market environment and our strong operating performance. We ran at high rates during the summer driving season to meet peak demand for critical transportation fuel. Our Refining business delivered improved market capture this quarter, supported by strong distillate cracks and wider discounts for heavy sour crudes.\n\nIn the third quarter, we had adjusted earnings of $3.1 billion or $6.46 per share. We generated $3.1 billion in operating cash flow. We're committed to strong shareholder distributions. During the quarter, we ramped up share repurchases in a meaningful way, purchasing almost $700 million of common stock.\n\nIncluding dividends, we returned $1.2 billion to shareholders. During the quarter, we continued to focus on operating excellence and advancing our strategic priorities. Our enterprisewide business transformation is underway. The team is implementing key initiatives to deliver results.\n\nWe look forward to providing more details at our investor day next week. In Midstream, we realigned our economic and governance interest in DCP Midstream, LP and Gray Oak Pipeline, LLC. Our economic interest in DCP Midstream increased to 43%, and our economic interest in Gray Oak Pipeline decreased to 6.5%. At the same time, we made an offer to acquire all publicly held common units of DCP Midstream, LP.\n\nOur increased interest in DCP Midstream allows for further integration and optimization across our NGL business. The wellhead to market value chain structure will allow us to capture new commercial opportunities and optimize costs. Additionally, we started up Frac 4 at the Sweeny Hub on time and under budget. In October, Frac 4 achieved full run rates, bringing our total Sweeny Hub fractionation capacity to 550,000 barrels per day.\n\nCPChem is pursuing a portfolio of high-return projects, enhancing its asset base as well as optimizing its existing operations. This includes growing its normal alpha olefins business with a second world-scale unit to produce one-hexene, a critical component in high-performance polyethylene. The unit is being constructed at CPChem's Old Ocean, Texas facility and will produce 586 million pounds per year. CPChem is also building a new propylene splitter at its Cedar Bayou facility, which will expand its capacity by one billion pounds per year.\n\nBoth the one-hexene and propylene splitter projects are expected to start up in the second half of 2023. CPChem continues to develop two world-scale petrochemical facilities on the U.S. Gulf Coast and in Ras Laffan, Qatar. A final investment decision for the U.S.\n\nGulf Coast project is expected before the end of this year. In Refining, we're converting our San Francisco refinery into one of the world's largest renewable fuels facilities. The Rodeo Renewed project is expected to cost approximately $850 million and begin commercial operations in the first quarter of 2024. Upon completion, Rodeo will have over 50,000 barrels per day of renewable fuels production capacity.\n\nNow I'll turn the call over to Kevin to review the financial results.\n\nKevin Mitchell -- Executive Vice President and Chief Financial Officer\n\nThank you, Mark, and hello, everyone. Before I talk about the financials, let me begin by summarizing the accounting impacts of DCP Midstream. On August 17, we completed the merger of DCP Midstream, LLC and Gray Oak Pipeline, LLC. In connection with the transaction, we were delegated governance rights over DCP Midstream, LP and its general partner entities as well as DCP Sand Hills Pipeline, LLC and DCP Southern Hills Pipeline, LLC.\n\nEffective August 18, our financial results reflect the consolidation of these entities. So starting with an overview on Slide 4, we summarize these financial results. We reported third quarter earnings of $5.4 billion. We had special items amounting to an after-tax gain of $2.3 billion, including the net gain related to the consolidation of DCP Midstream, Sand Hills Pipeline and Southern Hills Pipeline and the transfer of interest in Gray Oak Pipeline.\n\nExcluding special items, adjusted earnings were $3.1 billion or $6.46 per share. The $33 million decrease in the fair value of our investment in NOVONIX reduced earnings per share by $0.05. We generated $3.1 billion of operating cash flow. Capital spending for the quarter was $735 million, including the company's $306 million investment in DCP Midstream, LLC associated with the merger, net of cash acquired.\n\nWe returned $1.2 billion to shareholders through $466 million of dividends and $694 million of share repurchases. We ended the quarter with 473 million shares outstanding. Moving to Slide 5. This slide highlights the change in adjusted results by segment from the second quarter to the third quarter, including the impact of consolidating DCP Midstream, Sand Hills Pipeline and Southern Hills Pipeline effective August 18.\n\nThe Midstream segment, Corporate and Other, income taxes and noncontrolling interests are impacted by the consolidations. The higher noncontrolling interest reflects the portion of these entities not owned by Phillips 66. During the period, adjusted earnings decreased $163 million, mostly due to lower results in Refining and Chemicals, partially offset by higher Midstream and Marketing and Specialties results. Slide 6 shows our Midstream results.\n\nThird quarter adjusted pre-tax income was $645 million compared with $292 million in the previous quarter. The consolidation of DCP Midstream results are now reported within NGL and Other. Transportation contributed adjusted pre-tax income of $229 million, down $21 million from the prior quarter. The decrease was mainly due to lower equity earnings from the Gray Oak Pipeline resulting from the merger.\n\nNGL and Other adjusted pre-tax income was $449 million compared with $282 million in the second quarter. The increase was primarily due to the consolidation of DCP Midstream, Sand Hills Pipeline and Southern Hills Pipeline effective August 18. The fractionators at the Sweeny Hub averaged 429,000 barrels per day, and the Freeport LPG Export facility loaded 249,000 barrels per day in the third quarter. Our NOVONIX investment is marked-to-market at the end of each reporting period.\n\nThe fair value of the investment, including foreign exchange impacts, decreased $33 million in the third quarter compared with a decrease of $240 million in the second quarter. Turning to Chemicals on Slide 7. Chemicals had third quarter adjusted pre-tax income of $135 million compared with $273 million in the previous quarter. Olefins and Polyolefins adjusted pre-tax income was $105 million.\n\nThe $111 million decrease from the previous quarter was primarily due to lower margins resulting from a sharp decline in polyethylene prices. This was partially offset by lower turnaround costs. Global O&P utilization was 90% for the quarter. Adjusted pre-tax income for SA&S was $60 million, in line with the second quarter.\n\nThe higher costs in Other mainly reflect legal contingencies. During the third quarter, we received $41 million in cash distributions from CPChem. Turning to Refining on Slide 8. Refining third quarter adjusted pre-tax income was $2.8 billion, down from $3.1 billion in the second quarter.\n\nThe decrease was primarily due to lower realized margins, partially offset by higher volumes. Our realized margins decreased by 6% to $26.58 per barrel, while the composite global 3:2:1 market crack decreased by 22%. Pretax turnaround costs were $225 million, in line with the previous quarter. Crude utilization was 91% in the third quarter and clean product yield was 85%.\n\nSlide 9 covers market capture. Our composite global 3:2:1 market crack for the third quarter was $36.29 per barrel compared to $46.72 per barrel in the second quarter. Realized margin was $26.58 per barrel and resulted in an overall market capture of 73%. Market capture in the previous quarter was 61%.\n\nMarket capture is impacted by the configuration of our refineries. We have a higher distillate yield and lower gasoline yield than the 3:2:1 market indicator. During the third quarter, the distillate crack decreased $8.14 per barrel, and the gasoline crack decreased $11.84 per barrel. Losses from secondary products of $3.50 per barrel or $0.47 per barrel higher than the previous quarter.\n\nOur feedstock loss of $1.48 per barrel was in line with the previous quarter. Feedstock advantage from widening heavy sour crude differentials was offset by the impact of higher feedstock costs relative to dated Brent in the Atlantic Basin. The Other category reduced realized margins by $1.29 per barrel. This category includes RINs, freight costs, clean product realizations and inventory impacts.\n\nMoving to Marketing and Specialties on Slide 10. Adjusted third quarter pre-tax income was $847 million compared with $765 million in the prior quarter. Marketing and Other adjusted pre-tax income was $717 million, up $61 million from the second quarter. The improvement reflects higher international margins, partially offset by lower domestic results, including inventory impacts.\n\nSpecialties generated third quarter adjusted pre-tax income of $130 million. The $21 million increase was largely due to improved base oil margins. On Slide 12, the Corporate and Other segment had adjusted pre-tax costs of $246 million, $11 million higher than the prior quarter. The increase was mainly due to consolidating DCP Midstream interest expense of $34 million, partially offset by higher interest income.\n\nSlide 12 shows the change in cash during the third quarter. We started the quarter with a $2.8 billion cash balance. Cash from operations was $3.1 billion. During the quarter, we funded $735 million of capital spending, including the company's $306 million investment in DCP Midstream, LLC associated with the merger, net of cash acquired.\n\nWe returned $1.2 billion to shareholders through dividends and share repurchases. Our ending cash balance was $3.7 billion. We ended the quarter with a net debt-to-capital ratio of 29%, including the consolidation of DCP Midstream. This concludes my review of the financial and operating results.\n\nNext, I'll cover a few outlook items. In Chemicals, we expect the fourth quarter global O&P utilization rate to be in the mid-90s. In Refining, we expect the fourth quarter worldwide crude utilization rate to be in the low to mid-90s and pre-tax turnaround expenses to be between $180 million and $220 million. As a result of strong turnaround execution and timing, we expect full year turnaround expenses to be lower than our original $800 million to $900 million of guidance.\n\nWe anticipate fourth quarter Corporate and Other costs to come in between $300 million and $325 million pre-tax, reflecting a full quarter of DCP Midstream interest expense. Now we will open the line for questions.\n\nOperator\n\nThank you, sir. We will now begin the question-and-answer session. [Operator instructions] And your first question will be from Doug Leggate at Bank of America. Please go ahead.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Good morning, everyone. Thanks for taking my questions. Kevin, I wonder if I could just ask you about your thoughts on the balance sheet going forward.\n\nI mean, clearly, you're back to, I guess on a capitalization basis, you're back to pre-COVID levels pretty much. But the absolute debt, now you have DCP is still about 30% up on where it was before the downturn. So how are you thinking about where you want the balance sheet to be going forward and how that might play into your cash return strategy?\n\nKevin Mitchell -- Executive Vice President and Chief Financial Officer\n\nYes, Doug. Thanks. It's a good question. So we feel pretty good that even with consolidation of DCP, the debt-to-capital ratio, net of cash, is sub-30%.\n\nSo we feel good about the metric from that standpoint. And also, if you just look at debt-to-EBITDA metrics, they're still very strong. But the reality is it's $17.8 billion, circa $18 billion of debt on a fully consolidated basis. And so I think given the overall financial position we're in, the cash generation that we have, you'll see us continue to do some debt reduction.\n\nBear in mind, we haven't yet funded the buy-in of the public, so that puts more pressure on the balance sheet regardless of how we actually execute on that funding between debt and cash. And so we'll continue to want to make some debt reductions. But the difference now between where we were over the last couple of years, where we're trying to get rid of the pandemic debt that we had added is, we don't need to make debt reduction the No. 1 priority for discretionary cash.\n\nCash generation, cash balances are sufficient that we'll be able to do some -- gradually chip away at the debt balance and, at the same time, continue to return a healthy amount of cash to shareholders.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nI'm trying hard, Kevin, not to ask anything that I know you won't answer, given that you've got the analyst day. So I'm avoiding some of the obvious things, but I do want to try one that really came up in the last -- the call that preceded this one with Marathon. And it's the issue about the industry or senior management's view of mid-cycle. And Marathon, we're quite clear to say, look, they think mid-cycle has moved up.\n\nYou guys used to talk about, I guess, $6 billion to $7 billion of mid-cycle cash flow. Again, not pre-empting next week, but can you maybe offer, whether Mark or anyone else, how you feel about the go-forward outlook for mid-cycle earnings for this business, for the Refining business?\n\nMark Lashier -- President and Chief Executive Officer\n\nYes, Doug, we are going to cover that a bit next week. I think that there's two things to take into consideration there. Has the market mid-cycle moved, it has our ability to generate EBITDA move. And certainly, the piece that we control, we know we'll be moving, and we'll provide details next week.\n\nAnd as far as the market, we're still watching that to see how that evolves. But we'll be more focused on what we're doing to drive our mid-cycle going forward.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nI understand. We'll wait until next week. Thank you, guys.\n\nOperator\n\nNext question will be from Neil Mehta at Goldman Sachs. Please go ahead. Your line is open.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYeah. Good morning, team. I wanted to start off on the waterfall on Slide 20 of the deck in the Central Corridor. Really exceptional capture rates in that region.\n\nAnd I was wondering if there's anything unusual in there if there's something structural that we should capitalize, as I know that other bucket can move around a bunch. And how much did WCS help this quarter? Or given the fact that it typically comes in at a lag, is that more of a 4Q tailwind?\n\nMark Lashier -- President and Chief Executive Officer\n\nYes, Neil. We're very pleased with the Central Corridor performance. There are a number of factors that differentiated the second quarter to the third quarter and a number of things that happened in the third quarter. I'll let Rich dive into the details around that.\n\nRich Harbison -- Senior Vice President, Refining\n\nOK, Mark. Neil, good question. And yes, the Mid-Con Central Corridor had a very good quarter. Let me start by resetting the basis for the second quarter.\n\nSecond quarter for us was a heavy turnaround in this region. So a lot of the difference you're seeing is the lack of turnarounds in the third quarter. Our mechanical availability during the third quarter was very good. We had high utilizations sitting at around 93% and strong clean product yields sitting at 88% for the Corridor.\n\nSo good performance on both of those. Of course, those directly relate to increased volumes. And with the lack of turnarounds, we had a lot lower operating expense for the quarter as well. As you indicated as well, Neil, the market conditions were quite favorable for our kit.\n\nWe saw widening Canadian spreads, which are quite favorable for us as well as a very strong distillate crack in the region. And that also plays well for our kit, which is a strong distillate producer. So I think what you're seeing here is a strong operating performance in favorable market conditions playing out for us in the third quarter.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYes. And maybe we could stay on that point around Western Canadian crude. It has been pretty wide here, and it's widened out in the curve for '23 as well. So would love your guys' perspective on what you think is going on there.\n\nAnd given it does tend to come in at a lag, should we see a disproportionate impact of that tailwind in Q4?\n\nBrian Mandell -- Executive Vice President, Marketing and Commercial\n\nNeil, this is Brian. I'll start by saying that WCS started weakening with PADD 2 unplanned maintenance. WCS was forced into the Gulf Coast and then forced to compete with SPR barrels. We've released about 180 million barrels of SPR crude.\n\nMost of that has been sour so we competed with WCS. High sulfur fuel oil has also been weak, and it competes as well, given weaker bunker demand and the end of summer utility burn. And also, generally, the WCS is purchased by Asia and India, and they were out buying euros, Russian crude so they weren't buying as much. And finally, WCS has a high naphtha cut, and that naphtha has been very, very weak because of the Chemicals business.\n\nSo that was also caused some pressure. So currently, WCS is at about $30 differential. Q4, if you look at the forward curve is at $26 off and next year is about $23 off. So we assume that it will continue to be weak, and the market players also feel the same way.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nOK. Thanks, guys.\n\nOperator\n\nThank you. Next question is from Roger Read at Wells Fargo. Please go ahead. Your line is open.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nYeah. Thank you. Good morning. I guess I'd like to maybe take a shot here at the Chemicals side of things.\n\nSo obviously, kind of the softer results and coming off what was an impressive sort of '21, early '22 run. You mentioned FID for the Gulf Coast and then also the Ras Laffan opportunity. Does the weakness in Chemicals here at all imperil your timing on decision of FID? Or does it have any impact whatsoever?\n\nMark Lashier -- President and Chief Executive Officer\n\nThanks, Roger. That's a great question. I think that CPChem has a long history of focusing on the long-term fundamentals. And they never tried to time any particular cyclic movements to drive their growth plans.\n\nThey've always focused on capturing advantaged feedstocks and maintain their global market presence. And that's what they're doing here as well. Frankly, if you look back in history, the projects that have just happened to be countercyclical, where the investments made when there was a downturn, they tend to come online when things are turning back up and that's beneficial to the economics, then it looks like that may be the case here. You can never predict when things will turn around, but it will take about four years to execute each of those projects.\n\nAnd so yes, it will be what does the crystal ball say in that time frame. But we focus on those long-term fundamentals and what we see as kind of a mid-cycle margin for those opportunities.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nThat makes sense. And then my other question on the Marketing business. You had an exceptional Q2 and now in an even more exceptional Q3, any kind of background on what's going on there? And are the fundamentals that created the last two quarters showing any signs of reversing here?\n\nBrian Mandell -- Executive Vice President, Marketing and Commercial\n\nSure, Roger. Brian again. Maybe I'll start by saying that our diverse geographic portfolio with business both here in the U.S. and in Western Europe and our diverse channels of trade, we have unbranded, branded and retail help us when we think about our Marketing business.\n\nBut Q3, a number of things that we saw that helped the business. In Germany, it was a tax holiday starting in January 1 and ending at the end of August. Also overseas, the refinery down actually helped us and generally helps us. We have alternative supply at MiRO Refinery there in the south of Germany, which helps us particularly in the south of Germany.\n\nAnd our exchange agreement terms also give us a competitive advantage. We had the general falling of spot prices, which helped us. Shortage of Russian distillate in the market as well helped us internationally. And then I would say, conversely, in the U.S., we actually saw margins come off in Q3 from Q2.\n\nBut overall, we had a very good quarter.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. Next question will be from Ryan Todd at Piper Sandler. Please go ahead. Your line is open.\n\nRyan Todd -- Piper Sandler -- Analyst\n\nThanks. Maybe if I could ask one on kind of Atlantic Basin dynamics. European refining, you're exposed to European refining, spent a lot of volatility in recent months there with natural gas prices. The systems have had to adjust and have adjusted a decent amount.\n\nLooking forward, you've got a crude import ban that's about to go into effect and then potentially a product import ban early next year. Any thoughts as you look forward to how these dynamics play out both for your asset and the region overall and how this may impact Atlantic Basin balances over the next six months?\n\nMark Lashier -- President and Chief Executive Officer\n\nYes. This is Mark. I'll comment at a high level then I'll let Rich and Brian follow up. But I think generally, those are constructive for us.\n\nI think it could strengthen our position, particularly around distillates and it's going from strength to strength. But I will let Brian and Rich comment on the details.\n\nBrian Mandell -- Executive Vice President, Marketing and Commercial\n\nMaybe I'll start with the macro and Rich can talk more about our assets. But clearly, the market around the world is tight, particularly on distillates. In the U.S., we're under 2015 to 2019 ranges by 22% inventories. That was a very, very weak inventories, given that we're starting to go into the winter season.\n\nRefineries around the world are making diesel over gasoline currently. So there are a lot of things that may take some of the edge off and alleviate some of the stress on the market. First around the world, we're coming back from turnarounds here in the U.S. and elsewhere.\n\nThe Chinese have increased their quotas, so you'll see more gasoline and diesel on the market in Asia. The French refinery strikes are coming to an end, so those refineries will be back up. And then we're seeing kind of moderate weather forecast for both the U.S. and for Europe.\n\nSo why we'd expect the margins to remain strong, and I think the ultimate moderator for those margins will be demand.\n\nRich Harbison -- Senior Vice President, Refining\n\nThis is Rich. I really don't have much to add to that other than from a Refining perspective, of course, the natural gas price will drive up our operating expenses. And we will see higher feedstock costs as this market evolves here into the future and these sanctions go into play. So how that all sells out will be interesting.\n\nRyan Todd -- Piper Sandler -- Analyst\n\nGreat. And then this may step into what you plan on talking about next week, but regarding the buy-in of the remainder of DCP, I don't know if you have any comment on potential timing for closure deal there. But beyond that, maybe a reminder of how you're thinking about the incremental benefits of the kind of the consolidated position there, either from a financial free cash flow point of view or operational synergies that come along with closure of that deal? And how that may impact your ability to buy back stock in the near term and the longer term?\n\nMark Lashier -- President and Chief Executive Officer\n\nAt a high level, Ryan, the process is underway. We are negotiating with independent directors that represent the unitholders. And I will just say that we need to let that process play out. It's better to get the right number than to get a quick number.\n\nAnd as far as the strategic dynamics, Tim can talk more about that, but it really is about driving this wellhead to market strategy that we really believe will create a lot of long-term value and opportunity for Phillips 66. Tim, do you want to comment on that?\n\nTim Roberts -- Executive Vice President, Midstream\n\nYes, I think that's right. Mark, thanks. Exactly right. I think there's a couple of things and I want to make a point is that we do believe in integration, no different than what we see in our integration on our Refining, Marketing, Commercial business, and Midstream.\n\nWe see the same thing in the NGL, natural gas space. So this allows us to set up that framework to do that, especially in key basins, namely the Permian and DJ. So we really like that, but I think it's probably also worth commenting on that, yes, we want to get the buy-in done and get that behind us and really capture that full value. Really the important part for us, and we've already started the integration, so we are starting the integration, and we are pushing down the road as well to identify what the opportunities are going to be that really are going to position this both from a cost standpoint as well as the ability to compete and create more value.\n\nAs soon as we get the buy-in done, we can talk a lot more about what that potential is going to be.\n\nRyan Todd -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Next question will be from John Royall at J. P. Morgan.\n\nPlease go ahead. Your line is open.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nHey, guys. Good morning. Thanks for taking my question. So on the buyback, I think we'll probably have to wait until post DCP to have a real kind of go-forward framework.\n\nBut for now, you did have a pretty big number in 3Q that I think surprised some people. And so can you talk about the short-term kind of push-pull between the buyback and then maybe conserving cash for the upcoming deal with DCP and how you think about that?\n\nMark Lashier -- President and Chief Executive Officer\n\nAt a high level, John, we are committed to buybacks. We had to hold back in the second quarter due to a blackout period. And so that kind of held us back for a bit. But what you saw last quarter is just a signal that we are serious about buybacks.\n\nAnd I'll let Kevin talk about the balance between what it will require to execute the roll-up of DCP versus share repurchases. But we have got a solid plan. And like a broken record, I'll say you'll hear more about it at investor day.\n\nKevin Mitchell -- Executive Vice President and Chief Financial Officer\n\nYes, John. So in terms of the DCP roll-up, our expectation is that will be a combination of debt issuance and cash on hand we'll use to fund that. And to my earlier comments, I feel pretty confident that with where the balance sheet sits with the cash position we have, with the cash generation we have, we'll be able to manage that in terms of, yes, we will want to subsequently reduce debt. But with the overall cash position, we should be in a position to continue to return significant amounts of cash to shareholders.\n\nSo I'm not too concerned that the DCP transaction is going to negatively impact our ability to buy back shares.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you. And then apologies to repeat a prior question, but I was just thinking through your commentary on the strength in Central Corridor. And correct me if I'm wrong, but I'm not sure if the things you guys talked about necessarily address the Other bar, flipping from negative eight to positive 450 going from 2Q to 3Q.\n\nSo apologies if I missed this, but if you could go through the dynamics in that Other bar specifically, that would be really helpful.\n\nTim Roberts -- Executive Vice President, Midstream\n\nOK. Let's see. In the Other bar in the Atlantic or in the Central Coast area, we're really looking at some RIN costs in there and some inventory timing issues are the two primary drivers of that, that bar there, John.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Next question will be from Matthew Blair at TPH. Please go ahead. Your line is open.\n\nMatt Blair -- Tudor, Pickering, Holt and Company -- Analyst\n\nHey. Good morning. Thanks for taking my question. Your Chems results came down, but they really outperformed peers in the third quarter.\n\nIs this just as simple as you don't have Europe exposure and pretty much all your peers do? Was there anything else that we should look at? And I guess what's your outlook for Q4?\n\nMark Lashier -- President and Chief Executive Officer\n\nYes. Thanks, Matt. That's a great question. We've talked to the folks at CPChem about that.\n\nI think part of it is that lack of European capacity though. Though we do, the Middle East assets do supply a lot of volume into Europe, but they continue to perform well. The interesting thing is others have had to cut back production in North America, CPChem continued strong production. They had some unplanned outage, but no intentional cutbacks.\n\nAnd I think that reflects their cost position. They didn't have to cut back to contain inventory. They didn't have to cut back due to economics. They ran strong and were profitable.\n\nAnd part of that is they're heavy into high-density polyethylene and the dynamics there are a little different than linear low-density polyethylene. And those that were cutting back were more exposed to that segment of the market. So I think while no one's having any fun in that environment right now, they are positioned to be a little more productive during this difficult time. And then as far as the fourth quarter, fourth quarter is typically soft, and we continue to see this new capacity that's coming online being digested.\n\nMargins have gone down. Marker margins have gone down to just about the breakpoint. So I think as you see people that have cut back, as you see them signaling to the market that they need prices to go up and polyethylene to continue to provide what is needed in the marketplace, it's sounding feeling like it's kind of hit bottom. We'll probably see it hit bottom in the fourth quarter and then slowly recover.\n\nIt will take a couple more quarters to see a lot of movement upward, but I think you're seeing those signs of bottoming out.\n\nMatt Blair -- Tudor, Pickering, Holt and Company -- Analyst\n\nSounds good. And then could you talk about octane spreads? They have been really quite strong recently. Is this just a function of Tier 3 impacts rolling through the market? And could you also remind me on what Phillips' exposure to premium gasoline is?\n\nBrian Mandell -- Executive Vice President, Marketing and Commercial\n\nYes. Generally, when you have weak naphtha, Matt, you have high or large octane spreads, and naphtha's been very, very weak. So gasoline blenders need the octane to blend into the gasoline to make finished grade. And I would say that like most marketers, we're about 11% or 12% on our premium in our Marketing business.\n\nMatt Blair -- Tudor, Pickering, Holt and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Next question will be from Paul Cheng at Scotiabank. Please go ahead. Your line is open.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nHi. Good morning. Two questions, please. First, with the latest news from Biden talking about the oil industry with the windfall profit tax, just wondering that your people in D.C., when they talk to the senator, what's your guess is whether there will be sufficient vote in the Senate for them that to pass that, if the President does propose one? The second question is that I want to see what is your RD strategy, renewable diesel strategy beyond the retail conversion that you're currently doing? I mean, the first phase will come onstream soon and then full completion probably in 2024.\n\nAnd so that I want to see that beyond that, if that is going to be one-off or let's say, more maybe that strategy going forward on that?\n\nMark Lashier -- President and Chief Executive Officer\n\nYes. Thanks, Paul. This is Mark. Your first question, we've been, along with the rest of our peers in the industry, engaged with the Biden administration around the challenges that they see in the marketplace.\n\nAnd it's earnings season, a lot of integrated oils are coming out with very, very solid results. And I think that's the target of the President's latest comments. Our view is when we get off of the public rhetoric and engage with them to address the issues of inventories and supply and cost and price, it's been constructive. And they know that they have to proceed with caution because things that they try to do could disrupt the markets even more.\n\nAnd they are listening, and they are taking into account the advice that we've been giving them along with our peers. You have to remember that there's an election next week, and I think that there's going to be a lot of rhetoric right up to that point in time.\n\nOperator\n\nThank you. Next question will be...\n\nMark Lashier -- President and Chief Executive Officer\n\nI'm sorry, Paul. I was so focused on that first question, I forgot to answer your second question, Paul. Renewable diesel strategy. Yes.\n\nObviously, the first step is the successful execution and commissioning of the Rodeo Renewed project. We put our toe in the water there with a small unit at the San Francisco refinery. We call it Unit 250. That's been quite successful in the marketplace.\n\nWe are involved in aggregating feedstocks, both in preparation for Rodeo as well as our Humber facility. We're producing renewable fuels there, including sustainable aviation fuel. Rodeo will provide some sustainable aviation fuel as well. And so we kind of look at that business as renewable fuels, not just renewable diesel.\n\nAnd we're taking a hard look at options around sustainable aviation fuel. Certainly, the RA Act was supportive of SAF. And we've got some thoughts there that we're looking at. Bottom line is whatever we do, we're going to be incredibly disciplined, and we've got to ensure that we've got a competitive advantage when we go off in these directions, that we've got line of sight on feedstocks and that we've got the right capital cost when we execute these projects.\n\nSo that's the primary focus, not just getting bigger but being better in every one of those things that we do.\n\nOperator\n\nThank you, sir. Our last question is from Jason Gabelman at Cowen. Please go ahead. Your line is open.\n\nJason Gabelman -- Cowen and Company -- Analyst\n\nHey. Thanks for taking my questions. I just wanted to ask on the cash flow since you didn't provide some of the detail that you typically do on the cash flow walk. Can you just discuss some of the items that impacted your cash from operations, working capital and otherwise that could have impacted cash conversion? And then secondly, there were some -- and this maybe front-running something that you may discuss next week.\n\nBut there were some reports about reducing headcount and optimizing the workforce. Can you just discuss any plans that you have around doing that and improvement in cost as a result?\n\nMark Lashier -- President and Chief Executive Officer\n\nYes. Kevin will touch on the cash flow detail. I'll talk about those reports on headcount.\n\nKevin Mitchell -- Executive Vice President and Chief Financial Officer\n\nYes, Jason. In terms of operating cash flow, that detail will be available next week at the time -- early next week when we file the 10-Q. But what I would say, I know there's a lot of interest in working capital and we're still finalizing that level of detail. But what I would say is, based on everything we've seen to date, we don't think that working capital was a very significant component of operating cash flow.\n\nSo there'll be a working capital impact, but it will be pretty minor relative to some of the other numbers that you have seen out there. And I'll just leave it at that.\n\nMark Lashier -- President and Chief Executive Officer\n\nYes. Jason, on the headcount issue, yes, we've been focused on our business transformation for well over a year now, and this is a facet of that work, and we've been executing that portion of the work. It's material. We will provide more details next week at investor day.\n\nI think though it's a clear signal of our commitment to lower our cost, to eliminate unnecessary work, to have an optimal organization to go forward in what is an ever-changing volatile environment that we did execution reduction in force during the best two quarters in our history.\n\nJason Gabelman -- Cowen and Company -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThank you. This does conclude today's conference -- sorry, question-and-answer session. At this time, I will turn the call back over to Jeff.\n\nJeff Dietert -- Vice President, Investor Relations\n\nWe thank all of you for your interest in Phillips 66. If you have questions on today's call, please call Shannon and me. And we look forward to seeing many of you at the investor day next week. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Dietert -- Vice President, Investor Relations\n\nMark Lashier -- President and Chief Executive Officer\n\nKevin Mitchell -- Executive Vice President and Chief Financial Officer\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nRich Harbison -- Senior Vice President, Refining\n\nBrian Mandell -- Executive Vice President, Marketing and Commercial\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nRyan Todd -- Piper Sandler -- Analyst\n\nTim Roberts -- Executive Vice President, Midstream\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nMatt Blair -- Tudor, Pickering, Holt and Company -- Analyst\n\nPaul Cheng -- Scotiabank -- Analyst\n\nJason Gabelman -- Cowen and Company -- Analyst\n\nMore PSX analysis\n\nAll earnings call transcripts"
}