{
  "companyName": "Medtronic",
  "companyTicker": "MDT",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/22/medtronic-mdt-q2-2023-earnings-call-transcript/",
  "content": "Medtronic (MDT -0.12%)\nQ2 2023 Earnings Call\nNov 22, 2022, 8:00 a.m. ET\n\nGeoff Martha\n\nHello, everyone, and thank you for joining us today as we discuss our Q2 results and outlook. Our Q2 organic constant-currency revenue growth of 2.2% came in about a point below expectations due to a slower-than-expected recovery in both procedure volumes in certain markets and in our supply chain. In terms of reported revenue, the continued strength of the dollar over the course of the quarter drove over half the difference to expectations. Now, despite the top-line results, we were able to control expenses and deliver EPS at the high end of our guidance range.\n\nWe also issued guidance for the back half of our fiscal year this morning. We expect continued acceleration in organic revenue growth in the second half, although less than previously anticipated, and this partially flows through to EPS. Now, this is something that I don't take lightly. Delivering on our expectations is important to building and maintaining trust and credibility with you.\n\nKaren will walk you through the details, but some of our markets and some of our supply constraints recovered more slowly than we expected in the quarter, and that, along with incremental China volume-based procurements, led us to reduce our expectations. While the current operating environment remains challenging, we had strong growth in several businesses in geographies, where our strategy, our operating model and execution are yielding solid results. We have near-term product catalysts in our pipeline. We are decisively allocating capital internally and selectively making focused acquisitions.\n\nWe're making improvements to the operational health of the company, and we're streamlining the company's structure and taking cost out. All of this gives us confidence that we're on the path to creating durable growth and shareholder value. Now, diving deeper into our Q2 results. For reported revenue, as I said earlier, currency drove over half domestic consensus.\n\nOrganically, the miss was primarily split evenly between two challenges. One, procedure volumes in some markets have been slower to return to normal levels. And two, some of our supply challenges have persisted longer than we anticipated. With regard to procedural volumes, in addition to an incremental China VBP, we are still seeing lower volumes in elective coronary PCI, GI procedures, TAVR, spinal cord stim, and some less-emergent surgical procedures.\n\nThe slower-than-anticipated recovery in procedural volumes primarily occurred in developed markets as healthcare systems continue to work through staffing and other challenges. Now, with regard to supply, we've made meaningful recovery and many of the most acute issues are now behind us, including the acute packaging issues, which we highlighted last quarter. But some of the improvements did come later than we expected in Q2, and as a result, we missed cases in businesses like surgical innovations, and it has delayed our expected momentum. Now, focusing beyond challenges impacting our markets and product availability, we have a number of businesses where our strategy and execution are yielding results.\n\nRecall that we moved to the new operating model two years ago, we created highly focused, accountable and empowered operating units that can move with greater speed and decisiveness. And today, we're clearly seeing the benefit of this model across many of our businesses. Starting with cranial and spinal technologies. CST grew 5%, and this is despite a large negative impact from China VBP.\n\nIn fact, our U.S. core spine business grew 15%. Additionally, this quarter, we launched our spine technology ecosystem, which we call Aible at the NASS conference. From planning to our best-in-class implants to navigation and robotic assistance, to interoperative imaging and surgical tools, up to and including patient follow-up, Aible brings spinal surgery together in one seamless and connected platform.\n\nAnd another highlight was our structural heart business, where our TAVR business grew 15% globally, including 17% in the United States. The launch of our Evolut FX valve drove 18% sequential revenue growth in our U.S. TAVR business, despite being at full market launch for only the last month of the quarter. So, we expect Evolut FX to drive momentum for us over the coming quarters.\n\nOur Cardiac Rhythm Management business continues to execute and win share with 4% growth in this quarter. Within CRM, our pacing business grew 6%, well above the market, with 18% growth of our Micra family of leadless pacemakers. And we're looking forward to the commercial introduction of our AURORA EV ICD in the back half of this fiscal year. So, while we have businesses where the changes we've made over the past couple of years are clearly having a positive impact, we're also focused on ensuring these efforts translate into improved performance in all of our businesses.\n\nIt's worth highlighting a few businesses where we are making strong progress to drive future growth over the near to midterm, and some of that already have immediate momentum. Let's take cardiac ablation solutions, a business that we expect to be a strong future growth driver. Pulsed field ablation represents a large market opportunity, and we're looking forward to seeing our PULSED AF pivotal trial results in the first half of the next calendar year, putting us on the path to be one of the first companies with the PFA catheter in the U.S. market, which we think is underappreciated.\n\nThis is a meaningful growth opportunity for Medtronic in the next 18 to 24 months. And as you know, we closed our acquisition of Affera in August, and Affera's differentiated mapping and navigation system gives us the breadth and differentiation that we need to win share in cardiac ablation. And we expect to complete enrollment this quarter in the pivotal. This fully integrated system will be the first of its kind to offer a unique catheter that can perform high-density mapping and deliver both pulse field and radiofrequency ablation in a single device.\n\nNow, in diabetes, we remain focused on resolving our warning letter. We've now completed 100% of our warning later commitments and have informed the FDA that were ready for reinspection. We also remain in active review with the FDA on our submission of the MiniMed 780G system with the Guardian 4 sensor. And outside the U.S., we continue to receive positive customer feedback on the performance of the 780G, which is now available in over 60 countries.\n\nIn Q2, 780G drove mid-teens growth for our diabetes business in international markets. And across diabetes, we're investing heavily in the development of multiple next-generation insulin delivery and sensor technologies, and we remain focused on restoring strong growth to this important franchise over the coming years. Turning to our Hugo surgical robot. Now, I'm sure we're going to get into this in Q&A, but we saw a lot of positive momentum this quarter as we scale manufacturing production, expand regulatory approvals, and ramp installations.\n\nIn addition, we just received FDA IDE approval last week on our product enhancements. Now, this allows us to start our U.S. urology clinical trial by the end of the calendar year and is a catalyst for continued progress with our international sales. Now, before I talk about our capital allocation and portfolio management, let me share my thoughts on the Ardian opportunity.\n\nDespite the impact we believe COVID and medication changes had on the ambulatory endpoint in ON MED, the totality of the data is compelling. The large drop in office blood pressure in the Ardian arm was impressive, and it was consistent with what we've seen in our other trials. Importantly, the current standard of care for reducing blood pressure, it just isn't working, which was evident in the long-term SPRINT trial results published just last month in JAMA Cardiology. Patients don't seem to stay on multidrug therapy for long periods of time and eventually just stop taking their medications.\n\nAnd that's the advantage of Ardian. It's always on. We've demonstrated that our Ardian procedure -- it's safe, it's effective, and it's durable. Physicians are excited, and Ardian is preferred by patients.\n\nNow, we've submitted our PMA to the FDA, and we're looking forward to working with governments and payers in the U.S. and around the world who are searching for improvements to control high blood pressure and avoid the costly and devastating consequences of this disease. In addition to advancing our pipeline, we're focused on decisively allocating capital and streamlining the company to deliver durable growth. We're freeing up resources to invest more in R&D, feeding our fast-growing businesses in areas where we can see the strongest returns.\n\nCardiac ablation solutions and diabetes are two clear examples of this. We're also making moves with our portfolio to focus our company and our capital on opportunities that are better aligned with our long-term growth acceleration strategies. Over the past two quarters, we've announced our intent to separate three businesses that we believe will thrive outside the company. With our renal care solutions business, we're progressing on the separation, forming a new kidney health technology company together with DaVita.\n\nWe continue to expect this transaction to close in calendar 2023. And last month, we announced our intention to separate our combined patient monitoring and respiratory interventions business. We remain focused on active portfolio management, evaluating both potential additions and subtractions to further accelerate our growth and create value for our shareholders. Now, with that, I'll turn it over to Karen to discuss our second-quarter financial performance and our guidance.\n\nKaren.\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nThank you, Geoff. Our second-quarter organic revenue increased 2.2%, up significantly from Q1 but below our guidance range, given the challenges Geoff mentioned. Yet with a focus on expenses, our adjusted EPS of $1.30 landed at the upper end of our guidance range. Currency had a significantly unfavorable impact of 5.8% on our reported revenue growth.\n\nOur FX hedges mitigated that impact on the bottom line with EPS down only $0.01 or 80 basis points from currency. Looking at our results from a geographic perspective, our U.S. revenue grew 1%. Our non-U.S.\n\ndeveloped increased 3%, and emerging markets grew 4%. Our emerging-markets growth continued to be affected by China, which declined 9%, given the impact of a national tender in our spine business and several provincial tenders in certain other businesses. However, we continue to see strong double-digit growth in our other markets, including mid-20s growth in Eastern Europe and mid-teens growth in Latin America. In fact, excluding China, our emerging markets grew 15%.\n\nTurning to our margins. Our adjusted gross margin of 67.6% declined 120 basis points from inflationary pressures in materials, direct labor, freight, and utilities. We expect these inflationary pressures to continue and to impact the back half of this fiscal year more than what we experienced in the first half. Our adjusted operating margin of 26.6% declined 40 basis points, including a 120-basis-point benefit from our currency hedging program.\n\nCompared to the first quarter, our operating margin improved 270 basis points, given accelerated revenue growth. We expect sequential improvement throughout the fiscal year. We continue to maintain a strong balance sheet. I would note that the vast majority of our debt is fixed at low rates as we move into a higher rate environment.\n\nRegarding our capital allocation, we continue to balance investing for the future with returning capital to shareholders, and we remain committed to our dividend and to returning a minimum of 50% of our free cash flow to our shareholders. Now, turning to our guidance. Today, we set our second-half revenue guidance at 3.5% to 4% organic, which excludes currency movement and revenue from our Intersect ENT acquisition. If recent exchange rates hold, foreign currency would now have a negative impact on our back half revenue of 930 million to 1.03 billion.\n\nOur back half guidance translates into a reduction of our annual guidance, driven by a slower pace of market and supply recovery. On market, we are expecting incremental provincial tenders in China, particularly in stapling and cardiac ablation. And Geoff referenced earlier that some procedure volumes in the second quarter didn't recover as quickly as we were expecting. So, at this point, we are assuming no incremental improvement in the back half.\n\nOn supply, while we have had a meaningful recovery, it came later than anticipated, particularly in SI and cardiac diagnostics. And that simply delays our pace of recovery ahead. By segment in the back half, the majority of the reduction is in our medical surgical portfolio, which we now expect to be flat to up 0.5%. We expect cardiovascular to grow 5.25% to 5.75%, neuroscience to grow 6% to 6.5%, and diabetes to decline in the low single digits, all on an organic basis.\n\nOur total company revenue guidance does assume continued revenue growth acceleration, which we saw in each month of the second quarter. We expect the third-quarter growth rate to be better than the second and the fourth quarter better than the third. We will have easing comparisons in ventilators, improving supply in certain businesses like cardiac diagnostics and SI, and the benefit from product launches, like Evolut FX and EV ICD. In the third quarter, we expect organic revenue growth in the range of 2.5% to 3%, an acceleration from the second quarter.\n\nAnd assuming recent exchange rates hold, the third quarter would have a currency headwind between $460 million and $510 million. By segment and on an organic basis, we expect medical surgical to be down 2% to 2.5%, an improvement from the second quarter, given lesser event headwinds and the impact of the flu season. Cardiovascular to grow 4.75% to 5.25% on the continued rollout of Evolut FX and LINQ II. Neuroscience to grow 5.75% to 6.25%, improving from the prior quarter with less VBP impact in spine, and diabetes to decline in the low single digits.\n\nOn the bottom line, we are driving significant expense reduction throughout the company to help offset the lower revenue and continued inflation impact and now expect fiscal '23 non-GAAP diluted EPS in the range of 5.25 to 5.30. That range includes an unfavorable impact of currency of approximately $0.18 at recent rates. For the third quarter, we expect non-GAAP diluted EPS to be in the range of $1.25 to $1.27, including an FX headwind of about $0.05 at recent rates. Amidst the macro environmental headwinds we face from inflation, China VBP, softer procedure volumes in certain markets and currency, we are laser focused on driving operational and expense efficiencies.\n\nWe are also committed to invest appropriately for the long term, allocating capital to our most promising growth drivers and executing tuck-in acquisitions, designed to reach more patients and create value for our shareholders. As we approach Thanksgiving, I want to share my gratitude to our employees who have been committed, particularly during these challenging times, to deliver on our mission, to alleviate pain, restore health, and extend life for millions of people around the world. Back to you, Geoff.\n\nGeoff Martha\n\nThank you, Karen. Now, before we open the lines for questions, I want you to know that our growth rate and our consistency are not where we want them to be. That's why I shared with you our aggressive agenda to transform this company two years ago when I became CEO. We embarked on a plan of implementing a new operating model, eliminating the bureaucracy of our groups and forming more nimble operating units, while at the same time, learning to leverage our scale.\n\nWe set in motion a new performance-driven culture, and we changed our incentive plans to reward new behaviors and performance. We brought in new leaders to inject new ways of thinking in the organization, and we implemented new capital allocation and portfolio management processes. Now, these changes take time, and we faced setbacks along the way that have slowed us down. Some are environmental like COVID recovery rates, raw material shortfalls, and Chinese procurement policy, while other setbacks are of our own doing, like our quality and operational challenges and the pace of improvement we anticipated.\n\nLook, I know we have more work to do here, but we understand the root causes that led to the years of underperformance from this company. And our aggressive transformation agenda is designed to fix these issues. I know we will get this right, choosing the right markets, being more efficient and productive with our resources, empowering businesses, and increasing accountability, improving our quality, our manufacturing, and our supply chain, and turning our size and scale into an advantage. And I know we are on the right path.\n\nThe progress we've made so far gives me that confidence. We have experienced leaders, a compelling pipeline and positions of strength in some of the most attractive medtech markets, which address significant unmet needs for patients. We will execute on our plan to deliver durable growth that we began two years ago. And as we do, we will create tremendous value for all of our stakeholders.\n\nSo, now let's move to Q&A. We're going to try to get to as many analysts as possible, so we ask you to limit yourself to just one question and only if needed, a related follow-up. If you have additional questions, you can reach out to Ryan and the investor relations team after the call. With that, Brad, can you please give the instructions for asking a question?\n\nBrad Welnick -- Senior Director, Investor Relations\n\n[Operator instructions] For today's session, Geoff, Karen, and Ryan are joined by Que Dallara, EVP and president of the diabetes operating unit; Sean Salmon, EVP and president of the cardiovascular portfolio; Brett Wall, EVP and president of the neuroscience portfolio; and Bob White, EVP and president of the medical surgical portfolio. We'll pause for a few seconds to assemble the queue. We'll take the first question from Robbie Marcus, JPMorgan. Robbie, please go ahead.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for taking the questions. Maybe I'll ask a two-parter upfront. You know, the miss in the top line in the quarter, the guide down was pretty significant for the second half of the year.\n\nYou know, you point to slowing procedure growth or not a recovery they're hoping for yet it's different from what we're hearing from most of your peers in terms of stabilizing volume growth. So, I was hoping you could spend more time, walk us through what Medtronic is seeing and maybe why it's a little different relative to peers in terms of the recovery and the stabilization in volumes. And then as we think out to next year and fiscal '24, can you give some thoughts on the last call about FX and how we should be thinking about growth for next year? Any updates to that growth, and does it change with the updated second-half guidance range? Thanks a lot.\n\nGeoff Martha\n\nGreat. Thanks, Robbie. OK. I saw three parts there.\n\nI'm going to ask Karen to chime in to help me here on this one but provide some details. But on the miss, like we said in the commentary, the primary issue is the pace of the recovery, and there's the two buckets. There's the pace of our supply recovery, which we did make quite a bit of progress there and got over the most acute issues that were plaguing us but happened a little -- it happened late in the quarter and pushed out our momentum, which gets to the second part of your question, which is the effects the guide down. The other bucket is part of your second question as well -- is on the markets.\n\nMany of our businesses are back, you know, the majority of them are back to the pre-COVID level of their markets. But there are some that are not. And I'll let Karen walk through those, and we were -- you know, we just overstated what that market recovery would be. And we'll walk you through those and how those impact the second quarter -- the second half.\n\nKaren, do you want to --\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nYes. Thanks, Geoff, and thanks, Robbie. So, let me talk about it more broadly than your question to Robbie because I know you asked a specific question on procedure growth. So, I'll talk about that and a little bit more broadly.\n\nSo, just on those two buckets. First, on our markets. Some of our markets have not returned to normal growth levels, and this does account for about -- for over half of the reduction in our second-half guide. You talked about competitors.\n\nYou know, you've heard from some of our competitors about a slow recovery in the neuro market and the TAVR market. And we're also seeing a slow recovery in basic coronary PCIs and some general surgery procedures that we mentioned in the commentary. And because these markets have not accelerated as quickly as we had anticipated, we've decided to assume volumes in the back half remain at Q2 levels. You know, if those volumes improve in those markets, that would be upside.\n\nWe also talked about related to markets that we're expecting additional provincial tenders in China. And those were ones that we believed would occur next fiscal year and are occurring sooner, particularly in stapling and cardiac ablation. And then on the second bucket of supply that Geoff mentioned, we, obviously, did see meaningful improvement over the second quarter. But some of that happened late in the quarter, as we said, and that pushes out our assumptions for share recapture.\n\nYou know, for example, and particularly in SI, while we were short on supply, our competitor benefited. You know, they stepped in to fill the shelves with our customers. We're under long-term contracts with those customers, so we will gain our share back. There's just a lag while the shelf inventory comes down.\n\nSo, hopefully, that gives you some context on our guide this morning. But just to summarize, in addition to our assumptions on market growth, we assume incremental contribution from products that we've recently launched and supply that has recently improved. On your question on FY '24, you know, it's still early. We have two quarters to go, and we're at the beginning of our planning process.\n\nSo, we're not --we're not going to give FY '24 guidance on this call. But I will say a few things, including currency because that was your question. First, on the top line, you can see that we expect to exit the year with mid-single-digit growth, and that's a great place to start the following year. Second, down the P&L, we're still in a challenging operating environment with inflation, interest rates, and currency, as you mentioned.\n\nAnd on currency, we now estimate that to be a $0.36 headwind on the bottom line in FY '24. And that's, obviously, worse than the $0.18 that I mentioned for FY '23. And third, we're purposely driving significant expense reduction given these headwinds and given our focus on continuing to drive long-term investments for the company. So, we've got several puts and takes for next fiscal year, and we plan on giving you more on FY '24 as we move through the back half. \n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for all the color.\n\nGeoff Martha\n\nThank you, Robbie. We'll take the next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nThe next question comes from Travis Steed at Bank of America. Travis, please go ahead.\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nHi, good morning, everybody. A little bit more color on FY '24 as it relates to China VBP. I don't know if there's any way to think about how much of the China VBP stuff hits in FY '23 versus FY '24, given some of the new ones like EP and even neuro. And then I did want a little bit more color on TAVR as well given the strong U.S.\n\nresult there. Curious if you could kind of comment a little bit on the TAVR market and also share. I don't know if you can say how much share you think you took this quarter in U.S. TAVR?\n\nGeoff Martha\n\nYeah. So, thanks for the question, Travis. On the -- why don't we start with the TAVR one because we -- you know, the market didn't grow quite as much as we had hoped, but it still was a strong growth driver for us, and we did do well from a share perspective. And why don't we let Sean maybe comment on that, and then we'll come back and help Karen talk about the VBP part of the question.\n\nSean.\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nYeah. Travis, we think we took about a half point of share for that -- for the full quarter, and it was really driven by the late -- the last month of the quarter where we picked up some of that momentum in October with the launch of the Evolut FX. We're in about 400 accounts of that so far, so we've got some room to run there for the back half of the year. But it's very strong.\n\nI think the underlying market is still in the kind of high singles area. And I think that, that's really, as you know, just conspired against by the resource intensity that's required, you get this whole chain of events where you have to have a patient go through imaging prior to their eventual procedure, and there's a lot of handoffs along the way. So, those dynamics are continuing to play out around the world but probably more in Europe and France and Germany than we see in other countries. And then we had -- we have a little bit of slowness on our own throughout -- through Japan.\n\nJapan had a flare of COVID through the summer, which was difficult. And we also had a problem where there was a sheet that we use for the procedure that we don't make that became unavailable because of supply challenges, and that led to some share loss in Japan. But overall, the TAVR momentum is really strong for us with FX launching, and we're excited about back half to get to a full release of that product into all the accounts.\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nAnd on your China VBP question, Travis, about 15% to 20% of our back half guide down is due to the incremental China VBP being pulled forward from next year from our perspective from what we had assumed. China declined 9% in the second quarter, and that was because of an impact of VBP in spine. For the rest of this fiscal year, we don't expect China to be a material growth driver for us. And in fact, for the full year, we're expecting low single-digit declines in China.\n\nThat said, as we look forward into FY '24, you know, we'll continue to have some VBP, but I think the vast majority will be behind us. And China should be a contributor of growth again next fiscal year.\n\nGeoff Martha\n\nJust a little bit more color on the VBP. I mean we had visibility to these national tenders, and we factored that in earlier in the year. But what we didn't have real good visibility to is some of these provincial tenders that came out here in the last couple of months. And that's part of the change in the guidance.\n\nAnd to Karen's point, look, longer term, we still think China is a growth market, but it's not right now, and we factored that into our guidance.\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nGeoff Martha\n\nThank you, Travis. Yup. Next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nThe next question comes from Vijay Kumar at Evercore ISI. Vijay, please go ahead.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nHey, guys. Thanks for taking my question. My first question was on the back half guidance. When you look at 2Q, second-quarter organic slightly north of 2% and the back half guidance of 3.5% to 4%.\n\nHow do you risk is that 3.5% to 4%? Can you give us a bridge of what gets easier? I think you had some easier wind comps, etc. And I think related to that, you know, is this -- why is Medtronic confident that this is not a firm your share loss in surgical innovations?\n\nGeoff Martha\n\nOK. Thanks for the question, Vijay. Let me take the -- well, I'll take the share loss question first, and then I'll get to the back half and maybe I'll have Karen talk to that one as well. But in SI or surgical innovations, this -- first of all, this is a contracted business with health systems and -- but, you know, mainly us and our main competitor in that space.\n\nAnd in the past, there have been circumstances when the shoe is on the other foot when our competitor had a recall -- and have had recalls. And we did the same thing where we got, picked up some incremental revenue and some share because the two big competitors are -- make up the majority of what the hospitals are buying in the surgery space. But these hospitals do honor these contracts. There's a lot that goes into them, and that revenue went back after the supply situation was resolved.\n\nAnd -- so, that -- we've seen that over the years on multiple times. So, these are contracted -- like I said, contracted business for us. And based on our dialogue, with the health systems, you know, we're confident this is going to come back as our supply, which we mentioned. We did get past the most acute part of our supply issues in the surgical innovations business, was this packaging issue.\n\nIt did come later in the quarter in slower momentum, but we do have momentum now, and you should see that business recover. On the back half, I'll ask Karen to comment.\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nYeah. Thanks, Vijay. When we look at our back half ramp, we have new products. We've got TAVR with Evolut FX that Sean has mentioned, was only in the market for a month in Q2.\n\nSo, we expect continued growth from that. We've got Hugo starting to ramp. We've got our Harmony valve returning to the market. We've also got our diabetic painful neuropathy opportunity that we'll be driving more in the back half.\n\nAnd we've got supply returning. You know, we've got supply returning for our LINQ II product in our cardiac diagnostics and also better supply in SI and ICDs. And we've got reduced headwinds. Our sale events and aortic graphs are normalizing.\n\nSo, all of those things really lead to the back half ramp. Hopefully, that's helpful.\n\nGeoff Martha\n\nYeah. So, I mean, beyond the supply returning, the back half, as Karen walked through a lot of it, is really powered by very tangible things beyond supply, product-related. They're tangible and compelling. \n\nVijay Kumar -- Evercore ISI -- Analyst\n\n[Inaudible] and then maybe one related. I think in the past, Medtronic is thought about itself as a mid-single to your top-line company in light of the these [Inaudible] is that mid-single-digit LRP still intact? Does Medtronic lead to your supplement this growth [Inaudible] Thank you.\n\nGeoff Martha\n\nI didn't hear the very last part of it. Does Medtronic -- but the answer to your question is yes. I mean, the mid-single-digit growth, we'll exit the year at mid-single digit. You see, throughout this year, you're seeing the acceleration from the first quarter, which was the depth of our supply issues.\n\nWe're really in a tough spot. We were down minus 4%. Then this past quarter, on an organic basis, up 2% and then Karen walked you through the back half guide. But we exited the year at mid-single digits, and we believe that's durable.\n\nLike I said, based on these product launches that are here now, so -- immediate drivers. And then we -- Karen brought up a list of things that are already kind of tangible in the back half, but there's a number of other things that are still coming. You know, the AURORA EV-ICD, PFA, and an Afib and inceptive with ECAPs and our SCS business, and then there's the whole diabetes discussion with those products coming on in the U.S. in the next year.\n\nAnd the Hugo ramp will go on for a while. So, there's a number of things that keep us going. And so, that's why we feel good about the mid-single digit. Thank you, Vijay.\n\nNext question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nThe next question comes from Larry Biegelsen at Wells Fargo. Larry, please go ahead.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nCan you guys hear me OK?\n\nGeoff Martha\n\nYes. Hey, Larry.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nHey, good morning. Thank you for taking the question. Maybe on diabetes for Que. So, Que, just a multipart question here.\n\nDid you ask for a variance on 780G? And if so, what was the response or when will you know? And if you don't get a variance, do you need reinspection for 780G clearance? And how long do you expect that to take? And just lastly on 780G, do you expect it to have the same impact in the U.S. as you've seen outside the U.S.? Thanks for taking the question.\n\nQue Dallara -- Executive Vice President and President of the Diabetes Portfolio\n\nThanks, Larry. So, on your first question, no, we did not ask for a variance. We've been focused on lifting the warning letter. I'm pleased to say that we are 100% complete on the warning letter commitments, and we have welcomed the FDA back in to assess our current status.\n\nSo, I think that's forward progress, and that's the clearest path because, obviously, it's not just 780, but it is a whole pipeline of innovation that we care about from a growth perspective. So, there's progress there. It's very hard to say, timing on that. I think that's up to the agency.\n\nWe know they're working very hard on that. So, we anticipate, you know, progress there as well. On your question around 780G progress in international markets, we're very pleased with the double-digit performance there. We do expect to see something similar in the U.S.\n\nmarket once approved. We are actually doing -- we've been really happy with how 770G has performed in the U.S. market. It's helping to stabilize attrition here.\n\nAnd as you know, our customers have a free upgrade option with 770 once approved in the U.S. market. And sorry, Larry, I missed your third -- your second part of the question.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nQue, that's helpful. I guess, why didn't you ask for variant in the U.S.? It seems like a kind of no risk option here, so why not ask for it? Thank you.\n\nQue Dallara -- Executive Vice President and President of the Diabetes Portfolio\n\nPrimarily because, as we've stated, we've been focused on really the long-term lifting up the warning letters is critically important. It's not just about 780G, but it's still about the pipeline. You know we submitted Simplera for CE Mark this year. We just submitted 780G with Simplera IDE last week.\n\nSo, there's a long line of innovation that we are interested in. And we were also very pleased with the progress we're making on correcting the warning letter commitment. So, with those things progressing at the pace, we did not feel it was necessary to seek a variance.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nAll right. Thanks so much for taking the questions.\n\nGeoff Martha\n\nThank you, Larry. Next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nThe next question comes from Matt O'Brien at Piper Sandler. Matt, please go ahead.\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\n[Technical difficulty]\n\nGeoff Martha\n\nHey, Matt, you -- OK. There seems to be a problem, Matt, with your audio. We will take the next question, Brad, and then we'll try to come back to Matt. \n\nBrad Welnick -- Senior Director, Investor Relations\n\nYup. The next question comes from Josh Jennings at Cowen & Company. Josh, please go ahead.\n\nGeoff Martha\n\nJosh, are you there?\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nYes. Can you guys hear me OK? Can you guys hear me?\n\nGeoff Martha\n\nYeah, we can hear you, Josh.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nOK, great. Sorry. I just wanted to make sure. Just one thing for Geoff and maybe Sean as well, just on the renal denervation program and understand, I think it's well understood that the totality of evidence can get the approval.\n\nI believe that your team has had preliminary discussions with payers and you might be helpful just in terms of under better understanding your optimism that not just approval could be in hand in the next six to 12 months, but payer decisions will ultimately be positive.And then the follow-up is just on supply, and just want to make sure I'm clear on the dynamics here. And just the recovery and regaining momentum is what's left, but is the supply chain -- are those headwinds gone? And just should we be expecting? I know you've got your team has executed on the streamlining or consolidation of operations and supply chain functions, and we start to see a benefit from those efforts in fiscal '24. Thanks for taking the questions.\n\nGeoff Martha\n\nMaybe I'll start with the supply situation. You know, are the supply chain issues gone? Not completely, but the biggest pain, or if you will, is behind us, especially in surgical innovations with the packaging, as I mentioned, issue. What lingers a bit would be, like we've talked about before, some semiconductor, I'd say, constraints. But the changes that we've made to our supply organization with the new leadership under Greg, the new structure, bringing in new people to help us with capabilities where we thought we weren't -- where we needed to be, implementing new systems and new processes.\n\nAnd these changes, I believe, are durable. I mean, they are -- so, we're going to get -- we're getting through this. The worst is behind us. We factored in or update into the guidance, but there are some, I mean, like some issues that are outstanding like the semiconductors.\n\nBut all that's factored in, and we feel good about going forward, not just FY '24 but beyond that. Regarding Ardian, look, I'll ask Sean to chime in here. But look, the -- as you look at the data, we believe it's very compelling, you know. And you see that the sham arm in the trial increased their medication, and the Ardian arm reduced.\n\nAnd the difference is 10x. I mean it's a significant difference. And when you -- when physicians look at it, they understand this and are excited about it. And why we're optimistic with payers is because health systems and governments are really focused on -- and payers are focused on hypertension, which, you know, like the current standard, as I mentioned in the commentary, just isn't working and more data came out to substantiate that in September, physician -- to substantiate what people already know.\n\nAnd so, now, there's a new option. And I think payers are going to be compelled to take it seriously, especially with the public health epidemic that we're facing here. Sean, do you want to chime in and add some more color to this?\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nYeah. You said it well, Geoff. And Josh, you're right. The totality of the data is really the strength of this program compared to just about any other new therapy I can think of, there's really not a lot of comparisons for just how much good data we have here.\n\nIt's over 3,000 patients in the real-world data on top of the sham-controlled randomized studies. And importantly, we did a patient preference study, which is getting more and more considered by payers because they know that patients have a say in what they want to go do. And there's a large majority of patients that prefer having a procedure versus adding just even one more drug. And, of course, we can get their blood pressure down without the addition of drugs, which is a huge benefit.\n\nI'll remind you also that Ardian was a breakthrough device, had that designation. In the world of MST ruling, that would have met automatic coverage. We don't know yet what the [Inaudible] pathway is going to look like. We'll find out more about that in the fall time frame, I suppose, or in the spring time frame, but we do think that the novelty of this therapy, the desire of patients, and of course, the public health benefit that this can provide is going to be compelling to both public and private payers around the world.\n\nGeoff Martha\n\nThanks, Josh. We'll tale the next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nYeah. We'll try Matt again. The next question will come from Matt O'Brien at Piper Sandler. Matt, are you there?\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nHow about now? Can you hear me?\n\nGeoff Martha\n\nWe can hear you now. Yeah, we can.\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nThanks for taking the question. Sorry about that. I guess, just to follow up a little bit on Josh's question, and I know how enthusiastic you still are about Ardian. But, you know, I think the ambulatory number is one that is a little bit more robust in the office-based number.\n\nSo, why would clinicians and payers be so interested in doing these cases or we're paying for them given the ambulatory feedback that we've seen? And are you guys still thinking about the market is 500 million by '26, $3 billion by the end of the decade?\n\nGeoff Martha\n\nYeah. Sean, do you want to get into the specifics on the ambulatory versus the office?\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nYeah, Matt. I think if you just recall how that study was done, the patients were witnessed taking their blood pressure medicine in the morning. And, you know, whether they were taking that for the full six months or not or they just took it that day, you saw the change in blood pressure that was during the daytime, not what we've seen before in these prior trials. But at nighttime, there was still a reduction ambulatory.\n\nSo, I think the simple story here is that patients weren't taking their medications except on game day, and their blood pressure dropped. Now, we don't know that for sure. We didn't test blood in urine every day. We just test it on game day, and we know that there were more medications in the patients that were in the control arm than in the treated arm.\n\nAnd as Geoff said, the changes increasing medication, decreasing medication, taking even medications for blood pressure that weren't even prescribed maybe from their medicine cabinet, maybe from their spouse's or partner's medicine cabinet. There's a lot of changes in medicine, which we know were present different than the prior studies. We actually have that proof now that we can measure the drug metabolites. So, cleaner, if you will, measure is that morning blood pressure, we took the office blood pressure.\n\nAnd that blood pressure is the one that's used for all the epidemiology studies that show what the reduction in blood pressure means for the avoidance of events and reduction of cost. And it's also the primary endpoint that's gotten just about every -- I think maybe every pharmaceutical approved for the treatment of high blood pressure. So, it is the robust standard. In fact, ambulatory is not even reimbursed in this country.\n\nSo, it's not used routinely in clinical practice. So, it is a robust measurement that was consistently performed throughout this trial and across the other trials that we've done. So, I'm confident in that part. In terms of the market size, you know, we're very confident in this therapy.\n\nThere's 1 billion people blood pressure problems around the world, even if very small amount gets you to the kind of market growth that we think is going to be meaningful for the company. So, we're very confident in this therapy and that is approval and ultimate uptake.\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nOK. That makes sense. I appreciate that. And then it's not a related follow-up, but turning over to cardiac rhythm for a second.\n\nJust -- I'd love to hear about the competitive dynamics that are going on with Micra because you've got a competitor there now and then what the expectation is with EV ICD, given the long-standing presence of another one of your competitors in that market. What should we be expecting between those two as we progress over the next 12 months? Thanks.\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nYeah. So, for Micra, we continue to grow, and you saw 18% globally, 40% of that was from international sales. And really Japan and China, in particular, really drove that great and continued success. And we'll see continued penetration in international markets and in the U.S.\n\nand a shift between single chamber to the AV device, which can pick up a larger proportion of patients. It's about 30% of the market there. And in the next 12 months, we're going to refresh both the VR and the AV devices in the coming year around the world. So, while we have some competition in the United States, we fared pretty well.\n\nI think the ease of use of our micro device in the long-term data that we have as well as just the familiarity with our system has made it pretty durable. On AURORA EV-ICD, as you know, we've got CE Mark coming up. That's a little bit of a different technique. You've got to put a lead underneath the breast bone, which takes some training to learn.\n\nAnd we'll be very meticulous in the way we roll that out. But make no mistake that is a product that really offers a huge benefit, getting leads out of the heart, having half the size in the can and twice the battery life compared to the other device that realm and being able to voice shock by pacing people out of their fatal arrhythmia as opposed to having to have a painful shock. Those are all really, really welcome improvements, and we're excited to roll that technology out first in Europe and then the United States next year.\n\nGeoff Martha\n\nChronic rhythm business has done well, and we expect it to continue to do well with products like Micra and EV ICD but also pioneering conduction system pacing, and we've got a nice pipeline there and really a strong leadership team and strong position. So, thanks for the question, Matt.\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nThank you, Matt. Next question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nYeah. The next question comes from Matt Taylor at Jefferies. Matt, please go ahead.\n\nMatt Taylor -- Jefferies -- Analyst\n\nHey, guys. Thanks for taking the question. Can you hear me OK? Sorry. Can you hear me OK?\n\nGeoff Martha\n\nYeah. We can, Matt.\n\nMatt Taylor -- Jefferies -- Analyst\n\nOK. Sorry. So, I wanted to just explore you talked about the slower recovery of some of these elective and developed markets. And, obviously, there's staffing, these and other challenges.\n\nI guess maybe you could just give us some insight into two things. One is, could you talk a little bit more about procedure trends through the quarter? Did you see any improvement? And then what gives you the confidence or what intelligence do you have to point to whether this is really staffing or I think investors are worried about lack of pent-up demand. Could you just address that?\n\nGeoff Martha\n\nSure. I'll ask Karen to comment on the procedure trends through the quarter, and then we can talk to the staffing issue. Karen.\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nYes. So, I would say, you know, through the quarter, we did see, particularly in the markets that we had mentioned, not as robust recovery but some recovery. But, you know, as we ended the quarter with less robust recovery, we're just assuming that in those areas, those procedures stay where they were in the back half. We'll see if that's a good assumption or not.\n\nAs we look at the first few weeks of our current quarter, of the third quarter, we are seeing improvement from the second quarter. So, that's pointing to some good things, but we'll see.\n\nGeoff Martha\n\nYes. So, just to highlight what Karen is saying there, I mean, we were disappointed that we missed the call on this one for the Q2. And so, now, in our guidance, we've assumed a prolonged recovery here, especially for those segments that we called out, not all the segments. Like we said, many of the segments are back to pre-COVID, but there are a handful of those electives and developed markets that we've called out.\n\nAnd Karen walked you through the assumption for the back half of the year. In terms of the staffing, you know, I hear that dynamic in some of the cardiology space is more than others. And maybe I'll have Sean comment on that.\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nI'd say a couple of things on that, Geoff. First of all, there's -- you take a therapy like TAVR, where there's multiple handoffs, you have to have pre-imaging, you have to get the patient worked up, they get their procedure done. And then there are sometimes even post imaging this done. So, a lot of handoffs and the patients tend to be elderly.\n\nSo, there's -- you want to sure you schedule that in a way that's OK, that they can get it all done in an efficient way. We don't want them exposed to the healthcare environment for a long time. And I think that's challenging. It's also true that you can't wait forever.\n\nYou've got -- with severe aortic stenosis, there's about an 80% mortality rate for two years from your diagnosis of that. So, it's more lethal than cancer, for example, most cancers. So, it's not something you can put off forever, but it is resource intensive. And I think the other thing we're seeing with staffing just in general is, there's a prioritization for patients that you can get in and out relatively quickly so they can make downstream staffing available.\n\nSo, whether it's ICU recovery or you've got even transport that you've got to move -- and I think there's some arbitrage in some countries even on the margin that they make on those procedures. Cardiac surgery have grown like a 5.5% for us. So, very robust. There's a lot of margin that comes out of cardiac surgery patients.\n\nThey tend not to be as deferrable as, say, like a PCI patient, for example. So, you know, we hear it in pockets. I mentioned before, France and Germany seem to be some places that are really struggling with staffing in Europe, and we see it just in pockets around the United States and other places. So, it is a dynamic situation, and we think it has gotten better, certainly a lot of places, but not everywhere yet.\n\nGeoff Martha\n\nOK. Thank you, Matt. Next question, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nThe next question comes from Pito Chickering at Deutsche Bank. Pito, please go ahead.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nHey, guys. Thanks for putting me in here. I know that you don't have a ton of exposure here, but there has been a healthy debate around hospital demand for capital equipment this year. Can you give us any color on what you're seeing from behavior changes in hospitals for capital ordering in 2Q and what you guys assume in the back half of the year?\n\nGeoff Martha\n\nYou know, our capital, first of all, isn't a huge piece yet of our revenue. But it is -- it tends to be tied to profitable procedures, and we actually had a strong capital performance in last quarter. And especially in our -- with our cranial and spinal technologies business, CST, our capital there, we had a number of our -- whether it be navigation, intra-operative imaging, I had record capital quarters for us. So, we're -- we definitely see a bit of -- it takes a little longer to close a deal, but the demand as you're working with the hospital and how they're going to pay or finance this -- but we're having strong demand in those areas.\n\nAnd then, of course, we mentioned Hugo. Hugo is still new for us, but we are very happy with the placements we've been able to make on Hugo here. Of course, those are outside the U.S. but very pleased with that.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nOK. Thanks so much.\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nThank you, Pito. We've got time for one more question, please, Brad.\n\nBrad Welnick -- Senior Director, Investor Relations\n\nYup. Our final question comes from Joanne Wuensch, Citi. Joanne, please go ahead.\n\nJoanne Wuensch -- BMO Capital Markets -- Analyst\n\nHi. Can you hear me?\n\nGeoff Martha\n\nYes, Joanne. Good morning.\n\nJoanne Wuensch -- BMO Capital Markets -- Analyst\n\nWonderful. Good morning, and early happy Thanksgiving. This led straight into my Hugo question. Could you give us a little bit of an update on how you feel about the market potential for the product, the timing of U.S.\n\napproval? And at one stage, several years ago, you were talking about the potential contribution. Is there a way to start thinking about that again? Thank you.\n\nGeoff Martha\n\nSure. Well, thanks for the question, Joanne. Yeah. Like I said, we have good news on Hugo.\n\nWe're kicking off the U.S. IDE with -- our first case is scheduled for December based on getting these instruments enhancements approved. And like I just said to Pito, we are pleased with the system placements. And in terms of the other color commentary on that, I'll ask Bob White to chime in.\n\nBob White -- Executive Vice President and President of the Medical Surgical Portfolio\n\nYeah. Thanks, Geoff, and thanks, Joanne. Good morning. Couple of thoughts here.\n\nFirst, on the overall market for Hugo, we continue to be really excited about it. Remember, there's, around the world, still 95% arousable cases are not done that could be done robotically assistedly. So, we believe this is a true market expansion opportunity. So, we feel really excited about the continued long-term health of the market and excited to be the No.\n\n2 player in this space. With respect to the timing of U.S. approval, as Geoff mentioned, we expect to begin our U.S. IDE by the end of this calendar year.\n\nSo, that's exciting. Actual approval in the U.S., of course, depends upon the agency and the process there. So, I really can't comment on that. And overall, with respect to the contribution, as you mentioned, I think it's early to call that.\n\nBut given our system is now installed around the world in markets in APAC, EMEA, LATAM, we just received regulatory approvals and indication expansions in Japan, which is the third largest robotics market in the world. We have general surgery approval in the EU, Canada, and Australia, which opens up the hernia market for us. And we've started to see really strong presence and some really key congresses in Europe where, you know, live stream cases, etc. So, a little early to call it contributions, Joanne, but we're starting to see the momentum in the acceleration that we talked about.\n\nSo, thank you.\n\nGeoff Martha\n\nThanks, Joanne.\n\nRyan Weispfenning -- Vice President and Head of Investor Relations\n\nThank you, Joanne. Geoff, please go ahead with your closing remarks.\n\nGeoff Martha\n\nOK. Thanks, Ryan. Well, first of all, thank you, everybody, for the questions. And we do really appreciate your support and continued interest in Medtronic.\n\nAnd we look forward to updating you on our progress on our Q3 earnings broadcast, which we anticipate holding on February 21st. So, with that, thanks again for tuning in today. Please stay healthy and safe. I understand there's a lot of people traveling this holiday.\n\nAnd for those of you in the U.S., I'd like to wish you and your families a very happy Thanksgiving.\n\nDuration: 0 minutes\n\nGeoff Martha\n\nKaren Parkhill -- Executive Vice President and Chief Financial Officer\n\nBrad Welnick -- Senior Director, Investor Relations\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nSean Salmon -- Executive Vice President and President of the Cardiovascular Portfolio\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nQue Dallara -- Executive Vice President and President of the Diabetes Portfolio\n\nMatt O'Brien -- Piper Sandler -- Analyst\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nMatt Taylor -- Jefferies -- Analyst\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nJoanne Wuensch -- BMO Capital Markets -- Analyst\n\nBob White -- Executive Vice President and President of the Medical Surgical Portfolio\n\nRyan Weispfenning -- Vice President and Head of Investor Relations\n\nMore MDT analysis\n\nAll earnings call transcripts"
}