{
  "companyName": "Barings BDC, Inc.",
  "companyTicker": "BBDC",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/barings-bdc-inc-bbdc-q2-2022-earnings-call-transcr/",
  "content": "Barings BDC, Inc. (BBDC -0.97%)\nQ2 2022 Earnings Call\nAug 10, 2022, 9:00 a.m. ET\n\nOperator\n\nAt this time, I would like to welcome everyone to the Barings BDC, Inc. conference call for the quarter ended June 30, 2022. [Operator instructions] Today's call is being recorded, and a replay will be available approximately two hours after the conclusion of the call on the company's website at www.baringsbdc.com under the Investor Relations section. Please note that this call may contain forward-looking statements that include statements regarding the company's goals, beliefs, strategies, future operating results and cash flows.\n\nAlthough the company believes these statements are reasonable, actual results could differ materially from those projected in forward-looking statements. These statements are based on various underlying assumptions, and are subject to numerous uncertainties and risks including those disclosed under the sections titled Risk Factors and Forward-Looking Statements in the company's annual report on the Form 10-K for the fiscal year ended December 31, 2021, and the quarterly report on Form 10-Q for the quarter ended June 30, 2022, each as filed with the Securities and Exchange Commission. Barings BDC undertakes no obligation to update or revise any forward-looking statements unless required by law. At this time, I will turn the call over to Eric Lloyd, chief executive officer of Barings BDC.\n\nEric Lloyd -- Chief Executive Officer\n\nThank you, operator, and good morning, everyone. We appreciate you joining us for today's call. Please note that throughout today's call, we'll be referring to our second quarter 2022 earnings presentation that is posted on the Investor Relations section of our website. On the call today, I'm joined by Barings BDC's president and co-head of global private finance, Ian Fowler; Bryan High, Baring's head of capital solutions and co-portfolio manager; and BDC's chief financial officer, Jonathan Bock.\n\nAs we typically do, Ian, Bryan, and Jon will review details of our portfolio and second-quarter results in a moment, but I'll start off with some high-level comments about the quarter. Let's begin with the market backdrop shown on Slide 5 of the presentation. With significant economic uncertainty, broadly, syndicated loan spreads increased due to increased macroeconomic fears tied to both underlying inflation and the potential of a Fed overcorrection. Loan prices broadly and BDC equity prices specifically were also not immune from increasing risk premiums, down 4% and 9% from the end of Q1 through July 31, respectively.\n\nLooking at second quarter highlights on Slide 6. Net asset value per share was $11.41 compared to the prior quarter of $11.86, down 3.8% driven primarily due to unrealized write-downs tied to macro market factors and spread widening as opposed to fundamental credit-related factors. Our net investment income increased to $0.29 per share compared to $0.23 per share last quarter as a result of increasing interest and fee income as well as the elimination of our income incentive fee due to our shareholder-friendly fee structure, specifically in the incentive look-back feature, which includes realized and unrealized gains and losses. Regarding new investments, we had gross originations of $352 million in the second quarter.\n\nThis was offset by $299 million of sales and prepayments. Our investment portfolio continued to perform well in the second quarter with no new loans on nonaccrual. In total, with the Sierra and NBC assets, our total nonaccruals are 2.9% of the portfolio on a cost basis and 0.8% on a fair value basis. Ian will highlight later, our focus on select asset sales and restructurings in the acquired MVC and Sierra portfolios as we continue to maximize shareholder value while benefiting from the protection added by the credit support agreement.\n\nAdditionally, our board declared a third-quarter dividend of $0.24 per share, equating to an 8.4% yield on our net asset value of $11.41. Slide 7 outlines summary financial highlights for the previous five quarters. In the second quarter, continued strong investment performance drove total investment income higher quarter over quarter to $56 million and net investment income to $32 million, both up from $44 million and $19 million in the first quarter. Realized losses of $10 million were principally a result of FX moves, on assets that were repaid at par in the quarter with a corresponding offset in the unrealized depreciation associated with foreign currency borrowings under our credit facilities.\n\nNet unrealized depreciation of $45 million was primarily a result of mark-to-market on our assets as a result of higher spreads. As a result of the unrealized depreciation, Barings incentive DCAP eliminated the quarterly incentive fee further lowering expenses and increasing debt investment income to $0.29 per share. Net leverage, which is leveraged net of cash, short-term investments and unsettled transactions, was 1.0 times, which is currently toward the lower end of our target leverage of 0.9 to 1.25 times. This attractive liquidity position allows us to remain steady partners with our existing sponsor clients as well as look toward investment opportunities that present themselves in the face of economic uncertainty.\n\nI'll now turn the call over to Ian to provide an update on the market and our investment portfolio.\n\nIan Fowler -- President and Co-Head of Global Private Finance Group\n\nThanks, Eric, and good morning, everyone. If you turn to Slide 9, you can see additional details on the investment activity that Eric mentioned. Our middle-market portfolio increased by $3 million on a net basis in the quarter, with gross fundings of $227 million, offset by sales and repayments of $224 million. New middle-market investments included 22 new platform investments totaling $156 million and $171 million of follow-on investments and delayed draw term loan fundings.\n\nWe also had $108 million of net cross-platform investments in the quarter. Slide 10 updates the data we show you each quarter on middle-market spreads across the capital structure, and it is easy to reference that investment spreads across public and private asset classes have widened. Notice a degree of spread winding in the private credit category has a much more lagged effect when compared to broadly syndicated loan spreads, which are outlined in red. That said, we continue to see spread widening in our core market as a welcome benefit to long-term investment return, particularly for those who have flexible investment capital.\n\nTurn to Slide 11. Many of you have heard me outline the competitive dynamic at play in unitranche transactions. I'm pleased to see as a result of emerging underwriter potential economic fears that spreads began to widen ever so slightly and may likely continue their upward trend. While underlying covenant-light activity in these transactions remain high,we also continue to see improvements in loan documentation that tilt toward patient investors.\n\nIn many years in this asset class, I'll outline that these changes are slow and gradual, but they do occur. And the key remains keeping focus on pricing discipline across your origination footprint. A bridge of our investment portfolio from March 31 to June 30 is shown on Slide 12. On Slide 13, you'll see a breakdown of the key components of our investment portfolio on June 30.\n\nAs we have discussed in the past, the goal of this slide is to provide details on the key categories of our portfolio, which are the Barings-originated middle-market portfolio, the legacy MVC Capital and Sierra Income portfolios as well as our cross-platform investments. The middle-market portfolio remains our core focus and continues to grow. It makes up 56% of our portfolio in terms of total investments at fair value and 48% of our portfolio in terms of revenue contribution. Our Barings originated mail market exposure is heavily diversified among obligors of 199 portfolio companies with a geographic diversification across the U.S., Europe and APAC regions.\n\nUnderlying yields on our middle-market investment portfolio of 7.9%, up from 7% last quarter and weighted average first lien leverage of 5.3 times remain reflective of our boring and beautiful approach to credit. In addition to our middle-market exposure, we continue to draw upon Barings wide investment frame of reference to complement our core portfolio with $441 million of investments in the legacy MVC and Sierra portfolios, and $612 million of cross-platform investments. Two MVC assets and five Sierra assets remain on nonaccrual, unchanged from last quarter. As mentioned previously, total nonaccrual assets as a percent of fair value are 0.8%, all of which are covered by the respective credit support agreements with Barings.\n\nOur liquidation and redeployment efforts on the MVC and Sierra portfolios remain ongoing. Barings onboarded $627 million of assets from those two acquisitions. To date, we've generated $121 million of repayments across both portfolios. Turning to the Barings portfolio.\n\nNo Barings directly originated loans are on nonaccrual and the total portfolio had no material modifications to the cash payment terms of our debt investments during the quarter. Our total investment portfolio is now made up of 65% first lien assets. Slide 14 provides a further breakdown of the portfolio from a seniority perspective. The core Barings-originating portfolio is 72% first lien.\n\nNote, the combined MVC Sierra portfolios are comprised of senior secured second lien, mezzanine debt and equity investments, which brings the first lien component of the total portfolio down to 65%. Our top 10 investments are shown on Slide 15. Our largest investment is 5.3% of the total portfolio, and the top 10 investments represent 23% of the total portfolio. Recall our largest investment, Eclipse Business Capital, is backed by a large portfolio of asset-backed loans conservatively structured inside of the collateral net liquidation value.\n\nThe overall portfolio remains diverse from an industry perspective as well with 294 investments spread across 31 industries. I'll summarize my market comments with a simple thought that Boeing has beautiful investment favors patience and most importantly, pricing discipline. With an increased level of macroeconomic uncertainty, we expect private equity sponsors to be highly selective with regard to new investments and instead favor support of existing investments. Our strong set of portfolio incumbencies across our U.S.\n\nand European sponsor universe allows us to be patient with our sponsors, providing growth capital to existing investments. I also believe there is a set of circumstances where certain private lenders will be in need of liquidity, and this creates both stress and destressed sellers as well as stressed and distressed portfolio companies. Our wide investment frame of reference across the capital stack allows us to target and underwrite these opportunities. And this gives me confidence in the future as I know we have both the investment acumen, patients and flexible capital base to drive attractive returns.\n\nI'll now turn the call over to Jon to provide additional color on our financial results.\n\nJon Bock -- Chief Financial Officer\n\nThanks, Ian. And turning to Slide 17. Here's the full bridge of NAV per share movement in the second quarter. Our net investment income exceeded our dividend by $0.05 per share.\n\nNet realized losses on our investment portfolio and foreign currency transaction drove a decrease of $0.09 per share, while our unrealized depreciation totaled $0.41 per share. Additional details on this net unrealized depreciation are shown on Slide 18. Of the total $45 million in unrealized depreciation in the second quarter, approximately $32 million was attributed to price or spread widening. Of this, our cross-platform investments total depreciation of approximately $20 million.\n\nAnd notably, the legacy MVC portfolio saw a total depreciation of $11 million with the majority tied to underlying credit performance while the Sierra portfolio had total depreciation of $16 million, $12 million of which was attributed to price movements, predominantly tied to CLO equity positions and the Sierra joint venture. Near the bottom of Slide 18, you can also see that the credit support agreements decreased $13 million as a result of increasing rates and discount rates. Slides 19 and 20 show our income statement and balance sheet for the last 5 quarters. As we've discussed, our net investment income per share increased to $0.29 for the quarter driven by a $12 million increase in total investment income as well as the elimination of the income incentive fee resulting from unrealized marks on the investment portfolio.\n\nAnd from a balance sheet perspective on Slide 20, total debt to equity was 1.23 times at June 30, although this level is artificially high given the timing of certain asset sales, and was one times after adjusting for cash, cash equivalents and unsettled transactions. Turning to Slide 21. You can see how our funding mix ties to our asset mix, both in terms of seniority and asset class. And compared to the end of 2020, our reliance on secured bank debt has decreased with the issuance of $725 million of unsecured debt in the public and private markets, and we have continued to diversify our balance sheet to match our diverse portfolio of assets.\n\nDetails of each of our borrowings are shown on Slide 22, which shows the evolution of our debt profile over the last three quarters. And jumping to Slide 23, you can see the impact of our net leverage using our available liquidity to fund our unused capital commitments. Barings BDC currently has $212 million of delayed draw term loan commitments to our portfolio companies as well as $67 million of remaining commitments to our joint venture investments. The table shows how we have the available capacity to meet the entirety of these commitments if called upon, while maintaining cushion against our regulatory leverage limit.\n\nSlide 24 updates our paid and announced dividends since Barings took over as the investment advisor to the BDC. And as Eric mentioned, the board declared a third quarter 2022 dividend of $0.24 per share and 8.4% distribution on net asset value. Now turn with me to Slide 26, which shows a graphical depiction of relative value across the BBB, BB, and B asset classes. And as Ian outlined, we saw improved spreads in the quarter across all asset classes as a result of increased fears of stagnation or stagflation.\n\nAnd for reference, single B liquid loan spreads are LIBOR plus 643 basis points, up from LIBOR plus 439 basis points last quarter. Rising base rates and improved spreads across liquid markets also correlates to private markets as demand for private alternatives falls in the face of rising risk-free rate. Said definitely, many investors who tend to migrate toward a nominal investment hurdle often have less demand for the exotic when their return objectives can be met with traditional public assets. As a result, managers like ourselves need to maintain strict investment discipline, in how this illiquidity premium to public markets is priced over cycles.\n\nAnd we speak often of our pricing premiums relative to liquid credit in our calls, and this translates into the actual results shown on Slide 27, which outlines the spread premium on our new investments relative to liquid credit benchmarks. Notice that our investment illiquidity premiums in the second quarter fell as rising spreads in liquid loans caused by fear was not fully repriced into the direct lending assets given those loans were originated and committed to prior to the spread widening. Excluding certain equity investments, Barings BDC deployed $338 million at an all-in spread of 836 basis points, which represents an 11-basis-point spread premium to comparable liquid market indices at the same risk profile. However, in the previous quarter, we deployed $281 million at an all-in spread of 768 basis points which represented a 293 basis point spread premium to comparable liquid market indices at the same risk profile.\n\nAll-in investment spreads increased which will have a positive income benefit. But as we look forward to our new transactions in the pipeline, we expect to see improvement in spread pricing as new transactions model in increased risk premiums, which will drive BBDC investment income higher. And as Ian said, both patients and pricing discipline define long-term investment performance. And at Barings BDC, we demonstrate both.\n\nNow I'll wrap our prepared remarks with Slide 28, which summarizes our new investment activity so far during the third quarter of 2022, and our investment pipeline. The pace of new investments remained steady compared to the last two quarters, with $215 million of new commitments, of which $171 million have closed and funded. And of these new commitments, 93% are first lien asset senior secured loans. 19% are in cross-platform investments, and 23% are European or Asia Pacific originations.\n\nThe weighted average origination margin was roughly 7.6%, and we've also funded approximately $12 million of previously committed delayed draw term loans. The current Barings Global Private Finance investment pipeline is approximately $2.6 billion on a probability-weighted basis, and is predominantly first lien senior secured investments. As a reminder, this pipeline is estimated based on our expected closing rates for all deals in our investment pipeline. I'll now turn it over to Eric.\n\nEric Lloyd -- Chief Executive Officer\n\nThank you, Jon. I want to take a moment to highlight that the Barings BDC board approved a number of promotions and recognition of the work done on behalf of Barings BDC shareholders. Effective September 1, I'll assume the title of executive chairman of Barings BDC. Jonathan Bock will become BDC's chief executive officer, Jonathan Lansberg will become the chief financial officer, and Elizabeth Murray will become the BDC's chief operating officer and remain the chief accounting officer.\n\nIan Fowler will remain president of Barings BDC. I share the board's confidence in the BDC's management team, and I'm very grateful for their leadership and dedication to the Barings BDC shareholders. With that, operator, we'll open the line for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Kyle Joseph with Jefferies. You may proceed with your question.\n\nKyle Joseph -- Jefferies -- Analyst\n\nHey. Good morning, guys. Thanks for taking my questions, and start with the congratulations to Bock, Lansberg, and Elizabeth on the promotions, before we dig into it. Let me start on -- so just obviously, volatility has increased -- two questions as we think about originations, should we think about a rotation toward cross-platform.\n\nAnd then in terms of the acquired portfolios, how does this impact your outlook for potential repayments there?\n\nJon Bock -- Chief Financial Officer\n\nI'll start with just -- you can expect to see the same level of cross-platform investment as you've seen in the past. And I think we've outlined about 30%, give or take, generally speaking, which is right around where we're at. And so in terms of additional velocity or prepayment velocity on either of those investments or importantly, the acquired investments, we're continuing to see an uptick. And the reason we're doing so is we're very active in repositioning ourselves out of a number of those loans.\n\nAnd so you saw that last quarter with roughly $57 million coming off of Sierra, and you can expect to see that in the future really as the performance of that portfolio has surpassed our expectations.\n\nKyle Joseph -- Jefferies -- Analyst\n\nGot it. And then just digging into credit a bit, obviously, with higher rates and higher debt servicing levels for companies and just really want to pick your brain given you guys almost have kind of for portfolios within your portfolio in terms of middle market, cross-platform, MDC and Sierra. But just give us a sense for the underlying trends of portfolio companies in terms of REV and EBITDA growth and margins that you're seeing across the board?\n\nJon Bock -- Chief Financial Officer\n\nI'll start with the two acquired portfolios, and then lobby over to lateral over to Ian as it relates to the all-in Barings originated portfolio. But generally speaking, our credit performance on the underlying acquired portfolios are still very attractive. What you will find though, is the added alignment that came from a result of the credit support agreement, which is unique to Barings, continues to give folks and more importantly, investors more confidence right, that not only do we have the patience and ability to work out those assets, but also the time frame and the proper shareholder protections to do so even in the face of a stagflation or stagnation environment. But Ian can speak directly to the Barings portfolio.\n\nIan Fowler -- President and Co-Head of Global Private Finance Group\n\nYes. So in terms of the portfolio, we've done a lot of proactive work in the last couple of quarters going through all of our portfolio companies which obviously includes the BDC complex, and really focused on wage inflation, rising rates and input cost inflation. And I think I mentioned this at the last earnings call, most of our portfolio, around 70% are more defensive service sectors, software, IT managed services, info services, financial services, professional services. So really not impacted by input cost inflation and where we do have manufacturing, it's more light niche high-margin manufacturing, more light assemblers versus heavy manufacturing.\n\nSo I feel very good about the portfolio, the way it's positioned. We still see revenue growth, a number just given the fundamental value of those businesses the strength of those businesses and the leadership in the industry of those businesses, they're able to pass through cost increases. Now there have been a few that have lagged in terms of putting through price increases, and we've seen a little margin degradation on those, but that would be a minority.\n\nOperator\n\nOur next question comes from the line of Finian O'Shea with Wells Fargo Securities. You may proceed with your question.\n\nFinian OShea -- Wells Fargo Securities -- Analyst\n\nHi, everyone. Good morning. Just a follow-up on part of Kyle's question there. Can you give us a sort of state of the union on the CSA for MVC.\n\nIs that above water? And can you remind us how that plays out for that to ultimately settle, if applicable?\n\nJon Bock -- Chief Financial Officer\n\nYes. Sure. So, Fin, if you were going to think about the present -- the future value of the payment, just given as we continue to work through one investment in specific, right, that would -- future value payment would be close to the $23 million of fully utilized CSA, if you were to liquidate everything at this moment, right? So that's where we'd be if you fast forward eight years and nothing changed. However, right, the reason you see a level of depreciation essentially on the credit support agreement is simply because as rates and discount rates have risen, that future value payments, right, discounted back to the present has a lower present value as a result of rising rates.\n\nAnd so on a go-forward basis, as we continue to manage a number of strong investments with attractive equity upside in addition to in managing existing investments there with both an eye toward exit and repositioning while also being good fiduciaries for our capital and for the trust you place in us. But we remain very confident that over time, we will exit without a high degree of credit support premium or credit support payment made. But in the future, that's really the math. If you were to kind of just stop today and assume nothing has had occurred, you'd be close to the $23 million fair value.\n\nBut then they discount that back to the present, which is why you see it down a little bit quarter over quarter.\n\nOperator\n\nOur next question comes from the line of Casey Alexander with Compass Point. You may proceed with your question.\n\nCasey Alexander -- Compass Point Research and Trading -- Analyst\n\nYes. Good morning, everybody. And let me throw in my congratulations on the personnel changes. I speak for the analytical community, I think we all take great comfort in knowing that we have now somebody highly qualified and capable in the CFO seat.\n\nSo just messing with you. Congratulations, Jon and Elizabeth. And, Jon, I think it's all very well deserved. I have a couple of questions.\n\nGoing to Slide 15. I noticed a new entry in that top 10, in core scientific. That is a name that's had some -- a number of articles written about it, has arranged for a $100 million equity line with an investment bank. Is that an equipment finance structure? Or is that a term loan structure? How is that particular one kind of set up just because it's one that's sort of been in the news?\n\nJon Bock -- Chief Financial Officer\n\nSure. I'll go with -- because I know we don't speak too much about individual portfolio companies, but what I try to outline is that structure is going to be an equipment financing. And as you're fairly familiar with the nexus of companies here, both that ourselves as well as our parent has a very large and successful equipment lessor and then that investment would have been done in partnership with that group. But tied to the underlying machines, right, at a strong amortization schedule and clearly a strong net return.\n\nCasey Alexander -- Compass Point Research and Trading -- Analyst\n\nThat's what I guess that it was going to be. Rolling up a couple to my favorite slide, Slide 13. If we look at the yield at fair value of investments of the four sleeves that you point to there, and this is really just a math question. Can you give us a sense of -- if you were talking about today where each of those sleeves yield at fair value would be by the end of the quarter, and I'm guessing cross-platform would have less movement than the other three in that it has more bespoke-type investments, many of -- some of which are more fixed rate in nature.\n\nJon Bock -- Chief Financial Officer\n\nBryan, perhaps on the cross-platform if you want to speak to the potential for yield increase as a result. The majority of what you'll focus on, right, there are quite a bit of floating rate components in the cross-platform investments. And then we can go to Ian as it relates to the fact that everything we do there has a floating rate and will also increase. But, Bryan, do you want to provide a little bit of color on those points?\n\nBryan High -- Head of U.S. Special Situations and Co-Portfolio Manager\n\nSure. I think on the traditional sort of debt instruments in the portfolio, a lot of them are floating rate. So you would see some increase there. But clearly, Eclipse is in that column.\n\nThat's a return on equity effectively. And there's -- if you think about their portfolio, the benefit of LIBOR floors is going away. So there's a lot of puts and takes there as what I would say, Casey. So I think you're right in that.\n\nThe other three columns are much more floating rate in nature just across the board. So they would probably move more so than the cross-platform as a whole. But I would say that still the majority of the investments on the cross-platform side are floating rate as well, just lower percentage.\n\nCasey Alexander -- Compass Point Research and Trading -- Analyst\n\nYou have some degree of -- on the three -- on the middle market, MVC and SIC sleeves, about how much you think they would move quarter over quarter?\n\nJon Bock -- Chief Financial Officer\n\nMVC wouldn't move much. As a result, there's a little bit of fixed rate -- more fixed rate exposure there. But granted, it's very small. Of course, on the Sierra portfolio predominantly floating rate, so you'd see that net benefit there.\n\nOperator\n\nOur next question comes from the line of Robert Dodd with Raymond James. You may proceed with your question.\n\nRobert Dodd -- Raymond James -- Analyst\n\nGood morning, everybody, and let me echo the congratulations everybody on the new positions. I think Eric might be the winner, if this means he doesn't have to deal with earnings calls as much anymore potentially. But moving on to a question about bit. So Sierra, I mean, as you said, I think it was $57 million in repayments this quarter.\n\nA fair chunk of that seems to have been a reduction not part to market in the size of their loan JV, i.e., there are a lot of repayments within that or sales within that. Can you give us any -- I mean it generated $1.6 million in dividend income. It's positively exposed to floating rates. But how fast do you expect to wind that down given -- again, it is a Sierra asset.\n\nOn the other hand, it's potentially got some decent prospects in the midterm.\n\nJon Bock -- Chief Financial Officer\n\nSo I'll start with that. First, the way the JV was effectively levered, it was less than efficient than what Barings was able to both put in place a structure with our lender partners. So you have the ability to effectively design a loan structure backed by all that collateral that made it much more efficient from a financing perspective to then effectively pull dollars out. In terms of the wind down, it will move fairly quick.\n\nAnd the reason why, Robert, is because our approach to joint venture investments is that they're here to expand the frame of reference and add to diversification, right? Just simply to buy liquid collateral and then over-lever in order to hope that it pays a better yield profile. That's really how we choose not to do things. And so you can expect it to move fairly rapidly tied to the collateral and us to continue to invest and then redeploy. Yes, it's generated an 8% -- 8%-plus-ish net return, which is great.\n\nBut if you start to look across the investment opportunity sets across Ian's business and Bryan's business, the yield and net return profiles are there higher with much less underlying price volatility\n\nRobert Dodd -- Raymond James -- Analyst\n\nUnderstood, and I am a big fan of the other cross-platform investments. and diversification, which brings me to those. If we look at Eclipse, I mean, obviously, it was marked down a little bit this quarter, but still a return on average equity just looking at the dividend, not internally to Eclipse, looks to be almost 10% at Thompson Rivers almost 15%. I mean some of these things are generating very high returns currently with potential floating rate benefit as well.\n\nI mean, are those kind of returns sustainable for those businesses, i.e., I mean, ex the Sierra dividend maybe, is the dividend income from those businesses sustainable to maybe ticking up? Or have they been benefiting from some onetime distributions in either Q1 or Q2?\n\nJon Bock -- Chief Financial Officer\n\nI'll take Eclipse here for a moment. So there, you have the benefit of when macroeconomic uncertainties increase. So two, do folks tend to hold loan outstandings. And so the growth of that book has been very, very strong because not only is the interest income high, it's because folks are holding their loans out longer.\n\nThe credit performance remains very, very good, and the ability for the Eclipse team in terms of their partnership with Bryan and the Cap Solutions team at Barings, their ability to partner and provide solutions on a number of bespoke transactions has only increased. And so I'd say you could bias returns higher, not only through both a rate benefit but also through an underlying growth benefit as -- when stresses occur, people turn to their assets to borrow. And so that's been very, very positive. Across the rest of the network, you're starting to find a much higher net return as a result of increasing base rates, which is what you would expect for us, right? We also have to compete with the substitutes of IG or increasing spread on liquid markets.\n\nAnd so we remain very positive looking forward on both interest income contribution from our private markets businesses and direct lending as well as the cross-platform and the joint ventures.\n\nOperator\n\nLadies and gentlemen, we have reached the end of today's question-and-answer session. I would like to turn this call back over to Mr. Eric Lloyd for closing remarks.\n\nEric Lloyd -- Chief Executive Officer\n\nThank you, operator, and thank you to all of you who participate on today's call. Like you, I'm very proud of the promotions that we put forth and what we've done in the last four years, and I'm confident the new management team will build on that with great success. Please stay safe, and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEric Lloyd -- Chief Executive Officer\n\nIan Fowler -- President and Co-Head of Global Private Finance Group\n\nJon Bock -- Chief Financial Officer\n\nKyle Joseph -- Jefferies -- Analyst\n\nFinian OShea -- Wells Fargo Securities -- Analyst\n\nCasey Alexander -- Compass Point Research and Trading -- Analyst\n\nBryan High -- Head of U.S. Special Situations and Co-Portfolio Manager\n\nRobert Dodd -- Raymond James -- Analyst\n\nMore BBDC analysis\n\nAll earnings call transcripts"
}