{
  "companyName": "Zscaler",
  "companyTicker": "ZS",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/09/zscaler-zs-q4-2022-earnings-call-transcript/",
  "content": "Zscaler (ZS 0.03%)\nQ4 2022 Earnings Call\nSep 08, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the Zscaler fourth quarter and fiscal year-end earnings conference call. [Operator instructions] As a reminder, today's conference call is being recorded. I will now turn the conference over to your host, Mr. Bill Choi, senior vice president of investor relations and strategic finance.\n\nSir, you may begin.\n\nBill Choi -- Senior Vice President, Investor Relations and Strategic Finance\n\nGood afternoon, everyone, and welcome to the Zscaler fiscal fourth quarter and full year 2022 earnings conference call. On the call with me today are Jay Chaudhry, chairman and CEO; and Remo Canessa, CFO. Please note that we have posted our earnings release and a supplemental financial schedule to our Investor Relations website. Unless otherwise noted, all numbers we talk about today will be on an adjusted non-GAAP basis.\n\nYou will find a reconciliation of GAAP to the non-GAAP financial measures in our earnings release. I'd like to remind you that today's discussion will contain forward-looking statements, including, but not limited to, the Company's anticipated future revenue, calculated billings, operating performance, gross margin, operating expenses, operating income, net income, free cash flow, dollar-based net retention rate, future hiring decisions, remaining performance obligations, income taxes, earnings per share, our objectives and outlook, our customer response to our products and our market share and market opportunity. These statements and other comments are not guarantees of future performance but rather are subject to risks and uncertainties, some of which are beyond our control. These forward-looking statements apply as of today, and you should not rely on them as representing our views in the future.\n\nWe undertake no obligation to update these statements after this call. For a more complete discussion of the risks and uncertainties, please see our filings with the SEC as well as in today's earnings release. I would also like to inform you that we'll be attending the following upcoming events in September: Goldman Sachs Communacopia and Technology Conference on September 13th, Mizuho Software Summit on September 28th. Now, I'll turn the call over to Jay.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nThank you, Bill. I am very pleased to share our strong Q4 results to end another outstanding year. In the quarter, we delivered 61% revenue growth and 57% billings growth, as customers continued to embrace our Zero Trust Exchange platform to secure their digital transformation. We are delivering this strong growth while generating strong profitability.\n\nOur free cash flow margin was 24%, which was a record for Q4. While many Public SaaS companies are happy to get to Rule-of-40, we surpassed the Rule of 80 for the quarter and for the full year. These outstanding results reflect the strong underlying unit economics of our business that has high-90% gross retention rate and over 80% gross margins. This is possible because of our differentiated service and purpose-built, multi-tenant cloud platform that scales efficiently.\n\nFor the full year, our revenue grew 62% to $1.1 billion and billings grew 59% to $1.5 billion. We are seeing revenue growth across all products, industry verticals, market segments and geographies. Our platform is securing over 34 million users for over 6,700 customers, and we're making great progress toward our goal of protecting 200 million users. To reach our goal, we will continue to invest aggressively in growing our business and driving innovation, while focusing on operational efficiencies to drive the bottom line.\n\nLet me share with you some of my observations and how we plan to manage through the uncertain macro environment in fiscal '23. First, my conversations with hundreds of IT executives confirm that cybersecurity remains the number one IT priority and a top Board level issue. Independent CIO surveys confirm Zero Trust security and SASE will continue to be a top priority. Zscaler's proxy-based cloud platform is the best solution for tackling sophisticated cybersecurity challenges.\n\nIn addition, the rise of hybrid work and the need for secure digital transformation are driving the demand for Zscaler. We believe periods of macro uncertainty can accelerate adoption of disruptive technologies like ours, which offer better security and user experience while substantially reducing cost and IT complexity. As the pioneer and recognized leader in Security Service Edge, we are well positioned to capture this ongoing market shift toward Zero Trust. Second, we address a $72 billion market, with significant new customer and upsell opportunities.\n\nOur superior architecture and proven experience delivering measurable outcomes at the CXO level, elevate us above the competitive noise. We drove 62% year-over-year growth in customers with greater than $1 million in ARR, ending with over 320 of these customers, including over 20 customers exceeding $5 million in ARR. We have a blueprint for delivering great value, which drives strong upsell for us. Approximately 60% of our new business comes from existing customers, and our net retention rate has again exceeded 125%, now for seven consecutive quarters.\n\nHappy customers buy more, and our net promoter score continues to exceed 70, which is more than two times the average NPS for SaaS companies. In addition, we expect our deep and wide platform together with our enviable customer base of large enterprises, to continue to drive upsells. As we have indicated before, we have a six times upsell opportunity with our existing customers just for our core ZIA and ZPA product pillars. Lastly, our consultative sales process plays a major role in our success and enables us to maintain a high level of engagement with our customers, especially at the C-level.\n\nAs part of this process, we produce CFO-ready business cases with ROI and payback periods calculated in collaboration with our customers. In Q4, as we saw more deals getting scrutinized, we delivered more of these business value assessments, which helped us close many large multi-year, multi-product pillar deals. We believe our adaptive sales process makes us resilient to changing business environment and will continue to drive our business. Looking forward, I am excited about fiscal '23 as we continue to win opportunities with new and existing customers.\n\nIncreasingly, customers are buying ZIA, ZPA, and ZDX together to deliver a complete Zero Trust solution for users. This accelerates our customers' transformation journey and makes us a critical partner for them. Let me discuss two such deals in Q4. In a new logo win, a Fortune 50 pharmaceutical company purchased ZIA, ZPA, and ZDX for all 145,000 employees.\n\nThis deal started with a regional need to improve security without compromising user experience in China. With multiple data centers in China covering various regions with premium connectivity options, Zscaler has superior zero trust access for multinationals out of China. Next, this customer engaged us for global M&A IT integration and hybrid work use cases. Impressed with these results, they accelerated their companywide zero trust adoption with us.\n\nThey disqualified their incumbent next-gen firewall vendor who had no referenceable customer at the required scale for its SASE cloud VPN product. This customer understands that a VPN, either as an appliance or hosted in the cloud under any name, is not zero trust and is the biggest security risk. This customer also purchased Zscaler for Workloads for 10,000 workloads to enable multi-cloud, app-to-app connectivity to support their M&A strategy. This was a three-year, eight-figure deal for all four pillars of our platform: ZIA, ZPA, ZDX and Zscaler for Workloads, or what we used to call Cloud Protection.\n\nWe closed this deal with AWS marketplace, which is becoming a larger channel for us. Next, one of our largest deals in the quarter came from a delighted Fortune 500 tech customer who deployed the entire Zscaler for Users offering including ZIA, ZPA, and ZDX. This provided fast and direct access for users working from anywhere to applications in the data center or in the cloud. With dramatic improvements in user experience, employees were buzzing about the change.\n\nOne employee slacked, and I quote, \"Every morning I log into my machine, I'm thankful for Zscaler.\" This customer doubled their seats to 120,000 users and extended the commitment for another three years. Their journey with us started with a small M&A IT integration use case, which quickly expanded into a companywide zero trust initiative. In less than two years, this customer's annual spend with Zscaler grew 13 times to well over $10 million. Next, from a product perspective, we saw strong performance across all pillars of our platform.\n\nOur core pillars, ZIA and ZPA, have never been stronger, and we are excited about the rapid adoption of our emerging products: ZDX to manage digital user experience, and Zscaler for Workloads to secure servers and workloads. Emerging products contributed 14% of our new business in fiscal '22, and we expect continued growth in fiscal '23. We continue to innovate rapidly and expand our platform. At our Zenith Live conference in June, we launched Posture Control for public clouds as a fully integrated solution that correlates vulnerabilities and risks across CSPM, CIEM, and Infrastructure as Code scanning.\n\nIn addition, we integrated our recently acquired deception technology into our platform and saw great adoption by our customers. This is an example of our highly targeted early stage acquisition strategy shortening our time to market for new innovations and expanding our market opportunity. Let me highlight three deals that were driven by our emerging products: We won a seven-figure ACV with a government agency in Australia for ZIA, ZPA, and ZDX, where ZDX accounted for approximately $1 million of the total ACV value. ZDX pinpoints and resolves performance issues in real-time by monitoring experience of every user, every network hop, and every application, regardless of their location.\n\nThe customer said ZDX is a must-have, as it delivered immediate value by reducing troubleshooting time and improving employee productivity. In a seven-figure ACV upsell win, a Fortune 50 insurance company purchased ZPA Transformation bundle for Zero Trust Access to implement user-to-app segmentation. This customer understands that if a user connects to the network with an on-prem or cloud VPN, that's not zero trust. With this latest purchase, they plan to replace their legacy network security, including VPN, Network Access Control or NAC, network-based segmentation, and VDI infrastructure.\n\nThey purchased Zscaler Deception to detect and intercept bad actors trying to infiltrate the network. Finally, a Global 500 financial services customer in APJ purchased Zscaler for Workloads for 36,000 workloads to complement their ZIA and ZPA services for users. With many apps running in AWS and Azure, they wanted to implement a Zero Trust architecture to prevent lateral threat movement and eliminate backhauling workload traffic through the data center for inspection. We reduced cost and complexity by eliminating the need for virtual firewalls and site-to-site VPN networks, while improving security and operational efficiency.\n\nNext, let me discuss the progress we are making in Federal vertical. We now have FedRAMP High authorization for ZIA, which together with ZPA, makes us the only cloud security service to have two products at the highest level of FedRAMP certification. In addition, ZPA is the only Zero Trust solution with DoD IL5 certification. These certifications are driving our federal business.\n\nIn Q4, we added over 25 new Federal customers and over half of them purchased ZIA and ZPA together. Now, we have landed 10 of the 15 Cabinet-level agencies as customers, with plenty of opportunities for upsell at these large organizations. I want to highlight one federal deal that I'm particularly excited about: We were awarded a five year, $46 million contract by a large cabinet agency with over 100,000 users. The value of this contract will be granted over time, based on deployment.\n\nAgainst this award, we received an initial low-seven-figure ACV task order for ZIA and ZPA. Next, let me comment on the increased leverage we're driving with our channel programs. We saw over 50% year-over-year growth in channel sourced-deal registrations. Working closely with our cloud-centric VAR partners, we are building momentum down-market in the Enterprise and Commercial segments, which is providing higher contribution to our new business.\n\nAt RSA conference, you heard a key partner, Optiv, talk about their plans to grow with us and further invest in Zscaler certifications for their consultants. I'm also excited about the opportunities we can unlock together with the global SIs that are building large Zero Trust and SASE transformation practices. Moving to cloud marketplaces, this channel is growing very well for us. We have made strategic investments in our collaboration with AWS and Azure, including deep technology integrations, co-selling opportunities and demand generation programs.\n\nIn Q4, our new business through cloud marketplaces grew nearly five times year over year. For example, we signed five greater-than-$1 million deals through the AWS marketplace, including two of our top five new and upsell deals of the quarter. Our strengthening Azure and AWS partnerships also give us access to their customers' sizable cloud budgets which can streamline the deal close process. I want to highlight another important area for our customers, their ESG goals.\n\nOur highly efficient cloud eliminates the need for on-prem appliances, which significantly decreases IT waste, energy usage, and carbon emissions. We are also committed to our own ESG goals. Since achieving 100% renewable energy last year, we are proud to be Carbon Neutral for calendar '22, covering relevant Scope 1, 2, and 3 categories, including travel, customer use, public cloud use, and procurement. I am excited to announce our goal to be Net Zero by 2025, joining our customers in a collective effort to transition to a low-carbon economy.\n\nIn closing, even with uncertain macro conditions, we continue to see favorable demand for our Zero Trust Exchange platform, which makes businesses more agile and competitive, simplifies IT, consolidates point products and reduces cost. We believe customers trust Zscaler more than any other provider for securing their cloud journey. We have grown our global team to approximately 5,000 employees who share a mission to secure the hyperconnected world of cloud and mobility. I am extremely proud of the strong growth and profitability we delivered in 2022.\n\nI want to thank our employees and our partners for their tireless efforts and commitment to our customers' success. We will continue to invest aggressively to delight our customers and capture the large opportunity ahead of us, while delivering operational excellence. Now, I'd like to turn over the call to Remo for our financial results.\n\nRemo Canessa -- Chief Financial Officer\n\nThank you, Jay. We are pleased with the results for the fourth quarter and full year. Revenue for the quarter was $318 million, up 61% year over year and up 11% sequentially. ZPA product revenue was approximately 19% of total revenue, growing 80% year over year.\n\nFrom a geographic perspective, we had broad strength across our three major regions: Americas represented 52% of revenue, EMEA was 33% and APJ was 15%. APJ continues to be our fastest growing region with revenue growth of 88% year over year. For the full year, revenue was $1.09 billion, up 62% year over year. This is an acceleration from the 56% growth we delivered in fiscal 2021.\n\nOur total calculated billings in Q4 grew 57% year over year to $520 million, with billing duration comparable to a year ago and slightly above the midpoint of our normal 10 to 14 months range. We saw strong growth in our top five verticals: finance, manufacturing, healthcare, technology and services. Our remaining performance obligations, or RPO, grew 68% from one year ago to $2.607 billion. The current RPO is 49% of the total RPO.\n\nAs a point of clarification, the total contract value of the five year, $46 million award from a U.S. Federal government agency that Jay mentioned is not included in our RPO. RPO for this contract will be recognized as the individual task orders are received, which are 12 months in term length as is typical for our federal customers. Moving on to our product pillars, for the full year, emerging products, which include ZDX and Zscaler for Workloads, or what we used to call Cloud Protection, met our targets and contributed 14% to our total new business.\n\nIncluding our new CNAPP and deception offerings in the Zscaler for Workloads pillar, we expect emerging products to contribute high-teens percentage of our total new business in fiscal 2023. ZPA was 27% of our total new business in fiscal 2022, and grew as a mix between the two core ZIA and ZPA pillars. We have a large opportunity with all our pillars, and we will continue to innovate and expand our portfolio to strengthen our leadership position in the Zero Trust security market. Our strong customer retention rate and our ability to upsell the broader platform have resulted in a high dollar-based net retention rate, which was again above 125% for the last seven quarters.\n\nWe have a strong base of large enterprise customers, which provides us with a significant opportunity to upsell our broader platform. We had 327 customers paying us more than $1 million annually, up 62% from 202 in the prior year. The continued strength in this metric speaks to our large enterprise focus and the strategic role we play in our customers' digital transformation initiatives. We added 198 customers in the quarter paying us more than $100,000 annually, ending the year at 2,089 such customers.\n\nExpanding our field engagement with smaller enterprises with 2,000 to 6,000 employees and the increased investments in our Summit Partner program are contributing to overall customer growth. Turning to the rest of our Q4 financial performance, total gross margin of 81.6% was up nearly one percentage point quarter over quarter and year over year. Our total operating expenses increased 8% sequentially and 60% year over year to $221 million. Operating margin was 12% and free cash flow margin was 24%.\n\nWe continue to expect data center capex to be around high-single-digit percent of revenue for the full year. We ended the quarter with over $1.73 billion in cash, cash equivalents, and short-term investments. Before providing our guidance, I would like to share a few thoughts about the framework for our business outlook in the current environment. Zscaler is operating from a position of strength.\n\nWe are entering this fiscal year with a record pipeline and a large set of customer opportunities. We have confidence in the durability of our business model, with very high contribution margins after the initial land, and proven ability to retain and upsell to our enterprise customer base. With customers increasingly adopting the broader platform with long-term commitments, we plan to continue to invest in capturing our large market opportunity. As Jay mentioned, there was more deal scrutiny at the end of Q4, which resulted in business being more backend loaded.\n\nWe think it's prudent to expect this higher level of review and scrutiny by our customers to continue given the uncertain macroeconomic outlook. While demand for the Zscaler platform remains very strong, if the business environment changes, our business model allows us to adapt quickly and to deliver on our operating profit and margin goals. In fiscal '23, in our guidance, we intend to deliver operating margin expansion of approximately 150 basis points. Now, moving on to guidance and modeling points.\n\nAs a reminder, these numbers are all non-GAAP which excludes stock-based compensation expenses and related payroll taxes, and amortization of intangible assets. For the first quarter of fiscal 2023, we expect revenue in the range of $339 million to $341 million, reflecting a year-over-year growth of 47% to 48%; gross margins of approximately 80%. I would like to remind investors that a number of our emerging products will initially have lower gross margins than our core products, because we are more focused on time-to-market and growth rather than optimizing them for gross margins. Operating profit in the range of $37 million to $38 million.\n\nNet other income of $5 million. Income taxes of $2.5 million. Earnings per share of approximately $0.26, assuming 155 million fully diluted shares. Please note that starting in fiscal 2023, we adopted the new accounting standard which requires the use of if-converted method for calculating EPS.\n\nTo account for our convertible notes, you will need to add back $360,000 in quarterly interest expense and include 7.63 million shares to the fully diluted share count. For the full-year fiscal 2023 we expect revenue in the range of $1.49 billion to $1.5 billion or year-over-year growth of approximately 37%; calculated billings in the range of $1.92 billion to $1.94 billion or year-over-year growth of 30% to 31%. While we don't normally guide to quarterly billings, I want to remind you that we will have a difficult year-over-year comparison in Q1. In the year-ago quarter, we had a one-off deal and multi-year invoices that resulted in billings duration at the high-end of our normal 10 to 14 months range.\n\nWith that in mind, we expect Q1 '23 billings to grow approximately mid-30% year over year. We also expect our first-half mix to be approximately 42% to 43% of our full-year billings guide, which is higher than the first-half mix in the last few years. Operating profit in the range of $173 million to $176 million. Income taxes of $14 million.\n\nEarnings per share in the range of $1.16 to $1.18, assuming approximately 157 million fully diluted shares. As noted earlier, to account for our convertible notes in EPS, you will need to add back $1.44 million in annual interest expense and include 7.63 million shares to the fully diluted share count. Let me conclude with comments on our investment framework. We will balance growth and profitability based on how our business is growing.\n\nIf we continue to have high growth, we will prioritize investing in the business. As we have discussed, if we are growing revenue faster than 30%, you can expect less than 300 basis points of margin expansion in the year. We remain confident of reaching 20% to 22% operating margins in the long term. With a huge market opportunity and customers increasingly adopting the broader platform, we're committed to investing aggressively in our company while balancing this with our operating profit goals.\n\nHowever, if we see a deteriorating global economic environment, we have the flexibility to place a higher priority on operating profitability. Operator, you may now open the call to questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Andrew Nowinski of Wells Fargo.\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nA lot of interesting data points, I guess, but I'll start with the big Fed deal. It doesn't sound like it contributed maybe any revenue in Q4 given that it's not in RPO yet, but wanted to clarify that. And I'd imagine a deal that size was likely competitive. So just wondering if you could discuss which vendors you beat in that deal.\n\nAnd then finally, given the upcoming fiscal year end with the Fed, how does the remaining pipeline in the Fed look this quarter given the strong results you just put up? Thanks.\n\nRemo Canessa -- Chief Financial Officer\n\nI'll take the first part, Andy. You're absolutely right. There's not much revenue in the quarter for that large deal. But your call-out also that it's not in the RPO is a great call-out also which is what we've been talking about with RPO growth, it's better for Zscaler to look at billings growth because an entire $46 million or most -- almost all that $46 million is not in RPO.\n\nNow, I'll turn it over to Jay.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nGood. So regarding the deal, the nature and competitiveness, you can imagine that almost all federal deals need to go through a very competitive offer process. And all the obvious names you would expect were all competing, all legacy vendors, network security firewalls and the like. They all competed for it.\n\nBut it was the architecture that won at the end of the day. So we are excited about it. But as you know, some of these federal deals take time. We do have 10 of the 15 cabinet-level agencies as our customers, and there's a lot of opportunity for us in the federal market.\n\nOperator\n\nOur next question comes from Brad Zelnick of Deutsche Bank.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\n[Inaudible] guys on a fantastic and unbelievable execution against a tough environment, which leads to my question. Jay, I think it's well understood that security and connectivity are essential nondiscretionary budget items for customers. But two related questions. One, it would seem in tougher times, it's more difficult to land new logo customers.\n\nAnd I'm curious if that's true for Zscaler and how you mitigate that. And just related, is there any shift that you're seeing in terms of where the budget is coming from for customers to fund their network and IT transformation initiatives? Thanks.\n\nRemo Canessa -- Chief Financial Officer\n\nThanks, Brad. It is true that it takes more time and effort than new logos, especially when your current customers are very happy and delighted. That's why our business is coming from what size, expansion and new logos. And what are we trying to do to get new logos in current market? I'll tell you one very exciting thing which is very unusual.\n\nA bit for -- for new logos for us is when CXOs who frequently move from company A to company B, they often call us. I mean, I can tell you I've personally seen probably well over 100 -- probably a few hundred tests. The CXOs went, they called us. And once they do, the discussion -- the conversation goes a lot faster.\n\nIn addition, we are doing a lot of demand gen program. A lot of demand-gen programs are doing to help our channel partners and the like are largely focused on new logos because we want to do both, new logos as well as upsell. Both are important for us. Second probably your question is where the budget is coming from to fund.\n\nYes, we are driving transformation, but the nature of our transformation has been changing. First of all, before COVID, network transformation used to be a big problem. COVID killed all of that discussion and said the Internet is the corporate network. So network transformation evangelist has gone away.\n\nIt's mainstream that you should be able to go and work for many do. Now, where is the budget coming from? Number one thing CIOs and CFOs are asking now is, please help me eliminate a lot of point products. Help me save money. So cost reduction by elimination is a big thing and especially a platform for wireline Zscaler, which can eliminate lots of products.\n\nWe actually end up showing good ROI and in the process of getting a bigger budget sale. That's one part. The second part is, I highlighted in my prepared remarks that marketplace banks are helping us. Some of these large deals are actually coming out of our hyperscaler budgets because their revenues already commit for them.\n\nAnd it is true that customers are asking for better business value and quantification, and that's what we're doing with a very mature business value process. That's why you've seen us do very well in spite of increased group.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nFantastic. Thank you so much. And congrats again, guys.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nThank you.\n\nRemo Canessa -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Alex Henderson.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nI think back at your Zenith Live event, you talked about conditions such that, yes, there may be some stretching of duration. But that, in turn, is resulting in a higher adoption rate, mainly because you're able to help them lower cost and lower the amount of employees they need to run their operations as well as eliminating the point products. So as the conditions have tightened further over the last month and a half, have you seen an increased win rates and some larger deal sizes as a result of that ability to help companies significantly diminish their staffing and cost requirements?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nWe have actually many, many customers who have publicly stated in our conferences that the number of resources needed to one, operate Zscaler service is much sold. Often it's kind of -- fit all what it takes to run appliance companies, firewall companies and the like. So that's part of the operational cost that you talk about. There are four pieces of cost that customer looks at from reduction from Zscaler.\n\nOperational is obviously one part of it. Cost savings from elimination of point products is an important area. You won't believe so many security products are sitting at any large enterprises. And one CISO called it appliance for peak.\n\nOur third area is improved business productivity, which is linked to user experience. It is interesting as users are working from everywhere accessing very critical information out in the cloud, users are very, how should I say, intolerant of any slowness and store experience. And fourth thing is risk reduction. It's hard to quantify risk, but our customers are looking and saying, \"What's the cost of breach? What's the cost of downtime and the like?\" So we have always had a good business value assessment process.\n\nIt has short book. And also when we work the C level and the C level becomes sponsor of the process, it helps us show them savings and it helps us get our deal done.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nThe question, just to be clear, was, has there been a change in that environment that has then amplified the benefit of those four factors?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. Probably the direct answer would be, it is more and more need to do a strong assessment, quantification and commitment to delivering those results. Absolutely, yes.\n\nOperator\n\nOur next question comes from Joel Fishbein of Truist.\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nCongrats on the great execution. Remo, just two -- one question, two parts. Great outperformance on the gross margin side of the business. Want to understand what the drivers of leverage going forward will be? I know you gave us some -- a little bit of color on FY23.\n\nAnd then also $1.7 billion in cash, what do you -- what's the best use of cash at this point in the evolution?\n\nRemo Canessa -- Chief Financial Officer\n\nI mean, good questions. So the outperformance in gross margins in Q4, we did 81.6%. Basically, it's the efficiency that we've created with our software authorization and just overall lower cost, bandwidth cost, colo cost, depreciation as well as the outperformance on the top line. Those are the primary reasons.\n\nKey thing to recognize with our gross margin, we have the ability to come out with applications faster by putting basically applications in public cloud. We will continue to do that. Again, from our perspective, we are going to deliver the best products as quickly as we can to our customers. In our gross margin, we expect in fiscal '23 and also the midterm is 80%.\n\nFrom a long-term perspective, we expect gross margins between 78% and 82%. So as long as we're within that bound, it just gives tremendous flexibility from a modeling perspective for Zscaler because we have such high gross margins with high growth to invest in the business. From a perspective of the $1.7 billion in cash, really no plans for that. It will be used for strategic purposes.\n\nWe clearly don't need it for working capital as our free cash flow last year was significant. And also from a free cash flow perspective in fiscal '23, I'd expect free cash flow margin to be 20% or above. So really just for strategic purposes is that cash.\n\nOperator\n\nOur next question comes from John DiFucci of Guggenheim.\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nMy question is sort of a high-level question, and it goes back to Brad's a little bit. And it's on the macro environment, which no one really escapes. And it's good to hear you acknowledge it, even though you really don't see it in your financial results. Your new ACV per our calculations accelerated against a more difficult comp, and your guidance implies some confidence in the future, right? So -- but you kind of talked about how you think about the macro softness and why it's not affecting your business right now.\n\nBut I think this is probably for Remo. How did you think about it, or how is it implied in your annual guidance, if at all, like any -- the softness or whether it can get worse? Other than -- I mean you did mention businesses being more back-end loaded and that was sort of assumed, but you've closed it anyway. It's just back-end loaded. Is there any other color you can give us on that?\n\nRemo Canessa -- Chief Financial Officer\n\nNo. I mean, I think it's a great question. I think it's one of the key questions, and thank you for asking it. We did see higher deal scrutiny in Q4.\n\nSo that played into our guidance. And that higher deal scrutiny related mostly to large, multiyear, multi-product pillar-type deals. As you mentioned, John, not a significant impact on our business. And from our perspective, when we took a look at our guidance, many customers have not put their budgets in place for calendar '23.\n\nThat will happen in a few months or a couple of quarters. So that does create a level of uncertainty in the second half of our fiscal '23. So we took a look at all those factors in consideration when we did our guidance, and that is the reason that we guided for a higher contribution in the first half of our billings, between 42% and 43%. And that compares to last year, which was 41.5%.\n\nSo a lot of thought went into the guidance. We feel it's prudent. And also again, we're recognizing that the second half of our fiscal year, there's -- we don't have as good a visibility. And that's why we have better visibility in the first half.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nAnd if I may add on two things. I may ask two things we've done to make sure we do a good job. One is we are working more closely with our customers to identify what needs to go, what needs to change from a savings point of view. We are a lot more focused on helping customers save money because CIO is asking us, what can you do to save money? I have a lot of legacy debt products, please help.\n\nSo our sales process is focused more on that than it used to be before. That's one point. And the second, we alluded to it, but the business value assessment needs to be much sharper now than it used to be.\n\nOperator\n\nOur next question comes from Roger Boyd of UBS.\n\nRoger Boyd -- UBS -- Analyst\n\nJust to touch on the cloud marketplaces, it seems for a couple of quarters now you've highlighted the momentum with AWS and Azure, but five times growth really stuck up this quarter. Any sense for how big of a channel that is for Zscaler today and how big that could get given it seems like a win-win for customers, VARs and ISVs like yourself? Thanks.\n\nRemo Canessa -- Chief Financial Officer\n\nYes. I'll start then I'll have Jay. It's still relatively early. It's still relatively a small part of our business.\n\nBut the cloud marketplace is increasing, and we do see it as a very important and strategic basically channel for us. So with that, I'll turn it over to Jay.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. It becomes a new channel of revenue for us. Over the -- let me put this way. In the past three years, it has gone from nothing to pretty significant.\n\nThat's why from a small base, the numbers are looking big. But those big providers are now working with us and co-selling to considerate net new pipeline for us. That's good. The other part that's helping us, it's kind of interesting is some of these budgets are committed for hyperscalers on an annual basis.\n\nAnd our solutions qualify to become after those budgets. That becomes one more justification with a little bit easier budget approval becomes one more area for us. We are dedicating resources. We are making investment in this channel to become bigger.\n\nOperator\n\nOur next question comes from Mike Walkley of CGF.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nThank you very much. And congratulations on the strong results. Jay, I just wanted to get your thoughts, just given the economic uncertainty and increased deal scrutiny, given Zscaler's value proposition, why wouldn't this year be a year you even accelerate share gains in the market? Or alternatively, are you just seeing customers, given the uncertainty, just tighten budgets and sticking with what they currently have?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nI mean, that's what I tell Remo. Come on, let's be more aggressive. Remo, go ahead.\n\nRemo Canessa -- Chief Financial Officer\n\nIt's a great question. We'll have to wait and see. I mean, you've got our guidance. When we give guidance, we would like to be prudent.\n\nHowever, when -- again, from my perspective, and you take a look at Zscaler, it was purpose-built for this world. The highest level of security, proxy-based, going down to SSL traffic. As Jay talked about, lower complexity. The number of security professionals in the world, there's a major need for it.\n\nAnd that's going to get worse, then lower cost. Again, we like to do our guidance, we like to be prudent, and we'll see how things play through. But I don't see any other -- well, I shouldn't say -- we are well positioned. Let's just say that we're well positioned as a company.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. That's what I would say. I mean certain hard times obviously require a lot extra effort to make things happen. I would say with all the great things that are positioning us well, I expect us to do far better than first to the vendors out there.\n\nOperator\n\nOur next question comes from Hamza Fodderwala of Morgan Stanley.\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nJay, we've obviously had a lot of change over the last couple of years in terms of the nature of work and IT. But to me, it seems like security architectures still haven't fully caught up to that, and there's still a lot of technical debt. I'm curious, when Zscaler does come in and do some of these transformational deals, is there more pressure for CIOs and CISOs to want to replace existing solutions? And who do you -- who are you or what technologies are you seeing yourself replace more often these days as we are entering into a more hybrid world going forward?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nIt's a very good question. So if you think about our big product portfolio with ZIA and ZPA, we are essentially replacing all branch kind of devices or any of the firewall proxies and the like calculate it the first wave of the replacement out there. Number two, with ZPA, we are beginning to replace. Obviously, the VPN was a starting point.\n\nBut think of the entire inbound DMZ that many customers have to deploy. That's the second point. So branch finals, branch proxies, all this stuff is number one. The cloud workload, with the announcement of the new solutions we have done with Zscaler for Workloads where zero trust is being brought to the cloud, and this is relatively new -- in the past eight or nine months.\n\nWe have now quite a few customers who have no firewalls in the cloud. So typically, they buy a bunch of virtual firewalls in the cloud. We see, we like -- we think our customers will be firewall-free in the cloud. The third part is data sector.\n\nThat's the slowest moving part. The data center, DMZ, all these boxes are very complicated. And we actually don't like to go and fight in that area because that area is kind of pretty clumsy and cluttered, and data centers are shrinking over time. I would rather put my focus on where the park is headed rather than the park is.\n\nSo that's where we see a number of customers buying firewalls for data centers and the like because there's also a little bit of demand coming from the corporate side of it. But all the branches replace almost everything out there. Public cloud, early stage with very promising signs. And data center, we'll leave it alone for a while.\n\nDid I answer your question?\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nThat's helpful. Thank you.\n\nOperator\n\nThank you. Our next question comes from Josh Tilton of Wolfe Research.\n\nJosh Tilton -- Wolfe Research -- Analyst\n\nI'll echo my congratulations on the quarter. You guys obviously gave operating margin guidance for next year. Are there any guardrails you can provide us and how we should think about maybe the delta between the operating margin and the free cash flow margin for the full year?\n\nRemo Canessa -- Chief Financial Officer\n\nYes. I mean, when you take a look at the last two years, our free cash flow has been above 20%. When you take a look at our guidance that we gave for fiscal '23, it's the same. Basically, it should follow what have done in the last two years being over 20%.\n\nThe value that Zscaler has, we're a very efficient company. Take a look at our cloud. Typically, our cloud capital expenditure or expenses are high single digits in any one quarter, which is relatively low. Our high gross margins, just our overall operating profitability.\n\nThe key thing also with the -- our cash flow is that we typically bill annually. So our billing range is between 10 and 14 months. So it's just -- we're just in a really good position. It's a very efficient model.\n\nAnd again, looking at the last two years, I wouldn't expect anything different from a free cash flow margin perspective. And I would expect things to be similar, higher than 20%.\n\nOperator\n\nOur next question comes from Gregg Moskowitz of Mizuho Group.\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nCongrats on ZIA's FedRAMP authorization. Given that you're clearly already seeing a lot of momentum in your federal business, Jay, maybe you could expand on what having dual FedRAMP high authority will add to Zscaler incrementally. And then for Remo, it's interesting to me that your headcount growth actually accelerated in fiscal '22 to 58%, especially since you grew a robust mid-50s in the prior year. Given the macro uncertainty, how are you thinking about hiring growth over the next six, 12 months? Thank you.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nI will start. We did good results in Q4. We are expecting good and healthy results for federal business in Q1. But we do know that federal business takes time.\n\nIt has taken us years to get the very high-level certification coming, probably more painful than any other certification I've seen, but they're good ones. So they are positioning us well. But on the certification still is on us with smaller deal, and there's a lot of opportunity to expand. For example, 10 of the 15 cabinet-level agencies we talked about, they have -- mostly, they've started small, plan give opportunity for us to expand.\n\nSo we are investing in these sources. Our pipeline is growing, and we have high expectations for our Fed business.\n\nRemo Canessa -- Chief Financial Officer\n\nFrom a headcount perspective, Gregg, you're absolutely right. It was a great year for us. It hit expansion in fiscal '22. What we talked about, we are excited about the opportunity.\n\nWe feel the best interest for everyone to continue to prioritize growth but being mindful of operating profitability. We plan to continue to still prioritize growth going forward. But because of the leverage in our model, we're able to deliver -- we're planning to deliver 150 basis points, basically margin expansion. The reason for that that we're able to do that is that SaaS model with ratable revenue with the ARR balance, you've got pretty good visibility coming into the year.\n\nWhen you couple that with the high gross margins at 80%-plus, it just makes it a very attractive model for us to really manage our business. Right now, where we're at, we feel we have the right product at the right time, which addresses a significant need for our customers. We plan to invest across the board in the company. We're going to be investing in go-to-market, R&D and our cloud to really help customers navigate through this difficult time where they can lower their cost increase their security and basically decrease their complexity.\n\nSo from my perspective, we will continue to prioritize growth and we will continue to hire. So that is our plan for fiscal '23.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nRemo, if I may add, just to comment. We did well last year. We ought to be hiring this year. We have become the top destination for comments.\n\nI mean in R&D and in sales, we're probably the best organization to go. Six to nine months ago, some of these start-ups that are funded like nothing out there, they're all trying to hire people, they're all laying people off, and we are investing heavily in it. And by that way, we hired Brendan Castle, our new chief people officer. He comes from Google with a deep expertise in scaling talent acquisition and development.\n\nSo very, very excited and bullish about the business opportunity.\n\nOperator\n\nOur next question comes from Shaul Eyal of Cowen.\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nGuys, congrats on the ongoing strong performance and guidance. A question for either Remo or Jay. So clearly, Jay, as you've indicated, you're showing great ROI for your customers. I want to actually focus on your ARPU trends.\n\nMaybe can you provide us with some color on recent ARPU trends? Are they on par with recent quarters? Have they been moving up in recent months? Have you instituted any pricing increase over the course of the past few months? Thanks for that.\n\nRemo Canessa -- Chief Financial Officer\n\nYes. I'll take that. ARPU has been increasing on a year-over-year basis. Our ARPU has increased 20%.\n\nRelated to price increases, we typically do it on an annual basis. And really, it's related to additional applications and bundling. And with that, prices do go up, but they go up probably in the mid-single-digit-type range, nothing really significant, but it relates to additional applications and bundling. But that's typically done on an annual basis.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. We haven't done anything just like some of the hardware vendors you saw recently, they talked about as a deadline of price. You kind of give the order before that. We have no deadline.\n\nSo not of that -- any of the pricing type of stuff got pulled into our business in Q3.\n\nOperator\n\nOur next question comes from Keith Bachman of BMO.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nThe question is, how are you thinking about mix in particular? And what I mean by that is, I think, Jay, you said about 60% of your new biz is from existing customers. Do you see that changing as perhaps new logos get more challenging? And/or do you see a different composition associated with the solution set, meaning VPN replacement has been a really strong business for the last couple of years. Is there any saturation there? Just any comments on how we should be thinking about mix. And finally, within the guidance, I also wanted to ask, Remo, you mentioned visibility is lower in the second half of the year, which I think is completely understandable.\n\nBut did you take a heavier cut, so to speak, or a more prudent approach, shall we say, versus what you're seeing in the current macro environment as you thought about the second half of that guidance?\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nI'll start, Keith. By the way, regarding a mix, I think the 60% I said is upsell, 40% is new. It's not the other way around. So with that, we are [Inaudible].\n\nNow historically, we've grown our enterprise business very well. The large enterprise will come from there. As our business is getting bigger, our customer base is getting bigger. So upsell is getting bigger.\n\nBecause the platform is bigger, more customers to sell to, the bigger platforms to sell to is naturally increasing our upsell percentage of the total business we're doing. And you'll see both, upside and new large customers. When it comes to lower end of the market that's relatively newer for us. We are largely focused on getting new logos in that market.\n\nOur demand gen channel programs are helping us to get more logos there. And our channel partners, sorry, are helping us with logo there. So I think you'll see a combination. But Remo, you probably can give a little normal guidance, but I expect our upsell to go higher over time because our customer base is growing.\n\nRemo Canessa -- Chief Financial Officer\n\nAbsolutely, Jay. I think the upsell will go above the 60%, which it was this past year, just for the reasons Jay mentioned. We've got 6,700 customers. And when you take a look at -- we've talked about a six times opportunity to sell just the ZIA and ZPA at our last Analyst Day.\n\nThat does not include workloads. So another part of our business. So significant opportunity to upsell to customers. Related to -- consideration related to second half, yes, that's why we gave the first half contribution of our total billings being at the midpoint, 42.5% versus 41.5%, which we had last year.\n\nSo again, we're saying of our total guide of the 30%, 31% billings growth year over year, we expect to see 42% of that in the first half this year versus 41.5% last year. That's how we took it into account.\n\nOperator\n\nOur next question comes from Phil Winslow of Credit Suisse.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nCongrats on another great quarter. I mean, obviously, the sales productivity metrics that we can follow from the outside looking remain super strong. I wonder if you could give us just more color on sort of what you're seeing there, particularly in terms of the time to ramp new reps, their productivity metrics. And as you think about just the forward guidance, obviously, you're talking about continuing to lean in on the go-to-market in terms of headcount.\n\nBut when you think about what's implied in terms of guidance, what sort of productivity levels relative to what we have been seeing are baked in there?\n\nRemo Canessa -- Chief Financial Officer\n\nSo time to ramp is faster. I mean there's no doubt. And that's basically -- the market is more mature as well as our sales operation, our sales enablement group. We have an absolutely outstanding sales enablement group, which gets our sales reps basically trained very quickly.\n\nIn addition to that, the channel -- as Jay talked about, the contribution of the channels of the marketplace, the cloud marketplace also all those things basically are helping for these sales reps to ramp faster. Related to what's embedded in the guidance for fiscal '23 for sales rep productivity, we're expecting sales rep productivity to be flattish to down. The reason for that is basically, again, we talked about, we're still going to prioritize growth over operating profitability. But even with flattish to down sales productivity, we can still bring in about 150 basis points of operating margin expansion year over year, which is what our guidance is.\n\nAgain, the model we have with the high gross margin and the high top-line growth gives us the flexibility to what we feel we can do to make the right decisions to really capture this market.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nYes. And if I may add, I think I understand the importance of operating profitability, especially in today's market. We'll definitely be mindful of that. Remo said more balanced growth and profitability.\n\nOperator\n\nThank you. This does conclude our conference. I'd like to turn the call back over to Jay Chaudhry for any closing remarks.\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nThank you for your continued interest in the period. I hope to see many of you at the upcoming sell-side events. Goodbye.\n\nRemo Canessa -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBill Choi -- Senior Vice President, Investor Relations and Strategic Finance\n\nJay Chaudhry -- Founder, Chairman, and Chief Executive Officer\n\nRemo Canessa -- Chief Financial Officer\n\nAndrew Nowinski -- Wells Fargo Securities -- Analyst\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nAlex Henderson -- Needham and Company -- Analyst\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nJohn DiFucci -- Guggenheim Partners -- Analyst\n\nRoger Boyd -- UBS -- Analyst\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nJosh Tilton -- Wolfe Research -- Analyst\n\nGregg Moskowitz -- Mizuho Securities -- Analyst\n\nShaul Eyal -- Cowen and Company -- Analyst\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nMore ZS analysis\n\nAll earnings call transcripts"
}