{
  "companyName": "Williams-Sonoma",
  "companyTicker": "WSM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/williams-sonoma-wsm-q3-2022-earnings-call-transcri/",
  "content": "Williams-Sonoma (WSM -1.40%)\nQ3 2022 Earnings Call\nNov 17, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the Williams-Sonoma third quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow at the conclusion of the prepared remarks. I would now like to turn the call over to Jeremy Brooks, chief accounting officer and head of investor relations.\n\nPlease go ahead.\n\nJeremy Brooks -- Chief Accounting Officer and Head of Investor Relations\n\nGood afternoon, and thank you for joining our third quarter earnings call. I'd like to remind you that during the call, we will make forward-looking statements with respect to future events and financial performance, including guidance for fiscal '22. We believe these statements reflect our best estimates. However, we cannot make any assurances that these statements will materialize, and actual results may differ significantly from our expectations.\n\nThe company undertakes no obligation to publicly update or revise any of these statements to reflect events or circumstances that may arise after today's call. Additionally, we will refer to certain non-GAAP financial measures. These measures should not be considered replacements for and should be read together with our GAAP results. A reconciliation of non-GAAP measures to the most directly comparable GAAP measure appears on exhibit one to the press release we issued earlier today.\n\nThe call should also be considered in conjunction with our filings with the SEC. Finally, a replay will be available on our investor relations website. Now, I'd like to turn the call over to Laura Alber, our president and chief executive officer.\n\nLaura Alber -- President and Chief Executive Officer\n\nThank you, Jeremy, and good afternoon, everyone. We are proud of another strong quarter, generating an 8.1% comp or 25% on a two-year basis and 50% comp growth on a three-year basis, with record EPS growth of 12% over last year to $3.72 per share. These results reflect the continuation of backlog order fulfillment, strong product margins, and disciplined cost control. Demand comps for the quarter were slightly negative.\n\nThis continued outperformance reflects the unique strength of our multibrand portfolio, our growth initiatives, and ongoing execution of our talented team. Since we last spoke, the macro backdrop has become more uncertain. However, what has not changed is the large and fragmented space in which we operate, where no one player owns significant market share. We believe we have an ability to capture more of this market in any environment.\n\nWe have and will continue to deliver results, leveraging our key differentiators, our in-house design, our digital first but not digital-only capabilities, and our value. These competitive advantages in combination with our growth strategies give us many opportunities for the future. As we talked about before, one of our largest is B2B, which had another excellent quarter, driving over $30 million in demand, a 17% increase to last year. We continue to believe our B2B business presents a sizable growth driver for us as it disrupts an underserved estimated $80 billion total addressable market.\n\nB2B is building velocity with large and repeat projects from commercial and hospitality partners like Marriott and Hilton. We are also focused on diversifying into new industry verticals, including the healthcare space through multiproperty partnerships with national accounts. In September, we successfully launched our improved corporate gifting and custom merchandise services, and we are encouraged by the early success leading into the holiday season. A key B2B customer of ours for over three years now in Starbucks.\n\nWe are thrilled to publicly announce that our team was able to assist Starbucks with the build-out of the gorgeous three-story flagship reserve store in the Empire State Building. In addition to incorporating furniture from Brooklyn-based West Elm, our B2B team had the opportunity to work with Starbucks to create custom furniture solutions to meet their unique needs. We look forward to growing our existing relationship with Starbucks. And now I'd like to talk about our global business where we continue to expand in key markets and grow our multichannel presence.\n\nIn Q3, we saw strength in both franchise and company owned. In the franchise business, we believe that one of our biggest opportunities is in India. And after launching our website earlier this year, we opened our first Pottery Barn store in New Delhi, joining our West Elm stores in New Delhi and Mumbai. We plan to continue to focus on in India and in early 2023, will be adding stores across our brands and continuing to improve our online experience with our great partner, the Reliance Group.\n\nIn our company-owned business, I want to highlight Canada where we successfully relaunched our website this year across all the brands, driving order fulfillment and improved omni experience. Another important initiative is sustainability for which we continue to be recognized for our impact initiatives and ESG leadership across the home furnishing industry. In Q3, we were named a top score on sustainable furnishings counsel wood furniture scorecard for the fifth consecutive year, and West Elm received the Ford Stewardship Council Leadership Award for its use of FSC-certified wood. We recognize there is much more work to do in this space, and we are committed to continuing to be a leader in planet, people, and purpose.\n\nOne of our sustainability initiatives is our goal to plant 6 million trees across our family of brands in partnership with the Arbor Day Foundation. We are excited to report that we have planted over 2 million trees to date. Now let's turn to the performance of our brands. Pottery Barn delivered yet another very strong quarter with a 19.6% comp or 35.5% on a two-year stack and almost 60% on a three-year stack.\n\nPottery Barn continues to perform, offering exclusive high-quality inspirational products, and strategic growth areas like apartment, marketplace, and bath reno are driving results.  We're particularly proud of our accessible home collection, which launched in late July and has quickly scaled. West Elm delivered a 4.2% comp in the third quarter or 26.6% on a two-year stack and 48.4% on a three-year basis. During the quarter, we improved our in-stock inventory position, and we expect to continue to make improvements in our service levels into Q4 and next year. We are also very focused on improving our e-commerce experience and customer-facing conversion-driving initiatives.\n\nI've had the opportunity to spend a lot of time with West Elm this quarter, and I am very impressed with the talented and passionate team running the brand. Our greatest opportunity at West Elm is doubling down on what has made this brand great, our commitment to design innovation, and value price points. Now, I'd like to update you on the Pottery Barn children's home furnishings business, which ran a negative 4.8% comp in Q3 but a positive 12.1% on a two-year basis and a positive 35.9% on a three-year basis. We continue to see ongoing recovery in our in-stocks.\n\nAnd looking to the future, we have a strong pipeline of products at compelling values. The Williams-Sonoma brand ran a negative 1.5% comp in Q3, but a positive 6.1% on a two-year and a positive 36.5% on a three-year basis. We continue to see that people are hosting and entertaining at home. And as such, we saw strength in entertaining areas.\n\nIn Q3, we successfully kicked off the holiday season with our exclusive collaboration with celebrity chef and author, Ina Garten. As part of this collaboration, Ina shared Thanksgiving tips for cooking and hosting the ultimate Thanksgiving dinner party. We also announced the exciting launch of a collaboration with renowned British heritage textile brand, William Morrison Company. Williams-Sonoma Home delivered another double-digit comp in Q3.\n\nWe continue to see this business as an opportunity to deliver outsized growth by picking up market share from the limited luxury high-end home market. We're excited to launch an expanded furnishing line for the kitchen in Q4. As we look to the holiday season, we are prepared to meet the needs of our gift-giving customers with compelling product offerings. Our stores are a competitive advantage, and they are stocked, and our associates are ready to serve our customers.\n\nAnd finally, our emerging brands, including Rejuv and Mark and Graham, together, they ran a 7.8% comp this quarter. At Rejuvenation, we saw success in remodel categories related to kitchen and bathroom, including vanities, cabinet hardware, and wall widening. And at Mark and Graham, wins were from the travel category, including luggage and travel accessories. We are proud of our third quarter results.\n\nbut we are also aware that economic uncertainty is on the minds of consumers and investors alike. During the third quarter, we experienced deceleration and choppiness in our demand, and it is hard to know where the economy is going or how long the uncertainty will last. Nonetheless, we are controlling what we can control and looking at opportunities to reduce costs without an impact to the customer experience. In fact, we believe that protecting service and innovation is key to outperforming our peers.\n\nAs it relates to pricing, we continue to be committed to not running sitewide promotions as we did before the pandemic, but we will continue to mark down and clear overstocks. We are working with our vendors to reduce costs and pass on that value strategically to our customers. As for additional expenses, out of market and redundant shipping expenses and transportation costs have negatively impacted our gross margin. We continue to focus on these pressures and mitigation of these costs will be a significant benefit for us in the future, particularly in the second half of next year.\n\nIn summary, we are conscious that the home furnishings market may contract due to macro factors. If this happens, we believe we are uniquely positioned to take market share even if there is a downturn, and here's why. We built a company of loved brands with a shared platform of competitive differentiators that leads the industry, in-house design, digital first but not digital-only platform, and our value. We have identified opportunities for growth through strategic initiatives like B2B, global end marketplace where we have the opportunity to disrupt.\n\nAnd finally, we have a culture of innovation and an experienced team who knows how to increase operational efficiencies and control costs while protecting service and driving new growth opportunities. Now, I will turn it over to Jeff to walk you through the results in more detail in his first earnings call as CFO.\n\nJeff Howie -- Chief Financial Officer\n\nThank you, Laura, and hello, everyone. I am so pleased to join you today for my first earnings call in my new role as chief financial officer. While I'm relatively new to this particular role, I'm a 20-year member of the Williams-Sonoma leadership team. I come into this role with deep knowledge and experience across our brands, operations, and financials.\n\nI look forward to applying my breadth and depth of experience to drive continued strong results. Diving into our third quarter results. We delivered another quarter of record revenues and earnings in a challenging environment. Our top-line results illustrate our ability to gain market share.\n\nOur bottom-line results demonstrate the power of our operating model to sustain merchandise margins and control SG&A expenses. Net revenues grew to $2.2 billion, with comparable brand revenue growth at 8.1% for a two-year comp of 25% and a three-year comp of almost 50%. Our revenue growth was driven by strong order fulfillment, ongoing momentum in our growth initiatives, and our continued ability to take market share, even as we experienced inconsistent demand within our portfolio of brands and across the quarter. Both channels continued to experience strong growth, with retail at a 16.9% comp and e-commerce at a 4.4% comp.\n\nMoving down the income statement. Gross margin was 41.5%, 220 basis points below last year and in line with our expectations. We sustained strong merchandise margins that were flat year over year. We remain committed to our decision to no longer offer sitewide promotions and preserve the pricing integrity our proprietary, differentiated product commands.\n\nThe strength of these merchandise margins is particularly impressive given we absorbed significant cost increases from our vendors and ocean carriers, including higher demurrage and detention charges. As expected, the gross margin decline was driven by higher outbound shipping costs. This is due to our increased furniture mix, higher back-order fulfillment, and incremental freight costs. We also incurred higher costs to best serve our customers by shipping from out-of-market distribution centers and in some cases, shipping multiple times for multiunit orders, which typically would have been fulfilled in a single shipment.\n\nOccupancy costs at 9.2% of net revenues were 30 basis points above last year, with occupancy dollars increasing 10.5% to approximately $202 million. Our ongoing retail store optimization initiative partially offset incremental costs from our new distribution centers on both the East and West Coast. These new distribution centers will support our long-term growth, improve service time for our customers and drive cost efficiencies over time. Our SG&A rate continues to be at historic lows at 26%, leveraging 150 basis points over last year, driven by advertising and employment leverage.\n\nOur advertising leverage reflects the agile, performance-driven proficiency of our marketing team, our in-house capabilities, first-party data, and multibrand platform allow us to test, learn and scale, which is a unique competitive advantage. Our SG&A leverage also reflects our culture of financial discipline, where we consistently challenge all expenses for return on investment and drive operational efficiency throughout the company. On the bottom line, we delivered another record quarter of earnings. Q3 operating income grew 2% to $340 million, and we delivered strong operating margin at 15.5%, only 80 basis points below last year despite significant headwinds and cost pressures.\n\nOur diluted earnings per share of $3.72, was up 12% from last year's record third quarter earnings per share of $3.32. On the balance sheet, we ended the quarter with a cash balance of $113 million, with no debt outstanding and year-to-date operating cash flow of $588 million. That enabled us to fund the operations of the business and expand our capital investments to support our long-term growth. In addition, year to date, we have returned excess cash of over $1 billion to shareholders through $165 million in dividends and $840 million in share repurchases.\n\nThese decisions reflect our commitment to maximizing returns for our shareholders. And with our strong and disciplined balance sheet, combined with our expected free cash flow, we have flexibility to continue to invest in the growth of the business and opportunistically invest in our own stock and drive long-term shareholder returns. Moving down the balance sheet. Merchandise inventories, which include in transit, were $1.688 billion, increasing 33% over our reduced level of last year.\n\nInventory on hand increased 34% over last year, but was up only 11% to 2019 versus sales up 52% over the same time. In the quarter, back-order levels decreased but remained well above historical levels. We are working hard to get these goods in to fulfill our customer orders but continue to anticipate our backorder levels will remain elevated in the first half of '23. Summarizing our Q3 results, we are proud to have delivered another quarter of record revenues and earnings.\n\nI would like to thank all our associates for their hard work and dedication in driving these great results. Now turning to our expectations for the remainder of the year and beyond. We acknowledge that the near-term macroeconomic picture remains uncertain, with conflicting economic signals surrounding consumer spending trends, decade-high inflation, and Federal Reserve monetary policy, intentionally moderating economic demand. Additionally, our trends have been increasingly inconsistent and less predictable.\n\nThis combination of conflicting economic signals and inconsistent trends makes our guidance unusually difficult to predict. However, we remain confident in our ability to operate in any environment, and are, therefore, reiterating our fiscal year '22 guidance of mid- to high single-digit revenue growth with operating margins relatively in line with fiscal year '21. Our outlook is grounded in three factors. First, we are currently in the early stages of our upcoming holiday seasonal rent with the biggest weeks yet to come.\n\nSecond, our Q3 quarter demand trends support a wide range of outcomes. And third, the ongoing improvement we see in fulfillment of our customer order backlog. From a profitability perspective, as we said in our last call, we continue to expect cost pressures to persist for the balance of fiscal year '22 and into the first half of '23, primarily across our supply chain. These headwinds include our incremental distribution centers, higher product and freight costs, and our efforts to best serve our customers by delivering products as timely as possible.\n\nOur capital allocation strategy remains unchanged. In fiscal year '22, we expect capital expenditures will be approximately $350 million. We plan to continue to return excess cash to our shareholders through quarterly dividends and opportunistic share repurchases. While the near term may be uncertain, the current management team has successfully navigated challenging environments before, including the 2008 great financial crisis and the 2020 global pandemic.\n\nWe know the levers to pull, and we have already taken steps to reduce cost and inventory to mitigate downside risk. Given the increased macro uncertainty, we will not be reiterating or updating our fiscal year '24 guidance at this time. We will be providing guidance for fiscal year '23 and beyond at our next call. We remain confident in the long-term fundamentals of our business.\n\nOur confidence remains rooted in our ability to take market share in the fractured home furnishings industry. The strength of our in-house proprietary design, the competitive advantage of our digital first but not digital-only channel strategy, the ongoing strength of our growth initiatives, and the resiliency of our fortress balance sheet. And having been here before, we see opportunity to take an offensive stance in a challenging macro environment. In summary, we are very proud of our results.\n\nWe continue to deliver for our customers, our associates, and our shareholders. And now I'd like to open the call for questions. Thank you.  \n\nOperator\n\nThank you. [Operator instructions] We ask today that you limit yourself to one question and one follow-up. Your first question comes from the line of Peter Benedict with Baird. Your line is now open.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nOK, guys. Thanks for taking the question. First one is on inventory. Just wanted -- maybe you could give us a little more color, your comfort with the current makeup furniture versus non-furniture.\n\nIt sounds like you've adjusted some receipts, I guess, in response to the slower -- or the softer macro. But how should we think about the level of inventory that you'd be comfortable operating with? I think you're about 120 days currently. I think you used to run like 100 days pre-COVID. I don't know.\n\nLike any benchmark to help us think about as we move through next year, how inventory might look depending on different sales scenarios. That's my first question. Thank you. \n\nLaura Alber -- President and Chief Executive Officer\n\nThanks, Peter. I'm going to let Jeff take that one. \n\nJeff Howie -- Chief Financial Officer\n\nGood afternoon, Peter. When you think about inventory, I really think it's tough to look at it on a one-year basis. I know we're up 33%. But if you think about this time last year, we're at our most aggressive inventory levels because if you think back to last year, that's when Southeast Asia was really closed, and we were still seeing the residual impacts of the COVID closures from India and China.\n\nSo, we're at our lowest inventory level at that point. We really like to look at it on a three-year basis, where our three-year on-hand inventory is up 12% versus our sales up 52% over the same time period. How we're thinking about it is we're making progress, but there's still a lot more work to do. Our backlog remains at historically high levels, and we're working hard to get our composition right, as well as our location of our inventory to service our customer best.\n\nWe anticipate our inventory levels and our back orders to gradually improve through Q4 and in the first half of '23.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nOK. Great. That's helpful. And then my second question.\n\nI know it's an unpredictable environment, but you did -- you have some line of sight here, I think, in terms of the out-of-market shipments and the other items that you said would provide some savings. Anyway, you can maybe help frame the size of those opportunities as we think about the back half of '23 as those start to come into the P&L? Thanks so much.\n\nJeff Howie -- Chief Financial Officer\n\nThanks, Peter. I think that's a great question, and it's really how we're looking at it. So, we have tremendous headwinds right now, particularly on our gross margin from higher product costs, higher inbound ocean costs. And as you mentioned, higher out-of-market costs, as well as shipping multiple shipments to the same customer for the same order when we should really be shipping it once.\n\nThat, right now, for the Q4 and into the first half of '23 is a headwind, and it will be impacting our margin. But we're pretty optimistic as we look to the back half of '23 and into '24. This is going to be a substantial tailwind and give us a lot of room to sustain our margins.\n\nOperator\n\nYour next question comes from the line of Steve Shemesh with RBC Capital Markets. Your line is now open.\n\nSteve Shemesh -- RBC Capital Markets -- Analyst\n\nHey, good afternoon, and thanks for taking the question. First one is on the slightly negative demand comp in the quarter. Can you share any additional perspective on how demand trended throughout the quarter and, I guess, where we stand in the first few weeks of November? And then as a follow-up on the backlog. I mean, it seems like the supply chain lead times improved pretty meaningfully throughout the quarter.\n\nJust curious if that materially changes your view on when you'll clear the backlog. I know you still said first half '23, but to the extent that's true, just curious why that wouldn't clear sooner.\n\nJeff Howie -- Chief Financial Officer\n\nSteve, let's take your demand question first. So, in terms of the cadence across Q3, it was incredibly inconsistent and choppy as we described, and that's both across our portfolio of brands in the quarter. We started the quarter off relatively strong, mid-single-digit comps, as we talked about in the Q2 call. And then we saw it really trail off after Labor Day once the Fed announced our fourth-rate hike.\n\nAnd even if you look at it, whether it's one year, two years, or three years, it was just inconsistent. One year decelerated across the quarter, two years was up and down, and three years actually accelerated across the quarter. So, it's tough to get a read on it, and then we just described it as inconsistent and choppy. But what we're pretty confident about is even in this choppy environment, we continue to take market share.\n\nRegarding the backlog, your second question. We still have more work to do, like I mentioned in the previous question. There's a lot of work left to do to deliver to our customers. The backlog remains sizable.\n\nAnd for us, some of the challenges are getting it in the right location and in the right composition so we can complete a multiline order for a customer. So, we -- again, we think it's going to take us through Q4 and in the first half to really normalize that level of activity.\n\nOperator\n\nYour next question comes from the line of Cristina Fernandez with Telsey Advisory Group. Your line is now open.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nHi. Good afternoon. I wanted to ask also on demand, but a different way. It seems like performance by brand is diverging.\n\nI assume that's the same on the demand level. Any insights you have into customer age or income that you see changes in how the different cohorts are responding to your products?\n\nLaura Alber -- President and Chief Executive Officer\n\nSure. Thanks, Cristina, for the question. So, you can clearly see, even by looking at the net comps, how strong Pottery Barn was. They've really been outperforming.\n\nThe rest of the brands are kind of in a similar range. But remember, you got to look at more than just a one year. So, when you look at West Elm on a three-year, it's really, really strong and not as far off as you might think. So, in terms of what we see in the demos, it's really -- I'm careful not to draw any big conclusions from it because the data is very sensitive.\n\nIt looks like the only thing we can see is lower income being more affected. We don't see necessarily an age issue. We just see lower income being more hurt than higher income, which is consistent with what you'd probably expect out there. The good news is, in total, our core customer is pretty affluent.\n\nAnd we also know that a lot of this is just uncertainty because there's really nothing that's happened. They still have a lot of home appreciation, and we have more savings than they did before the pandemic. And so, depending on what happens with the macro, this could be short. But if the macro gets worse and wage loss happens and the Fed continues to do what they are tasked to do, which is to stop growth, it could impact those customers more than it even has already.\n\nAnd so that's the reason we've been hesitant to give guidance out into '24. It's not that we're not confident in our business. It's that it's really hard to tell what's going to happen in the macro. If that was even just going to be as it is today, we would predict it.\n\nBut it's changing so rapidly. And frankly, none of us are economists. But we do know that we have a lot of levers to pull. We have a lot of growth strategies that are working.\n\nWe talked to you about B2B, marketplace, global. You can see in our brands when you go through them, some really exciting initiatives that are not just interesting, but they're really producing great results, big one being accessible home for Pottery Barn is something that we think we can do across all brands, frankly. So, despite what could be an uncertain environment, we see ourselves in a really good place like we were, if it's going to be '08 or if it's even because it's going to be the pandemic, I think people are always worried about what happens. And we tend to come out much better than most.\n\nSo that's my insight to what's happening out there and how it affects our customer and what our opportunities are. Thanks for the question.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nAnd then as a follow-up. If demand were to slow further, can you give some examples of the levers you can pull on the cost side to preserve as much of the operating margin, if you can?\n\nLaura Alber -- President and Chief Executive Officer\n\nGo ahead, Jeff. \n\nJeff Howie -- Chief Financial Officer\n\nSure, Cristina, we have quite a few levers, particularly on our SG&A line, where advertising, we can definitely adjust as we go. And the nice thing here is we have our own hands on the keyboards with our in-house marketing team who's really agile and performance-driven. We also have opportunities on employment, which, of course, leverage with sales with most of our employment in our distribution centers and stores, and call centers. And then there's a number of other cost efficiencies we can drive throughout our operations to continue to leverage our SG&A to help our operating margin.\n\nOperator\n\nYour next question comes from the line of Adrienne Yih with Barclays. Your line is now open.\n\nAdrienne Yih -- Barclays -- Analyst\n\nGreat. Thank you very much. Good afternoon, everybody. I'm sorry if I missed this, but could you -- Jeff, could you just give me the digital penetration or growth where we're sitting at kind of for the quarter? And then, Laura, I really wanted to congratulate you on the Starbucks, that win.\n\nIf you can talk about -- I know that they're undergoing a sort of massive renovation, refresh of their entire store fleet. So, I'm wondering where you think you can go from here having done that flagship? And then also for you, Laura, is India. As you look internationally, you're opening stores, company-owned stores in Canada. Are there any other markets in which you would contemplate owning your stores from a company-owned perspective versus franchising them? Thank you very much.\n\nLaura Alber -- President and Chief Executive Officer\n\nOK. Let me go backwards, forwards. So, India. We just -- Jeff and I actually had a chance to go over ourselves and see our stores.\n\nAnd at the time, West Elm were the only stores open. I'd tell you, they're as good as any store here in the United States. And our partners, the Reliance Group, are so good at digital and their marketing campaigns and the collaborators that we're working with. And we just walked away saying, we got to really spend more time than we even think on this because this is a market where it's enormous middle-class growing and a real penchant for high-quality design and goods.\n\nThere's not much out there, so we're the first person out there with a full lifestyle suite of stuff. It reminds me of we first started Pottery Barn and brought furniture into our stores in the '90s. It's that big of an opportunity. So, we're thrilled that we have a great partner.\n\nWhen you have a great partner in some of these very far away, more difficult-to-do business places, that's the way to go, in my opinion. I mean, Canada is a lot easier than India or in the Middle East, you have to have a partner. But at this point, there's nobody else that we're -- there's nowhere else that we're intending to open company-owned stores. There is an opportunity to do DTC Europe eventually when it's the right time to do that.\n\nThis would not be the right time, in my opinion, to do that, but we could do that out of DTC -- DC and our platform that we have set up in the U.K. OK. Starbucks. We're thrilled we finally can talk about this.\n\nWe've been working closely with them for three years. We've been doing a lot with them. And what I can say that I think they're going to be OK with me saying is that they're great partners, and they've been very creative with us to allow us to do some designs for them to their specs, for their stores. And we've really built this partnership up.\n\nAnd I don't know if you've been to that flagship, I just got the pictures, it is spectacular. And so that's one of many that we've done. You'll start to notice and see us popping up, but I can't give you any sort of road map of scale on Starbucks other than to say, it's one of the many great opportunities that we have. And we continue to really believe that B2B is going to be bigger than anyone expects.\n\nAnd then I'll pass it over to Jeff for digital growth.\n\nJeff Howie -- Chief Financial Officer\n\nSure. Adrienne, we're proud of both of our channels, and they both really did a great job this past quarter and delivered strong results. Retail was up 15.9%. And to get to your question, B2C delivered a 4.4% comp and was sequentially in line with our Q2 results coming about 65% of the total.\n\nLong term, we continue to see e-comm growing to 70% of revenues but both channels remain part of our digital first but not digital-only channel strategy, and we're happy to serve the customer in every channel they want to shop in.\n\nLaura Alber -- President and Chief Executive Officer\n\nI'll just also add, Adrienne, that when you really think about last year, Thanksgiving to Christmas, this is the time when, unfortunately, for a lot of people, Thanksgiving or Christmas or both or Hanukkah got canceled, get togethers got canceled because of COVID. And so, it wasn't the full open that it is now. We actually -- or I actually believe that retail is going to be the big winner of this holiday season. I think you can see people are out and about.\n\nAnd we're really stocked and ready to go. We are staffed. We have the goods in the stores already, and we put them there earlier so we can capture the sales. And honestly, we also have something we never had before pre-pandemic, which is our omni services.\n\nSo of course, BOPIS is a thing everybody does. Shipping from store is not a thing that everybody does, but we have learned to get quite good at it. And then also shipping to the store is something we do. And we have just enabled, which I am quite excited about, shipping to any store in the company.\n\nSo, for example, if you buy online, PB Kids, but there's no PB Kids next to you, you can ship it to your local Williams-Sonoma store and you go pick it up. And we did this when we worked on dorm. And our dorm strategy this summer, we saw great results. And so, I think this is going to be something that continues to build, not just because we don't have stores in every market, but because also it's a convenience play as people are back in the office more and also some people don't want to have to wait at home or UPS won't deliver to their ZIP code for that reason.\n\nThis is a way to get around having to be there and wait for it to arrive at your porch. So, this is yet another example of how we're taking omni, and it optimizes the retail inventory. So, for example, if I'm wrong and retail isn't as good as I think it's going to be, this inventory can be shipped against DTC orders, which I think is a really exciting advantage that we have that, particularly stores or brands that don't have retail don't have the opportunity to achieve.\n\nOperator\n\nYour next question comes from the line of Anthony Chukumba with Loop Capital. Your line is now open.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGood morning. Thank you. Good evening. Thank you so much for taking my question.\n\nSo, just two real quick ones. First off, super exciting about Starbucks. I know in the past, you said that you expected B2B sales to be about $1 billion this year, and I was just wondering if -- I just noticed you hadn't commented on that, so I'm just wondering if that's still the right way to think about it. And then my second question is just kind of what you're seeing from -- in terms of the competitive environment.\n\nI mean, obviously, you're sticking with getting rid of sitewide promotions. I 100% agree with that. But just I was wondering if you're seeing your competitors get any more promotional. Thank you.\n\nLaura Alber -- President and Chief Executive Officer\n\nJeff, do you want to go ahead with B2B? \n\nJeff Howie -- Chief Financial Officer\n\nSure. We see our track on B2B just continuing to propel forward, and we are on track to hit the $1 billion this year. The demand pipeline through our projects and our major partners continues to be strong, and we're very confident in our ability to get there. And from a long-term standpoint, it is such a fractured market, total addressable market, $80 billion.\n\nAnd we think we have a really compelling proposition with our portfolio of brands, our in-house design, our global sourcing capabilities to really capture this. And we're seeing a lot of promising signs out there in terms of pent-up demand for renovations in hotels and restaurants. And we think it's quite a great opportunity for us.\n\nLaura Alber -- President and Chief Executive Officer\n\nJeff, why don't you take the second piece of the question? \n\nJeff Howie -- Chief Financial Officer\n\nCould you repeat your second question, Anthony?\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nWhat you're seeing in terms of the competitive environment, particularly around promotions.\n\nJeff Howie -- Chief Financial Officer\n\nWe're seeing -- we're definitely seeing more promotions in the environment as the economy softens. I think a lot of retailers have been thinking -- have been talking about that this week. Our approach has been very consistent in terms of the level of promotions that we've been doing. And plus, I want to reiterate that we remain committed to not offering sitewide promotions in our brands, and we will do whatever it takes to continue to not do that.\n\nWe think that our in-house design proprietary product really resonates with the customer because of its differentiation and commands its own pricing power, and we're seeing that in our results.\n\nOperator\n\nYour next question comes from the line of Max Rakhlenko with Cowen. Your line is now open.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGreat. Thanks a lot. So first, on the gross margin pressure, how would you quantify the various headwinds, just putting them into different buckets? And then how should we think about that pressure in 4Q? And just any color on puts and takes into the quarter there.\n\nLaura Alber -- President and Chief Executive Officer\n\nThanks, Max. I'm giving that to Jeff, too.\n\nJeff Howie -- Chief Financial Officer\n\nAll right. Thanks, Max. I think all of them are heavy pressures on our gross margin, as we've been communicating. There's the product costs, which have been with us all year as part of inflation.\n\nThere's the ocean costs, which, although we see ocean costs overall coming down, we still have the cost in our balance sheet and need to sell through that higher cost inventory. Our shipping costs domestically have been high, as we talked about because of out of market and shipping multiple times a customer. As I said in the answer to the first question, we still have quite a bit of work to do to get our inventory in the right composition, as well as the right location to properly service our customers and work on this backlog we have. So, we think it will be -- continue to be a headwind for Q4 and into the first half of '23.\n\nThe thing I'm really optimistic about is when we turn the corner, when we start to look at the back half of '23 and into '24, it's going to be a tremendous tailwind. And I'm optimistic that we can really sustain our margins when I think about all the cost pressures we've been under and still delivered the results we're delivering today.\n\nLaura Alber -- President and Chief Executive Officer\n\nThe other piece of this is we are starting to see our vendors reduce their pricing to us. And I'm not just talking about shipping, I'm talking about product vendors. And that is a pretty sizable thing as you think about the future. In some cases, it's going to be important to pass along part of that to the consumer because everybody had to take a price increase.\n\nAnd when it comes down, we want to make sure that we have the best value out there. So, we're always scrubbing to see how's our design vis-a-vis the competition. How's our quality, how's our sustainability problems and how is our price? And so, as we get better prices from our vendors, which we're already starting to see, there will be some that are passed along to the consumers so that we can really continue to grab market share because we're going to offer an even better value. And so, there are -- in addition to just the cost being normalized, I think there's some real opportunities as you think about the back half of next year and beyond to really improve the margin from here.\n\nOperator\n\nYour next question comes from the line of Oliver Wintermantel with Evercore. Your line is now open.\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nHi. Thanks very much. And, Jeff, congratulations on the new role. I had a question regarding retail.\n\nI think you said up 16%, 16.9%. Can you give us a little bit more detail what drove that? Is that AUR? Or is that mix or traffic versus ticket? That would be great.\n\nLaura Alber -- President and Chief Executive Officer\n\nOK. Oliver, it's Laura. Remember, the 16.9% is the net comp not a demand comp. It's driven by AUR and the resulting traffic fill from the previous sales.\n\nAs we look at demand comp -- yeah, as we look at demand comps now, at retail, our traffic is better than our competition, better than the industry, which is really exciting. And you all know Christmas is the -- and the holidays is the time that people love to come into our stores. And I've said before, you salivate just thinking about walking into a Williams-Sonoma store. And so, we're really focused on conversion, and we have the traffic.\n\nSo that's why I tend to be quite optimistic that retail is going to be -- the retailers, for us at least, is going to continue to overdeliver in the short term as we're comping the pandemic not completely out of the house that we were in last year. \n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nGot it. And my second question was regarding B2B. If you just think about the macro environment and let's say that there's a slowdown, how do you think B2B is holding up versus the consumer business? Do you think there's more headwinds? Or could that hold up better than the consumer business?\n\nJeff Howie -- Chief Financial Officer\n\nThat's a great question, Oliver. I think that the B2B business will hold up stronger potentially in a soft macro environment than the consumer. If you think about the dynamics of the past couple of years, the consumer market took off during the pandemic as people were home and they started shopping. And now that's possibly trailing off a little bit with the Fed's monetary actions and the macroeconomic environment.\n\nB2B on the other hand, a lot of those verticals they were shut down for several quarters and even over a year. And there was a big backlog of work and renovation work and projects that weren't done. And all of that pipeline of those -- that pent-up demand and deferred projects is really coming online now. We're seeing it in the RFPs we have out, talking to our customers in B2B.\n\nAnd when I attend trade shows, there's just a general energy about the amount of projects that are out there. Funded projects, a lot of renovations. There was a great article in the Wall Street Journal, I think it was last week and the week before, talking about the hotel experience and how there's just a dearth of great hotels. A lot of them need to be updated and renovated.\n\nAnd that just speaks well to our opportunity with B2B. So, in sum, it can really be countercyclical if there is a macroeconomic downturn.\n\nOperator\n\nYour next question comes from the line of Steven Zaccone with Citi. Your line is now open.\n\nSteven Zaccone -- Citi -- Analyst\n\nGreat. Good afternoon. Thanks for taking my question, and I'll extend my congrats to you, Jeff, as well on the new role. First question I had was just how much do you think the competitive environment is factoring into the slowing demand trends that you're seeing in your business? The macro is difficult, we understand, but the home furnishing industry has also gotten a little bit more promotional.\n\nAnd I guess, Laura, as you look across the industry, are you concerned inventory levels are getting high in the channel?\n\nLaura Alber -- President and Chief Executive Officer\n\nYeah. So, it's funny, the macro environment or -- no the competitive environment has always been promotional. When you really go back and you think about -- even before all these new start-ups came about, there was Macy's always in the home business and a lot of other big players. And then Amazon came along and Wayfair.\n\nThey've always been after price first. What we do versus them is very different in that we're designing our own goods. And we've been doing it for a lot of years. And so, we tend to be first with new trends and able to bring out finishes that others can't replicate even when they try to copy us, they can't replicate.\n\nAnd so, when you actually go and look at the difference between our furniture or even our tabletop or any of the categories versus theirs, you're going to see a big difference in quality and the resulting price even with their markdowns, our value is better. We keep looking at that, looking at whether it's the sofa, the coffee table, the rug. I mean, when you take a product down like-for-like and you really look at it in person, look at the price, I feel very good about where we sit. There's always a few exceptions.\n\nThere's always a few opening price points that I wish were sharper. Those are -- the opening price points are the place that I want to get back to be more competitive as we were pre-pandemic. Those are the areas where I think everybody got a little too high. But in total, I really don't think it's a competitive pricing issue because it's hard to match our goods against anyone else's goods.\n\nNow in terms of inventory in the channel, Bed Bath & Beyond has a ton of inventory that they're pressing and going to continue to press at deep markdowns. Again, different products. But will that hurt everybody on the fringes? That one might be the biggest factor going. But the Wayfair and the Amazon, those guys are the biggest out there, but it's just -- it's a very different business.\n\nSo, you might buy one thing from them for your garage or something, but you're not going to furnish your living room, your full bedroom from some of those brands. Our customer wouldn't anyway because there are -- what they're looking for is a much higher quality level and design sensibility. And they want someone to help them put it together. So those are, I think, the factors at play, and we just have to make sure that we're not distracted by a short-term blip and that we are all focused on what we've built here and continuing to feed it, which means innovation, innovation and product and service and continuing to press forward when everyone else is doing the duck and cover.\n\nAnd that's the thing. I mean it's exciting, even though it's a different hand than we expect it to be dealt right now. It's an exciting time to really think about it offensively. And what's the company that we want to look like and again, make improvements to? If this is a recession, what are we going to look like on the other side of it? And I think when you saw us come out of '08, we were stronger and we're much stronger coming out of the pandemic.\n\nAnd whatever this is going to be, I would say the same thing, we're going to be much stronger coming out of this, too.\n\nOperator\n\nYour next question comes from the line of Chuck Grom with Gordon Haskett. Your line is now open.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey, thanks very much. Thanks, Laura. Historically, there's been a nice lead, lag relationship between housing turnover and furniture sales. I'm curious, Laura, do you think that relationship still exists? Or has it been decoupled? If you listen to the home improvement names over the past week, they're seeming to suggest that this time is different and that we are seeing some decoupling, which could indirectly be good for your business over the next couple of years.\n\nLaura Alber -- President and Chief Executive Officer\n\nYeah. I mean I just think this is a people are nervous sort of situation. As I said earlier, Lowe's, Home Depot, they're really very optimistic. I'm sure everybody listened to their calls and people still love their homes.\n\nAnd the sentiment is still I want a nicer home. I want a second home. I want a bigger home. Now they're not going to buy one because nobody wants to buy right now.\n\nThat doesn't mean that you don't still love your home, you don't want to still spend money on it. And so, the renovation, a lot of those renovation projects are still lagging from the pandemic when you couldn't even get a refrigerator, right? You still can't get a refrigerator. And so, you're not done with your kitchen, so you're not fishing your kitchen yet. So, it's interesting that those projects are still lagging, and there's still, there should be, in my opinion, there should be still a big upside as they finish those projects and then they go to spruce up the furnishings.\n\nBecause if you spend a lot of money on your new bathrooms and your new kitchen, which are usually where people go first, generally speaking, you buy furniture next. So, it should be a very positive thing for us. What I think is happening is, right now is more fear than reality, and we'll see what happens and which way that goes. But as I said earlier, our customers are still in really good economic shape.\n\nThey're just -- I think they're taking a small pause for a minute as everyone's been talking about.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Thanks very much. And then I know directionally, B2B is more accretive than the traditional retail business. But clearly, some of the optimism, I think on the longer term, margin structure is in B2B, particularly as it ramps.\n\nI was wondering if you or Jeff could just maybe speak to some of the buckets of why that B2B business is so much stronger on the margin front because I think it would help bridge the gap from some of the fears on some of the costs starting to come back into the P&L as an offset.\n\nJeff Howie -- Chief Financial Officer\n\nA couple of things there, Chuck. So, first of all, B2B is slightly accretive to our op margin. And really, the dynamic there is you don't have the overhead of some of the retail and then not as much advertising costs. So, it does lend some accretion from that standpoint.\n\nBut I think when you think about the costs that are hitting the P&L, the second part of your question is, I think we have to think about that really in two phases. The first is the near term, which is Q4 and the first half of '23, where we're seeing the higher product cost, a higher inbound shipping costs, and all of our additional costs as we work through our backlog. That will become a tailwind for us. As we turn the corner and head in the back half of '23 and '24, I think that in and of itself will support our margins long term.\n\nAnd then B2B will really just be the icing on the cake on top of it.\n\nOperator\n\nYour next question comes from the line of Seth Basham with Wedbush Securities. Your line is now open.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot and good afternoon. My first question is around merchandise margins. You guys have been doing a great job holding the line on merchandise margin despite some of the pressures. As you move forward, could you help us understand the puts and takes the arc of merchandise margins in the fourth quarter and through the first half of 2023? Thanks.\n\nJeff Howie -- Chief Financial Officer\n\nThanks, Seth. We don't guide specific line items like that, but we are giving you a guidance on the overall direction of gross margin, with March margin a sone component of that. And we do see headwinds there in Q4 and in the first half of '23 for all the reasons that we've talked about, the product cost, the ocean costs and then our own challenges with getting through our backlog with out-of-market shipments and multiple shipments to customers. And again, I think that that becomes a huge tailwind.\n\nAs we look to the back half of '23 and '24, that gives us optimism from the long-term sustainability of our margins. \n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. Just to frame the question differently then, Jeff. Thinking about the merchandise margins and how you've been able to hold them flat year over year given the level of inventory that's rising and the likely higher level of clearance and discontinued lines that you'll have going forward, would you expect to be able to offset those pressures on merchandise margins with things like product costs and in-bound shipping cost reductions?\n\nJeff Howie -- Chief Financial Officer\n\nI think one thing to think about with our inventory that's different from, say, an apparel retailer, fashion retailers, we have a much higher penetration of the core. So, we don't have that seasonal pressure to move like other companies do that are in the retail industry. And from a long-term standpoint, again, to the back half of '23 and into '24 these headwinds we're experiencing really become tailwinds, and that's where we see opportunity on the margin from a long-term standpoint.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThank you. \n\nOperator\n\nYour next question comes from the line of Brad Thomas with KeyBanc. Your line is now open.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nHi, thanks. Two financial questions, if I could. The first just thinking about sales for the fourth quarter, I know you reiterated the full year guidance, but technically, if we back into what's implied, it's a pretty wide range. Wondering if there's any more color you could share with us with how to think about the fourth quarter revenues.\n\nAnd then we get a lot of questions about the structural margins of Williams-Sonoma and it does seem to me that you've done some great things with the brands and probably deserve a higher merchandise margin than pre-pandemic levels. And similarly, you've done a great job of getting more efficient with occupancy expense and having a greater mix of e-commerce sales and perhaps that should support a higher margin. But I would love to hear your latest thoughts on perhaps what structural margins look for you as we think about perhaps slower trends ahead. Thanks. \n\nJeff Howie -- Chief Financial Officer\n\nOK. Let's start with the Q4 implied sales. And yeah, it's a wide range. As I spoke to in my prepared remarks, we saw a tremendous amount of choppiness in Q3.\n\nThe result of that choppiness is there's a wide range of estimates. But our guidance is a blend of those ranges of estimates and reflects our best estimate as to what we see potentially happen in Q4. As a result -- as it relates to the structural margin, there's been quite a bit of change within the structural margin. And here, I think there's a lot to talk about in terms of how we really improved our operating model.\n\nThe first one is the impact of elimination of sitewide promotions. That is really buttressing our merchandise margins and giving us a lot of opportunity there to continue to sustain that. I think it speaks to something we really learned and sort of maybe relearned in the pandemic is that our proprietary differentiated product that our in-house design produced really commands its own price in the marketplace. And that product really resonates with the customer, and they're really willing to pay for it.\n\nThe second thing is, throughout the pandemic, we really, number one, improved the profitability of our retail stores, and as mix has shifted to e-commerce, which by nature is more profitable for us. So, a combination of those different factors really helps us with sustaining the margin. And then over the long term, we see additional opportunity to take costs and drive efficiency throughout our P&L.\n\nOperator\n\nThis concludes our question-and-answer portion for today. I now turn the call back to management for closing remarks.\n\nLaura Alber -- President and Chief Executive Officer\n\nYeah. Thank you all for joining us. I want to wish you a very happy holiday season and look forward to talking to you next year.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeremy Brooks -- Chief Accounting Officer and Head of Investor Relations\n\nLaura Alber -- President and Chief Executive Officer\n\nJeff Howie -- Chief Financial Officer\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nSteve Shemesh -- RBC Capital Markets -- Analyst\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nAdrienne Yih -- Barclays -- Analyst\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nOliver Wintermantel -- Evercore ISI -- Analyst\n\nSteven Zaccone -- Citi -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nMore WSM analysis\n\nAll earnings call transcripts"
}