{
  "companyName": "Gamida Cell Ltd.",
  "companyTicker": "GMDA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/gamida-cell-ltd-gmda-q2-2022-earnings-call-transcr/",
  "content": "Gamida Cell Ltd. (GMDA 2.38%)\nQ2 2022 Earnings Call\nAug 15, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, [Audio gap] and I'll be your operator for today's call. Please be advised that this call is being recorded at Gamida Cell's request. Now, I would like to introduce your host for today's conference, Heather DiVecchia, Gamida Cell's director of investor relations and corporate communications. Please go ahead.\n\nHeather DiVecchia -- Director, Investor Relations and Corporate Communications\n\nThank you, Olivia, and good morning, everyone. Welcome to today's call during which we will provide an update on the company and review our financial results for the second quarter of 2022. Earlier this morning, we issued a press release summarizing our financial results and progress across the company, which is available on our website at www.gamidacells.com. Here with me on our call today are Julian Adams, chief executive officer; Ronit Simantov, our chief medical officer and scientific officer; Michele Korfin, our chief operating officer and chief commercial officer; and Shai Lankry, our chief financial officer.\n\nDuring this call, we may make forward-looking statements about our future expectations and plans including in respect of the timing of initiation and progress of and data reported from the pre-clinical and clinical trials of our product candidates, regulatory filings including the review of the BLA for Omidubicel by the FDA commercialization planning efforts, the potential life saving or curative therapeutic and commercial potential of Gamida Cell's product candidates including GDA-201 and Omidubicel and our expectations regarding our projected cash, cash equivalent and investments to be used for operating activities. Our actual results may differ materially from what we project today due to a number of important factors including the impact of COVID-19 pandemic on our operations, the scope, progress, and expansion of our clinical trials and impacts to the cost thereof, clinical scientific regulatory and technical developments those inherent in the process of developing and commercializing product candidates that are safe and effective for use as human therapeutics and in the endeavor of building a business around such product candidates as well as those considerations described in the risk factor section of our most recent quarterly report on Form 10-Q and other filings that we make with the SEC from time to time. These forward-looking statements represent our views only as of today. And we caution you that we may not update them in the future, whether as a result of new information or future events expect as required by applicable law.\n\nNow, I'd like to turn the call over to Julian.\n\nJulian Adams -- Chief Executive Officer\n\nThank you, Heather, and thanks to everyone for joining us this morning. This was an extraordinary quarter for GamidaCell as we continue our momentum into the second half of 2022 focused on delivering on multiple milestones and accomplishments for all our stakeholders. All that we've accomplished this quarter continues to lay the groundwork for even larger inflection points. Advancing toward the potential commercialization of our first NAM-enabled cell therapy candidate Omidubicel.\n\nContinuing the development of our lead NAM-enabled cell therapy candidate GDA-201 for patients with lymphoma who need new treatment options. Developing our expanding pipeline of genetically modified NAM-enabled NK cell therapy candidates supported by robust preclinical data, and exploring future opportunities that leverage our proprietary NAM technology across a broad range of innate and adaptive immune cells. Recently we announced our own Omidubicel Biologics License Application or BLA was accepted by the FDA and granted priority review with a PDUFA date of January 30, 2023. We are pleased to have received priority review which validates the importance of Omidubicel cell for patients with blood cancers in need of an allogeneic hematopoietic stem cell transplant.\n\nAs a reminder, Omidubicel cell has breakthrough therapy designation as well as Orphan Drug status. With the U.S. review underway, we are continuing with our preparations to support a potential commercial launch. If approved, Omidubicel cell has the potential to achieve 20% to 25% of the addressable market at peak market share by improving outcomes for patients based on our encouraging clinical data and increasing access, especially for patients who are eligible for transplant, but cannot find a match.\n\nThis 20 to 25% equates to 2,000 to 2,500 patients treated in the U.S. each year. Michelle will provide additional detail on our launch strategy and plans later in this call. Beyond Omidubicel cell, we also announced the dosing of our first patient in our company-sponsored Phase 1/2 clinical study evaluating a cryopreserved readily available formulation of GDA-201 our lead program our expanding NAM-enabled NK pipeline for the treatment of follicular and diffuse large B-cell lymphomas.\n\nWe continue to be encouraged by the results observed in a Phase 1 investigator-sponsored study of the fresh formulation. Ronit will provide additional detail on the Phase 1/2 study supporting GDA-201. Our continued focus on patients and our vision for advancing potentially curative cell therapies has never been more important. Prior to turning the call over to Ronit, I'd like to thank my colleagues at Gamida Cell for their dedication to our mission.\n\nAdditionally, Gamida Cell would like to sincerely thank the clinical trials sites and the patients and their families that have been such important partners as we advance our pipeline of NAM-enabled cell therapies. With that, I'll turn the call over to Ronit.\n\nRonit Simantov -- Chief Medical Officer\n\nThanks, Julian, and good morning, everyone. Thank you for joining us on our call this morning. As Julian mentioned, we're excited to share that BLA for Omidubicel cell was accepted by the FDA with priority review. Recall that our submission was based on a successful global Phase 3 randomized study comprised of 125 patients aged 12 to 65 with high-risk hematologic malignancy that were in need of allogeneic stem cell transplant, but had no readily available matched donor.\n\nThe study demonstrated a median time to neutrophil engraftment of 12 days for patients randomized to Omidubicel cell, compared to 22 days for the comparator group. These results were not only statistically significant, but also highly clinically significant as neutrophil engraftment is a key milestone in recovery in patients undergoing bone marrow transplant. Turning to GDA-201, our lead product candidate in our NK cell therapy pipeline, leveraging our proprietary NAM technology in the expansion of NK cells to enhance their functionality, direct tumor cell killing properties and Antibody-dependent cellular cytotoxicity or ADCC. Despite recent advances in the development of therapies for patients with lymphoma, we continue to hear from lymphoma experts that there is a high unmet need among patients with lymphoma who have active disease after previous treatment.\n\nData from the investigator-led study at the University of Minnesota on the fresh formulation of GDA-201 were reported at ash in December of last year and demonstrated an overall response rate of 74% with durable responses of 78% -- until your survival of 78% and heavily pretreated patients with lymphoma. Recently, translational data from this study will present it at the American Association of Cancer Research International Meeting on advances in malignant lymphoma. Tumor biopsies were analyzed with high-resolution multiplex imaging techniques to identify the cells found in the lymphoma tissue at 16 days after treatment with GDA-201. Images showed that CD20 Positive lymphoma cells were no longer detectable.\n\nBut the tumor was infiltrated with CD8 and CD4 positive T-cells, which are immune cells that can target tumors. These findings help us to generate and hypothesis about the potential mechanism of action of GDA-201. The data suggests that initial tumor cell killing but GDA-201 triggers an adaptive immune response, recruiting T-cells that can provide further anti-tumor effects. This hypothesis will be explored further with additional research.\n\nAs Julian highlighted, we recently announced the dosing of the first patient in our company-sponsored Phase 1/2 clinical study evaluating GDA-201 for the treatment of follicular and diffuse large B-cell lymphomas. The study is designed to include patients who have relapsed or refractory lymphoma after at least two prior treatments, which may include CART-cell therapy or stem cell transplant. The Phase 1 dose escalation portion of the study is designed to evaluate the safety of increasing doses of GDA-201 with dosing similar to those in the previous investigator-led study. Up to four dose levels will be tested to determine the maximum tolerated dose and recommended Phase 2 dose based on the dose-limiting toxicity.\n\nPhase 1 also includes patients with follicular diffuse large B-cell, marginal zone, and mantle cell lymphoma histology. The Phase 2 expansion portion of the study is designed to evaluate the safety and efficacy of GDA-201 in two separate cohorts of approximately 30 patients each with follicular lymphoma and diffuse large B-cell lymphoma. The study is currently open at three sites and a number of sites will be limited during the dose escalation phase. Investigators are enthusiastic about enrolling patients in the study and treating patients with GDA-201.\n\nWe're looking forward to patients participating in this trial and to progressing this important therapy candidate through the clinic. In our expanding cell therapy pipeline, we are also developing our genetically modified NAM-enabled NK cell therapies in hematologic malignancies and solid tumors. These novel products candidates, leverage CAR and CRISPR mediated strategies to increase targeting potency and persistence and are supported by robust preclinical data. We are evaluating multiple product candidates, including GDA-301, GDA-401, GDA-501, and GDA-601.\n\nGDA-601 is also being advanced with a research collaboration with the Dana-Farber Cancer Institute, which allows us to leverage the expertise of researchers at Dana-Farber to study the in vitro NK cell killing activity of GDA-601 in multiple myeloma. We believe a broad-based NAM-enabled NK platform is well positioned to explore potential partnership opportunity, and we look forward to the continued development of these cell therapeutics. Throughout the rest of the year, we plan to continue to conduct preclinical proof of concept studies for these genetically modified NK therapeutic targets. By the end of 2022, we plan to select a pipeline candidate for IND-enabling studies.\n\nWith that, I will turn the call over to Michele who will talk more about Omidubicel and commercial plans. Michele?\n\nMichele Korfin -- Chief Operating Officer and Chief Commercial Officer\n\nThank you, Ronit, and good morning, everyone. Based on the exciting milestone of FDA acceptance of our Omidubicel BLA with priority review, we have an incredibly high priority at Gamida Cell to ensure patient access to Omidubicel upon its potential approval. We have diligently worked to define the unmet need that Omidubicel could address and have a clear launch strategy and a well-defined plan. With our outstanding launch leadership team in place, we are now ready to move to launch execution.\n\nUpon potential FDA approval, Omidubicel has the potential to address a great unmet need for patients. Therefore, we are motivated to ensure that we are prepared to bring this important therapy to patients as quickly as possible following approval. Starting with manufacturing. We are preparing for launch readiness at our Gamida Cell manufacturing facility.\n\nThis facility was integral for the completion of our BLA and is also now focused on commercial readiness. We are ready to manufacture Omidubicel upon FDA approval. Our facility in Israel is modular, so we will have the ability to add additional cores as demand increases from Omidubicel. We are confident we could support the launch demand requirements from our facility from both a production and a supply chain standpoint.\n\nThe team has finalized our end-to-end processes to validate our approach to assure chain of identity and chain of custody for our commercial process to ensure a positive transplant center and patient experience. We have also been successfully manufacturing clinical batches in our Gamida Cell manufacturing facility and have been able to deliver Omidubicel back to the transplant centers within 30 days. Beyond manufacturing, we are also working hard to ensure that upon FDA approval that patients could have broad access to Omidubicel. For the approximately 8,000 patients above the age of 12 with hematologic malignancies who undergo an allogeneic stem cell transplant each year, this procedure may be their best chance for a potential cure.\n\nThere are two key opportunities that we focus on that Omidubicel may address for these patients upon FDA approval. First, potentially improving outcomes as compared to other donor sources based on transplant or feedback and also potentially increasing access to therapy. For potentially improving outcomes, we have extensive market research that points to clear and consistent insights. Transplants or see important opportunities for Omidubicel to potentially improve outcomes based on their experiences with other donor sources.\n\nThis opportunity is due to the strength of our clinical data, the ability to provide patients with a predefined number of cells, and the ability to provide Omidubicel within approximately one month as compared to unrelated donors that may take on average two to three months to align the donor and the patient. Unfortunately, there are approximately 1,200 additional patients each year who are ages 12 with hematologic malignancies who are deemed eligible for an allogeneic stem cell transplant but cannot find an appropriate donor. In terms of potentially increasing access for these patients, unfortunately, there is racial disparity in the U.S. in regards to access to allogeneic stem cell transplant.\n\nIf you are non-Caucasian and do not have access to a family member donor, you have avery low likelihood of finding a match in the public database. For example, published data indicate that a black patient in the U.S. has less than a 20% chance of finding a math from the public database. If a patient cannot find an appropriate donor, they will, unfortunately, succumb to their cancer.\n\nOmidubicel has a less stringent matching criteria for patients and moreover, we demonstrated our ability to match racially and ethnically diverse patients in our Phase 3 study as 40% of the patients in our study were non-Caucasian. As Julian mentioned, we anticipate that if approved, these two opportunities combined may result in Omidubicel capturing approximately 20% to 25% of the addressable market once we reach peak market share. So if approved, this will equate to approximately 2,000 to 2,500 patients treated each year in the U.S. with Omidubicel.\n\nWe understand the importance of educating both the transplant centers and payers. With regards to reaching transplant centers in the U.S., we have an optimized and targeted approach as the transplant centers that perform allogeneic stem cell transplants are extremely concentrated. For reference in the U.S., there are approximately 200 transplant centers that perform allogeneic stem cell transplants, 70 of those centers conduct approximately 80% of the transplant. Our medical affairs colleagues have been actively engaged with transplant centers and the feedback on our clinical data supports the positive feedback we have heard in our blinded market in sites.\n\nTurning to payers, our conversations with these groups are progressing. Our payer team has been actively engaged with payers at the national and regional level. We will be proactively reaching out to payers who cover at least 90% of the lives in the U.S. We continue to hear consistent feedback on the overall value proposition of Omidubicel, including the strength of the clinical data and the health economic data we have published to date.\n\nHospitalization represents the majority of charges associated with transplant, so our reduction in healthcare resource utilization in terms of reduced days in the hospital and reduce days in the ICU are very important components of the Omidubicel value proposition. In addition, we saw a reduction in the number of transfusion and consultant visits. These reductions in healthcare resources are very meaningful to the payer, transplant center, and most importantly, the patients. We are excited to continue to hear positive feedback across all stakeholders and are extremely encouraged and driven by the potential of Omidubicel.\n\nWe are equally encouraged with the advancement of our GDA-201 program in lymphoma. The lymphoma is the largest patient population of all the blood cancers with a global incidence of over 600,000 patients. There are approximately40,000 patients with relapsed/refractory lymphoma in the U.S. and EU, which is the patient population that will be studied in the GDA-201 Phase 1/2 clinical trial.\n\nThere is an unmet need for effective and safe new therapies with a curative approach for these patients. We look forward to the continued advancement of the GDA-201 trial. I will now turn the call over to Shai to review our financial results.\n\nShai Lankry -- Chief Financial Officer\n\nThank you, Michele, and good morning, everyone. Today, I will summarize our financial results for the second quarter of2022. As of June 30, 2022, our total cash position was approximately $55 million, compared to $96 million as of December 31, 2021. Research and development expenses for the quarter were $10.6 million, compared to $13.4 million in the same quarter last year.\n\nThe decrease was mainly due to a $2.4 million decrease in clinical activities relating to the conclusion of Omidubicel Phase 3 clinical trial and a decrease of $0.4 million in the GDA clinical program. Commercial expenses for the quarter were $3.2 million, compared to $5 million in the second quarter of 2021. The decrease was primarily due to reducing our near-term commercial readiness expenses as we were assessing strategic approaches for the commercialization of Omidubicel. General and administrative expenses were $4.3 million in the second quarter of 2022, compared to $3.9 million for the same period in '21.\n\nThe increase was mainly due to a $0.9 million increase in professional services expenses, offset by a decrease of $0.5 million in headcount and related expenses. Finance expenses net were $0.5 million for the second quarter of 2022, compared to $1.3 million for the same period last year. The decrease was due to a $0.6 million decrease in noncash expenses and an increase of $0.2 million in interest income from cash management. Net loss for the second quarter of 2022 was $18.6 million, compared to a net loss of$23.6 million in the second quarter of '21.\n\nWe continue to expect cash used for ongoing operating activity this year to range from $65 million to $70 million, we anticipate that our current total cash position will support our ongoing operating activities into mid-2022, excluding the cost of commercializing Omidubicel. Following the corporate restructuring announced in January of this year, we are now realizing the decrease to our cash burn, and we'll continue to diligently manage our cash position to fund our operations. Additionally, we are continuing to evaluate our cash needs and assessing all financing options that supports our corporate strategy to bring Omidubicel to patients. This cash run rate guidance is based on our current operational plan and excludes any additional funding that may be received or business development activities that may be undertaken.\n\nWith that, I will turn the call back over to Julian.\n\nJulian Adams -- Chief Executive Officer\n\nThank you, Shai. For the rest of 2022, there is no higher priority than to enable the successful commercialization of our first NAM-enabled stem cell therapy, Omidubicel to benefit the thousands of cancer patients here in the U.S. who need a curative approach that our allogeneic stem cell therapy may offer. We are also excited about the potential of GDA-201as an NK cell therapy that may benefit tens of thousands of patients worldwide.\n\nWe look forward to the results of this promising new approach for lymphoma patients in our company-sponsored Phase 1/2 open-label multi-centered study. We continue to demonstrate our leadership role in the development of NAM-enabled cell therapies through the expansion of our pipeline with multiple genetically modified NAM-enabled NK cell therapy candidates. We believe that our curative approach may make a difference in the lives of cancer patients worldwide and help redefine how patients are treated in the future. Now let's open the call for questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] And our first question coming from the line of Edward Tenthoff from Piper Sandler. Your line is open.\n\nEdward Tenthoff -- Piper Sandler -- Analyst\n\nGreat. Thank you very much. And just thinking toward -- and again, congrats on all the progress the BLA acceptance, etc. Just wondering from the communications with the FDA, obviously, manufacturing the clinical data.\n\nWhat else is the FDA keenly focused on evaluating Omidubicel, and what do we -- what should we be considering as plans for other overseas filings and potential regulatory activity? Thanks, guys.\n\nJulian Adams -- Chief Executive Officer\n\nThank you, Ed, for your question. And I would say that the -- what you've identified is actually the two pivotal aspects of our FDA review. One is, of course, the clinical data, which the FDA has extremely focused on as well as our manufacturing facility and anticipating a preapproval inspection. Michele, would you comment on additional activities and activities outside the U.S.\n\nas well?\n\nMichele Korfin -- Chief Operating Officer and Chief Commercial Officer\n\nFor sure. And Ed, good morning. Thank you for joining the call. As I mentioned in my prepared comments, our Omidubicel-owned facility in Israel has been -- it was integral for the BLA filing.\n\nAnd we continue to now focus on commercial readiness, but a very important point that I also alluded to as we have been manufacturing clinical batches at that facility. We have validated processes end-to-end to assure chain of identity and chain of custody. That facility has advanced in a very impressive and encouraging way. So we were excited to include that facility in our BLA.\n\nIn regards to overseas opportunities, so we have very encouraging opportunities to help advance Omidubicel for patients in many regions throughout the world. We have conducted assessments in Western Europe, in Japan, and also in other regions such as Canada. And most of what we see in terms of the opportunity for Omidubicel in the U.S. is also the case overseas in terms of those ability to improve outcomes and also to increase access for patients who are not currently able to find a donor.\n\nSo we have a head-to-head study, a very well-conducted study led by Ronit and her team. So once we are through the U.S. regulatory approval process, we will then look to advance regulatory activities in other regions, knowing that there's an important patient need for Omidubicel throughout the world.\n\nEdward Tenthoff -- Piper Sandler -- Analyst\n\nGreat. That's very helpful. Thank you so much.\n\nJulian Adams -- Chief Executive Officer\n\nThanks, Ed.\n\nOperator\n\nAnd our next question coming from the line of Jon Miller from Evercore. Your line is open.\n\nJon Miller -- Evercore ISI -- Analyst\n\nHi, guys. Thanks so much for taking the question. I was interested because of your cash runway guidance explicitly not including commercialization from Omidubicel. What is your, I guess, your focus on launching that internally versus your willingness to consider a partnership or approach partners? Has there been BD interest in the only platform in the U.S.?\n\nJulian Adams -- Chief Executive Officer\n\nSo we believe that we are best able to launch Omidubicel in the U.S. We have built a very strong commercial team under Michele. And since it's a highly targeted and focused market, I think we feel that the footprint is -- matches our capabilities. Michele, would you like to further comment?\n\nMichele Korfin -- Chief Operating Officer and Chief Commercial Officer\n\nSure. Thank you, Julian. Good morning, Jon. Thank you for joining us.\n\nWe did assess potential strategic alternatives. And as Julian indicated, we do believe that launching Omidubicel ourselves in the U.S. is the best option for patients and for Gamida. We conducted a thorough assessment of the unmet needs that Omidubicel could address.\n\nWe have a well-thought-out launch strategy and launch plan. And also, we have the experienced leadership team in place to launch a breakthrough cell therapy, such as Omidubicel. I mean this team is the commercial team, it's our medical affairs colleagues that I referenced during my prepared comments. And most importantly, we have the leadership team at our Gamida manufacturing facility to offshore readiness from the manufacturing standpoint.\n\nSo let me turn it back to you, Jon, to see if there's any follow-up questions.\n\nJon Miller -- Evercore ISI -- Analyst\n\nYes. That makes perfect sense. Thank you so much, guys. I guess maybe switching gears, I would be really curious about the time line for the next-gen NK program once it's chosen, how fast you think you can get from IND-enabling studies into the clinic? And relatedly, do you have updated guidance on GDA-201 now that you've started patient dosing there?\n\nJulian Adams -- Chief Executive Officer\n\nThanks for your question. Let me turn it over to Ronit to describe our plans.\n\nRonit Simantov -- Chief Medical Officer\n\nThank you and thanks, Jon. So in terms of the pipeline candidates, after we select a candidate by the end of this year, we will move those forward to IND-enabling studies. And it does take about a year to do those IND-enabling studies, put the IND together, file it, then waiting for R&D acceptance. But during that time, we'll also be designing and initiating operational activities for the clinical trial.\n\nSo that as soon as the IND is accepted, just like we did with GDA-201, we can move forward and initiate a new study. So it will take at least a year to do those things after we select the candidate. In terms of GDA-201, so now that we've dosed our patients, we're safely in the Phase 1 portion. Phase 1 portion, time line can vary depending on what you observed in the Phase 1 portion.\n\nThere are -- the ability to expand cohort, see dose-limiting toxicities or observe anything that you'd like to test more patients on. But basically, it will take approximately a year to go through the Phase 1 portion and then move over to the Phase 2 portion expansion, where we will have more sites enrolled, and we'll be able to move more quickly on the Phase 2.\n\nJon Miller -- Evercore ISI -- Analyst\n\nThanks so much.\n\nJulian Adams -- Chief Executive Officer\n\nThank you, Jon.\n\nOperator\n\nThank you. Our next question coming from the line of Gil Blum from Needham. Your line is open.\n\nGil Blum -- Needham and Company -- Analyst\n\nHi. Good morning, everyone, and thanks for taking our questions. Just a few questions on GDA-201 here. So we're going to have a bunch of updates across allogeneic cellular therapeutics in the upcoming ASH meeting.\n\nDo you think these updates can help increase the profile for GDA-201 and just general awareness of NK cells?\n\nJulian Adams -- Chief Executive Officer\n\nYeah. Thanks for that question, Gil. Absolutely and significantly, NK cells have been reported to be quite well tolerated as compared to CAR T-cells. So I think interest in GDA-201 will absolutely increase as we continue to progress our trial going forward.\n\nGil Blum -- Needham and Company -- Analyst\n\nMaybe a bit of a mechanistic question for Ronit. It was very interesting to hear the biopsy information that you provided at the meeting. So if there is T-cell infiltration, is there any thinking around maybe using reduced intensity conditioning, less conditioning, equaling more T-cells in the patients?\n\nRonit Simantov -- Chief Medical Officer\n\nThanks, Gil. So I agree. I think these are really interesting data. We obviously need to do more to elucidate further exactly the type of T-cells and the clonality of the T-cells found in the biopsies and understand more and a greater number of patients, what's going on.\n\nThe use of the flu side conditioning regimen in patients who are undergoing cellular therapy is something that is also quite interesting to us, as you recall, in the fresh formulation study, we gave second doses without lymphodepleting chemotherapy, although we never give the first dose without lymphodepleting chemotherapy. And it is a general consensus that the lymphodepletion is necessary in some way. The exact doses is -- are still not quite well elucidated, we're interested in exploring sort of the cytokine effect of that chemotherapy, which has been attributed to which the efficacy has been attributed in terms of the cytokine environment. So definitely something that we're interested in looking at and as we move forward with our dosing, we are open to exploring those sort of conditioning regimens that may be useful in potentiating responses to GDA-201.\n\nGil Blum -- Needham and Company -- Analyst\n\nOK. Thank you. And maybe a last one. You mentioned potential partnerships and the discussion on GDA-201.\n\nAre we already thinking of partnering GDA-201 despite it being in the early stage? Or this is more like a strategic collaboration with another agent or what is the thinking around here?\n\nJulian Adams -- Chief Executive Officer\n\nYes. So we do have an interest in exploring what is the most efficient way to bring GDA-201 to patients potentially in the commercial setting. So we are exploring all of our options and I can't comment right now on any partnering discussions, but we'll do so in the future.\n\nGil Blum -- Needham and Company -- Analyst\n\nOK. Excellent. Thank you for taking all of our questions this morning.\n\nOperator\n\nThank you. And our next question coming from the line of Mark Breidenbach from Oppenheimer. Your line is open.\n\nMark Breidenbach -- Oppenheimer and Company -- Analyst\n\nHey. Good morning and congrats on the recent progress. Julian, I was wondering if you can give us a sense for how much of additional pre-launch investment you think would be needed to support manual launch, assuming you continue with plans to go at alone on the launch? And is there a contingency plan in place in case the BLA is approved ahead of its PDUFA date?\n\nJulian Adams -- Chief Executive Officer\n\nThank you for your excellent question and optimism. Shai, maybe you could comment on the launch planning budget.\n\nShai Lankry -- Chief Financial Officer\n\nYes. Absolutely. Hi, Mark. Good morning.\n\nSo as Michele alluded in her prepared remarks, this is not an extensive, I would say, budget that needed to launch Omidubicel. We are talking about roughly between $30 million to $40 million to prepare the company to launch Omidubicel. And we are evaluating, if any, as you can imagine, any biotech company, we are evaluating all options to bring Omidubicel to patients.\n\nMark Breidenbach -- Oppenheimer and Company -- Analyst\n\nOk. That's super helpful -- go ahead.\n\nShai Lankry -- Chief Financial Officer\n\nJulian, do you want to add your remarks as well?\n\nJulian Adams -- Chief Executive Officer\n\nNo. And I think we're quite confident that we can execute, again, under Michele's leadership and Ronit's medical affairs team, I think we can cover this highly focused transplant center engagement, and we feel very confident in our abilities.\n\nMark Breidenbach -- Oppenheimer and Company -- Analyst\n\nAnd just a quick one maybe for Ronit. In the company-sponsored trial of 201, can you just tell us what the starting this was? Was the 20 million cells per kilogram sort of like we saw in the University of Minnesota trial? And can you tell us what tumor histology that the first patient presented with? Thank you very much.\n\nRonit Simantov -- Chief Medical Officer\n\nThanks, Mark. So we are starting a dose or close to the $20 million dose. It's actually 2.5 times of the seven cells per kilogram, and that was really just on the basis of sort of our manufacturing feasibility and calculations of the escalation to make them nice round. So it's about the same, but it was guided by the first dose level in the fresh.\n\nWe're not going to comment yet about details about the patient. But at the right time, we'll certainly share those.\n\nMark Breidenbach -- Oppenheimer and Company -- Analyst\n\nOK. Thanks so much for taking the questions and congrats on the progress.\n\nJulian Adams -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Our next question coming from the line of Jason Butler from JMP Securities. Your line is open.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nHi. It's Roy for Jason. Just a really quick one on the contracts that you've mentioned between the payers and the transplant centers for Omidubicel. Can you just provide some additional details on that process, once it's approved, is Omidubicel just added to a list of options? Or do you need to go through committees? And if so, it sounds like much of that is going to happen before approval, is that the case? Thanks.\n\nJulian Adams -- Chief Executive Officer\n\nMichele, this is for you.\n\nMichele Korfin -- Chief Operating Officer and Chief Commercial Officer\n\nThank you, Julian. Good morning, Roy. Thank you for joining us. So there's -- let's talk about the commercial payers first, and then I'll talk about Medicare.\n\nSo in regards to the patient mixture, we do anticipate the majority of patients will fall under commercial payers, but that's roughly between 50% to 60%and then probably about roughly 25% or so Medicare and roughly 5% Medicaid. So we're focused on both commercial and Medicare. Let's talk about commercial first. So commercial payers have said publicly and also in our discussions with them that upon FDA approval of therapies that are onetime therapies with curative intent, they will cover these therapies.\n\nAnd we saw that with the CAR-Ts also. So what that means, Roy, to your question is they're not going to have to convene a formulary review committee or a pharmacy and therapeutics committee meeting. They -- commercial payers such that they will cover these onetime therapies with curative intent upon FDA approval. So coverage is well defined.\n\nIn terms of reimbursement, so those contracts, as you alluded to between the payers and the transplant centers or individual contracts, they are highly confidential. That's not anything that the manufacturer gets involved with because it's between the transplant centers and the payers. But we have had ongoing dialogue with both the transplant centers and the payer side to understand what the process will look like for reimbursement upon FDA approval. And we're very encouraged that transplant centers and payers are both saying, yes, there are mechanisms in place within our current contract that allow for reimbursement upon FDA approval.\n\nAnd as I've mentioned, we've been actively engaged in health economic analyses. We've published much of that data already, and we will continue to generate data in case that is needed as part of their ongoing discussions for reimbursement. And then just on the Medicare side, we've already begun to apply for the required codes that would be needed for Medicare. We understand what Medicare that Omidubicel would be mapped at this point in time to the allogeneic stem cell transplant DRG.\n\nAnd then Medicare also has mechanisms in place to pay for or to reimburse the centers for the actual donor stores. So on both the commercial side and the Medicare side, we are very encouraged by the coverage and then also the reimbursement. So let me stop there, Roy, and turn it back to you to see if there's any other questions.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nPerfect. No, that is it. Thank you very much.\n\nMichele Korfin -- Chief Operating Officer and Chief Commercial Officer\n\nThank you.\n\nOperator\n\nNow I'm showing no further questions at this time. I would now like to turn the call back over to Mr. Julian Adams for any closing remarks.\n\nJulian Adams -- Chief Executive Officer\n\nThank you. Our leadership team will be available after the call if there are any opportunities for follow-up discussions. We'll keep you current on all of our developments, and we thank you again for your interest and support in Gamida Cell. Thank you, everyone, for joining us to support in Gamida Cell.\n\nThank you, everyone, for joining us on today's call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHeather DiVecchia -- Director, Investor Relations and Corporate Communications\n\nJulian Adams -- Chief Executive Officer\n\nRonit Simantov -- Chief Medical Officer\n\nMichele Korfin -- Chief Operating Officer and Chief Commercial Officer\n\nShai Lankry -- Chief Financial Officer\n\nEdward Tenthoff -- Piper Sandler -- Analyst\n\nJon Miller -- Evercore ISI -- Analyst\n\nGil Blum -- Needham and Company -- Analyst\n\nMark Breidenbach -- Oppenheimer and Company -- Analyst\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nMore GMDA analysis\n\nAll earnings call transcripts"
}