{
  "companyName": "AstraZeneca PLC",
  "companyTicker": "AZN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/astrazeneca-plc-azn-q3-2022-earnings-call-transcri/",
  "content": "AstraZeneca PLC (AZN -0.44%)\nQ3 2022 Earnings Call\nNov 10, 2022, 6:45 a.m. ET\n\nOperator\n\nWelcome, ladies and gentlemen, to AstraZeneca's year-to-date and Q3 results 2022 conference call for investors and analysts. Before I hand it over to AstraZeneca, I'd like to read the safe harbor statement. The company intends to utilize the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995. Participants on this call may make forward-looking statements with respect to the operations and financial performance of AstraZeneca.\n\nAlthough we believe our expectations are based on reasonable assumptions, by their very nature, forward-looking statements involve risks and uncertainties and may be influenced by factors that could cause actual results to differ materially from those expressed or implied by these forward-looking statements. Any forward-looking statements made on this call reflect the knowledge and information available at the time of this call. The company undertakes no obligation to update forward-looking statements. Please also carefully review the forward-looking statements disclaimer in the slide deck that accompanies this presentation.\n\nThere will be an opportunity to ask questions after today's presentations. [Operator instructions] And with that, I'll now hand you over to the company.\n\nAndy Barnett -- Head of Investor Relations\n\nThank you, operator. And good afternoon, everybody. I'm Andy Barnett, head of investor relations at AstraZeneca. And I'm pleased to welcome you to AstraZeneca third-quarter and year-to-date 2022 conference call.\n\nAll materials presented today are available on our website. Slide 2 has our usual safe harbor statement. We will be making comments on our performance using constant exchange rates, or CER, core financial numbers, and other non-GAAP measures. A non-GAAP to GAAP reconciliation is contained within the results announcement.\n\nNumbers are in million U.S. dollars for the first nine months of the year unless otherwise stated. Please advance to Slide 3. This slide shows our agenda for today's call.\n\nFollowing our prepared remarks, we will open the line for questions. We will try and address as many questions as we can during the allotted time. So, please, participants, limit yourselves to one question or more to allow fair chance for others to participate in the call. As a reminder, for those on the phone, use the raise hand function in Zoom to ask a question.\n\nAnd with that, please advance to Slide 4, and I'll hand it over to Pascal.\n\nPascal Soriot -- Chief Executive Officer\n\nHello, everyone, and welcome to today's call. If you move to Slide 5, we're pleased to report solid results with you today, total revenue of $33.1 billion, an increase of 37%. This includes total revenue in the quarter of close to $11 billion. On a pro forma basis, the growth rate in the year to date, including Alexion, was 19%.\n\nAnd excluding our COVID medicines, the growth was 16%, illustrating the strength of our underlying business. Core EPS of $5.28 in the year to date is up 52 -- to 52% versus the same period last year, with $1.67 added in the quarter. Of course, it helped, but -- helped by the addition of Alexion from July 2021. This performance reflects the strength of our business against a challenging macroeconomic backdrop.\n\nDelivery in the year-to-date and near-term outlook has enabled us to upgrade our full-year guidance. I would, however, point out that the EPS landing in the low 30s of the guidance range will depend on certain factors, including the timing of collaboration milestones and Evusheld deliveries before the end of the year. Aradhana will take you through this change to our guidance in more detail. Once again, we saw encouraging demand for our medicines with growth from all disease areas versus last year. This included double-digit growth for oncology, CVRM, V&I, and rare disease, and the growth of new medicines more than offset the expected decline of Pulmicort within R&I.\n\nPlease move to Slide 6. Our R&D investment continues to pay off. We received a record 19 regulatory approvals in major markets since we reported our first-half results, making a total of 25 approvals in the year to date, with only a selection listed on this slide. I would, in particular, like to call the first global approvals for our CTLA-4 inhibitor, Imjudo, for the treatment of advanced liver cancer, and the approval of Beyfortus for the prevention of RSV in newborns and infants.\n\nWe also announced positive Phase III data for two -- two NMEs: the new component in PNH patients with clinically significant extravascular hemolysis and capivasertib in breast cancer, both with the potential to strengthen our leading positions in their respective diseases. Additionally, we saw encouraging data for Dato-DXd and Camizestrant, enabling us to engage further clinical development of these potentially important new medicines. Please move to Slide 7. A broad portfolio of both marketed and innovative pipeline medicines gives us confidence in our ability to deliver revenue growth at a double-digit CAGR through 2025 and include an industry-leading growth thereafter.\n\nFundamentally, our business is highly resilient with low-concentration risk and a diverse geographical footprint and a broad pipeline. Even excluding our COVID-19 medicines, we have 11 blockbuster medicines, and we have demonstrated success in developing and commercializing medicines in a range of diseases with high unmet medical need. We have 15 NMEs in Phase III clinical development, and we expect to maintain or even accelerate this pace of innovation in coming years. While our portfolio is diverse, we are well placed to lead in fast-growing disease areas such as oncology, rare disease, and several areas of specialty medicine.\n\nOur broad geographical footprint allows us to offset long -- short-term challenges in any one region, which we continue to view as an advantage versus a number of our peers. Delivering on our long-term growth ambitions, we are required to continue to make the right strategic investments. Let me now hand the call to Aradhana to go through our financials as well as provide some detail around our investments to drive future growth. So, please move to Slide 8 -- 8.\n\nAradhana Sarin -- Chief Financial Officer\n\nThank you, Pascal, and good afternoon, everyone. As usual, I will start with our reported P&L. Please turn to Slide 9. As Pascal has already highlighted, total revenue grew by 37% in the first nine months.\n\nAs a reminder, Alexion's sales were only consolidated from July 21st last year. So, this impacts the revenue growth numbers favorably. Collaboration revenue increased 944 million, of which close to 400 million relates to milestones received from partners, including Merck for the Lynparza collaboration. We have booked an additional around 330 million in collaboration revenue for Enhertu.\n\nOur reported gross margin continues to be impacted by the Alexion fair value inventory uplift, which we anticipate will continue for a couple of more quarters until the inventory is sold. Please turn to Slide 10. This is our core P&L. The core gross margin during the period was 81% and increased by 6 percentage points at constant exchange rates.\n\nThe favorable increase in gross margin is mainly driven by lower Vaxzevria sales versus last year and the fact that Alexion sales were only consolidated from end of July. R&D costs increased by 29%, reflecting, again, the timing of consolidation of Alexion last year and also continued investment in the pipeline. We've had several positive readouts this year that have ungated additional clinical trials. Over the long term, we continue to expect that we will keep R&D investments in the low 20s percentage of total revenue.\n\nSG&A cost increased by 24% year to date, reflecting the addition of Alexion and continued investment behind launch brands, including demand generation for Evusheld. We continue to manage SG&A costs by driving productivity, and the operating margin will continue to improve as our product mix evolves between primary and specialty care. However, these will need to be balanced by our long-term growth ambition and investment for that growth, as well as external factors, including inflation and currency. Core EPS of $5.28 represents a growth of 52%.\n\nPlease turn to Slide 11. Our cash flow continues to improve, and we saw cash flow generated from operating activities increase by 2.9 billion to 7.4 billion in the first nine months. In the third quarter, we paid three regulatory milestones totaling 400 million to Daiichi Sankyo following regulatory approvals for Enhertu in both breast and lung cancer. We also paid the last of the three initial upfront payments of 325 million relating to DatoDXd, as well as 100 million for the TeneoTwo acquisition which closed during the third quarter.\n\nThis brings the total amount paid year to date for the Daiichi Sankyo [Inaudible] and other transactions to just over 2 billion. Our current net-debt-to-EBITDA ratio is 2.9 times. If adjusting for the Alexion fair value inventory uplift, which does not affect our cash flow, the ratio is 1.9 times, a reflection of the improvement in our underlying cash flow. Our cash conversion ratio continues to improve, and we continue to focus on working capital improvement, inventory management, and cash conversion.\n\nWe remain committed to a strong investment-grade rating, and our capital allocation policy priorities remain unchanged. Please turn to Slide 12. As a reminder, we upgraded our total revenue guidance and half-year results. Today, we are updating our core EPS guidance for the full year.\n\nWe continue to expect total revenue to grow by low 20s percentage. Despite being an early November, there continue to be several variables that we are monitoring in the fourth quarter, including Evusheld delivery, NRDL update, and VBP implementation with potential stock compensation, and the timing of some approvals with associated milestones. For the full year, we now anticipate core EPS to grow by high 20s to low 30s percentage at constant exchange rate, up from previously mid to high 20s. Although the phasing of expenses in the second half resulted in strong profitability in the third quarter, we expect higher operating costs, particularly SG&A in the fourth quarter, similar to the sequential quarterly increase in prior years.\n\nAs we report in U.S. dollars, we face some currency headwinds with all of our key currencies having depreciated versus the US dollar. Based on spot rates as per the end of October 2022, we continue to anticipate a mid-single-digit adverse FX impact on total revenue for the full year. For core EPS, we now anticipate a mid to high single-digit adverse impact for the full year.\n\nThat is somewhat higher than what we anticipated back in July and reflects further depreciation of our key currencies. This is something to bear in mind when you update your models. Please go to Slide 13. I've previously mentioned that we anticipate keeping R&D investments in the low 20s percentage of total revenue also over the mid to long term.\n\nToday, just over 50% of our total R&D spend is invested in late-stage pipeline, including extensive LCM programs for already launched medicine. About 40% of our R&D budget is invested in early stage pipeline and discovery, focusing on novel therapies, generating proof of concept, and building our in-house portfolio of next-generation medicines, including ADCs, bispecific, and complement therapies. This will help fuel our pipeline beyond 2025. The majority of the remaining part of the R&D budget is invested in global medical affairs, which is focused on real-world data generation and medical education, including driving guideline and practice change.\n\nThis area of spend has become very important with our portfolio shifting into more specialty areas. We have a very disciplined investment approach, where we set high bars from both a scientific and commercial perspective for the assets that we progress into late-stage development. A good example is our PCSK9, which we terminated in the quarter despite it having positive data, but it did not meet our high predefined criteria required for progressing into Phase III development. Our commercial investments include launching new products, new indications in existing markets, and existing products in new markets.\n\nGood examples are Enhertu in HER2-low breast cancer breast cancer and Lynparza in prostate cancer, where considerable market shaping is required. Please turn to Slide 14. With our culture of continuous improvement, we have been working hard to drive productivity and cost savings. Just to share some examples today, we have worked -- we have worked to optimize our manufacturing networks between in-house and external CMOs, as well as build new capabilities, such as continuous manufacturing, to make us more efficient and flexible.\n\nWe're also looking at our global footprint, enhancing how we work, leveraging low-cost location, and growing global shared service centers. We're making great progress on the integration of Alexion, recently moving to a direct, easy distribution model in more than 22 markets. I'm pleased to share that we now have a rare disease unit in China. We've been on a journey shifting late-stage clinical trials from an outsourced model to a more mixed and in-house model that provides greater data control and better trial execution in a more cost-effective manner.\n\nOver time, the investments we are doing today will help accelerate clinical trials and shorten the time needed for regulatory submission, which will allow us to launch new medicines quicker in the future. With that, please advance to the next slide, and I will hand over to Dave, who will take us through the performance of our oncology business.\n\nDave Fredrickson -- Executive Vice President, Oncology Business\n\nThank you, Aradhana. Slide 16, please. We're pleased to report that our oncology total revenue grew 24% year over year during the first nine months of 2022, underpinned by 20% growth in product sales. We saw double-digit product sales growth for Tagrisso, Imfinzi, and Lynparza in the period, as well as very strong continuing momentum for both Calquence and Enhertu.\n\nAcross regions, performance was again nicely balanced with the U.S., Europe, emerging markets, and established rest of world, each also driving double-digit year-on-year growth. As COVID-19 moves into an endemic phase, we've seen improved rates of cancer diagnosis, testing, and treatment during the year. There is still some variability across tumor type and region, notably China, where city lockdowns persist, but we remain optimistic on the underlying global trend. Turning now to individual medicine performance.\n\nTagrisso global revenues grew by 16% year to date. In the U.S., growth was 14%, with Q3 growing at 18%, reflecting continued momentum for FLAURA and ADAURA. In emerging markets, revenues grew 22% with a strong contribution from China and Latin America. EM growth of Q3 of 35% benefited from strong FLAURA volume growth and second-line resilience in China, but also reflects a fairly easy comparison to last year's Q3.\n\nTagrisso and Lynparza both face China NRDL renewal for 2023 to 2024 in Q4. We anticipate both medicines will incur some price reduction as a result of algorithm-based adjustments. In established rest of world, Tagrisso growth was 10% year to date. In Japan, we can now confirm that we anticipate a mandatory price reduction that will be applied in 2023.\n\nFor Lynparza, we continue to solidify the brand as the leader in the global PARP inhibitor class. Product sales grew 19% in the quarter and year to date, led by growth in adjuvant breast cancer following this year's approvals in the U.S., Europe, and Japan, with continued global growth in HRD-positive ovarian cancer and second-line castration-resistant prostate cancer. Slide 17, please. Turning now to Imfinzi, Calquence, and Enhertu.\n\nAll three benefited from good launch performances in Q3. Imfinzi global revenues grew 19% year to date and 26% in the third quarter, with strength in the Pacific indication owing to recovery in lung cancer diagnosis and chemoradiation rates in many regions and the successful launch of TOPAZ-1 in biliary tract cancer in the U.S. Historically, the prognosis for patients with advanced PTC has been very poor, with less than 15% surviving for five years. TOPAZ-1 brings the first IO treatment to the setting, one that meaningfully extends survival.\n\nWe've been pleased with the early performance, with rapid uptake following NCCN inclusion and a strong commercial launch. Turning to hematology, Calquence continues to show excellent momentum with worldwide revenues up 77% year to date. In the U.S., Calquence maintained greater than 55% share of new BTKi starts in first-line CLL, underscoring its position as the clear standard of care. Calquence U.S.\n\nrevenues grew 15% sequentially in Q3. About half of that came from inventory build for the launch of the maleate tablet formation. This approval is important as it removes restrictions on concomitant use with proton pump inhibitors. Together with Calquence's strong data, including an attractive CV safety profile, nearly four years of long-term follow-up, and the positive experience of physicians, we are well positioned for continued momentum as the established standard of care.\n\nIn Europe, expansion continues, resulting in 25% sequential growth from Q2. New patient share continues to rise as we rapidly establish leadership in several major markets. Year to date, sales tripled over the same period in 2021. Finally, for Enhertu, total revenue was up 165% to 387 million, with a clear acceleration in Q3.\n\nIn the U.S. Enhertu continued its gains in second-line HER2-high metastatic breast cancer, achieving 45% new patient share in just five months post-launch of DB03. The August launch of Destiny-Breast04 in HER2-low patients has gone very well too. Enhertu is now being utilized in more than a third of the prevalent advanced HER-positive post-chemo population.\n\nNew starts spanned multiple later lines of therapy, suggesting some bolus effect. Europe and emerging markets have contributed nicely to growth too, with the European launch in second-line HER2-high, following a similar path to the U.S. with Enhertu at more than 35% new patient share in Germany and France in its launch quarter. Across the globe, we continue to be in an exciting period of launch activity.\n\nMost recently, the U.S. approvals of Imjudo plus Imfinzi based upon Himalaya in liver cancer. And we look forward to upcoming approvals of Lynparza PROpel in prostate cancer. I'll now hand over to Susan, who will cover the progress in our pipeline.\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nThank you, Dave. Please turn to the next slide. We had another strong presence at ESMO this year, showcasing our commitment to long-term follow-up, demonstrating the long-duration benefit, the benefit that patients receive from class-leading medicines like Tagrisso and Lynparza. Additionally, we presented encouraging early data from the first of our bispecific molecules in lung cancer.\n\nTagrisso demonstrated a 5.5-year median disease-free survival in the adjuvant setting, with nearly three in four patients alive and disease free at four years. Exploratory analysis also showed reduced risk of disease recurrence in the brain or spinal cord by 76%. This is truly amazing to see as just two years ago, patients with early stage EGFR-mutated lung cancer had no targeted treatment options after surgery. Similarly, follow-up of patients in the PAOLA1 Phase III trial in ovarian cancer saw 65% of HRD-positive patients treated with Lynparza plus bevacizumab alive at five years versus 48% of those on the control arm.\n\nThe overall survival benefit was observed in the HRD-positive group, a prespecified descriptive analysis for the PAOLA1 trial. Lastly, our new PD1-CTLA4 bispecific, volrustomig, formerly Medi5752, presented first clinical data in non-small cell lung cancer. Volrustomig was engineered to block CTLA4 in the presence of PD1 on activated T-cells, improving the therapeutic index and resulting in a favorable toxicity profile when compared to concurrent use of the separate components. We look forward to developing volrustomig across various tumors. Please turn to Slide 19.\n\nTwo weeks ago, we were delighted to share news of significant progress in our breast cancer pipeline with positive readouts for camizestrant and capivasertib. Camizestrant, our next-generation oral SERD, met the primary endpoint in the SERENA-2 Phase II trial by delivering superior progression-free survival versus Faslodex in patients with previously treated advanced ER-positive breast cancer. We believe these data strongly point to camizestrant's best-in-class potential. The camizestrant clinical research program will evaluate multiple hypotheses in ER-driven disease, including in Serena-6, a pivotal trial in patients whose cancer has developed ESR1 mutations.\n\nIt was fantastic to see capivasertib, our potential first-in-class AKT inhibitor, deliver a positive Phase III trial in advanced estrogen-receptor-positive breast cancer. CAPItello-291 met both primary endpoints, improving progression-free survival in the overall patient population and in a pre-specified biomarker subgroup with qualifying genetic alterations. These results indicate a new potential standard of care, allowing patients to continue with endocrine therapy by combining with a medicine which targets the key pathway for endocrine therapy resistance. Please advance to Slide 20.\n\nFinally, a look at into our plans to continue to deliver innovation to lung cancer patients. TROPION-Lung07 is a Phase III trial exploring Dato-DXd in combination with pembrolizumab, replacing platinum chemotherapy in the non-squamous PD-L1 less than 50% population to demonstrate superiority over the standard of care. From our DNA damage response portfolio, we have initiated the LATIFY Phase III trial of celarasertib plus Imfinzi post-IO non-small cell lung cancer. Celarasertib selective ATR inhibition can cause an accumulation of double-strand DNA breaks synergistic with checkpoints inhibition.\n\nBut additionally, we have data showing celarasertib's effect on increasing Type I interferons and its ability to modulate the tumor microenvironment, including effects on myeloid cells, thereby potentially overcoming IO resistance. Finally, we're very excited to debut the second antibody-drug conjugate to come from our internal team, AZD9592. AZD9592 is our first bispecific ADC that has preferential binding in the presence of both EGFR and c-MET expression aimed to direct binding distinctly to cancers, thereby sparing normal tissue. It is this that results in a maximization of efficacy while maintaining a favorable safety profile.\n\nThis molecule utilizes our proprietary topoisomerase-1 inhibitor warhead, and we are looking to develop it in EGFR mutant non-small cell lung cancer patients, particularly in combination with Tagrisso but also in EGFR wild-type patients. Please advance to the next slide, and I'll hand over to Ruud to cover biopharmaceuticals.\n\nRuud Dobber -- Executive Vice President and President, BioPharmaceuticals\n\nThank you, Susan. Now turning to Slide 22. Biopharmaceuticals delivered over $15 billion in sales year to date, reflecting 21% growth at constant exchange rate. Performance in the third quarter contributed $4.7 billion, a 4% increase at CER driven by underlying strength of our diverse portfolio.\n\nCVRM delivered almost $7 billion in the year to date, with Farxiga delivering its third consecutive blockbuster quarter and is now reimbursed in 101 countries for CKD and 112 countries for heart failure. In our respiratory and immunology business, strong performance of recent launch medicines offset the continuous decline of Pulmicort following VBP inclusion in the prior year, leading to 4% growth overall at constant exchange rate inclusive of milestones. Exiting -- exiting the third quarter, Fasenra is the established market leader in severe eosinophilic asthma and achieve expanded leadership within the IL-5 class, with year-to-date revenues exceeding $1 billion. Tezspire achieved 17% new-to-brand market share, with roughly 70% of utilization coming from patients who are new to biologics.\n\nSaphnelo continues to gain market share in the overall SLE markets and achieved 48% new-to-brand share of the IV markets. Our V&I portfolio delivered $3.7 billion in the year to date. And as expected, we saw a sharp decline in Vaxzevria sales in the third quarter due to the conclusion of initial contracts and softening demands, while Evusheld delivered $537 million in the third quarter revenues, reflecting initial demand-generation efforts. Evusheld continues to play an important role around the world protecting the immunocompromised who have no other option for protection against COVID-19.\n\nLooking ahead to 2023, we expect fundamentals will continue to drive growth despite certain previously mentioned dynamics, including Symbicort patent expiry in the U.S., as well as the full impact of Seloken ZOK VBP inclusion in China, which we will -- which we anticipate taking effect this month. With that, I will now turn the call over to Mene to cover our biopharmaceuticals pipeline.\n\nMene Pangalos -- Executive Vice President, BioPharmaceuticals Research and Development\n\nThank you, Ruud, and please turn to Slide 23. During the quarter, we presented data across our biopharmaceuticals portfolio. In CVRM, as mentioned, last quarter, we presented results from Farxiga's Deliver trial at ESC. The analysis showed Farxiga reduced the risk of cardiovascular death by 18% in patients with heart failure with preserved ejection fraction.\n\nIn addition, a prespecified pooled analysis of DAPA-HF and Deliver demonstrated a reduction in CV deaths of 14% and a reduction in death from any cause by 10% in heart failure patients, irrespective of ejection fraction. These important data sets confirm Farxiga's efficacy in preventing and delaying cardiorenal disease. And I say we presented interim analysis from the eplontersen Phase III NEURO-TTRansform trial in hereditary transthyretin-mediated amyloid polyneuropathy. Eplontersen demonstrated a greater than 80% mean reduction in the co-primary endpoint of serum TTR concentration and improved symptoms and quality of life in patients with polyneuropathy. We look forward to sharing these results with regulators.\n\nPlease move to Slide 24. Last week, our long-acting RSV antibody, Beyfortus, was approved in the EU. And this week, it was also approved in the U.K. Beyfortus has the potential to transform RSV protection as the first and only single-dose preventive option for the broad infant population.\n\nApproval was based off our MELODY/MEDLEY clinical program, which demonstrated a 79.5% efficacy against medically attended lower respiratory tract infection caused by RSV. Importantly, that efficacy was shown over the full length of the RSV season. At ERS, we presented the results of the long-term extension trial, Destination, which confirmed the long-term efficacy and safety profile for Tezspire, consistent with previously reported Pathway and Navigator studies. In Navigator, Tezspire demonstrated a sustained reduction in the analyzed asthma exacerbation rate over 104 weeks of 58%, irrespective of inflammatory biomarkers.\n\nDuring the period, we also provided an update on the results from the Messina Phase III trial in eosinophilic esophagitis. Fasenra achieved near-complete depletion of tissue eosinophils, consistent with its mechanism of action. However, this did not translate into an improvement in dysphagia symptoms. We will continue to analyze the complete data set to share with the scientific community.\n\nPlease move to the next slide, and I'll now hand it over to Marc to cover rare disease.\n\nMarc Dunoyer -- Executive Vice President, BioPharmaceuticals Research and Development\n\nThank you, Mene. And please turn to Slide 26. Year to date, rare disease total revenue grew 10% on a pro forma basis, contributing $5.2 billion. Over this period, we saw continued durability of our C5 franchise with increasing conversion to Ultomiris across PNH, atypical HUS, myasthenia gravis, as well as strong demand for Strensiq in HPP.\n\nPerformance in the period also benefited from geographic expansion across our rare disease portfolio. In the third quarter, rare disease contributed over $1.7 billion in total revenues, representing 11% pro forma growth at constant exchange rate. The C5 franchise grew 8%, with Soliris declining 6% in the quarter, reflecting the successful conversion to Ultomiris in PNH, atypical HUS, and myasthenia gravis. Conversion was partially offset by growth in NMO, where Soliris remains the market share leader.\n\nUltomiris delivered growth of 47% in the third quarter, driven by expansion into new markets, as well as the acceleration of the [Inaudible] myasthenia gravis launch in the United States. Beyond the C5 franchise, Strensiq delivered 20% growth in the quarter, driven by strong demand in the United States. Koselugo, now available in 20 markets, also contributed significant growth in the quarter and was granted priority review in China. In the third quarter, performance across the U.S., Europe, and established rest of the world was stable, while emerging market growth of 61% reflects viability over the timing in -- in certain tender markets when comparing to prior year periods. On Slide 27, I'd like to take a few moments to review highlight from our rare disease event, the full recording of which is available on our website.\n\nWe remain leaders in rare disease with a pioneering C5 franchise, which will deliver growth over the near to midterm, and a novel complement and beyond complement medicine, which will help support AstraZeneca longer growth ambitions. We announce Ultomiris will be available in 85 countries by the end of next year and indicated plans to [Inaudible] expansion for cardiac surgery-associated AKI and hematopoietic stem cell transplant TMA, both potential blockbusters opportunities. Beyond the C5 franchise, we continue to progress two of our oral factor D-complement medicine and reported Phase III data, danicopan in PNH patients with clinically significant extravascular hemolysis, which represents 10% to 15% of the overall PNH population not presently managed with Ultomiris. Our next-generation oral factor D, vemircopan, has [Inaudible] Phase II trials for myasthenia gravis endocrinal indications and Phase II PNH monotherapy trial is nearing completion.\n\nBeyond complement, we highlighted plans to initiate a Phase III program for ALXN1850, our next-generation medicine for HPP, following Phase I results. We expect ALXN1850 can more than double the addressable population of Strensiq, given an expanded label and more favorable dosing profile. We also continue to advance our exciting portfolio of novel depletors for the treatment of amyloidosis, which have the potential to bind and clear feeble deposition in tissue and potentially reverse the course of the disease. Phase III trials for CAEL101 in light chain amyloidosis are progressing, and we see significant potential for NI006 for the treatment of TTR cardiomyopathy.\n\nNext, we continue to build bridges with AstraZeneca to maximize our commercial capabilities and operation network. And as you heard, Aradhana speak to you earlier, we are delivering on our commitment at the time of acquisition, and we plan to expand a rare disease portfolio into 100 countries by 2030. As part of our bridges, we highlighted the opportunity to apply AstraZeneca existing genomic medicine technologies for rare disease and made additional progress in this effort with our proposed acquisition of LogicBio, a genomic medicine company based outside of Boston, Massachusetts. Now turning to Slide 28.\n\nThis acquisition enhances our existing genomic medicine capabilities, bringing in-house a team of talented researchers as well as three novel technologies that will help accelerate ongoing effort, including a proprietary AAV manufacturing platform aim to improve product yields and quality. Pending necessary regulatory clearances, we anticipate the deal to close in the coming weeks. Together with my Alexion and AstraZeneca colleagues, I look forward to welcoming the talented LogicBio team in our organization. And I am optimistic as to what we can accomplish together to advance genomic medicine for the treatment of rare disease.\n\nAnd with that, I will turn to Slide 29 and hand on over to Pascal.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you, Marc. Next slide, please. Looking forward, our strategic priorities remain unchanged. We will continue to invest and grow our business with the aim to be at the forefront of industry -- of our industry in the years to come.\n\nAradhana described how we are being thoughtful and disciplined with each investment that we make, driving efficiencies and investing in new technologies to make our development and commercialization efforts faster and more impactful. I would also like to point out that we are in the fortunate position of having several high-priority medicines in development and new launches to support our industry-leading growth. Our long-term margin ambition has not changed. And as you know, the pace of continued margin expansion is dependent on our pipeline success and also on some external factors, in particular, the evolution of currencies.\n\nDelivering value to our shareholders is very important to us. Turning to our outlook for 2023, we will, of course, provide our guidance for the year with our full-year results for 2022. But I would point out that we anticipate at least 18 Phase III trial readouts in the year. We also look forward to announcing a range of new Phase III starts for key medicines as we strengthen our pipeline and our business outlook for the next decade and beyond.\n\nNow we'll close with Slide 31. Importantly, I've just returned from the COP27 conference, and I would like to highlight our landmark announcement as an industry. Through the Sustainable Markets Initiatives Health Systems Task Force, which, for those who do not know, is a public-private partnership I convened. And the overall SMI umbrella, which was launched by King Charles III two years ago.\n\nWe have collectively, as an industry, made significant commitments to tackle the climate crisis. The private sector organizations in this coalition will have their own decarbonization targets, including our own Ambition Zero Carbon strategy. However, what makes this announcement unique is the task force's ability to unite and drive collective action at scale, addressing emissions across our supply chains, patient care pathways, and clinical trials, and setting a benchmark to inspire others. Society is increasingly looking for companies to step up and lead by example in addressing climate change, and that is what we intend to do.\n\nNow, we'll turn back to Andy.\n\nAndy Barnett -- Head of Investor Relations\n\nThank you, Pascal. If you turn to the next slide, please. For those on the phone, to ask a question, please use the raise a hand function, and we will attempt to answer as many questions as we can during the allotted time. However, please limit the number of questions that you ask to allow others on the call a fair chance to participate.\n\nLet's now take the first question from the call.\n\nPascal Soriot -- Chief Executive Officer\n\nSo, the first question is Simon Baker, Redburn. Simon, over to you.\n\nSimon Baker -- Redburn Partners -- Analyst\n\nThanks for taking the question, Pascal. One, if I may, on oncology, but in two parts. The first one is fairly quick. Dave, I wonder if you could quantify the -- any impact of stocking on the -- from the maleate form of Calquence in the U.S.\n\nAnd then, secondly, a question for both -- both Dave and Susan. We've seen obviously a lot of developments in the SERD space this year, your positive data, disappointments elsewhere. If I look what consensus estimates have done over the course of the year, they've -- if anything, they fall rather than risen. So, that may just be a lagging effect on the part of analysts.\n\nBut I just wonder how your view has changed on camizestrant in light of what you've seen in terms of the data and the market opportunity in light of disappointments elsewhere. Thanks so much.\n\nDave Fredrickson -- Executive Vice President, Oncology Business\n\nSo, starting, Simon, on your first question on Calquence, what I had mentioned in the prepared remarks was about half of the consensus beat, we believe, is a result of stocking in the U.S. from maleate. Just to put a little bit more on that, U.S. demand continues to be quite strong in front line.\n\nNew patient share in CLL is now greater than 55%. And I also would like to note that I think it's important, with the maleate tablet approval in the U.S., we now really address an important patient need, which is the ability to be able to combine with PPIs. And this really adds to the value proposition of Calquence more broadly. Susan, do you want to comment on cami?\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nYeah. So, we remain confident in the profile that we've got with camizestrant and also the role for a next-generation SERD in improving and becoming a backbone, best-in-class endocrine therapy, and particularly in the endocrine-sensitive disease which is in first-line metastatic hormone receptor positive and in the early stages of -- of breast cancer. In order to achieve that profile, you have to have the right safety profile, which is absolutely key, and the combined ability with other medicines such as CDK4/6 inhibitors. So, the profile that we have with camizestrant is one we're confident, and we're happy to discuss the data more once we share it at San Antonio Breast Cancer Conference.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Simon. Next one is Sachin at Bank of America. Over to you, Sachin.\n\nSachin Jain -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking my questions. Just two pieces, one financial, one pipeline. Firstly, on the financials, Pascal very kindly noted pace of margin expansion would depend on pipeline and FX.\n\nCould you give us, based on what you know today, your best view of how you think that might just regress? And I guess I'll frame the comment related to consensus, which has 500 basis points over the next two years and roughly half of that next year. So, based on what you know today, does that look fair or not? Second question is on the PD1CTLA4 bispecific. One if, Susan, you can give some more details. You've referenced a comprehensive program, but is that next step Phase III, or do you need more Phase ii? How many tumors are you debating? I'd be thinking sort of four to five.\n\nAnd any more color on the lower-dose efficacy where we had only limited data at this point. Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nSusan, do you want to start with the first question? And maybe, Aradhana, you could take the other one.\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nSo, obviously, as we said at asthma, we're continuing to look at both the 750 and 500-milligram dose levels for [Inaudible] to make. And you can see that we will be looking at the discontinuation rate, as well as the longer-term progression-free survival rate in those -- in those settings. And again, we're confident based on the data that we've seen that we've got a good profile there. And, you know, as we develop the development plan, we'll be happy to share those progress with you.\n\nAradhana Sarin -- Chief Financial Officer\n\nSo, your second question regarding margins. So, again, our ambition relating to improving margins consistently remains very much the same. You've seen this year we have continued to improve our margins. And I talked about several productivity initiatives that we have to -- to continue to improve that.\n\nI think, looking forward, we continue to see very strong business performance across all our -- our various units. We talked about 19 approvals this quarter, and obviously, we're looking forward to some more later this year and launching all of that in -- in 2023. We're seeing strong growth in our emerging markets business. And R&D, we are committed to continuing to invest, and you've seen strong pipeline success and track record there.\n\nAnd then, obviously there are external factors, including currency, inflation. A key variable is the -- what happens with our COVID medicines in the coming year and then also the NRDL and VBP. So, there's a lot more variables that I just laid out. So, again, we won't be giving guidance for 2023 until we announce our full-year results.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Aradhana. If you look at Q3 and our operating margin and the improvement we achieved despite what I would call a really kind of strong really forex headwinds, that really reflects the strength of the underlying business. But having said that, you know, moving forward, as Aradhana said, there's so many variables. We need to get a better sense of where those currencies go and what the outlook for the future is.\n\nBut certainly, the ambition remains intact at this point. The next one is Andrew at Citi. Over to you.\n\nAndrew Baum -- Citi -- Analyst\n\nYes. Thank you. A couple of questions. Firstly, could you talk to the outlook for your COVID-19 monoclonal antibodies, Evusheld? On the one hand, you have got escape variants which may impact the EUA.\n\nOn the other hand, I know you have next-generation monoclonals. If you could update us on timing and how you're thinking about what you intend to deliver to the market next year, that would be helpful. And then, second, Forxiga obviously is a cornerstone diabetes drug, but the road is running out, although you do have lifecycle management strategies. I know you have a long-standing collaboration with Amgen, which doesn't have a primary care business.\n\nThey recently posted data with AMG 133. You killed your [Inaudible] agent in diabetes and in obesity. I'm just curious as to whether there would be any appetite for engaging and extending that collaboration. Any thoughts there? And then, finally, very quickly, feel free to pass on this.\n\nCan you tell me why you shouldn't expect Calquence to be significantly revised down once given near-term BCM guidelines? And second, Imbruvica may well have a price negotiation cut of about 65% to 26. Feel free to pass those in the interest of time.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you, Andrew. And I'm so happy that Andy took the thankless task of asking everybody one question. He has not succeeded at all so far today. Can we quickly cover the last one, Dave, or, yeah, do you want to start with this one? And Iskra could cover the monoclonal and Evusheld.\n\nDave Fredrickson -- Executive Vice President, Oncology Business\n\nYeah. So, Andrew, from our perspective, as we continue to look at the performance of Calquence, we see that -- really the results, whether it's from our own Elevate-TN studies, the Alpine results, what we're seeing coming out at ASH, that all of this underscores our belief. And I think it's consistent with what we hear from the marketplace that the next-generation BTKis like Calquence have a differentiated and better profile than the first-generation BTKis. And I think that this is what gives us confidence in our ability to continue to establish Calquence as the standard of care within this next-generation class.\n\nWhen I take a look at the progress that other competitors have made in places where we face head-to-head competition in the U.S. in MCL in the relapsed/refractory setting, Calquence share has held strong. The gains that zanu have made have come at the expense of ibru. And we continue to see good progress being made in terms of innovations with things like the maleate tablet formation.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you, Dave.\n\nIskra Reic -- Executive Vice President, VNI\n\nThanks, Andy, for the question. Let me first address your -- your first part of your question around the Evusheld outlook. So, I think it's important to know that Evusheld is still playing a very important role for the immunocompromised patient. As we know, this is the only option for those patients to be protected from COVID-19.\n\nAnd we also know that they are under significant high risk of the hospitalization and death from -- from -- from COVID. Now, it is true that the new variants that we see arising can -- can have -- can cause the decrease of the activity of Evusheld. And we are obviously, together with the governments, monitoring and collecting the data, both in vitro lab, neutralizing data, as well as real-world effectiveness data to make sure that Evusheld keeps clinical efficacy for those -- for those patients. You would appreciate that it's very difficult to forecast the new variant outlook, and it seems that this winter will be a winter of many different variants.\n\nSome of them will be less active, or in some of them, Evusheld can be less or more -- or more active. But we are definitely continue to work with regulators and governments to collect and provide the data. On your second question, on the -- on the -- our new Evusheld 2.0 and next generation of the long-acting monoclonal antibodies, I think this really speaks to our commitment to the immunocompromised patient. And we are doing our best to accelerate the development and delivery of the of the new Evusheld.\n\nCurrently, we are in the preclinical development, and we are -- we believe that we will be able to -- to bring it to the patient at the end of the next year.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you, Iskra. And to -- just maybe to add, I think it's important to remember, at the end of the day, what matters is the clinical activity. And then, sometimes, we see reduced activity in -- in laboratory studies. But in fact, in real life, what we have seen so far is continued high level of protection, especially against severe disease with -- this antibody, it continues to be active.\n\nAnd -- and as -- and we haven't had any concerns expressed by authorities so far. And as Iskra was explaining, those variants, that change a lot. And we see in some countries new variants emerge that are very contagious, that are actually sensitive to Evusheld. So, this situation can change the other way around very rapidly.\n\nSo, it is -- it is really hard to predict. On the Farxiga front, I mean, you're right to say that we have a strong commercial organization. And I think we're all very proud of the work the team has done around the world. And a primary care organization that has the strengths that we have is -- it's quite rare in the industry actually.\n\nAnd beyond primary care, we have strengths in nephrology and cardiology and dermatology, and that positions us well to do business development activities. But as it relates to specific case that you mentioned, as you can imagine, I cannot answer. The only thing I can tell you is that we certainly continue to look at potential business development opportunities that fit with our therapy areas of focus and where we could add value through our expertise and also, importantly, our global commercial network. So, we'll move to the next one.\n\nTim Anderson at Wolfe.\n\nTim Anderson -- Wolfe Research -- Analyst\n\nAll right. Thank you. Enhertu, in the U.S., a big -- a big quarter. Was that all demand driven, or was there some stocking and bolus? And then, is it unrealistic to think that global peak sales of the molecule could surpass the Tagrisso peak at some point well into the future? And then, a second question on the PPI litigation.\n\nFor a long time, Astra had that joint venture with Merck, the Astra-Merck joint venture. Is any potential financial liability that you face shared with Merck because of that? And if so, are the parties in dispute in any aspect of this? Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nSorry, Tim, can you repeat the second question so we make sure we have got it correctly?\n\nTim Anderson -- Wolfe Research -- Analyst\n\nYeah. So, my question is just on the PPI litigation.\n\nPascal Soriot -- Chief Executive Officer\n\nAh, yeah.\n\nTim Anderson -- Wolfe Research -- Analyst\n\nSo, you, you know, used to have the Astra-Merck joint venture on one year [Inaudible] this year [Inaudible]\n\nPascal Soriot -- Chief Executive Officer\n\nOK. Got it. Got it. Dave, do you want to cover the first one?\n\nDave Fredrickson -- Executive Vice President, Oncology Business\n\nYep. Tim, the growth that we saw in third quarter came from continuation of progress on Destiny-Breast03. And we continue to see good inroads as we displace Kadcyla use in that second-line HER2-high population. And then, I would say that the real change in -- in velocity, if you will, of the uptake is the addition of the HER2-low DB04 launch.\n\nI do think that we might have some bolus of patients coming on across multiple lines of post-chemotherapy. There is not, though, a stocking effect in there, so, there may be some demand bolus that we see. And we'll have to see what the duration of therapy is for some of these patients. I would imagine that if you're a sixth-line post-chemo patient that it'll look different than if you're a third line.\n\nSo, I think that's some of what we'll need to say play out. But it is all demand based from what we've seen. And there's still quite a few patients that are not receiving Enhertu in this post-chemo setting. So, there's a lot of growth still -- quite a lot actually still remaining.\n\nIn terms of the overall outlook, I think Enhertu could be one of the largest medicines in oncology going forward. And whether or not that's bigger or less than Tagrisso, I think Tagrisso is one of the largest also. So, I sort of put them all in the same category.\n\nPascal Soriot -- Chief Executive Officer\n\nBut it can be very big. If you look at in-market sales, right?\n\nDave Fredrickson -- Executive Vice President, Oncology Business\n\nRight.\n\nPascal Soriot -- Chief Executive Officer\n\nThat's -- I think Dave was talking about in-market sales because, of course, we only record a little bit less than half of those sales, yeah? But it will -- and we entered this partnership assuming a good product but more modest forecast. And in fact, we are, you know, rapidly moving to an upside here that will make Enhertu a very large product in the industry. Aradhana, do you want to cover the second one?\n\nAradhana Sarin -- Chief Financial Officer\n\nSure. So, relating to the -- the Nexium liability, this was originally obviously a product that was developed through the Astra-Merck venture. And at that point, you know, AZ kept the products and the liability, and we paid market share of the profits. Going forward, and where the cases stand today, we are essentially liable for our own, you know, whatever happens in this litigation.\n\nWe're obviously very confident in our position, and we continue to defend vigorously. As you know, already 5,000 cases have been dismissed, and the first of the pending cases will start trial early next year. And, you know, we'll we'll see how they go one by one.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you. Mattias at Handelsbanken. Mattias, over to you.\n\nMattias Haggblom -- Handelsbanken Capital Markets -- Analyst\n\nYeah. Thanks so much for taking my question. Questions sort of related to an earlier question on Evusheld and its long-term projections, which consensus at least carry material expectations from. So, when the company guides for double-digit growth until '25 and then industry-leading growth beyond '25, to what extent should we be thinking on pandemic-related revenue as part of those growth projections or, rather the opposite, that's all such statements exclude for pandemic-related revenues? And then, secondly, I know you're not going to talk about core EPS outlook for '23 here today, but consensus apparently is carrying a low single-digit R&D increase for next fiscal year.\n\nAnd I'm trying to reconcile that with the 19 Phase III readouts for next year, and I hope that will be appreciated.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you very much. Just -- let me just cover the first one, which really relates to statements were made in the past. When the first time we made those statements, we didn't really know what Evusheld would look like, quite frankly. So, those growth projections, they were made outside of the COVID franchise [Inaudible] And of course, now you have to sort of adjust to some extent for this -- these sales we've experienced in between.\n\nBut fundamentally, the long-term growth doesn't depend -- doesn't rely on -- on the COVID franchise. We hope and we believe that Evusheld and Evusheld 2.0 can be durable over the next few years, but certainly, our leading goal, right, was to -- forecast beyond 2025 doesn't depend on it. The core EPS, you want to cover that question, Aradhana?\n\nAradhana Sarin -- Chief Financial Officer\n\nSo, I think the question was really relating to the R&D expense that you have for 2023.\n\nPascal Soriot -- Chief Executive Officer\n\nYes, yes.\n\nAradhana Sarin -- Chief Financial Officer\n\nSo, again, we will not give guidance for 2023 today. But as I mentioned, we do expect to maintain, you know, strong investment in R&D. We've shown a very strong track record, and we've said that our R&D expense will remain sort of in the low 20s percentage as a percentage of revenue. Obviously, that will be underpinned by high-quality assets that will continue to advance.\n\nPascal Soriot -- Chief Executive Officer\n\nMaybe one thing I could add to this is it brings us back to our products. I mean, if you look at it, Enhertu has enormous potential, I think we have just mentioned it, but we have to support it. I think that DatoDXd is probably still underestimated. It has enormous potential.\n\nAnd we will, together with our partners, Daiichi Sankyo, we will really invest in it to maximize it. Now, where were very excited recently, as you heard from Susan, to see the results of SERENA-2 study. Camizestrant has good potential -- or great potential and also -- but what we have to invest in it, and we are doing this. And now, you know, many more like this.\n\nWe are investing in Tezspire. We are looking at our IL-33 [Inaudible] and we will also look at -- based on the results we see in Phase II, we will also look at potential investing in several indications. So, we will, you know, maximize the value of each key asset we have. They all have large potential, but of course, it will require R&D investment.\n\nSo, certainly, our goal is to continue investing in R&D at the same level as we've said before, which is in the sort of a low 20s. And by the way, maybe I should also have added that the rare disease early pipeline is starting to mature. And over the next two to three years, we're very excited to see the kind of products we could actually bring to Phase III and then to patients. So, all of this takes us back to continued investment in R&D.\n\nThere's no question. Mark Purcell at Morgan Stanley. Over to you, Mark.\n\nMark Purcell -- Morgan Stanley -- Analyst\n\nYes. Thank you, Pascal. Good morning. Good afternoon, everyone.\n\nA couple for me. Firstly, on Dato-DXd. Could you sort of help us understand the more predictive biomarker you've developed for lung cancer and the implications for opportunities beyond the first and second-line setting in non-small cell lung cancer? What's your latest thoughts in terms of development there? And then, a very quick second, in terms of the SERD camizestrant, is there an opportunity to -- for filing based on an accelerated approval approach on the back of the SERENA-2 data? Thank you very much.\n\nPascal Soriot -- Chief Executive Officer\n\nSusan?\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nSure. So, on Dato-DXd, the biomarker that we're looking at, you know, will be based on the expression of TROP02. And as I've said before, I think it's important that you get the right immunohistochemistry assay for that, understand the cut-offs, which we're looking at using computational pathology, among other techniques. So, I think that might be important in terms of identifying the right patient population across a number of different potential indications for Dato-DXd.\n\nThat being said, I think in the first TROPION-Lung01 study, we're very confident based on the data that we've already seen from the Phase I that we can beat the current standard of care in all-comers patient population. With regard to your second question, for all SERD, again, the SERENA-2 study was designed as a randomized dose-finding study. And the setting of second-line endocrine-sensitive breast cancer isn't one where monotherapy -- endocrine therapy is perhaps the best opportunity to make the biggest difference for patients. Nonetheless, we're, you know, excited by the data that we've seen in the SERENA-2, and we look forward to showing that at San Antonio.\n\nAnd -- and we're -- we look forward to the confidence that gives us for where we think we can make the biggest difference, which, as I've said, is -- is early line and the early stage setting of endocrine-sensitive breast cancer.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Susan. Steven Scala at Cowen. Steven, over to you.\n\nSteve Scala -- Cowen and Company -- Analyst\n\nThank you. I have one question and one follow-up. First, on Lynparza, should we expect the CRPC label to reflect the PROpel population or be more narrow than that in some way? And second, Pascal, this is the follow-up. You've been in the industry a long time and have seen a lot of product-related litigation.\n\nCan you put the Nexium litigation in context? And how does it compare to other situations which, maybe, had less-than-ideal outcomes on any key legal or medical -- medical, legal, or -- or other parameters? Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nSusan, you want to take the first one?\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nYeah. So based on the data that we shared at ASCO GU at the beginning of this year, you can see a clinically meaningful improvement in radiographic progression-free survival in both the patients that have HRR wild-type and BRCA wild-type population, as well as within the BRCA mutant patient population. So, that clinical meaningfulness and the tolerability that's seen in combination with abiraterone, I think, supports an indication that's aligned with the patient population that was involved. Obviously, we are in continued discussions with regulatory authorities around the world, and we'll update you as soon as we have finalized agreement with those regulatory authorities.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Susan. So, Steven, first of all, let me thank you for reminding me of my advanced age. And as it relates to your question, yes, I have -- in my own career, I've seen quite a number of those cases. And of course, we take every case very seriously.\n\nHaving said that, here, we believe we really have a strong case. Kidney disease is really so much multifactorial and inferenced by so many circumstances, of course, hypertension, diabetes, etc. And, you know, there's clearly no proven link between Nexium and kidney disease. So, we believe we definitely can manage this one.\n\nAnd number of a few thousands of cases have already been dismissed. Having said that, of course, you always have to be prudent and you never know what happens with those cases. But I would say, overall, it's probably at the lower end of any case I have seen in the past in this area. Anything, Aradhana, you wanted to add? No.\n\nSo, James Gordon, J.P. Morgan.\n\nJames Gordon -- JPMorgan Chase and Company -- Analyst\n\nHello. Thanks for taking the questions. Two questions: one financial, one pipeline. The financial question was just about the implied sequential forward in revenues and profitability in Q4.\n\nAnd the question is, how much of a headwind do you think we could see from booking in advance incremental discounting in China on the NRDL renegotiation or algorithm adjustments that were referred to? Is that something that would be a significant headwind in Q4 that we need to think about for our revenue forecasts and for profitability? And then, the second question was about pipeline in EGFR lung cancer and ADCs. So, you announced a new AZD9592, which is wholly owned by Astra and that targets EGFR and cMET. So, is the idea that you would develop this for people who've got EGFR lung cancer in terms of going for an ADC approach? Or could you also develop Dato-DXd [Inaudible] Would you do them in parallel or just one? And could we read this new ADC approach as endorsing the idea that it does make sense to go off to cMET upfront in EGFR lung cancer with J&J, or during -- or is this more of a backup plan and cMET does look like a good thing to target upfront?\n\nPascal Soriot -- Chief Executive Officer\n\nTwo good questions. Aradhana, do you want to take the first one about Q4?\n\nAradhana Sarin -- Chief Financial Officer\n\nSure. Yeah. So, obviously, we have updated our guidance for the full year. And given our third-quarter results, I think you can extrapolate where the range would be for the fourth quarter.\n\nWe've also said that the higher end of that range is -- is very much dependent on a couple of the factors that we mentioned, the delivery of Evusheld, which, again, is -- is variable. We're waiting for the approval of PROpel, both in the U.S. and Europe, and that would trigger certain milestones, as you know, as part of our collaboration. And then, yes, there is, you know, expected some impact from the VBP and NRDL.\n\nAnd we'll know by end of this month where the pricing falls for -- you know, as part of those agreements and, therefore, what the stock compensation impact will be in the fourth quarter. So, I think we've given -- given you enough for you to be able to triangulate that.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Aradhana.\n\nAradhana Sarin -- Chief Financial Officer\n\nSusan?\n\nPascal Soriot -- Chief Executive Officer\n\nSusan?\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nYes, sure. So just in terms of the potential for Tagrisso combinations, obviously, the FLAURA2 study which we anticipate reading out, will give us the answer about the combination benefit of a chemotherapy plus an EGFR inhibitor in the first line. Based on the OPAL dates we presented at ASCO, we're confident about the potential profile that we've got there. We're also exploring combinations with Dato-DXd in the ORCHARD study with Tagrisso.\n\nAnd if that looks promising, that is a potential to go into the -- to the first line. And obviously, that's a nearer-term potential than our AZD9592 where we've just filed the IND and anticipate starting Phase I later this year or early next year. I think in terms of answering your question about the place for a bispecific EGFR MET, obviously, for -- you're doing is a naked antibody that's designed to overcome resistance to EGFR signaling and inhibition. In that setting, you're looking at MET amplification, which is a subset and a small subset of first-line EGFR mutant lung cancer.\n\nIn this case, what we're looking at is the co-expression of EGFR and MET as a hook on the surface to deliver the antibody drug conjugate. So, it's a different mechanism in -- in that regard. And in that setting, what you're looking for is that co-expression of MET and EGFR which is more common, not just in EGFR mutant lung cancer, but also across EGFR wild type, and also in colorectal cancer and other settings. So, I think the potential development plan for AZD9592 is much wider than just EGFR mutant lung cancer.\n\nPascal Soriot -- Chief Executive Officer\n\nYeah, it goes beyond lung cancer, for sure, yeah. And that's really a big opportunity, potentially. Next one is Richard Parkes at Exane.\n\nRichard Parkes -- Exane BNP Paribas -- Analyst\n\nHi. Thanks for taking my questions. First one, I just wanted to push Susan a little bit more on the camizestrant data ahead of the presentation. What we've seen in -- with other compounds is that the benefits in that setting have been almost solely driven by benefit in patients with ESR1 mutant -- mutations.\n\nAnd I just wondered whether you'd seen the same thing in SERENA-2, or have you seen broader activity, so whether you could talk about that consistency. And then, secondly, just on margin progression in 2023, you talked about FX being an uncertainty. So, it sounds like that could be a drag to margins in 2023. I wonder if you could quantify what that would look like based on current spot rates.\n\nAnd then, just on margins, also, you have an ongoing operational efficiency program, which I think you said would deliver over 1 billion in savings. I just wonder how much that will benefit 2023 to enable reinvestment. Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you. Do -- do you want to take the first one?\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nYeah. So, as we've announced, the camizestrant study, SERENA-2, was positive in the overall patient population. You know, you see I can't share all of the details ahead of the San Antonio Breast Cancer Conference, but you'll note that SERENA-2 is a smaller-sized study than some of the other studies that have recently read out. So, you know, again, I look forward to sort of sharing that and the subdivisions.\n\nBut we're confident that, you know, the role of this is not just in ESR1-mutant patients, but also in the endocrine-sensitive patient population beyond ESR-mutated patients.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Susan. I mean, Richard, the -- the FX is definitely a headwind. I mean, it's a headwind this year. We have, of course, a hedge if you want, because we have -- we have cost in -- in pounds and in krona, in particular, and other currencies, and that helps us a little bit.\n\nBut the strength of the dollar is definitely this year a negative on -- on our profitability. And that's why I mentioned before that to increase our operating margin, as you saw in the context of this negative headwind, FX headwind is really a strong reflection of the underlying strengths of the -- of the -- of -- of our company, of our business. As it relates to next year, I'll ask Aradhana to comment.\n\nAradhana Sarin -- Chief Financial Officer\n\nYeah. Again, we're not -- you know, we give some sensitivity analysis relating to what FX could do this year based on the latest rates that we have. I think the general expectation is that the dollar will remain strong in 2023. So, I think you could -- again, we're not providing sensitivity for 2023, which we will do in the beginning of next year.\n\nBut I think it would be fair to assume a similar impact from an FX standpoint going into -- into next year. Relating to your question on the efficiency improvement, which, by the way, also included the synergies that we expect and we're continuing to drive with the Alexion integration, we remain very much on track on that. And we are obviously including that as part of the drive to continuous margin improvement and reinvesting that efficiency into the business. So, that is very much part of our continued improvement in -- in margins.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you. Eric Le Berrigaud at Stifel. Eric, over to you.\n\nEric Le Berrigaud -- Stifel Financial Corp. -- Analyst\n\nThank you, Pascal. One question and one short on financials. The question is on R&I, on respiratory and immunology. For a medium-term outlook, we have many pools and pool year on Symbicort, Pulmicort, and maybe EOI dropping off in terms of new indication for -- for Fasenra.\n\nAnd on the other side, Tezspire growing and PT027 coming. And so, could you get a sense of over the next three, four years how all this will balance out and if we may see just flattening sales slightly decreasing, or if there is an opportunity to remain into the positive territory for this franchise overall? And the small -- short question on -- on tax rates, maybe on the financial, we saw a drop in tax rate for Q3. How much does that say that we're going to be at the low end of the guidance range for the year and maybe for the following years, whether we should stay around '22 level? Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you. Great question. I mean, Ruud, do you want to take the -- the first one?\n\nRuud Dobber -- Executive Vice President and President, BioPharmaceuticals\n\nYeah.\n\nPascal Soriot -- Chief Executive Officer\n\nAnd maybe -- maybe then Mene could also sort of talk a little bit about our pipeline because it gives you a sense of the long-term potential of this franchise.\n\nRuud Dobber -- Executive Vice President and President, BioPharmaceuticals\n\nYeah, absolutely. So, first of all, we're quite pleased with -- with the current performance of -- of the, let's say, our new portfolio of products: Breztri, Fasenra, and Tezspire . And we need to realize that all those products have clear life-cycle management opportunities. The growth of -- of all those products is already quite impressive, and especially the U.S.\n\nlaunch of Tezspire is -- is very hopeful. But we are doing a study with Breztri in asthma. We are doing a study with Fasenra in COPD. And there are multiple other life-cycle management initiatives ongoing in order to further expense that indications for -- for Tezspire.\n\nSo, of all the therapeutic areas, I feel extremely comfortable that the R&I portfolio will see very strong growth. At the moment we have digested the patent loss of Symbicort and the ongoing loss of Pulmicort in -- in --in China. But we are very, very positive about the -- the outlook of -- of our respiratory portfolio. Mene?\n\nMene Pangalos -- Executive Vice President, BioPharmaceuticals Research and Development\n\nAnd just to add, the molecules that you haven't mentioned, we've got tozorakimab, our IL-33, that's in late-stage development for COPD but also will be moving forwards in asthma and acute respiratory failure as well. We have our inhaled biologics which are moving. We have an oral FLAP which is really interesting. And I think -- you know, when you look at the wealth of data, I think we -- we're very well positioned not just with the molecules that we have today, but also the -- the molecules we have -- and obviously, PD027 as well.\n\nYou know, the outcome yesterday was -- was something that we view as -- as positive. We had a good outcome and look forward to talking to the regulators about the -- the populations that we will treat as we move forwards.\n\nPascal Soriot -- Chief Executive Officer\n\nIt's important, with PT027, by the way, to remember this is the first time something like this is recommended in -- in the United States. That's a big -- a big change and the potential is there. But as you heard from Ruud, I mean, the many ups and downs, of course, here, PT027, Breztri, still Fasenra, Tezspire will drive growth. But on the other hand, Symbicort is affected.\n\nPulmicort is declining. So, over the next few years, I think it's fair to expect that this franchise will not grow over the near term as much as the oncology. But it -- it gives me a chance to make a point here, which I often internally make with people. I like cycling.\n\nAnd, you know, when you cycle, you know that if you are at the back of the pack, you consume 30, 40% less energy. And a few years ago, oncology was at the back of the pack, and today, oncology the front of the pack. And we are a business where we basically rotate. And the goals will come from different franchises at the different period of times.\n\nAnd that's the strengths of our company, not only the geographical footprint. China drove our growth for the last few years. In the last couple of years, it's going through its own patent transition. It will grow again.\n\nIn the meantime, Europe, U.S., Japan are growing quite a lot. Oncology is growing. Respiratory, a bit less. But respiratory was going a lot before. It will grow again.\n\nWe have a strong pipeline. And that's really what we have to offer: this diversity of of geographies and diversity of products and portfolio, which gives a certain stability and predictability to the overall company. And of course, now we are now a company that is in specialty care in the U.S. with very, very high operating margins.\n\nWe are targeting an improvement in operating margin, but what we have to offer is top-line -- leading growth rates and also a sudden stability of our company. On the tax rate, Aradhana?\n\nAradhana Sarin -- Chief Financial Officer\n\nYeah. So, just to clarify, we haven't dropped our -- our tax rate. Again, tax is something that, you know, is really hard to pin down quarter on quarter. We have maintained sort of our guidance for the full year and, you know, the quarter-on-quarter variability happens depending on, you know, the -- the geographic mix, the business mix, you know, the progression of certain tax audits, you know, the carryover from prior periods and -- and changes in tax laws, etc.\n\nSo -- so, I don't think you should read too much into that for -- for the full year. As it relates to going forward, again, in the U.K., you -- you realize that we do have an expected tax increase. At the same time, we manage our -- our, you know, tax rate for the long term. And we are continuously doing business planning and tax planning to manage, you know, our the tax rate in the best possible manner.\n\nSo, that's an exercise that we continuously undertake in Q4. Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you. Michael Leuchten, UBS. Michael, over to you.\n\nMichael Leuchten -- UBS -- Analyst\n\nSorry, Pascal. Thank you for taking my question. I just wanted to go back to LATIFY. Susan mentioned it and wondered if she could comment on how to think about that in the context of Lung01 and Lung07.\n\nThere is a way to think about the ADCs in terms of cumulative toxicities over time. But it looks like you're looking at the potential for IO resistance in a different way in the LATIFY -- LATIFY trial. So, just wondering if I'm overinterpreting that or -- or not. Thank you.\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nI just wanna make sure that I understand your -- your -- your question correctly. So, the --the LATIFY study is-- is designed as a randomized comparison versus second-line docetaxel, looking at the combination of ceralasertib and durvalumab. And it does include potential to overcome resistance to IO therapy in patients who've progressed on a prior IO-based regimen in the first-line setting.\n\nMichael Leuchten -- UBS -- Analyst\n\nWould it not create a potential conflict in where you think data could fit longer term in terms of sequencing over time? That -- that's what I was asking.\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nRight. OK. So, I think, first of all, you know, there are lots of opportunities within lung cancer and options that patients are going to want to have. There's also an awful lot of patients that are going to have progressed prior -- after prior checkpoint inhibition, not just in lung cancer, but in other settings.\n\nSo, I just see this as one of the options that we can offer to patients in that second-line setting. And obviously, our ambition for Dato is to move that into the earlier lines of lung -- lung cancer. So, I don't see it, in long term, as a -- as a conflict but as just a range of options that we're going to have for patients in lung cancer.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you, Susan. Jo Walton. Go ahead, Jo. Jo, we cannot hear you.\n\nI don't know if you're on mute. Go ahead.\n\nJo Walton -- Credit Suisse -- Analyst\n\nCan you hear me now?\n\nPascal Soriot -- Chief Executive Officer\n\nYes. Perfect. Go. Go ahead.\n\nJo Walton -- Credit Suisse -- Analyst\n\nThank you. Two quick ones, please. Aradhana, I wonder if you could tell us about how you think about gross margin going forwards. You outlined that you were looking at your footprint and you were really looking at the -- how to optimize that.\n\nHow should we think in terms of potential improvement? You're already at over 80% gross margin. What could that get to in the future? And a second question on Tagrisso that we've all been very excited about the opportunity to move into adjuvant. It has really sort of picked up yet in the sense of patients taking it. I wonder if you could give us an update on levels of awareness in the adjuvant market and the degree to which Tagrisso sales are growing there. Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nYou want to take the [Inaudible]\n\nAradhana Sarin -- Chief Financial Officer\n\nYeah, sure. So, to address your question relating to gross margins going forward and looking long term, again, we -- you know, we remain committed to improving our gross margins. But, you know, I think 80%-ish is -- is a pretty good gross margin in our industry. Now, there are, again, a lot of variables that will determine what that, long term, looks like.\n\nThe first and the most important one is the mix of our -- of our products. And that depends obviously on price, which, again, is, you know, different in oncology and rare diseases versus in biopharma. It's different, for example, in China versus other geographies, etc. Secondly, we are constantly working on improving efficiencies and, you know, our operating, you know, our manufacturing, etc., to make sure we drive efficiencies there.\n\nThirdly, it depends very much on, you know, the -- the costs that we get our product for. You know, the APIs, the raw materials, all of that has a direct bearing. And that's where we are seeing some impacts of inflation that we continue to manage through long-term contracts and procurement activity. And then, fourthly, it depends also on the mix of collaboration revenue.\n\nSo, when you look at gross margin as a percentage, again, I mean, have to be careful a little bit because as we derive more revenues from the collaboration line item, that actually is, you know, reflective of the gross margins of those products. So, I think there are, again, many variables, and we continue to drive on all of them. Dave?\n\nDave Fredrickson -- Executive Vice President, Oncology Business\n\nJo, on Tagrisso, we've seen, on a constant-exchange-rate basis, continued sequential growth on the brand and the duration of therapy from FLAURA has been one of the drivers of that. But our progress on ADAURA has also been a contributor. Now it's been a much longer educational process than what we were able to do in metastatic. And I think, in large part, it's because we're really trying to change behaviors.\n\nJust if I refer back to where we were 18, 24 months ago, there's a lot of patients who are not getting treated with adjuvant therapy at all in the lung cancer setting. There's a belief that surgery alone is sufficient. We've been effectively changing that and making good inroads against that, along with also ensuring that patients that are undergoing surgery in those early stages of disease are referred to multidisciplinary teams and medical oncologists so that they can receive therapy. So, we've been making good progress against it, but it's a slower process that will, I know, ultimately pay off in terms of patient outcomes and in terms of duration of therapy.\n\nAnd we also continue to work on improving screening efforts so that more patients can be identified on the front end. And again, this is something that takes time and effort. And the last thing I will note that we're happy about is that we do also now have the adjuvant approval in Japan, which gives us another market to begin moving against this objective of using it as a growth driver.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Dave. The biggest issue is really screening and diagnosing patients early in lung cancer, which is the big problem compared to breast cancer, for instance. Emmanuel Papadakis, Deutsche Bank. Emmanuel, over to you.\n\nEmmanuel Papadakis -- Deutsche Bank -- Analyst\n\nThanks for taking the question. Perhaps I start with a follow-up in camizestrant. It was mentioned several times, Susan, that you thought this vindicated the potential in earlier lines. And I assume you were referring to an adjuvant as part of that -- excuse me -- but you've yet, I believe, to initiate an adjuvant studies.\n\nPerhaps you could just give us an update on your plans and whether this makes it likely you proceed in a broad all-comers adjuvant population. And then, perhaps on Ultomiris, good quarter. Perhaps you could just give us an update on how the MG launch is going, sources of patients, where you are in terms of converting Soliris share, where you think you are in terms of new starts. And if you'd be happy to provide an opinion, I think we'd love to hear your perspective on the potential implications of the recent factor B data and PNH as well.\n\nThank you.\n\nPascal Soriot -- Chief Executive Officer\n\nMarc, do you want to start with the last question first?\n\nMarc Dunoyer -- Executive Vice President, BioPharmaceuticals Research and Development\n\nYeah. So, let me pull out some comments on the Ultomiris progression. As you mentioned, very strong portion. In the quarter, it was 47%.\n\nRegarding the launch of -- in the U.S. --I suppose you refer to the U.S., but we have also launched in other territories. In the U.S, the progression in myasthenia gravis is quite good both on -- on the front of the conversion from Soliris. So, it is developing as we had expected, but we are also very pleased with the progress we make in naive patient -- naive C5 patients.\n\nSo, we are -- it is progressing as we expected. If we compare -- as a compare, let's say the start of the 2022 and where we are now, we have progressed [Inaudible] substantially in the number of patient in myasthenia gravis, and we only launched Ultomiris in May of 2022. So, good progression on the conversion and on the naive patients. Regarding the factor B, we have seen the announcement of factor B, and we are looking forward to seeing the presentation that will take place imminently.\n\nNow we are very interested in the -- in the results. On all side, we also got a lot of progress on all complement inhibitors. And we have a successful Phase III on danicopan as an add-on in the same patient population, which is patient we developed the EVH on C5 therapy. And we have seen, you know, very -- we have announced the result, they are very good.\n\nWe have also a Phase II study in PNH on the second factor B we are progressing. And we have also all the indication in myasthenia gravis, as well as renal indication. So, we have been very happy to be -- to have the first in class on factor D, and we are now developing three factor D in -- at clinical stage as a novel treatment in the complement cascade.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Marc. Susan, camizestrant.\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nYeah. So, do you think the profile of camizestrant is one that supports its use in the -- in the early stages? Obviously, as you've seen from the adjuvant studies with CDK4/6 inhibitors, that the design of the patient population in the adjuvant setting requires careful balancing of the risks, patients that are high enough risk so that there is unmet need and minimizing inclusion of patients unlikely to benefit. So, again, we're confident about the profile that we've got with -- with camizestrant. We are moving ahead with the development of this program broadly in the indications where you would expect it to have efficacy.\n\nPascal Soriot -- Chief Executive Officer\n\nMaybe let me just add on this that, I said earlier, we have 15 NMEs in Phase III, and we are going to develop each of those products to their full potential. So, with camizestrant, I guess you can see what I mean with that. But that again takes us back to have to continue our investment in R&D, and we keep R&D spend at the low 20s as a percentage of our revenue because we have so many huge opportunities that we can unlock. On the camizestrant side, I have to say Susan and the team did a fantastic job taking their time to identify the right approach, the right dosage, and doing the same now with additional Phase III studies and early -- early -- early treatment.\n\nSo, hopefully, we can make camizestrant a very big product. So, next question is Seamus Fernandez. Seamus, over to you.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nOh, thanks so much for the questions. So, just two quick ones. First, this is really for Mene. Mene, just trying to understand the opportunity that you see in ATTR and, you know, the reason for the significant increase in the size of the study.\n\nJust want to better understand if you guys are either playing for an earlier interim or a --a potentially differentiated label, or if you see potential challenges so that, you know, you're just managing for a potentially different effect size, just given the competitive landscape. So, that's the first question. And then, the second one, Aradhana, I just wanted to better understand gross margin progression in particular. You know, we're seeing higher-margin product actually roll in quite significantly on the collaboration revenue -- collaboration revenue line.\n\nBut just trying to get a better understanding of what the offsets are to kind of maintain what is -- I believe, has been communicated as a likely roughly 80% gross margin. So, just trying to understand why there isn't quite a bit more of an uplift on the gross margin given the collaboration revenue contribution. Thanks so much.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you. Mene?\n\nMene Pangalos -- Executive Vice President, BioPharmaceuticals Research and Development\n\nYes. So, we increased the study from 1,000 patients to 1,400 patients and the dosing period from 120 weeks to 140 weeks. And the reason is because we want to absolutely make sure we have a positive study. Now, we obviously looking at the event rates that we've had, and we're also looking at the event rates of our competitors.\n\nAnd so, just based on those assumptions, we wanted to make sure that we don't miss the positive mortality benefit, you know, by a few cases because we didn't have the rightly powered study. So, it's really to -- to make sure we have a --a positive study. Of course, you know, depending on event rates and -- and we never talk our interims, but you know, we'll be looking at the data. But the sizing of the study is really to make -- you know, to ensure that we get a positive study.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Mene. I mean, you know, this -- one of our values is we play to win. And on this one, we really want to play to win, ensure mortality benefit. And we potentially could have a product that, you know, might be differentiated if we are the only product -- if we have the only product that has shown a mortality benefit.\n\nAnd it would be a real shame to miss the mortality endpoint if we could achieve it.\n\nAradhana Sarin -- Chief Financial Officer\n\nSo, to address your gross margin question, I think you were referring probably particularly to this year to 2022. And, yes, there has been obviously some increase in collaboration revenue. But when you look at the total sort of amount of the collaboration revenue, as you know, versus our total revenue, that's still a very small percentage of our total revenue. That's one element.\n\nThe second element is relating to COVID medicines. So, we did indicate in the middle of the year that we did expect COVID medicines, which included both Vaxzevria and Evusheld, to be in line with where we were last year, which was slightly north of, you know, 4 billion. And Vaxzevria, as you know, we had a lot of initial contracts and that doesn't really contribute much. And we did mention also that gross margins for Evusheld were expected to be lower than the corporate gross margins.\n\nAnd then, I would say the third major element is relating to pricing, and particularly pricing in China, and some of the emerging markets where pricing is, again, not as high as it is in -- in the developed markets. So, those would probably be elements that contribute to the gross margins.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nSorry, we -- we were specifically asking about go-forward margins, just -- just to clarify. We were not asking about this year's margins.\n\nAradhana Sarin -- Chief Financial Officer\n\nYeah, I did. I think there was another question relating to long-term margins, which I addressed earlier in the call. But very much sort of the same -- same elements, I would say. You know, again, would be -- long-term margins would be -- long-term growth margins would be determined by mix.\n\nSo, the mix of rare disease, oncology, as well as the biopharma products, again, those all have different margins: the mix of biologics versus small molecules; the mix of emerging markets; China versus some of the developed markets and pricing in those markets; and then the mix of collaboration revenue versus, you know, 100% owned revenue; and then the impact of inflation and -- and cost increases that are being passed on to us that we continue to manage through -- through our own efficiency and procurement.\n\nPascal Soriot -- Chief Executive Officer\n\nAnd to -- to specific points, I mean, Lynparza is growing and, of course, has a negative effect on margin. The other point that maybe is important to keep in mind is the emerging markets. Emerging markets have -- you know, they're very accretive in profitability, in profit and dollar profit, but they have -- they tend to have lower gross margin. And then, as you could see -- as you can see this year, they're growing tremendously.\n\nThe unmet needs in those countries are enormous, and we have a tremendous commercial presence -- commercial footprint now. We're rapidly becoming a top-three company in every market around the world. And of course, we're No. 1 in China, in particular, but we're No.\n\n2 or No. 3 in most of those countries. They're growing very, very rapidly. They're generating additional profit, but the gross margin rate, the percentage is a bit lower, not massively at all but a bit lower.\n\nAnd that's a sort of a drag toward the -- the lower average. So, you have, you know, puts -- puts and takes in this gross margin. Peter Welford, Jefferies.\n\nPeter Welford -- Jefferies -- Analyst\n\nHi. Thanks for taking my questions. I've got two. Firstly, on China, I guess maybe one for Leon if he's on the call, would be I'm wondering if -- in a sort of slowly emerging post-COVID world in China whether you think we'll see changes in the attitude of both patients and also doctors in terms of treatments.\n\nSo, will we still see patients to the same extent going to hospitals and perhaps going to some of the major cities? Or do you think we'll continue to see a more spread-out level of care, if you like, in China, and how that impacts then your thinking with regards to the commercial footprint in China? And particularly as well, I guess with regards to something like a rare disease unit where obviously potentially, in the developed world at least, vicinity to patients is often used as a -- as a key sort of feature to supply the drug to the patients in the market. And then, secondly, a slightly, I guess, anal question perhaps for -- for Aradhana. I wonder if you could just talk us through what seems to have happened to the sort of FX, or how we should think about the FX impact on your cost base. I guess, since taking over Alexion the level of natural hedge, if we call it that, in the -- in the margin that Astra used to have, seems to have somewhat declined and there's more impact now on the profit from -- from the dollar move we're seeing.\n\nCan you talk a little bit about what -- I guess how we should think about Alexion? I'm assuming that is what it is, impact on the cost base has driven that change. Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nOK. So, Leon, do you want to take the first question?\n\nLeon Wang -- Executive Vice President, International\n\nYeah, Yeah. Actually, COVID cases, this is -- this is still happening in China. And also, China's still taking that zero COVID policy. So, patients for a short treatment, acute treatment, like inhaled nebulizer, these products are more impacted versus oncology and chronic disease management products.\n\nSo, I think -- and the COVID impact right now is still additive to the hospital patient visits in 20, 30% of the urban population. But AstraZeneca is a widespread-covering company and No. 1 company in China. So, we are covering multiple channels, in the community center, county hospital, online.\n\nSo, today's 11/11. So, I think there's a lot of -- even prescription medicine, a big selling online with prescriptions for chronic-disease refill prescription. So, I think AstraZeneca can definitely manage this COVID situation better than other company. They differ greatly by product.\n\nFor rare disease, I think they're still underdiagnosed. And also, affordability is a primary issue in China. So, if affordability can be -- situation can be improved, it's an ideal, and the commercial insurance and the charity program, and also company support -- patient support program so that we can definitely improve the treatment and diagnosis rate in China for rare disease.\n\nPascal Soriot -- Chief Executive Officer\n\nThanks, Leon. Aradhana?\n\nAradhana Sarin -- Chief Financial Officer\n\nHi, thank you for the question relating to the FX. So, again, we -- we did give some sensitivity analysis relating to what the FX impact is. I think your question was also relating to what the FX impact is on the Alexion business. So, in our -- in -- in the AstraZeneca business, most of our manufacturing costs are actually in pounds and Swedish krona, that's where most of our manufacturing is located.\n\nFor the Alexion business as well, actually, most of their manufacturing is located in -- in Ireland. So, it's euro denominated, as well as sourced from, you know, other CMOs which are also outside the U.S. So -- so, I think that's -- those are the currency impacts that you would have on the cost -- the COGS line.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you. Adam Karlsson, ABG.\n\nAdam Karlsson -- ABG Sundal Collier -- Analyst\n\nHi. Thanks for taking my questions. A couple on Beyfortus. We've now got Beyfortus [Inaudible] in the maternal setting.\n\nSo, I want to get your thoughts on how you feel nirsevimab compares to thinking in particular on the relevance of the efficacy drop-off with RSV preF between three and six months. Secondly, Pfizer have talked about the other vaccine providing protection right from birth, although I guess this potential advantage would have been reflected in the data seen so far. Your thoughts on this? And specifically, what is your expectation around when and where post-birth nirsevimab will be administered? Could it be already in the hospital or birth center before discharge? Just finally, if I could squeeze in a final one on nirsevimab, zooming out a little bit, any updates on the anticipated timeline for bringing nirsevimab to the adult setting? And with the competitive picture in RSV now crystallizing, has that influenced how you think about or, let's say, your interest in behalf of the U.S. nirsevimab profits you previously held rights to? Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you, Adam. So, I'll ask Iskra to cover those questions. On the adult form, really, our priorities, pediatrics for now. And I don't think -- I don't think we would want to talk about the adult formulation.\n\nThe key priority for this product is really the pediatric form.\n\nIskra Reic -- Executive Vice President, VNI\n\nYeah, absolutely. We are -- are very pleased with the recent approvals of the -- in Europe and in -- and in U.K. And we are very much focusing on bringing nirsevimab to the -- to the infants and working with the -- with the regulators -- with other regulators and also with the payers to make sure that we bring it across the globe. I think it's good to -- to --to remind everybody on the exciting data we recently presented and that -- and then put that in the context of the of the maternal vaccine as per your question.\n\nSo, if you remember, we -- we presented our data on pooled analysis of MELODY/MEDLEY, showing 79.5 efficacy against all lower respiratory tract infection in the -- in the infants and very importantly during the -- throughout the whole -- the whole season. And if you-- if you look at the high-level data of the -- of the maternal vaccine, it seems that the -- the efficacy against the lower respiratory tract infection is decreasing over the time, and it is increasing around month number three or month number four. Now, if you think about the way how antibody are applied versus maternal vaccination, Beyfortus will basically be given to the infants either at the time of birth if in the season, or later on and -- in the beginning of the season. And based on our data, in both cases, infants will be fully protected throughout the whole season.\n\nAnd the maternal vaccination, it depends when the -- when the -- when the -- the mothers are vaccinated. And that definitely means that with the diminishing efficacy after three or four months, many of the infants may not have the full protection throughout the season, which, I believe, makes a significant difference between the antibody and -- and the maternal vaccination. Part of your question is around the -- where nirsevimab will be initiated. I mean, on one side, I think you understand that that obviously depends on how different healthcare systems are set across the geography.\n\nBut equally, as mentioned, it can be administered either at birth in the hospital if it's within the season or -- or -- or later on at any point, either in hospital or at the primary care.\n\nPascal Soriot -- Chief Executive Officer\n\nThank you, Iskra. Of course, an important point to remember, because if a mother is vaccinated out of season and the baby is born out of season, then basically, when the season comes, there's no protection left with the vaccine, I mean. So, you know, it works both ways. And this product, nirsevimab, really, in the end, the best protection for babies.\n\nLuisa Hector at Berenberg.\n\nLuisa Hector -- Berenberg Capital Markets -- Analyst\n\nThank you, Pascal. And maybe to -- to follow up on R&D, I just wonder what the impact of inflation is on the cost of running the big Phase III trials and whether you have incorporated IRA into your R&D investment decision process already. Thank you.\n\nPascal Soriot -- Chief Executive Officer\n\nAradhana, do you want to take the first one? And maybe Mene and Susan could give comments on the second question.\n\nAradhana Sarin -- Chief Financial Officer\n\nSo, thanks for the question. We are seeing some impact of -- of inflation on the cost of our clinical studies. And it's not just the impact of inflation, but also the impact of some of the labor shortages, which includes, you know, nurses and doctors and facility, you know, shortages that a lot of the sites are experiencing. So, we are seeing some impact of that on our -- on our studies.\n\nAnd then maybe Dave can address the question on the inflation reduction.\n\nDave Fredrickson -- Executive Vice President, Oncology Business\n\nSo, from an R&D perspective, the question was how much is it impacting R&D. So, I would say, you know, as with -- as we do every year, we look at the business cases, launch dates of all of our indications, whether NME or LCMs, and we make our prioritization based on that. And of course, the Inflation Reduction Act is part of that assessment now. What I would say is, you know, the piece that concerns me the most is the big difference between small molecules and large molecules, the nine versus 13 years, because I think, obviously, that adds some complexity to actually the mix of your pipeline.\n\nAnd so, I would say has the potential to encourage us to disinvest in small molecules potentially relative to larger molecules or more complex modalities because they'll have a longer exclusivity period.\n\nPascal Soriot -- Chief Executive Officer\n\nYeah, and there are two major problems with this. One is the small molecule, one that many was raising. And the second is there is a disincentive to start with small indications. That's mostly true for oncology, where if you have to start with a third-line indication, patients would benefit from this, but we may not do it in the future or not launch in the U.S.\n\nWe may launch elsewhere in the world, but not launch in the U.S. until we have approval for a larger indication, because the clock starts as soon as you get approval. So, that's that. Those are really negative factors that are real problems with this invest -- this inflation reducing lower, right? So, with this, I would like to thank you all for your interest in our company and wish you all a good rest of the day.\n\nThank you.\n\nDuration: 0 minutes\n\nAndy Barnett -- Head of Investor Relations\n\nPascal Soriot -- Chief Executive Officer\n\nAradhana Sarin -- Chief Financial Officer\n\nDave Fredrickson -- Executive Vice President, Oncology Business\n\nSusan Galbraith -- Executive Vice President, Oncology Research and Development\n\nRuud Dobber -- Executive Vice President and President, BioPharmaceuticals\n\nMene Pangalos -- Executive Vice President, BioPharmaceuticals Research and Development\n\nMarc Dunoyer -- Executive Vice President, BioPharmaceuticals Research and Development\n\nSimon Baker -- Redburn Partners -- Analyst\n\nSachin Jain -- Bank of America Merrill Lynch -- Analyst\n\nAndrew Baum -- Citi -- Analyst\n\nIskra Reic -- Executive Vice President, VNI\n\nTim Anderson -- Wolfe Research -- Analyst\n\nMattias Haggblom -- Handelsbanken Capital Markets -- Analyst\n\nMark Purcell -- Morgan Stanley -- Analyst\n\nSteve Scala -- Cowen and Company -- Analyst\n\nJames Gordon -- JPMorgan Chase and Company -- Analyst\n\nRichard Parkes -- Exane BNP Paribas -- Analyst\n\nEric Le Berrigaud -- Stifel Financial Corp. -- Analyst\n\nMichael Leuchten -- UBS -- Analyst\n\nJo Walton -- Credit Suisse -- Analyst\n\nEmmanuel Papadakis -- Deutsche Bank -- Analyst\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nPeter Welford -- Jefferies -- Analyst\n\nLeon Wang -- Executive Vice President, International\n\nAdam Karlsson -- ABG Sundal Collier -- Analyst\n\nLuisa Hector -- Berenberg Capital Markets -- Analyst\n\nMore AZN analysis\n\nAll earnings call transcripts"
}