{
  "companyName": "Kaltura, Inc.",
  "companyTicker": "KLTR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/kaltura-inc-kltr-q2-2022-earnings-call-transcript/",
  "content": "Kaltura, Inc. (KLTR 1.77%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, everyone, and welcome to the Kaltura second quarter 2022 earnings call. Please note that this event is being recorded. All material contained in the webcast is sole property of and copyright of Kaltura with all rights reserved. For opening remarks and introductions, I will now turn the call over to Erica Mannion at Sapphire Investor Relations.\n\nPlease go ahead.\n\nErica Mannion -- Investor Relations\n\nThank you, and good morning. With me today from Kaltura are Ron Yekutiel, co-founder, chairman, and chief executive officer; and Yaron Garmazi, chief financial officer. Ron will begin with the summary of the results for the second quarter ended June 30th, 2022, and the trends and areas of focus that are expected to impact the remainder of 2022. Yaron will then review in greater detail the financial results for the second quarter followed by the company's outlook for the third quarter and full year of 2022.\n\nWe will then open the call for questions. Please note that this call will include forward-looking statements within the meaning of the federal securities laws, including, but not limited to, statements regarding Kaltura's expected future financial results and management's expectations and plans for the business. These statements are neither promises nor guarantees and involve risks and uncertainties that may cause actual results to differ materially from those discussed here. Important factors that could cause actual results to differ from forward-looking statements can be found in the Risk Factors section of Kaltura's annual report on Form 10-K for the fiscal year ended December 31st, 2021, and other periodic SEC filings, including the quarterly report on Form 10-Q for the quarterly period ended June 30th, 2022, to be filed with the SEC.\n\nAny forward-looking statements made in this conference call, including responses to your questions, are based on current expectations as of today, and Kaltura assumes no obligation to update or revise them, whether as a result of new developments or otherwise, except as required by law. Please note, we will be discussing a non-GAAP financial measure, adjusted EBITDA during this call. For a reconciliation of this non-GAAP financial measure to the most directly comparable GAAP metric, please refer to our earnings release, which is available on our website at www.investors.kaltura.com. Now I'd like to turn the call over to Ron.\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nThank you, Erica, and thanks to everyone for joining us on the call this morning. Today, we reported total revenue for the second quarter of 2022 of $42 million, up 1% year over year and subscription revenue of $38 million, up 4% year over year. Adjusted EBITDA for the quarter was negative $8.5 million. In the second quarter, we resumed sequential growth across a number of metrics, including total revenue, subscription revenue, ARR, and RPO and saw leading indicators such as conversion of longer cell cycle deals, sales force productivity, and new subscription bookings which we believe supports an expected increase in growth in Quarter 4.\n\nOne of the drivers of this increase in demand is the recent commercialization of our event platform. This product transcends our initial event offering that powered mainly large flagship events along with event services to now also power centrally all events of all sizes across the organization with minimal ongoing event services. As an example, during the quarter, we signed several important events deals, including with one of the big four accounting firms. We chose to use our platform to power thousands of internal and external events globally.\n\nElevating and tracking the level of engagement in virtual events is very important for them as they are digitizing their internal and external communication to increase efficiency and productivity, reduce costs, and to achieve their net zero emissions goal. In this multimillion-dollar deal, our event platform is consolidating and replacing several existing webcasting technologies while providing a high-quality engaging experience with brand consistency across regions and departments and providing insightful and actionable analytics. Beyond our event offering, we also closed video and TV content management and live streaming deals across all of our markets. For example, a major U.S.\n\nbank selected Kaltura, signing a multimillion-dollar contract to manage their internal video content and support corporate communication and two other existing major bank customers purchased additional offerings. We turn out powers video content management and live streaming for five of the six largest U.S. banks. On the product development front, we had another busy quarter, adding to our event platform, new and improved templates, support for custom URLs, advanced analytic dashboards, and additional unique broadcast flows and management features.\n\nWe continue to boost our video quality, optimize our end user interface and further consolidate our unmanned, live, and real-time components into a single comprehensive and streamlined offering that is simple, intuitive to use, and cost effective. And our continue to advance toward the release of the new advanced version of our self-serve webinar product, which, among other things, includes full integration with our powerful video content management and publishing capabilities. We continue to gain market recognition for our product leadership, including winning the Digital or Hybrid Event Platform of the Year award at the Annual B2B Marketing MarTech Awards and being included as a representative vendor in the 2022 Gartner Market Guide for Event Technology Platforms report. On November 15th, we plan to host our second annual virtually live event, focusing on the future of events, be sure to save the date and we're also invited to tune into our recently launched virtually live podcast, which includes weekly episodes of leading marketeers from around the globe and across industries.\n\nWhile the growth engines that we discussed at the beginning of the year are producing results, given the macroeconomic outlook, IT budgets are being reevaluated, presenting headwinds to the slope of a rebound. While this delay reduces our forecasted revenue for the full fiscal year of 2022, we still expect a return to growth in Quarter 4, and stronger year-over-year growth in 2023. It's important to note that most of the forecasted growth in Q4 of this year is a result of already booked deals, not future ones. Moving on to discuss our bottom line.\n\nEarlier this year, we took certain preliminary saving actions and reduced our hiring. And now given the fluid market outlook, we're adjusting our spend accordingly. Today, we announced a cost reduction and reorganization plan that includes, among other things, downsizing approximately 10% of our current employees. The plan is heavily focused on realigning our operations to further increase our efficiency and productivity.\n\nGiven the maturity of the EE&T and M&T business units, including other sales cycles, deployment cycles, and margins continue to converge, we've decided to merge the two segments together and take advantage of operational overlaps. Going forward, we will have a single horizontal structure with mostly cross-company functions and product development, marketing, sales, and professional services. For years of incubating these business units separately, we could benefit from great synergies by merging them together. When you consider the cuts and our path back to profitability, remember that even before COVID, in 2019, we achieved positive adjusted EBITDA and cash flow from operations and then continue delivering positive adjusted EBITDA and cash flow from operations in 2020.\n\nIn 2019 and 2020, we also accelerated our year-over-year revenue growth rate. We have done it before, and we believe we can do it again. Translating to cash flow, while we experienced high operational spend in the first half, we expect to see a reversal in the second half of the year throughout which we expect to post a single-digit cash flow from operations loss. In summary, while it has been a challenging year for the tech world, video industry, and Kaltura, we're encouraged to enter the second half of the year with increased booking levels, a fully commercialized event platform, and new self-serve products on the way and a more nimble and agile organization that we believe will bring us back to profitable growth.\n\nWith that, I'll turn it over to Yaron, our CFO, to discuss our financial results in more detail. Yaron?\n\nYaron Garmazi -- Chief Financial Officer\n\nThank you, Ron, and good morning, everyone. As I review our second quarter results today, please note that I will be referring to a non-GAAP metric adjusted EBITDA. A reconciliation of GAAP to non-GAAP financials is included in today's earnings, which is available on our website at www.investors.kaltura.com. Total revenue for the second quarter ended June 30th, 2022, was $42 million, up 1% year over year.\n\nSubscription revenue was $38 million, up 4% year over year, while professional services revenue contributed $4 million, down 22% year over year. This figure also embodied an approximate revenue reduction of $485,000 as a result of currency headwinds that occurred during the quarter. These headwinds are forecasted to continue and weigh our revenue during the second half of this year as well. The remaining performance obligation were $172.7 million, up 10% year over year, of which we expect to recognize 62% of revenue over the next 12 months.\n\nAnnualized recurring revenue was $151 million, up 4% year over year. Our net dollar retention rate was 100% in the second quarter, compared to 107% in Q1 2022. Note that this quarter, net dollar retention metrics incorporate a full impact of the large customer that, as mentioned in our last earnings call, reduced some of their business with us in the fourth quarter of 2021. This customer has since renewed various existing projects and has partnered with us on new ones.\n\nWithin our EE&T segment, total revenue for the second quarter was $30.4 million, up 1% year over year. Subscription revenue was $28.3 million, up 4% year over year, while professional services revenue contributed $2.1 million, down 30% year over year. Within our M&T segment, total revenue for the second quarter was $11.6 million, up 2% year over year. Subscription revenue was $9.7 million, up 5% year over year, while professional services revenue contributed $1.9 million, down 10% year over year.\n\nGAAP gross profit in the quarter was $26.7 million, representing a gross margin of 64%, up from 62% gross margin in Q2 2021. Within our EE&T segment, gross profit for the second quarter was $20.7 million, representing a gross margin of 68%, down from 70% gross margin in Q2 2021. Within our M&T segment, gross profit for the second quarter was $6 million, representing a gross margin of 52%, up from 42% gross margin in Q2 2021. R&D expenses for the second quarter were $14.4 million or 34% of revenue, compared to 28% in Q2 2021.\n\nThe increase was driven by additional headcount and payroll expenses. Sales and marketing expenses for the second quarter were $16.4 million or 39% of revenue, compared to 25% in Q2 2021. This increase was driven by additional sales and marketing investments, including headcount and personnel-related expenses. G&A expenses for the second quarter were $11.3 million or 27% of revenue, compared to 23% in Q2 2021.\n\nThe increase was driven by additional headcount and third-party related to expenses related to being a public company. GAAP net loss in the quarter was $17.3 million or $0.13 per diluted share. Adjusted EBITDA was a negative $8.5 million, decreasing from a negative of $1 million in Q2 2021. The result is in line with our former plan to increase our spend in order to further fuel our growth as discussed earlier.\n\nTurning to the balance sheet and cash flow. We ended the quarter with $94 million in cash and marketable securities. Net cash used in operating activities was $22.5 million in the quarter, compared to $0.9 million net cash provided by operation activities in Q2 2021. The increase in use of cash was driven by a couple of major customers, the delay payment, both already collected in July.\n\nAs Ron stated, we are expecting a single-digit net cash flow loss from operations throughout the second half of 2022. And in Q3, we have already seen a strong collection momentum. Now I will provide some information regarding our cost reduction and reorganization process. In the second half of 2022, total charges related to the restructuring are expected to be around $1 million.\n\nTotal cost reduction on an annualized basis from headcount downsizing is expected to be around $18 million. As Ron mentioned, we believe this will enable us to achieve a profitable growth faster. I would now like to turn to our outlook for the third quarter of 2022 and for the fiscal year ended December 31st, 2022. In the third quarter, we expect subscription revenue to grow by 0% to 2% between $37.7 million to $38.4 million and total revenue to decrease by 5% to 3% to between $40.8 million and $41.7 million.\n\nWe expect a negative adjusted EBITDA to be between $8 million and $10 million. For the full year, we expect subscription revenue to grow by 5% to 7% to between $152.1 million and $155.1 million and total revenue to grow by 2% to 4% to between $168.4 million and $171.6 million. We expected the full year negative adjusted EBITDA between $27 million and $32 million. In summary, as Ron mentioned, our outlook reflects an expected to return to growth in the fourth quarter of this year, in line with our regional focus of acceleration during the second half of this year, albeit a little delayed within the second half because of this year unforeseen macro circumstances.\n\nThe cost reduction and the reorganization that we are conducting is strength that will bring us back to profitable growth. We are looking forward realizing synergies to combine our two business units. Lastly, our total cash flow from operations throughout the whole second half of 2022 are forecasted to be in the single-digit loss. With that, we will open the call for questions.\n\nOperator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes with Gabriela Borges with Goldman Sachs. Please go ahead.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for taking the question. Ron, I wanted to start on your comment on the reevaluation of budget.\n\nCan you give us a little more color here? How are you seeing the trend difference between M&T versus EE&T? And what are the incremental changes that you're seeing in the pipeline or the willingness to invest that maybe wasn't contemplated three months ago at the beginning of the year?\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nSo again, I want to make sure I understand the question. It's not so much about the revaluation of our budget, but more what's the underlying business trends?\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nYes, correct. What you're hearing from the customers?\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nOK. Great. I'd love to do that. Thank you, Gabriela.\n\nSo first of all, I mean, as mentioned, booking rebounded this quarter to a level that we've not seen since Q3 '21. I mean that sales force productivity was the highest that it's been in over one year. The EE&T sales reps that are doing new logos. It was as good as it was in 2020.\n\nAnd for the customer success folks, it was back to Q2 '21 levels. If you're looking at the proportion of new logos versus upsells, the new logos picked up again after quite a lot of time that it was more upsells and new logos, new logos was kind of a big push forward. We spoke last time about various deals that have been prolonged and the pipeline building up. And now basically, a lot of them have come together, and a lot of them closed now, and some of them are in advanced discussions for Q3.\n\nIn the longer cycles that -- initially, we said that people were having less urgent stuff like that in COVID to address an immediate need. It's less about usage. It's more about thoughtful response to strategic need around video. So it took longer, but we're seeing these close.\n\nAn example of that is the move from the flagship events through the new event platform. And we've given examples. I'll give you a couple more about the event platforms that are closing. In any case, demand is coming across all segments.\n\nThe largest one is still enterprise. Geographically, it's more or less still the same blend. So in EE&T, it's mainly North America, followed by Europe and APAC. Media and telecom, most of the bookings this quarter we're in upsells and not new logos coming from EMEA, then APAC and North America.\n\nNo change in our channel business. It's still on or about 10%. And less professional services, as we've seen before, the percent of professional services out of the new bookings is lower. We have not heard from customers direct discussions on reduced interest because of recession, but obviously, we're cautious.\n\nI did mention in our last call that we feel that at least a good portion of our business is somewhat more recession-proof, education, watching more TV. And in some areas, we're replacing multiple vendors and introducing savings because of economy of scale. And also in general, our event platform is much more economic than a flagship event with a lot of services. So that's kind of the high level of what we've seen.\n\nIf you're looking at a bit of sample deals across enterprise versus media and telecom events, we've given an example of a multimillion-dollar deal around the new customer that one of the big four. We had another customer that's a leading European public sector IT service provider that needed us for webcasting. We had a global asset management firm that had their two-day investor events, several midsized tech companies all do their flagship events. In the traditional content management, we mentioned a bank, a new one, and now we're in five out of six.\n\nA bunch of existing ones use us more to support workflows for both wealth management and live streaming. EDU continues to be a combination of learning management systems, electric capture, and virtual classroom. And we continued our global expansion, closing new deals in U.S., Italy, Switzerland, and U.K. And in media and telecom, we expanded our customers into new countries.\n\nWe have a big telco in Eastern Europe, which we went into multiple new countries with them. We have a lot of more services that we provided around the world for existing customers in the U.S., Europe, and Asia. And in the pipeline, we have major existing bags that are moving forward to add the event platform on top of content management. One of them, by the way, closed already in July, and there's more tech companies that are holding flagship events.\n\nBy the way, some of them are through AWS as a partner. This hopefully gives you a feel of the current deal flow. Is that good for you, Gabriela?\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nYeah. Thank you. Thanks for the details. The other question I have is a little bit of a strategy question, which is you have the offer on the table for an acquisition.\n\nWe saw the shareholder rights plan press release from earlier in the week -- last week. Could you give us an update on how you're thinking about Kaltura's [Inaudible] as a stand-alone company versus via potential acquisition?\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. Well, you saw the two press releases that we issued out. And insofar as offer, our board will evaluate the offer in due course as noted. Insofar as the accumulation of shares by sponsor Q1 investment management, that we did adopt a limited duration stockholder rights plan to help them be an equal treatment of all stockholders.\n\nWe also want to make sure that the board remains in the best position to just charge our fiduciary duties. It's an available standard tool for this type of situation, and we're using it. Obviously, we can't comment further on the topic at this point, and the board will provide its feedback in due course.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nThat makes sense. Thank you.\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes with Matt Niknam with Deutsche Bank. Please go ahead.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nHey, guys. Thank you for taking the question. My question is on adjusted EBITDA. So you've mentioned the headcount reductions are expected to drive annualized savings of about $18 million.\n\nSo I'm just wondering when do you hit that run-rate cost savings level? And then ultimately, what does that imply for adjusted EBITDA in terms of just getting back to breakeven or positive timing-wise? And then I have just one housekeeping question as well. You mentioned single-digit cash flow from operations loss. Is that for 2H? Or is that for the full year? I just want to clarify. Thanks.\n\nYaron Garmazi -- Chief Financial Officer\n\nHi, Matt. It's Yaron. Thank you for the question. Regarding the actions that we took around reducing our headcount and some other savings, yes, the full impact of the $18 million is going to be as soon as we basically complete the process, which will take us another couple more months probably to do it.\n\nWe will start to see the fruits of the improvement in profitability in Q4. And even if you are doing the math right now in order to see the adjusted EBITDA that we guided for Q3 and the remaining for Q4, you will see a significant improvement. The full impact will hit us on next year on 2023. And based on the fact that we -- as Ron mentioned, we see a very nice momentum in bookings and very controlled churn levels, we do believe that we will see the acceleration in revenue continuing to next year.\n\nSo taking the two line items of the revenue continue to accelerate and at the same time, save at least $18 million on an annual basis, we believe that next year, adjusted EBITDA is going to be in the one digit, and we will do our best to take it as close to the breakeven. This is regarding the profitability, especially going to next year. So compared to the number of this year, which is around $30 million, it's going to go all the way to a negative one digit probably for next year. In terms of the cash flow, you will see one-digit negative cash flow from H2 as a whole.\n\nAnd I can tell you that we started this quarter with a very, very strong collection momentum, which, by the way, some of it was the downside that we saw in Q2, but we feel very comfortable that it's going to be a mirror situation in H2 compared to where it was in H1 in terms of the cash flow.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nIf I could just follow up one other question I had -- go ahead, sorry.\n\nYaron Garmazi -- Chief Financial Officer\n\nYes. And one more comment the future cash flow, the future -- the cash flow is at this point is lagging a little bit [Inaudible] the adjusted EBITDA, as you can see. So as soon as we are improving the adjusted EBITDA going to next year, we do believe that going into 2024, we will be able to take it to a positive territory, at least to break even. And as we said before, we are managing our financials in order that we will not need to raise additional cash in the future.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nGot it. Got it. And then the follow-up I had is just more around the longer sales cycles. Has that varied at all across verticals, geographies? I'm just wondering if there's any context or is it more of a general statement in terms of macro impacting the base? Thanks.\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nI think we've seen it most in enterprise more so than any other vertical, not so much geographically different, both U.S. and Europe. Part of that was a function or is a function of maybe that rebound post-COVID. Part of it is a function of the fact that we're moving to an event platform that applies to many more users and as such, requires a more strategic review and further consensus across different buyers.\n\nObviously, the benefit is it's a much more stickier experience at yearlong and part of it might be related to the current macroeconomic condition. But it's largely -- mostly seen in the enterprise, but it is also seen, to some extent, in education. And media and telecom is always hard to tell because it's a clunkier business that does not come in the same volume of deals and not the same frequency of deals. And so it's a bit hard to say.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nThat's great. Appreciate the color from both. Thank you.\n\nOperator\n\nThe next question comes with DJ Hynes with Canaccord. Please go ahead.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey. Good morning, guys. So, Ron, I think at the time of the IPO, the business, just in ballpark terms, was roughly evenly split corporate education and M&T revenue. Would love to get an update like how does that breakdown today? What are the growth rates of the respective efforts? And how does it each contribute to margins?\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nSo insofar as between the three in EE&T or media and telecom as well? What was the question there?\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nAll three of them. So corporate, education, M&T, I would just get an update on kind of how each is contributing to revenue, what are the growth rates of each business, how do they contribute to margins?\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nHappy to do that. So in the IPO or at the IPO time, we were looking at about third of the business coming from media and telecom and then somewhere around 30% more or less coming from enterprise and another 30% coming from education, another probably 10% coming from tech OEM side of the business. Insofar as the trends we've seen, so I'll give you an example of this quarter, what we've seen now EDU was the fastest year-over-year revenue grower, followed by media and telecom, enterprise, then tech OEM by way of order. If you look by way of bookings, the enterprise was the fastest grower by way of bookings.\n\nSo it's a bit of a dance there that sometimes you're pulling forward, sometimes you're pulling back. All in all, where is the greatest momentum we believe this year, I think the greatest momentum is in enterprise. And the reason is that it is the largest TAM and it is the largest game, and we moved from content management into also supporting events and webinars and the rest of it, this is something that is a big market opportunity for us in the post-COVID world. Insofar as margin structure, you would have seen the improvement on the media and telecom side that they've put up.\n\nWe said player that there's going to be the biggest change there, which indeed has been happening. It has become more effective on the recurring subscription revenue with economy of scale in emerging environments as it becomes more sassy. And the percentage of professional services have dropped as we become more transactional there. So we've gained quite a lot of points gross margin in M&T.\n\nThere's been a bit of a shrinking of the gross margin on the EE&T side of the business, if you look quarter by quarter, not very significant, but a bit there. A big portion of it is as we move more toward live in real time, the cost of goods there for cloud resources, etc., are weighing a bit down. The total of it together has caused for an increase in gross margin for the company, which we expect will continue to occur in the quarters ahead of us per the original plan, the multi-year plan that we've provided. What's interesting, and we said that as it pertains to the restructuring plan, is that while M&T gross margins go up and EE&T went down a bit in both cases, representing their trends in one less professional services and the other a bit more through the events, they become even more similar to each other, which both operationally and financially is a good direction for us as we merge these activities.\n\nDoes that address your question?\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYeah. Yeah. That's super helpful color. One follow-up just on the process with K1.\n\nI mean can you comment on how much engagement you've had with their team and where the board stands in the evaluation of the offer that's on the table?\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nYes. Obviously, I'm not privileged to share that at the moment. We will be in a position to, we'll absolutely share it. But thank you for asking.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nOK. Thanks, guys.\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nThank you. I appreciate it.\n\nOperator\n\nThe next question comes with Michael Turrin with Wells Fargo. Please go ahead.\n\nAustin Williams -- Wells Fargo Securities -- Analyst\n\nHey, guys. This is Austin Williams on for Michael Turrin. I just wanted to drill down into the FX headwinds in the quarter and the guide. Is there anything specific that we should be aware of as it relates to currency exposures and how those impacted the full year guide? And conversely, just have you seen a benefit to opex as a result of the stronger dollar?\n\nYaron Garmazi -- Chief Financial Officer\n\nYes. It's a great question because obviously, all of us are trying to handle the situation around currency for always. Let me give you a very quick overview. On top line, definitely, there is a pressure on -- due to the weakened -- weakness of the euro compared to the dollar.\n\nWe mentioned it in my statement that there was an impact of roughly $0.5 million on Q2 because of the euro compared to the dollar. Definitely, when we build the guidance for the year, we were very thoughtful to where it can go. And there is a negative impact on the rest of the year, but we took it into consideration in the number, roughly close to 30% of our business is coming from Europe. So there is an impact there.\n\nThe other side of the coin is that we have some savings coming from the Israeli operation, which, obviously, we are -- we have less expenses in terms of dollars based on the fact that dollar is also stronger compared to the Israeli currency. We also took it into consideration in the way that we guided through the rest of the year in terms of the adjusted EBITDA. But as I mentioned to make a long story short, there is a pressure on top line which, by the way, this is one of the main reasons for the fact that we'll reduce the numbers for the rest of the year. And from the Israeli shekel, there is some benefit and we already took into consideration in initiating the guidance for the adjusted EBITDA.\n\nAustin Williams -- Wells Fargo Securities -- Analyst\n\nThat's great. I just had one follow-up. Dollar-based expansion was down in the quarter. I'm just wondering how or if churn is impacting this number.\n\nAnd if you have any thoughts on just where this number can return in the longer term? Thank you.\n\nYaron Garmazi -- Chief Financial Officer\n\nYeah. I can tell you that gross churn then -- the growth churn, other than the impact that we had from the specific customers that we mentioned at the beginning of the year, we are still taking the hit because of this customer that -- other than the specific customer, we didn't have any significant change in our gross retention, so -- gross churn. So it was very similar to the numbers that we had before. So most of the impact that you see in MDR, which went down, some of it came definitely from this specific customer.\n\nOther than that, some of the bookings that we had in this quarter despite the fact that, as Ron mentioned, it was a very strong quarter, much stronger than previous quarters. It came at the last part of the quarter in the last few weeks of the quarter and therefore, have a very limited impact on the actual revenue for the quarter. But if you look going forward, and we are not guiding for the MDR going forward, at least for the coming -- for the near term, it will probably stay around the same level and will be under some pressure. But we do believe that we see the path going into back -- into the numbers that we had pre-COVID.\n\nI would not assume that we will go at this point to the numbers that we saw, which is close to the 120%. But definitely, we see a path later in the year to go back to the numbers that we had before COVID.\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nI'll just add one point to this and we said that in the last call when we were throwing what we expect to happen to MDR, and we said it's going to probably come down. And the reason is that Q2 '21 last year is a tougher comparison than Q1 '21 given the COVID increases. And so the base by which we're comparing is rising. Conversely, as we look into the continuation of this, that this starts balancing off.\n\nAnd so at Quarter 2, it's a tougher comparison, and we knew the numbers are going to come down.\n\nYaron Garmazi -- Chief Financial Officer\n\nAnd the last point is that the euro -- regarding your original -- the previous question, the euro definitely put some pressure on MDR as well in this quarter compared to last year's quarter.\n\nOperator\n\nThe next question comes with Ryan Koontz with Needham and Company. Please go ahead.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nThanks for the question. Nice to hear about the higher productivity there on the sales front. Any color you can help us understand the adapting go-to-market to this new environment and your kind of near-term tangible opportunities? Any change in sales motion or progress with your partners, your channel partners like AWS, it would be helpful color there? Thank you.\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. We are -- as I said, a bunch of deals are closing AWS, they're a good partner. I think it's the maturity of the event platform is supporting an acceleration here and a good amount of deals are coming from that direction. As I mentioned, it's a new product that has come to be throughout this year really gave -- given birth at the beginning of this year and is now in this quarter in earnest for the very first time contributing in a more significant manner and the same is expected to happen next quarter is quite significant.\n\nI'd say that a lot of these deals, we said that we've never lost them, but just that they came in and they took longer and then they start closing. We said that the pipeline was getting stronger, and we could see the impact of that. And that's happening. And so it's not a big surprise for us.\n\nWe were waiting for these deals to happen and now they have, and we expect more of that to happen. There is a question, how much of this was more kind of a COVID reflex that was down over the first few quarters and now kind of come back up. Especially as I mentioned, when people move from the immediate need that they had for the next month for an event, for more strategic thought process around when and how they're going to replace the whole infrastructure for the company. And even now, as we get more into questions around IT budgets, the fact that we could replace multiple vendors and do that in a more cost-effective way.\n\nThat's really important. So I think that's all leading toward higher productivity. We expect that to continue to be there. One very important thing to note as we think about the future and the numbers that could be there.\n\nSo as part of the reorg that we did now, we said we're obviously combining the two business units in a way that's enabling us to balance better between growth and profitability, but at the same time, trim and optimize and get a lot more synergies. From a sales perspective, we're continuing to kind of freeze and we said that earlier that we're going to slow down the addition. We're kind of raising at the current level of the ramp headcount that the company has. What's interesting is that the acceleration in the second half of the year is not affected by it because it's already kind of pegged in into all the numbers that you have and the people that we have now.\n\nBut if we maintain the same overall productivity that happened this year, not this quarter, but all the way, including the bad first quarter, everything until now and even less than that. And we apply the same gross retention level of this year, that is the same gross retention as last year, it's kind of the base gross retention, we're set to more than double growth rates next year. And so again, obviously, we're not providing guidance, but the idea here is that the acceleration that we see coming for Q4 based on existing deals and the general notion that it doesn't take a revolution or even an evolution compared to this year, which was a very, very tough year to bring about a significant higher growth rate is something that we could expect seeing given existing year results. So let alone, the productivity of this quarter continues forward, that's a higher number.\n\nAnd if we start assuming upsides that are associated with other factors like the economy doing better, our new event platform bringing more business, etc., it could jump up materially. And that, coupled with the fact that as mentioned, the adjusted EBITDA profitability of a single digit, hopefully, mid-single digit next year and the breakeven on the cash that's going to come after and specifically in the second half of this year, being at that single-digit cash, I think, puts us in a different place, and we're looking forward to that.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nGot it. And that success with the events platform, is that primarily coming from enterprise versus tech OEM or anything like that?\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nAll of them are consuming it. And the tech OEM, we're actually supporting folks that are looking to insert components of that into their capabilities. So we have some very interesting cycles there. On the education front, we have multiple schools that have taken our event platform.\n\nI mean one thing to note is we generally think about events and where events could go and what's events about, events are a lot of different things. Events is internal and external. It's marketing, it's customer education, it's training, and executive communication. It's all the way from small webinar to user group, to digital gathering, to trade shows.\n\nAnd the way we built the product that actually touches all these different things across spectrum. So as we look into the future, one, there's an immense benefit to market peers for using these virtual event platforms more so than physical just events in terms of reach and cost and data and stuff like that, then the budgets, as we said, post-COVID that are lower and that could apply. And generally, if there's a recession, that's going to be probably more effective. So we see that used in a lot of different places.\n\nWe think it kind of brings together the best of what we could offer. It's a dramatic shift for the company compared to what we were a couple of years ago and it's a multiyear move and we're cleaning it. The reason we continue to invest over the last couple of years was to get to this point. And I think we're now at a point that enables that.\n\nRyan Koontz -- Needham and Company -- Analyst\n\nAll right. Thanks, Ron.\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nThanks.\n\nOperator\n\n[Operator instructions] The next question comes with Patrick Walravens with JMP Securities. Please go ahead.\n\nPatrick Walravens -- JMP Securities -- Analyst\n\nAll right. Great. Thank you. I mean, so Ron, it's been a rough go so far as a public company.\n\nThere's some green shoots. But just big picture, as CEO, what do you think is the best way for Kaltura to maximize shareholder value?\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nThat's a part of the question then. Thank you, Pat. Look, at the end of the day, the goal of any company is to create free cash flows and to create profits and to be able to distribute these profits over time. Obviously, you need to strike the right balance between growth and profitability, which we're attempting to do.\n\nIt's different things and different times. It's not always the same balance. I think we've now adjusted that balance and we're going into a thoughtful growth and more profitable growth into the future. I think the -- it was important for us to have moved from the smaller pond of content management into the larger pond of additional real-time and events, etc., just because the world is converging.\n\nIt's not that we pick a different fight. It's all the vendors are coming to offer an end-to-end solution that's real deal and real-time into these use cases. So I think that kind of electron jump that we needed to have done was important to invest in the potential of the company in the next few years. I think now that we are coming to be with the right product set, we need to more quickly come back to what we do before, which is to show profitable growth.\n\nI think this has not been a typical year. COVID was in a typical year, but the year after COVID has not been for the industry and for us. There obviously have been a few specific things that pertain to Kaltura. There's a lot of things that are beyond specific.\n\nAnd I think that regression to the mean is a powerful force and things are going to come back, and we are seeing them come back. Like I said, we have leading indicators to talk about, productivity and above booking. And so we believe that we're going to be able to come back to profitable growth.\n\nPatrick Walravens -- JMP Securities -- Analyst\n\nOK. I mean do you think that evaluating your strategic options should also be part of that?\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nThat's always the case, and it's always been considered at any given time. Whatever is right to the shareholders being looked at, it's not a strategy in itself or by itself. But if your question is, are we evaluating the current deal? It's on the table. Will we be evaluating other options? That's our job, and we'll always be doing it for sure.\n\nPatrick Walravens -- JMP Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nIt appears we've got no further questions. So this concludes our question-and-answer session. I would like now to turn the conference back over to Ron Yekutiel for any closing remarks. Please go ahead.\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nJust want to thank you all again for your time and support and hopefully a continued healthy and successful year for everybody. Take care. Bye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nErica Mannion -- Investor Relations\n\nRon Yekutiel -- Co-Founder, Chairman, and Chief Executive Officer\n\nYaron Garmazi -- Chief Financial Officer\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nAustin Williams -- Wells Fargo Securities -- Analyst\n\nRyan Koontz -- Needham and Company -- Analyst\n\nPatrick Walravens -- JMP Securities -- Analyst\n\nMore KLTR analysis\n\nAll earnings call transcripts"
}