{
  "companyName": "Oracle",
  "companyTicker": "ORCL",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/12/oracle-orcl-q2-2023-earnings-call-transcript/",
  "content": "Oracle (ORCL 0.42%)\nQ2 2023 Earnings Call\nDec 12, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Welcome to the Oracle Q2 2023 earnings conference call. [Operator instructions] And at this time, I'd like to turn the call over to Mr. Ken Bond, head of investor relations at Oracle.\n\nPlease go ahead.\n\nKen Bond -- Head of Investor Relations\n\nThank you, Beau. Good afternoon, everyone, and welcome to Oracle's second quarter fiscal year 2023 earnings conference call. A copy of the press release and financial tables, which includes a GAAP to non-GAAP reconciliation and other supplemental financial information, can be viewed and downloaded from our investor relations website. Additionally, a list of many customers, who purchased Oracle Cloud Services or went live on Oracle Cloud recently, will be available from our investor relations website as well.\n\nOn the call today are chairman and chief technology officer, Larry Ellison; and CEO, Safra Catz. As a reminder, today's discussion will include forward-looking statements, including predictions, expectations, estimates, or other information that might be considered forward-looking. Throughout today's discussion, we will present some important factors relating to our business, which may potentially affect these forward-looking statements. These forward-looking statements are also subject to risks and uncertainties that may cause actual results to differ materially from the statements being made today.\n\nAs a result, we caution you against placing undue reliance on these forward-looking statements, and we encourage you to review our most recent reports, including our 10-K and 10-Q and any applicable amendments for a complete discussion of these factors and other risks that may affect our future results or the market price of our stock. And finally, we are not obligating ourselves to revise our results or these forward-looking statements in light of new information or future events. Before taking questions, we'll begin with a few prepared remarks. And with that, I'd like to turn the call over to Safra.\n\nSafra Catz -- Chief Executive Officer\n\nThanks, Ken, and good afternoon, everyone. Well, simply put, we had an outstanding quarter. Total revenue for the quarter was more than $200 million above the high end of our guidance range and grew 25% in constant currency. Even excluding Cerner, total revenue grew 9% in constant currency.\n\nThat's higher than Q1 and on top of a revenue beat this time last year. The strength of the quarter is even more amazing, given that the currency headwind was higher than what it was when I gave guidance, with 6% for revenue and a $0.095 headwind for earnings per share. And yet, we still exceeded the high end of my USD guidance for both total revenue and earnings per share. And as you can see from the numbers, we continue to experience clear, company-specific, and product-specific momentum.\n\nThe reasons are many, but it boils down to a few key points of differentiation. First, more and more customers are recognizing our second-generation infrastructure cloud as being fundamentally better architected for higher performance, better security, and unmatched reliability versus the older first-generation hyperscale cloud providers. Second, customers appreciate the flexibility of our service and business model that enables them to deploy our technologies where it serves them best, whether that be in the public cloud, in dedicated regions around the world, or in a true Cloud@Customer implementation. And third, customers recognize the value of an end-to-end integrated stack of applications, both horizontal, like ERP and HCM and supply chain, and industry-specific applications that focus on their industries.\n\nAnd all of it is on our Gen 2 infrastructure, which is designed perfectly for them as they move through. As customers increasingly look to better value out of their technology investments, many discover that Oracle is much better compared to other alternatives. Gartner formally recognized OCI by moving us to visionary status in its cloud infrastructure and platform services report for the first time. In addition, last week, we were awarded a JWCC Award at the U.S.\n\nDepartment of Defense as they also recognized our capabilities. As all of these differentiators come together and our business continues to accelerate, we expect organic growth for our fiscal year 2023 cloud revenues will be over 30% in constant currency. Now, to the numbers. As always, I'll discuss our results using constant currency growth rate.\n\nTo provide a full picture, both organically and otherwise, I'm going to go over the revenue results including Cerner, and then some of the revenue results excluding Cerner, so you can see what's going on. Total cloud revenue, now that SaaS and IaaS, including Cerner, was 3.8 billion, up 48% in constant currency, with IaaS revenue, 1.1 billion, up 59%; and SaaS revenue of 2.8 billion, up 45%. Now, excluding Cerner, total cloud revenue, SaaS plus IaaS, was up 27% in constant currency at 3.3 billion. Total cloud services and license support revenue for the quarter, including Cerner, was 8.6 billion, up 20% in constant currency, driven again by our strategic cloud applications, Autonomous Database, and, of course, our Generation 2 OCI.\n\nApplication subscription revenues, which include support, were 4.1 billion, up 35% in constant currency. Infrastructure subscription revenues, which also include support, were 4.5 billion, up 9% in constant currency. Applications subscription revenues, including support but excluding Cerner, were 3.3 billion, up 9% in constant currency. SaaS cloud revenue, again, excluding Cerner, was 2.2 billion and was up 16%.\n\nNow, our strategic back office SaaS applications now have an annualized revenue of 5.9 billion and grew 26% in constant currency, including fusion ERP, up 28%; and NetSuite ERP, up 29%. As mentioned already, infrastructure cloud services revenue was up 59% in constant currency. Now, excluding legacy hosting services, infrastructure cloud services revenue grew 69% with an annualized revenue of 3.8 billion, including OCI consumption revenue, which was up 88%; and Cloud@Customer consumption revenue, up 83%; and Autonomous Database, up 50%. Software license revenues, including Cerner, were 1.4 billion, up 23% in constant currency and up 9% without Cerner.\n\nWhat is increasingly resonating with customers is that in an environment where IP investments need to have a fast and tangible return on investment, only Oracle offers customers the flexibility to manage their technology estate so they can deploy incremental investments where it brings them the most immediate value. It also helps that the purchase of technology licenses from Oracle enables them to move to the cloud as they are ready, effectively providing an on-ramp to Oracle Cloud services. So, all-in, total revenues for the quarter were 12.3 billion, up 25% in constant currency. Excluding Cerner's revenue contribution of 1.5 billion, organic revenue was up over 9% in constant currency.\n\nAs a reminder, we no longer operate in Russia, causing total revenue growth to be negatively affected by over 1% of growth over last year. Shifting to margins, the gross margin for cloud services and license support was 79% as a result of the mix between support and cloud. Last year, oracle license support revenue, with its mid-90s gross margins, represented about 65% of the total number of cloud services and license support revenue. Now, it's down to 53%.\n\nAnd this is happening because our cloud services are growing much, much faster than license support. By the way, license support grew 4% this year. Additionally, I would note that IaaS gross margins improved again this quarter, and I expect IaaS gross margins will continue to improve. In response to accelerating demand, we have continued to build data center capacity.\n\nWe have seen that as those centers fill up, margins go up like they did this quarter. Most importantly, gross profit dollars of cloud services and license support grew 13% with Cerner and 6% excluding Cerner in Q2. Non-GAAP operating income was 5.1 billion, up 12% from last year. Operating margin, including Cerner, was 41%, as we continue to integrate Cerner in the quarter.\n\nAs we drive Cerner profitability to Oracle levels and continue to benefit from economies of scale in the cloud, we will not only continue to grow operating income, but we will also grow the operating margin percentage. Further, I expect that this year will be the trough year for operating margin percentages. The non-GAAP tax rate for the quarter was 20.4. I think I guided to 20.5.\n\nSo, basically it worked out where we thought. And non-GAAP EPS was $1.21 in U.S. dollars, down 1% in USD, up 7% in constant currency. The GAAP EPS was $0.63.\n\nAt quarter end, we had nearly $7.4 billion in cash and marketable securities. The short-term deferred revenue balance was 8.7 billion, up 14% in constant currency. Over the last four quarters, operating cash flow was 15.1 billion, and free cash flow was 8.4 billion, with capital expenditures of 6.7 billion. In addition, we now have 40 public cloud regions around the world, with another nine being built.\n\nIn addition, 12 of these public regions interconnect with Azure, giving customers true multi-cloud capabilities. We also have many Cloud@Customer implementations, dedicated regions, and another nine national security regions with increasing demand for more, as customers want to have their data protected in their country. We are careful to pace our investments appropriately but need to continue to build to meet our accelerating demand. Capex this quarter was 2.4 billion as we continue to invest in our cloud to meet this accelerating demand.\n\nWith triple digit IaaS bookings growth the last couple of quarters, we now expect to spend about this amount per quarter for the next few quarters as we build capacity for our customers' needs. This level of spend, though, will not negatively impact our operating margins as we scale. When I talk about accelerating demand, that demand is reflected in the remaining performance obligation, or RPO balance, which is now at 61.2 billion, up 68% in constant currency due to strong cloud bookings, as well as to Cerner. I will also note that the organic RPO growth rate in constant currency accelerated to 28% in Q2, up from 22% last quarter.\n\nAnd approximately 48% of the total RPO is to be recognized as revenue over the next 12 months. Now, as we've said before, I know you're tired of me saying it, but I will. We are continuing -- we're committed to returning value to our shareholders through technical innovations, strategic acquisitions, stock repurchases, prudent use of debt, and the dividends. This quarter, we repurchased 6.1 million shares for a total of $448 million.\n\nIn addition, we paid out dividends of 863 million in the quarter, and the board of directors declared a quarterly dividend of $0.32 per share. Our fundamental principle is to grow non-GAAP EPS while substantially increasing cloud revenue growth. And given our increasing confidence, we will continue to prudently invest as there is strong demand for our cloud services. So, now, let me turn to my guidance for Q3, which I'll provide on a non-GAAP basis.\n\nUsing currency exchange rates as they are right now. Currency should have a 4% negative effect on total revenue and at least a $0.06 negative effect on EPS in Q3. As I say every quarter, the actual currency impact may be different by quarter end, but we've got to use the number. So, we're using the number right now.\n\nTotal revenues for Q3, including Cerner, are expected to grow from 21% to 23% in constant currency and are expected to grow from 17% to 19% in USD. Total cloud growth, including Cerner, is expected to grow from 46% to 50% in constant currency and 43% to 47% in USD. I expect the total cloud growth for the fiscal year, excluding Cerner, will be above 30% in constant currency. Non-GAAP EPS is expected to grow 9% -- between 9% and 13% and be between $1.23 and $1.27 in constant currency.\n\nAgain, due to currency headwinds, non-GAAP EPS is expected to grow between 4% and 8% and be between a $1.17 and $1.21 in USD. And as I've said before, Cerner will be accretive to earnings this year, including in Q3. My EPS guidance for Q3 assumes our base tax rate of 20.5%, which is up from 19% last year. However, one-time tax event could cause actual tax rates for any given quarter to vary.\n\nAnd with that, I'll turn it over to Larry for his comments.\n\nLarry Ellison -- Chairman and Chief Technology Officer\n\nThank you, Safra. OK, I'm going to go over -- primarily, I'm going to go customers, new wins in infrastructure and then customers and wins and go-lives in applications. But I'm going to start with infrastructure. So, during Q2, we've signed multiple customers to contracts exceeding $1 billion, infrastructure contracts exceeding $1 billion.\n\nLet me be clear. Multiple customers signed contracts, you know, for $1 billion worth of infrastructure. So, given that's been added to our backlog, we expect our infrastructure business to continue to grow very, very strongly into the future. We now have 22,000 infrastructure customers.\n\nWe have a total of 55 regions. That's public regions plus national security regions and the other kinds of regions. And that's more than AWS or Microsoft or anybody, which makes it probably some people. Gartner, as Safra mentioned, moved us into the visionary quadrant for the first time.\n\nSo, let me just start naming specific customers and give you a flavor. I'm going to name large customers, small customers. I'm going to focus a little bit on a bunch of, like, international customers to let you know that our investment in data centers all over the world is really paying off. So, our customers include -- big customers include FedEx, Deutsche Bank, Tokyo Stock Exchange.\n\nLet me take a moment to emphasize Tokyo Stock Exchange. We're the only ones running a major stock exchange. And this is -- Tokyo's not the only one. Because our cloud is very secure and extremely reliable.\n\nIt doesn't go down. In fact, my favorite quote from a big phone company in the United States was, \"The difference between Oracle's cloud and the other clouds are simply that Oracle's cloud doesn't go down.\" I think that's a very important issue when you have enterprise applications, like a stock exchange, where you can't ever go down. Fujitsu is another big customer. Vodafone -- it's phone companies, similar problems.\n\nIf you're a phone company, the phone system can't go down. Vodafone, Deutsche Telekom, Enbridge. Kaiser, a huge healthcare company primarily in the United States. Nvidia's moved and a bunch of others have moved; lots of AI, artificial intelligence and machine-learning workloads to the Oracle Cloud.\n\nBecause what it turns out, we're really good at that. We're better than that than any of the other clouds, which may surprise some people. Schneider Electric, Telecom Italia, Verizon, and lots, lots more. I'm not just going to list them all.\n\nWe publish a big list on, you know, at oracle.com. And every quarter, we add new customers to that. So, in the quarter, we added United Airlines -- database wins on the quarter. United Airlines, migrating all flight operations to the Oracle Exadata Cloud.\n\nAlbertsons, you know, again, moving to the Exadata Cloud service database. Mitsui in Japan, again, moving their databases to Oracle. Again, this is the beginning of a very major -- very large business for us. It's our database franchise moves, primarily from on-premise into the Oracle Cloud.\n\nPersol Career, a big professional services company in Japan, migrating to -- moving their Oracle databases to the cloud. Unimed Curitiba, LAD Healthcare, once again, moving their databases to the Oracle Cloud. Penske Truck Leasing, using -- moving to Autonomous Database. HomeServe PLC in the U.K., government agency, is moving the autonomous transaction processing system.\n\nSo, they're not just moving an existing Oracle Database to the cloud, they're upgrading from our on-premise Oracle Database to our Autonomous Database, which is only available in the cloud. Iberia Express, big telco, same thing, moving to autonomous data warehouse. They just -- you know, the idea is the autonomous data warehouse makes database administration very simple. In fact, it's entirely automated.\n\nThere is no database administration. [Inaudible] Taxi, again, in APAC, you know, a smaller company, again, moving their databases to our autonomous system. MaxiTRANS, a big transportation company in Australia, same thing, autonomous transaction processing. You know, the Scroll, a big Japanese wholesale company, autonomous moving to anonymous database.\n\nBanco Safra, but this is -- by the way, this is not -- you know, our CEO does not own a bank. This is not an internal -- she did not buy our database. But there's a big bank in Latin America called Banco Safra. And they're moving all their mission-critical ops to OCI, as is Bradesco, and same thing.\n\nYorkshire Building Society in the U.K., again, autonomous data warehouse. And Nestle, a food giant in EMEA, is moving their analytics systems to autonomous data warehouse. And their -- that's a huge customer. OK.\n\nI mentioned a couple of calls ago that we have a new version of our MySQL open-source database, and we added a new ultra-fast query processor called HeatWave to MySQL. And that's doing extremely well. We have a number of companies doing that migration, Medallia [Inaudible] Credit Club. It's a long list of people that are moving to MySQL to take advantage of the fact that our query processor in our version of MySQL is 100 times faster.\n\nI really mean that, and we have all the benchmarks. We publish all the benchmarks, and we publish the source code of the benchmarks, so you can duplicate those results, 100 times faster than the queries -- than the Amazon equivalent called Aurora, Amazon's version of MySQL. As Safra mentioned earlier, our partnership with Microsoft Azure is going extremely well. We have a number of companies running applications in Azure.\n\nAnd then, Azure is connected to OCI. So, the database is in OCI, and the application is in Azure. And Belgium Railways is one; Honeywell in the United States; PETRONAS, the big energy and utility company; Telecom Italia and Noovle. But that multi-cloud system is doing extremely well.\n\nAnd we think that is the future of cloud. We think the future of cloud is not, you know, four-walled gardens, AWS, Microsoft, Google, and Oracle. We think those clouds are all going to interconnect. And then, customers will pick the most appropriate service for their particular needs and mix and match between the clouds.\n\nOK. A lot more. A major city in the southwest, which I'm not allowed to mention, is literally migrating everything to OCI. Lambda, which is a big AI machine-learning specialist company, is moving the bulk of their workloads to OCI using Nvidia GPUs.\n\nAnd our best -- our very, very fast network to interconnect them. And this is a pattern. Lambda is doing that. Latent Space is doing that.\n\nNvidia themselves are doing that. So, we're seeing a lot of machine-learning and artificial intelligence workloads moving from other clouds to OCI because we're faster. And, again, in the cloud business, faster when you charge by the minute, faster means cheaper. Give me one second.\n\nAlexa, be quiet. Sorry about that. Those -- I think Jeff Bezos did that. OK.\n\nSo, Minnesota State Colleges and Universities, National Institutes of Health, these are all new cloud customers, new infrastructure and cloud customers. Sierra Nevada Brewing, again, from very large to medium-sized companies are moving to OCI, and lots of them. Twist Bioscience is moving healthcare, again, AI workloads to OCI using Nvidia GPUs. AIA life insurance company, a big financial services company, again, is moving to OCI and databases to OCI.\n\nIn India, Uttar Pradesh Power Corporation, a giant utility, is moving all of their metering and billing applications to OCI. [Inaudible] Intelligent Information Technology is moving their IoT platform from AWS to OCI. And they are also using MySQL HeatWave. Algar Telecom; Brazilian Stock Exchange; Claro, again, big media telco moving to OCI; Entel.\n\nUnimed Curitiba, a large healthcare company in Latin America, moving to OCI. Vivo, again, moving to OCI. Banco de Chile; [Inaudible] another financial services company; Rabobank; DP World, the transportation and logistics company in the Middle East. Austin Transit Partnership, you know, the municipality in Texas, they are perfect -- an interesting customer because they've been using Oracle ERP and EPM and our applications for a long time.\n\nNow, they are moving their infrastructure to OCI. Oman Telecommunications; a huge French telecommunications company I'm not allowed to mention, they are moving to OCI. Oxford Nanopore, a big gene sequencing company, is moving from AWS to OCI, where they're going to store gene sequencing, but not only just store gene sequences in OCI, they also do analytics to figure out if what they've sequenced is a new version of COVID-19 or another pathogen, the pathogen they've never seen before. Extremely important application for world health.\n\nReed Exhibitions; Saudi Ministry of Media; Ecobank Financial Services in EMEA; GLOBENET Limited; Morrisons, a big retail operation, again, all moving to OCI. HDFC Bank and WaFd Bank -- I'm going to stop there. But we publish a long list. But there's tremendous momentum, tremendous momentum and large number of customers from all over the world, very large and medium-sized companies moving to OCI.\n\nAnd the business is growing very strongly, as Safra pointed out in the numbers. OK. In the back -- in applications, I'll try to do this quickly. We're just winning in the back office.\n\nWe have 22,000 customers in infrastructure and in the cloud. We have 11,000 Fusion ERP and HCM customers alone in applications. Just fusion customers. We have 11,000 now.\n\nWe have probably close to 30,000 NetSuite customers on top of that. So, we have lot of customers in applications. We've been in the applications cloud business for longer than we've been in the infrastructure of Google Cloud business. We're extremely strong in healthcare; Cleveland Clinic, Mayo Clinic, Mount Sinai, Providence Saint Joseph, Adventist Health, Kaiser Permanente, National Health Service in the U.K.\n\nLong list of providers, that's a partial list, are using Oracle ERP supply chain and HCM applications. But it's not just the clinical providers that are using, you know, our systems. The payers, the healthcare payers. So, again, as we tackle healthcare in conjunction with our Cerner acquisition, we're not just automating providers, we're also automating payers.\n\nWe're also automating pharmaceutical companies as they do clinical trials. We're trying to automate the entire ecosystem, not just a fraction of it. So, I mentioned the list of providers and payers. UnitedHealthcare, Blue Cross Blue Shield, Humana, Highmark Health, Health Care Service Corporation, Independence Blue Cross, Bright Health.\n\nSo, payers as well as providers. We're extremely strong in that. I mean, we -- again, I'll just leave it with extremely strong. Healthcare wins in the quarter, in Q2, Cigna, a huge payer win; Emirates Health Services, a big provider win where we beat SAP; Cross Country Health Services, where we beat Workday and SAP.\n\nAnd we shine as a provider of healthcare products for -- and there -- we won there; DATAMED. But, again, it is the entire healthcare infrastructure that we are focusing on as we try to automate healthcare systems around the world. Go-lives. Go-lives in the quarter.\n\nTenet Health, at 65 hospitals, 235,000 employees, they went live on HR, payroll, and recruiting. Cleveland Clinic is going live. I know it's called Cleveland Clinic, but they also -- they own hospitals all over the place. They've gone live in a bunch of regional hospitals in Florida.\n\nUniversity of Chicago Medical Center has gone live. Baptist Health Care has gone live, 12 hospitals with 26,000 employees. Lacey Center has gone live in the quarter. So, we're just getting stronger and stronger in healthcare.\n\nAnd I -- so, let me move on to financial services or other -- another industry that we've been very, very strategic. And key to Oracle's future is financial services, specifically, banking. And we're very, very strong there. Bank of America -- you know, in terms of ERP, HCM, supply chain, our customers include Bank of America, JPMorgan Chase, Citigroup, Bank of New York Mellon, Vanguard, Santander, TD Bank in Canada, HSBC in the U.K., UBS, Credit Agricole, Societe Generale, Credit Suisse, Sumitomo Mitsui, Macquarie Bank.\n\nIt's a long -- it's a partial list. We are extremely strong in the banking sector. And what you're going to see in Oracle ERP with our strength in the banking sector is we will be offering loan origination for B2B commerce. One of the things we're doing with the new version of Oracle ERP is if you're a customer that's buying something and you have Oracle ERP, and you are a company that's selling something and you have Oracle ERP, the way that the transaction will occur, it will be entirely automated within the cloud.\n\nSo, you'll submit a purchase order -- the buying ERP system will submit a purchase order into the selling ERP system. And if you need to borrow money, we will originate a loan with one of our banking partners. If the product has to be shipped, we will schedule the shipping and track the shipment with one of our logistic partners. And our ambition here is to completely automate B2B commerce between buying and selling companies that are running Oracle Cloud ERP and manage all of the financing and insurance and logistics associated with that transaction.\n\nWe do a really good job, I think, of automating B2C transactions. Amazon does that extremely well. Walmart does that extremely well. But we don't do a great job of automating B2B transactions.\n\nAnd that's what Oracle does. Oracle's ambition is to do that. And we're in a great position because we are so strong in cloud ERP. So, it's an Oracle system that's -- an Oracle procurement system on one end of that transaction, it's an Oracle order management system on the other end of that transaction.\n\nWe have very strong partners in finance, insurance, and logistics. So, we can completely automate the entire transaction, where B2B transactions begin to look like B2C transactions. They're fully end-to-end automated, and that's a huge new business for us and our partners. OK, let's see.\n\nFinancial services wins in the quarter. We've added M&T Bank; TD Bank; Daiwa Securities; Hilltop Holdings; Farmers Insurance; Nexi, which is where we replaced SAP at Nexi. It's an Italian bank. We replaced SAP at TD Bank.\n\nLet's see what else. Financial services go-lives. AmTrust BlackRock, a big go-live. They are -- you know, they have $10 trillion of managed assets.\n\nOracle now has nine of the top 10 asset management firms running on the Oracle Cloud ERP. FirstRand Bank, a bunch of other banks. I don't want to take up all the time, so I'm going to stop there. You know, we have a lot more data on our website that will enumerate still more customers that we acquired in this very strong second quarter and that went live in the second quarter.\n\nWith that, I'm going to turn it back over to Safra.\n\nKen Bond -- Head of Investor Relations\n\nOK. Thank you, Larry. Beau, if you could prepare the audience for Q&A. Appreciate it.\n\nOperator\n\nCertainly, Mr. Bond. [Operator instructions] We'll take our first question today from Brad Zelnick of Deutsche Bank.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Thanks very much for taking my question, and congrats on the solid results. Larry, Oracle has a rich history of being a price performance leader in just about everything it does. But technically speaking, why exactly does OCI have an inherent cost advantage? And how sustainable is that advantage? Thanks.\n\nLarry Ellison -- Chairman and Chief Technology Officer\n\nWell, maybe the most interesting thing is we have a much faster network than anybody else. We have a fundamentally different network than any of the other cloud providers. We have what's called an RDMA network that we had to build because our Exadata machines and our database actually glued together a lot of computers. And when you had a single database application that could run on one computer or it could run on a cluster of computers, two computers, four computers, eight computers, whatever, so that there was no single point of failure.\n\nOne of the beauties of the Oracle Database, one of the big differences between the Oracle Database and other databases is that the Oracle Database, a single application could run on multiple computers. If one of those computers would fail, the application would keep running. It was fault tolerant. It would tolerate a failure of a machine.\n\nOther people don't have that. But in order to do that, we had to make our network. You're going to have a cluster of four machines running a single database app. We have to make that network between those four machines very fast.\n\nAnd that's called an RDMA network. It means that one computer can immediately access the memory of another computer without going through an interrupt. It's a very fast way to interconnect computers and have them act as a group. We built that for our entire cloud so we could run our database, our Oracle Real Application Cluster database on any of the computers in our cloud.\n\nNow, because we built this hyper-fast network, it turns out it has more utility than just running the Oracle Database. So, if you're running a cluster of computers doing a simulation, a car crash simulation -- that was one of the first applications people noticed ran much faster on Oracle. And now, a much bigger application that has ran much faster on Oracle was on neural networks and machine-learning workloads, run much faster on Oracle, so -- because our network is just intrinsically much faster and thereby there are also -- there are security and reliability advantages to go along with that. So, our networks configured, we actually have -- all of our computers actually have two networks.\n\nI'm not going to go into all the details. But our computers are fundamentally different than any other cloud company. We have two networks. One of which is on the internet -- or I should say, one of which interconnects all of our customers' computers.\n\nAnd the other, which is our, if you will, our control network, where our -- and computers that run our cloud control software, which is isolated from the customer's software. So, the customer can't tamper with our cloud control software. They can't get control of it. And we can't see the customers' data.\n\nThat is unique to Oracle. But the -- because we have the two networks and because one of the networks is RDMA, we just run much, much faster, much more reliably than they do. And it's a fundamental advantage that they can't compete with, unless they rebuild their cloud from scratch.\n\nKen Bond -- Head of Investor Relations\n\nThank you.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nThank you, Larry.\n\nKen Bond -- Head of Investor Relations\n\nNext question, please.\n\nOperator\n\nThank you. We'll take that question now from Phil Winslow with Credit Suisse.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nHey. Thanks for taking my question. Congrats on another strong quarter. And really, two metrics jumped out to me this quarter.\n\nFirst, with, you know, IaaS revenue accelerated to 59% from 58% and 39% the prior two quarters. And organic RPO growth also accelerated to 28%, which is pretty phenomenal this quarter, from 22 and 17 in the prior two quarters. Can you just give us sort of a breakdown of what's driving this continued strength compared to some of your cloud competitors in the past in the IaaS world that have experienced decelerating growth in recent months? And are there any workloads in particular that are driving the relative strength of OCI?\n\nSafra Catz -- Chief Executive Officer\n\nI don't know, Larry, if you want to take it or I take it.\n\nLarry Ellison -- Chairman and Chief Technology Officer\n\nI mean, you can take it. I mean, the workloads -- I'd just expand the workloads. AI and machine-learning is a huge -- is exploding. Nvidia, the -- you know, the people who provide the GPUs, you know, for most AI workloads are moving -- they are moving a huge amount of stuff to the Oracle Cloud.\n\nAnd a bunch of other companies that are doing that. That's one new one. I mean, obviously, database, but I'll let that question really go on to Safra.\n\nSafra Catz -- Chief Executive Officer\n\nWell, it's really across the board, to be fair. We've got high-performance computing. We've got most of the auto companies doing their simulations on us. And then, we have Oracle workloads, autonomous database, and other workloads.\n\nWe have extremely broad -- just extremely broad moves. I think I told you in previous quarters that, of course, our growth rates are higher because we're smaller. But yet, as we grow, we're actually accelerating because of exactly the features that Larry covered in the last question. Customers are coming to us often not expecting the phenomenal results.\n\nAnd remember, time is money on the cloud. So, if you're more performant, it is much less expensive, whether it's Oracle workloads, or straight compute or storage or other workloads. The other thing is you have to understand that our cloud customers, our national security regions, all of those are being contracted. And we are clearly the choice for governments to maintain their sovereignty over their data.\n\nWe can land a center very quickly. And they have a -- and they fill up very quickly. So, we really have it coming from all areas. And then, of course, our applications business, Larry basically said it.\n\nI mean, we're it. And we're winning consistently deal after deal, both -- as our E-Business Suite and PeopleSoft and JD Edwards customers move to us, but also SAP installations choosing us over what they had before. So, we -- it's just on all fronts, frankly.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nGreat. Well, it's awesome to see everything that you've been talking about the last couple of years playing out. So, keep up the great work.\n\nSafra Catz -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We'll go next now to John DiFucci of Guggenheim.\n\nJohn DiFucci -- Gordon Haskett Research Advisors -- Analyst\n\nThanks for taking my question. Larry, thanks for the answer to that first question. That's actually something we've been thinking about. That's going to help as we dig into better understand the benefits of OCI.\n\nBut it's amazing to hear the core differentiation of RAC continues to drive differentiation even 20 years later. My question is actually for Safra. Safra, you mentioned your flexible business model in your prepared remarks and which is unique. BYOL, you were a pioneer in doing that.\n\nAnd license was surprisingly strong again. Can you talk in a little more detail about what's really driving that license strength?\n\nSafra Catz -- Chief Executive Officer\n\nSo contrary to, I think, the fears the people always have, the Oracle database is still the biggest part of license by far. So, most important part, the database remains strong because customers understand that they can BYOL, bring your own license, and they can have coverage, whether they're on-premise, in the cloud, or moving in between the two. So, again, really always the big number. But we've got growth rates that are very strong in Analytics.\n\nWe have growth rates that are super strong in Java. We have growth rates that are strong in the Industries areas. Some of our Industries applications. And then -- so, I want to make sure I gave you the numbers both ways.\n\nWith Cerner, we have growth rate of 23% because, of course, you had the Cerner license. Without Cerner, it's 9% growth. So, even without Cerner, we have license growth after a very strong growth rate a full year ago in license. So, again, big dog is, of course, technology.\n\nThat's the bulk of it. But we've got a few industry apps and a little bit of Cerner. And it just remains just super strong.\n\nJohn DiFucci -- Gordon Haskett Research Advisors -- Analyst\n\nOK. That makes sense. It sounds like a lot of things are working together here. Thank you.\n\nThank you very much.\n\nSafra Catz -- Chief Executive Officer\n\nAbsolutely.\n\nOperator\n\nAnd we'll go next now to Mark Moerdler at Sanford Bernstein.\n\nMark Moerdler -- AllianceBernstein -- Analyst\n\nThank you very much for taking question. I really appreciate the ability to ask the question, and congratulations on the quarter. Two related questions on Cerner. Safra, where are we on the Cerner integration process, as well as taking out the costs? And when do you think you can drive those long-term costs over time? And, Larry, we heard a lot of great futures at Oracle World about CERN and what you can do in healthcare.\n\nIt'd be interesting to hear what progress you've made recently. Thanks.\n\nSafra Catz -- Chief Executive Officer\n\nSure. So, Mark, we've owned Cerner for about five months. And I will tell you that they continue to do better than we had projected internally. So, we're very, very happy.\n\nBut we are still at the beginning. You know, we don't want to do anything that will damage the business. And, of course, we're very, very focused on those customers, but we are already having some level of savings. But ultimately, just so that you understand, our expectation is we will run them at typical Oracle margins.\n\nSo, we've got quite a way to go. And I think over the next couple of quarters, you'll see continued improvement as we've done some of our operational integration. And simultaneously, I think they continue to overperform for us. So, we are doing this in a very careful way so as not to put any issues for our customers and making sure they're successful.\n\nOn the technical side, Larry, that's for you.\n\nLarry Ellison -- Chairman and Chief Technology Officer\n\nYup. Well, actually, on the technical side, of course, what we're trying to do is build national -- not just provider assistance. In other words, what Cerner did primarily in competition with Epic is the automated hospitals. And, yes, we want to automate hospitals and clinics and doctors' offices and do that.\n\nWe certainly want to automate providers. But we're layering on top of that is we want to do national public health. We are doing national public health systems. I mentioned Oxford Nanopore.\n\nThat's an early warning system, you know, to detect the next pathogen that could lead to a pandemic. These global public health systems need to be built. And we are in discussions. We are in discussions with, not companies, but countries about building and deploying global early warning systems, so we can detect the next pathogen that threatens to turn into a pandemic.\n\nWe can catch it early enough that we can prevent it from being a pandemic. God forbid, there is another pandemic that we have up-to-the-minute, up-to-the-second data about how the country's infrastructure is managing the hospitalization rates and vaccination rates and all of those things, so we can better deploy and manage our resources during a pandemic so that we don't have a repeat of the things that went on during COVID-19. So, I expect -- you know, Safra just got back from visiting some prospective customers that are countries, that we will be signing contracts with a number of countries to build these national systems. And these contracts are enormous.\n\nI mean, absolutely enormous, and there will be several of them. So, as I said in my note in the press release, the scale of this healthcare opportunity is unprecedented, but so are the responsibilities that go along with it. We have to. We, as humanity, have to do a better job of delivering healthcare to people than we have done historically.\n\nAnd we can never have a repeat of the COVID-19 pandemic. And I think there is this worldwide sense of urgency and national consciousness about getting a new generation of systems out there that help us, at first, prevent and then manage our healthcare, prevent a pandemic and better manage our healthcare systems. As far as I know, Oracle is the only company in the world that's trying to address this issue. And we're about to sign up a number of countries that will work with us on doing just that.\n\nMark Moerdler -- AllianceBernstein -- Analyst\n\nExcellent. Thank you so much.\n\nOperator\n\nThank you. And we'll take our final question this afternoon from Raimo Lenschow at Barclays.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nHey. Thanks for squeezing me in. One quick question. If you think about the global environment, usually, it's not the time to look at -- well, in the olden days, I remember when I was at PWC, it wasn't the time to kind of look at your back office systems.\n\nBut you were kind of growing really nicely. NetSuite is actually kind of outgrowing Fusion a little bit. Can you talk a little bit about the drivers and what you're seeing out there? Thank you.\n\nSafra Catz -- Chief Executive Officer\n\nYeah. Let me start that. Larry, you can add if you want. So, I want to remind you that we are global, right, which includes whether we're, you know, in Europe and in the United States, but we're also in the Gulf states and, really, in Asia, different parts of Latin America.\n\nAnd there are always companies that get to the point where their business, they cannot afford to keep using their older systems. They spend too much using them. They spend too much running them, and they are actually holding them back. And they know that.\n\nAnd I think one of the things many companies learned during COVID was those companies that did not get on some sort of a track to get a digital connection with their customers, employees, and suppliers that were at a huge disadvantage. And so, that momentum continues. And it is possible that in any individual country or location, there could be some little slowdown here or there. And yet, there are other countries and industries that are doing incredibly well.\n\nAnd they view this as critical. When customers move to SaaS, they end up spending less, but also have much better capabilities to sell more, to work with their employees and their suppliers. And, of course, as I said, their customers. So, that momentum has started, and it just continues very, very strongly.\n\nAnd again, we are global. So, even when there are some issues in some region, we're in other regions that are doing phenomenally well right now.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Thank you.\n\nKen Bond -- Head of Investor Relations\n\nOK. Thank you, Safra. A telephonic replay of this conference call will be available for 24 hours on our investor relations website. Thank you for joining us today.\n\nAnd with that, I'll turn it back to Beau to close the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKen Bond -- Head of Investor Relations\n\nSafra Catz -- Chief Executive Officer\n\nLarry Ellison -- Chairman and Chief Technology Officer\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nJohn DiFucci -- Gordon Haskett Research Advisors -- Analyst\n\nMark Moerdler -- AllianceBernstein -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nMore ORCL analysis\n\nAll earnings call transcripts"
}