{
  "companyName": "Elastic",
  "companyTicker": "ESTC",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/26/elastic-estc-q1-2023-earnings-call-transcript/",
  "content": "Elastic (ESTC -0.23%)\nQ1 2023 Earnings Call\nAug 25, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the Elastic's first quarter fiscal 2023 earnings results conference call. All participants will be in a listen-only mode. [Operator instructions] After today's presentation, there will be an opportunity to ask questions. [Operator Instructions] Please not that this event is being recorded.\n\nI would now like to turn the conference over to Nikolay Beliov, vice president of investor relations. Please go ahead.\n\nNikolay Beliov -- Vice President, Investor Relations\n\nThank you. Good afternoon, and thank you for joining us on today's conference call to discuss Elastic's first quarter fiscal 2023 financial results. On the call, we have Ash Kulkarni, chief executive officer; and Janesh Moorjani, chief financial officer and chief operating officer. Following the prepared remarks, we will take questions.\n\nOur press release was issued today after the close of market and is posted on our website. Slides, which accompany this webcast, can be viewed in conjunction with live remarks and can also be downloaded at the conclusion of the webcast on the Elastic investor relations website, ir.elastic.co. Our discussion will include forward-looking statements, which may include predictions, estimates, our expectations regarding the demand for our products and solutions, and our future revenue and other information. These forward-looking statements are based on factors currently known to us, speak only as of the date of this call, and are subject to risks and uncertainties that could cause actual results to differ materially.\n\nWe disclaim any obligation to update or revise these forward-looking statements unless required by law. Please refer to the risks and uncertainties included in the press release that we issued earlier today, included in the slides accompanying this webcast, and those more fully described in our filings with the Securities and Exchange Commission. We will also discuss certain non-GAAP financial measures. Disclosures regarding non-GAAP measures, including reconciliations with the most comparable GAAP measures, can be found in the press release and slides.\n\nThe webcast replay of this call will be available for the next 60 days on our company website under the investor relations link. We will be participating in the Citi Global Technology Conference on September 8, and the Goldman Sachs Communacopia Technology Conference on September 13. Elastic will host its 2022 Financial Analyst Day on September 19 and hope many of you will join us in person in San Francisco. Our second quarter fiscal 2023 quiet period begins at the close of business, Friday, October 14, 2022.\n\nWith that, I will turn it over to Ash.\n\nAsh Kulkarni -- Chief Executive Officer\n\nThank you, Nikolay. Hello, and welcome, everyone. I'm happy to be here with you today to share our Q1 FY '23 results. I'm very pleased with our execution in Q1 as we continued to see strength in the demand environment and drove disciplined execution across the board, an excellent start to our fiscal year.\n\nIn Q1, revenue grew 30% year over year and 34% year over year in constant currency, and we once again saw robust momentum in Elastic Cloud. Cloud revenue grew 59% year over year or 62% in constant currency and comprised 39% of our total revenue compared to 32% in the prior-year quarter. We ended the quarter with more than 19,300 subscription customers, including over 1,010 with annual contract values of more than $100,000, and our net expansion rate was just under 130%. Our results in Q1 reflect our focus on our strategy and the consistent execution of our team.\n\nAs data continues to grow in volume and importance, we believe that Elastic's data analytics platform, powered by search, will continue to be essential to our customers' continued success. We saw this play out in the form of strong demand patterns throughout the quarter with good linearity. I also heard this in customer conversations throughout the quarter. Even with the strengthening U.S.\n\ndollar, we saw execution strength across geographies with each of our geographies, delivering order growth adjusted for currency and duration in excess of 40% year over year. All this gives us the confidence to raise our constant-currency revenue growth guidance for the year. We also feel well positioned to achieve our long-term goals of cloud exceeding 50% of total revenue by the fourth quarter of fiscal '24 and achieving $2 billion in total revenue in fiscal '25. Let me share our progress across our three key focus areas: Driving durable growth; widening the competitive moat; and fueling profitable growth.\n\nStarting with durable growth. We believe the need for our customers to protect, observe, and search data is mission-critical, and we continue to see customer spend stay resilient and maintain steady growth. We believe the level and pace of consumption across our solutions remain strong because customers recognize the power of our data analytics platform and continue to expand usage across our solutions. For example, a U.S.\n\nregional bank company is leveraging our security solution on Elastic Cloud for our SIEM and security monitoring capabilities. This quarter, they expanded business with us, and we closed a new Observability deal with them, so they can leverage Elastic to meet their application log monitoring needs, ensuring all of the bank's critical compliance requirements are met. Additionally, we renewed business with GitLab, Inc. which is leveraging Elastic to run their SaaS service search functionality and managing all of their data logging infrastructure on Elastic Cloud.\n\nLast quarter, I shared details about our focus on the cloud, which continues to drive results. In Q1, the field drove a significant increase in Elastic Cloud pipeline creation over Q4, and a substantial portion of Elastic Cloud deals closed by the field in Q1 came from new logos. Of note, we are seeing that our enterprise subscription tier is now the fastest-growing tier among our cloud customers. We continue to build momentum with the major hyperscalers: AWS, Microsoft Azure, and Google Cloud.\n\nThe marketplaces are an important growth driver of Elastic Cloud and our fastest-growing route to market. In fact, our tight integration across the marketplaces and our go-to-market investments with these partners, once again, resulted in revenue growth of over 100% year over year from the cloud marketplaces. And I'm excited to share that we were recognized as a finalist for the 2022 Microsoft Commercial Marketplace Partner of the Year Award. Now, on to our widening competitive moat.\n\nI am incredibly proud of what the team delivered this quarter as we launched new enhancements for Elastic Cloud that make it easy for our customers to search data anywhere from one platform. With new updates to our cross-cluster search and cross-cluster replication capabilities, customers benefit from interoperability between self-managed and Elastic cloud deployments. These capabilities support our customers in their transition to the cloud, providing a seamless way to search across hybrid environments. This is particularly important for two categories of customers: Those who may need to maintain data in their own data centers due to regulatory or privacy constraints; and those who are in the process of migrating from private to public cloud and need an approach to migrating data over time.\n\nWith these new capabilities, in addition to the multi-cloud cross-cluster search and replication capabilities that we have already had, these customers can now seamlessly search or migrate data across private, hybrid, and public clouds. This accelerates the migration of customer data to the public cloud, and we believe grows the footprint of Elastic to be wherever customer data lives, further widening our competitive moat. Moving on to our solutions, starting with Elastic Security. The strength of our security capabilities continues to fuel our success in the market.\n\nThis quarter, we expanded business with the leading data streaming platform company, who is leveraging our SIEM to ensure deeper security intelligence. And with the new cross-cluster search enhancements I mentioned earlier, they can easily search across hybrid environments to identify relevant security data in any environment. They're also using searchable snapshots which enables them to meet their internal data retention goals as they look to cost effectively store and easily search years' worth of data. What are the major drivers to choosing Elastic's enterprise-level subscription? In security, we continued our pace of innovation.\n\nJust this week, we introduced Elastic's modern approach to SOAR, or security orchestration, automation, and response. This new capability allows our SIEM users to streamline their operations workflows, speed up threat hunting and reduce mean time to respond. Elastic's approach to SOAR is powered by Elastic Agent, our single-click approach to integrating data from hundreds of data sources while delivering endpoint and cloud security. It includes expanded native remediation capabilities through Elastic Agent, a purpose-built user experience for remediation and orchestration, and expanded third-party SOAR vendor integrations.\n\nAnd we announced our cloud security offering at RSA in June, which featured capabilities to secure modern Kubernetes environments and cloud workloads. Reception to the announcement has been strong, and we expect the full product GA by the end of calendar year 2022, leading to enhanced opportunities to cross-sell, within our security products. Now, moving on to Elastic Observability. Our success in evolving log analytics use cases to larger, more holistic Observability implementations continues as customers look to Elastic to monitor their entire ecosystem.\n\nThis quarter, a large global electronics manufacturer expanded business with us as they leverage our Observability solution to monitor and investigate errors across IoT applications that power their connected appliance offering. With Elastic, they are able to enhance their connected consumer appliance products to ensure customers have a world-class user experience. This quarter, we also closed a new deal with O2 Telefonica in Germany. They are using our Observability solution Elastic Cloud across all three cloud hyperscalers.\n\nAs the company targets a radical IT transformation for the upcoming years, O2 Telefonica is relying on Elastic to support Observability to further improve customer satisfaction by increased service availability and performance. On the product front, we just announced new updates, providing smarter alert management for AIOps that accelerate problem resolution. AIOps-driven alert and incident management are crucial for proactively detecting, triaging, investigating, and resolving anomalies in complex business environments. Customers like SAP, Jaguar Land Rover, and ING rely on Elastic Observability to deliver unified visibility and actionable insights about critical business infrastructure.\n\nWe also recently launched the beta of synthetics monitoring, a capability often requested by APM customers. We've seen excellent adoption of this new capability. Since the launch, more than 240 Elastic Observability customers on Elastic Cloud have tried out the beta. Our consumption-based pricing model makes it easy for customers to try and adopt these new capabilities, and that drives incremental consumption and revenue for us.\n\nAnd Elastic was named a Visionary in the 2022 Gartner Magic Quadrant for APM and Observability for the second consecutive year. In addition, Elastic Observability was named among the top three vendors in five out of six use cases in Gartner's companion report, the 2022 Gartner Critical Capabilities for APM and Observability, further showcasing the tremendous traction we've gained across our overall Observability solution. And lastly, with Elastic Enterprise Search, we continue to see momentum as organizations look to Elastic to fuel their database search, enterprise system offloading, e-commerce, customer support, workplace content, website search experiences, and more. In Q1, we expanded business with a leading American health solutions company, who is using Elastic Enterprise Search to power their customer experience evolution and fuel their clinical support product.\n\nThis purpose-built application, built on Elasticsearch, provides supporting staff with a seamless search experience that delivers a comprehensive, easy-to-read, near real-time view of their customers. This enables team members to provide faster and more accurate health recommendations and an overall better customer experience. This quarter, we also expanded our business with one of the world's leading financial institutions who has been steadily increasing its adoption of Elastic over the past several years. In addition to designating Elastic as their enterprise standard for search, they operate a centralized center of excellence that provides Elastic Enterprise Search to multiple lines of business, supporting a wide variety of use cases, including fraud analytics, regulatory reporting, payment search and customer account lookup.\n\nOn the innovation front, we are encouraged by the early strong interest in our enhanced machine learning and natural language processing capabilities, which we first introduced in technical preview with our 8.0 release in February. Now we have over 200 customers trying out the capabilities, testing out the features, and providing us feedback across use cases from e-commerce and career search to online dating, patent search, and graphic design. Our integrated ML capabilities are a significant component of our competitive moat across all three of our solution areas and help drive consumption on our platform. I'm excited to share that we are officially getting back together in person with our Elastic customers and community via our ElasticON Comes To You series.\n\nWe are hosting six events around the world, where our community and customers will come together to learn about the latest Elastic technology and how we can drive transformation with Elastic Cloud together. These events drive greater awareness, fuel pipeline, and reinforce our bottom-up adoption and product-led growth. Moving on to our focus on profitable growth. I'm proud of the team and the fact that we exceeded both our revenue and our profitability targets for Q1.\n\nWe continue to invest in the business in a disciplined way, primarily in our sales capacity and in key technical roles. And at the same time, we let a significant portion of our revenue outperformance drop to the bottom line, demonstrating the operating leverage inherent in the business model. We've also slightly increased our non-GAAP operating margin outlook for the year. Based on the continuing customer adoption of our solutions and our momentum in Elastic Cloud, we remain confident of achieving our goal of $2 billion in revenue in fiscal year 2025, while also continuing to grow our operating margin over time.\n\nIn other important developments, I am thrilled to announce that Ken Exner is joining Elastic as our chief product officer, effective August 29th. Ken has close to three decades of experience leading product and engineering teams. He joins us from AWS, where he spent 16 years building and managing dozens of products used by millions of customers worldwide. Most recently, he served as the VP and GM of AWS developer tools, where he ran a portfolio of over 30 products.\n\nKen's experience building and running hyperscale cloud services will accelerate our cloud-first business strategy and strengthen our relationships with all of our cloud partners. This past quarter, we launched our first company ESG report and added industry veteran, Sohaib Abbasi to the Elastic board as vice chair. Sohaib has extensive experience supporting organizations as they grow to become multibillion dollar companies. We're also looking forward to sharing more about our business with you all during our upcoming Analyst Day on September 19.\n\nNow as I turn the call over to Janesh, I remain very confident in our future. We are committed to driving durable growth, widening our competitive moat, and fueling profitable growth. Thank you. And now over to you, Janesh.\n\nJanesh Moorjani -- Chief Financial Officer\n\nThanks, Ash. The first quarter was a great start to the year. We delivered 34% constant-currency total revenue growth year over year and 36% constant-currency subscription revenue growth year over year. We continued our momentum in Elastic Cloud, which represented 39% of total revenue in the quarter, up from 37% in Q4 and 32% a year ago.\n\nThe resilience of our solutions in the current environment was evident through continued strength in new customer additions and a sustained high net expansion rate. And we did this while demonstrating expense discipline and operating leverage. We once again beat the high-end of both our top-line and bottom-line guidance for the quarter. We remain confident about the rest of the year and our long-term goals.\n\nLet's get into the results. Total revenue in the first quarter was $250 million, up 30% year over year or 34% in constant currency. Subscription revenue in the first quarter totaled $232 million, up 31% year over year or 36% in constant currency, comprising 93% of total revenue. Within subscriptions, revenue from Elastic Cloud was again strong at $98 million, growing 59% year over year or 62% in constant currency, driven by customer growth and usage.\n\nWe were pleased with our performance, which was against a very strong growth comparison point last year. We did not see any unusual usage patterns during the quarter. Professional services revenue in the first quarter was $18 million, growing 15% year over year. We do not expect professional services to increase significantly in mix.\n\nTo give you a bit more color on deal flow, we once again saw both strength and balance in deal flow across geographies, segments, and industry verticals in the quarter. Adjusted for currency and duration, each geo grew orders in excess of 40% year-over-year growth. Cloud orders also remained strong. As we've said before, diversification is the strength of our business model and reflects the breadth and resilience of the solutions supported by our Search platform.\n\nThroughout the quarter, we were also pleased with the strength and linearity as well as new logo wins and net expansions. The tone of customer conversations remains positive as we continue to work with them closely on mission-critical use cases in their businesses. All that said, we are aware that the external environment is dynamic and customers are increasingly agile in responding to changing circumstances. We continue to monitor this closely.\n\nI'll touch more on this when I discuss guidance. Looking at customer metrics. We ended the first quarter with over 19,300 total subscription customers with the vast majority of the additions in the quarter once again in Elastic Cloud. Our strategy of focusing on acquiring and nurturing customers that are higher quality rather than solely focusing on quantity has been working nicely.\n\nWe also saw the success of the strategy reflected in the count of larger customers. We had over 1,010 customers with annual contract values over $100,000 at the end of the first quarter compared to over 960 such customers at the end of the prior quarter, reflecting the strength of our product portfolio and our ability to drive expansion across the solutions. Our overall net expansion rate in the first quarter continued to be strong at just under 130%, reflecting our momentum and success in Elastic Cloud. Now turning to profitability for which I'll discuss non-GAAP measures.\n\nGross margin in the quarter was 73.9%, with the sequential change versus the prior quarter driven mainly by professional services for which gross margin can fluctuate based on service delivery timing. Subscription gross margin at 79.2% was consistent with the prior quarter. We are pleased with our progress against our plan. Looking ahead, we continue to expect Elastic Cloud to remain a modest headwind to gross margin for the year, as it increases in mix, and we continue to invest to drive growth.\n\nLooking at operating expenses in the first quarter. We continue to invest in the business with discipline according to the plan we had laid out. Our operating margin in the quarter was negative 1.9%, which was significantly better than expected, primarily due to the strong revenue performance in the quarter. This reflects the operating leverage inherent in our business model.\n\nLoss per share in the first quarter was $0.15, using 94.6 million weighted average shares outstanding. Free cash flow on an adjusted basis was $1.7 million in the first quarter. We continue to expect to have slightly positive adjusted free cash flow for the full fiscal year. We maintain a strong balance sheet.\n\nWe ended the first quarter with cash and cash equivalents of approximately $849 million. We remain comfortable with our cash position from an operating perspective. Before discussing our outlook for the second quarter and the remainder of fiscal '23, I'll briefly recap our overall long-term framework. We continue to be well positioned to deliver durable long-term growth, achieving $2 billion in revenue in fiscal '25.\n\nWe remain confident in our ability to achieve our growth objectives given the strength of our products, our significant momentum in Elastic Cloud, our healthy new customer trends, and net expansion track record. We continue to monitor the environment closely and have executed well so far this year. We continue to expect Elastic Cloud to exceed 50% of total revenue in the fourth quarter of fiscal '24 and we continue to expect to expand operating margin by several percentage points each year in fiscal '24 and fiscal '25. Turning to guidance.\n\nOur performance in the first quarter sets us up nicely for the remainder of the year. As we've said before, we believe our products are core to our customer success, which helps us build a healthy business that performs consistently through both upswings and downturns. The first quarter played out as we said it would, and we delivered well against our goals. We continue to stay close to our customers and monitor the broader environment.\n\nWe are not discretely adjusting guidance down for a macroeconomic slowdown simply because we've not seen that yet in the business. What we have seen so far is the impact of currency movements. With the continued strengthening of the U.S. dollar, we expect currency movements to present a headwind to year-over-year total revenue growth of approximately 5% for the second quarter and approximately 4% for full fiscal '23 or $10 million incremental headwind for the full year compared to our prior guidance.\n\nWith respect to operating margin, since we also incurred a significant portion of our expenses in currencies other than the U.S. dollar, we effectively have a natural hedge. So, the impact to operating margin from the strengthening dollar is less significant. You've often heard me say that diversification is the strength of our business model, and this is another example of that strength.\n\nGiven our strong execution so far, we continue to invest in the business according to the plan we laid out at the start of the year. We expect to continue targeted investing in all functions in fiscal '23 to drive growth while continuing to improve profitability. Finally, our overall guidance philosophy stays unchanged. We continue to guide thoughtfully and without excessive conservatism.\n\nWith that background, for the second quarter of fiscal '23, we expect total revenue in the range of $260 million to $262 million, representing 27% year-over-year growth at the midpoint. On a constant-currency basis, we expect total revenue growth of 32% year over year at the midpoint. We expect non-GAAP operating margin in the range of negative 0.6% to negative 0.2%, and non-GAAP net loss per share in the range of $0.11 to $0.09 using between 95 million and 96 million ordinary shares outstanding. For full fiscal '23, we continue to expect total revenue in the range of $1,080,000,000 to $1,086,000,000, representing 26% year-over-year growth at the midpoint.\n\nCompared to our prior guidance, our currency-neutral outlook for the year is higher by $10 million, which is offset by the headwind of the incremental $10 million of currency movements I referenced earlier, resulting in no net change in total revenue for the year compared to the prior guidance. On a constant-currency basis, we expect total revenue growth of 30% year over year at the midpoint versus the prior guidance of 29%, reflecting the higher currency-neutral outlook for the year. We expect non-GAAP operating margin for full fiscal '23 in the range of 0.3% to 0.7% and non-GAAP net loss per share in the range of $0.31 to $0.25, using between 95 million and 97 million ordinary shares outstanding. In summary, we had a strong start to the year with continued cloud momentum.\n\nWe believe that we are well positioned for long-term durable growth and profitability, and we look forward to continuing to execute in the second quarter and beyond. We're also looking forward to seeing you at our upcoming Analyst Day on September 19 and sharing more about our strategy and growth trajectory then. And with that, let's go ahead and take questions. Operator?\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] At this time, we will pause momentarily to assemble our roster. And our first question will come from Raimo Lenschow with Barclays.\n\nPlease go ahead.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you and congratulations. Could I just speak -- ask about the cloud business? Like what are you seeing in terms of customer behavior in these uncertain times in terms of like moving faster to the cloud, also in terms of like where the customers are coming from, it's like mostly new customers? What's the story on customer migrations toward the cloud? That was my first question and then a quick follow-on.\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah, Raimo, thank you for the question. The pattern, as compared to the last quarter, remains unchanged. We are seeing customers continue to both expand and also new customers to come on to the cloud. And that's across pretty much all geographies and segments.\n\nSo, the demand that we are seeing, the usage of the product, we haven't really seen any change in that. Part of it, as we expect and we've talked about in the past is just the kinds of solutions that customers tend to use us for. When you're talking about Security or Observability or Enterprise Search, we don't see that kind of variability. So, we've seen consistent consumption patterns in Elastic Cloud.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Perfect. And, Janesh, like from you, like there's a big debate about like the linearity in the quarter. Can you speak to a little bit what you saw like June? Like the on-cycle guys were all like certain June was kind of funny.\n\nThen so far yesterday, I'm probably sure you followed like Salesforce and some of the other guys that said July is kind of different. You sound a little bit different. Can you talk a little bit of what you saw in terms of linearity in the quarter? Thank you and well done again.\n\nJanesh Moorjani -- Chief Financial Officer\n\nYeah. Happy to, Raimo. Look, linearity for us was actually quite good across the quarter. Q1 is always unique because it's the first quarter of the year.\n\nWe assign quotas and territories and things like that. And linearity can also be affected by the timing of specific deals, as you know. But this time, we actually saw a pretty good deal velocity. June was a strong month, and that took a little bit of the burden of July.\n\nAnd the team delivered nicely in July as well and met the expectations that we had. So, we're actually quite proud of how the team executed to finish the quarter so strong.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Perfect. Thank you.\n\nOperator\n\nOur next question will come from Tyler Radke with Citi. Please go ahead.\n\nTyler Radke -- Citi -- Analyst\n\nGood afternoon. Thanks for taking the question. I wanted to ask you about the order growth that you referenced north of 40%. Could you just better contextualize, is that kind of synonymous with the current RPO bookings? Or how do you exactly measure that? And then is the way to think about that, that 40% is kind of accelerating? Just trying to understand kind of the recent trajectory of that and how it flows into revenue.\n\nThank you.\n\nJanesh Moorjani -- Chief Financial Officer\n\nYeah, Tyler. I'll take that. So, look, the way to think about that is it's essentially field performance, right? We pay our field and give them quotas based on driving orders across cloud and self-managed and services. And that's what they're focused on and driving essentially ACV of subscriptions, plus, of course, services as an attached to that.\n\nAnd that's what that metric represented. And each of the geos did really well. As we said, more than 40% growth when you adjust for currency and duration across the geos. And in terms of what that means looking ahead, it's obviously a great start to the year for us in that.\n\nEventually, that all does translate to revenue as those orders eventually get consumed in the case of cloud or services are delivered in the case of services. And of course, on the self-managed side, it's ratable. But we are actually quite pleased with the execution on that front. A big chunk of those came from cloud, which now represents 39% of the business, and it sets us up quite nicely for even greater momentum as we continue to progress through the year.\n\nSo overall, I think the team did a really good job, and we are quite happy with the outcome.\n\nTyler Radke -- Citi -- Analyst\n\nGreat. And second one for Ash. Maybe just talk about how you're seeing the field team respond to some of the new incentives around cloud? And are there particular use cases that they're leaning into more just given the incentive structure? Thanks.\n\nAsh Kulkarni -- Chief Executive Officer\n\nThanks, Tyler. So, I'm actually really pleased by the way the field has responded to it. And it's not just the field, but across all functions, the lean into cloud has been excellent. We talked a little bit about -- I talked in my prepared remarks about the fact that we've seen strong pipeline growth.\n\nAnd all of that is being driven by the field, as you can imagine, and just the order growth that Janesh talked about, fundamentally, what we're seeing is that it's becoming very clear that our customers are choosing given all the advantages, the inherent advantages that cloud provides, they are naturally biasing toward it. Our field is doing a wonderful job in terms of positioning cloud. And we are seeing that kind of uptake across all three use cases that we tend to start with. So, whether it's Enterprise Search or Observability or Security, we are seeing traction across the board in all of them.\n\nSo, no change in the patterns there.\n\nTyler Radke -- Citi -- Analyst\n\nThanks for the color.\n\nOperator\n\nOur next question will come from Pinjalim Bora with J.P. Morgan. Please go ahead.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nThank you for taking the question, and congrats on the quarter. Janesh, on the cloud point, we are getting some questions why is it decelerating. I understand the point that there is a pretty tough comp and the contract, I guess, it gets easier through the year. So should investors expect kind of the cloud growth rate to edge higher through the year? Or as -- given the evolving macro landscape, do you expect to see any change in the consumption patterns of Elastic Cloud if the environment kind of deteriorates?\n\nJanesh Moorjani -- Chief Financial Officer\n\nYeah, Pinjalim. So Q1 played out really nicely for us, actually. With that growth of year over year of 62% year over year in constant currency against the tough comparison point last year. The other way to look at it is sequentially, where we grew 13% in constant currency, and that's about the average rate that we've seen over the prior few quarters.\n\nSo what's driving that is really healthy new and expansion trends that we're seeing in the business. We've added incremental dollars on Elastic Cloud consistent with what we've been adding. We haven't observed really any adverse change in terms of consumption patterns more generally. And recall, as we said the last time and Ash mentioned earlier, that our solutions just fundamentally address mission-critical use cases, and customers see a lot of value in the features in Elastic Cloud, like searchable snapshots and cross-cluster search and cross-cluster replication, which help drive cost down as well as increase operational efficiencies.\n\nSo, we see all of those. I'm not going to provide a particular view on the numbers, how they might play out in terms of Q2 to Q4, specifically on cloud. But in general, what I'd say is that we've seen really strong momentum in terms of new customer adds as well as expansion. And the core reasons and the drivers for that are the mission criticality of the use cases that we mentioned.\n\nOverall, you've seen us increase the cloud mix from 37% to 39%. And we're actually quite happy in the outlook and excited by the momentum.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nUnderstood. Thank you for the thoughts. And Ash, one for you. It seems like enterprise tier is doing really well.\n\nYou obviously added searchable snapshot, now you're adding the cross-cluster search and replication. How should we think about the opportunity within the client base to upsell them to those higher tiers? And how are you enabling sales to kind of help achieve that?\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. Thanks for the question. So as Janesh mentioned, we are seeing wonderful uptake in our enterprise tier. That is the fastest-growing tier across all the tiers that we have.\n\nAnd that's by design. The capabilities that we've delivered, like you mentioned, whether it's searchable snapshots, now the hybrid plus cluster search and replication. And let me just maybe touch upon why that's so important. And if you think about the kinds of things that customers need to do as they're migrating to the cloud, we often see customers that might have, for regulatory reasons, certain data that can never leave their own data centers.\n\nAnd in those kinds of situations, although they have some of that data that can't leave, they want to move the rest of their workloads over to public cloud, and they want to be able to see a single pane of glass, a single view across all of that data. And with the hybrid cross-cluster search capability, we now have the ability to enable that for them. Also, as customers are migrating workloads to the cloud, they don't want to turn off the access for their stakeholders to the Elastic instances that they have. And they can't typically do just a cutover all at once.\n\nSo, we typically see this pattern where customers are migrating instances and workloads a little at a time. And to help them accelerate that through that process, this kind of hybrid cross-cluster search functionality becomes incredibly important. Now they don't need to basically lose any of the benefits even as they're moving workloads over. And this is something that we've seen a lot of interest in from customers, and we expect this is going to be one more of the reasons why our enterprise tier continues to be something that our field is going to be able to drive very nicely within our customer base.\n\nAnd these are -- as you can imagine, these are all specific sales plays that we are driving with our field team. So I'm very excited about the prospects with it.\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nUnderstood. Thank you for the color.\n\nOperator\n\nOur next question will come from Ittai Kidron with Oppenheimer. Please go ahead.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nAll right. Thanks. Hey, guys. Janesh, I want to dig into the guidance again.\n\nI understand your comments about FX. But I guess even if I account for FX, it sounds like you're basically guiding to about $4 million upside relative to where consensus is on the next quarter. And I guess my question is, when you look at the -- this quarter and the quarter you're guiding to versus the four fiscal quarters of fiscal '22, it seems like the magnitude of your guide is kind of declining and declining and declining. So, I'm kind of wondering help me get my hands around this.\n\nAgain, even if I account for the FX, it seems like the upside -- implied upside in your guide is just lower than what it used to be just a couple of quarters ago. So what is it that we're missing? What has changed?\n\nJanesh Moorjani -- Chief Financial Officer\n\nIttai, so nothing fundamentally has changed. Look, a couple of quarters ago, we told you that we would start to guide with less conservatism in the numbers and set the expectation that folks should not expect a level of outperformance like we've delivered in previous years. And fundamentally, we are staying true to that overall philosophy. So nothing has fundamentally changed in terms of the approach that we've taken.\n\nWe guide based on what we know, and then we work really hard to outperform. And that's what we saw here in Q1. The quarter played out quite nicely. We are quite pleased with the numbers despite the tough comp.\n\nWe delivered really strong revenue and customer metrics, particularly on cloud. We just did what we said we would do, and we continue to execute well. And that's what we will do here in Q2. You'll see that operationally, obviously, adjusting for currency.\n\nIt's effectively a raise for the year. And we will work hard again here in Q2 to see if we can deliver outperformance and then revisit the rest of the year as we go. But we feel really good about how we are positioned for the year and for the longer term.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nVery good. Maybe as a follow-up on the cloud business. How much of that is completely incremental activity versus a switchover from someone who's going from on-premise deployment to a cloud SaaS?\n\nJanesh Moorjani -- Chief Financial Officer\n\nYeah. So fundamentally, when we think about the overall nature of the business, the cloud strength doesn't come from -- solely from transitions in the customer base, right? Cloud is a significant opportunity for us to drive new customer growth and expansion. Customers are just spending more in the cloud. And so that's what we see reflected in our business as well.\n\nSo, it's more because of customer spend and the opportunity rather than trying to drive some sort of a business model transition. And you see that reflected in the net new customer additions, which was, again, consistently strong compared to the prior quarter. We are orienting more toward the cloud in so many ways in product and go-to-market. We talked about many of those activities earlier.\n\nSo we just see that shift happening quite naturally as opposed to us trying to drive some sort of forced march in the customer base. Customers will move to cloud when they are ready. And until they are ready for that to happen, with features like cross-cluster search and replication, we will allow them to be successful even in a hybrid cloud world. So we'll be there for them wherever they are.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nInterpret your comments to me that the bulk of the cloud activity right now is incremental new business versus someone who was on-premise and move to the cloud.\n\nJanesh Moorjani -- Chief Financial Officer\n\nYeah, that's right.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nOK. Thank you so much.\n\nOperator\n\nOur next question will come from Koji Ikeda with Bank of America. Please go ahead.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking the questions. Congratulations on the quarter. Just a couple for me.\n\nOne housekeeping question, just to start off. You guys used to give a monthly cloud revenue as a percentage of total revenue. Did I just miss that? Or could you please provide that if you can?\n\nJanesh Moorjani -- Chief Financial Officer\n\nYeah, Koji, happy to. It was again 17% of total revenue.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, Janesh. And then -- OK, so a big picture question, either for Janesh or for Ash. With the announcement of Ken bringing -- brought on as the chief product officer, I thought it's a pretty awesome hire, but I wanted to kind of ask the question this way.\n\nYou know, Ash, you're a product guy, you're brought into the company as a CPO prior to being named the CEO. I mean, Shay is still there. He's a technologist and a product guy, too, as the CTO, and now bringing Ken on as the chief product officer. So, I guess the big picture question is why now, you know, why bring on a chief product officer now?\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. Thanks for the question, Ken. Fundamentally, Shay is -- has taken on an individual contributor role, like we've said, as the CTO and he's really spending his time on some of the really forward-looking areas around core platform, evolving it to the stateless kinds of architecture that we are driving toward. And the role that I used to play as the CPO, responsibility for all of the products, engineering, design, etc., I've been effectively doing a double job, not just as the CEO, but the interim CPO as well.\n\nAnd as you can imagine, the kind of talent that I was searching for was somebody who could really help us continue on our momentum on the cloud. We -- as we've talked about the fact that our future is in the cloud, building that kind of hyperscale cloud capability as we continue to grow, we imagine a world when in the future, the vast majority of our revenue is going to be on Elastic Cloud, and we want to make sure that we are building toward that future. So, Ken, just given his background, given everything that he's done, is just somebody that we are very excited about. The skill set that he brings to the table, the knowledge of building hyperscale services, what it takes to have that kind of constant availability, the ease of use that is very clear in all the technologies that he's built when you built out the developer tools for AWS, all of that makes us very excited about what he's going to bring to the table.\n\nAnd this is exactly the time when we need somebody with that skill to continue driving our momentum forward. So he's -- we are very excited about having him. And also, the fact that he just knows what it means to work with the hyperscalers. So I'm also very excited about the fact that he's going to help us continue to strengthen our relationship with all the three hyperscalers that we work so closely with.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nExcellent. Thanks, Ash. Thanks so much. Congrats on the great hire.\n\nThank you.\n\nOperator\n\nOur next question will come from Matt Hedberg with RBC Capital Markets. Please go ahead.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking my question. I guess for either of you and Janesh, you have more history here. But I wanted to drill into AWS a bit more.\n\nObviously, we're one quarter in here – is a lot smaller than the other two at this point. But can you sort of maybe compare and contrast the level of uptake that you're seeing with AWS versus maybe when GCP or Azure came on board, anything different there obviously is a much bigger base of AWS, but just sort of curious on some initial observations there.\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. Matt, I just want to make sure that, we clarify that we've been working with AWS for many years now, right, in the sense that we've had integrations and availability of Elastic on the AWS marketplace for a long time. A matter of fact, when you think about customers where they tend to deploy Elastic, the customer base that runs Elastic on AWS is significant because it sort of mirrors the market share that AWS has in the overall cloud market, the cloud infrastructure market. What's really been evolving and in a lot of ways, moving in a very positive direction is the overall relationship with AWS at every level, right? So we've talked about the fact that with the way in which we've been able to resolve some of the trademark discussions with them, now the only Elasticsearch that you see on their marketplace is from Elastic, the clarity that has brought to the market, the ability that, that brings to allow their sellers and our sellers to work together with less friction, all of that has made the day-to-day partnering a lot better.\n\nAnd I've talked about that last quarter. We are continuing to see that kind of sentiment and movement. But I just want to be clear that our relationship with AWS in the sense that we've been on their marketplace, that's not a new thing, that's been there for a while. And we see this more as an evolution as opposed to something that just flipped overnight.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThat's super helpful. I guess -- yeah, I was trying to, I guess, I was trying to get -- the relationship changed recently was more of my question. But you answered it great. So, yeah.\n\nThanks a lot, guys.\n\nAsh Kulkarni -- Chief Executive Officer\n\nThanks, Matt.\n\nOperator\n\nOur next question will come from Brent Thill with Jefferies. Please go ahead.\n\nBrent Thill -- Jefferies -- Analyst\n\nAsh, your results are very different, as you know, versus others. And I'm just curious what you think is giving you this resiliency where you're not seeing things slip like others are seeing? And as a follow-up for Janesh, maybe you could align that -- you think that one is just when you think about the year and kind of what you're expecting in the guide, are you being slightly more conservative in your close rates and what you're seeing to take account for other things that are going on that maybe you're not seeing right now? Or are you just playing at the ball kind of where you've been playing it and given the same level of guidance? I'm just curious to get your thoughts on that.\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah, thanks for the question. Maybe let me just kick it off and then have Janesh sort of speak to the question that you asked him. What I'd say is -- and again, this comes back to the core use cases that we target and what our platform is sort of optimized for. So if you think about the use cases around security, and in security, we always lead with SIEM, like we've talked about, in Observability where we lead with log analytics and then expand from there to comprehensive absorbability.\n\nAnd then Enterprise Search, where a lot of the use cases end up being around whether it's commerce or just searching across data that's very relevant to sort of the core aspects of the business, these tend to be pretty mission-critical. And when you think about Security or Observability, it's really hard for somebody to turn off security or turn off Observability for the Tier 1 applications. And so, we have continued to see the resilience in the demand from our customer base. And the one thing that seems to be continuing to grow is logs.\n\nAnd as that data is increasing, I can't stress enough the strength that we have and the tremendous differentiation that we have in our platform, in our technology, which means that even when customers are choosing to make decisions around what -- where they want to think about spending in different kinds of environments, we are seeing them continuing to choose Elastic. I've talked about the fact that the examples that I gave of customers like O2 Telefonica and others, you're seeing a lot of situations where customers are effectively leveraging Elastic for more and more use cases, whether it be starting from log analytics and going to all aspects of Observability or even crossing from Observability to security or vice versa. So there's a natural affinity to these kinds of mission-critical use cases, and we believe that's a core part of why the results that you see from us are different from what you might have heard from some others who don't have that advantage. Janesh, on to you.\n\nJanesh Moorjani -- Chief Financial Officer\n\nYeah, Brent, on the guidance question, nothing fundamentally changed again in terms of our approach. We're not changing the philosophy in any way. As I mentioned earlier in the prepared remarks, we have not factored in any particular macroeconomic slowdown in the business into the guidance simply because we've just not seen anything like that in the business yet. So we'll obviously continue to monitor the environment to make sure that we operate the business in a disciplined way like we always have.\n\nBut in terms of our guidance, the simple way I think about it is we had a $5 million beat. We did a $10 million raise, which was essentially offset by FX, which brought the guidance back to where it was. But fundamentally, there's no other change in terms of the approach.\n\nBrent Thill -- Jefferies -- Analyst\n\nYou guys have built a crew tonight. Thank you.\n\nOperator\n\nOur next question will come from Kash Rangan with Goldman Sachs. Please go ahead.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nHello. Thank you very much. Congrats on the results, Ash and Janesh. Janesh, I know you talked about consumption trends in the cloud business a few quarters ago.\n\nYou talked about how the shift within the SaaS business from subscription to consumption could be minimizing the revenue to be recognized at the front end, but you also expressed confidence as customers started to ramp up their workloads that you could see a nonlinear, sort of implied nonlinear growth in the cloud business. So, as we progress through that motion, where are we with respect to how customers that are nearing the first anniversary or maybe even post the first anniversary of selling these cloud contracts when the consumption trends should begin to accelerate? And if we're not seeing it now, when are we likely to see that? And I have a follow-up question. Thank you so much.\n\nJanesh Moorjani -- Chief Financial Officer\n\nYeah. Hey, Kash, it's great to catch up again. Look, I mean, at the end of the day, what we've seen in the business is that customers, when they first sign up with us, they will gradually start consuming and then increase that -- their consumption over time. And given the rate at which we are adding net new customers, there's always going to be a mix in the portfolio.\n\nThere are some customers that are earlier on that journey. Some customers that are very large customers for us, well north of -- in the high seven-digit kinds of range kind of customers as well. So, we've got a wide mix there. But in general, what I'd say is customers are continuing on that journey of expanding.\n\nWe mentioned in the last quarter that our net expansion rate on cloud was in excess of 140% and had actually been increasing. And that continues to be the case. It continues to be above 140% net expansion rate on the cloud. So, I think we're definitely starting to see the effects of that, particularly as we drive greater adoption across the solutions and people extend from one solution into another.\n\nAnd architecturally, as we make it a lot easier for them with the additional features that we've been talking about, that makes it easier for them to ingest more data. We've continued to see significant increases in the volumes of data being brought in and stored in Elastic Search. So those are all great indicators for us on future consumption and future growth. So, we feel really good about that.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nGreat. And one for you, Ash. As you navigate toward the $1 billion in cloud revenue by the end of fiscal '25, how do you balance the on-prem subscription business versus the cloud business? At some point, I would suppose that you had an inflection point and you do better in one and worse than the other, or maybe equally good in both. How are you managing through that inflection point, as the cloud becomes a larger and larger part of your business? Thank you so much.\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah, Kash, one of the things that are really important to understand is that unlike some of the other vendors that you hear are sort of trying to bring together a cloud offering that's completely different from their self-managed offering, this is a strength of ours where it's effectively one code base. And so, what that means is, not just from an operational standpoint, but even in terms of the innovation that we are driving into the product, everything that we are building, except for certain things that might be very, very specific to the cloud environment, those customers get benefit even in the self-managed environment. And we aren't -- keep in mind that we aren't doing any kind of forced margin, and Janesh touched upon this, I'll kind of reiterate it. We're not forcing customers to move away from self-managed or anything of that sort of stuff, right? It's customers making their choices.\n\nAnd as we've talked about, customers that are already on self-managed, those instances continue to grow. They are -- as data grows, the utilization, the resource consumption grows, and that just means that we will see the benefits from it, and that's pretty natural. The other thing you said -- I just want to make sure that, we clarify what we have said about the guidance, the multiyear guidance. Our expectation and the guidance that we've talked about is that we're going to cross the $2 billion mark in FY '25, and that cloud is going to account for 50% of our overall revenue by Q4 of FY '24.\n\nSo, I just want to make sure that, that's clear. But other than that, the background behind it is important. And as I described it, the innovation is continuing to apply also to customers that are in self-managed mode. And I would expect that they will continue to do well with those deployments.\n\nBut just naturally, newer deployments, newer workloads are moving to the cloud. And that's a great thing because that's really where our focus is as well, and I expect that we're going to be able to strike the nice balance between both of those areas.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you, Ash. I love the sound of $1 billion. Thank you.\n\nOperator\n\nOur next question will come from Brad Reback with Stifel. Please go ahead.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. Real quick, can you remind us what caused the strength in the cloud business a year ago?\n\nJanesh Moorjani -- Chief Financial Officer\n\nYeah. I think there wasn't -- it wasn't related to any specific deals. It was, I think, just the fact that we had some large customers that were consuming quite heavily, and we had already planned for increases that year and those increases started to happen just a lot sooner than what we had expected. So, there wasn't a single factor that had caused that, but part of it was just that our portfolio was a lot smaller.\n\nAnd so, when you have individual customers that consume at a higher rate, it would show up a little bit more easily in the portfolio at that time.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nOK. And then just following up on that for this quarter in July, did you see any outsized consumption by a handful of customers that helped drive the quarter?\n\nJanesh Moorjani -- Chief Financial Officer\n\nNo, we did not. The consumption rates that we saw, in general, were quite balanced across the board.\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much.\n\nOperator\n\nOur next question will come from Rob Owens with Piper Sandler. Please go ahead.\n\nRob Owens -- Piper Sandler -- Analyst\n\nGreat. Thanks for taking my question. I think you did a good job of highlighting why you win in a hybrid fashion, what the value proposition is. But when you're leading with cloud, lending to the logo acquisition you talked about, what are the biggest differentiators for you versus a whole host of competitors out there in your opinion?\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. Let me take that. The biggest differentiation that we have is our ability to deal with very large amounts of data of any type at massive scale and to do it very, very fast. And this has been the core strength of Elasticsearch, which is the foundation of everything that Elastic has built on top of.\n\nAnd so, everything that we've done in the product is designed in the cloud to make it easier for you to not only onboard your data but then to start getting immediate value from that data. So as data starts to stream in, it's automatically indexed, it's made available to you in terms of dashboards and alerts and everything. And the solutions that we have built around Elastic Observability, around Elastic Security, they come with all of the prepackaged rules that you need to start getting productive and get the kinds of outcomes that you want for Observability or Security that you need. And at scale, we do this better than anybody in the market, and that's -- we're seeing that over and over again in the success that we are having in cloud and competitive environments.\n\nSo, when it comes to logs, which tend to be the beefiest type of data that tend to exist for either Observability or Security, we just have a significant advantage and that's proving out over and over again.\n\nRob Owens -- Piper Sandler -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question will come from Kamil Mielczarek with William Blair. Please go ahead.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThanks for squeezing me in. I just want to follow up on Kash's question around the long-term guidance. What will be the primary catalyst or catalysts for the growth inflection needed to get to that $2 billion in revenue? Is it primarily just scaling cloud? What other investments they need to make to get there? And when are you expecting that uptick in growth?\n\nJanesh Moorjani -- Chief Financial Officer\n\nHey, Kamil, this is Janesh. So, what we said when we laid out that $2 billion number continues to be true even today, right, which is, at its core, what's really behind that is the strength and resilience that we are seeing with our solutions, particularly on the Observability and Security side, where we are continuing to get used for mission-critical use cases, seeing great customer strength and penetration. And the second piece of that is, of course, our momentum in cloud, which, as you've seen, has been growing quite remarkably over the last several quarters. And we've got lots of new customer additions, strong expansion with a high net expansion rate in excess of 140%.\n\nIt's just when you got a portion of the business that is now 39% of the business and is growing that fast, you just hit escape velocity. And so, we've really got both of those things that factor in that were core to the $2 billion number that we had laid out.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThat's helpful. And just as a follow-up, several of your competitors have changed pricing models over the past few years. As they've been rolled out more broadly, can you update us on what you've seen in competitive deals as pricing, especially given the macro concerns become more of a focus in recent months?\n\nAsh Kulkarni -- Chief Executive Officer\n\nWe've seen continued advantage that we have in terms of our pricing model. The discussion around pricing, when it does come up, if it comes up, the fact that we have resource-based pricing, which means that there's never any shelf fair works to our advantage, I know that others have started to sort of emulate it. But to me, like what's important to understand is, this is the way that we've always operated. Our customers know what to expect from us.\n\nOur sales teams understand it, and they work with that model. That's what they lead with. They get it, and there's no friction in the system. And we've been very successful with it.\n\nAnd what we tend to see is when others are -- as they're trying to shift their licensing models, it becomes a pretty clunky conversation. And we are consistent and the fact that we've got history doing this, tends to continue to give us that advantage. And if anything, it's a validation of the fact that we believe this is the right model. It's a validation that others are now trying to emulate us after so many years.\n\nJanesh Moorjani -- Chief Financial Officer\n\nAnd I will give a quick shout-out to Michael and the full field sales organization, right? They did just a remarkable job of holding discounting and driving ASPs and did really well in terms of how we executed in Q1.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThat's very helpful color. Thanks, again.\n\nOperator\n\nOur next question will come from Steve Koenig with SMBC Nikko. Please go ahead.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nHey, thanks, gentlemen, for taking my question. I've just got two, and I'll just throw both of them out there at once, if you don't mind. First one is a little bit in the weeds, but you brought up earlier the relationship with AWS and how it's more settled now, etc., and you're partnering well. And I'm just trying to -- I want to square that with the fact that they did a big OpenSearch release back in May, and that our data shows they put a lot more development resources on OpenSearch.\n\nSo, are you saying they're not really going to market aggressively with that product? Or kind of how do we square those two things? And then just not so that we don't end in the weeds. So, my bigger picture question is, can you give us any color on how your -- the complexion of your use cases that you're selling to new cloud customers versus your -- more of your on-prem use cases? Thanks very much.\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. Let me maybe touch upon the second one. There's no material difference between the kinds of use cases that we see in the cloud or in self-managed. It's very -- there are no patterns there.\n\nWe tend to see all three use cases. When it comes to OpenSearch, one thing that's important to understand is irrespective of the metrics that you look at, the number of contributors, the number of pull requests that are being made, the new features that are being delivered into the source code, we are significantly, by significant factors, ahead of anything that is being done on OpenSearch. The other thing that's important to understand is in the past before AWS created the fork and went with OpenSearch, Elastic used to do all the work of doing the bills, looking at all the compatibility with all the clients. There's so much work that's involved in sort of building and maintaining the core code base.\n\nAnd effectively, AWS is to just benefit from that, right? They would pick the code directly from us. They would pick up the bills directly from us. Now that they have Fork and they have OpenSearch, all of that work maintenance is a massive amount of work that they are now having to do themselves. And as you can imagine, even though they might have added a lot more developers, a huge amount of that capacity, I'm very confident, is being applied to just the bare-bones effort of keeping source code sort of active and maintaining it.\n\nAnd that's a nontrivial amount of work, which most people didn't fully appreciate was what we were doing behind the scenes. So, we are very confident about the continued increase in the moat that we have with OpenSearch and very confident that in the long term, the market is going to speak for all of this innovation that we are driving.\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nGot it. Well, thank you, and congratulations on the very consistent results.\n\nOperator\n\nThis concludes our question-and-answer session.\n\nAsh Kulkarni -- Chief Executive Officer\n\nWell, thank you, everybody, for joining our call today. And I look forward to speaking with all of you during our Analyst Day on September 19. Have a great rest of the evening. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNikolay Beliov -- Vice President, Investor Relations\n\nAsh Kulkarni -- Chief Executive Officer\n\nJanesh Moorjani -- Chief Financial Officer\n\nRaimo Lenschow -- Barclays -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nPinjalim Bora -- JPMorgan Chase and Company -- Analyst\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nBrad Reback -- Stifel Financial Corp. -- Analyst\n\nRob Owens -- Piper Sandler -- Analyst\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nSteve Koenig -- SMBC Nikko Securities -- Analyst\n\nMore ESTC analysis\n\nAll earnings call transcripts"
}