{
  "companyName": "The Trade Desk",
  "companyTicker": "TTD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/the-trade-desk-ttd-q2-2022-earnings-call-transcrip/",
  "content": "The Trade Desk (TTD -1.12%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to The Trade Desk second quarter 2022 earnings conference call. [Operator instructions] It is now my pleasure to turn the floor over to your host, Chris Toth. Sir, the floor is yours.\n\nChris Toth -- Vice President, Investor Relations\n\nThank you, operator. Hello and good afternoon to everyone. Welcome to The Trade Desk second quarter 2022 earnings conference call. On the call today are founder and CEO, Jeff Green, and chief finance officer, Blake Grayson.\n\nA copy of our earnings press release can be found on our website at thetradedesk.com in the investor relations section. Before we begin, I would like to remind you that except for historical information, some of the discussion and our responses in Q&A may contain forward-looking statements, which are dependent upon certain risks and uncertainties. In particular, our expectations around any macroeconomic deceleration, potential impact of the COVID-19 pandemic in various regions where we operate, in addition to potential supply chain disruptions that could disrupt advertising spend on our platform are all subject to change. Should any of these risks materialize or should our assumptions prove to be incorrect, actual financial results could differ materially from our projections or those implied by these forward-looking statements.\n\nI encourage you to refer to the risk factors referenced in our press release and included in our most recent SEC filings. In addition to reporting our GAAP financial results, we present supplemental non-GAAP financial data. A reconciliation of the GAAP to non-GAAP measures can be found in our earnings press release. We believe that providing non-GAAP measures, combined with our GAAP results, provides a more meaningful representation of the company's operational performance.\n\nLastly, I would like to highlight that we are planning to hold an analyst day on Tuesday, October 4, 2022, in New York City. This event will be webcast and available on our investor relations website. I will now turn the call over to founder and CEO, Jeff Green. Jeff?\n\nJeff Green -- Founder and Chief Executive Officer\n\nThanks, Chris, and thank you all for joining us today. As you've seen from the press release, we had a very strong performance in the second quarter. We grew revenue 35% compared with last year, and we outpaced our competitors and continued to gain market share despite some macroeconomic uncertainty. In the first half of the year, marketers shifted to decision data-driven advertising on the open Internet more rapidly than ever.\n\nAnd as a result, The Trade Desk has become increasingly indispensable as the default DSP for the open Internet and connected TV. Perhaps the most encouraging aspect of our business through the first half of this year has been the rate at which we signed new and expanded joint business plans or JBPs with our clients. I haven't spent a lot of time on this dynamic in the past, but I'd like to today because I think this trend says a lot about how we are winning in the market and why that gives us optimism for the future and confidence that we can execute in any market environment. Joint business plans, or JBPs, are long-term deals that we signed with leading brands who aim to increase spend on our platform often over a multiyear period.\n\nIn many cases, these agreements are signed with the partnerships and cooperation of the agencies that represent the brands. So as we continue to move upstream and get more direct commitments from CMOs and brand marketers, it is not at the expense of our valuable agency relationships. In the second quarter, we signed new and expanded JBPs at a record rate, covering many verticals. For example, there were new agreements with some of the world's largest automakers and technology companies, along with significantly expanded deals with large global CPGs.\n\nMany people looking at our results, including those in the advertising industry, are asking how we are winning and growing at this pace in the current environment. There are a few vectors and macro factors that are creating an amazing opportunity for us to grow into a much bigger company and win share regardless of the economic environment. I'd like to take a minute to identify those macro factors that are providing wind at our back. First, there is a secular tailwind that continues to propel us forward, and that's the worldwide shift to advertising-fueled connected television.\n\nI don't know that we've ever experienced a secular tailwind like this before. CTV is evolving faster than anyone predicted. And if we continue to execute, I believe we will benefit as much as any company in the world from this tailwind, just like we did in Q2 and through most of the pandemic. The second macro factor that is helping us grab share is that walled gardens like Google's ad network are being downgraded in priority.\n\nFor most of the last two decades, when dollars moved over from offline spending to online spending, they have gone first to Google and other walled gardens. One way to define a walled garden is to think about an Internet publisher or a content destination that is so large and dominant in their content segment that they can be draconian to advertisers and still win business. Google's advertising products are a textbook example. Many have pointed out that Google does its own performance measurement.\n\nThey have run marketplaces with questionable integrity and fairness, but they win advertising budgets because of their dominant position and their size and footprint around the world. CTV has started to change this dynamic in our industry though because no one in CTV is big enough to be as dominant in TV as Google has been with search or with Chrome or double-click, their ad server that is almost irreversibly integrated into the Google ad network machine. As a result, the marketplace for premium CTV is fair, especially in relative terms and extremely competitive. Because of the efficacy of moving picture and sound, coupled with these competitive market dynamics, for the first time ever, some of the biggest brands in the world have a new place to spend their first dollar on the Internet, which is premium CTV.\n\nCTV is fast becoming a must buy, and in some cases, the highest staff rank part of the digital media plan for many brands. This trend is changing the makeup of the whole Internet, and it is likely to change the role of walled gardens in our industry especially the smaller walled gardens. So the bottom line on this second major macro trend, the draconian tactics of walled gardens are now being challenged because of the competitive nature of CTV as advertisers increasingly prioritize premium CTV content. And lastly, I'd like to talk briefly about the third macro force that is changing the landscape before I come back to us, The Trade Desk and what we're doing and how we're taking advantage of these trends.\n\nThe third macro trend that is creating market opportunity for us is the worldwide pressure on Google. There has been a great deal of regulatory scrutiny of Google over the past couple of years. We've seen the reports of investigations and complaints from the Department of Justice, the States Attorneys General concerning various forms of alleged antitrust violations in Google's ads business. But it's not just here in the United States.\n\nIt's also in various other countries around the world. Recently, the U.K.'s Competitive Market Authority or the CMA announced it is investigating whether Google has broken the law by restricting competition in digital advertising in the U.K. As the CMA chief executive Andrea Coscelli said, and I quote, \"We're worried that Google may be using its position in ad tech to favor its own services to the detriment of its rivals, of its customers and ultimately of consumers.\" Weakening competition in this area could reduce the ad revenues of publishers who may be forced to compromise the quality of their content to cut costs. It may also be raising cost for advertisers, which are passed on through higher prices for advertised goods and services.\n\nSo let me be very clear about this point. The Trade Desk stands to gain share no matter the outcome of these investigations or lawsuits. I believe Google's biggest obstacle to compete in programmatic and in CTV is their lack of objectivity. By contrast, we don't own any inventory, and we can partner with everyone in CTV.\n\nThat gives us a level of objectivity that Google can't overcome as long as it owns YouTube and its search engine, its core assets, and continues to operate on both the buy side and the sell side. Advertisers are increasingly aware of the very concerns that the CMA is raising, especially the large brand advertisers and their agencies that today constitute the majority of spend on our platform. As a result, I'm confident we will do well regardless of Google's moves in programmatic and with DV360, their demand-side platform or DSP. In addition to thinking about The Trade Desk and how we gain share, I'm often asked to speak about the open Internet more broadly.\n\nWhen I put that hat on and speak on behalf of the open Internet, I do get concerned about what Google has done to make it much harder for companies smaller than The Trade Desk to compete in the open Internet. I'm concerned that the press and regulators are too focused on what assets Google owns or should own and instead should apply more scrutiny to Google's behaviors, their incentives, their structure and their tactics. But that's for another day. I believe so long as we execute, The Trade Desk is going to do well regardless of what tactics Google deploys.\n\nEven when Google plays unfairly as some regulators have alleged, it tends to move advertisers and agencies to us. This is one of the reasons we are reporting such a good quarter today and why we're so optimistic about our future. So with that, let's shift gears to discuss our strategy, our tactics and how we're executing. So let's discuss what's happening inside The Trade Desk.\n\nAcross the company, we're very clear on our mission, and we're extremely focused on helping agencies and advertisers as we always have been. We are focused on the buy side, and our goals are clear, to be the objective open Internet alternative to walled gardens, to pioneer a new approach to decision TV ad buying, to help build the new identity fabric of the Internet and to create a better open Internet for everyone, including us, to enable brands to safely and easily deploy their first-party data and to add more value by creating a more efficient supply chain. It's because of these factors that more and more of the world's leading advertisers are embracing our platform compared to our competitors. It's also why you saw a string of key partnership announcements forged in the second quarter, whether it's Disney partnering with us as they race to ensure that the majority of their ad impressions are automated, or Amazon's AWS, ensuring that the many brands who use their marketing data services can now transact on UID2, the same with Experian who's using UID2 as a common currency or Albertsons becoming the latest retail media partner on our platform to improve measurement and insight for brand selling products at Albertsons.\n\nAnd of course, Albertsons has committed to using UID2 to do this. I also want to talk about Netflix's recent moves. I believe they are in a very strong position to be a leader in AVOD and hybrid pricing models similar to how they've led the way for more than a decade in SVOD. We have a great relationship with Netflix.\n\nWe also have a great relationship with Microsoft. We've had many constructive conversations with Netflix over the last few months. I personally am very impressed with how quickly they are diving into advertising. The Netflix partnership with Microsoft is very positive news for the open Internet.\n\nThe fact that Netflix didn't choose Google is very telling. We believe it's another strong indication that more industry leaders recognize the opportunity of the open Internet compared to the dangers and limitations of walled gardens. By partnering with Microsoft on the supply side of the digital advertising equation, Netflix controls its own destiny. They chose a partner that can represent their interests, not one with a conflict of interest.\n\nXandr is a strong sell-side partner and has been a great partner of ours for years. In fact, almost 12 years ago, I initiated the partnership between Microsoft and AppNexus, the company they now own that has been renamed Xandr. Netflix and Xandr have a lot of ground to cover. Once they've done the work on the supply side, driving as much demand as possible toward those ad impressions will come next.\n\nOver time, Netflix is very well positioned to open their ad inventory on the demand side to the open Internet. that would enable demand-type players to compete in an open objective and decision market, driving high CPMs and maximizing the value for both the advertiser and the publisher, in this case, Netflix. They will need to figure out how to do what Disney and their properties like Hulu are doing so well right now, which is creating a personalized TV and ad experience that respects consumer privacy. Disney is setting the pace on this today, which sets a model for what technologically savvy media companies like Netflix and NBCU and Paramount and so many others are likely to pursue very quickly as well.\n\nAs you know, I predicted publicly and repeatedly many years ago that Netflix and other subscription CTV leaders would eventually offer some kind of ad-supported option. The economics of the market demand it. And so, many streaming providers have proved how attractive CTV is to advertisers. We work with almost all of them.\n\nFor example, one of our early CTV partners, NBC continues to go from strength to strength on our platform with fully biddable inventory now available across its entire portfolio, including Peacock, which is driving significant interest and growth from our advertisers. The same is true of other premium CTV pioneers, including Discovery Plus and HBO Max, which went live recently as well. As a result of our work with the world's leading CTV pioneers, The Trade Desk is now the largest demand source for decision premium CTV advertising. And CTV is now reaching the kind of scale where it is forcing change across the advertising ecosystem.\n\nCTV leaders will help forge the future of identity. It's where we will dislodge the bricks of the walled gardens most rapidly. It's where advertisers now have globally scaled premium content alternatives to user-generated content. And because CTV has a massive authenticated logged-in user base, it's where advertisers and publishers will innovate new ways to create personalized experiences while also improving consumer privacy and better explaining the quid pro quo of the Internet.\n\nThere is arguably no company on the planet that cares more about consumer privacy than Disney. They've spent decades building a brand based on intentional, personalized experience across all of their channels. But as they do that, they also want to ensure that their consumers' privacy is highly protected. As you've seen, Disney recently announced an expanded global partnership with The Trade Desk.\n\nAnd as a key part of that partnership, Disney will become interoperable with UID2 across all channels. As you know, Disney engages consumers in many different ways, all of which are incorporated into their Audience Graph, which is now interoperable with UID2. Aaron LaBerge, the president and CTO of Disney Media and Entertainment Distribution, perhaps said it best, and I quote, \"The growth of our relationship with The Trade Desk is a milestone in addressability and automated buying at scale and the latest step as we use technology to enable advertisers to buy once to deliver everywhere across Disney.\" I want to spend a moment on why UID2 is so important. A couple of weeks ago, Google announced that they are delaying the demise of third-party cookies in Chrome until at least the second half of 2024.\n\nIf you've been paying attention to anything we've said over the last couple of years at The Trade Desk you'll understand how completely predictable this announcement was. I've said I'm not sure it is ever in Google's best interest to get rid of third-party cookies, but it ultimately doesn't really matter that much. The uncertainty around Google's decision-making is only hardening the resolve of the rest of the industry to develop new approaches to identity. It is shortsighted to think about this work as simply a replacement for cookies.\n\nThat doesn't really capture the scope of what's going on, and Disney is a great example of this. Disney wants to pioneer new ways to create highly personal experiences that protect consumer privacy across all channels. In most of those channels, cookies are not even present. It's much bigger than cookies.\n\nCTV does not rely on cookies. Successful consumer-oriented companies are taking a holistic approach to the consumer across all experiences and designing something new. Marketers understand that key marketing objectives such as reach, frequency and data usage and privacy can be managed in a much more deliberate and decisioned and holistic manner. Part of the reason that Disney can act with confidence here is because we've already done the hard work of activating UID2 across the data infrastructure that's something of the central nervous system of digital advertising.\n\nAWS is a great illustration of this. AWS recently announced that they will enable their customers to deploy UID2 to help liberate the customer data stored on their platform, and AWS is one of the largest aggregators of marketing data in the world. If an advertiser uses AWS already, they can use UID2 to create an identifier that helps put that data to work without any of the data ever leaving AWS. AWS is just the latest infrastructure leader to deploy UID2.\n\nThey are joining other leaders that include Oracle, Adobe, Salesforce and Snowflake to help build the new identity fabric of the Internet. The latest major data player to join this movement is Experian. Experian Marketing Services is one of the leading suppliers of marketing data and insights to advertisers, and they are now using UID2 for their third-party data sets. As we've said all along, the success of UID2 will never hinge on ringing 10,000 doorbells.\n\nFirst and foremost, it's about gaining traction with the infrastructure of the ad tech industry, and with that infrastructure in place, it is much easier for advertisers and publishers to activate because UID2 is already embedded in the tools they rely on. In a world with better identity solutions like UID2 instead of cookies, publishers will make more money per ad. Advertisers will need fewer, more relevant ads to make an impact and sell product. Consumers will have more privacy and more control over their privacy.\n\nAnd that's why I'm confident that almost all of our customers will be transacting on UID2 by the end of this year. As I said at the beginning of my remarks, we are highly encouraged by our performance and optimistic about our ability to outpace the market moving forward. The combination of macro trends and our own innovation enables us to deliver differentiated value to our clients. Of course, we understand many of our customers are dealing with uncertainty.\n\nBut even with that uncertainty, we remain focused and confident. Programmatic advertising first came of age during the global financial crisis between 2007 and early 2009. We launched The Trade Desk right in the heart of the uncertainty in 2009. And while we are not immune to macroeconomic weakness, we gained share coming out of the uncertainty during the early months of the COVID pandemic.\n\nAnd it's because in times of uncertainty and volatility, when marketers have to make the most of every advertising dollar that we have an opportunity to demonstrate our value. Our customers recognize that efficient and decisioned advertising can play a critical role in differentiating their brands to specific audiences and specific times. And there's no better platform on which to do that than The Trade Desk. Throughout the first half of 2022 and particularly in the second quarter, I believe we have gained more market share or grabbed more land than at any period in our history.\n\nAnd in large part, that's because as marketers become more deliberate with their budgets, they are prioritizing advertising that delivers the highest return. And CTV has moved up the priority list. So while we can't control the macroeconomic environment, the pace at which we are signing new and expanded customer agreements indicates that we are becoming an indispensable partner in their business growth, and we anticipate grabbing land regardless of the macroeconomic environment. We will never rest on our laurels.\n\nAs one of the few high-growth tech companies that consistently generate strong adjusted EBITDA and free cash flow, we have the financial flexibility to invest so that we can innovate for our customers. Last year, on 7/7, we launched our biggest platform upgrade in our company's history. A year later, 100% of our customers are now using our Solimar platform, with all the data, the measurement and decisioning benefits that Solimar brings them. This is perhaps our greatest engineering achievement yet.\n\nWithin Solimar, our data marketplace continues to expand rapidly. Many leading retailers are now integrated with our platform, including Walgreens, Albertsons and Target. And we continue to see utilization growth from both endemic and non-endemic advertisers. We continue to innovate to help build the new identity fabric of the Internet, whether it's the data infrastructure work that's already proving so successful in North America or the early work around EU ID in Europe, which is already gaining very encouraging traction.\n\nWe continue to see success from brands working with the Walmart DSP with significant quarter-over-quarter growth and the strongest quarter yet. And in CTV, we are already beta testing our forward market product. We're working with select streaming platforms and advertisers to bring this new approach to CTV decisioning in advance of next year's upfront. And early results are very positive.\n\nA strong forward market should replace the upfront market and provide a better TV experience for the whole ecosystem. Our early adopter advertisers are seeing excellent win rates, and they want to commit larger budgets to it. And publishers are gaining confidence that this should become an essential component of monetizing their inventory. As I said at the outset, the transformational impact of CTV, the revolutionary approaches to identity and growing instability in some of our walled garden competition will only accelerate our ability to deliver value and to continue to gain share.\n\nI could not be more excited about the work ahead of us in the second half of this year and in the years ahead. And with that, I'll pass the baton to Blake, who will give you more color on the quarter.\n\nBlake Grayson -- Chief Financial Officer\n\nThank you, Jeff, and good afternoon, everyone. As you have seen in our results, Q2 was a very strong quarter. Revenue was $377 million, representing an increase of 35% year over year. Our top line growth of 35% is especially impressive given we are comparing against a prior year growth rate of over 100% in Q2 of 2021.\n\nWhile the macro environment has created some uncertainty, and we are not immune to it, we continue to gain share as more and more advertisers seek efficiency and measurable results in their ad spend, particularly in CTV. We also benefit from the diversity of our business model, including not only the breadth of advertisers and verticals we represent, but also the range of inventory we have access to across the open Internet, which provides a long-term durability we are proud of. During the quarter, we benefited from a digital advertising environment that is shifting increasingly toward data-driven buying and measurable results. Growth was broad-based across channels and verticals this quarter.\n\nWe saw continued strength from CTV, which again led our growth from a scale channel perspective. We successfully completed a full transition to Solimar, and our customers continue to see positive results as they utilize our platform to sharpen campaign goals, activate our industry-leading AI and leverage more data elements per impression. We are also seeing progress in our shopper marketing business. We have brought new partners into the platform over the past few months, and we are pleased to see increasing interest and adoption from advertisers utilizing shopper data in their campaigns.\n\nAlthough it is still very early days for us, spend that utilizes our expanding shopper data lineup continues to ramp very well. With the continued strong top line performance in Q2, and we've generated $139 million in adjusted EBITDA or about 37% of revenue. When we outperform on the top line, we often see that outperformance drop down to EBITDA, as it did again in Q2. I'm proud of our sustained efforts to consistently generate meaningfully positive EBITDA while continuing to invest in the critical areas of our business that can drive our future growth.\n\nThis was particularly true in Q2 as items such as our first live companywide event in over three years resumed and travel also continued to ramp up. From a channel perspective, CTV by a wide margin led our growth again during the quarter. Exiting Q2 video, which includes CTV, represented a low 40s percentage share of our business and continues to grow rapidly as a percentage of our mix. Mobile represented a high 30s percentage share spend during the quarter.\n\nAnd display and audio continued to represent about 15% and 5% of our business, respectively. Geographically, North America represented about 90% of spend, and international represented about 10% of spend. Spend in North America maintained its resiliency as we continue to win new business and gain share. In particular, our Chicago office, which is our second largest office behind New York, grew spend faster on a year-over-year basis than any other office in the world that represent at least 1% of our spend.\n\nFantastic results by that team as we continue to expand our reach. Our international spend grew both sequentially and year over year but dropped slightly as a percent of overall mix. Historically, our growth has been driven by the strong position we have in CTV, particularly in North America, as was the case again in Q2. However, our CTV business internationally continues to grab share.\n\nCTV spend in Europe, again, more than doubled year over year. Despite a challenging macro environment, particularly in Europe, we are focused on making the long-term investments that will position us to be stronger when conditions improve. As we have proven in the past, as our customers become more deliberate and data-driven with their ad spend, much like they did in late 2020, The Trade Desk is in a great position to help customers achieve better ROI and win more of their budget. In terms of the verticals that represent at least 1% of our spend, nearly all of them grew in the double digits during the quarter.\n\nBoth travel and pets more than doubled compared with a year ago. Food and drink and technology were also very strong with food and drink accelerating on a year-over-year basis every month during the quarter. Home and garden and automotive grew slower than the average. However, both verticals grew faster than the average in July.\n\nAdditionally, automotive still grew in the double digits in Q2 and accelerated in growth from Q1. We continue to believe that there is the potential for share gain and improvement in most of our verticals. Turning now to expenses. Q2 operating expenses, excluding stock-based compensation, were $250 million, up 45% year over year.\n\nGrowth in operating expenses is influenced by investments in our team, particularly in areas like sales and marketing and technology and development as we continue to build a platform for long-term growth, as well as the return of in-person events. Income tax was $21 million for the second quarter. The higher amount of tax relative to prior quarters was driven primarily by lower benefits from stock-based awards, the timing of which are variable. Adjusted net income was $99 million or $0.20 per fully diluted share.\n\nNet cash provided by operating activities was $92 million for Q2, and free cash flow was $86 million. DSOs exited in the quarter were 91 days, up nine days from a year ago. DPOs were 73 days, up six days from a year ago. We exited Q2 with a strong cash and liquidity position.\n\nCash, cash equivalents and short-term investments ended the quarter at $1.2 billion. We have no debt on the balance sheet. Turning to our outlook for the second quarter. We estimate Q3 revenue to be at least $385 million, which would represent growth of 28% on a year-over-year basis.\n\nIn Q3, we anticipate US political midterm election spend to represent a low single-digit share as a percent of our business. We estimate adjusted EBITDA to be approximately $140 million in Q3. While there is continued uncertainty about the macroeconomic environment, we continue to feel confident in our ability to execute and take share. Given the large available market in front of us, we see significant opportunities to invest in our business.\n\nIn more uncertain times, this enables us to widen the distance between ourselves and our competition in areas such as technology, identity, supply chain optimization and customer service. In closing, we are extremely pleased with our strong performance in the quarter with significant growth drivers, including CTV, retail media, our international business, Solimar, as well as the US midterm election cycle. We remain highly optimistic about our future prospects. We continue to generate strong annual free cash flow and the strength of our business model and balance sheet have positioned us well as we enter the second half of the year.\n\nThat concludes our prepared remarks. And with that, operator, let's open up the call for questions.\n\nOperator\n\n[Operator instructions] OK. The first question is coming from Shyam Patil from SIG. Your line is live.\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nHey, guys. Congrats on the results and the outlook. Jeff, I wanted to ask, this is now the second quarter in a row where your results and outlook are significantly better than what we're seeing from other ad-supported companies, especially in the face of a slowing macro. And I was just wondering if you could just maybe talk a little bit about what you think is driving that outperformance.\n\nThank you.\n\nJeff Green -- Founder and Chief Executive Officer\n\nThanks, Shyam. So first, let me just say, I'm incredibly proud of our Q3 -- the start to Q3 and especially our performance in Q2. But let me just highlight just a couple of the things that have really gone our way in Q2 and given us so much momentum going into Q4 -- or goes into Q3 and Q4. First, we have an amazing secular tailwind of CTV, arguably the best secular tailwind we've ever had.\n\nSecond, we are, of course, seeing the benefits of Solimar, which we've gone to 100%, and it just has all these benefits to our clients. Third, we've got this momentum around the joint business plans where we're just getting closer to brands, and we're creating better partnerships with each of them. And one of the things that they're excited about is just our relationships in shopper marketing. You'll recall, we started with the very biggest retailer in the world in Walmart, and we just continue to expand on that.\n\nWe highlighted some of those, including Albertsons, during the prepared remarks. But I do want to emphasize that we have never claimed to be a bellwether of the economy or of advertising yet. And what I mean by that is, I think a lot of times, people look at our performance and say how is this so different than everybody else's. And what is often happening is we're winning because of those secular tailwinds and because programmatic is growing share and because digital is growing share.\n\nAnd meanwhile, it is possible to have some macroeconomic headwinds in our face and have a secular tailwind on CTV and all the things I just talked about that overshadowed that. And I think what we're seeing right now is just an amazing trend which is that CTV in particular is extremely competitive. It's also extremely effective. And so, as people are looking for alternatives to walled gardens, they are looking to companies like us who can give them objectivity to buy across all the fragmented places.\n\nMany of the of the smaller walled gardens I think are especially under pressure. And as I've said, I think CTV can be the thing that brings down the walled gardens. But then I'll start with those that are smaller. So I think often we're being compared to walled gardens of various sizes, and I don't necessarily think that's a fair comparison.\n\nAnd of course, I think we're also an anomaly from the macro. So hopefully, that part is not all those things, but I'm really proud of what we did in Q2 and really optimistic about our Q3.\n\nChris Toth -- Vice President, Investor Relations\n\nThanks, Shyam.\n\nOperator\n\nOK. The next question is coming from Vasily Karasyov. Your line is live.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nThank you. Just a follow-up maybe on the first question. Can you, Jeff, please talk about what's going on in connected TV? I'm sure you know that some connected TV players reported a fairly slow growth in Q2 and guided to continued slow growth in the remainder of the year. And if I listen to your remarks and assuming that your connected TV spend is growing at least double your overall spend, that would imply at least 50% growth.\n\nSo can you explain to us how to understand that, what diversification is about? And as a quick follow-up there, maybe you can tell us about how you use the terms scatter market and spot market in connected TV that sort of became a thing this earnings season?\n\nJeff Green -- Founder and Chief Executive Officer\n\nYeah, no problem. Thanks for the question. So as I mentioned, CTV is a secular tailwind that continues to help drive our business. I would even say it continues to lead our business including our growth, the scale that we're seeing is amazing.\n\nAnd the changes in the world, including the pandemic, which made everybody stay home and stream a lot more, have created changes to the ecosystem that I don't think anybody predicted. And if you just take a step back and you think about five years ago, you would have thought that HBO and Netflix would be showing ads, I think a lot of people were public about saying that isn't going to happen, and it's happening now. So there are these tailwinds that I just can't overstate and that as a result, CTV is often becoming the place where the very first dollar is spent. But one of the things I really like about your question, and it gives me a platform to talk about is, OK, well, then why isn't everyone in CTV seeing the same sort of growth that you're seeing.\n\nAnd there are a couple of reasons for that. One, there are some companies that are deploying the walled garden strategy, which is that I have something special either on my operating system or on my channel, and you should buy that exclusively through me. And as I mentioned in the prepared remarks, no one in CV has a position that is strong enough to be draconian the same way that you can in other parts of digital like search or social or some of those others. So as a result, those tactics, I think, are proving more difficult as more and more choices are coming online.\n\nSo a platform that sits objectively and helps people choose across the 20, 30, 40 places where you could buy, I mean, think of your own habits as a consumer, you are probably watching CTV on two or three apps five years ago. Now, you're probably watching them on seven, eight, nine, 10-plus. That fragmentation creates a greater need for somebody that centrally partner with all of them, measure reach and frequency and performance across all of them and have to have a business model that is eligible to partner with everybody. So that's why I would argue that we have outperformed everybody else, is that unique position and that unique strategy that we've deployed.\n\nAs it relates to scatter versus spot, and I know in this earnings season, there has been some discussion about scatter. Let me just break it down really simply. Scatter is a reference to a linear or traditional television, where you buy things in upfront, those things that either don't work out as planned or need to be adjusted to. You create this middle market where you're buying traditional television with traditional budgets in a not very sophisticated quickly adapt market.\n\nDefinitely from that is the spot market and what I would call the spot market is the programmatic market that we operate in. So when people talk about scatter and spot, especially because when they're talking to people in the financial industry, they can draw analogies to equities that don't seem that different. But really, what we're talking about in television, one, it is very closely associated with the upfront market, which was invented in the '60s. The other one, we're talking about digital that brings all of the data and decisioning to bear that the Internet can really offer.\n\nThat is what makes it. So television is going to get better and better, which is there are going to be fewer ads. They are going to be more relevant. They're going to be highly effective, and that funds content at a rate that has never been seen before.\n\nThat can only be done by a spot market and a forward market, not a legacy upfront market and scanner market. So those are the reasons why there's a big difference in rhetoric around scatter versus spot. The spot market is amazingly strong, the strongest it has ever been, and that's because of the variety of apps that are coming into the ecosystem and the need for ad-funded content because all of them need ad dollars in order to continue to fund their content-making machines.\n\nChris Toth -- Vice President, Investor Relations\n\nThank you, Vasily.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is coming from Brent Thill with Jefferies. Brent, your line is live.\n\nJames Heaney -- Jefferies -- Analyst\n\nGreat. This is James on for Brent. Jeff, could you just spend a little more talking about -- a little more time talking about what the Disney partnership means for your business? How much access does this deal give you to Disney's premium CTV inventory? And to what magnitude does it grow your footprint for UID? That's my first question. And my second is for Blake just around hiring plans.\n\nWe've definitely heard a lot of companies in the ad industry pulling back on hiring. So I just would love to hear where you guys sit on hiring plans for '22.\n\nJeff Green -- Founder and Chief Executive Officer\n\nAwesome. Thanks. I'll go first and I'll let Blake in just the order you asked the question. So let me first just reiterate our strategy in UID2.\n\nSo first, we created UID2. We open sourced it. We gave it to the ecosystem. This is not ours, but it is something that we really want to see successful because we think there needs to be a privacy safe currency that makes it possible for personalization to take place at large scale.\n\nThat needs to replace cookies, but it also needs to do way more than that. And when people reduce it down to a discussion about replacing cookies, it doesn't really capture what it's about. And it is a currency of the Internet that makes personalization and privacy control way better than it exists today. The way that you win that way, the way that you fix the infrastructure of the Internet, which can be massively upgraded, especially so that consumers have more control over privacy, is that you partner with the infrastructure.\n\nMany might mistakenly think the way that you change the infrastructure of the Internet is you partner with millions of publishers or millions of apps or hundreds of content creators in television. And instead, it's to start with the infrastructure. So the deal with Disney wouldn't have easily been done if we hadn't already partnered with Salesforce or Snowflake or Adobe or AWS, some of those infrastructure plays that make it possible. But because we have, it made it easy for us to then have great conversations with Disney.\n\nAdditionally, Disney has done an amazing job of assembling all of its different assets, including Hulu, which was one of the first connected TV plays to really understand the benefit of highly relevant ads and high CPMs that come from relevance and that you, of course, have to have a strategy around identity and personalization in order to get those high CPMs and in order to get that benefit. And so, I think one of the things that Disney has really led the way on is making certain that all the way at the top of their technical organization, they have a clear understanding of what it takes to provide personalization and consumer privacy protection and control at the same time. And while doing that, I think that they have made it possible to better monetize Hulu, ESPN, ABC, Disney, FX, and so many other things that they own. Because they own so many of those and because I think they understand that relationship at the highest levels of the organization, I think this partnership is really significant because, No.\n\n1, I think Disney has a clear strategy going forward that some others don't. And two, I think we've established ourselves as a great partner of theirs, and we continue to provide them with an amazing amount of demand and high CPMs that is going to fuel their business and better content. Because they represent such a significant amount of the inventory and especially because almost everything in CTV is logged in, this represents a massive step forward for UID, for an authenticated Internet, for a better Internet. And when you look at extended runway for cookies going away, as well as just the need for CTV to get better at monetizing, this represents a move forward for everyone.\n\nSo I do think Disney is proving itself to be a leader once again. So it's hard to overstate the significance of the partnership. Blake?\n\nBlake Grayson -- Chief Financial Officer\n\nYeah, sure, James. Regarding your question on the hiring, I just would take just a real quick moment to step back a little bit. We think about where we are in our business, we have -- we're in one of the greatest situations, I think, a company could ask for, right? We've got high top line growth, high EBITDA growth with strong margins, and we also generate solid, consistent annual free cash flow. And so, having those three things operating together for me, it's got super special meeting, as you can imagine.\n\nAnd what it does is it gives us the opportunity and the ability to be deliberate with our choices. And in doing so, I'm also proud of our ability to stay disciplined with those investments regardless of the operating environment that we're in. You mentioned what other companies are doing. And based on what we're hearing, well, there are many of our peers that might have more resources, that are pausing hiring or cutting investments because they invested too aggressively.\n\nWe didn't get ahead of ourselves the last couple of years, like it sounds like many companies did. And I think that's really paid off for us. It's given us the ability to stay the course and be deliberate about our investments including hiring, which is one of the largest ones that we will entertain. And so, like we mentioned earlier this year, we expect to increase the pace of our investments as we focus on the long-term growth of the business.\n\nBut we're always going to stay mindful of long-term productivity supported by our business model. So with regards to hiring and how it affects expenses and such, our Q2 EBITDA was super strong, and that included our first full company in-person event that we had in over three years. Our Q3 forecast reflects that investment thesis that we can continue to generate strong EBITDA and invest for the long term. And we're focused in hiring in areas that fuel our growth, whether that's engineering or business development or account management roles.\n\nAnd so, I'm comfortable with the trajectory that we're on and where things stand. And I really think that we can pursue those investments in an operating expense structure that we believe is actually better than pre-pandemic. So I really like the position we're in to drive more efficiency, more EBITDA and free cash flow, but also as we scale. And so, I'm really excited about our situation there.\n\nChris Toth -- Vice President, Investor Relations\n\nThanks, James.\n\nOperator\n\nOK. The next question is coming from Youssef Squali with Truist Securities.  Your line is live.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nGreat. Thank you for taking the questions and, obviously, congrats on a really strong performance, all things considered. Jeff, with Netflix going with Microsoft and Xandr being an SSP but also DSP itself, what does that mean for The Trade Desk opportunity with Netflix over time? And as there is going to be a great deal of inventory coming into the CTV market from Netflix and, I guess, others, just could that be a depressant factor for pricing for connected TV in the short and medium term? And then Blake, maybe just a quick one with Solimar adoption at now 100%. I think that's what you said in the prepared remarks.\n\nAny way to help quantify the contribution of that software upgrade to the outperformance this quarter? Thank you. Thank you so much.\n\nJeff Green -- Founder and Chief Executive Officer\n\nYou bet. Thanks, Youssef, for the question. I actually was hoping somebody would ask about Netflix and Microsoft because I think it's one of the most exciting things that's happened in our space in the quarter. So let me first just restate something that Netflix stated on their earnings call, which I think is a direct quote.\n\nIt's still early days. So Netflix has been like learning about the advertising business or in the advertising business for only a few months as they have established a very important but early partnership. But I for one was very excited when I learned that they had selected Microsoft for a number of reasons. As many of you know, I worked at Microsoft before I sold the first ad exchange to Microsoft.\n\nI, in fact, introduced the president of the ads division at the time the CEO of AppNexus, which later became Xandr. So it's been a part of my personal journey, as well as the fact that I've just been very close to AppNexus and Xandr. Of course, then are now being owned by Microsoft. Xandr, as you point out, Youssef, has a small DSP but it is primarily an SSP.\n\nThey primarily focus on the sell side. If you look at the -- if you were to stack rank the major players of demand for CTV, I think you'd find that we're the largest, and somewhere around No. 10 near the bottom of the top 10 list would be Xandr in terms of size. I would estimate that they provide less than 10% of the demand to other independent inventory or content companies.\n\nSo as a result, what I think that is, is a clear identity strategy. I think they very clearly are going to have to have a strategy both for identity, as well as for monetization that involves the open Internet. Because this is early days, it's less important to me about the role that Trade Desk plays with Netflix in the crawl phase than it does in the walk and the run phase. And to me, selecting Microsoft makes it so it's nearly inevitable that Netflix will be a part of the open Internet and that they'll welcome demand from lots of different places and that that will be the only way that they can maximize their inventory and get the highest CPM as possible.\n\nAs somebody who wants to see Netflix do well and has a strong relationship with Netflix leadership, I think this is a solid plan. It's a great start. There's a lot of work ahead of them. But I think that we're extremely likely to have a great partnership with them over the long term, but there's a lot of stuff that has to be done in order for Netflix to be the leader in AVOD that they've been in SVOD.\n\nBut I'm looking forward to it.\n\nBlake Grayson -- Chief Financial Officer\n\nAnd then with regard to your question on Solimar, I'm really excited about the traction that we've seen that I think the product really separates us from the competition. And we did reach 100% usage. I think that it took us about a year to get there. I think the last major product update took like 50% longer in the amount of time it took.\n\nSo it's a real testament to the team and the value that I think we're providing the customers that are going to upgrade. And so, on a usage basis, the trends look good like average data elements used per impression more than doubled for the same customers on our previous platform. Average channel usage has increased over 50%. And then, the AI machine learning element that we have, the adoption on that on Solimar, I think it increased around 50% versus the prior platform.\n\nAnd this is all about getting customers a better ROI. If we can do that, they're going to return again for future campaigns. And we think that what that does is it spins the flywheel for everybody, for us included. And so, just really excited about the momentum here and really proud actually what the team was able to deliver.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nThank you, both.\n\nChris Toth -- Vice President, Investor Relations\n\nThanks, Youssef.\n\nOperator\n\nOK. Up next, we have Tim Nollen with Macquarie. Your line is live.\n\nTim Nollen -- Macquarie Group -- Analyst\n\nHave piqued my interest, especially about the spot market response, a few questions ago being forward market and how it's different from scatter. You also mentioned in your prepared remarks about a forward market product. I wonder if you could help maybe explain a bit more what that is. Is this something that sets you up for more of an upfront participation for CTV guaranteed deals next year? Maybe just a bit more color on what that is.\n\nAnd then, I'm assuming Unified ID 2 will factor in to all of this. And you said you're optimistic about this becoming kind of a transaction standard for this year. Would UID2 be playing a more prominent role in measurement or attribution of CTV ads going forward?\n\nJeff Green -- Founder and Chief Executive Officer\n\nThanks for the questions, Tim. So maybe aside from CTV, my favorite topic to talk about is actually a forward market. And I especially love to talk about it in the context of investors just because you live the concept every single day even though it's somewhat foreign to advertising. So first of all, the upfronts, this process where you commit to buy ads on television was a process that was created in the early 60s.\n\nIn fact, we've sort of jokingly made comparison -- maybe half jokingly made comparisons to the fact that the audio cassette was invented the same year that the TV upfronts were. And audio cassettes obviously have evolved. We don't use them anymore in our daily lives. But the upfront hasn't changed much, and the process is exactly the same.\n\nYou have a party or an event where you commit dollars to advertising for the better part of the year with the absence of data and transactions, like it's just -- in a way, it's even strange that is industry it still happens that way. I mean if we had a forward market for two looks that was exactly the same as it was 400 years ago. We would look for ways to evolve. We'd do something different.\n\nSo the forward market that we're developing with our partners is much more like the commodities market, where you have forward contracts, you use data and forecasting to get the benefits of commitment. And the thing that is really amazing about TV ads in particular is that publishers are willing to take less money if you will commit to buy it in advance. And advertisers are willing to pay more money if they can have the assurance that they're going to get it. I mean imagine you wouldn't spend $3 million, $4 million or $5 million to make a Super Bowl ad if you didn't know it was going to run during the Super Bowl.\n\nSo commitments can be a really important part of television. And so, as we move to CTV, there's no reason to create a rudimentary 1960s version of a forward market. We should create one that leverages all the very best parts of programmatic, takes all the learnings of commodities markets and utilizes that the very best thing about programmatic. So we've developed that.\n\nIt's early days, but we have a good commitment from both buyers and sellers to make it possible to create a much better and stronger market. The only way that that works is if you have good forecasting. And the only way that that works is if you have a common currency like UID2. So to the second part of your question, does UID2 play a significant role in that? Absolutely because in order for us to give a common understanding to buyers, sellers, it's one thing to buy in the spot market where you're buying an ad for less than $0.01 in almost every case.\n\nIt's another thing to commit hundreds of millions of dollars in advance to buying ads. You need a greater degree of assurance. You need greater transparency. You need visibility that can only come from forecast where you have a common understanding.\n\nCommon currencies become very important in order to have any market other than a spot market unless you're operating at discounts and constantly working on make-goods, which is exactly what the upfront and scatter markets do in traditional television.\n\nChris Toth -- Vice President, Investor Relations\n\nThanks, Tim.\n\nOperator\n\nOK. Up next, we have Shweta Khajuria with Evercore ISI. Your line is live.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you very much. Let me try two, please. So Jeff, for the business, there have always been several growth factors or growth vectors from international to shopper marketing to CTV to Solimar to UID2.\n\nNow, with Solimar fully integrated and CTV clearly driving growth, how about the other three, the UID2, international and shopper marketing? Does the extension of cookie deprecation change your focus or investment toward UID2? And then how are you thinking about international and shopper marketing in general over the next six to, call it, 18 months? And then a question for Blake. Is it possible to get the magnitude of contribution from retail or Walmart and other partnerships, as well as political spend for the third quarter that's baked in your guide? Thank you very much.\n\nJeff Green -- Founder and Chief Executive Officer\n\nYeah. So I'm glad you've asked about just these other growth drivers and, of course, how does UID affect it and especially just how does the deprecation of cookies affect UID and international expansion and shopper marketing. So I'm not certain that we made this as clear as we could have in the prepared remarks. Cookies and ads that are bought inside a browser -- because cookies are only relevant inside of a browser, at least directly relevant inside bras, represents a small percentage of our business.\n\nDisplay is a small percentage of our business as a percentage. It's shrinking even though we've seen growth because growth in other areas are growing faster, it still continues to shrink. So it's a small slice of the pie. What are much bigger are things like mobile, which don't rely on cookies, or CTV, which don't rely on cookies.\n\nThey have other ways of creating identity. Of course, in CTV, nearly everything you do is on the other side of the login, meaning you log into Netflix or you log into Amazon or you log into Peacock or Paramount or Hulu before you view content. And that makes it very prone to be interoperable with something like UID2. So there's no cookie problem to solve in TV, but everybody in TV needs more subscribers, and I believe everybody in TV needs to offer an AVOD solution for those subscribers that would rather pay with their time than with money, and especially when you have to keep providing or making rate hikes in order to pay for incremental content.\n\nSo the cookie changes don't slow down UID at all. And in fact, I've always said that the biggest threat to the walled gardens is the competitive nature of connected television. That's especially true in identity. And the competitive nature of television is really what I think will fuel UID forward faster than anything that happens with cookies, delay or not.\n\nBut the same thing is true internationally. I mean especially if you look at the places where GDP growth is predicted to be the highest in the world, those are places that are often mobile first. So they're less reliant on cookies as well, especially in Asia. So the business models that have a holistic approach to identity and can customize ads to think holistically are the ones that are going to do the best, especially for the biggest companies in the world, which is why I think we're really in a strong position for international growth.\n\nAnd sadly, as it relates to international, I think it's fair to say there's more likely to be economic headwinds outside the United States than inside the United States given that. We look at this as land grab time. So there is a big opportunity for us to expand our market share even if there are economic headwinds internationally that we just want to continue to invest in, especially because outside of big competitors, like the Googles of the world where their DSP is not their primary focus. For those smaller competitors where being a DSP is their primary focus, they're often much smaller and can't afford to make those investments.\n\nSo there's a big opportunity for us to expand around the world. And then, in shopper marketing, there is this incredible desire, especially inside of CPGs. And CPGs, for a whole bunch of reasons, including inflation, are under pressure to do more with less. And what can really help them is to see end to end.\n\nIf I show an ad to this person, how does it affect whether they buy it at a store. To see end-to-end, the impact of their spend is extremely valuable to them. And retailers know that that is a way for them to spin their flywheels faster. Initially, they looked at it as a way to make more money on selling data, but now they look at it as a way to spin their flywheels faster.\n\nAnd so, I think it's one of the surest ways that we will spin our own flywheel, is to continue to enable an open Internet where there's lots of competition and where marketers that sell goods inside of stores, brick-and-mortar stores continue to get the data-driven benefits that historically have been reserved for online retailers like Amazon. So where everybody is looking at competing with Amazon, they know they have to be focused on becoming a data-driven or more than they are, and we're just seeing amazing strides in retail that contributes to our shopper marketing strategy. So we've just seen our TAM expand in the short term just because of this focus of moving to fixing this sort of end-to-end challenge. And I do think it is true that the discussion about the demise of cookies has made that faster even though it's a totally different aspect of measurement, but it has improved and accelerated the move.\n\nBlake Grayson -- Chief Financial Officer\n\nAnd then to follow up to your other questions. I think on the shopper marketing component, we don't break out that level of detail in our shopper marketing business. The only thing I would just say is that we are seeing the spend ramp. It ramped into Q2 as more large brands are testing and adopting it, and we expect that to continue.\n\nI think just the selection opportunity that our customers are now having is going to be a flywheel spin for them that I debate in my head whether they're going to be able to get it in many other places, if any. And so, I think that's just such a long-term opportunity for us, like Jeff said, I'm just -- I'm super excited about it. And then, with regards to your question on political, in the midterms, the spend will occur much closer to election day than we might find in a presidential year. Like we expect to see that start ramping here over the late summer, I would say, through November.\n\nThere's so many races out there that are going to be competitive. And we'll just have to see how competitive, whether it's the house the Senate, governor campaigns or whatnot. I think that our overall expectation is that the -- in Q3, we expect it to be a low single-digit percentage spend in Q3, and that was in our prepared remarks as well. But overall, just with regards to political, what I would say is our goal is to -- it's to run a better process.\n\nIt's to earn trust with our customers. We've been building this business over quite a few years. We've got really high retention rates with our customers. We do believe we're the go-to platform for digital advertising now versus maybe other social media platforms.\n\nAnd so, we do expect some tailwinds. That's why we called it out in the guidance, but we'll have to see how this all unfolds into the back half of the year.\n\nChris Toth -- Vice President, Investor Relations\n\nThanks, Shweta. And then, John, we can squeeze in one more.\n\nOperator\n\nOK. The next question is coming from Brian Fitzgerald with Wells Fargo. Brian, your line is live.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nThanks for squeezing us in. Just as a quick follow-up to the forward market concept. We want to ask about revendability or resaleability of inventory, if you will. If an advertiser takes delivery, for example, finds out that an impression or a consumer is already a customer.\n\nJeff, are you envisioning that advertisers would have the ability to resell inventory? And any thoughts on the dynamics there in terms of market liquidity and participation and really potential financialization of the market? Thanks.\n\nJeff Green -- Founder and Chief Executive Officer\n\nYou bet. So I think initially what you're going to want to see is control from both publishers or content owners and advertisers in terms of who shows up, who has access to it. But I do think that in the long term, and we're talking years from now, that one way that you can get buyers to sign up is if they buy too much, they can sell it to somebody else. And so, I do think it's possible to see a derivatives market exist sort of on top of that forward market so that you can essentially transact in the rights to buy those so that you can secure inventory.\n\nBut making them fungible that makes it -- or resellable or both rather is I think a really important part of the market in the long term. So I do think that that component will exist in the long term. But the most important thing in the short term is to take advantage of the fact that you can bring data to bear that publishers want guarantees and all the benefits of programmatic. Advertisers would like to reserve inventory and have all the benefits of programmatic, which includes the ability for them to bring their data into the equation.\n\nIn traditional television, as well as in the scatter market, advertisers can't really bring their own data to the table. So the forward market would enable them to do that, which would help prices go up and is really going to benefit both the buyer and the seller. I think there's going to be a lot of rules that exist for years to prevent the resale of that. But I do think long term, the economic concerns are there for that to exist.\n\nIt creates an amazing market. And I don't think that there's any company that's better positioned to benefit from this market than The Trade Desk because of the role that we play by looking at everything, by looking at nearly all inventory because we don't own it, we make it possible to partner with all of it. And I think we can easily become once again, the world leader in providing demand not just in the spot market, which we already are today, but also in the forward market, which is why we're working so hard to create it and leverage the relationships that we've been tending to for more than a decade now.\n\nChris Toth -- Vice President, Investor Relations\n\nThanks Brian.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Toth -- Vice President, Investor Relations\n\nJeff Green -- Founder and Chief Executive Officer\n\nBlake Grayson -- Chief Financial Officer\n\nShyam Patil -- Susquehanna International Group -- Analyst\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nJames Heaney -- Jefferies -- Analyst\n\nYoussef Squali -- Truist Securities -- Analyst\n\nTim Nollen -- Macquarie Group -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nMore TTD analysis\n\nAll earnings call transcripts"
}