{
  "companyName": "Elastic",
  "companyTicker": "ESTC",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/elastic-estc-q2-2023-earnings-call-transcript/",
  "content": "Elastic (ESTC -0.23%)\nQ2 2023 Earnings Call\nNov 30, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the Elastic's second quarter fiscal 2023 earnings results conference call. [Operator instructions] After today's presentation, there will be an opportunity to ask questions. Please note that this event is being recorded. I would now like to turn the conference over to Mr.\n\nNikolay Beliov, vice president of investor relations. Please go ahead, sir.\n\nNikolay Beliov -- Vice President, Investor Relations\n\nThank you. Good afternoon, and thank you for joining us on today's conference call to discuss Elastic's second quarter fiscal 2023 financial results. On the call, we have Ash Kulkarni, chief executive officer; and Janesh Moorjani, chief financial officer and chief operating officer. Following the prepared remarks, we will take questions.\n\nOur press release was issued today after the close of market and is posted on our website. Slides which accompany this webcast can be viewed in conjunction with live remarks and can also be downloaded at the conclusion of the webcast on the Elastic investor relations website, ir.elastic.co. Our discussion will include forward-looking statements, which may include predictions, estimates, our expectations regarding the demand for our products and solutions, and our future avenue and other information. These forward-looking statements are based on factors currently known to us, speak only as of the date of this call, and are subject to risks and uncertainties that could cause actual results to differ materially.\n\nWe disclaim any obligation to update or revise these forward-looking statements unless required by law. Please refer to the risks and uncertainties included the press release that we issued earlier today, included in the slides accompanying in this webcast, and those more fully described in our filings with the Securities and Exchange Commission. We will also discuss certain non-GAAP financial measures. Disclosures regarding non-GAAP measures, including reconciliations with the most comparable GAAP measures, can be found in the press release and slides.\n\nThe webcast replay of this call will be available for the next 60 days on our company website under the investor relations link. Our third quarter fiscal 2023 quiet period begins at the close of business on Friday, January 13, 2023. On December 8, 2022, we will be participating in the Barclays Global Technology, Media, and Telecommunications Conference. With that, I'll turn it over to Ash.\n\nAsh Kulkarni -- Chief Executive Officer\n\nThank you, Nikolay, and thank you all for joining us. In Q2, revenue grew 34% year over year in constant currency. Elastic Cloud comprised 39% of total revenue, up from 34% in the year-ago quarter, and grew 52% year over year in constant currency. We ended the quarter with approximately 19,700 subscription customers, including over 1,050 with annual contract values of more than $100,000.\n\nI have continued confidence in our long-term market opportunity and the core fundamental strengths of our business. During the quarter, we continue to make progress across our three key focus areas: driving durable growth, widening our competitive moat, and continuing our focus on profitable growth. We also saw our customers continue to show preference for consolidation onto our platform for multiple use cases. While our differentiated platform positions us well, we have also started to experience the shift in the macroeconomic climate ourselves.\n\nIn the month of October, we began to see belt-tightening and consumption slowing down in the SMB segment. We also saw increased scrutiny on deals overall, particularly in countries where the strengthening U.S. dollar has created adverse conditions. In order to help our customers through this clearly difficult environment, it is more important for us than ever before to stay close to them and help them realize the value of consolidating onto a single platform for multiple business-critical use cases.\n\nThat also requires us to be more focused on our coverage, our sales place, our product investments, and our internal support as we drive greater operational excellence. Looking ahead, we intend to be even more focused on those areas of our business where we see the opportunity for continued profitable growth, optimize investment in other areas and drive overall profitability in the business even faster. In challenging times, those who adapt the fastest are those who end up ahead. Towards this end, we have made the very difficult decision to reduce our workforce by 13% to align our investments with our strategic priorities and position us for long-term success.\n\nWe made this announcement earlier today within the company. This was not an easy decision, and we are taking the right steps to help impacted employees and their families. We owe our success to all of them and are profoundly grateful for their hard work and contributions to Elastic. With this decision, we are rebalancing investments across all functions in the company and will reinvest some of the savings selectively in areas that best position us to drive profitable growth.\n\nAs an example, in sales and marketing, we are going to double down on our automated low-touch approach to better address the needs of our SMB customers who generally prefer a self-service motion. This will also allow us to reposition a portion of these investments to thoughtfully increase our coverage in the enterprise segment. In products, we will emphasize strategic areas like cloud and serverless in our future technical hiring. These actions set us on a path to deliver improved non-GAAP operating income growth in the second half of FY '23 and 10% non-GAAP operating margin for FY '24, a significant increase compared to our prior commitment.\n\nJanesh will share more details later. Now, let me talk about the long-term durability of our growth. Over the last 90 days, I've met with more than 100 customers, including Canva, SAP Concur, USAA, Ecolab, Westpac, Standard Chartered Bank, and O2-Telefonica. We are also meeting with customers at our ElasticON events, which are driving greater awareness, fueling pipeline, and reinforcing our bottom-up adoption and product-led growth.\n\nDemand for our in-person events has been strong, with standing-room-only crowds attending our ElasticON events in Singapore, New York, and Amsterdam to hear from Elastic and some of our amazing customers, including Affirm, AutoZone, BMW, Booking.com, Comcast, and SWIFT. We are seeing from our customer interactions that they are continuing to invest in observability, security, and search and our platform strategy is working. Especially in the areas of observability and security, we offer an open high-performance platform that allows customers to analyze all their data across logs, application traces, metrics, and other related data with a simple consumption-based pricing model. All at a price that creates a compelling value proposition to switch from other technologies and consolidate onto our platform.\n\nAnd with Elastic Cloud, expanding with Elastic to newer use cases is incredibly easy. In these times, we see a greater opportunity than ever before to lean into our platform and cost advantage and drive consolidation plays onto our platform. This quarter, we expanded business with RRD, a leading global provider of marketing, packaging, print, and supply chain solutions. A longtime Elastic Enterprise Search customer, they recently expanded two Elastic Observability on Elastic Cloud to consolidate multiple applications into a single cloud instance and streamline their infrastructure.\n\nWe also expanded business with a seven-figure deal this quarter with the top U.S.-based global heavy equipment manufacturer. Previously, an open search customer, the company consolidated its logging platform with Elastic Observability on Elastic Cloud to improve service availability and customer satisfaction. What excites me the most is that we partnered with AWS on this deal through the AWS Marketplace, which demonstrates a strengthening partnership. Speaking of cloud partnerships, we continue to build momentum with AWS, Microsoft Azure, and Google Cloud.\n\nOur revenue through the cloud hyperscaler marketplaces again more than doubled year over year. With AWS, we announced a new streamlined experience for Elastic Cloud on the AWS Marketplace. This enables joint customers to get started on Elastic Cloud with an easier signup and setup experience through the AWS Marketplace console. Also, Elastic was a key partner for Microsoft Azure's launch of the latest Azure Virtual Machines, the Ampere Altra Arm-based processors, letting customers maximize operational efficiency across their observability, security, and search use cases.\n\nFinally, we announced an expanded partnership with Google Cloud to make it easier for customers to monitor and secure Google Cloud workloads and drive insights from data that resides in data lakes on Google Cloud. Now, on to our continuing product innovations and our widening competitive moat. In the current environment, we see a real opportunity to help our customers drive consolidation onto our platform and reduce their overall costs. At our ElasticON events, we recently announced a series of innovations to our platform.\n\nThese include more optimized support for metrics data in Elasticsearch, which will enable us to further extend our competitive advantage in metrics and enable customers to more easily consolidate onto Elastic for all their observability needs. This is available in technical preview today. We also announced a new query language, ESQL, which will enable us to support richer query semantics and additional use cases across all of our solutions. It will also enable us to make it easier for customers to migrate to our platform from competing offerings.\n\nWe anticipate ESQL becoming available on our platform later next year. Lastly, we unveiled a road map for a new Serverless Cloud product, which will broaden our addressable market. This new offering will provide a fully managed experience for supporting short-duration or bursty workloads and will be a great complement to our current Elastic Cloud service, which is optimized for control, flexibility, and performance for long-running workloads. Now, I will share some details about additional innovations and customer wins across our security, observability, and enterprise search solutions.\n\nStarting with security, this quarter, we renewed and expanded cloud business with Uber. They have been using Elastic for threat hunting, investigation, and response and recently expanded their use of Elastic SIEM to power their entire enterprise defense platform. Elastic Security is integral to their ongoing security journey. It provides critical capabilities that enable their team to correlate behaviors across data sources, build interfaces for examining security logs, and craft detection logic to surface malicious behaviors.\n\nWe also expanded business with the U.S. federal agency that previously deployed the free and open version of Elastic. They are now using Elastic SIEM on Elastic Cloud for visibility across their security environment, focusing on insider threat analytics. More than 20% of our security customers now use our newer use cases in XDR and cloud security, validating our unified security approach for the modern security operation center.\n\nWe already have over 30 customers using CIS Benchmarks-based cloud security posture management for Kubernetes, our newest use case, which just recently became generally available. Over the last two quarters, we have released several new capabilities in our next-gen SIEM, including threat intelligence management, hybrid SOAR, and host and user entity analytics. In addition to this, we also recently released the first Elastic Global Threat Report, which details the evolving nature of cybersecurity threats. Compiled using customer telemetry data, the report showcased the first-party research conducted by our security research teams and provided unique insights to our customers.\n\nLast month, Elastic Security was named a visionary in the 2022 Gartner Magic Quadrant for SIEM, and I'm excited to share that Elastic was honored with the Cybersecurity Breakthrough Award for Threat Intelligence Platform of the Year in recognition of the cutting-edge threat intelligence capabilities of Elastic Security. Now, moving on to Elastic Observability. This quarter, we expanded an eight-figure multiyear piece of business with a Global 2000 multinational financial services company which uses Elastic Observability and Elastic Security. The company relies on Elastic Observability for distributed tracing to enable the migration of thousands of applications from the company's data centers to Microsoft Azure and Google Cloud and uses Elastic Security to significantly reduce the time spent on threat hunting.\n\nWe also expanded business this quarter with one of the world's leading media and entertainment companies, which has been using Elastic Observability to monitor IT operations at one U.S. theme park location and have now expanded to include two additional park locations in the U.S. and APJ. With Elastic, they can ensure the consistent uptime of critical park functions such as Wi-Fi, point-of-sale systems, and virtual lines to provide the best visitor experience possible.\n\nAPM traction in the Elastic Observability solution continues to gain strength. Thirty percent of our observability clusters are using APM in addition to log analytics, and we continue to see competitive wins as customers seek to consolidate tools. In Q2, we added additional capabilities to our beta synthetics monitoring capability, and I've seen almost 4x growth in synthetics test runs. In general, the OpenTelemetry protocol and open standards are an Elastic strength.\n\nAnd in Q2, we saw 44% growth in Elastic clusters ingesting APM data using the OpenTelemetry protocol. We also recently launched the private beta of Universal Profiling, an innovative performance optimization and cost-saving capability. Universal Profiling is lightweight and requires zero instrumentation, overcoming the limitations of other profiling solutions by requiring no changes to the application code. In enterprise search, we renewed a seven-figure multiyear deal this quarter with a multinational aerospace company that use Elastic Enterprise Search to provide customers with real-time digital access to the documentation needed to ensure proper aircraft maintenance within their fleet and reduce time on the ground due to maintenance delays.\n\nWe also renewed business this quarter with a U.S. government agency. They are using Elastic Enterprise Search to help their vaccine approval center rapidly access and evaluate mission-critical data to expedite the submission and approval of new vaccines and monitor adverse event reporting for existing vaccines in partnership with the CDC. On the innovation front, we recently announced the general availability of vector search, as well as updates to improve search elements through hybrid scoring that combines traditional search with vector search to deliver more accurate and relevant search results.\n\nWe have seen an 84% increase in deployments actively running a machine learning model in the last quarter, indicating wider adoption of our natural language processing capabilities. Our product strategy in this area is centered around making complex search functionality accessible and scalable across use cases and segments. Now, moving on to our focus on profitable growth. I am proud of the team and the fact that we exceeded both our revenue and our profitability targets for Q2.\n\nOur Q2 operating margin of 1.9% was significantly better than our guidance and clearly demonstrates the operating leverage inherent in our business. I've already talked about the steps we have taken to accelerate our profitability growth. Although these decisions are difficult ones to make, we are confident that the changes we have announced will drive even more focus on those areas of our business that have the highest opportunity for growth and operating margin expansion. This will enable us to navigate through this macroeconomic environment with greater discipline and ensure our success in both the near and long term.\n\nIn summary, I want to thank our employees for their dedication and contribution to our performance. I also want to thank our customers, partners, and investors for their continued support and confidence. We continue to have confidence in our ability to build a generational company given, one, our market opportunity; two, the criticality of our solutions to our customers; third, our platform strategy, which is more relevant than ever before given customers' increased desire for tool consolidation in the current environment; fourth, the execution by our team; and finally, our strong fundamentals. Now, over to Janesh.\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nThanks, Ash. We are pleased that we delivered ahead of our commitments for Q2. We delivered 34% year-over-year constant currency growth in total revenue. We continued the momentum in Elastic Cloud, which grew 52% year over year in constant currency.\n\nWe once again beat the high end of both our top-line and bottom-line guidance for the quarter despite the current economic environment and despite greater FX headwinds on revenue than we had included in our previous guidance. On a currency-neutral basis, our total revenue beat in terms of year-over-year growth in Q2 was similar to Q1. In the current business climate and with the trends in our business that Ash described, we see room to focus more sharply on helping our customers derive the benefits of dual consolidation onto a single platform and also to realign resources internally to drive greater efficiencies in all functions. Accordingly, we are taking specific actions in the business.\n\nFirst, we are better focusing our investments to optimize our coverage in the SMB segment, emphasizing automation and low-touch approaches to better address the needs of customers in that segment while repurposing some of that investment toward enterprise sales coverage. Second, we are rebalancing investments across other functions to invest in priorities such as our serverless architecture and engineering and in digital demand and in marketing. We will also drive greater efficiencies and align to business priorities in our customer success and G&A functions. Third, we are adopting a specific goal of non-GAAP operating margin at 10% for fiscal '24, and the actions announced today already put us on the path to achieving that.\n\nWe believe these actions will not only help profitability in the near term but importantly allow us to align our team to best capture the market opportunity ahead of us. While we navigate the near term, we remain confident in our strategy for the mid and long term. We have a large market opportunity and our solutions are used in core mission-critical use cases. Customers are increasingly looking for dual consolidation in the current environment, which plays well to our platform strategy.\n\nWe give customers enormous flexibility with a consumption-based business model and resource-based pricing model. And our core land-and-expand motion continues. We had healthy additions to the pool of customers over $10,000 in ACV, adding approximately 80 customers in this category; and also the pool of customers over $100,000 in ACV, adding approximately 40 customers in this category. Both consistent with the prior quarter.\n\nAnd we continue to have a world-class net expansion rate. Now, let's get into Q2 results and our updated outlook. Total revenue in the second quarter was $264.4 million, up 28% year over year or 34% in constant currency. Subscription revenue in the second quarter totaled $241.2 million, up 27% year over year, or 32% in constant currency, comprising 91% of total revenue.\n\nWithin subscriptions, revenue from Elastic Cloud was healthy at $103.2 million, growing 50% year over year or 52% in constant currency. Elastic Cloud represented 39% of total revenue in the quarter, up from 34% a year ago, and also represented 43% of total subscription revenue, from 42% in the prior quarter and up from 36% in the year-ago quarter. Professional services revenue in the second quarter was $23.2 million, growing 47% year over year or 53% in constant currency. We do not expect professional services to increase significantly in mix.\n\nTo add more context around deal flow and performance by region, although we saw balanced deal flow across geographies on a currency-adjusted basis, the Americas grew faster than APAC and EMEA given currency impacts in those regions. Looking at customer metrics, we ended the second quarter with approximately 19,700 total subscription customers, with the vast majority of the additions in the quarter once again in the Elastic Cloud. The lower sequential number of customer additions reflects the slowdown in the SMB segment that we described earlier. We are confident that our strategy of focusing on acquiring and nurturing customers that have a higher propensity for growth rather than solely focusing on quantity continues to be the right strategy for us.\n\nWe've once again provided data on customers over $10,000 ACV, and you'll see the additions in Q2 in that category were similar to prior quarters. We also saw the success of this strategy reflected in the count of larger customers. We had over 1,050 customers with annual contract values over $100,000 at the end of the second quarter, compared to over 1,010 such customers at the end of the prior quarter, reflecting the strength of our product portfolio and our ability to drive expansion across the solutions. The customer count in this category remains a strong underpinning of our land-and-expand motion.\n\nOur overall net expansion rate in the first quarter was approximately 125% and was down slightly, reflecting the trends I mentioned earlier. Now, turning to profitability, for which I'll discuss non-GAAP measures. Gross margin in the quarter was 74.5%, with the sequential change versus the prior quarter driven mainly by better professional services gross margins. Subscription gross margin at 79.2% was consistent with the prior quarter.\n\nLooking at operating expenses in the second quarter, we continue to manage our expenses and investments in the business well. Our operating margin in the quarter was 1.9%, which was significantly better than expected due to both the revenue performance in the quarter and tight expense discipline. This once again demonstrates the operating leverage inherent in our business model. Earnings per share in the second quarter was $0.00.\n\nFree cash flow on an adjusted basis was $10.3 million in the second quarter. For full fiscal '23, we now expect to be roughly breakeven on adjusted free cash flow. This outlook includes cash outflows of between $25 million and $28 million related to the restructuring we announced, which reflect one-time payments and were not included in our prior outlook. We also continue to maintain a strong balance sheet.\n\nWe ended the second quarter with cash and cash equivalents of approximately $856 million. We remain comfortable with our cash position from an operating perspective. Before discussing our outlook for the third quarter and the remainder of fiscal '23, I'd like to provide additional color on how we will be approaching the next few quarters. As we announced, we will be reducing our workforce by 13% and rebalancing our investments across functions, reinvesting a portion of that into areas best suited to drive growth.\n\nWe will continue to hire for the right roles in the second half of fiscal '23 to ensure we are set up successfully for fiscal '24 and beyond. While the decision to reduce and rebalance investments was not easy to make, we believe it positions us better for the future to deliver multiyear, durable, and profitable growth. It also allows us to deliver faster margin expansion than we had previously committed, and we currently expect to deliver 10% non-GAAP operating margin and a commensurate increase in adjusted free cash flow margin in fiscal '24. We also remain confident in our ability to deliver healthy revenue growth given our market opportunity, the strength of our products, new customer trends, and our expansion track record.\n\nWe also continue to expect Elastic Cloud will exceed 50% of total revenue in the fourth quarter of fiscal 2024. Turning to guidance. With the continued strength of the U.S. dollar against the year-ago rates, we expect currency movements to present a headwind to year-over-year total revenue growth of approximately 4% for the third quarter and approximately 4% for full fiscal '23.\n\nWith respect to operating margin, since we also incur a significant portion of our expenses in currencies other than the U.S. dollar, we effectively have a natural hedge, so the impact to operating margin from a strengthening dollar is less significant. Our overall guidance philosophy stays unchanged. We continue to guide thoughtfully based on what we know and without excessive conservatism.\n\nWe have now considered the impact of the current business climate in our second half revenue outlook. Despite this impact, we are raising our operating margin outlook for the year, reflecting our emphasis on profitable growth. With that background, for the third quarter of fiscal '23, we expect total revenue in the range of $272 million to $274 million, representing 22% year-over-year growth at the midpoint. On a constant currency basis, we expect total revenue growth of 26% year over year at the midpoint.\n\nWe expect non-GAAP operating margin in the range of 4.3% to 4.7% and non-GAAP earnings per share in the range of $0.04 to $0.07 using between 98.5 million and 99.5 million diluted ordinary shares outstanding. For full fiscal '23, we now expect total revenue in the range of $1.067 billion to $1.073 billion, representing 24% year-over-year growth at the midpoint. On a constant currency basis, we expect total revenue growth of 28% year over year at the midpoint. We expect non-GAAP operating margin for full fiscal '23 in the range of 2.2% to 2.6% and non-GAAP earnings per share in the range of negative $0.03 to positive $0.03 using between 95 million and 97 million basic weighted average ordinary shares outstanding and between 98.5 million and 100.5 million diluted weighted average ordinary shares outstanding.\n\nIn summary, we remain focused on execution and believe that we are well-positioned for long-term durable growth and profitability. And with that, let's go ahead and take questions. Operator.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] And the first question will come from Tyler Radke with Citi. Please go ahead.\n\nTyler Radke -- Citi -- Analyst\n\nHi. Thanks for taking the question. So, you know, I think given that you just had an Analyst Day and put out some long-term targets, you know, I think investors are keen to kind of hear the magnitude of what's changed in the last couple of months. So, maybe if you could just talk about where you're seeing the slowdown by use case, you know, whether it's, you know, search versus security, observability.\n\nAnd then if you could kind of comment on the trends throughout the quarter and into November? Have things worsened in November? And then I just wanted to clarify if you're backing away from the targets or if you're reaffirming those. Thank you.\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. Thanks for the question, Tyler. This is Ash here. Maybe I can kick things off and then invite Janesh to also add more to it.\n\nSo, you know, the -- just in terms of what we saw as we talked in September during the Financial Analyst Day, we had been watching the macroenvironment very carefully, especially given that we had seen the FX headwinds. And through all of Q2, what we saw was, in October, things started to change and act differently than what we had seen prior to that. Specifically in SMB, we saw a lot of belt-tightening, and we are seeing this in a couple of places very obviously. First is in monthly cloud.\n\nMonthly cloud tends to be -- a lot of it tends to be SMB. We saw consumption constriction there. We also saw fewer SMB customers signing on to the platform. So, that was one.\n\nThe second thing that we saw in October, which is sort of the last month of our quarter, as you know, in certain international geographies where we had seen the dollar tightening, having the dollar increase, you know, having a significant impact on just the way customers are thinking about things, we saw customers going through more approval processes, and these were deals where we continue to compete very well. Some of these deals slipped out from Q2 into Q3. Some of them have been closed since then. But we see that pattern of more approvals, and we expect that to continue going forward.\n\nSo, the assumptions that we are making effectively are that SMB, what we saw in October is going to continue for some time. The pattern of deal inspection is going to continue for some time. But having said that, our competitive position remains very strong. We continue to do well in competitive environments.\n\nIn terms of our win rates, they stayed healthy as they have been. And, you know, we had promised when we talked to you during the Financial Analyst Day that we are going to be watchful and we are going to be thoughtful in terms of how we act based on the data that we see. And hopefully, you know, you'll see that that's exactly what we are doing here. We saw some impact and we saw behavioral changes in SMB, and we are taking actions to make sure that we change the way we operate based on some of those data points.\n\nYour other question was in terms of use cases. We really didn't see any difference in terms of the behaviors around use cases. It was more around segments. So, the biggest impact was in the SMB segment where we saw belt-tightening.\n\nAnd lastly, around the $2 billion target. Look, what I'll say is our goal hasn't changed. The fundamental strength of our business remains strong. And we've always talked about the fact that we are building a generational company.\n\nWe're building a multibillion-dollar company. Two billion was always a milestone in that journey. Clearly, given the business environment that we are dealing with, we expect that that's going to be difficult and it's going to be harder. And, you know, we acknowledge that.\n\nSo, we are not reaffirming, but we are also not changing any of that guidance. We are going to continue pushing forward. Like we said, fundamentally, we are not compromising on growth. We are just being far more focused based on the reality of the macroenvironment that we are seeing, and we want to make sure that we are putting our investments where we believe we can get the best return.\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nHey, Tyler, I'll just add on because you had a question about how November has played out as well. I think Ash covered all the other points quite nicely, actually. November has been steady so far. We have continued to see business play out as we expected.\n\nWe've not seen any meaningful change in terms of customer tone in the month of November. So, I think that we've reflected that obviously in the outlook here for the back half. So, we feel pretty good about the number that we've called for the back half, and we've tried to incorporate all of these trends specifically into the guidance and suitably de-risk the guidance for the back half to accommodate for these. So, we feel good about the outlook for the back half and based on what we've seen in November so far.\n\nTyler Radke -- Citi -- Analyst\n\nHelpful. Thanks for all the detail. And just on the decision to do a force reduction here. I mean, obviously, we've seen the market kind of continue to prioritize profitability over growth, but I guess why now? And, you know, I guess if you go into a little bit more detail, the specific areas that you're looking to make these changes and, you know, the confidence that this won't necessarily be disruptive, you know, in terms of your growth aspirations.\n\nThank you.\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. Thanks, Tyler. As you can imagine, these are very difficult decisions. And, you know, I'll reiterate that we really could not be more thankful to our employees.\n\nEverything that they do, their efforts, the -- just everything that they put into Elastic, in our success. Now, having said that, you know, like we had told you even during the Analyst Day, you know, we have been very carefully observing the data in the market. Why now? Because, you know, we've always made decisions based on data. And like we told you in September, we had not seen the impact of the macroeconomic environment affect our business other than the FX piece, which we had talked to you about then.\n\nBut we wanted to be very watchful, and that's what we were doing. And once we started to see the impact, we were very careful about making sure that we understand the nature of that impact. And like I mentioned, you know, the biggest area where we experienced this is in SMB. And in SMB, it was across the board.\n\nIt was in all regions. It was across all use cases. And, you know, we've traditionally had a sales-assisted motion for SMB. And what that means is, you know, we would have customers land on monthly cloud, and then we would have an SMB sales team that would spend energy in trying to convert those customers into annual contracts.\n\nAnd given the environment, what we have been seeing is really that, you know, that effort that's being spent on the SMB area is really not giving us commensurate returns. And we are not expecting the SMB environment to change either in the near future. We expect that that's going to be an area where there will be continued stress in the economy. On the other hand, we continue to see on the enterprise side long-term opportunity for us to continue to do well.\n\nAnd so, as we've taken these actions on the go-to-market side, the majority of it has been centered around SMB. Obviously, when you look at the go-to-market side, it's more than just the sellers. It's supporting teams like the SDR teams or the sales development reps. Even on the marketing side, one of the big areas of change for us has been to drive more toward digital demand generation, which really works much better in a bottom-up adoption motion.\n\nAnd so, that's been the kind of change that has happened in marketing. On engineering, the overall change has been very limited. And primarily there, the change has been to make sure that we create the focus and rebalance investment toward the areas that I've talked about as being a very high priority for us and strategically important for us going forward. And that's all around cloud and serverless.\n\nAnd the three solution areas continue to remain strong. So, it's been a -- the changes have been across the board, but they have been very targeted. They've been focused on addressing the areas where we believe that we can drive the greatest growth and profitability and also making sure that we are not investing or finding more efficient ways to address parts of our business that are not showing the returns that we would have hoped for. And specifically, you know, I'd call out SMB.\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nAnd, Tyler, maybe the one thing I'll just tack on to that is, you know, as Ash said, we are doing this so that we can invest in the right places to drive growth. And a part of that is to ensure that we continue to invest appropriately in the second half so that we have the right outcomes in the second half, but also prepare ourselves for fiscal '24. We want to make sure we are entering fiscal '24 with the right capacity in the right places ready to go.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThe next question will come from Pinjalim Bora with J.P. Morgan. Please go ahead.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nHey, thanks for taking the question. Janesh, I just wanted to understand the guidance a little bit more. Seems like it's going or coming down by about one point of growth, constant currency, about 200 basis point. I think you use the word de-risk for the second half.\n\nWhat makes you confident that the model is de-risked at this point?\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nHey, Pinjalim. Yeah, happy to talk about that. So, in terms of the approach that we took on the guidance, you know, to start with, obviously pleased that we came in above expectations that we had set for Q2, both on the top and the bottom line. In terms of how we thought about the guidance, a couple of things.\n\nOne is we first factored in the current economic climate. We have assumed that the recent trends from October will continue for the foreseeable future. We've, as Ash mentioned, considered the trends in the segments, both SMB, as well as enterprise. We've considered what we see across the geographies.\n\nWe've considered the consumption trends that we've seen in the business. We've looked at it from the standpoint of new and expansion motions as well. And then we've, of course, factored in the impact of all of the changes that we announced today also. So, we've suitably factored all of these into our outlook.\n\nAnd then, you know, in case things happen to get worse out there, we've also built in some additional level of protection into our guidance, as we always do, to balance the risks of the unknown. So, there's no core change to our guidance philosophy there. We don't guide excessively conservatively, but we do guide prudently. So, we actually feel pretty good about the outlook.\n\nAnd then as I said, November has played out nicely so far. So, we feel pretty good about Q3 and the rest of the year.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nUnderstood. Thank you for that. And, Janesh, another one for you. The [Inaudible] the net retention rate trending down.\n\nI want to ask about the retention -- the gross retention side. Has that get -- is that getting impacted because of the SMB? Is that fair to assume? And how the -- or is it mainly on the expansion side?\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nYeah, it's a great question, Pinjalim. So, you know, a couple of thoughts that I'll put out there in terms of the net expansion rate. So, in terms of the gross renewals, we actually didn't see any significant change in the gross renewal rate for our subscriptions. We don't break out the numbers specifically because individual projects obviously introduce some level of noise into the measurement.\n\nBut as we looked at the renewal rates internally, they were very consistent with what we've seen before. And when I think about how that played out in terms of the expansion dynamics, we did see expansion slow a little bit. And I think that's partly the effect of the -- some of the trends that we talked about that we saw in the month of October. Within the net expansion rate, that does include some effect of SMB and monthly cloud consumption, which is annualized for the purposes of that net expansion rate calculation.\n\nSo, the softer SMB performance in October also would have had an adverse impact on that. But the way we think about that is that, you know, even at 125%, it is still a world-class expansion rate. And when you look at the customers over 100K ACV, which is the other way that we think about expansion, we've continued to grow that number in a pretty solid way. And that's a more current data point that indicates the expansion momentum that we are seeing.\n\nSo, when I think about it more broadly, the underlying trends continue to play to our advantage where customers continue to adopt us across multiple solutions. We continue to move further up within the enterprise. We're getting closer to the customers and becoming more strategic to their businesses. So, you know, for all of those reasons, I actually feel quite good about the longer-term opportunity ahead of us.\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nGot it. Thank you. I'll get back in the queue.\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nThank you.\n\nOperator\n\nThe next question will come from Joel Fishbein with Truist Securities. Please go ahead.\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nHi. Thank you for taking my question. Janesh, I would love to just hear what happens in monthly customer cohort. I know you mentioned something about it on the call.\n\nI just want to go a little bit deeper. And what percent of business is that now and where do you think that trends? And then the second follow-up to that is just how is the government business for you guys, fed specifically? Thanks.\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nYeah, happy to take both of those, Joel. So, in terms of monthly cloud performance, monthly cloud was about 16% of total revenue and that was a tick down from where it's been in the past. In prior quarters, it was roughly 17% of total revenue. And I think that just reflects some of the consumption trends that we talked about, particularly on the SMB side, because a lot of those customers are on monthly cloud.\n\nAnd in terms of context, you know, 1% change, they obviously translates to a few million dollars in revenue. So, it is quite meaningful. But monthly cloud continues to be a great way for us to acquire and scale new customers. We've talked already about some of the changes that we're making to double down on those and focus with even greater investments in digital demand, in particular, as one example.\n\nSo, you know, those are some of the trends that we saw from a monthly cloud perspective. And then in terms of the federal business, fed continues to be, you know, a very strong practice for us. We've invested in the fed business for some time now. And that team has been really successful in prosecuting many use cases and ensuring that we're used in mission-critical workloads across multiple agencies.\n\nIn Q2, we were actually quite pleased with our performance in fed. The team did well to close all of the business that we were looking to close, and we're excited about the opportunity in fed looking ahead.\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nThank you so much.\n\nOperator\n\nYour next question will come from Raimo Lenschow with Barclays. Please go ahead.\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nHi. This is Vinod Srinivasaraghavan on for Raimo. Thanks for taking my question. You know, you had mentioned 30% of Elastic customers are using APM now.\n\nJust wondering if you could give us a sense of how that's progressed from, you know, last quarter or last year. And, you know, from a sales perspective, how do you kind of go about incentivizing more customers in this type of environment to try and use and scale up on APM or security or some of your newer product areas?\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. Hey, Vinod, maybe I can touch upon this. So, we don't break out discretely the growth percentage in terms of how APM is being adopted. We gave this data point primarily because, you know, as we've been driving customer adoption not just across solutions but within a solution.\n\nSo, observability going from log analytics to APM metrics and so on. You know, there is a growing need that we are seeing and growing interest in consolidation. And so, this data point was one that we're sort of giving for the first time because it's now pretty clear that our APM solution is one that is gaining a lot of traction, has gained a lot of traction. Matter of factly, one of the customer examples I gave in my prepared remarks, the large eight-figure deal that we signed with the large financial services institution, was really all about APM.\n\nSo, it's being used at scale. It's being used in very significant ways. And the way we tend to drive that expansion motion is in a couple of ways, right? So, one is the pricing model tends to be incredibly relevant in that scenario because our pricing model is completely based on consumption. So, it's not like the customer has to start with going all in on Elastic on any of those newer use cases.\n\nYou know, we typically tend to suggest that they play with it. They try it for instrumenting a few applications at a time, getting familiarity with the capabilities, and then, you know, deciding if it's something that they want to roll out across their entire real estate. And that's how we've been growing in a very viable manner the expansion scenarios. And it's gotten to the point now where a significant percentage, like I mentioned, of our observability customers using APM in some way, shape or form, and we just expect that to continue growing.\n\nThe other thing that we're doing is also making sure that that's the play that our sales teams are driving with all our enterprise and commercial customers. It's that land-and-expand motion that we really focus on. Once the customer lands and they typically don't land on cloud like we've talked about in the past, you know, the real focus for the sales teams ends up becoming all-around expansion. And that expansion is centered around, you know, starting from logs in observability to APM to metrics.\n\nIf the customer starts with security, specifically with SIEM, then going from SIEM to XDR. I also gave some stats about the adoption that we have seen around XDR and some of our security use cases. So, we are starting to see that flywheel work quite nicely, and that's really going to be the focus going forward as well.\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nThanks. Appreciate that. And just one more for me. I think last quarter, you mentioned that you weren't seeing too much impact from macro on -- from on-prem to cloud migrations.\n\nAre you seeing an impact there now or is the slowdown mainly attributed to slower expansion, like you said, from SMB on the cloud? Thanks.\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nHey, maybe I'll take that one. So, on the self-managed side, we were actually quite pleased with the performance there. It grew 20% year over year in constant currency, which compares favorably to the prior quarters. So, we were pleased with what we saw there.\n\nIn terms of the overall business perspective, there's nothing, in particular, I would call out other than customers just continuing to express a preference for cloud. So, we generally view that as a positive for the business and, in fact, as you know, encourage that preference as well. We do think that self-managed will continue to grow and that growth over the long term should just mimic where workloads reside. So, it's not a substitution effect.\n\nWe're not trying to do any kind of forced march. It's just that cloud workloads are growing faster than on-prem workloads. The way we think about it from a longer-term perspective is that our opportunity set is large and our penetration rates are low, so we should have plenty of room to grow in both the cloud and the self-managed formats.\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nThe next question will come from Matt Hedberg with RBC Capital Markets. Please go ahead.\n\nMatt Swanson -- RBC Capital Markets --- Analyst\n\nYeah. Thanks. This is Matt Swanson on for Matt. Kind of a follow-up to the last question around consolidation.\n\nI mean, obviously, this is a positive, but I would assume this is also making deals maybe a little larger but also more complicated. You mentioned the increased scrutiny that we're seeing in this macro. Could you just talk a little bit about how this consolidation theme might be impacting sales cycles? And then, I mean, you went into it a bit, but just kind of what things you're doing to streamline this from a go-to-market perspective.\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. So, the deals that actually, you know, ran into more approvals and so on weren't necessarily tied to consolidation per se. So, we are not necessarily seeing a correlation between consolidation and deals taking longer. You know, the fact that certain deals took longer because there were more approvals needed.\n\nAnd by the way, that is something that our sales teams are now, you know, actively accounting for. You know, we sort of know that that's going to be, like I mentioned, more the norm. So, we're sort of accounting for that. But those were in regions and in countries where the strengthening U.S.\n\ndollar, you know, has given those customers reason to, you know, just be that much more thoughtful. And several of those deals actually came in into Q3 already. So, these were not deals that got affected in terms of us losing them. From a competitive standpoint, we did very well.\n\nIt was just the timing of things. So, that was number one. The second is to the point of consolidation, we agree that consolidation is an opportunity, and that's -- like I mentioned, that's something that we're really leaning into. And the field is actively having those conversations because, at this point, we see that, you know, spend is something that's on everybody's mind.\n\nHow do customers be a little more thoughtful about what they're spending on? And there is a natural desire to ask, how can I do more with Elastic? Where else can I use you in such a way that may incremental, my overall cost of ownership comes down? And those are the conversations that really we're driving our sales players now throughout our organization. And that's -- I expect that that's going to be a greater aspect of what we do going forward. But I am not -- I'm not seeing any correlation between that and, you know, deal cycles because the change that we saw in deal cycles, that was somewhat orthogonal. \n\nMatt Swanson -- RBC Capital Markets --- Analyst\n\nYeah, that's extremely helpful. I guess the second part, just given that macro and given the cost sensitivity you mentioned, any SG&A changes in adoption around the free tier over the last couple of quarters and maybe this quarter, either customers migrating down or additional usage from companies that are not new to Elastic?\n\nAsh Kulkarni -- Chief Executive Officer\n\nWe have not seen that. Matter of factly, one of the things that we have seen is, you know, people who might have been using the free -- and actually, I mentioned one of these customers, reference one of these customers, a government agency, in my prepared remarks. I mean, what we are seeing is, you know, as the economic environment becomes such that, you know, everyone is inspecting their spend, we are seeing customers actually think about the cost of managing things themselves and recognizing that they're better off with a fully managed cloud service as opposed to trying to install and manage everything themselves. So, we did see customers adopting some of our higher tiers, and we haven't really seen any impact where customers are saying that they want to go to the free tier simply because the moat is massive.\n\nYou know, the difference between our premium tiers and the free tier is very significant. So, if you're using any of our advanced capabilities, giving all of that up is an extremely high hurdle, and we haven't seen any of that behavior.\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nAnd then, of course, the other thing I just point out there, Matt, is our on cloud, as you know, there is no free tier. Everything is paid beyond a couple of weeks of a trial period.\n\nMatt Swanson -- RBC Capital Markets --- Analyst\n\nAll right. Appreciate the color.\n\nOperator\n\nYour next question will come from Koji Ikeda with Bank of America. Please go ahead.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking my question. Just one from me here and really kind of trying to focus on this less than 100K customer ACV cohort here. So, just, you know, given the commentary with the SMB and really thinking about these two components being a fairly big component of the total revenue and really that $2 billion fiscal '25 target, I really want to understand the growth potential of this category over the medium term.\n\nYou know, I heard that you guys are repurposing SMB spend to enterprise sales, you know, a higher focus on self-serve for SMB, and then some investments for digital demand generation. So, a lot of puts and takes there. So, I guess the question is, you know, how should we be thinking about the growth in this, you know, sub-100,000K ACV segment here? Is the second quarter, you know, kind of a net add, a good way to think about, a sustainable, you know, net add in this category? I mean, does it go down from here? Does it go up from here? Any sort of help of how to think about this category? Thanks.\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nYeah. Koji, maybe I'll try and unpack that a little bit. So, you know, a couple of thoughts. In terms of our customer acquisition motions, we continued, as we've done over the past couple of quarters, to focus on driving toward customers who have a greater propensity to spend over time with us, which has meant focusing on those customers that are above that 10K ACV threshold and focusing less on the long tail of smaller customers that might spend just a few hundred dollars a month, for example.\n\nAnd you see that in the numbers. So, when you look at the total subscription customer count, although, sequentially, we added fewer total customers, when you look at the customers that are more than $10,000 in ACV, that customer additions was consistent with what we've done in prior quarters. So, we feel pretty good about the new customer acquisition motion and the effectiveness that we're driving as we try and work the cost to acquire customers into the calculus as well. So, I think that's working quite nicely.\n\nNow, you know, if you think about how those customers then eventually expand into the greater than 100K category, I think that's where we -- you can look at a couple of metrics. Obviously, the net expansion rate and then also just the sheer number of customers in the greater than 100K count in that particular category. And again, both of -- in both of those categories, you'll see that the expansion motions are working quite nicely. Here in Q2, they were a little bit slower than what we would have ideally liked.\n\nAnd I think that just reflects the broader trends that we've talked about from an enterprise perspective. So, what that does for us in terms of continuing to drive growth into the future, you know, suggests that the areas that have been working nicely for us, we need to continue to expand investment in those areas. So, for example, in digital demand and in marketing to continue to acquire customers at the right base and the right kinds of customers at the right base, and then to continue to invest in the higher-touch selling motion where we can continue to expand those customers into larger customers over time. And those are the two areas where we are continuing to sharpen and invest a bit further while focusing our -- and pulling back some of the investments in some of the other areas that were less productive in those selling motions.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Janesh. Thanks for taking the questions. Appreciate it.\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nYeah, of course.\n\nOperator\n\nThe next question will come from Kamil Mielczarek with William Blair. Please go ahead.\n\nKamil Mielczarek -- William Blair -- Analyst\n\nHi. Thanks for taking my question. I just want to double-click on the competitive environment. I believe you said win rates are unchanged.\n\nBut as you look across your three products, can you provide more detail on where you are seeing the most competitive pressure? And there's a large number of private vendors entering the observability space. Are you seeing any change in who you're coming up against in deals?\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah. So, let me maybe touch upon that. So, in terms of the three different segments, like I mentioned, where we tend to lead with in new accounts is almost always either in log analytics for observability or SIEM for security or enterprise search. In enterprise search, you know, we really haven't seen any change.\n\nIn security and log analytics, we really haven't seen any change either. What we have seen is as we land and we expand, you know, as we expect when we are trying to talk about XDR, we tend to see the vendors that have already been in the XDR space. But that's where we typically tend to go with that expand motion, not with a new customer, but with a customer that's already familiar with the Elastic platform, that's already using us for, say, SIEM. And then we basically get the point across to them that the same agents that they've deployed for ingesting data in the SIEM for analytics are the agents that can help them with actual endpoint protection.\n\nSo, it tends to be a different kind of a conversation as opposed to just going head to head against other XDR vendors. And it's the same thing even in observability because we also tend to start with log analytics, which has been an area of extreme strength for us. That's an area where we are very well known. We tend to have the advantage.\n\nWe compete incredibly well in that area. And once we start with log analytics -- you know, the progress that we've made on APM has been with existing customers, right? So, once we land with log analytics, we'll expand from there. We don't tend to, you know, just go into completely new APM scenarios for APM itself, like for APM alone. So, it's -- because of all of those dynamics, we have not seen the competitive environment change in any meaningful way at all.\n\nKamil Mielczarek -- William Blair -- Analyst\n\nThat's really helpful. And just a quick follow-up. You have well over 800 million in cash and cash equivalents. Can you update us on how you're thinking about the decision to build versus buy? And given the declining valuations in private markets, would you be more open to a more transformative acquisition?\n\nAsh Kulkarni -- Chief Executive Officer\n\nYeah, look, from our perspective, typically one of the things that we've been very focused on is we want to make sure that we are building a platform, not just assembling a portfolio. We believe that that's the right answer in the long term. When you have a clear, well-integrated platform, the land-and-expand motion tends to work much better. You know, your overall efficiency tends to only improve over time in terms of how you go to market, even in terms of your engineering efforts.\n\nSo, we want to be consistent with that. And so, that's one of the reasons why, traditionally, we've always done tuck-in technology acquisitions. In the private markets, to your point, you know, at this point, to be honest, I don't think that the private markets have corrected the way we've seen the changes in the public markets. It will happen in time.\n\nThat's what history has always shown us. But, you know, as that happens, when that happens, we are always going to be looking for technology tuck-ins that allow us to bring our future forward because we tend to integrate them deeply to make sure that we have a consistent platform. So, I don't expect that strategy to change. So, you know, when you say transformative, some of those small tuck-in acquisitions could end up being transformative just in terms of what that lets us accomplish in new areas that lets us get into, and we'll always be on the lookout for those kinds of things.\n\nBut that's how you should think about our strategy there.\n\nKamil Mielczarek -- William Blair -- Analyst\n\nThat's helpful. Thanks again.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Ash Kulkarni for any closing remarks. Please go ahead.\n\nAsh Kulkarni -- Chief Executive Officer\n\nSo, thank you all for joining us. You know, the thing that I'd say in closing is we are absolutely focused on our execution, and we remain confident in our ability to both drive growth and build a generational company and also continue to focus on profitability as we've demonstrated through all the things that we have done. So, thank you again. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNikolay Beliov -- Vice President, Investor Relations\n\nAsh Kulkarni -- Chief Executive Officer\n\nJanesh Moorjani -- Chief Financial Officer and Chief Operating Officer\n\nTyler Radke -- Citi -- Analyst\n\nPinjalim Bora -- J.P. Morgan -- Analyst\n\nJoel Fishbein -- Truist Securities -- Analyst\n\nVinod Srinivasaraghavan -- Barclays -- Analyst\n\nMatt Swanson -- RBC Capital Markets --- Analyst\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nKamil Mielczarek -- William Blair -- Analyst\n\nMore ESTC analysis\n\nAll earnings call transcripts"
}