{
  "companyName": "CS Disco, Inc.",
  "companyTicker": "LAW",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/cs-disco-inc-law-q2-2022-earnings-call-transcript/",
  "content": "CS Disco, Inc. (LAW 0.16%)\nQ2 2022 Earnings Call\nAug 11, 2022, 5:00 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to CS Disco's second quarter of fiscal year 2022 conference call. [Operator instructions] I would now like to hand the conference over to your first speaker today, Lee Robinson, CS Disco investor relations. Please go ahead.\n\nLee Robinson -- Investor Relations\n\nGood afternoon, and thank you for joining us on today's conference call to discuss the financial results for Disco's second quarter of 2022. With me on today's call are Kiwi Camara, Disco's founder and chief executive officer; and Michael Lafair, Disco's chief financial officer. During today's call we will review our financial results for the second quarter of fiscal year 2022 and discuss our guidance for the third quarter and an update on full fiscal year 2022. Today's call will include forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including, but not limited to, statements regarding our financial outlook, including our guidance for the third quarter and fiscal year 2022, our market opportunity, market position, product strategy and growth opportunities.\n\nIn addition to our prepared remarks, our earnings release press release, SEC filings and a replay of today's call can be found on our investor relations website, at ir.csdisco.com. Forward-looking statements involve known and unknown risks and uncertainties that may cause our actual results, performance or achievements to be materially different from those expressed or implied by the forward-looking statements. Forward-looking statements represent our management's beliefs and assumptions only as of the date made. Information on factors that could affect the company's financial results is included in its filings with the SEC from time to time, including the section titled Risk Factors in the company's quarterly report on Form 10-Q for the quarter ended March 31, 2022, filed with the SEC on May 13, 2022, and the company's upcoming Form 10-Q for the quarter ended June 30, 2022.\n\nIn addition, during today's call we will discuss non-GAAP financial measures. These non-GAAP financial measures are in addition to and not a substitute for or superior to measures of financial performance prepared in accordance with GAAP. A reconciliation between GAAP and non-GAAP financial measures and a discussion of the limitations of using non-GAAP measures versus their closest GAAP equivalents is available in our earnings release. And with that, I'd like to turn the call over to Kimi.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nWelcome, and thank you for joining our Q2 2022 earnings call. We have just marked a big milestone: the completion of our first 12 months as a public company. In Q2, we brought on some amazing new hires. As mentioned in our last earnings call, we added our new chief human resources officer, Jignasha Grooms.\n\nWe also brought on a new chief marketing officer, Tom Furr, who joined us from MongoDB and will help drive Disco's brand awareness. We also welcomed a new vice president of product strategy, Katie DeBord, who formerly served as global chief innovation officer at the law firm Bryan Cave. Katie brings deep domain expertise and insight into what lawyers want and need. In June, our inaugural class of associates and entrants joined Disco's Emerging Leaders rotation program.\n\nWe brought in 39 top graduates and 10 interns from 17 different universities across the United States. Following an intensive onboarding program that included learning our industry and business, a mini law school experience and a legal tech hackathon, these emerging leaders have joined every part of our company, including sales, marketing, product, finance and HR. We are excited to develop this next generation of talent during their three-year associate program and see the impact that each of them will make at Disco. And now I'll talk about our Q2 results.\n\nRevenue for Q2 was $33.7 million, above the midpoint of our guidance range. Our Q2 revenue grew 14% despite a very challenging comparison in Q2 2021 when revenue grew 88% and benefited from a small number of large reviews. In each of our earnings calls we have explained how the usage-based nature of our business can result in revenue volatility as a result of changes in the timing and nature of usage on our platform. Activity or lack of activity in particular cases, especially in large cases, can drive increased volatility in our revenue.\n\nThis is especially true for our Review product. While we continued to see strong performance in Ediscovery in Q2, we experienced this volatility in our Review business. As a reminder, this is one of the considerations that informs our guidance philosophy. We continued to add new customers at a steady pace, growing our customer count to 1,255 as of June 30, an increase of 27% year-on-year.\n\nOur steady growth in customer count reflects growing adoption of cloud computing and software-based solutions in the market. We believe our future growth will come both from continuing to add new customers and from expanding these customers by growing the percentage of their legal work that happens on our platform across all our products. We have talked extensively about scaling our go-to-market organization. I'd like to give you an update on how that is progressing.\n\nWe are on track with hiring across quota-carrying salespeople, sales development representatives and customer success. We continue to invest behind the success we are seeing with our sales development representatives and customer success teams, each of which has shown increasing productivity both in the aggregate and on a per-person basis. One of our learnings as we have scaled our go-to-market organization is that we can benefit from a higher ratio of lead generation to quota-carrying sales capacity, especially now when more than half of our sellers have been at Disco for less than one year. We are achieving this increase in lead generation capacity by investing in sales development representatives, customer success and marketing programs.\n\nHistorically, marketing programs have accounted for a relatively small percentage of our leads. With the addition of our new CMO, Tom Furr, and with the early success we have seen in Q1 and Q2 from marketing programs, albeit at limited scale, we are preparing to accelerate our investment in marketing programs in the second half of the year. Across all our go-to-market investments, we continue to closely monitor performance both in the aggregate and on a unit basis. We will continue to adjust the pace and direction of our investments as needed as we scale out our go-to-market team.\n\nWe remain committed to and excited about capturing the unique opportunity in front of us to build a technology system of record and engagement for the legal function. This quarter, we won a three-year Ediscovery subscription deal with a large, well-known technology advisory firm. We were up against a number of vendors in the RFP and successfully unseated the incumbent provider. The customer needed self-service ability and was impressed with Disco's AI capabilities and how our platform understands concepts and context, improves time to evidence and reduces review time.\n\nThey liked Disco University, with its user-friendly content and the ability to easily learn through the use of on-demand training modules. We have been pleased with the excitement around and feedback on the expansion of our product portfolio with the Hold and Request products that we acquired in Q1 of 2022. In Q2, we had existing Hold and Request customers renew and were excited to see the interest from new and existing customers during the period. These are large enterprises, including a notable company in the consumer tech space.\n\nWe are very excited to see Hold and Request get Disco in the door of enterprises early on in the legal value chain and complement the other Disco products in accelerating a company's legal work. Part of our value proposition is our laser focus on providing the most intuitive and effective user experience for our customers, a direct result of combining our deep domain expertise with a commitment to world-class engineering. In Q2, we continued to roll out new features that help lawyers get to evidence faster, while also investing in platform performance and capabilities. One of the highly anticipated innovations we are proud to announce and have our customers use is topic clustering with automatic indexing.\n\nThis feature capitalizes on our proprietary AI to allow users to quickly gain insight into groups of documents with an AI-generated outline that works like a table of contents for an entire document universe. The index is generated from the documents themselves before any human lawyer review. Topic clustering with automatic indexing labels groups of documents with phrases extracted directly from the records to help lawyers quickly find relevant content. This helps lawyers quickly learn the language of the case and use that language to inform further searching and exploration of large data sets.\n\nUsers are able to quickly identify the topical content of documents, drill down to explore subtopics, cluster similar subject matter together and organize topic clusters into an easily navigable list. We are always making incremental improvements to our platform that ultimately help lawyers get to evidence faster and improve their quality of life. We understand there is great interest in understanding how macroeconomic factors like inflation and the risk of a slowing economy may impact our business. As these questions are frequently raised in investor conversations, we thought it would make sense to share with you what we are seeing, as well as how we plan to manage through this environment.\n\nWhile we didn't exist during the Global Financial Crisis over a decade ago, what you'll find if you analyze the historical market data is that the eDiscovery market was relatively resilient. As a matter of fact, according to an industry report, the eDiscovery market experienced healthy growth between 2008 and 2011, while many categories of software experienced much more tepid growth. We believe that Ediscovery will continue to be in demand during periods of economic contraction as our customers deal with less cyclical parts of the law, primarily litigation and disputes, as compared to areas of law such as corporate transactions or capital markets. There will always be disputes and investigations regardless of the macroeconomic environment.\n\nWhile we have all seen reports of potentially moderated growth in IT spending, our customers' budgets are not only IT budgets, but legal ones. We provide critical technology to lawyers that is required in all kinds of complex disputes and investigations. We will continue to tout the benefits of using technology like Disco to make legal work more efficient from both a time and cost perspective for legal departments and law firms. We have heard from customers that our focus on delivering a more efficient way of handling large volumes of legal work is of particular interest in the current climate.\n\nI'd like to conclude on Disco's overall outlook and investment philosophy before Michael gets into the numbers. We see a large market for Disco and intend to continue to go after the opportunity ahead of us. While we are moderating guidance for the fiscal year, primarily on account of the volatility in Review that I previously discussed, we remain committed to investing in our products and in the scaling of our go-to-market organization. Using technology to transform the way legal departments and lawyers work is a long-term vision to which we are deeply committed.\n\nWe are as excited as ever about the opportunity in front of us, and we are resolute in our belief that the products and team we have built position us well to build a large and enduring business as software transforms the legal industry. I'll now turn it over to Michael to discuss our financial results and guidance.\n\nMichael Lafair -- Chief Financial Officer\n\nThank you, Kiwi. I will now discuss the details of our recent quarter results and provide guidance for Q3 2022 and an update on our outlook for fiscal year 2022. I'd like to reiterate that our business is primarily a usage-based model that is driven by the number of matters, nature of usage on the platform, volume of data, length of time on the platform and other factors that may impact revenue in any given quarter. As Kiwi mentioned, Q2 revenue was $33.7 million, above the midpoint of our guidance range.\n\nWhile Ediscovery had strong performance and we're seeing traction with our newest Hold and Request product, year-on-year revenue was impacted by volatility and usage by some of our customers, particularly in Review. In discussing the remainder of the income statement, please note that unless otherwise specified all references to our expenses, operating results and share count are on a non-GAAP basis. Our gross margin in Q2 was 76%, up from 71% in Q2 of the prior year. As a reminder, our gross margins fluctuate from period to period based on, for example, the amount and types of data ingested and managed on our platform.\n\nWe expect gross margin to continue to be within the bands we've historically seen. Sales and marketing expense in Q2 was $17.6 million, or 52% of revenue, compared to 36% of revenue in Q2 of the prior year. This represents an increase of approximately $7 million in the quarter year-on-year. As we previously mentioned, we've been focused on investing in our go-to-market organization.\n\nWe continue to feel that now is the right time to invest and scale our business in order to capture the opportunity ahead. While there is ramp time for new hires, we are measuring and closely monitoring the returns on investments we are making in our people. Research and development expense in Q2 was $13.1 million, or 39% of revenue, compared to 26% of revenue in Q2 of the prior year. This represents an increase of over $5.5 million in the quarter year-on-year as we continue to invest in personnel who are focused on innovation of our product and platform in order to provide a magical customer experience.\n\nGeneral and administrative expense in Q2 was $8 million, or 24% of revenue, compared to 16% of revenue in Q2 of the prior year. This represents an increase of over $3.3 million in the quarter year-on-year. We have strategically added to our G&A organization following our IPO to support the increasing scale of our business, particularly in our finance and accounting organization and HR teams. Operating loss in Q2 was $13.3 million, representing a margin of negative 39%, compared to negative 7% in Q2 of the prior year.\n\nAdjusted EBITDA was negative $12.4 million in Q2, a margin of negative 37%, compared to a margin of negative 5% in Q2 of the prior year. Overall, our EBITDA was better than guidance due to strong gross margin and lower-than-expected expenses in the quarter. Net loss in Q2 was $13.5 million, or negative 40% of revenue, compared to a net loss of $2.1 million, or negative 7% of revenue, in Q2 of the prior year. Net loss per share in Q2 was $0.23, compared to a net loss per share of $0.16 in Q2 of the prior year.\n\nTurning to the balance sheet and cash flow statement, we ended Q2 with $228.2 million in cash and cash equivalents. Operating cash flow in Q2 was negative $22.2 million, compared to negative $10.2 million in Q2 of the prior year. Now, turning to the outlook. For Q3 2022, we are providing revenue guidance in the range of $32 million to $34 million, representing 11% year-over-year growth at the midpoint.\n\nFor Q3 2022, we are providing adjusted EBITDA guidance in the range of negative $19.5 million to negative $17.5 million, representing adjusted EBITDA margin of negative 56% at the midpoint. As previously mentioned, we will continue to invest in building out our go-to-market team and adding additional product capabilities. We want to be prudent in our investment decisions while continuing to position Disco to grow our share of the significant long-term market opportunity that we believe we are well positioned to capture. For the full fiscal year 2022, we are lowering our revenue guidance to the range of $132 million to $136 million, representing 17% growth at the midpoint.\n\nOur revised 2022 revenue guidance is primarily attributed to the volatility in our Review business and conservatively incorporates the potential for incremental headwinds that may materialize in the back half of the year. We anticipate that our original product, Ediscovery, will have over $100 million in revenue in 2022, with an annual growth rate of more than 30%. For the full fiscal year 2022, we expect an adjusted EBITDA margin of negative 43% at the midpoint, representing a range of negative $60 million to negative $56 million. We are continuing to invest in our business and scale the organization to capture the opportunity in front of us.\n\nWe are focused on providing the best products on the market to our customers, providing innovation to the practice of law and transforming the way legal work is performed. We are delighted to continue to hear positive feedback from our most important stakeholders: our customers. We see a huge opportunity for Disco in the market, and we are investing in our people and organization to reach the kind of growth and scale we want to achieve. We acknowledge that these investments take time to reach fruition.\n\nWe will continue to pursue market share in an industry ripe for technological disruption, and we will drive Disco's leadership in its transformation. I'd like to now turn the call over to the operator to open up the line for Q&A. Operator?\n\nOperator\n\n[Operator instructions] We go first to Koji Ikeda, with Bank of America.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking my questions. I wanted to kind of dig in on the guide. This is clearly going to be very topical for you guys here coming out of the quarter.\n\nSo totally understand kind of the commentary there on the Review product, but wondering if you could get a bit more granular on why is there so much volatility in the Review, why is it causing that guide down. Is there anything else to call out or that was considered with the revenue guidance? And maybe anything with some big cases that might be falling off? And just kind of thinking about the guidance, Michael, appreciate the Ediscovery percentage contribution for the total '22 guidance, it looks like about 75% of revenue. But thinking about Review, how much was that as a percentage of revenue, maybe over the past several quarters?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nThanks, Koji. So our Review business enables much larger ticket sizes. We've talked in the past that customers who adopt multiple Disco products, principally Ediscovery and Review, their total spend can wind up being two to three times their spend on Ediscovery alone. So that's driven by big ticket reviews.\n\nIn addition, the Review business as a whole is relatively earlier in revenue scale than the Ediscovery business. And as a consequence, there is more volatility in the Review business caused by the timing of activity in large reviews. To put this a bit in perspective, if you focus on reviews that bill more than $1 million in a quarter, two or three of those reviews make the quarter a great quarter; two or three more make it a complete home run. And so, the kind of volatility that we're talking about is driven by the presence or absence of a low-single-digit number of large reviews.\n\nOperator\n\nThank you. We go next now to Tyler Radke, at Citi.\n\nTyler Radke -- Citi -- Analyst\n\nYes. Thanks for taking the question. Obviously, a pretty significant cut to revenue guidance, but it looks like you're largely maintaining your investment posture. Maybe just give us a sense, like, on a normalized basis, understanding that the macro environment is difficult today, but how do you kind of expect long-term growth to trend? I mean, obviously, you're making investments still at a pretty healthy pace.\n\nSo presumably, you're seeing no change in the long-term market opportunity. But I guess as we think about growth beyond this year, just help us frame what levels you're achieving for and investing for.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nWe've been pleased with the continued steady growth in customer count. We disclosed in our prepared remarks that customer count is now at 1,255, representing growth of 27% year on year. So focusing on customer count abstracts a little bit from the volatility that is created by changes in the volume and nature of usage on our platform by particular customers in any particular quarter. In addition to that steady growth in customer count, I talked a bit about the unit productivity and aggregate productivity across our go-to-market team now that we are four quarters in to the six-quarter go-to-market build-out that I talked about at time of IPO.\n\nSo all those fundamentals of our business seem to be tracking well and give us an appetite to continue our level of investment, although of course we adjust the level and direction of our investment from time to time based on market conditions and the performance we see in the business. In terms of long-term growth, Michael mentioned in his remarks that our original Ediscovery product we anticipate will do more than $100 million of revenue this year, growing more than 30% year on year. That product has gotten to a level of revenue scale that decreases the amount of volatility that is created by particular customers or particular matters. And so, I think you can think of that as a base on top of which we have invested in layering these newer products, things like Disco Review, Disco Case Builder, Disco Hold and Disco Requests.\n\nAnd we've talked about how those products unlock materially larger ticket sizes. Customers who are using multiple products can wind up spending 2x to 3x what they would spend on Ediscovery alone. This gives us the belief that over time there would be an opportunity to accelerate growth, both by continuing to add new customers at a steady pace, as we've demonstrated, and by continuing to expand those customers, encouraging to move more legal workloads and more kinds of legal work onto the Disco platform.\n\nTyler Radke -- Citi -- Analyst\n\nThanks [Inaudible]\n\nOperator\n\nThank you. We go next now to Derrick Wood, at Cowen & Company.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nThank you. I guess, Kiwi, I mean, in your prepared remarks you talked about how your market withstands the macro headwinds and, in fact, often leads to more disputes and litigation activity. Why do you think you're seeing this kind of change in demand behavior play out, especially considering your Review technology has a strong ROI? I guess, I'm just trying to get a sense for what has changed so dramatically over the last three months. Is it perhaps due to some lost customers from using Review? Or can you just shed a little bit more color on why the customer behavior is doing what it's doing?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSure. It's less about lost customers and more about changes in customers' usage on the platform. Again, to put this in perspective, the presence of two to three large reviews, reviews that bill more than $1 million in a quarter, would cause this to be a great quarter, and two to three more reviews would cause it to be an absolute home run quarter. So the volatility that we're talking about in the Review business has to do with the presence or absence of a low-single-digit number of big-ticket reviews.\n\nWe're not seeing anything fundamentally different in win rates or in the demand environment or in sales cycle times or anything like that. And I think you can see that demonstrated in the steady growth we've shown in customer count, which, to some extent, abstracts away from this volatility in usage.\n\nOperator\n\nThank you.  [Operator instructions] We go next now to Arvind Ramnani, at Piper Sandler.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nHi. Thanks for taking my question.  So I just want to ask this question a little bit differently on guidance and kind of the impact that a couple of clients may have on overall Review. So given just you clarified, like, you may have just two or three clients kind of make the difference between an OK quarter a good quarter or a good quarter, excellent quarter, as an investor, should we expect this type of volatility as basically part of the business? And is this type of volatility repeatable? And then, if that's the case, should we really look at expanding the range of the guidance you'll provide to more than $4 million or $5 million?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSo on every quarterly earnings call, we have emphasized that our business can demonstrate volatility in revenue from quarter to quarter, driven by changes in the nature and volume of usage on our platform. And as a reminder, those changes in usage are driven less by customers' decisions about what kind of legal technology they want to adopt and more by exogenous factors that are often outside the control of the particular customer; for example, the timing of a new lawsuit or investigation, a ruling in a lawsuit or an investigation that increase or decrease the scope of data and review involved or the timing of an adjudication or negotiated settlement. In terms of the volatility going forward, we think there are two big contributors to the volatility of our Review business. First is that the ticket sizes for Review can be materially larger than the ticket sizes for Ediscovery.\n\nYou've heard me mention several times the 2x to 3x total spend of customers adopting multiple products as compared to their Ediscovery spend alone. Those larger ticket sizes are coupled with Review being earlier in its product life and, as a consequence, having a smaller revenue base. I think there's some wisdom we can take from how we saw the Ediscovery product go through its journey. Early in its life, when it had earlier revenue scale, the Ediscovery product, too, exhibited more volatility because any particular matter or customer's usage represented a larger percentage of the overall Ediscovery revenue.\n\nBut now the Ediscovery product we anticipate will do more than $100 million of revenue this year, with a growth rate of 30% or more. At that kind of revenue scale, we have seen materially decreased volatility for the Ediscovery business. We believe that as the Review business reaches similar revenue scale, we'll see a similar decline in the volatility of that business.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nYeah. That's -- that's -- that's really helpful. Thank you very much.\n\nOperator\n\nThank you. We go next now to Brent Thill, at Jefferies.\n\nLuv Sodha -- Jefferies -- Analyst\n\nHi, this is Luv Sodha on for Brent Thill. Thank you again for taking my question. You know, I wanted to ask about a pretty big decel in margin guidance for the year. Could you just -- apart from the marketing investment, what other investments are planned on the product or the sales side in terms of headcount? And could you maybe give us how you're tracking the productivity of these reps? Maybe give us some additional color there?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nThe EBITDA guidance is principally a function of the moderation we're doing to our revenue guidance. And again, that is us reflecting Q2 and then adhering to our guidance philosophy of providing prudent guidance for the forward quarter. In terms of our investments in go-to-market, we look at a variety of things, and I talked about some of them in my prepared remarks today. One of the things we're most excited about are increases in productivity, both in the aggregate and on a unit basis, from our sales development representatives, who generate new opportunities, and our customer success team, which generates upsell and cross-sell opportunities in the existing customer base.\n\nBoth of those teams for the past couple of quarters have set new records for productivity in the aggregate and on a per-person basis. One of our learnings as we continue the build-out of the go-to-market organization is that right now, when so many of our sellers have relatively short tenure at Disco, more than half of them have been here less than a year, there's an opportunity to increase the level of investment in lead generation relative to quota-carrying sales capacity. And so, we will be shifting the direction of our investment in the back half of the year accordingly, increasing our investment in SDRs and CSMs and also scaling out marketing programs with the addition of our new CMO.\n\nOperator\n\nThank you. We go next now to Scott Berg, at Needham.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, Kiwi and Michael. Thanks for taking my question today. Kiwi, let me ask this a different way. I know we're all kind of asking roughly the same question, plus or minus.\n\nYour new guidance calls for second half revenues to be down 21.5% at the midpoint with that $17 million reduction. That's a big number. Annualized, it's $34 million. I guess what we're trying to understand is, in this Review product, $17 million, even if I break it up between two quarters, sounds like it's more than just a couple of customers.\n\nI guess, how can the magnitude be that big and the swing factor be that big in this one area? It's not a couple of gigabytes of data usage. It's not a few million bucks one way or the other necessarily. That's a big enough number and a big enough percentage that it's outside of, I think, our standard deviation or two of what we would think volatility in this model would look like.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nI think the magnitude we're talking about in the Review business and specifically what we saw a shortage of in the second quarter are a couple of, one, two or three, large reviews billing north of $1 million per quarter. The presence or absence of one to six of those reviews can take a quarter from good to great to a complete home run. And again, that is volatility that's created by the big ticket sizes in Review, as well as the relatively small size of the Review revenue base today. In terms of our go-forward guidance, we have sought to derisk the guidance as much as possible and to adhere to the guidance philosophy that we've articulated on each of our prior earnings calls, where we expect to be prudent in our forward guidance.\n\nNow, that will result in some quarters that have outsize beats, as you've seen in the past, and some quarters that have more modest beats, like the quarter we just reported.\n\nScott Berg -- Needham and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. We go next now to Parker Lane, at Stifel.\n\nMax Osnowitz -- Stifel Financial Corp. -- Analyst\n\nHi. It's Max on for Parker. Thanks for taking my question. Can you just kind of -- if we think about expenses going into 2023, I know you're not guiding for '23, but is this second half going to be kind of the trough for margins as we look at the out year? Or will those levels of spending kind of continue?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nWhen we went public, I announced a six-quarter plan to ramp up our go-to-market capacity by about 3x. So we're now through four quarters of that six-quarter plan. And as I discussed in my prepared remarks, we're now fully on track with the hiring that's implied by that plan. Our anticipation is that after this year, you should see incremental leverage in the business as we begin to move toward the long-term margin profile.\n\nMax Osnowitz -- Stifel Financial Corp. -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. We go next now to David Hynes, at Canaccord Genuity.\n\nLuke Morison -- Canaccord Genuity -- Analyst\n\nThis is Luke on for DJ. Thanks for taking our question. So we're curious, how are you thinking about cumulative cash burn and timeline to breakeven given the revised near-term growth outlook but consistent investment agenda, going forward?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSure. I think if you compare our historical cash burn to the strength of our balance sheet, I believe we ended the quarter with north of $200 million of cash on the balance sheet, there is no expectation that we will need to return to the market to raise additional capital for organic purposes. We anticipate being able to get to profitability based on the strength of our current balance sheet. And as I said in response to the last question, our anticipation is that beginning in 2023, you will start to see increasing leverage in the business now that we've gone through this 3x-ing of our go-to-market capacity this year.\n\nOperator\n\nThank you. [Operator instructions] We go next now to Mark Schappel, at Loop Capital.\n\nTim Greaves -- Loop Capital Markets -- Analyst\n\nHi. This is Tim Greaves on for Mark. I want to talk with respect to Congruity 360. Has the user interface for Hold360 and Request360 been updated to match to Disco's user interface?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSo that work is in flight. We did a handful of kind of the simpler user interface updates, things like the logo and navigation and [Inaudible] integrations and things like that shortly after the acquisition closed. We do anticipate a broader sort of Version 2 of the user interface of those products, including deeper integration into the rest of the Disco product suite, to unfold over the course of 2023. And of course, like all our products, when we build a product we think it's always important to maintain R&D capacity on that product so that we're making continuous improvements inspired both by our vision for the future of the product, but also by the feedback we're receiving from existing customers and prospects in the market.\n\nTim Greaves -- Loop Capital Markets -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. We go back now to Tyler Radke, at Citi.\n\nTyler Radke -- Citi -- Analyst\n\nHey, thanks for taking a follow up. So Kiwi, maybe you could help us understand why these Review deals aren't happening. Is it simply because maybe these use cases were for a legal case that got pushed out that was maybe more cyclical? And then, just help us understand, are you not anticipating any more of these large Review cases to fall in the second half? Just help us understand how much you've kind of derisked the guide from a Disco Review perspective.\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nSure. So typically, and again we're talking about a small handful of reviews that bill more than $1 million in a quarter, those tend to be big-ticket litigations of the sort you would read about in the paper. And the timing of them is, again, somewhat exogenous. It depends on when such a litigation is initiated, when a big new investigation is initiated.\n\nIt depends on rulings by the court or other decision-makers, say, a regulator, about the scope of discovery in the investigation. It depends on the progress or lack thereof in settlement negotiations, in the timing of rulings on incremental motions and on the final disposition of the case. So it's a lot dependent on what's going on in the specific legal process. In terms of our guidance, what we have sought to do is to derisk the guidance from the point of view of these kinds of large reviews.\n\nOperator\n\nThank you. And it appears we have no further questions this afternoon. I'd like to turn the conference back over to Kiwi Camara, co-founder and CEO, for any closing comments. Mr.\n\nCamara?\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nThank you for joining us today. At Disco, we will continue our march to be the legal technology leader and make the everyday lives of lawyers easier, smarter and more efficient. We thank you for your interest in Disco and for joining our Q2 2022 earnings call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLee Robinson -- Investor Relations\n\nKiwi Camara -- Founder and Chief Executive Officer\n\nMichael Lafair -- Chief Financial Officer\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nLuv Sodha -- Jefferies -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nMax Osnowitz -- Stifel Financial Corp. -- Analyst\n\nLuke Morison -- Canaccord Genuity -- Analyst\n\nTim Greaves -- Loop Capital Markets -- Analyst\n\nMore LAW analysis\n\nAll earnings call transcripts"
}