{
  "companyName": "Salesforce",
  "companyTicker": "CRM",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/salesforce-crm-q3-2023-earnings-call-transcript/",
  "content": "Salesforce (CRM 0.04%)\nQ3 2023 Earnings Call\nNov 30, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to Salesforce's fiscal 2023 third-quarter results conference call. At this time, all participants are in a listen-only mode, and please be advised that this call is being recorded. After the speakers' prepared remarks, there will be a question-and-answer session. [Operator instructions] And now, at this time, I'll turn the call over to your speaker, Mr.\n\nMike Spencer, executive vice president, investor relations. Please go ahead.\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nThank you, Bo. Good afternoon, and thanks for joining us today on our fiscal 2023 third-quarter results conference call. Our press release, SEC filings, and a replay of today's call can be found on our website. With me on the call today is Marc Benioff, chair and co-CEO; Bret Taylor, vice chair and co-CEO; Amy Weaver, chief financial officer; and Brian Millham, president and chief operating officer.\n\nAs a reminder, our commentary today will include non-GAAP measures. Reconciliations between our GAAP and non-GAAP results and guidance can be found in our earnings and press release. Some of our comments today may contain forward-looking statements that are subject to risks, uncertainties, and assumptions, which could change. Should any of these risks materialize or should our assumptions prove to be incorrect, actual company results could differ materially from these forward-looking statements.\n\nA description of these risks, uncertainties and assumptions, and other factors could affect -- that could affect our financial results is included in our SEC filings, including in our most recent report on Forms 10-K, 10-Q, and other SEC filings. Except as required by law, we do not undertake any responsibility to update these forward-looking statements. And with that, let me hand the call over to Marc.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nOK. Well, thank you so much, Mike, and thank you, everyone, for being on the call. I just want to come back to how great it was to see so many of you at Dreamforce in September. It was really a wonderful experience for me personally.\n\nIt was our most successful, but I really think it was our most important Dreamforce ever because we were able to come together for what we called our great reunion. And being with you all of you, especially at our IR day, that was a joy for me. Now, let's get on to the quarter results. We delivered solid revenue growth and profitability in an increasingly challenging environment.\n\nYou've seen how we're driving customer success, the strength of our organic innovation, and this incredible Trailblazers community and how it manifested at the Dreamforce. And everywhere we turn, we saw customers learning how to connect with their customers in entirely new ways and the depth of our Customer 360 platform. We're also thrilled to introduce Genie, which is our Customer Data Cloud, and it's one of the most transformational technologies we have ever delivered. And when you hear some of the metrics already coming out of customer adoption with Genie, I think that you'll be incredibly impressed, and I can't wait for Bret to talk about that.\n\nThe best part of Dreamforce has been together. That was what it was all about for me, and I'm sure it was for you as well, and the 40,000 folks that all came to San Francisco to have this incredible experience and all the additional folks that joined us online. Now, let's get to our results. Revenue in the quarter, well, it was $7.84 billion.\n\nThat's up 14% year over year. I think that's a record for us. And also, it was 19% in constant currency. And we're going to talk about that foreign exchange situation in just a second.\n\nWe closed some amazing deals in the quarter with great companies like Bank of America, RBC Wealth Management, and Dell and other great stories, and I'm also going to get that into a moment as well. And even with purchase decisions receiving greater scrutiny, we continue to gain market share and close marquee transactions. IDC recently ranked Salesforce as the No. 1 in CRM.\n\nAnd now we've done that for nine years in a row. And I'm proud that we've delivered revenue growth in this environment, but especially proud of the team for our continued focus on delivering record operating margins. And here, you can see now, up 22.7% non-GAAP operating margin we delivered for the quarter. And I think when I look back at various financial crises, as we think back even, I think, to 2008, 2009, I think it was like somewhere down to 10%.\n\nSo, we've come a long way in a short period of time. So, this quarter has been further proof of our commitment to profitable growth, continuing our operating margin growth, continued focus on our revenue growth, continued focus on our market share growth. And a great evidence of that is our remaining performance obligation. Our RPO is now an incredible $40 billion.\n\nNow, as I've said in the last few quarters, the dollar had a strong quarter, maybe even a stronger quarter than we had. I think that when we first said that, in the second quarter, folks didn't really understand what we were talking about, or maybe it wasn't the first quarter we said that. I remember, it was a trip to Japan when I called Amy, and I was asking her what the expectations were for revenue. But when I told her what my guidance was for what and how I was looking at revenue, including foreign exchange, I don't think either one of us could believe what was really happening, and now we've really seen that start to play out.\n\nWe continue to see the impact of foreign currency fluctuations. And of course, that is our biggest surprise of the year. In the quarter, we saw $300 million year-over-year headwinds to revenue, and we've expected a total of $900 million for the full year. Now that is something we just could not have expected a year ago, and that is when we initiated our revenue guidance.\n\nAt Dreamforce and in my travels around the world, our customers have been asking how to best navigate this economic situation with the high level of market volatility and uncertainty. A lot of CEOs have never been through these types of crises before. They haven't seen this kind of variations in the market or in foreign exchange or even in market demand. Well, we've got a lot to say about that, because this is not our first financial crisis.\n\nAnd I'm seeing a lot of buying behavior that really reflects a lot of what we've seen during other crises, whether it's 2008, 2009, or even 2001. And obviously, the current economic situation is nowhere near as severe as what happened beginning in 2008, but there are some patterns that we've seen repeat themselves. And in early 2008, we saw customers who are reluctant to expand distribution capacity, they weren't adding service people, they froze their hiring, they initiated headcount reductions. We saw those occur in that year.\n\nWe saw that in 2011 as well. I think that maybe when things start to get a little tough or when the stock market shifts that's when CEOs say, \"Hold on. Should we be expanding distribution capacity right now? Should we be expanding service capacity? What do we stop -- let's stop our advertising. Let's stop our marketing spend.\" Things that they can immediately take actions on.\n\nWell, you couple that with foreign exchange headwinds have become an issue and everyone who's shifting their focus to finding efficiencies, reducing their costs, increasing productivity, and again, we're feeling all of this once again. And that led us to the shift of the company. It took us a lot to how we operate and where we are investing our dollars. We've actually developed our own playbook.\n\nWe really wrote it all down. We talked about what was happening. We knew what happened again. And we had to desk off some of those plans and numbers from 12, 13 years ago from 22 years ago.\n\nAnd we've turned that playbook in gaining market share and focusing on operational discipline and operational excellence, especially in the face of economic headwinds. And as the economy has started to recover, whether it's in 2010, or even in 2002, we were able to radically accelerate our growth. I have to tell you, when we went back as a team and we looked at the numbers, even I was really shocked to see kind of how things change some of the decisions that we made, but then how we all of a sudden were able to navigate so well, and use that as an opportunity to adjust the company in all -- in a number of really critical and strategic areas. Now I've always believed since that point, especially, that an economic crisis creates these opportunities, and we're squarely in that moment, and we've acted.\n\nStarting in July of this year, the buying environment became more measured and foreign exchange headwinds were becoming increasingly complex. We told you then we didn't believe this challenging macro environment was going to be a short-term problem. And you know we're not economists. You know that we don't know exactly what is happening or when the recovery will happen, etc., but we do see a lot, and I think we understand a lot about what's going on because we have such strong global data.\n\nAnd we're not assuming that this economy gets any better anytime soon. We're just reporting what we see with our customers, the kind of changes they make when they start to feel these headwinds. We're following our playbook to make sure it works well positioned to gain market share, to increase our profitability, to focus on our operating margin, to focus on the growth of our revenue, and be able to continue to invest, especially when the economy recovers. Now, for this fiscal year, we're maintaining our revenue guidance of $30.9 billion to $31 billion, up 17% year over year or 20% in constant currency.\n\nAnd you saw that that also included that incremental foreign exchange headwind, and it's even an expected incremental $100 million of foreign exchange headwind just since last quarter. We're raising our fiscal year 2023 non-GAAP operating margin guidance from 20.4% to 20.7%, an expansion of 200 basis points year over year, and I expect a lot more, especially with this increased focus we have on expanding our operating margin. Salesforce is mission-critical to nearly every Fortune 1000 company because every company is becoming a customer company. And everyone knows that this is the time during a crisis like this that you need to focus on your customers.\n\nIf you need to do one thing, if there's one critical thing that every company has to do to get through this, is to make sure they maintain their relationships with their customers. It's a critical part of navigating through this time, and you're not going to be successful if you all stay connected with your customers. We're signing transformational deals with major brands, as every industry continues to digitally transform and that continues to be perhaps the most important initiative of every company, regardless of the economic situation. When you look at this by industry, it's slightly different for each industry.\n\nIn telecom, we're working with almost every major players. They transform how they connect with their customers. All telcos must deliver faster, better service to customers, keeping their costs down, focusing on their NPS score, becoming more competitive. We all know that.\n\nIt's a highly competitive industry. We all understand the dynamics well. It's one of the reasons why we've done so well in all these global telecom companies. But I really want to talk to you about a great example, and this deal that we signed with T-Mobile in the quarter.\n\nNow we've done a lot of work with Mike and with T-Mobile over the years, and that's been very exciting to see how they built their company and especially how they've executed the merger and now they have a treeing amazing transformational opportunity on how they work with businesses, and we're working with them to develop a vision for the next-generation user experience for T-Mobile for Business and our professional services team is leading that charge. Financial Services, well, that's another industry that's been going through one of the most incredible digital transformations, but it's an incredible moment for them actually. It's why we're working with all the major financial service companies to drive stronger client relationships and to unite their teams to be more effective, especially in this environment. It's a golden time for financial services in many ways.\n\nA great example is Bank of America, who I think has been a customer for more than 20 years, and we've been with them through many different financial crises. But in a short amount of time, they've increased productivity and reduce their technical debt. They're saving time and money. They're connecting with their customers in new base.\n\nIt's a tremendous relationship with BofA to become their CRM standard. We're delighted to have such great success with them over many decades and to expand this relationship to the business bank, to the corporate bank, and the investment bank, it's really an expansion. And I just want to thank Brian for his tremendous loyalty, but also his partnership over so many decades, and it's just a great organization to work with every single day. Well, before I go on, first of all, I want to give you an invitation.\n\nI hope that you'll all plan to join us in New York City next week, where we're going to host our Salesforce world tour on December 8. Join us in person or online, where we're going to announce some new innovations. And you're going to hear from our incredible customers and so much more. Now, before I end, I have to say something, and it's something that I did not want to say ever, and I'm extremely sad to tell you that, Bret Taylor is going to be leaving the company.\n\nBret and I are like brothers. I love him very deeply. He's an incredible person. And one of the great joys of my company has been having him here.\n\nAnd I'll tell you, for me, this has been a feeling of tremendous loss. I'm experiencing that right now. You can probably hear it in my voice. It makes me think of all the great people that we have actually lost in the company over the time as well, so many great leaders of our industry, but especially now with Bret.\n\nThis is just really hard for me, and I'm extremely sad to see him go. I know he has created two great companies. I know he wants to go create a third great company. And you can't keep a wild tiger in a cage.\n\nAnd we got to let them be free and let him go, and I understand, but I don't like it. And Bret, you know that you're always going to be our brother. You know that you -- we love you very deeply, that you have a home here. We're going to try to get you back somehow.\n\nSo, don't think that you're going to somehow get out of this alive because you're not. And you're always going to be part of our Ohana. And we are really upset about this, and it's going to be a difficult moment for us. But I know that you're going to be with us through the end of the year, and I know you're going to continue to work with us even after this point.\n\nBut Bret, we love you, and we're so sorry to see you leave the company at the end of this year.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nThank you, Marc. It's hard to follow that and trying to keep my composure as well. I just want to start, Marc, by just expressing how deeply grateful I am to you. And just as importantly, the entire Salesforce team.\n\nFor the past six-plus years, I just couldn't have imagined it when I joined the company, I could not be more proud of the trust, innovation, and customer success we've delivered in my time here, particularly over the past few years, I think this amazing community has helped every organization in the world to remain connected to their customers amid a public health crisis, the economic turmoil, this global pandemic. It's just incredible, and I'm incredibly grateful. And Marc, you personally, you've been my mentor long before I joined this company. And in the past six years, your relationship has definitely become the most significant in my professional career.\n\nI would not be the leader, I am today without you, and I cannot thank you enough for our friendship and our partnership. The past few years have been tumultuous for all of us, and I've recently been reflecting what's been truly important to me. And while there is absolutely no easy time for a transition like this, I really do feel that now is the right time for me to return to my entrepreneurial roots, particularly given the technology landscape and the economy going through such tectonic shifts. Salesforce has never been stronger, and I've never been more confident in the future of the company.\n\nAnd as Marc said, I will remain as co-CEO through the end of the fiscal year, not only to ensure a smooth transition but, most importantly, to ensure that we have a strong close to the quarter and a strong close to the fiscal year. And as Marc said, even after this transition, I will always, always be a part of this company and always be a part of this community. As Marc said, we had a solid quarter, top -- double-digit top and bottom-line performance, demonstrating the strength of our business model and our commitment to operating with discipline and delivering profitable growth at scale. We continue to deliver on organic innovation, and our product portfolio is strategically positioned, mission-critical, and highly differentiated.\n\nOur ecosystem and our app exchange marketplace are unparalleled in the industry. And as Marc mentioned, as you saw at Dreamforce, our innovation engine is an overdrive, with Genie, Slack canvas, Net Zero Marketplace, and more, building on our position as a leader in nearly every CRM category. Genie, in particular, makes every part of our Customer 360 platform more automated, intelligent, and real-time, driving faster time to value for our customers. And the adoption of Genie by our customers, particularly this past Cyber week, has exceeded all of our expectations.\n\nThe Genie Customer Data Cloud is already processing literally over 100 billion customer records on average every single day. During Cyber Week alone, Genie ingested an astonishing 1.1 trillion records and enabled 43 billion consumer engagements for our customers. Inter, a leading digital banking service company in Brazil, is a great example of Genie's power. Inter was able to consolidate six data systems into one, and they are converting 35 times more customers with Genie.\n\nLike Marc, I met with hundreds of CEOs across every industry over the last few months. In this buying environment, our customers are increasingly focused on three things. First is time to value. Our customers need to quickly get the benefits of their technology investments.\n\nSecond is ensuring these digital transformation projects drive cost savings in addition to customer satisfaction and top-line growth. And third, we know our customers need to consolidate their platforms and vendor relationships to reduce complexity and risk and to drive efficiency. We are delivering on all three at scale today for our customers. Our customers are seeing on average an estimated 25% in savings in their IT costs and 26% increase in employee productivity using Salesforce according to a recent survey of more than 3,500 of our customers.\n\nRBC Wealth Management is a great example. RBC is onboarding new customers in minutes instead of days, and they've consolidated over 26 technology systems into one using our Customer 360 platform, decreasing their maintenance costs by 50%. Despite the economic headwinds that Marc mentioned, we had record-low revenue attrition again this quarter, which is a testament to just how mission-critical Salesforce is to our customers, especially in this environment.  We also launched new product bundles for sales, service, marketing, and analytics. These product bundles are enabling our customers to consolidate their tools on Salesforce, driving efficient growth.\n\nWe're also closing transformational deals and multi-cloud expansions. This quarter, seven of our top 10 deals included five or more of our clouds. Now, let's turn to the cloud performance. Sales Cloud, our flagship, continues to drive sales productivity for the world's most important brands.\n\nSales Cloud grew 12% year over year, a healthy 17% in constant currency, including great customer wins at companies like Bolt, Snowflake, and Thermo Fisher. Service Cloud continues to help our customers deliver exceptional customer service experiences and reduce their customer service costs. Service Cloud grew 12% year over year or 16% in constant currency, approaching $2 billion in revenue for the quarter, with wins at Carl Zeiss, Dell, and Fujitsu. Our Marketing and Commerce Clouds power the digital customer experiences for the world's greatest retailers and browns around the world, and together grew 12% year over year or 18% in constant currency, thanks to wins at companies like Banco Bradesco, Hugo Boss, and Slack.\n\nWe just passed Black Friday and Cyber Monday, and I want to express my gratitude to our engineering teams. Our engineering teams again delivered unparalleled mission-critical reliability and scale to retailers around the world. Even lapping the pandemic, the sales process for our Commerce Cloud in Cyber Week increased 11% year over year. And our Marketing Cloud delivered nearly 49 billion messages in Cyber Week alone, up 21% year over year.\n\nWe've now sent 1.4 trillion messages from our Marketing Cloud so far this year, just incredible. Our platform business, which includes Slack, grew 18% or 22% in constant currency, highlighted by wins at Japan Airlines, WorkSafe, Victoria, and Zoom. Einstein Artificial Intelligence platform is now generating 194 billion predictions every single day across the Salesforce Customer 360 platform, up 57% year over year. And Slack, which now powers collaboration and workflows across the entire Customer 360, grew 46% year over year.\n\nSlack is now handling more than 2.6 billion actions every single day and had great wins this quarter with companies like Rivian and Verizon. Data, which includes MuleSoft and Tableau, continues to be core to every digital transformation at every single one of our customers. Data grew 13% year over year or 16% in constant currency. We're seeing strong demand from MuleSoft, which reaccelerated in the quarter to 19% year-over-year growth or 23% in constant currency, with wins at brands like Western Union, SmileDirectClub, and Kona.\n\nIntegration transactions on the MuleSoft platform grew to $6.7 billion per day, up 33% year over year. Tableau grew at 8% year over year or 9% in constant currency, with wins in the quarter at Inter and McLaren Racing. As a reminder, due to the way we recognize revenue in MuleSoft and Tableau, when the macro environment is difficult, we typically see the effects earlier and more pronounced in these businesses. We're confident in the opportunity ahead for Tableau, and we recently made changes to reaccelerate Tableau growth.\n\nThis includes new leadership, and as importantly, new product integrations like revenue intelligence, a deep integration between Sales Cloud and Tableau that has become one of our fastest-growing add-on products. And finally, as we mentioned every quarter, our industry solutions continue to be a strength in our portfolio, with out-of-the-box processes that enable our customers to achieve faster time to value and lower implementation costs. Even with the many successes in the quarter, we expect this increasingly challenging buying environment to continue next year. I'm confident that, Salesforce has never been more mission-critical to our customers in this environment.\n\nAnd to wrap, I'm so grateful for our employees, our 80 million Trailblazers, and all of our customers and partners for helping lead the way with innovation, agility, and resilience to navigate in these times. And before I pass it to you, Amy, I just want to express my personal gratitude to you. As I became the first-time CEO and you became a first-time CFO navigating the company and navigating our customers through this crisis, I'm so grateful for our relationship and for everything this company has done for me.\n\nAmy Weaver -- Chief Financial Officer\n\nGreat. Bret, thank you. And let me just start by saying to you, it has truly been a joy to work with you for the last six years. I am going to miss you terribly, but I'm also equally excited for you on your next steps, and I know they will be incredible success again.\n\nSo, taking that left turn to our results here. I am pleased to report another quarter of double-digit top and bottom-line growth. Despite increasing macro pressure, revenue grew nearly 20% in constant currency. And as we discussed at our Investor Day in September, it's a new day for profitability.\n\nI'm very proud of our Salesforce team and all of our employees for generating record operating margin during Q3. Reiterating Marc's comments, profitable growth is a major focus as we lean in on best-in-class operational excellence across all aspects of our business. As customers focus on optimizing time to value, driving cost savings, and consolidating platforms and vendor relationships, we remain well-positioned to support them through the current economic environment. Now, to our results for Q3 fiscal year 2023, I'll begin with top-line commentary.\n\nTotal revenue for the third quarter was $7.84 billion, up 14% year over year or 19% in constant currency. Foreign exchange continued to be a headwind to our results, as the dollar further strengthened throughout the quarter. For Q3, the total FX impact was $300 million, approximately $50 million more than we had forecast. A few highlights from the quarter.\n\nAgain, as we outlined at Investor Day, we have three balanced growth pillars: Customer 360 Advantage, industry solutions, and geographical expansion. All of these continue to reflect the growing adoption of our portfolio across our customer base. First, multi-cloud adoption by our customer base continues. Customers with five or more clouds increased ARR by over 20%.\n\nSecond, our industry solution continues to be a strong tailwind to our revenue growth. Seven of our 13 industry clouds grew ARR above 50% this quarter. In some of the highest-performing industries, clouds in the quarter included energy and utilities, manufacturing, and our recently announced Automotive Cloud. Finally, from a geographical perspective, Americas grew 16% year over year, EMEA grew 10%, 23% in constant currency, and APAC grew 14%, which is 30% in constant currency.\n\nAnd as you have heard, revenue attrition in Q3 was again below 7.5%, reflecting the value that our services are providing to the customer base in this tough operating environment. Q3 non-GAAP operating margin was a strong 22.7%, driven by our ongoing focus on disciplined execution, our hiring slowdown, and resource prioritization. Q3 GAAP EPS was $0.21 and non-GAAP EPS was $1.40. Mark-to-market accounting of the company's strategic investments increased GAAP and non-GAAP EPS by $0.02.\n\nOperating cash flow was $313 million in Q3, down 23% year over year; capex, $198 million, resulting in free cash flow of $115 million, down 52% year over year, both driven by lower billings. Turning to remaining performance obligation, which represents all future revenue under contract. RPO ended Q3 at approximately $40 billion, up 10% year over year. Current remaining performance obligation, or CRPO, was approximately $20.9 billion, up 11% year over year and 15% in constant currency.\n\nThis includes one point of incremental FX headwinds beyond our Q3 guidance. And finally, Q3 was a milestone corridor for Salesforce. After announcing our first-ever share repurchase program on the last earnings call, I am pleased to share that we returned $1.7 billion to shareholders during Q3. Before moving to our guidance, I'd like to comment on the current economic environment.\n\nYou recall that last quarter we noted measured customer buying behavior really beginning in July. This led to elongated sales cycles, additional deal approval layers, and deal compression, particularly in enterprise. As Q3 progressed, we saw an even more challenging buying environment, driving intense customer scrutiny on every investment dollar to ensure the highest return possible. During Q3, this behavior was most pronounced in our U.S.\n\nand major European markets, while Japan remains more resilient. From an industry perspective, the most impacted was retail, consumer goods, and communications, and media, while the more resilient for travel and hospitality, manufacturing, automotive, and energy. And from a product perspective, we continue to see customer spending pressure in commerce and marketing. Now, to our guidance.\n\nFirst, on revenue, we are pleased to maintain our fiscal year 2023 revenue guidance of $30.9 billion to $31 billion representing 17% growth year over year or 20% in constant currency despite an incremental $100 million FX headwind since our last call. This raises the total year-over-year FX headwind to $900 million. In addition, our guidance includes flat at slightly above $1.5 billion. As you've already heard, we are deeply committed to expanding our profitability over the long term.\n\nI am proud that we are raising our fiscal 2023 non-GAAP operating margin guidance to 20.7%, an increase of 200 basis points year over year. And this guidance also includes approximately 75 basis points of headwind from Slack. As a reminder, because our regional revenue and expenses are generally in the same currencies, there tends to be a natural FX hedge in our operating margin. For Q4, we expect GAAP EPS of $0.23 to $0.25 and non-GAAP EPS of $1.35 to $1.37.\n\nFor the full year, we expect GAAP EPS of $0.55 to $0.57 and non-GAAP EPS of $4.92 to $4.94. CRPO growth for Q4 is expected to be approximately 7% year over year or 10% in constant currency. This guidance continues to incorporate the more challenging trends in our customer behavior, as previously discussed. We now expect our fiscal 2023 operating cash flow guidance to be approximately 16%, which is at the lower end of our previous guidance, driven by lower billings.\n\nThis includes a three-point headwind from cash taxes associated with tax law changes, requiring the capitalization certain R&D costs. We now expect capex to be approximately 2.5% of revenue for the fiscal year. This results in free cash flow growth of approximately 17% for the fiscal year. Before I close, I'd like to share a few thoughts on fiscal year 2024.\n\nAs discussed, we are experiencing a very unpredictable macro environment as our customers are looking to ensure their businesses are also healthy for the long term. Compounding that dynamic is an unprecedented foreign currency market. Therefore, at this time, we believe it will be pretty sure to provide revenue guidance for the next fiscal year. Now, in terms of operating margin, we are driving operating discipline and following our playbook that Marc discussed to ensure that we are consistently expanding our operating margin in the face of top-line headwinds.\n\nAnd as the leadership team, we're continuing to take a hard look at our cost structure. This is all part of our playbook, and we will continue to take steps that drive profitable growth. Of note, we intend to provide full FY 2024 guidance on our fourth-quarter earnings call. So, to close, we are helping our customers navigate the current macro environment by bringing much-needed efficiencies to their digital strategy with a compelling value case.\n\nOur commitment to disciplined decision-making is unwavering, and we are marching toward our fiscal 2026 target of at least 25% non-GAAP operating margin, inclusive of any capital allocation decision. And as our business grows, we will continue to target returning on average 30% to 40% of free cash flow annually to our shareholders. Now, Mike, should we open up the call for questions?\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nThat's good. Thank you, Amy. Bo, we'll go to Q&A, and we'll take the first question.\n\nOperator\n\nThank you, Mr. Spencer. [Operator instructions] We take our first question this afternoon of Keith Weiss of Morgan Stanley.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nExcellent. Thank you, guys, for taking my questions. Maybe one for Marc and one for Amy. Marc, on the leadership change or Bret leaving, we're also very sorry to see Bret leaving.\n\nHe is a great addition to the team. I guess the good news is there's already a CEO and you set to go. But should we expect a replacement for Bret on a going-forward basis? Are you going to look to go back to that kind of co-CEO dynamic or replace kind of what he was doing on a day-to-day basis with some other executive on a go-forward basis? And then I guess for Amy, at the Analyst Day, you talked about a more back-end loaded operating margin trajectory toward that 25%. Any change in that dynamic given kind of what's going on in the macro environment and seeing kind of the degradation on the top line? Does that push operating margin? Does that sort of push operating margin expansion to the kind of the forefront in any way?\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nWell, thanks, Keith. And I think it's a great question. And obviously, we're still in a little bit of shock and extremely sad and feeling of our loss for losing Bret. Again, I don't have to tell you, one of the best people who we worked with in my life and also just a great person.\n\nAnd I have to also tell you that we have a lot of fantastic people in the company, and Bret's management team, what we call the ELT here at Salesforce, includes some incredible people who have been with us in some cases for decades. And they're some of our most capable and incredible people, and I think you know a lot of them, Keith, very well on a personal level as well. And I couldn't -- I have to tell you, I couldn't be more proud of Bret and everything is done in the last seven years. But while we have a huge light on Bret, I think it would be unfair to not also put a huge light on these other managers and leaders in the company who have done such a great job, whether it's our product leaders or operational leaders, geographic leaders, many of them who you know and have met over the years, whether it was at Dreamforce's or World Tours or at Investor Days, whether it is people who do our impact worker, philanthropy work or human resources, our incredible marketing leaders, many of whom we have such deep personal relationships with because we've done such unbelievable marketing in the company now for so long.\n\nFolks who have joined us after acquiring their companies, and we have many of those folks as well, and which is also how we ended up with Bret when we bought this company, and people who are doing work in core work in our areas like the quality and sustainability, as well as operational leaders, where we've brought in some great new folks recently from organizations who are bringing us a new level of operational excellence. I don't have to tell you, I think we have the finest engineering team in the world, the leaders in engineering, and some of them are what we call boomerangs, people left and didn't find greener pastures, and came back to reclaim their leadership positions and the company are probably the greatest. They don't have to call out my co-founder, who you know very well, Parker Harris, who happens to be in Tokyo today and not on the call because he's running a world tour with our phenomenal team there, delivered what I expect to be shortly the second largest software company in Japan, and on and on and on. But I do want to bring it back to Bret because this is his moment, and I think it's very important that we really send him the appropriate gratitude and also call out.\n\nAnd until he walks out the door, don't worry, I'm trying to keep recruiting them back and I am a good salesman Keith, as you know me very well. And it's not -- the deal is not over until it's over, but we do have to tell you that he has decided to leave. But I tell people all the time, we lose deals all the time, Keith. And for me, I never lose.\n\nI keep going back until I win. In this year -- last -- Brian, how long have you been in the company now?\n\nBrian Millham -- President and Chief Operating Officer\n\nTwenty-three years.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nTwenty-three years. Is that true, Brian?\n\nBrian Millham -- President and Chief Operating Officer\n\nYes, it's true.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nAnd do you feel like this? Yes, you will. Yes. And I'll break them down on -- yes. So, he's in trouble.\n\nAll right. Amy?\n\nAmy Weaver -- Chief Financial Officer\n\nOK, Keith, turning over to operating margin. As I mentioned, we are very committed to being 25% or above by FY 2026. Now we're not giving a guide for at this moment. So, I'm not going to comment on the linearity.\n\nI will say that this is just a huge for the entire company. I think we've really shown that with our current quarter at 22.7%, which is an all-time record high. And this is coming not just from one area or one silver bullet, but really from a commitment and a disciplined approach across all parts of the company, whether it is sales, G&A, marketing, finance, the list goes on, if the group were contributing. One thing that, we're particularly focused on their structural changes.\n\nSo, we've certainly driven down workforce costs by the much more measured approach to hiring that we have had this year. We also look to our cost of goods sold in third-party cost efficient. We tightly prioritize T&A this year to prioritize customer-facing travel. And we are also benefiting from choices that we have made in the panels and continue to review around our real estate footprint.\n\nSo, again, the commitment is here. I'm excited to see where we can go, and I think we're already putting the necessary tools in place.\n\nOperator\n\nThank you. We take our next question now from Mark Murphy of JPMorgan.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nYes. Thank you very much. Bret, happy trails, and thanks for everything. Marc, I wanted to ask you if you think that this volatile environment is going to be fully conducive to remote work -- or do you see some of your employees may be gravitating back a little more to in-office, and Amy relatedly and since you just mentioned it, could you touch on the plans for the real estate footprint, including the Salesforce Tower and the other buildings? And just help us understand maybe how that could contribute to margin expansion.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nYes, absolutely. And First, Mark, I hope that you see that the operating margin in this quarter, which has hit a record level at 22.7%, that we are fulfilling our commitment to you and to others that we are deeply focused on this. And you're 100% right, that there's a lot of things pre-pandemic that we had in our company that are expenses that we don't need post pandemic. Now, in regards to being in the office, well, all of us are in the office today.\n\nAnd there is no remote workers here. And it's an interesting metaphor, but there's companies that I work with very closely. And I have to tell you, someone who's influenced me greatly is the CEO of Honeywell, Darius; and chair -- and the board member, Robin Washington. And he's made a plea for me for many years that he has factory workers and those factory workers still every single day during the pandemic were in the factory.\n\nAnd that it's a very critical part of how he runs this business. And when I have advocated for new kinds of work and folks having the flexibility in their working environment to remember is factory workers. And I think he's absolutely right and 100% correct. Well, I would also say we have factory workers.\n\nNow today, we are the factory workers. The work that we're doing is required here in our factory. And you know where that factory is very well, Mark. You know where we are.\n\nAnd we have different factories, around the world that we call our towers and our hubs and core offices. But I think we also realize, and I think that even Darius would agree with me, that the percentage of folks who are working remotely is going to be higher. So, before the pandemic, the percentage of remote workers for Salesforce was approximately 20%. For other companies now, we're seeing that normalize at somewhere around 50% even with mandatory Workdays.\n\nSo, I do think that we're going to have a rebalancing. I think even at Salesforce, we have what I would call factory jobs, folks that do are required to be here, whether they are doing maybe very core work or even new folks who don't have maybe the tribal knowledge yet or need the mentorship or folks coming in from college who benefit from being in the office. But we're never going back to how it was. We all know that.\n\nI'm sure a lot of you actually are at home right now. And before this, even maybe your companies, especially the banks, especially the New York banks and some of those New York bank leaders who have made him passion, please return to work. But even though many of you who go on to some of those banks, I bet you're not at those offices right now. And I think we are in a new world, and we all realize that.\n\nBut I think that we're finding a new way forward and there will be more in office, and there will be -- but we'll maintain the flexibility to be at home. And I will call out one more thing, which is probably one of the most successful things we've done is come up with new ways to work, and you've probably been down with the Salesforce Ranch, and we'll have about 10,000 of our employees go through that this year in training and collaboration sessions, and we'll find other new ways to work. And that's also one of the reasons why we acquired Slack and I think why we've seen just great growth in Slack, why Slack channels are so important, why you saw the tremendous new multimedia environment in Slack. And we have got quite a few other surprises coming in regards to the integration between Slack and Customer 360 and line of business capabilities and other areas regarding systems of record involving Slack.\n\nAnd all of that's because we're in a new way to work, and we're going to need new tools. So, that's how I look at it, Mark. I'm trying to be straight, honest with you, that you have to have a beginner's mind, and we're finding our way through this. And we're going to have more in work in the office, but we're never going to go back to how it was.\n\nBrian, do you want to talk about what you're doing with your organization?\n\nBrian Millham -- President and Chief Operating Officer\n\nYes, Marc, I appreciate it and certainly don't want to contradict anything that you said, but I just --\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nGo ahead, Brian. Why should -- today, hear me that -- agreed.\n\nBrian Millham -- President and Chief Operating Officer\n\nMarc, I really believe that being together drives more learning, better collaboration, better networking, and better enablement. We have a broad portfolio of products and we saw of the pandemic that we -- there's a lot to learn around the way that we're positioning our products, new organic products coming out, acquisitions that we're positioning our Customer 360 -- to our customers. And so, I really like people coming back in the office. I like that connection that we have to one another, I think, on our culture and how we operate, I've asked my team recently to spend more time in the office.\n\nBut importantly, I've also asked them to spend more time in front of our customers. It's a big differentiation for us when we're out talking to our customers and driving the success that they expect from us. And so, to drive higher productivity and the performance culture and one of the ways, I want to do that to ensure that we're spending more time together, whether that's in the office or out in front of our customers.\n\nAmy Weaver -- Chief Financial Officer\n\nGreat. And so, then Mark, turning to your question about how that may assess our real estate strategy and margin and savings going forward. So, over the past two years, we have continued to reimagine our real estate strategy. That is not only to optimize for scale but also continue hybrid work environment and how people are working and how they're using their space.\n\nAnd this has included reducing our footprint fairly significant right now. Some of that, you see when we do large write-offs over these times, but a lot of it has also been opportunistic. When leases come up, and we don't renew when we consolidate into areas. It's something that we are continuing to benefit from.\n\nIt is also seeing that we are continuing to evaluate. We have a new head of real estate, Relina Bulchandani, who is doing an incredible job along the deeper share and really looking at every aspect of our real estate and say how we use it the best and the most efficiently in this new world.\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nThanks, Mark. Bo, let's go to the next question.\n\nOperator\n\nCertainly. We'll take our next question now from Raimo Lenschow at Barclays.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nGreat. Thank you. I just wanted to -- a question for Brian. As you kind of started diluting already on the initiatives you're taking here, like how should we think about -- what are you seeing in terms of what -- in the field in terms of -- there's macro, but it's also relatively a decent penetration of Salesforce.\n\nLike how do you think this will play out? And how do you see your Salesforce position in terms of sales capacity, etc., which kind of [Inaudible]? Thank you.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nThanks, Raimo, for the question and really appreciate it. Certainly, the buyer environment has changed out there in the market. It's become more measured. But our platform is still mission-critical to every one of our customers out there, and we're seeing that play out in the demand environment.\n\nThe pipeline that we're creating is very healthy in the market right now. The interest in our customers' C360 platform remains very high. We've repositioned our products and our selling teams to sell not just to the CEO but to the CFO, actually, across the entire C-suite. We want to make sure that we're covering off everybody that could potentially say yes or no to a buying process.\n\nWe're going to focus on what we can control. We have plenty of capacity in the market right now. We have lots of AEs that we've hired over the past couple of years. And we want to make sure that we're doing the things that we can to continue to grow market share across the entire portfolio.\n\nWe continue to see multi-cloud expansion. You mentioned that. We think we have a huge opportunity to continue to sell to our existing customers, more of the products that are in our portfolio, both inorganic and the acquired companies that we have. And so, we still see a big opportunity for us to spend a lot of time with our customers, selling the entire product portfolio.\n\nAnd the size of our selling base, the customers that we have still a very big opportunity for us to expand our TAM and execute on our growth strategies.\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nThanks, Raimo. Bo, let's go to next question.\n\nOperator\n\nThank you. We go next now to Brad Zelnick at Deutsche Bank.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nGreat. Thanks so much for taking my question. And Bret, best of luck to you. It's been a pleasure.\n\nMy question is for Marc. Marc, you have a lot of pressure out there from all kinds of investors to drive profitability, including some activists. But paradoxically, it would seem an amazing time to put money to work with all the dislocation of the world creating opportunity. How do you do both at the same time?\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nYes. Thank you, Brad, for the question because I think it's probably what's on my mind every day. And first, before I go to the question, I want to go back to Raimo. And, Raimo, I want to tell you that our thoughts and prayers are with your CEO for a full recovery, and we're so sorry to hear about his diagnosis, and Barclays is such an important partner of ours, but your CEO is so fantastic, and we're thinking of him every single moment right now.\n\nSo, Brad, you're right. We are in a moment here where one of our goals, strong goals, as you can see by these results is to increase our operating margin. And we're not going to do anything that's going to prevent that increased momentum. And as a shareholder myself, that's my thought every single day.\n\nWe also realize we want to reduce dilution. That's also why we're doing our stock buyback. And we've talked about that extensively. It's been extremely important, I think, that we bought back a considerable amount of stock during the quarter, that we, I think, set a goal that we're going to buy back about $10 billion.\n\nAnd I think that we have bought back an extensive amount, I think, over $1 billion in the quarter.\n\nAmy Weaver -- Chief Financial Officer\n\nYes, about 11 million shares, $1.7 billion returned to shareholders this quarter.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nSo, I think that's extremely important as an action. So, reducing dilution is very important to us, an increase in our operating margin is very important to us, increasing our profitability, but this is a massive opportunity. Every company is going through a digital transformation. You and I both know very well, it all begins and ends with the customer, and that's why we're closing these incredible transactions globally.\n\nAt the same time, you know that there's all kinds of opportunities out there, but it has to be balanced and we have to weigh those. And I think some of the transactions that we were able to do in the past, when we're a smaller company, a more tactical company, or maybe some more from the hit from an acquisition perspective, and I think we've done, I don't know, Amy, would you say more than 60 transactions or more.\n\nAmy Weaver -- Chief Financial Officer\n\nYes, 60-70, probably, over the years.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nSo, as we do even the smallest transaction to the largest, it has a different frame and a different calculation. Look, it's one of the reasons why we recruited Mike to the company. He had the background, and you all know Mike from Microsoft because we wanted that kind of financial discipline. Amy and I talked about it very closely.\n\nAs she came in, we spent a lot of time thinking about who we would recruit and as we identified somebody who could guide us specifically in that area, we picked Mike, and this was important. And we've also made other major changes to Amy's team so that she had the best A-team possible. And now when we look at this going forward, we want to do it all. We want to continue to grow revenue, we want to continue to grow our operating margin and we want to look at strategic opportunities.\n\nBut we're not going to do that at the expense of our operating margin. We're going to continue to grow it. And I think you know at Investor Day, we said that we have the short-term goal of 25 points. But I think that the reality is, is that we like to feed our targets, and we're not going to get crazy with you on this call, but we're doing everything we can to make these numbers go up, and we will continue to do that in all these areas that you see and you know the company, as well as anybody who's been inside and outside this company, you know every single part of it.\n\nYou know that we have lots of opportunities, lots of levers, lots of things that we can do. I think that you also watched us very closely through 2008 and 2009. And you can see how we acted then to increase operating margin, and we are going to continue to do everything we can to make this the best company possible, best numbers and also the highest values in the industry, and be an example for others as well.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nThanks, Bret.\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nBo, let's go to the next question.\n\nOperator\n\nCertainly. We'll take that now from Kirk Materne at Evercore ISI.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nYes. Thanks very much. I'll add my best wishes to Bret on his next endeavors. Maybe this one is for Brian.\n\nBrian, you mentioned that the pipeline bill levels still remain healthy. I was just kind of curious if you could talk to us a little bit about industries that are seemingly more impacted for you all due to the macro backdrop and maybe products. And kind of what's your thought process on some of the sales elongation that you've been seeing? I assume that you're not expecting it to change anytime in the near term. But I was just wondering, if you could just talk to us about industries and products, in particular, that might be getting hit a little bit harder or perhaps those that are hanging in there better than others? Thanks.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nYes. Thanks for the question. I think starting with the ones that are hanging in there better. Travel and hospitality was a strength for us in the quarter.\n\nOur manufacturing industry really bounced back this quarter and was very good. Automotive was very strong for us in the quarter, and energy was also quite strong. On the other side, we felt a little bit of pressure on our tech industry right now and great relationships and big customers there, but that's an industry that we did not see acceleration in the quarter. And some of the other industries were sort of flat.\n\nFinancial Services, as an example, was relatively flat in the quarter. And so, one of the strengths that we did have, though, I will say, is our industry clouds. And the more investment we make in our industry cloud, we're seeing acceleration there, very good growth in the quarter as we invest in those products, we're seeing great penetration. We're seeing higher close rates.\n\nWe're also seeing better retention rates, which is obviously very important to us as we think about the customer success of our base. we're able to get deals done faster speaking to customers' language and showing up with products that match up to their requirements very well. And I'm sorry I missed the other part of your question. If you wouldn't mind repeating it.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nJust any products that you'd call out, and we obviously see the revenue, but I was just kind of curious on a bookings basis.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nYes. And I think as Marc mentioned earlier in his commentary about some of the products that get cut early in a downturn, marketing spend would be one that we see impacted fairly early on marketing automation. CEOs make quick action, and that's a quick action, and that's a quick place to sort of pull back on marketing. We did see less expansion on sales and service in the quarter on incremental users as our customers started to maybe do a little less hiring.\n\nMaybe they paused hiring we saw less expansion on the Sales Cloud users and Service Cloud users. And certainly, Commerce has been one where we had a great run-up over the past couple of years during the pandemic, and we've seen a bit of a slowdown on Commerce. And so, those would be a couple of examples of some of the products that are seeing a bit of headwinds in these times.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nThere's been kind of interesting anecdote there around commerce. In our Commerce Cloud, obviously, we have blowout numbers in Cyber Week despite lapping the pandemic, but it was interesting, commerce page views were up 14%, but commerce orders were only up 2%. So, you can see not only our customers' impact, but even the consumer behaviors becoming more measured, and we're obviously a B2B company, but all consumer companies are seeing this right now and sort of doing more or less and a lot of people browsing for products and buying a little bit less than they did last year, which I thought was very interesting.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThat's great.\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nGreat. Thanks, Kirk. Bo, let's take our last question now.\n\nOperator\n\nCertainly. That last question will come from Sarah Hindlian-Bowler at Macquarie Capital.\n\nSarah Hindlian-Bowler -- Macquarie Capital -- Analyst\n\nGreat. Thank you so much. I really appreciate you squeezing me in. And I'll add my congratulations and best wishes to you, Bret.\n\nHopeful that you have an incredible opportunity in front of you. This was a question for Amy. I think one topic that we touched on, you mentioned briefly on the call where your retention rates, which continues to be a great way to add revenue that's really high margins. So, maybe we could drill down into that a little bit, what you're doing to drive your retention rates higher, and maybe how some of the product bundling or suite strategy plays into that would be helpful as well.\n\nThanks, Amy.\n\nAmy Weaver -- Chief Financial Officer\n\nSo, Sarah, let me start by saying, it's great to have you back as a covering analyst for our stock and to hear your voice on this call. Yes, on attrition or retention rates, I'm really, really pleased to see where we were this quarter. Again, record lows. I think it says so much about our team to support that, but also our customers and their occasion to us and the size of sales force has become so mission-critical.\n\nI'm actually going to turn this over to Brian because if there is an expert in the company on attrition and what we're doing for our customers, it's Brian. So, Brian, do you want to add anything?\n\nBrian Millham -- President and Chief Operating Officer\n\nAmy, thank you. I appreciate it. I'll quickly address it. Thank you, Sarah, for the question.\n\nFirst of all, I think it's part of our heritage, our DNA, as customer success is the core value of ours, and we own it across the entire company. So, it's not just the success teams with services teams that the entire organization from product to our financial teams. Everyone owns customer success. We've made some investments in the way that we go to market touching our customers more frequently from a success perspective and the motions that we're running.\n\nAs I mentioned earlier, customers from the industry cloud perspective, where we're seeing better adoption rates there and better usage. We've also made some strategic investments in our own services organization alongside a great ecosystem of partners as well that are driving better implementations upfront, faster time to value for our customers, and better results from a customer success perspective. And some of the motions that we're running that are new, great leadership under a gentleman named Jim Roth, who's running our success organization; Lori Steele, who joined us to run our services organization and now has turned over the reins to Mark Wakelin, doing great work with our customers, very oriented to speed to value and ensuring they're getting tremendous customer success on our platform.\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nGreat. Thanks, Sarah. And thank you, everyone, for joining the call today, and we look forward to seeing everyone over the next few weeks. Take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nAmy Weaver -- Chief Financial Officer\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nBrian Millham -- President and Chief Operating Officer\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nSarah Hindlian-Bowler -- Macquarie Capital -- Analyst\n\nMore CRM analysis\n\nAll earnings call transcripts"
}