{
  "companyName": "AT&T;",
  "companyTicker": "T",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/att-t-q3-2022-earnings-call-transcript/",
  "content": "AT&T (T -0.22%)\nQ3 2022 Earnings Call\nOct 20, 2022, 8:30 a.m. ET\n\nOperator\n\nThank you for standing by. Welcome to AT&T's third quarter 2022 earnings call. [Operator instructions] As a reminder, this conference is being recorded. I would like to turn the conference call over to our host, Amir Rozwadowski, senior vice president, finance, and investor relations.\n\nPlease go ahead.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThank you, and good morning, everyone. Welcome to our third quarter call. I'm Amir Rozwadowski, head of investor relations for AT&T. Joining me on the call today are John Stankey, our CEO; and Pascal Desroches, our CFO.\n\nBefore we begin, I need to call your attention to our safe harbor statement. It says that some of our comments today may be forward-looking. As such, they're subject to risks and uncertainties described in AT&T's SEC filings. Results may differ materially.\n\nAnd as always, additional information and earnings materials are available on the Investor Relations website. With that, I'll turn the call over to John Stankey. John?\n\nJohn Stankey -- Chief Executive Officer\n\nThanks, Amir. Good morning, everyone. This morning, we shared our third quarter results, which yet again demonstrate our strong execution and delivering critical connectivity services to our customers. Earlier this month, we saw just how vital these services truly are.\n\nIn the devastating aftermath of Hurricane Ian, the ability to connect with others proved to be invaluable to so many people. And our teams were yet again, some of the very first to arrive on the scene working tirelessly for our customers. The effort they made, along with first responders, supported by FirstNet, to keep our network running in some of the hardest-hit areas was nothing short of heroic. I'm really grateful for their sacrifices and all of AT&T is proud of their efforts.\n\nI'd also like to say thank you to our teams for their solid execution in deploying our mid-band 5G spectrum and building out best-in-class fiber-based access solutions. As you can see from our results, we continue to deliver strong customer growth on the back of our focused 5G and fiber strategy. The demand for fast and reliable 5G and fiber is at an all-time high, and our disciplined and consistent go-to-market strategy continues to resonate. In addition, as we begin to lap investments we need to optimize our networks, improve our distribution, and transform our business, we're now seeing the benefits of our growth fall to the bottom line as we suggested they would and as evidenced by accelerating adjusted EBITDA growth.\n\nLet me dive in a bit. In mobility, we posted another strong quarter of growth by adding 708,000 postpaid phone net adds. As I stated in prior quarters, our consistent results are being driven by an improved value proposition, better network experience, and our ability to meet our customers where their needs are. We're creating efficiencies through our distribution and acquisition costs are improving.\n\nThis is helping us drive further gains in operating leverage. This past quarter, our teams delivered across three key performance measurements, strong postpaid phone net adds, accelerating ARPU growth, and higher mobility EBITDA. In fact, the third quarter marked our highest wireless service revenue growth year over year in more than a decade, and we now expect to achieve wireless service revenue growth at the upper end of the 4.5% to 5% range. This is about 200 basis points higher than where we expected to land at the start of the year, thanks to continued net add strength and ARPU growth.\n\nNow let's jump to fiber, where we continue to invest in building out a premium network and deliver on our stated expectations for steady customer growth. The success of our strategy is evidenced by the fact that we just posted our 11th straight quarter with more than 200,000 fiber net adds with 338,000 net adds this past quarter. We're finding success in serving more customers in new and existing markets with what is the best wired Internet offering available. We're increasing share in our fiber footprint in converting more IP broadband Internet subscribers to fiber subscribers.\n\nThis is driving favorable ARPU trends and profitable growth within our overall consumer wireline business. Ultimately, our fiber strategy is a long-term play, centered around a best-in-class network technology with a multi-decade lifespan. When others finally decide they need to upgrade their infrastructure, we will already be providing our customers with great service and sustainable technology. Simply put, where we have fiber, we win.\n\nAnd the numbers show we expect to keep winning. So let's step back for a minute and take a look at what we've done so far this year across three quarters. We've achieved what we expect will be an industry best with more than 2.2 million postpaid phone net adds. Additionally, our teams are deploying our mid-band 5G spectrum quickly and efficiently, and the spectrum assets we're rolling out are performing even better than our high expectations.\n\nAs a result, we've achieved our already increased year-end target of 100 million mid-band 5G POPs and now expect to reach more than 130 million people by the end of the year, nearly double our expectations when we entered the year. This progress is benefiting our customers as well. In fact, since the start of the year, our already consistent download speeds have increased materially as a result of our mid-band deployment. We're also approaching 1 million AT&T fiber net adds for the year, and we've added nearly 2.3 million fiber locations through three quarters to bring our total customer locations to 18.5 million.\n\nThis keeps us on track to achieve our target of 30 million plus locations by the end of 2025. In summary, I'm very happy with the strong, high-quality, and durable customer adds, network enhancements, and improving financial returns we're seeing across our twin growth engines, of 5G and fiber. Moving to our next priority. It's more important than ever that we be effective and efficient across our operations.\n\nWe continue to have strong visibility on achieving more than $4 billion of our $6 billion transformation cost savings run rate target by the end of this year. As I said earlier, we're beginning to see savings start to contribute to the bottom line. We're transforming our business as the world continues to face what feels like a period of uncertainty. Many of the economic trends that we spoke about at the start of the year and the assumptions that we've been operating under are now coming to fruition.\n\nThis is one reason why we focus so intently on reorienting our business, whether it was asset dispositions, investing in cost transformation, or our proactive decision to address rising inflation through a measured pricing strategy. As a result, our balance sheet has improved, our network performance continues to get better, and we're now seeing some benefits to our profit trends. This is a direct result of acting when we did and how we did it. Our third quarter results demonstrate that our business can deliver even against the challenging backdrop.\n\nThe current environment is not easy to predict, but our flexibility affords us the ability to meet or surpass all of our financial commitments while investing in the best technology available. Now turning to our capital allocation strategy. The long-term economic justification for our investments in 5G and fiber remains fundamentally sound and we're continuing to invest through this cycle to support future growth. These investments will prove to be the foundation of AT&T over the next few decades.\n\nWe feel confident our approach will prove to be increasingly beneficial with each passing year as data demand and traffic continues to grow dramatically. Our strength and focus on core connectivity is helping us meet customers' needs, and we're growing mobility and fiber subscribers in a disciplined and profitable manner, quarter after quarter after quarter. This makes me very comfortable with our ability to continue improving the cash yields of our business going forward. Our free cash flow for the quarter was in line with our expectations despite higher third quarter capital investment spend, and we're on track to deliver on our previously stated $24 billion capital investment plan for the year.\n\nAt the same time, we hope this healthy free cash flow for the quarter gives you confidence in our ability to achieve our target for free cash flow in the $14 billion range for the year, a level that is more than ample to support our $8 billion dividend commitment. Before I turn this over to Pascal, allow me to finish with this. Our results demonstrate the strategy we put forward more than two years ago is the right strategy for not only the future of our business, but for the future of the communications industry. We're focused on creating sustainable and scalable businesses that drive a free cash flow flywheel for many years.\n\nWe continue to hold ourselves accountable for earnings growth against our historic levels of investment, which you'll see through improved cash conversion moving forward. We're confident that the investments and choices we're making will benefit our customers and shareholders now and in the future, while also setting the stage for our next act as America's best broadband provider. Let me now turn it over to Pascal to discuss the details of the quarter. Pascal?\n\nPascal Desroches -- Chief Financial Officer\n\nThank you, John, and good morning, everyone. Let's start by taking a look at our subscriber results for our market focus areas on Slide 5. Our consistent mobility strategy remains successful as we delivered 708,000 postpaid phone net adds in the quarter. Since we began our transformation 9 quarters ago, we've delivered nearly 7 million postpaid for net adds along with improved ARPU.\n\nLooking at AT&T fiber, we totaled 338,000 net adds in the quarter. This marks our second-best quarter ever. Our plan in consumer wireline remains centered on pivoting from a copper-based product to fiber, and we're doing just that. Over the past 9 quarters, we've gone from 4.3 million AT&T fiber subscribers to now approaching a subscriber base of 7 million.\n\nSo we're really pleased with the momentum we have with customers in the marketplace across mobility and fiber. Now let's move to our third quarter consolidated financial summary on Slide 6. First, as a reminder, with the closing of the Warner Media transaction in April, historical financial results have been recast to present Warner Media and certain other divested businesses, including Rio, Xandr, and Playdemic as discontinued operations. Additionally, there continues to be some year-over-year comparative challenges as the prior-year results also included DirecTV for one month and other 2021 dispositions for a partial quarter.\n\nTherefore, where applicable, I will highlight our financial results on a comparative like-for-like basis. Comparative revenues for the quarter were $30 billion, up 3.1% or more than $900 million versus a year ago. This is largely driven by wireless revenue growth and to a lesser extent, higher Mexico and consumer wireline revenues. This was partly offset by a decline in business wireline.\n\nComparative adjusted EBITDA was up nearly 5% year over year as growth in mobility, consumer wireline in Mexico were partly offset by a decline in business wireline. We expect the year-over-year EBITDA trend line to improve for the balance of the year as we continue to grow our wireless and fiber customer bases and lap 3G network set down costs and stepped up investments in technology that began in the second half of 2021. Adjusted EPS from continuing operations for the quarter was $0.68, on a comparative stand-alone AT&T basis, adjusted EPS was $0.62 in the year-ago quarter. The quarter also includes a recurring favorable impact of about $140 million to adjusted EPS from retirement medical benefits plan change.\n\nFor the full year, we now expect adjusted EPS from continuing operations to be $2.50 or higher. Cash from operating activities for our continuing operations came in at $10.1 billion for the quarter, up 9% year over year. Capital investments of $6.8 billion was up $1.3 billion year over year, and we continue to expect capital investments in the $24 billion range for the year. Free cash flow was $3.8 billion.\n\nDirecTV cash distributions were about $1 billion in the quarter. Overall, we remain on track to achieve or surpass all of our previously shared financial targets for the year. Now let's take a deeper look at our communications segment operating results, starting with mobility on Slide 7. Our mobility business continues its strong subscriber momentum and positive profitability trends.\n\nRevenues were up 6%, with service revenue growing 5.6% driven by subscriber growth. Mobility postpaid phone ARPU was $55.67 up $0.86 sequentially and 2.4% year over year. This continues to come in ahead of our expectations. This is largely a result of benefits from our targeted pricing actions, improved roaming trends, and more customers trading up to higher-priced unlimited plans.\n\nWith regard to EBITDA, we delivered our highest mobility EBITDA ever. Year-over-year mobility EBITDA increased 5.5%, driven by wireless revenue growth. We remain confident that mobility EBITDA growth will continue to accelerate through the balance of the year due to revenue growth and the lapping of 3G network shutdown investments that began in the second half of 2021. So we're really happy with our mobility performance and our consistent strategy is yielding great results.\n\nNow let's turn to our operating results for consumer and business wireline on Slide 8. Our fiber growth remains strong, and we continue to win share where we have fiber. Our total consumer wireline revenues are up again this quarter even with continued declines from non-fiber broadband services. Broadband revenues grew 6.1% due to fiber revenue growth and higher broadband ARPU driven by customer mix shift to fiber.\n\nOur fiber ARPU was $62.62 and we expect that to continue to improve as more customers roll off legacy promotional pricing and on to simplified pricing constructs. Looking forward, remember that seasonality in the fourth quarter typically results in lower industry net adds. We expect EBITDA growth to remain strong on a year-over-year basis for 2022. This will be driven by growth in broadband revenues and the lapping of technology investments that began in the second half of 2021.\n\nLooking at business wireline. We continue to restructure and rationalize our portfolio with a focus on core connectivity where we have owners economics. In this regard, we continue to grow our connectivity services revenue as both 5G and fiber offerings continue to perform well. Our enterprise mobility momentum remains strong with business wireless service revenue growth of 7.9% and a sequential increase in our FirstNet wireless base of $334,000.\n\nAdditionally, we had about $100 million in revenue from intellectual property transaction in the quarter. This is about $80 million more than the prior year. For context, this is an action we've taken in the past when favorable opportunities to rise. Now I'd like to quickly touch on our capital allocation strategy.\n\nOverall, our priorities remain unchanged, and we're largely past the heavy lift of reorienting our company's focus on our core connectivity strengths. As a result, we've established a more sustainable financial structure that better positions us for the current environment. We also have enough flexibility to invest in our business while meeting our financial obligations. In the third quarter, the $3.8 billion in free cash flow we delivered was largely in line with our expectations.\n\nAnd given the expected timing of our capital investments, we feel good about our line of sight to achieving our free cash flow target in the $14 billion range for the year. We are very comfortable with our cash levels after paying our dividend commitment, and this should only increase in the future years as we expect cash conversion to improve from here. Our results today have only further solidified our confidence that we will exit 2022 stronger than we entered the year. In fact, we continue to expect EBIT growth and higher free cash flows in 2023.\n\nWe also plan to continue to use excess cash after dividends to reduce debt with a goal of reaching a net debt to adjusted EBITDA range of 2.5 times and as we typically do, we'll provide 2023 guidance when we share our fourth quarter results. Amir, that's our presentation. We're now ready for Q&A.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThank you, Pascal. Operator, we're ready to take the first question.\n\nOperator\n\nOf course. [Operator instructions] Our first question today comes from the line of Phil Cusick with J.P. Morgan. Please go ahead.\n\nPhil Cusick -- JPMorgan Chase and Company -- Analyst\n\nHi, guys. Thank you. Short and sweet, I love it. I guess first, Pascal, the free cash flow bridge to $14 billion, just to reiterate.\n\nHelp us think about that as we go into the fourth quarter, you need at least $6 billion. And you said capex, it sounds like it's coming down. That's a good part of it. And then as we think about next year for what you can give us, how should we think about things like taxes, pension as well as the industry overall.\n\nAnd I know you don't want to update it, but given how much the world has changed, is that $20 billion free cash flow guide even relevant anymore? Thanks very much.\n\nPascal Desroches -- Chief Financial Officer\n\nHey, Phil. I appreciate the question. Good morning. Maybe let's start with regard to the $14 billion for this year, the simple way to think about it, we delivered $3.8 billion this quarter.\n\nAnd that is when we spent $6.8 billion in capital. Next quarter, we reiterated our guide for the full year of $24 billion. So next quarter, that would suggest around $4.5 billion. And so you do the simple math, that gets you exactly where you need to get to for the full year.\n\nAnd as a general matter as well, the fourth quarter -- the back half of the year, we always convert at a higher rate than the first half of the year. So all in all, great line of sight. In terms of next year, you mentioned the macros. That is the very reason why we are not providing updated guidance right now, and we're going to stick to our -- what we communicated last quarter and that we'll update you at year end when we report our fourth quarter results.\n\nWith that said, as you heard from my prepared remarks, we expect EBITDA and cash to grow net -- free cash flow to grow next year. In fact, we just look at this past quarter, we grew cash continuing nearly 10%. So it's really strong growth -- organic growth from the business, and this is exactly what we anticipated coming into the year. What are the factors that are going to drive improved earnings and cash next year.\n\nMobility. Mobility business is performing much better than we expected coming into the year. Subscriber base is bigger than we anticipated and ARPU trends are better. Two, fiber.\n\nAgain, fiber is performing really well. and the mix shift that we're seeing to fiber comes with higher profit margins, higher ARPU. So that's also expected -- consumer wireline expected to grow next year. We should see some moderation in the overall business wireline trends because of the cost efforts that we are undertaking.\n\nAnd then you layer on top of that things like transformation savings more broadly, starting to fall to the bottom line as our investments begin to have pit and begin to dissipate over time. And lower interest is another factor to keep in mind as we delever. And then all that is going to be partially offset by higher cash taxes. Magnitude, I'd say, is consistent with what we've previously guided and then slightly less DTV distributions.\n\nAll in all, we feel really good about the trajectory of the business. And when you look at an annual dividend commitment of $8 billion and a growing free cash flow, the model is working exactly as we anticipated.\n\nPhil Cusick -- JPMorgan Chase and Company -- Analyst\n\nThanks, Pascal.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThanks very much. If we can move on to the next question.\n\nOperator\n\nOur next question comes from the line of Brett Feldman with Goldman Sachs. Please go ahead.\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nYeah. Thank you for taking the question and really just sort of two here on fiber. The first is it's great to see that the fiber net adds continue to gain momentum. You now have a larger fiber broadband subscriber base than non-fiber, but you haven't quite turned the corner sustainably yet on net positive broadband growth.\n\nAnd so I was hoping you can comment on how you see the path unfolding there. And do you just need a bigger fiber footprint to get there? And then the follow-up on that question is there was a report yesterday you're considering a potential fiber JV. I'm sure you're somewhat limited on what you can say. So the higher level question would be your existing fiber build is being completely funded out of your cash flow from operations.\n\nSo if you were looking to do something incremental, including with a partner, what kind of boxes would you have to check? Is this about speed or breadth or potentially something else? Thank you.\n\nJohn Stankey -- Chief Executive Officer\n\nHi, Brett. I appreciate the question. Certainly, a bigger fiber footprint allows us to improve our relative net add performance in broadband. I think the short answer to your question is for the next several quarters will be in this dance around what I would call, at least on the subscriber counts, something close to near zero.\n\nBut you ought to understand as Pascal just indicated to you, our yields on fiber customers are, of course, much better than our copper customers, combination of ARPU, churn characteristics and frankly, the operating performance profile, which I know you've observed that there's still room for our margin expansion in the consumer wireline business and that we should be looking at that relative to others in the industry. And I think that's an accurate observation over time as we continue to scale the business that will continue to improve profitability in it. But we still have several quarters of working through the dynamic of getting the legacy dynamics out of the business and focusing on the new infrastructure and the growth and that's a journey we're committed to. And I think you're seeing that it's got strong economic promise as we move through that and continue to increase the size of the fiber base I don't know that I could add a whole lot to you on your question about what we might think about in terms of doing other fiber builds that are out of our operating territory.\n\nFirst of all, I'm not going to acknowledge your comment specifically on some of the speculation that's shown up in the media. But I think I have shared most recently when I was in Arizona, and we were doing the work in Mesa, that we're evaluating it under many of the same criteria and circumstances that we look at within our existing operating footprint. Number one, can we go in and be the first fiber provider in an area; two, do we believe it's a market where the brand is going to perform, and we'll get the rate and pace of penetration that we need to make an economic return on it; three, can we build because of the dynamics around the particular municipality or area cost effectively and quickly with a relatively low overhead around that and get what I would call an operating scale in that geography that warrants the fixed cost infrastructure start-up. And then finally, do we think that there's some interplay in terms of having the asset and improving value in our wireless business as we operate in the area as well, and it marries into our distribution.\n\nSo to the extent that we found opportunities like that, that had as competitive returns is building in our region, I think the management team would have to evaluate those types of things and think about how it moves forward on them. And I would tell you, as I've indicated as well, that there will be some federal subsidy monies coming in, in places, and we should use that same sort of criteria in that same model as we think about are there opportunities for us to pair our capital with possibly public capital to open up opportunities that we might not have pursued otherwise.\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nThank you.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThanks very much.\n\nOperator\n\nOur next to the line of Simon Flannery with Morgan Stanley. Please go ahead.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nThank you very much. John, you opened your comments mentioning the world faced a period of uncertainty. You've been looking at that for a little while. It would be great if you could and Pascal update us on what you're seeing real time both on the business side in terms of cutting back IT budgets, etc., and how that may evolve over the next few quarters as they deal with some of the stresses from inflation demand? And then on the consumer side, obviously, you've called out the DSO issue last quarter.\n\nGood to hear the free cash flow reiterated this quarter. So perhaps you could update us on payment trends on bad debts and how we should think about churn here as your sort of pricing increases sort of mature going forward? Thanks.\n\nJohn Stankey -- Chief Executive Officer\n\nSure. Simon, why don't I start and then Pascal is welcome to add any color they think they don't treat appropriately here. Look, on the business side, one is I would tell you, I think the overriding dynamic in business is actually somewhat disconnected from the economy, and that is we're in a secular change to cloud and we're in a secular change to SDN. And we've talked about that, and I've talked about it, and it's one of the reasons we're repositioning the business segment.\n\nAnd I think it's one of the reasons why us making sure that we are very careful in how we deploy owned and operated infrastructure that we can handle business workloads on is so important to us. When we think about that dynamic, we actually play very well into an efficiency story for most established in large businesses. And it's a little bit of a painful transition, but over time, we'll get through it, and there'll be a side back in the core connectivity business on owned and operated infrastructure. And that's simply the private networks that we had previously put out that were highly managed and highly architected are now moving to SDN-based technologies that are less managed but more bandwidth intensive.\n\nAnd we want to play into the uplift on putting more bandwidth intensive infrastructure out there and selling those connections on owned and operated infrastructure but the enterprise gets an efficiency benefit out of SDN because those less managed networks are not as costly to them on an aggregate basis. And so I don't think the move from an economic perspective, if there are budgets that are strapped is necessarily going to impact that transition, if it did anything, it might slow it down a bit. If it slowed it down, it would probably, frankly, be somewhat beneficial to us because margin structures on existing architectures are a little bit more attractive than on new infrastructure. But if ultimately people view it as an efficiency move and they want to run their businesses more efficiently, I think those trends are manifested in what you've seen over the last several years in the business, and I don't know that they will necessarily adjust as a result of that.\n\nIn the small business side, certainly small business formation can be hit during a down economic cycle. And I would expect that in the business segment that might be something that we ultimately see occur if there's a more moderate economic growth environment. But once again, unfortunately, for us, we're under-indexed in the small business segment. We're working to change that, and we're demonstrating progress in that regard, but my embedded base of subscribers in that area for what we do in advanced networking is not as strong in the fixed market as I might like it to be.\n\nSo I don't know that we'll be overly impacted by that. We could see some softness in the wireless space if, in fact, the economy ultimately did had a little bit harder sledding moving forward that might moderate some wireless growth. But look, we've been getting more than our fair share in that segment. A lot of it's been driven out of FirstNet.\n\nI don't expect that trend didn't necessarily abate right now even in a down economic cycle. Relative to some of your other questions on other economic characteristics and how it impacts the business, we've seen no change in DSO relative to last quarter. We are back to pre-pandemic levels. We characterize that for you last quarter.\n\nThere hasn't been any additional slip. We, I think, accurately reflected to you in our guidance what the impact was going to be for the year. Last quarter, that's still tracking consistently with what we articulated to you. We're seeing bad debt start to return back to pre-pandemic levels.\n\nCertainly, we'll have to watch that if the economy sours further. It tends to correlate to what occurs in the economy, but I see nothing right now that would suggest we're out of pattern on anything. We certainly haven't done any change credit standards in our approaches and practices to managing credit quality. And I think you've seen how we performed in the past in that regard where we have a high-quality base that allows us to kind of manage through those dynamics reasonably well if the economy goes one way or the other.\n\nAs I characterized earlier today in some of my public comments, turns up a bit. It's not out of line with what we expected when we did the pricing changes. We were able to execute the pricing change in a way that we feel very comfortable with, most importantly, the vast majority of our customers are talking to us. They're making adjustments to their plans, moving them into higher-value plans while having higher ARPUs on them, return more value to the customer that allows them to be a stickier and longer live customer.\n\nWe think that over the long haul is great. On the margin, there has been some churn moving out that we expected. It's no greater than what we expected. It still makes the pricing changes accretive overall, and you certainly have seen that manifested in the numbers and the operations that have come forward.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nRight. Thank you, John.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThanks very much. If we can move to the next question.\n\nOperator\n\nAnd our next question comes from the line of John Hodulik with UBS. Please go ahead.\n\nJohn Hodulik -- UBS -- Analyst\n\nHey. Great. Thanks, guys. You guys have some real momentum in wireless in terms of subs, ARPU, and now our margins.\n\nI mean just give us a sense for what kind of visibility you have that those three metrics continue to head in the right direction. And then as a follow-up, with the broadband fiber expansion and potentially the balance [Inaudible] any change in the view on fixed wireless. Obviously, both Ryzen and T-Mobile having a lot of success in selling that product. Just your view on that as we head into 2023.\n\nThanks.\n\nJohn Stankey -- Chief Executive Officer\n\nSo, John, I think our visibility is really good. I mean we run a subscription-based business. And as you know, those customer relationships tend to be pretty sticky relationships. And we have every ability to understand how we're bringing the customer and today and at what profitability level they're coming in.\n\nWe understand the base and how the base is performing. I think we have reasonable ways to look at some of the dynamics that changed around things like roaming and have visibility toward those impacts and how they're going to work through. You just heard my commentary with Simon on some of the bigger drivers of profitability in the subscription business around churn and how we think about the dynamics associated with that. So when I look at our ability to kind of understand why we're getting operating momentum, we communicated to you at the beginning of the year that you should expect the back half story on this, and you're seeing the back half story.\n\nAnd now we're in the middle of the fourth quarter right now. We're obviously aware of what our numbers are right now. And I would say we have confidence that we're going to be able to deliver those continued leverage dynamics that we talked about. So I feel pretty good about our visibility on that subscription base and we've built a quality subscription base and brought in quality customers that are now starting to give us that profitability lift as well as we have visibility into our cost structure and all the work that we've done around that.\n\nAnd as I've said, since the beginning of the year that we would start to see some of that move to the bottom line as we stabilized our promotional position in the market, which I think you've seen us do, and we are still maintaining market momentum with that. And so I feel really good about it. I don't know that anything has changed in fixed wireless. As I said, repetitively that it has a place in our portfolio.\n\nThat place is not broad-scale deployment in every operating territory and geography that we operate in. We-the way I would characterize it, I'd rather take 1 million new fiber customers a year than 1 million new fixed wireless customers a quarter. The value equation of those 1 million fiber customers is a far superior value equation for the long haul for our shareholders. And as a result of that, we're focused on ensuring that we can continue to grow our fiber footprint and bring on those high-value, sustainable durable relationships where we're able to have a network infrastructure that matches consumer consumption dynamics now and into the future.\n\nFixed wireless will be that answer in a small number of geographies and applications and homes. It will not be to our entire nationwide base. And so investing shareholder money at the front end right now just to drive top-line growth that I don't think is sustainable over a three-, four-, five-year period, is not the best use of my management team's time and the best use of our scarce capital. The best use of it is to put it against putting in durable infrastructure, continuing to bring on high-value wireless customers, build our wireless network to be really effective in the next set of applications that are going to be necessary to bring the promise of 5G to life as we start to see the dynamics of autonomy and vehicles emerge, some of the medical monitoring capabilities, private 5G that starts to work into the enterprise space.\n\nWe want our wireless network to be ready to service those workloads and do it in a pristine fashion because we think those revenues will come back with the kind of margin characteristics that we've typically operated the wireless business at. And so I feel really comfortable with our balance about that, and we'll use fixed wireless as we move into next year, where it's appropriate to use it, but it will not be broad scale. Pascal, did I miss anything from your perspective there?\n\nPascal Desroches -- Chief Financial Officer\n\nNope.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThanks very much, John. And we can move to the next question.\n\nOperator\n\nAnd our next question comes from the line of David Barden with Bank of America. Please go ahead.\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks so much for taking the questions. I guess a couple if I could. I guess the first question, Pascal.\n\nCould you talk a little bit about how the interest rate environment is affecting the income statement. I guess, specifically with respect to probably two items. One is the fixed versus floating. And the other would be how the net impact on the pensions is being affected in terms of discount rate for the PBO and then, obviously, the impact on returns in the portfolio.\n\nI guess the second piece I would ask would be on the wireless business. Obviously, the DISH wholesale arrangement was expected to be kind of a big contributor or a tailwind as we go into the year. Could you just talk about how, if at all, that's affected this year's performance to date and how we might expect that to evolve? Thanks.\n\nPascal Desroches -- Chief Financial Officer\n\nIn terms of first, the interest rate environment, one of the things that we did, Dave, over the last two, three years is to really reconstruct our maturity towers and took advantage of historically low-interest rates we were seeing coming out of the pandemic. As a result, right now, we have a debt tower -- a series of debt outstanding that are yielding around 4% on average. And 95% of it is fixed. And if you look at our maturities over the next several years, our free cash flows after dividend could largely handle those.\n\nIn the instance that there are slightly higher towers, we can always roll on a short-term basis. But what we've done is we've reconstructed the way we are managing capital such that we can really continue to delever over the next several years without any meaningful need to go out to the market to raise debt. So that interest rate. In terms of pension mark-to-market, in terms of pension, big picture from a cash standpoint for the foreseeable future, let's talk the next decade, there's probably no need to fund the pension plan.\n\nNow with that said, there is with the discount rate coming down. We've had some going up. We've had some big gains that we normalized out of our reported earnings. On a -- going through next year, I would expect higher pension expense because of the fact that now we have -- we're going to be discounting at higher interest rates.\n\nBut all in all, those are noncash pieces that when we think about the long-term profile of operating this company. The fact what's most important to us is that there is no need to go fund the pension plan for the foreseeable future. And in terms of the DISH MVNO, it's not a meaningful contributor this year. We would anticipate as we look out the next several years, it should ramp up, and we feel really good about the overall arrangement with this.\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nThanks so much.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThanks very much, David. Operator, we can move to the next question.\n\nOperator\n\nOur next question comes from the line of Michael Rollins with Citi. Please go ahead.\n\nMike Rollins -- Citi -- Analyst\n\nThanks. Just to dig in a little bit more to wireless. In the presentation, it was flagged that the business wireless service revenue grew 8% year over year, and I think the total was around 6%. So curious, if you can unpack a bit more of the differences in trends that you're seeing between the business side of wireless and the consumer side of wireless? And then as you're talking about the next stages of 5G and the opportunities, I was reading in the press release that you're flagging the success of IoT and connected device volumes.\n\nI'm curious if you can unpack that a little bit more in terms of, I think the automotive industry was one place you referenced in the release on success. Where are you seeing success in those verticals? And are you seeing any kind of inflection in the near to medium term where this B2B IoT opportunity could become more expensive for AT&T in the industry?\n\nJohn Stankey -- Chief Executive Officer\n\nSure, Mike. Let me see if I can get at your first question. I think I understand what you're looking for. If I don't quite hit this, then feel free to follow up with me.\n\nBut look, there's no two businesses or alike is the first thing I'd tell you. And so as you look at kind of how you would characterize the relative profitability of a business subscriber coming on, a lot depends on which segment you're looking at. I would tell you, generally speaking, our highest ARPU dynamics tend to occur in the consumer market when you kind of look at what we're able to do in family plan structures and what occurs there. Our growth in business still highly profitable growth, but under some constructs like what we are able to do with FirstNet approaches as you would expect, people who buy at larger volume tend to get better rates.\n\nAnd so you see that ultimately flow through or maybe your ARPU dynamics around business are going to be a little bit less than what they might be in the consumer segment where people aren't able to buy at that kind of volume. Now having said that, you're looking at our overall ARPU trends, and you're seeing them improve and start to accrete and grow. And that's reflective of the fact that while we're doing very well in the business segment taking share, we're still growing ARPU in aggregate. So despite those differences in the average ARPUs and what's occurring, we are still managing to grow that ARPU dynamic overall, and that's a healthy place for us to be right now.\n\nAnd as you've seen, our margin structure relatively stable as we go through this quarter, and that's what's helping, of course, on some of the cash yields. On the IoT side, look, our main state profitability in IoT comes in vehicles. That really hasn't changed. I don't expect in the near term, over the course of what I would call the guidance and planning cycle that that's going to demonstrably change moving forward.\n\nI think there's a good opportunity for us to find the next level of growth in automotive. And I think we -- given our strong position in that market today are well-positioned to continue to work in that regard. And I think -- when you think about each vehicle out there and the intensity of communication that's going to occur, there's an opportunity for growth in that space to build on. And that's one of the most attractive areas that we'll continue to push in.\n\nDo I think that over time that in the spaces of manufacturing and medical devices that there's also an IoT opportunity to develop that as we get beyond what I would call the planning and guidance cycle that we give you, I do. But I don't think those are going to be the kind of thing that as we characterize an update for you for 2023 that you're going to see those factor in, in any meaningful way in kind of business-to-business revenues that you look at and say that their pattern changes overall. Hopefully, that's responsive to your questions, Mike, if you want to refine the first one, feel free to follow up here.\n\nMike Rollins -- Citi -- Analyst\n\nThanks. It's very helpful. And I was just thinking just even on the top line service revenue side with the business service revenue growth faster than the overall and then implicitly consumer. Is that something that you would expect to continue where just business is just going to be a bigger contributor to the wireless business going forward?\n\nJohn Stankey -- Chief Executive Officer\n\nI do expect that's going to be the case because as we shared with you, we have a number of dynamics going on in our distribution strategies that have driven that. And this is -- we keep saying it, I'm not sure it's fully being processed that our stance in the market and how we're offering in the market is not just driven by a promotional device stance. This is partly driven by we have managed to shift our distribution strategy and approach into the market, and we're doing better in these segments. And these are not sales that are necessarily being driven by people walking into stores, taking an upgrade on a device.\n\nAnd that's why our overall profitability dynamics are shifting in the way they have been. And we've been able to give you some visibility to how that's occurring. And when we're successfully taking share in the public sector under things like FirstNet and when there's affinity dynamics that start to work into that and the households of first responders and when we're more effective at tuning our distribution in the mid part of the market for business and where we've historically been, you are going to see faster growth for us in the business segment. And I think the results speak for themselves on what we're able to bring in relative to the balance of the industry on that.\n\nMike Rollins -- Citi -- Analyst\n\nThanks.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThanks very much, Mike. Operator, if we can move to the next question.\n\nOperator\n\nOur next question comes from the line of Kannan Venkateshwar with Barclays. Please go ahead.\n\nKannan Venkateshwar -- Barclays -- Analyst\n\nThank you. A couple if I could. I mean, first, on the fiber side, we've seen penetration growth slow a little bit. Obviously, the absolute number keeps growing and accelerating every quarter sequentially.\n\nBut then when we look at it in terms of penetration rate, I think it slowed a little bit versus what you were able to achieve last date. So it would be good to understand what the puts and takes there are? And how we should expect that to evolve as we go forward. And then, I mean, I guess, an associated question is the non fiber decline rate is also accelerating. And so how much of the growth that we are seeing in fiber is on account of transfers from maybe the non-fiber side to the fiber side.\n\nAnd lastly, just Pascal, on the $20 billion free cash flow guide for next year, could you give us a sense of what kind of metal variables are being assumed for that guidance in terms of potential recessions or the growth environment in general? Thanks.\n\nJohn Stankey -- Chief Executive Officer\n\nSo, Kannan, let me take the first part of your question, and then I'll let Pascal do some cleanup here. So first of all, what you should expect is that over the life cycle of a build, and I think we've been pretty clear on giving you insights into this. Let's call it, the first 30% of penetration goes relatively quickly, and the next 20% takes a little bit longer. And so it would be natural that as we build that when you kind of get yourself to a 30% penetration rate, you're going to see that curve start to slow down a bit, and that's to be expected.\n\nI think the biggest change that's occurred in penetration is how quickly we're getting to the 20% level versus historic numbers. And as we shared with you previously, we've kind of doubled our pace to penetration on the front end of that curve. And I've also shared with you that if you look at a typical return characteristic cash flow analysis of the investment of fiber, there are effectively three big things that drive that return dynamic and how effective the returns are, one of which is rate of penetration. And when we did the original assumptions on kind of our fiber business case, we had a much more ratable and deliberate ramp into that first 30% of subscribers in the business case.\n\nAnd now what we managed to do is we managed to effectively take a year off the cycle to get to the 20% mark. That is a huge impact on accelerating cash flows to the front end of the business case and it has a meaningful impact on the characterization of returns, even if you don't increase the ultimate assumption of what the terminal penetration is. And so I would tell you, we've already kind of had success in that regard. We characterize that for you.\n\nBut we've not made any assumptions at that once you hit that 30% level that the back end is going to go any faster. And so I think you're going to see a degree of penetration slowdown as we kind of hit that 30% and that's to be expected. It's been historic and that doesn't mean it's a bad thing. It just takes a little bit longer to kind of get to what I would call as the market norm and kind of stability of how we expect shares to be allocated between the various players in the market.\n\nSo hopefully, that gives you a little bit of sense on that. We don't publicly disclose the transfer rates and kind of what's going on there, Kannan. But look, you've got enough public information that we shared with you I think pretty well can conclude that if we're turning in the kind of numbers we're turning in, that there's got to be a meaningful percentage of that total fiber increase number that's coming from competitors in order to deliver the number. And we watch it.\n\nWe track it closely. I think both are good, right? Because what we know that any customer we move from legacy or embedded infrastructure over to fiber becomes a new established long-term customer with us, they're not going anywhere once we get them on fiber. But most importantly, we don't turn in the kind of numbers we communicated to you this quarter unless we're doing something that's moving share in the market, and we all know where that share has to come from. It's coming from in almost all cases, the embedded cable provider.\n\nPascal Desroches -- Chief Financial Officer\n\nAnd Kannan, on free cash flow, as I said earlier, we're not updating our guidance for 2023. But what I did say, we're over three-quarters of the way through this year. And based upon our view of where the macros and all the potential risk, we expect this business to grow both earnings and free cash next year. And for all the reasons I articulated earlier on.\n\nAnd in terms of just the broader macros. Look, we're not immune to them, but these businesses are generally more resilient even in an economic stress situation. So overall, I mean, that's -- we'll give you an update next year.\n\nKannan Venkateshwar -- Barclays -- Analyst\n\nThanks.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThanks very much, Kannan. Operator, can we move to the next question?\n\nOperator\n\nOf course. Our next question comes from the line of Frank Louthan with Raymond James. Please go ahead.\n\nFrank Louthan -- Raymond James -- Analyst\n\nGreat. Thank you very much. With your success with wireless, I just wanted to be clear how you're thinking about the promotional activity going forward. Any need to back off some of that promotional activity, you're clearly seeing good strong margin improvement without that? And then I had a follow-up question on the fiber JV.\n\nI can appreciate not wanting to comment on the story, but conceptually, would you be open to some outside investment to possibly reach some of those areas of your territory that aren't necessarily economical with your own capital going forward? Thanks.\n\nJohn Stankey -- Chief Executive Officer\n\nFrank, thanks for asking the quarterly question on what's sustainable. It was sustainable for another quarter, and that's been two and a half years now. And I'll let you know next quarter if two years, two and three-quarter years. So I feel really comfortable with where we are.\n\nI think you're seeing the strategy play out. I look at where the market sits today, and I'll reiterate what I said earlier in the call. We're not the one out there at $1,000 for new iPhones right now. We are at a different place than I believe both of our primary competitors.\n\nAnd I also characterize for you. You need to understand a lot of our growth is not coming from what we have as offers that we're communicating in the market. Mike's question is a really important question, looking at the consumer business mix. And when we think about how we're spending our promotional dollars, I characterize for you in the Goldman conference that there's a lot of other aspects of promotion how advertising gets done, how heavy you have to be to communicate your message if you're doing a more promotional stance, what you have to do in your channels to incent people to sell and change things.\n\nThe formula and the mix we have is a very competitive formula and mix right now across consumer and business, across our mix of promotional strategies or distribution partners, and one should not just simply say, because the lead offer that's being communicated in mass advertising is x, ask whether or not that's sustainable. The question is, are our customer acquisition cost sustainable. You're seeing the profitability improvement. You're seeing the ARPU improvement, and I think that's a pretty sustainable equation.\n\nI'm not going to comment on the fiber JV structure. I will make an observation, Frank. It's my duty to always keep my mind open to new ideas. It's my responsibility in running the business and if there's an opportunity for us to do something that's in our wheelhouse, that's in the strength of the capabilities that we have as a company and it's core and foundational to our brand to try to ensure that we seize those opportunities and move forward on them.\n\nWe certainly have a past practice. The wireless business was built with partners. I think you should understand and look back and we've done that effectively in the past and things that we've done, and we've done it in a responsible way for shareholders, and it's been a means for us to think differently about how footprint expansion can be done. We've certainly used that kind of an approach before.\n\nWe understand how the approach works. I think about it in aspects to all kinds of elements of our business and I've got to keep an open mind to those things moving forward.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThank you very much. Operator, we have time for one last question.\n\nOperator\n\nAnd that question comes from the line of Walter Piecyk with LightShed. Please go ahead.\n\nWalter Piecyk -- LightShed Partners -- Analyst\n\nThanks. Hey, John. When I look at postpaid, which is probably the prior focus on revenue for the company, you've increased revenue or it's accelerated for the past eight quarters. So I guess when I look at the first part of that, you kind of referenced that in the last question.\n\nWe were talking about how one was talking about the [Inaudible] promotions. You saw very good subscriber growth and that sustained. And now when we look at the past year, it's been in part on price increases to some of the legacy plants. So now you've got this whatever, very -- 6% growth in postpaid.\n\nIf you just sustain that going forward, that will probably be consensus. You probably don't need to stand, but when you look at '23, is it going to be a component of more price increases? Or do you think subscribers are going to help you for growth in at? And my second question, which is related is part of the ARPU increase for others was bundling in Netflix or for your case, HBO Max, that you cut, and I think in June 1st for new customers, maybe that's been helping your profitability, I don't know, but is there an opportunity to repack some of these streaming services into your offers in order to get ARPU even higher?\n\nJohn Stankey -- Chief Executive Officer\n\nSo well, I appreciate the question. First of all, I think it's important when you look at the disclosures and what we've given you for the quarter. As you know, there's always some onetime things that pop into a given quarter that drive the numbers. I think your overall characterization is accurate, which is we're improving the yields of the revenue growth and what falls to the bottom line on EBITDA.\n\nI'm not going to suggest it simply because we're going to get 6% revenue growth that we should expect that we're going to immediately get to 6% yield, but you've seen those yields improving each quarter, and we have a lot of confidence that, that's going to continue to occur and it's consistent with the guidance that we've given moving through the balance of this year. And I think we have really good visibility for that improvement to happen and there's a lot of factors that move into that, one of which is managing the cost structure more effectively. In '23, look, I don't know exactly what the environment is going to be, and I'm not going to announce anything today in the market. We'll announce any of the changes we make in the market when it's time to change it.\n\nBut when I look at the reality of the inflationary environment and understanding in this kind of a rapid inflation environment, you need to manage the revenue side of the equation as well as you manage cost side of the equation. The answer to that is yes. I think that's what a responsible management team does, exactly what lever we choose to pull will be an artifact of the environment we find ourselves in, but I can assure you the team has sat down and as we've looked at planning and as we prepare to give you guidance, for the year. We'll ensure that we have the right options and levers available to us to adjust to that.\n\nAnd as I said, we've got to work both sides of that equation. But I'm not going to tell you today that a preannounced set of tactics or strategies around that, especially on things that are relative to how we price in the market. On the content side, I don't think we've gotten any benefit, Walt, from content relative to the industry. We still have a lot of customers that get content bundled into their services, and we still view that as an important aspect of how we compete in the market.\n\nAnd as I think I shared last quarter, I would expect going forward that we'll have opportunities to incorporate content offerings in different ways into our portfolio. We still view our relationship with Warner Bros., Discovery, and HBO Max as being an important one, and it's been valuable and effective for us. But there's also others that could be worthwhile and beneficial to us. We're adjusting our strategies as we move into '23.\n\nI think you'll see some things adjust and change as we do that. So I think I'd say stay tuned. I think you're going to see content and ancillary services continue to be part of the wireless bundle in the industry moving forward. I think will play in a prudent fashion in our overall promotional dynamic, as I said earlier, managing effectively as part of that overall cost structure and it will allow us to do a number of flexible things now that we don't necessarily have a captive content engine, so to speak, under the umbrella of AT&T.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nThanks very much for the question, Walter.\n\nWalter Piecyk -- LightShed Partners -- Analyst\n\nThank you.\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nAnd thank you, everyone, for your participation and interest in AT&T. With that, we'll conclude the call and look forward to connecting again post our fourth quarter results.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAmir Rozwadowski -- Senior Vice President, Finance, and Investor Relations\n\nJohn Stankey -- Chief Executive Officer\n\nPascal Desroches -- Chief Financial Officer\n\nPhil Cusick -- JPMorgan Chase and Company -- Analyst\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nJohn Hodulik -- UBS -- Analyst\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nMike Rollins -- Citi -- Analyst\n\nKannan Venkateshwar -- Barclays -- Analyst\n\nFrank Louthan -- Raymond James -- Analyst\n\nWalter Piecyk -- LightShed Partners -- Analyst\n\nMore T analysis\n\nAll earnings call transcripts"
}