{
  "companyName": "aka Brands Holding Corp.",
  "companyTicker": "AKA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/aka-brands-holding-corp-aka-q2-2022-earnings-call/",
  "content": "aka Brands Holding Corp. (AKA 4.96%)\nQ2 2022 Earnings Call\nAug 10, 2022, 4:30 p.m. ET\n\nOperator\n\nHello, and welcome to the aka Brands second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. [Operator instructions] A question-and-answer session will follow the formal presentation.\n\nAs a reminder, this conference is being recorded. It's now my pleasure to turn the call over to Jean Fontana. Please go ahead.\n\nJean Fontana -- Investor Relations\n\nGood afternoon. Thank you for joining aka Brands second quarter 2022 conference call to discuss the results we released this afternoon, which can be found on our website at ir.aka-brands.com. With me on the call are Jill Ramsey, chief executive officer; and Ciaran Long, chief financial officer.\n\nBefore we get started, I'd like to remind you of the company's Safe Harbor language. Management may make forward-looking statements, which refer to expectations, projections, or other characterizations of future events, including guidance and underlying assumptions. Forward-looking statements involve risks and uncertainties that could cause actual results to differ materially than those expressed. For a further discussion of risks related to our business, please see our filings with the SEC.\n\nPlease note we assume no obligation to update any such forward-looking statements. This call will contain non-GAAP financial measures, such as adjusted EBITDA and adjusted EBITDA margin. Reconciliations of these non-GAAP measures to the most comparable GAAP measures are included in the earnings release furnished to the SEC and available on our website. The call will also contain certain numbers presented on a pro forma basis, which includes the impact of Culture Kings as if we own the brand for all periods and comparable periods described.\n\nWith that, I will turn the call over to Jill.\n\nJill Ramsey -- Chief Executive Officer\n\nThank you, Jean, and thanks, everyone, for joining our call today. I'd like to begin by recognizing and appreciating our teams for their hard work and agility, delivering profitable growth in what continues to be a complex macro environment. As we stated on our recent press release, second quarter global net sales grew 6%, 11% in constant currency on top of last year's 76% pro forma growth for the acquisition of Culture Kings. Sales in the U.S., our largest region grew 16% on top of impressive 138% pro forma growth last year.\n\nAustralia decreased 5%, but was up 3% in constant currency on top of 41% pro forma growth. And while we achieved double-digit global growth this quarter on top of last year's robust increases, we did experience deceleration as we moved through the quarter. Net sales in the second quarter were impacted by inflationary pressures on consumers, shifts in spending behavior and a slower than anticipated recovery in Australia. Additionally, lower return on marketing investments, a competitive promotional environment and higher returns contributed to lower than expected adjusted EBITDA of $6 million.\n\nAs we continue to manage our business through this challenging period, we are focused on driving profitable growth and protecting our margins by maintaining discipline around inventory and promotions, driving greater marketing efficiency and carefully controlling expenses, which Ciaran will speak to shortly. Importantly, we remain confident in our long-term growth outlook. Active customers grew 34% demonstrating the growing demand for our differentiated brands. We now serve 3.9 million active customers globally, and yet, we believe this is just a small percentage of our potential target demographic.\n\nWe are still in the early days of our expansion in both the U.S. and rest of world. Our unique operating model is flexible and resilient, enabling us to pull levers to manage between growth and profit during times of volatility. First, our next generation merchandising strategy leverages a powerful combination of data-driven, test and repeat buying with fast lead times, a dual hemisphere footprint and a high mix of exclusive, all of which create a huge competitive advantage.\n\nOur proven model gets trends to customers faster, while managing inventory risk and maintaining strong growth margins. Second, our brands have an efficient approach to marketing that all starts with great content amplified across a vast network of social media followers and influencers. We combine this with performance marketing and highly efficient in-house channels, which leads to lower costs and higher flexibility. Third, our unique multi-brand platform and collaborative culture enables us to share ideas, innovation, vendors, and resources across our teams to drive both growth and efficiencies.\n\nTurning to our brand updates. I'll share some highlights from the quarter and what's ahead starting with our women's brands. Princess Polly, our largest brand and contributor to growth on the quarter continues to have tremendous opportunity in the U.S. and rest of world.\n\nPrincess Polly's mission is to make on-trend fashion, sustainable and accessible, and they are quickly establishing as a leader at this. Earth Club, their line of sustainable fashion gain further traction this quarter with sales up 30% quarter over quarter. They've made tremendous progress by rebuilding their supply chain to use sustainable materials on over 20% of their new styles and remain on track to reach their goal of 40% by year-end. In addition to expanding their sustainable range, Princess Polly is proud to share that customers will soon be able to buy and sell pre-owned Princess Polly on their site through a strategic partnership.\n\nStanding by their quality and allowing customers to buy and sell secondhand is an incredible step that positions them to participate in a fast growing eCommerce space and the full circularity of fashion. With these initiatives, Princess Polly is bolstering their competitive differentiation and strengthening their brand position with their target demographic. Princess Polly also continues to see growth in their extended size collection curve, which launched in the fall. This quarter sales were up 35% from the prior quarter across nearly 600 styles and we are very pleased with the strong initial response with 30% of customers returning after a first purchase.\n\nI'll share a quote from a customer. I cannot thank you enough for your inclusive sizing. I have always wanted to dress the same as my friends. You have no idea how much it means to fit in not to mention the incredible quality.\n\nMy self-esteem is so high right now. Thank you from the bottom of my heart. And while curve is a small proportion of sales today, we believe there is continued growth potential that will enable Princess Polly to reach a broader audience. Innovators at next generation marketing Princess Polly efficiently optimizes spend across over 20 channels from social media to performance and in-house.\n\nThey are a leader at micro influencer marketing with a fast network of smaller audience influencers. Last fall, they took this to the next level rolling out a college ambassador program that received 20,000 applications. And this quarter, another 3,000 students applied. Converting brand enthusiasts into ambassadors is a cost effective and authentic way to reach new customers.\n\nAnd Princess Polly is currently in full swing for the back to college season with their ambassador program and a robust campus cool marketing campaign activated across channels. One of Princess Polly's incredible strengths is their ability to pivot marketing, wherever their customer goes. They were early on TikTok, testing and learning with content and strategies to increase efficiency. Now, as TikTok emerges as a dominant platform, they are seeing significant traffic sales and new customers, and it has become one of their fastest growing and highest performing marketing channels.\n\nPrincess Polly is also doubling down on in-house marketing, which drives repeat, engagement and high efficiency with nearly 1.3 million subscribers SMS text marketing is one of their highest ROI channels with potential for even higher conversion as they lean into personalization. Princess Polly's loyalty program also continues to exceed expectations with nearly 2 million members now who spend 130% more than non-members. Even more impressive is that top tier members purchase at three times the rate of non-members. Princess Polly's ability to drive marketing efficiency is unparalleled.\n\nAnd while we continue to face a dynamic landscape, their ability to shift between channels combined with the strength of their influencer and in-house programs will enable them to optimize spend in the back half and beyond. Furthermore, a powerful aspect of our model is to leverage these successes across our brand. Turning to Petal and Pup. This brand continues to be our fastest growing, driving growth across the U.S., Australia and rest of world.\n\nPetal and Pup's performance demonstrates the strength of our platform as they successfully leverage Princess Polly strategies to drive their own growth. From a merchandising perspective, Petal and Pup shares many vendors and uses the same test and repeat strategy as Princess Polly. In Q2, they were able to quickly read and react to trends like cutouts on dresses and the shift to two piece sets and jumpsuits. And like Princess Polly, they're leaning into their dual hemisphere advantage to optimize inventory.\n\nFor example, they reallocate on orders between Australia and U.S. just before delivery based on up to the minute sales data. In marketing this quarter, Petal and Pup successfully took learnings from Princess Polly to lean into advertising on streaming content platforms, targeting new customers with high performing ads on relevant shows. And like Princess Polly, they're focused on growing in-house SMS text marketing.\n\nThis quarter, they doubled the size of their customer file and SMS became one of their fastest growing and highest returning channels. Rebdolls also continues to engage customers with their incredible content and leverage resources, learnings, and best practices from our group of brands. Moving to our streetwear brands. Renowned for their highly experiential stores that are closer to a Vegas nightclub, Culture Kings stores delivered strong growth in Q2 that has sustained into Q3.\n\nWith the return to in-person events following COVID restrictions, we are thrilled by the high level of engagement, energy and traffic back in our stores. Culture Kings posted a number of high impact events in the second quarter, including a press conference featuring famous boxers Kambosos and Haney leading up to their marquee fight. The event was promoted with visible branding, exclusive merchandise and content that was amplified on social media. Additionally, Nick Scott of the LA Rams created a viral moment in stores when he arrived with the Vince Lombardi Trophy.\n\nThis quarter, we are excited to host a continued lineup of world class celebrities such as Hall of Famer Shaq, who will be in our Melbourne and Sydney stores later this month. Recently, I had a chance to visit our stores in Auckland, Sydney and Brisbane. They will buzzing with traffic and energy, and I am so excited for the launch of this incredible retail concept in the U.S. The flagship location in Las Vegas is on track to open this November with an exciting lineup of artists and athletes.\n\nThe store will carry over 60 highly recognizable brands that are confirmed for launch. We are confident that the Culture Kings one of a kind experiential store format will resonate with a U.S. audience as it has in Australia and New Zealand and we remain bullish on global potential for this incredible brand. World famous for streetwear, Culture Kings offers a broad range of over 200 brands online with a mix of highly thought after third-party brands, SMUs and exclusive private label.\n\nMore than half their sales come from exclusive products, of which the fastest growing segment is printed tees and hoodies. Since the acquisition of the print-on-demand facility in the fall, we've nearly doubled this business. With just in time production, the team can quickly jump on trends, such as championship winners in sports or popular series in entertainment. This quarter, we launched over 24 successful license key programs, including [Inaudible] Stranger Things, and Avatar.\n\nWith this demand driven capability at Culture Kings, we get trends to customers faster, reduce inventory risk and realize higher gross margins and we are sharing this capability with our other brands. This quarter, mnml launched its first ever vintage tee program, leveraging the print-on-demand capabilities at Culture Kings and we are very pleased with the early results we're seeing. Mnml also launched assortment in Culture Kings stores and online with strong response, particularly in the U.S. And we are excited to continue unlocking the synergies between these two incredible streetwear brands.\n\nTurning to operations. This quarter, we successfully moved Culture Kings' U.S. fulfillment to a shared distribution center with mnml on schedule and on budget. But shipping from a U.S.\n\nbased DC, we have cut delivery times to customers and shipping expenses in half an important part of our U.S. rollout plans. Before turning the call to Ciaran, I'd like to welcome two new leaders to our talented team. In June, we announced the appointment of Jonathan Yuska to president of Culture Kings U.S.\n\nJon brings over 20 years of experience growing and leading divisions at global sports brands, including Adidas, Mitchell & Ness, Reebok and Fila. And we look forward to his contributions as we scale in the U.S. and globally. Also Kenneth White joined us in mid-June as VP, head of legal and human resources, bringing over 15 years of experience.\n\nHe also possesses a uniquely relevant operational skill set with a proven track record of scaling a high growth digitally native streetwear brand, making him an even greater asset to our broader organization. Looking ahead, we anticipate macro challenges will continue through the remainder of the year and are focused on leveraging the flexibility of our model to deliver improved margin while balancing focus on longer term growth. We are excited to see Culture Kings expansion into the U.S. with a new flagship store in Vegas.\n\nPrincess Polly is well-positioned for the back-to-college season and we will continue to leverage our successful playbook across our brand. Despite current headwinds, we remain confident in the growth potential of our differentiated brands. Our unique model positions us to achieve our vision to become the global leader in next generation fashion. On my recent trip to Australia, I had a chance to spend time with our teams and was once again reminded why aka\n\ntruly is the future of fashion. More than anything, it's the incredible talent on our team that inspires me every day with confidence and I look forward to all that is ahead. With that, I'll turn it over to Ciaran.\n\nCiaran Long -- Chief Financial Officer\n\nThank you, Jill, and good afternoon, everyone. As Jill mentioned, our priorities we manage our business through the remainder of the year would be to drive improved EBITDA margin performance. We have identified a number of opportunities to drive efficiencies and reduce costs, which I will speak to following my review of our second quarter financial results. I will then discuss our outlook for the remainder of the year.\n\nFor the second quarter, net sales grew 6% to $158 million, compared to $149 million last year. On a constant currency basis, net sales would've increased 11%. We saw a year-over-year active customer growth of 34% to $3.9 million for the quarter. This represents an increase of 53,000 active customers since the first quarter.\n\nThe total number of orders increased 12% to $1.9 million compared to the prior year. Average order value of $85 was down 4% compared to last year are 1% on a constant currency basis, primarily due to higher promotional activity and higher return rates. The healthy growth across both orders and active customers reflects our growing presence in the U.S. In spite of macro headwinds, with the growth of Princess Polly brand and the acquisition of Culture –- and the acquisition of mnml.\n\nNow we will provide a few highlights from our three regions. In the U.S., second quarter net sales increased to $82 million up 16% from the second quarter last year. Our largest brand Princess Polly continues to be the primary dollar driver of our growth in the U.S. as we continue to build brand awareness.\n\nAustralia net sales decreased 5% to $57 million, up 3% on a constant currency basis, reflecting the macro impacts we talked about earlier. Encouragingly, Culture Kings' store comps were strong during the quarter as consumers shift to in-store shopping and the brand resumed holding events in their stores. Turning to the rest of world, net sales of $19.7 million increased 5% from the second quarter in the prior year. We are encouraged by demand in New Zealand and the UK.\n\nMoving to profitability. Our gross profit for the second quarter increased 7% to $87 million on a reported basis. Gross margin rate was 55.2% in the second quarter of 2022 versus 54.6% in the same period last year. Adjusting Q2 2021 gross margins for a charge related to inventory acquired in the Culture Kings acquisition, gross margins declined by approximately 360 basis points.\n\nHigher freight costs accounted for about a half of this decline with increased returns, as well as heightened promotions making up the balance. Our quarterly return rate was 18.6% and increase of 460 basis points to last year. While we continue to have best in class return rates, we saw increased rates across brands and regions. Selling expenses in the quarter were $45 million, compared to $40 million in the prior year.\n\nThe increase in selling expenses during the quarter was due to an increase in order volume versus last year and $1.3 million of expenses related to moving to a new fulfillment center for Culture Kings and mnml. Marketing expense increased to $19 million from $15 million in the prior year. Of the increase $1.8 million was due to the inclusion with mnml. As a percentage of sales, marketing expense was 12%, a 200 basis point increase compared to the second quarter of 2021.\n\nThis increase is due to reduced effectiveness of our marketing channels at driving traffic to our website as we moved through the quarter. Our G&A expense of $26 million increased to $19 million in the prior year. The increase in G&A was primarily due to an increase in salaries and related benefits and equity based compensation expense related to increases in headcount across functions to support business growth, the inclusion of mnml and additional insurance costs. For the quarter, adjusted EBITDA was $6 million versus $19 million in the prior year.\n\nOur adjusted EBITDA margin of 3.7% compared to 13% in the prior year second quarter. This decrease in adjusted EBITDA margin is primarily a result of gross margin pressures from increased returns, promotions and increased marketing expenses. Our net loss for the quarter was $4.2 million or $0.03 cents per share, compared to net income attributable to aka of $2.4 million or $0.03 per share in the prior year.\n\nOur weighted average shares outstanding were approximately $128.7 million in the second quarter of 2022. Turning to the balance sheet, we ended the quarter with $29 million in cash and cash equivalents and $131 million in debt. At the end of the quarter, we had total liquidity of approximately $54 million, including $25 million available on our credit facility. Inventory at the end of the quarter was $144 million, compared to $100 million at the end of the second quarter of 2021.\n\nThe increase in inventory was associated with Culture Kings new fulfillment center, the addition of mnml and anticipated growth across our brands. Although, the increase in inventory was largely expected, we did see an incremental increase due to the softness of sales late in the quarter. We are taking for active measures to right size inventory, including order cancellations, postponements, reallocating across our dual hemispheres and we believe we can bring inventories back in line by year end. Turning to our outlook.\n\nFor the full year, we are lowering our full year guidance to reflect our second quarter results, as well as our tempered outlook for the remainder of the year as macro pressures continue to impact results. We now expect revenue to be between $625 million and $635 million with adjusted EBITDA of $38 million to $40 million. This reflects the growth rates in June, which we saw continue in July. We are expecting the July trend to continue through the back half of the year, including continued FX pressure, the promotional environment, and elevated returns.\n\nAs such, we believe gross margin rate in the back half to be similar to Q2. As we discussed earlier, we are taking actions intended to deliver improved sequential margin performance as we continue to navigate economic headwinds. Our focus would be on optimizing marketing investments, maintaining discipline inventory controls, and tightening expenses around non-customer facing initiatives. We are reallocating our marketing to platforms that deliver the highest ROIs and leaning into internal channels, such as email, SMS, and loyalty.\n\nWe believe we have an opportunity to create greater efficiency, given the flexibility and agility of our marketing approach. We continue to expect capital expenditure of between $18 million to $20 million for the full year. For the third quarter, we expect net sales to be in the range of $150 million to $153 million. Gross profit margin in the third quarter will continue to be impacted by the promotional environment.\n\nWe expect adjusted EBITDA to be in the range of $9 million to $9.2 million. For Q3, we expect interest expense to be approximately $2.2 million and weighted average diluted share count of 129 million. We believe the flexibility of our business will enable us to achieve or adjusted EBITDA expectations for the back half of the year while executing on our growth strategies. I also want to echo Jill's comments that we believe we have differentiated brands and a highly efficient business model that will support long-term organic growth and profitability.\n\nWith that, I will turn the call over to the operator for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question today is coming from Ed Yruma from Piper Sandler. Your line is now live.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nHey, good afternoon. Thanks for taking the questions. I guess, two for me. First, obviously inventory balances up you guys indicated kind of some of the puts and takes.\n\nBut I was wondering if you could talk about inventory quality and kind of what we should think about from a timing perspective in terms of getting inventory growth more in line with sales growth. And then I guess just a bigger picture question, I appreciate the flexibility in the model, the data you guys use, I guess, as you hindsight what happened in the quarter. What adjustments can you make to the operating model to prevent that from happening to that level going forward? Thank you.\n\nCiaran Long -- Chief Financial Officer\n\nHey, Thanks, Ed. I'll take the inventory. I think we feel good about the quality of the inventory. A lot of it obviously was coming in late in Q3.\n\nI think if you look at the increase in dollars versus kind of where we ended Q1, we were up about $20 million. I would've said kind of some of that was expected with the Culture Kings fulfillment center move and opening in the U.S., but there's probably 10 or 15 of inventory that kind of was due to the sales softness. I would say, with the test and repeat model that we have on the women's brands, we would expect to be through kind of about half of that by fall and just with the flexibility of that model, they certainly have the levers to do that between cancellations and kind of just the on orders that they have. And then it'll take the men's brands, Culture Kings and mnml a little bit longer that will probably be through end of year with just the third party brands that they have less ability to cancel change order quantities.\n\nSo it'll probably beat through then.\n\nJill Ramsey -- Chief Executive Officer\n\nHey, Ed, it's Jill. I'll take your second question. We certainly see that the lion's share of this is really macro impacts. One of the advantages of having a group of five brands, is you can see across all of them if there's a macro effect happening.\n\nAnd we certainly saw in June and it carried into July, a pretty rapid deceleration across the whole group and regions. And we've also seen that consumer shift into stores where we have stores. So we certainly see both of those things as impacted by macro and temporary. We remain really confident in the long haul and obviously nearer term, we're making some real adjustments in the business through the back half.\n\nCiaran just spoke to inventory adjustments that we're making where we can also reallocate or on orders between hemispheres. That's a unique advantage. We can do that very, very close in reading up to the minute sales data and reallocate those orders. But I'll talk about marketing, because marketing expense is where we're able to make a lot of adjustments in our allocation to higher returning channels.\n\nWe have already begun that. We started doing that immediately as we saw the business start to change, we've shifted into higher returning channels, like TikTok is actually now more efficient for us actually than Facebook, Instagram. And we've also leaned harder into in-house and just getting out of unproductive marketing channels and able to also shift and reallocate marketing spend regionally where we see the highest return. We've already put those in motion and saw improvement as we went through July.\n\nSo have confidence that we can hit that rate that's modeled in for the back half.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nThanks so much, guys.\n\nOperator\n\nThank you. Our next question is coming from Ike Boruchow from Wells Fargo. Your line is now live.\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nHey guys. I just wanted to get some clarification when I look at guidance in 3Q and implied for the rest of the year. It's looking like net sales growth looking maybe down mid-single-digits, I know it's post currency and M&A. Can you just highlight what it is that you guys are expecting from a currency headwind in the remainder of the year and what assumptions were there and then what's kind of expected from M&A as well, please?\n\nCiaran Long -- Chief Financial Officer\n\nYeah. Hi, Ike. We're not expecting anything from an M&A perspective and there's nothing modeled in the guidance for M&A. From an FX perspective, we have 6% modeled into the back half, pretty close on what we've seen in July and in the June period, and they're the big drivers.\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nOK. Just to kind of clarify on the M&A question here. I think historically, you're looking at maybe $20 million or so being contributed from mnml in the second half of this year. Is that correct?\n\nCiaran Long -- Chief Financial Officer\n\nYeah. So mnml contributed about $10 million a quarter. We bought mnml in the second week. I think it's lower to second week of October.\n\nSo there'll be obviously a benefit for mnml –- full benefit in Q3, in Q4 there'll only be two week benefit for mnml.\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nOK, great. Cool. Thanks a lot, guys.\n\nOperator\n\nThank you. Next question is coming from Lorraine Hutchinson from Bank of America. Your line is now live.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Good afternoon. I was just wondering if there were any callouts on your consumer areas of particular strength and weakness be it by income region category.\n\nJill Ramsey -- Chief Executive Officer\n\nHey, Lorraine. As I mentioned, we did see a broad change in sales growth across the group and regions. That said, I would say, we did actually see more of an impact. We do have a little bit of a lower income customer at Rebdolls.\n\nSo they were -– they've been more disproportionately impacted. And we've certainly seen that our stores have held really well throughout this period as the consumer has shifted back into stores. And we're still seeing really, really strong growth and momentum on Petal & Pup, was than an earlier phase in their growth cycle. But more broadly, we have seen this pretty across the board, but little pockets here and there definitely in line with or what you would expect with the macro environment.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThanks. And then just one follow-up on the gross margin, I think you're guiding this for the same gross margin that you did in 2Q in the back half, seemed like some of these struggles occurred toward the end of the quarter. So can you just talk about the rationale or the building blocks you were using to get to that guidance?\n\nCiaran Long -- Chief Financial Officer\n\nSure. Yeah, Lorraine. We certainly saw the pressure and the gross margins from a sales and from a returns perspective in that June period. I think as we think about the back half, we're kind of –- we feel that we can be a little bit less promotional than we were in that June period.\n\nWe're probably a little bit over promotional, so some help there. And we think that kind of balances [Inaudible] to be closer to kind of where we were overall gross margins in Q2. For us, expecting that the return rate will continue that we've seen, some of that was driven by mix of women's brands doing a little bit better than men's brands, but we're expecting that to continue in the back half. We are also taking some surgical price increases in some of the brands where we can, but we do understand look that it is going to be a promotional environment in the back half.\n\nAnd so want to build that into our gross margin expectations.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Next question is coming from Oliver Chen from Cowen. Your line is now live.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, Jill and Ciaran. What's the nature of the kinds of promotions that you'll be seeking to take just to ensure that you maintain brand health? And also it sounded like you're on track for seeing digital marketing efficiency. Are you –- what you're seeing now? Do you think it's a relatively stable environment or do you still see some risk factors? And then I would just love color on why do you think return rates had been more elevated than you had expected and going forward, it sounds like you think that they're going to follow a closer band. Thank you.\n\nJill Ramsey -- Chief Executive Officer\n\nHey, Oliver. With regards to promotions in the back half, certainly, we are expecting a promotional back half. We will be much more surgical and targeted in that and not doing broad site wise. Ciaran mentioned it, but we are happy with the composition of our inventory, we just have a lot of it.\n\nBut I think we will –- the teams are very good at being more targeted and precise on that. On the opposite side as well, they are also very targeted on pricing increases to help balance that out. We have a lot of pricing power with our significant amount of exclusive merchandise. And so I have high confidence that between those levers and the agility of the team, we can really balance out our gross margin targets as we've modeled out for the back half.\n\nWith regard to digital marketing efficiencies, as I mentioned, the teams have really already been able to reallocate spend, shifting out of less performing, marketing channels –- more early stage marketing channels, where we might have been testing and still tuning and shift further into just highest returning. We already saw the improvement on that. You're asking about the sort of stability of the marketing landscape. I'd say the marketing landscape is just incredibly dynamic.\n\nBut our teams are also incredibly agile. We also are leaning hard into in house email, SMS, our loyalty programs, these are all highly efficient. So I'm confident that sort of whatever comes our way, the team has a lot of agility and can navigate that. With regard to returns, we did see, as the consumer shopping behavioral changes have changed, that's also sort of impacted their returns behaviors as well.\n\nWe saw across the board a bit of an uptick in returns across the brands and regions. A little bit of that is also mix, as our women's brands have outpaced our men's brands, those are at a higher return rate. And then even within women's, dresses is outpacing and growing faster than the other categories, and it's at a higher return rate. It is good to keep in mind and as a reminder, we do have best in class returns.\n\nWe are still operating well under 20%, which is unlike anyone else out there and the teams constantly are focused on how we can take that even lower. That said we have modeled into the back half that that slightly elevated return rate.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOK. That's very helpful, Jill. On the product side within product, which product has been working better, it sounds like dress isn't going out and which product has been working less well, if there's a way to characterize it.\n\nJill Ramsey -- Chief Executive Officer\n\nYeah. So exactly dress isn't going out just continues to be strong as well, bottoms, denim, anything reflecting the macro trends as the consumer is getting back to work and back to going out. Also, as I mentioned in my earlier comments our printed tee business is really performing well for us. We're very excited about this new capability.\n\nWe purchased in the fall. Culture Kings has doubled their printed tee and hoodie business, just since the fall and this is an incredibly agile capability for us, which allows us to within days jump on a trend and ramp up production, as well as at a higher margin. So we're super excited about that new capability and we've already rolled it to mnml and we will be rolling it to Polly as well, and realizing some margin improvement on their graphic tees bringing that in-house. So those really are the areas that are kind of stand out for us on product.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nLast question, you called out the consumer and gave us some context a few times. Some of that's out of your control and the consumer environment is quite fluid with the health of the consumer. What do you think is happening with the consumer now? And how might that interplay with different risk factors if you see the consumer environment deteriorating from here?\n\nJill Ramsey -- Chief Executive Officer\n\nWell, look, I think we saw a change in trends that really was correlated in June and July when a lot of the macroeconomic indicators and headlines were coming out. I think you could probably do a nice correlated graph with the media headlines and our sales trajectory. And as you say, yes, a lot of that is outside of our control. I do think the other big shift that is happening, customers are enjoying getting back out to stores.\n\nI get it. We were all home for a long time and it's fun to get back to the mall. So certainly seeing that in our own brand portfolio really nice healthy traffic back at the Culture Kings stores actually was just over there in Australia and in Auckland just incredible energy and traffic back in the stores. So fun to see.\n\nSo we're excited. Timing is just great for us to be launching that store in the back half. But look longer-term, I am confident that there is a much bigger macro trend that is shifting to online. That is really going to be a nice tailwind for us and our long-term growth potential.\n\nWe have unbelievably differentiated brands and a really unique model that's going to allow us to weather this storm in the short-term. But I have every bit –- more confidence than ever to be honest, actually after my trip over to Australia, I always come back pretty fired up and hanging out in the stores and hanging out with the team, so, yeah.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you very much. Best regards.\n\nJill Ramsey -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. Next question is coming from Dana Telsey from Telsey Advisory Group. Your line is now live.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood afternoon. As you think about the adjustments and guidance that were provided, as you think about some of the operational metrics of active customers, AOV, number of orders, how are you –- what are you looking for in those metrics? And also how you're thinking about the pace of growth in the U.S. and Australia for the balance of the year? Thank you.\n\nCiaran Long -- Chief Financial Officer\n\nThanks, Dana. Yeah. And maybe to go through kind of each of them, I think as we've seen the year-over-year active customer growth has continued to be really strong. And I think even the sequential –- to see good sequential growth quarter over quarter was a real nice bright spot in the business.\n\nI think we will –- as we think about it continue to see the sequential active customer growth at about the same level we saw from Q1 into Q2 and kind of expecting that into Q3 and into Q4. From an AOV perspective, I think we'll see AOVs on a percentage basis, a little bit lower decline than we saw in Q2. Just I think that run rates that we saw in June will continue as we think about into the back half of the year. And then that's obviously the driver then from an order perspective, I think you would see kind of you get orders, fairly flat from a volume perspective with that change in AOV, relative to the guidance that we're shared –- that we've shared.\n\nI think as it relates to the different geographies, I think we will -- I think see much the same growth rate or kind of decline and growth rate on constant currency, a little bit decline because of FX that we've seen in Australia through the back half. And from a rest of world perspective, I think as we allocate marketing dollars to just some higher ROI channels, the growth there might moderate a little bit, although we do have some just nice natural demand coming from some of those regions. I think then just the –- obviously the balance of the revenue will fall into the U.S. We are kind of modeling decline in the U.S.\n\nin that through the rest of the year. I think Q4 gets a little bit stronger, obviously as we're kind of opening the Culture Kings store, which will be helpful for growth in the U.S.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGot it. And just to clarify, just want to make sure on the poor return rate, which I think was around 18.6%, is that what you're expecting in Q3 and Q4 also or should there be a little bit of uptick in Q3 before settling in Q4?\n\nCiaran Long -- Chief Financial Officer\n\nI think it'll be more around that rates, Dana, through Q3 and Q4. Q3 seasonally usually comes down a little bit for us. So even that kind of July rate will moderate to what we saw in Q2.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Next question today is coming from Michael Binetti from Credit Suisse. Your line is now live.\n\nMike Binetti -- Credit Suisse -- Analyst\n\nHey guys, thanks for all the help here with the questions. Ciaran, I guess as I look at some of the details in the guidance as you've laid it out to us, the fourth quarter operating margin or EBITDA margin I suppose is above the first quarter, when you had 24% –- call it 24% operating or 24% organic growth in the revenues. And you're calling for negative revenues in the fourth quarter and lower gross margins in the fourth quarter and first quarter. So I think I'm sneaking up on a question that it speaks a little bit to the flexibility of the other cost lines.\n\nCould you maybe tell us where you see the biggest year-over-year savings or sequential improvement in the cost lines below the cost of goods to help us understand the margin. Thanks.\n\nCiaran Long -- Chief Financial Officer\n\nYeah. So I think one, Michael is that, we are really pushing back to get to that kind of around the 10% historic marketing rate that we've usually run at that that's obviously kind of one big driver. You remember we were at 10.6% in Q1, the 12% in Q2, I think from what we're seeing in July, we can execute against that and plan to do that for the rest of the year. I think the other is selling expenses at the moment is a little bit higher than we will see in Q4.\n\nThere are -– at the moment, we've got some expenses in there for the Vegas -– the rent on the Vegas property and obviously not having revenue from that. And that opens up, we'll see a little bit of leverage there and we usually see a little bit of leverage in Q4 in that line as well. I think it'll be pretty stable from Q2 into Q3, across selling expenses. And then from a G&A perspective, look, I think we're modeling in, we will have a small increase in dollars from Q2 into Q3 and Q4 a little bit like we saw from Q1 into Q2.\n\nWe are taking actions across all the lines on cost initiatives, but I think that's area where there will still be a little bit of build and –- but kind of on a rate basis, quite a bit of leverage will just come from that line.\n\nMike Binetti -- Credit Suisse -- Analyst\n\nOK. That's a lot of flexibility. OK. And then I guess as you –- we look out a little bit past this year and think about the bigger picture model and some of the conversations around the IPO and how you're thinking about the growth in the business.\n\nMaybe help us think about your early thoughts on how you plan inventory for spring. I guess you probably have some -– you can probably look ahead to like recapturing some full price selling from the current levels here, but I'm wondering, do you think there's a point in time where you want to target getting back to positive growth via ordering units up? Do you think it's safe for us to assume inventory units are going to be ordered up for the spring at this point or how should we think about that?\n\nCiaran Long -- Chief Financial Officer\n\nYeah. I think that's safe to assume, Michael, I think what's really interesting as you go through the ability of the different areas to change inventory on orders, compositions. I think the strength of the brands that are fully on test and repeat, it's -– they can react quickly when they have a little bit too much inventory, but they can also chase really fast from a sales perspective. So I think as we think about Q1 into next year, we would certainly expect to see positive growth there.\n\nAnd I think then just as we think with the Culture Kings store opening in the U.S. in Q4, for us that's a big -– that's an inflection point in kind of building on the brand awareness for the U.S. So I think we're feeling pretty good about that as well.\n\nMike Binetti -- Credit Suisse -- Analyst\n\nOK. Very helpful. Thanks a lot, guys.\n\nOperator\n\nThank you. Next question is coming from Garrett Greenblatt from Jefferies. Your line is now live.\n\nGarrett Greenblatt -- Jefferies -- Analyst\n\nThank you for taking my question. I'm just curious on your thoughts on acquisitions and current environment. Does the current environment give you any pause to kind of push out plans maybe six months to 12 months, maybe put a hold on national expansion outside of the U.S. and Australia? Just kind of how you're thinking about acquisitions overall.\n\nThank you.\n\nJill Ramsey -- Chief Executive Officer\n\nYeah. Hey Garrett, I'll take that. Certainly, right now our focus and our priority always is to scaling the great group of brands we have today, the five in our portfolio and with a focus on our largest brands and even more focus on Culture Kings in the U.S. So we are putting everything we got toward that.\n\nAnd that said, M&A is a part of our strategy and M&A is a long-term game. Not something you can really start and stop those conversations sometimes take multiple years to really develop the leads and relationships. So we still absolutely are active out there in discussion and keeping that that pipeline warm and open. That said, right now our focus is on scaling the brands we have, and really also just making sure we have a very healthy balance sheet.\n\nGarrett Greenblatt -- Jefferies -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. We reach the end of question-and-answer session. I'd like to turn the floor back over to management for any further or closing comments.\n\nJill Ramsey -- Chief Executive Officer\n\nYeah. I guess I'll just add, we're very confident with our agility to weather the storm here near-term. Obviously, we anticipate continued back half uncertainty, but I am confident in our model and our team's ability to do that. We are already seeing some of that progress near-term in the margins tracking and feeling good about that.\n\nAnd longer-term just very confident in our incredibly differentiated brand and really can't wait to get this Culture Kings store opened up in the back half and invite you all to come. So thanks, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJean Fontana -- Investor Relations\n\nJill Ramsey -- Chief Executive Officer\n\nCiaran Long -- Chief Financial Officer\n\nEd Yruma -- Piper Sandler -- Analyst\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nMike Binetti -- Credit Suisse -- Analyst\n\nGarrett Greenblatt -- Jefferies -- Analyst\n\nMore AKA analysis\n\nAll earnings call transcripts"
}