{
  "companyName": "Northrop Grumman",
  "companyTicker": "NOC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/northrop-grumman-noc-q3-2022-earnings-call-transcr/",
  "content": "Northrop Grumman (NOC 0.67%)\nQ3 2022 Earnings Call\nOct 27, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen. Welcome to the Northrop Grumman's third quarter 2022 conference call. Today's call is being recorded. My name is Michelle and I will be your operator today.\n\n[Operator instructions] I would like to turn the call over to your host, Mr. Todd Ernst, treasurer and vice president, investor relations. Mr. Ernst, please proceed.\n\nTodd Ernst -- Vice President, Investor Relations and Treasurer\n\nThanks, Michelle. Good morning, everyone and welcome to Northrop Grumman's third quarter 2022 conference call. We'll refer to a PowerPoint presentation that is posted on our IR web page this morning. Before we start, matters discussed on today's call, including guidance and outlooks for 2022 and beyond, reflect the company's judgment based on information available at the time of this call.\n\nThey constitute forward-looking statements pursuant to safe harbor provisions of federal securities laws. Forward-looking statements involve risks and uncertainties which are noted in today's press release and our SEC filings. These risks and uncertainties may cause actual company results to differ materially. Today's call will include non-GAAP financial measures that are reconciled to our GAAP results in our earnings release.\n\nOn the call today are Kathy Warden, our chair, CEO, and president; and Dave Keffer, our CFO. At this time, I'd like to turn the call over to Kathy. Kathy?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nThanks, Todd. Good morning, everyone. Thank you for joining us. The Northrop Grumman team delivered another quarter of solid performance.\n\nOur top line returned to growth with continued strong execution. Demand for our products remained robust with a book-to-bill ratio of near one, including a number of key awards in our restricted and missile defense portfolios. And we remain on track to deliver strong results for the year, with growth expected to accelerate as we look toward next year. Taking a step back for a moment from the quarter, I'd like to start with an update on the global security environment.\n\nEarlier this month, the Biden administration released its full version of the national security strategy which is used as a guide for policy and budget decisions. The strategy spotlights the dynamic and challenging threat landscape around the world and stresses the importance of working with allies, maintaining a strong industrial base and continuing to invest in advanced technology. It also reinforces the triad as a top priority. So it's clear that Northrop Grumman's portfolio continues to be extremely well aligned with the requirements outlined in the national security strategy.\n\nThis is reflected in the administration's fiscal year 2023 budget request which showed alignment with these priorities and strong support for many of our key programs. Throughout this summer, congressional committees marked up the administration's defense budget request, generally increasing the proposed level of funding with the intent of strengthening the country's defense posture and addressing the impacts of inflation. Based on these additions, we believe that the ultimate fiscal year '23 base defense budget will be higher than the President's budget request. And as you know, we started off this fiscal year in another continuing resolution which currently extends to mid-December and this is factored into our guidance.\n\nWe are confident in our program funding positions and hopeful that the annual budget will be passed by year end. Meanwhile, global commitments to invest in defense and national security capability continue. In Europe, we've seen increased demand for our integrated air and missile defense solutions and precision weapons, and advanced ammunition. In the Asia Pacific region, we've seen similar interest in air and missile defense as well as maritime ISR, advanced radar, and other mission systems.\n\nAll this points to a strong demand environment for Northrop Grumman. And we're doing our part by investing in solutions and capacity to address many of our customers' most pressing needs. This year, we expect to invest over $2.5 billion in capex and research and development. And as a result, we're winning new business and bolstering our backlog for long-term growth.\n\nOur backlog has increased year to date in each of our four segments and is up nearly 5% overall. Given this, we now expect that our full year 2022 book-to-bill ratio will be over one, a significant improvement from where we started the year. This increase is attributed not only to the robust defense budget environment but also a strong competitive win rate. That said, we recognize that our industry and many others are experiencing macroeconomic volatility that we haven't seen in decades.\n\nInflation remains at 40-year high, lead times have been extended in certain areas of our supply chain and the labor market shows signs of easing but it remains tight for critical skills. Our team is tackling these challenges, keeping a focus on our people and performance and driving efficiencies across the business. In the labor market, we've driven improvements in hiring and retention over the past several months which Dave will describe in more detail. This was instrumental in our return to growth in the third quarter.\n\nAnd it's worth noting that this favorable trend has continued into the fourth quarter as well. This supports our full year 2022 guidance and our outlook for accelerated sales in 2023. In the supply chain, we continue to experience disruptions in delayed deliveries in certain areas of our business which we have -- that has been a headwind to growth. It's a risk that we're closely monitoring and we're working with our suppliers to mitigate.\n\nBut we do anticipate that supply chain challenges will continue in 2023 and this is now reflected into our 2023 outlook. Elevated inflation levels in both labor and supply chain has persisted more than expected as we came into this year. To address this, we are implementing operational efficiencies and working with many of our customers on program funding and other contract actions to support the health of the defense industrial base. We believe this balanced approach is the best solution to allow continued investment in the capabilities to support our customers' mission.\n\nWith that said, we see these as temporal challenges and remain committed to driving our segment margin rates higher over time. Turning now to the execution of our long-term strategy. One of the key elements of our strategy is a relentless focus on performance. That's why I was particularly pleased to receive the 2022 Deming Cup for operational excellence on behalf of Northrop Grumman earlier this week.\n\nThe award recognizes our achievements and leadership in creating a culture of operational excellence and continuous improvement across the company. Our customers recognize this commitment and have entrusted us to deliver some of the most technologically advanced next-generation systems and solutions. The B-21 Raider is one such example and we're excited to unveil the aircraft to the public on December 2nd. The B-21s outstanding performance can be directly tied to our company's investment in digital tools and facilities and the incredible U.S.\n\nAir Force and Northrop Grumman team, who are developing this sixth-generation platform. The program continues to progress through testing in preparation for first flight in 2023. Last month, we announced a data-sharing agreement on B-21, enhancing data access and collaboration across the program, including the launch of a shared environment for the B-21 digital twin. This data-sharing agreement enhances our partnership with the Air Force and further demonstrates our digital maturity on the program.\n\nOur mission systems solutions are another area of our portfolio where innovation is critical to success, where the fast pace of threats and new technologies is driving the need for platforms and sensors to be able to connect with one another, share data and be part of a broader family of systems. In this growing market, we're building on our strong position in sensors, secure communications, and networking to compete for and win new opportunities. For example, last month, we were selected to be a member of the Air Force's ABMS Digital Infrastructure Consortium. And we're also seeing interest from global customers including the Australian Defense Force where we recently demonstrated a product solution with robust C2 functionality to link sensors and effectors across domains.\n\nAnother significant area of focus for the U.S. and our allies is the modernization of missile defense solutions to address current and future missile threats. We continue to strengthen our position in this area with a $1.3 billion Ground-based Midcourse Defense Weapon System award in the third quarter. This award builds on our missile defense portfolio and helps our customers defend against intermediate and intercontinental missile attacks.\n\nAnd turning to our weapons business. I'm pleased to share that we've now delivered more than 100,000 Precision Guidance Kits to the U.S. Army. These projectiles provide enhanced precision to artillery units and come embedded with built-in safety features.\n\nWe've exceeded requirements on both accuracy and reliability with these upgrades. And one last area that I'll highlight is hypersonics, where we continue to win new competitive business. Last month, the Air Force selected our Raytheon and Northrop Grumman team to develop the Hypersonic Attack Cruise Missile also known as HACM. HACM builds on our scramjet propulsion technology and ushers in a new era of faster, more survivable weapons.\n\nThis program is one of several hypersonic opportunities within our portfolio. We're approaching this market as both a prime and a sub, bringing our expertise in high-speed propulsion, survival navigation, and targeting capabilities and systems integration to multiple solutions. These are just a few examples of markets where we continue to grow our business by delivering the products and solutions that our customers want and need, while also building long-term value for our shareholders. So now, I'll turn it over to Dave, who will provide more color on our Q3 results and touch on our expectations for 2023.\n\nDave?\n\nDave Keffer -- Chief Financial Officer\n\nOK. Thanks, Kathy, and good morning, everyone. As you heard from Kathy, we delivered solid results across all key metrics in Q3. We're reaching an inflection point in our sales growth, driven by the strength in the demand environment, our new business performance, and our success in hiring and retaining employees.\n\nWe had another strong quarter for bookings with roughly $8.7 billion in awards. This contributed to a year-to-date book-to-bill ratio of 1.14 and an increase in our full year book-to-bill expectations. Our Q3 top-line results of roughly $9 billion, were up sequentially from Q2 and up about 3% compared with the third quarter of 2021. This acceleration has been driven by our positive hiring trends.\n\nWe added nearly 1,000 net new employees in Q2 and we added an additional 2,700-plus people in Q3. With continued positive hiring and retention results, we've improved our labor-driven sales visibility, so the supply base is now the key to achieving our full year sales outlook. We're seeing temporal challenges in the supply chain, as are most others, including longer lead times and higher costs in some areas. Our suppliers are a critical element of the Defense Industrial Base and we're closely monitoring small businesses, who are the most vulnerable to the challenges of this macroeconomic environment, particularly inflation.\n\nWe're encouraged by recent comments from Congress on this topic and we're actively working with our customers to help mitigate inflationary effects on our contracts, including those being felt by our suppliers. Our program execution remained solid in the quarter, with segment margins of 11.2%, reflecting lower net EAC adjustments due in part to the inflationary pressures that we've noted. As costs have remained elevated, we've captured our latest estimates of inflation and opportunities to mitigate it in our EACs. This had a downward effect on our margins in Q3.\n\nBut year to date, our segment margins are 11.7% and we continue to expect the full year rate to be in the range of 11.7% to 11.9%. Turning to earnings per share. Our diluted EPS in the quarter were $5.89. The year-over-year earnings decline was driven by nonoperational factors, including lower net pension income, unfavorable returns on our marketable securities, and an insurance settlement for $60 million that was recognized in the third quarter of 2021.\n\nTogether, these items represented roughly $0.85 of year-over-year EPS headwinds but as I pointed out, our businesses continue to execute very well in a complex environment. In terms of cash, we generated outstanding operational cash flows in the third quarter of over $1.3 billion and we expect Q4 to be even better. This is consistent with our historical pattern of collections and disbursements. In the quarter, we made our third cash tax payment associated -- aided with the R&D amortization law of approximately $220 million and we continue to expect roughly $1 billion in cash tax payments related to R&D for the full year.\n\nThrough the end of Q3, we completed over $1 billion in share repurchases and we're on track for an additional $500 million in the fourth quarter. Now moving to 2022 guidance. We have not changed our sales, earnings or cash outlooks. The foundation for our strong financial performance starts with the continued demand we're seeing for our products.\n\nWe're increasing our expectation for book-to-bill again this quarter to greater than one time which is a significant improvement from our original expectation. Our team has done an outstanding job of serving as a trusted partner to our customers in winning new business. We're maintaining our original guidance for the top line. And based on year-to-date results, we continue to expect our full year sales to be around the low end of the range, consistent with the trends we described last quarter.\n\nOur full year outlook implies Q4 sales of roughly $9.6 billion which represents excellent sequential and year-over-year growth. As we've noted throughout the year, we anticipate that Q4 will include a strong volume of material receipts across each of our four segments. We're also maintaining our guidance for the bottom line, including segment OM rate and earnings per share. Given that 2022 sales volume will be around the low end of the range, we expect EPS to be near the low end of its range also.\n\nWithin our earnings outlook, we're accounting for continued year-to-date pressure on our marketable securities portfolio, offset by an anticipated federal tax rate benefit in Q4. Our marketable securities are down nearly $100 million in 2022 which represents about $0.50 of earnings per share pressure. But on the income tax line, we've lowered our effective rate expectation from 17% to 15.5%, reflecting progress in resolving matters related to historical filings in one of our businesses. We currently expect those matters to be concluded in Q4, resulting in about $0.50 of EPS benefit that offsets the marketable securities pressure.\n\nIt's also possible that the tax item could be resolved in Q1 which would shift the benefit from 2022 into 2023. Moving to cash flows. While we remain optimistic that Congress will repeal or defer the R&D amortization law, we have focused our free cash flow guidance this year on the current tax laws scenario which is unchanged from last quarter. If the law is deferred or repealed in Q4, we would expect a onetime spike in state taxes recognized in corporate unallocated expense, as well as a cash refund in 2023.\n\nOperationally, we're very pleased with the progress we made in cash flows in Q3, bolstering our confidence in the full year outlook. Next, I'd like to take a few moments to describe the outlook for our pension plans. Most importantly, our current funded status remains strong and roughly unchanged year to date and the cash flow implications of CAS changes over the next several years provide a modest benefit. The GAAP income statement effects I'll describe today are noncash in nature.\n\nYear to date, our plans have experienced double-digit negative returns and discount rates have risen nearly 250 basis points. This combination of results will affect our GAAP earnings in future years. So I'd like to take a moment to discuss what our 2023 net pension income would look like under various scenarios. In January, we provided a sensitivity table in our earnings call deck related to changes in discount rates and asset returns on our nonservice FAS pension income.\n\nBased on the high level of volatility, the pension funds have experienced so far this year, I wanted to provide a grid of potential outcomes that also incorporates FAS service expense and CAS costs which can be found on Slide 9 of our presentation today. To help calibrate you to this slide, we've highlighted the 2023 pension estimates provided in January which were based on expected 2022 asset returns of 7.5% and a year-end discount rate of roughly 3%. Given the year-to-date asset returns and discount rates at the end of Q3, we would expect significantly lower net FAS pension income in 2023, currently in the range of over $900 million less than our previous projection. As I've described, this lower net FAS pension income is noncash in nature.\n\nOver time, higher CAS recoveries would lead to modestly higher cash flow related to our pension. I also wanted to provide additional insights on a high-level financial outlook for 2023. Note that this is predicated on our current expectations regarding the macro environment. As Kathy said, we expect strong demand to continue into 2023.\n\nIn terms of hiring and retention trends, as I've now shared a few times, we've seen improvements since the beginning of 2022 and we anticipate that this will remain consistent next year. In the supply chain, where the environment has remained challenging with various delays and disruptions, we project that those challenges will continue throughout 2023. And with regard to inflation which has been more persistent in '22 than originally expected, our projections incorporate gradual easing based on the latest industry labor and material indices. As Kathy described, we continue to expect our sales growth to accelerate next year, building on the momentum we've driven in 2022.\n\nIn total, we expect sales growth in the 4% to 5% range. Based on our low $36 billion expectation for 2022, that would put us in a high $37 billion range for 2023. Within our segments, we continue to expect space to remain our fastest-growing business, with sales growing by another $1 billion over 2022. We expect strong sales growth in MS in the mid-single-digit range.\n\nAnd we anticipate sales at AS and DS to be flattish compared with their latest 2022 levels. We also expect to generate solid segment margin rates. As I've described, net EAC improvements are likely to be lighter than usual until inflation begins to normalize. So we'd expect our segment OM rate which would otherwise have been projected in the high 11% range next year, to be between the mid-11% and the high 11%.\n\nWith regard to earnings, pension income will be a noncash headwind as quantified on Slide 9. But excluding pension, we expect our earnings per share to grow faster than sales in 2023, driven by continued strong execution and a lower share count. We expect our tax rate to return to its more normal level of around 17% next year. And we continue to generate excellent cash flows with our prior three-year cash outlook intact and another year of free cash flow growth expected in 2025.\n\nWe anticipate modest increases to our prior capex projections based on the strength of this year's new business wins and backlog growth, offset by corresponding improvements in operating cash flows. We're very proud of the performance we've delivered this year in a continued challenging environment and we're pleased with our projected growth acceleration in the second half of 2022 and in 2023. With our multiyear cash flow outlook intact, we're looking forward to continuing to create value for our customers and shareholders. And with that, we're ready for your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Doug Harned with Bernstein. Your line is open. Please go ahead.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nGood morning. Thank you. You talked about supply chain here and that's obviously an issue across the board. Is it possible to look at the constraints you had from the supply chain and give us a sense of what the quarter and the year might have looked like had you not had those constraints? We're just trying to figure out, what sort of normal would be and how much is being held back?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nDoug, good morning, and thanks for the question. Supply chain certainly is central to not only the remainder of this year but next. So let me try to characterize, not particularly in numerical terms but in more -- less quantitative terms, what we have been seeing. It is in particular areas of the supply chain.\n\nSo it is not widespread but it's in areas that are important -- is component to our development programs, in particular, where we have seen delays that then result in impacts to those development efforts. And so it's the timing of sales not necessarily a deferment of sales, if you will. And this year, I would point to our 2022 original guidance which was our expectations with either minimal or no supply chain disruption, because when we put that plan together late last year, we were not anticipating the level of supply chain disruption nor the duration of supply chain disruption that we've experienced. So throughout the year, we've pointed you now to the low end of our sales guidance.\n\nAnd I would say the best way to think quantitatively about the impact is, we would have expected to be on the high end of that guidance had we not experienced the supply chain disruption. Now I do want to point out and we've said it in the call that we expect these challenges to persist into 2023. So when I talk about timing, we do not expect all of what we experienced in 2022 to recover by the end of 2023. We expect these issues to be a bit sticky for the next year.\n\nWe do expect them to resolve in the 18- to 24-month time frame.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nAnd as you go into 2023, you said in the outlook that space is expected to be up by about $1 billion but flat at Aeronautics. So can you help us understand what the drivers are in those two units that lead to somewhat different results? Obviously, you have huge backlog in space. But just trying to understand those two trajectories?\n\nDave Keffer -- Chief Financial Officer\n\nSure. Doug, I'm happy to shed some light on that. In both cases, those trends are consistent with what we've communicated previously and the drivers are therefore consistent as well. Starting in AS, we project a stable 2023 given that there is anticipated growth in programs, including B-21 but then offset by modest declines in programs like the legacy programs in the HALE portfolio, Joint STARS, etc., modest decline in F-18 likely over the next couple of years.\n\nSo again, continuation of trends we've been talking about for a while and we continue to anticipate a growth recovery in 2024 for that business. In space, the expansion and the growth opportunity is broad-based across multiple orbits, across multiple mission areas from missile tracking to ISR, growth in our supportive launch capabilities. It's really an outstanding segment of performance for us recently on the growth side. You see a growing market but growth also in our market share.\n\nOf course, GBSD is a contributor to that growth but by no means the only one. Each of our divisions in that business is growing at a nice clip. So we're really pleased to be able to continue that outlook in '23.\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. And one moment for our next question. And our next question comes from the line of Ronald Epstein with Bank of America. Your line is open.\n\nPlease go ahead.\n\nRonald Epstein -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Good morning. Maybe just a question on capital deployment. You're going to be generating a lot of cash as you pointed that out.\n\nWhat's your plans to do with that into next year? Is there -- is it just share buybacks? Or is there some selected M&A? Or how are you thinking about that?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nSo our -- plans for capital deployment are still aligned with what we've been saying all year, a balanced approach to capital deployment, still investing in supporting the growth of the business that we've experienced which as we said, has been even more robust we anticipated coming into this year, not just because demand is higher but we have been quite successful in competitive wins. So we'll continue to invest to be able to deliver that business successfully and generate the resulting earnings and cash flows from it. We also look at our dividend as a significant part of our capital deployment strategy. We have been consistently raising the dividend, this year another 10% increase.\n\nAnd so we will think favorably into next year about the dividend as a mechanism for returning capital to shareholders. The remaining piece is share repurchase which I know was the core part of your question and this year, we are on track for $1.5 billion of share repurchase. We plan to complete that. We do expect that to be slightly higher next year.\n\nAs we look at our plans for capital deployment, we will share those with you in more specificity and what our guidance is for share count in January. But safe to say, we are still on the mindset of returning 100% of our free cash flow to shareholders. And those three elements are the major ways in which we'll do that in 2023.\n\nRonald Epstein -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And then one follow-on, if I can. On the supply chain stuff that's been impacting the whole industry. Are you seeing DoD doing anything to help resolve it? Because some of the issues, it seems like you're running into it, everybody's running into it.\n\nIs DoD doing anything to help the industry?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nYes, they are. And I applaud the work that DoD is doing. I think they and we would agree that we need to continue to do more, particularly for medium and small businesses, who find themselves lower in the supply chain and even in circumstances where primes may have a cost-plus contract. They often have fixed prices that we need to adjust.\n\nAnd so the government working with the prime to address that impact on small businesses, I outlined in my comments earlier on this call, is going to be important for the health of the Defense Industrial Base. And we, as an industry, are doing our part. Certainly looking at those investments and managing some of our cash into the supply chain in ways that we have not historically done for the benefit of keeping those businesses healthy. And we've been doing that now for the last several years, really since the pandemic began and I expect we will continue to do that.\n\nThere are impacts, though, to large business as well. And so we are all in this together, as you point out and we have work ahead of us. I am encouraged by Congress' comments that they expect that the '23 budget will start to address some of these challenges. And I'm hopeful that as the administration puts their 2024 budget together, they will continue on the path to identifying funding that would allow us to keep the Defense Industrial Base healthy.\n\nRonald Epstein -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. And one moment for our next question. And our next question is going to come from the line of Myles Walton with Wolfe Research. Your line is open.\n\nPlease go ahead.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nThanks so much. Dave or Kathy, I'm not sure which. The fourth quarter recovery, I think you pointed out was going to come from receipt or timing of material receipts. I'm just curious, does that put you more at risk from supplier performance than your own internal performance, as you go into the fourth quarter? Is that the way to think about it?\n\nDave Keffer -- Chief Financial Officer\n\nMyles, it's Dave. I'm happy to address that one. I think the way we look at it is, the really strong head count growth that we've had over the last quarter, in particular but the last six months broadly, adding approximately 4% to our overall employee count or over 3,500 employees really shores up the labor visibility for labor-driven sales for 2022 and sets us off on a good track for '23. And to your point, that means the supply base and its performance are key to the fourth quarter.\n\nWith that said, we've had a year now of these more challenged supply chain conditions to become accustomed to where there are constraints and where there are not. And I give a lot of credit to our supply chain folks and our program teams, who are managing and mitigating those challenges every day. We think we've got that captured in our outlook for Q4. The pressures to date have pushed us toward the low end of the sales range for the full year and we think that's appropriate caution as a result of the supply chain conditions but feel that we've bounded it well in that range as we think about Q4 and the full year now.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nOK. And maybe just a follow-up. Within space, the negative EACs there. Is it -- is there any program-driven drivers to those negative EACs? Or is it purely cost and inflation dropping through across the portfolio?\n\nDave Keffer -- Chief Financial Officer\n\nThere was not any one single program EAC that drove a material change this quarter in the space business or any other across our portfolio. I think you're right to point to the broader market conditions. Costs are escalating at a level not expected a year or two ago. We're mitigating that very well across our business.\n\nBut in fact, our latest expectations are factored into the EACs on our programs and that did have a dampening effect, particularly in space's margins in Q3.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. And one moment for our next question. And our next question comes from the line of Kristine Liwag with Morgan Stanley. Your line is open.\n\nPlease go ahead.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nHey. Good morning, Kathy and Dave.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nHi, Kristine. Thanks.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nOne of your peers has recently announced significant new share repurchase authorizations using debt. Considering the multiyear visibility in the cash flow, the strength in the balance sheet, and the upward pressure on defense budgets, would you consider levering up an increased buyback similar to what the company did a decade ago?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nWell, Kristine, I wouldn't rule it out as we sit here today but I'm also not announcing any plans. We currently are executing our strategy which is, as I said a few minutes ago, for a balanced capital deployment strategy and we think that is the right thing for our company. Our foundation and fundamentals are incredibly strong. With the growth in our backlog, the ability to grow the business top line, we want to ensure that we're investing appropriately in that.\n\nIt's the best thing for our shareholders in the long-term, we believe, as well as our customers who need this capability and capacity that we're delivering. So that remains our top priority. And we, as I have said, are committed to return 100% of our free cash flow this year and that to our shareholders and we'll do that in the balance of dividends and share repurchase. But as you know, we have used ASRs in the past and we have looked at share repurchase and we'll continue to do that on a regular basis and keep you apprised of any change in our plan.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nGreat. And if I could do a follow-up. You mentioned that you expect supply chain issues to persist into 2023. Can you provide more color on what's embedded in your 2023 revenue outlook of 4% to 5%? Where are the risks and opportunities to that?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nSo in the -- earlier in the call, we outlined three major elements that we are monitoring closely. The first is our own labor. And we have talked about that throughout this year as being a bit of a headwind for us in the first half of the year. We were not adding headcount and retaining headcount at the level we needed to fuel our growth.\n\nAnd that started to turn the corner in the summer. And you've seen in the third quarter, really robust results in net headcount growth, as Dave outlined, with nearly 3,000 adds. We are this environment that we're experiencing currently, not necessarily nearly 3,000 adds in a quarter but this hiring and retention environment is what persisted into 2023. There could be some opportunity there.\n\nAs you all know certain firms are reducing their headcount or at least their hiring. So ER, as I noted, seen that in certain areas, the labor market is starting to soften. But we aren't counting on that being a significant tailwind to us next year. We're looking at it continuing about like we see it today.\n\nIn supply chain, as we noted, we do expect the disruption that we now see in the supply chain to have lingering effects into 2023. And we've done our best to capture those in what we've now reflected as our updated guidance. But if they were to get worse, we certainly would have some downside risk. I don't expect them to get significantly better.\n\nSo unlike labor, I would say that one is more of a risk. And then in the third area of inflation, we are tying to the indices as we look forward. We certainly have now captured the inflationary pressures that some of what we indicated was the downside on segment operating margin rates that we saw in the third quarter of this year. And your guess is as good as mine as to, when this inflation really start to modulate.\n\nSo we're using the indices as our best way to get our arms around that. I don't see that as a big opportunity or risk. I think that one we probably have hedged pretty well but we're monitoring it, as I said. So that was a lot of context.\n\nBut I think it's important because we did put a 2023 outlook in front of you, even at this early stage which we often do but I will say this is a more volatile time than we often experience going into the following year.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nGreat. Thank you for that context and the color.\n\nOperator\n\nThank you. And we'll move on to our next question. Our next question comes from the line of Rob Stallard with Vertical Research Partners. Your line is open.\n\nPlease go ahead.\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nThanks so much. Good morning.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nGood morning.\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nDave, I'm going to start with you. On the 2023 margin guidance, are you expecting any major changes in the segments versus where they're likely to end up at the end of this year?\n\nDave Keffer -- Chief Financial Officer\n\nThanks for the question, Rob. We do not anticipate meaningful movements in the segments as we look at '23. Let's talk in aggregate first and then I'll give you some color on the segments. As you'll recall, our segment OM rate was in the 12% range in the first half of this year.\n\nWe talked on the call today about the fact that that will fluctuate a bit from quarter to quarter. We worked through some of -- temporal challenges that we and most other industries face these days around inflation and supply chain and such and noted some of that in the Q3 result. Year to date, we're in that guidance range we've provided for the full year. As we talk about next year, we noted mid- to high 11% or our current expectation.\n\nThink of that as in the range of 20 basis points lower next year than we're seeing this year. And at a business level, what I'd highlight is in a few of the areas where we had unique upside in the first half of the year, that's where we would expect that to normalize and create some of the lower margin profile next year. I'd note, AS had a land sale in the second quarter. So you can think of that as 20, 30 basis points of margin rate pressure on a year-over-year comp basis.\n\nIn space, we think the volume of new development work they've continued to add and the pressure that's put on their margin this year is again a good reflector of what you'd be likely to see next year in space. mission systems and defense continues to perform well on the margin rate side and we don't anticipate meaningful movement there. MS did have some strong upside in the first half. So we'll look to see what they can continue to deliver in '23.\n\nAgain, no meaningful movements across the board. I'd just adjust for some of those comparability items in '23 to get a segment-level view.\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nThat's great. Very helpful. And then just a quick follow-up for Kathy on the B-21. We're looking forward to the rollout in December.\n\nBut I was wondering, how the numbers on the program are progressing. Practically, you're making good progress. But given it's a fixed price program with inflation, how are the margins on this program going?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nYes, Rob. Thanks for the question. We are also very excited about the rollout on December 2nd but we are keeping our focus on the performance of the program. So while it's important for us to celebrate milestones as they come.\n\nIt's also long-term program, as you suggest. And so we are working that program as we are all to each quarter reflect what we know about the current environment and our projections going forward. And as we outlined earlier this year, we spent a good bit of time actually talking through the B-21 and how we were keeping our assumptions updated. That continues to hold true.\n\nAnd so there's nothing to report to you in any material change on our outlook for the profitability on that program.\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nThat's great. Thank you very much.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And one moment for our next question. Our next question comes from the line Sheila Kahyaoglu with Jefferies. Your line is open.\n\nPlease go ahead.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nHi. Good morning, Kathy and Dave. Thank you.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nGood morning.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nYou talked about flattish defense sales next year. Can you give us some of the puts and takes in the business with supply chain? Does that continue to linger and what's going on in the services side? And maybe incremental opportunities with programs, such as IBCS and missiles and how you do think about Europe playing into that as well?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nThanks, Sheila. Certainly, the disruption that we're talking about does hit short-cycle businesses a little more than long cycle. And so there is a bit of that in defense but really, it's more about the portfolio shift that we are making. One is the growth that we're seeing in munitions and particularly that demand which we expect to grow even more with the conflict in Ukraine.\n\nBut we also see IBCS as a centerpiece of that growth, both domestically and internationally. I noted in my comments that we have gotten significantly more increased interest in demand coming out of Europe on IBCS over the last several months. So those are growth drivers. But those are offset by retirements of legacy platforms that we sustain out of the defense systems sector.\n\nAnd we've been talking about those as headwinds to AS for a while. But as those programs are retired, those platforms sustainment impacts are being felt in DS. So that would be programs like Joint STARS and Global Hawk.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. And one moment for our next question. And our next question comes from the line of George Shapiro with Shapiro Research. Your line is open.\n\nPlease go ahead.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nThank you. Dave, in terms of your margin guidance next year, how much lower are you expecting EACs to be? Because this year, they're running so far like $150 million lower than last year, and yet you're getting help in AS but the margin looks like it's going to turn out to be similar to where it was last year.\n\nDave Keffer -- Chief Financial Officer\n\nSure. George, as you know, we don't have a specific dollar-for-dollar expectation of net EACs on any one program or in fact, in aggregate, going into a typical year. What we do get a sense for is kind of trends in aggregate volume. And in 2021, for example, we had a unique trend associated with the benefit in our rates from the pension benefit.\n\nIn 2022, we've had a couple of upside items, as you mentioned, in AS. But broadly speaking, the pressures that we've noted from the macro environment this year. And what I'd characterize '23 as is more of a continuation of some of those macro pressures, as Kathy outlined nicely earlier in the supply chain and the inflationary environment. And so we'd anticipate what I'd characterize as a continuation of the lower net EAC trend in '23 based on what we know today.\n\nBut I wouldn't put too fine of a point on the dollar amount today. We'll give you more insights on that as we get into the January guidance call.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nYes. I'm just looking at the fact that this year's segment margin is likely to be similar to last year's and yet EACs are running already $150 million below where they were last year. So maybe they'll be down $200 million for the year. And so you got to have a pretty sizable, maybe a bigger drop next year.\n\nI mean, otherwise, why wouldn't the margin be similar to the high 11% like you're seeing this year?\n\nDave Keffer -- Chief Financial Officer\n\nThat high 11% margin rate is predicated on a certain volume of both program performance and net EAC benefits. We're projecting a wider range currently in the mid-11s to the high 11s, because it's tough to project, as Kathy noted earlier, with too much specificity given the macro environment we're in today. Our program performance continues to be exceptional. But we think today, the appropriate outlook is about 20 basis points lower margin rate next year with continuation of -- kind of the second half trends we're seeing this year in net EACs.\n\nI think that's about as specific as we can be at this point in the process, George.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nOK. And then one quick one. How much contribution will GBSD and NGI beat to the $1 billion growth that you're talking about in the space in '23?\n\nDave Keffer -- Chief Financial Officer\n\nWe project GBSD to be a little less than half of that growth. NGI will also be a contributor but then there are a number of other programs. The wins we've talked about this year at Space Development Agency, continued growth in the GEM63 portfolio with the Amazon Kuiper expansion there. There are a number of drivers of growth across our space portfolio, both national security, civilian, and otherwise.\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nOK. Thanks very much.\n\nOperator\n\nThank you. And one moment for our next question. And our next question comes from the line of Seth Seifman with J.P. Morgan.\n\nYour line is open. Please go ahead.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nThanks very much and good morning, everyone. Kathy and Dave, I know you are just in the early stages of 2023, so sorry to bring up 2024 but you guys have talked about cash flow target for that year and also segment margin, I think, in the 12% range. Are you still on target for reaching those goals?\n\nDave Keffer -- Chief Financial Officer\n\nSure. I can touch on that. As we noted today, we've continued to reaffirm our multiyear cash flow outlook. For '23, that's intact, for '24 as well.\n\nAnd as we noted on the call today, we expect another growth year in 2025. We'll be more specific in quantifying that on our January call when we'll do our typical update of the multiyear quantified free cash flow outlook. And so continued strength in the expected returns from the business. We'll update the specific numbers there based on Section 174 legislation status in January.\n\nOn the margin rate side, as we noted, we were operating at that 12% level in the first half of this year. Businesses continued to execute well and mitigate broader macroeconomic challenges. We're anticipating about that 20 basis points of decline based on what we currently see in 2023. We do anticipate longer-term recovery.\n\nIt's tough at this stage of the game to project whether that recovery back to the high 11s and the 12% level occurs as soon as 2024 or whether it's subsequent to that, a lot of that will depend on the pace of recovering these macroeconomic factors. But again, critically, the sales growth expansion we see next year, the acceleration of the 4% to 5% range, multiyear free cash flow guidance remaining intact, I think, is indicative of the kind of economic value we're delivering even in this environment.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nGreat. And just as a quick follow-up, with the supply chain challenges lingering into 2023 and probably lessening through the year, should we expect a similar distribution of sales throughout the year in '23 that we've seen in '22 in terms of the percentage per quarter?\n\nDave Keffer -- Chief Financial Officer\n\nIt's premature for me to give you a percentage by quarter at this stage. We're doing our best to give you our latest insights into the full year outlook. Some of that quarterly profile ends up being determined by the timing of material receipts on large programs and across the business space. So give us a few more months to give you a quarterly profile.\n\nWe'll certainly do so. We'll give you more insights on that in January as we typically do.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nFair enough. Thank you.\n\nOperator\n\nThank you. And one moment for our next question. Our next question comes from the line of Ken Herbert with RBC Capital Markets. Your line is open.\n\nPlease go ahead.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nGood morning, Kathy and Dave.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nGood morning.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nKathy, relative to -- or Dave, relative to the initial expectations in the year, you've seen stronger bookings that you've called out as we've gone through the year. And I'm just wondering, if you can parse that out a little bit. I know you called out share gains but how much of that has been share gains versus maybe an acceleration or timing around contracts? And how much should we sort of read through or think about maybe an expanded opportunity set for you heading into '23 based on some of the stronger bookings this year?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nThanks for the question. When we look at the portfolio, it has been broad-based in terms of the improvement that we've seen in our expectations for book-to-bill. All four segments now projecting over one. And it has been most pronounced in space, where we've called out some specific opportunities that were competitive.\n\nSo to your point, taking share that we were able to secure that we may not have anticipated winning as many of those as we started the year as we ultimately have. We feel that we are in a good position with backlog in each of the businesses going into 2023, supporting the accelerated growth that we've laid out in our outlook for next year. We don't expect that our book-to-bill next year will be as robust as it was this year, because we do have quite a bit of backlog that we will be carrying into the year, and the opportunities that is not as strong in 2023 but we do see then that picking up again in '24 and '25. So I would tell you, we tend not to look at awards on a single-year basis and calculate book-to-bill only on a single year.\n\nWe look at it on a running basis and our system is strong, as an aggregate over the last three years, we expect that to continue well into the future.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nThat's helpful. And as you think about the strength -- the comment you just made on strength in the '24, would that be more on the space side within space or maybe more on the Launch and Missile side, or any color on that would be helpful?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nFor space, we've seen broad-based opportunities across both Launch and Missiles as well as our space segment and we expect that to continue, there are multiple programs that will be selected for next phase and be awarded in that time frame in both elements of our space business.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nGreat. All right. Thank you very much.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And one moment for our next question. And our next question comes from the line of Scott Deuschle with Credit Suisse. Your line is open.\n\nPlease go ahead.\n\nScott Deuschle -- Credit Suisse -- Analyst\n\nHey. Good morning. Thank you for taking my question.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nGood morning.\n\nScott Deuschle -- Credit Suisse -- Analyst\n\nAnything you can say about the equipment sales that impacted Q3 free cash flow? Is that similar in nature to the large equipment sales that AS booked a while back?\n\nDave Keffer -- Chief Financial Officer\n\nIt is actually cash flow associated with that equipment sale booked a while back. So it is the timing of payments driving a particular cash receipt this quarter but it is fully associated with the equipment sale you noted from the past.\n\nScott Deuschle -- Credit Suisse -- Analyst\n\nOK. Got it. And then, Kathy, just on NGI. Is it reasonable to think that you might be able to offer some cost savings to your customer there, if there's product commonality between the Interceptor and then the GBSD booster? And would you potentially design for commonality there in order to drive that cost benefit to the customer?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nWell, it's an excellent question. And because we're in an active competition, I won't speak too much about our approach. But what I would say is that we constantly look for ways to deliver more value to the customer based on a broad set of capabilities, both in the case of Interceptors as well as our missile defense portfolio which I've noted, has been growing and we expect it to continue to grow. Taking a full mission understanding of the threat environment as it evolves and bringing it back into our product development strategy is key across the entire portfolio but NGI will also benefit from that level of expertise that we have with the threat, the solution elements, and submission.\n\nScott Deuschle -- Credit Suisse -- Analyst\n\nMakes sense. Thank you.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And one moment for our next question. And our next question comes from the line of David Strauss with Barclays. Your line is open.\n\nPlease go ahead.\n\nDavid Strauss -- Barclays -- Analyst\n\nThanks. Good morning.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nGood morning.\n\nDavid Strauss -- Barclays -- Analyst\n\nKathy, F-35 cuts across a number of your businesses. I think you've talked about it being 10% of sales in total. Can you give us an idea of what you've got baked in for F-35 in total in 2023 from a -- I assume, it's declining a bit with DAS rolling off and so on? But can you give us an idea of what's baked in for F-35 in '23? And whether as you look beyond '23, F-35 stabilizes or maybe even begins to grow again?\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nWell, David, actually, when we look across the entirety of the company, F-35 is pretty flat going into 2023. So we have a lot of moving parts, as you indicated. In aerospace , we have volume that is fairly consistent in our case. Because remember, we build a couple of years, about 18 months ahead of Lockheed Martin.\n\nAnd so we are maxing out at our limitations of capacity for building center fuselages. And so that project flattish into 2023, as Dave noted earlier. But in our mission systems side of the business, while we have DAS which is being replaced with new product insertion. We're also working on new products insertion in the other elements of the portfolio.\n\nSo we have some development work going on in Block 4 that continues to grow and production there, too, is fairly stable as we look out over this time period and sustainment is growing. So when you take all of those elements across the entirety of our portfolio, F-35 is pretty flat going into 2023 and we expect to be relatively flat going into 2024, maybe a little bit of upside to that.\n\nDavid Strauss -- Barclays -- Analyst\n\nAll right. Perfect. That's very helpful. And then on the -- back on the margin guide for next year.\n\nWould you characterize the drop, I guess, before I think we were all thinking kind of flattish next year and then maybe improving a bit in '24. Would you characterize the lower guide, is that more mix related? Maybe your lower-margin programs are accelerating faster than you had expected? Or is this inflation related or some combination of both?\n\nDave Keffer -- Chief Financial Officer\n\nI would say, it's a combination of all of those factors but leaning more toward the macro factors. This is a unique environment that we're all operating in these days and we're eyes wide open to the continuation of a lot of those pressures in 2023. And that's why we think it's not a huge impact but call it, 20 basis points compared to the high levels we've been operating at in 2022. I think importantly, as you get down to the earnings per share line, excluding the noncash pension element of it, we anticipate EPS growth faster than even the 4% to 5% accelerated sales growth.\n\nSo we're managing through these times, I think, particularly well when you think about the pace of EPS acceleration as well.\n\nTodd Ernst -- Vice President, Investor Relations and Treasurer\n\nAll right. We're going to have to leave it there. I will give one more. All right.\n\nWe'll leave it there. I'll turn it over to Kathy for closing remarks.\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nThanks, Todd. Look, before concluding today's call, I'd just like to take a moment to thank our entire team for another strong quarter in what we have appropriately characterized this challenging macroeconomic time. So business fundamentals for Northrop Grumman remain incredibly strong and that's due to the work of this entire team. But I want to especially think one of our team members, Mary Petryszyn, who will be retiring from Northrop Grumman in January.\n\nShe has provided 10 years of outstanding service to our company, most recently as the defense systems front and we wish her the very best. On October 17th, I'm sure you all noted that Roshan Roeder became our new president of defense systems. She is an experienced executive in our company. I'm very confident in her ability to take the business to the next level and I look forward to introducing her to many of you.\n\nSo thank you for joining our call today. I expect to see many of you in the coming months. But for those, I don't see, let me wish you a healthy and happy holiday season and we look forward to talking to you in January.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTodd Ernst -- Vice President, Investor Relations and Treasurer\n\nKathy Warden -- Chairman, President, and Chief Executive Officer\n\nDave Keffer -- Chief Financial Officer\n\nDoug Harned -- AllianceBernstein -- Analyst\n\nRonald Epstein -- Bank of America Merrill Lynch -- Analyst\n\nMyles Walton -- Wolfe Research -- Analyst\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nRob Stallard -- Vertical Research Partners -- Analyst\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nGeorge Shapiro -- Shapiro Research -- Analyst\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nScott Deuschle -- Credit Suisse -- Analyst\n\nDavid Strauss -- Barclays -- Analyst\n\nMore NOC analysis\n\nAll earnings call transcripts"
}