{
  "companyName": "WEX",
  "companyTicker": "WEX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/wex-wex-q3-2022-earnings-call-transcript/",
  "content": "WEX (WEX 0.14%)\nQ3 2022 Earnings Call\nOct 27, 2022, 10:00 a.m. ET\n\nOperator\n\nMy name is Chantal, and I will be your conference operator today. At this time, I would like to welcome everyone to the WEX Q3 2022 earnings conference call. As a reminder, today's conference call is being recorded. [Operator instructions] Thank you.\n\nSteve Elder, you may begin your conference.\n\nSteve Elder -- Vice President, Investor Relations\n\nThank you, operator, and good morning, everyone. With me today is Melissa Smith, our chair and CEO; and our CFO, Jagtar Narula. The press release we issued earlier this morning and a slide deck to walk through our prepared remarks have been posted to the investor relations section of our website at wexinc.com. A copy of the release and the slide deck have also been included in an 8-K we submitted to the SEC earlier this morning.\n\nAs a reminder, we will be discussing non-GAAP metrics, specifically, adjusted net income attributable to shareholders, which we refer to as adjusted net income, or ANI, adjusted operating income and related margins as well as adjustments free cash flow during our call. Please see Exhibit 1 of the press release for an explanation and reconciliation of adjusted net income attributable to shareholders to GAAP net loss attributable to shareholders, an explanation and reconciliation of adjusted operating income to GAAP operating income and a reconciliation of adjusted free cash flow to GAAP operating cash flow. The company provides revenue guidance on a GAAP basis and earnings guidance on a non-GAAP basis due to the uncertainty and indeterminant amount of certain elements that are included in reported GAAP earnings. I would also like to remind you that we will discuss forward-looking statements under the Private Securities Litigation Reform Act of 1995.\n\nActual results may differ materially from those forward-looking statements as a result of various factors, including those discussed in our press release and the risk factors identified in our annual report on Form 10-K for the year ended December 31, 2021, filed with the SEC on March 1, 2022, and subsequent SEC filings. While we may update forward-looking statements in the future, we disclaim any obligations to do so. You should not place undue reliance on these forward-looking statements, all of which speak only as of today. With that, I'll turn the call over to Melissa.\n\nMelissa Smith -- Chief Executive Officer\n\nThanks, Steve. Good morning everyone and thank you for joining us today. I'll open up the call with a word that most embodies our company, resiliency. This past year has witnessed significant economic and geopolitical events from war in Ukraine to inflation and rising interest rates at home.\n\nThrough it all, WEX continues to grow its business and perform well for our customers, our employees and our shareholders. I'll focus my comments this morning on three areas: Q3 financial results, highlights from the quarter across each of our segments and updates on several initiatives. Let me start with Q3 financial results, which we released earlier this morning. I'm pleased to report that WEX had a record quarterly revenue that exceeded our expectations.\n\nRevenue in the quarter was $616 million, a year-over-year increase of 28%. This strong Q3 growth an increase about $133 million year over year was primarily driven by continued volume growth across the business, the impact of higher fuel prices and normalization of late fees. The majority of revenue growth was due to volume and fee growth. So the benefit of higher fuel prices represented approximately $56 million of the increase.\n\nOn an organic basis, which excludes the impact of fuel prices, foreign exchange rates and an accounting presentation change revenue grew 22% compared to prior-year's period. This performance reflects the power of our growth engine in the reoccurring nature of our business. Total volume processed across the organization in the third quarter grew 41% year over year to $57.5 billion driven by strong performance in each of our segments. Record quarterly revenue paired with the scalability of our business model resulted in adjusted net income for diluted share of $3.51, an increase of 43% compared to the same quarter last year.\n\nI'm really pleased with our results this quarter. Let me add some color to this success by touching on a few highlights where we continue to gain momentum in the markets we serve. In our Health and Employee Benefit segments, we continue to see strong account growth, including signing the American arm of a leading global consumer electronics company. I'm also pleased with our investment over the past few years to be able to serve as the custodian of our HSA accounts.\n\nFor an offering that we did not provide in 2020, we're now the sixth largest HSA custodian according to Devenir. Our customers continue to choose our health offerings for our customer focused innovations, the rich data insights and the service we provide our customers' employees along with the breadth of our health ecosystem. Our capabilities span HSAs, FSAs, COBRA, benefit administration, data exchange and billing, all delivered with a strong focus on security, fraud control and compliance. In the global fleet segment, we continue to build on our recent momentum.\n\nThis past quarter, we won new merchant acceptance at Walmart and Sam's Club, as well as establish new partnerships with McPherson and AEG. We're also pleased to have extended our contracts with NFI, a leading third-party logistics firm, and Bimbo Bakeries, one of the largest commercial bakeries in the U.S. We continue to implement and onboard new customers to our electric vehicle and mixed fleet solutions both in the United States and Europe. Customers seek out WEX in our fleet segments for the unique benefits and controls of the WEX proprietary payments network and our specialized expertise applied to the rich data we capture.\n\nTurning to the travel and corporate solutions segment, we saw strong volume performance in our corporate payments portfolio as well as post-pandemic rebounds in the busy Q3 summer travel season. That volume growth has translated in the strong revenue growth of 25% and even greater scale benefits realized in our operating margins for this segment. Over the past year, we have built a direct sales team, which is selling to mid-market corporate payments customers. It's still in the early stages, but we are pleased with the results today.\n\nWe're also pleased to announce the First National Bank of Omaha is our next financial institution partner, white labeling our corporate payment solutions. FNBO will join a portfolio of other top commercial card issuers that leverage our payment solutions in the corporate payments market. Now, let me turn to a few updates on topics that affect our enterprise more broadly. Our purpose at WEX is to simplify the business of running a business.\n\nEach of our solutions where they are helping with accounts payable, employee healthcare or managing vehicles in the field simplify the running of the business we serve. With solutions for any size business that are customized to their industry. We're focused on deepening our wallet share of our current customer set by enabling them to use our full suite of products. We're seeing encouraging results from our over-the-road truck customers.\n\nOTR customers have been our initial focus because of the common customer characteristics of trucking fleets and the lack of payment digitization in the sector. We focused on selling our corporate payment solutions to these customers, allowing them to achieve the benefits of digital payments. Today, we have hundreds of OTR customers using corporate payments products, which contributed $7 million of revenue to our quarterly results. Expect us hundreds of thousands of customers.\n\nWe see our ability to enable them to easily gain access to our full suite of products as a key enabler of future growth. Let me switch gears to next touch, on customer-focused innovation. I want to update you on Flume, which is a new venture we've launched over the past 12 months with the mission to help our small business customers pay and get paid. The primary insight for us was that our smallest customers are demanding more consumer-like user experiences.\n\nWe have an opportunity to meet them where they want to be met. Our approach is not just an easy UI, but powering it with a digital wallet technology and being able to participate in the funds flow. We recently promoted Flume from beta testing to a full launch and are focusing on bringing this solution to WEX's more than 450,000 existing small business customers. One of our Flume customers is a general contractor specializing in the preservation of landmark buildings in local communities.\n\nThis customer has used WEX fleet products for years to power their small fleet of vehicles. With the launch of Flume they were delighted to find a new avenue to expand their relationship with WEX. Before Flume, keeping track of payments, documents, and invoices for their more than 20 subcontractors was an entirely manual process powered by color coded binders and filing cabinets. In particular, relying on checks for payments was a constant source of friction with subcontractors.\n\nThey were drawn to Flume for its speed and transparency. Their subcontractors can now receive payment immediately with full visibility into the process, cutting out the need to chase their money. Additionally, for a business moving from paper to digital, Flume felt accessible and easy to use. Flume is a chassis on which we can provide incremental value to our small business customers.\n\nAs we look to the future, this product and its modern architecture will help us unlock new revenue opportunities. Now, let me take a moment to update you on our capital allocation priorities and further thoughts on resiliency. WEX generated a significant amount of adjusted free cash flow. Our move to providing an HSA custodial offering rated a buffer against interest rate movements.\n\nDuring times of increasing inflation, our fleet, travel, and corporate payments and healthcare businesses see an increase in purchase volume due to rising prices, which also benefits WEX. These items add to the resiliency of our model. At the same time, we're focused on continuing to squeeze out costs to create an even more profitable and nimble organization with an eye on the use of technology to further automate the business. We expect to deliver a $100 million in run rate operating improvements by the end of 2024, and to reinvest probably half of those savings in further growth and optimization opportunities across the business, which supports achievement of our long-term growth targets.\n\nAs we move forward, our ability to generate strong cash flows combined with the flexibility and diversity of our business model, gives us confidence in our capacity to invest in the business and return capital to shareholders. As a reminder, our capital allocation priorities which we outlined on investor day are to invest internally for organic growth and scale, execute strategic M&A that expands our customer reach and capabilities with a focus on EV and energy innovation, health and corporate payments and return capital shareholders when conditions are appropriate, all while maintaining a healthy and flexible balance sheet. Earlier today, we announced an amended share repurchase program under which up to $650 million worth of WEX's common stock may be repurchased. This amended authorization reflects our board and management team's confidence in WEX's ability to generate strong earnings and free cash flow.\n\nTo date this year, WEX purchased approximately $225 million of common stock, including approximately $75 million under the now amended plan in Q4. Jagtar will share more about our fourth quarter, our resilient cash flow model and some 2023 insights. But overall, I remain incredibly excited about our path forward. We're leveraging our powerful growth engine to win new customers, expand on relationships with existing customers, and diversify offerings with compelling new solutions that extend our addressable market.\n\nJagtar?\n\nJagtar Narula -- Chief Financial Officer\n\nThank you, Melissa, and good morning everyone. As you just heard from Melissa, we delivered a solid third quarter in which we achieve strong top-line growth while continuing to make good progress on our strategic objectives. As with prior quarters, this quarter show the strength of our global commerce platform, the competitiveness of our offerings and the power of our business model. Now, let's start with a quarter results on Slide 6.\n\nFor the third quarter, total revenue exceeded the high end of our guidance by $26 million due to a combination of record high travel and corporate payments purchase volume, fuel price impacts, and a normalization of late fees. Total revenue came in at $616.1 million, a 28% increase over Q3 2021 with more than 80% of revenue for the quarter reoccurring in nature. As a reminder, we define recurring revenue as payment processing and account servicing revenue, revenue from our factoring business, transaction processing fees and other smaller items. In total, adjusted operating income margin for the company was 39.1%, which is up from 37% last year, largely driven by the travel and corporate solutions sector.\n\nFrom an earnings perspective, on a GAAP basis, we had a net loss attributable to shareholders of $44.1 million in Q3. I would like to note that our GAAP earnings included a $136 million non-cash charge due to a goodwill impairment predominantly related to our European fleet business. Non-GAAP adjusted net income was $157.8 million or $3.51 per diluted share. This represents a 43% increase over the prior year.\n\nNow, let's move on to segment results, starting with fleet on Slide 7. Fleet revenue for the quarter was $378.1 million, a 32% increase over prior year, powered by strong volumes from new customer wins and renewals, higher fuel prices and increase in late fees, and the continued recovery in the existing customer base. Payment processing transactions were up 8% year over year, which is in line with our historical growth rate. As you see in our metrics, the net late fee rate normalized following the rapid increase in fuel prices.\n\nOverall, finance fee revenue was up 43% due to increases in volume, fuel prices, and an increase in the number of late fee instances. The domestic fuel price in Q3 2022 was $4.54 versus $3.23 in Q3 2021. We estimate the year-over-year impact of higher fuel prices increased fleet revenue by approximately $56 million, including a benefit of approximately $8 million for European fuel price spreads. The net interchange rate in the fleet segment was 1.10%, which is up slightly from the prior year, even with higher fuel prices.\n\nWe continue to see a transaction mix toward slightly smaller but more frequent transactions as fleet owners cope with higher fuel prices, especially in the over the road space. This transaction shift has a slight benefit to our net interchange rate. The segment adjusted operating income margin for the quarter was 46.2%, down from 50.6% in 2021. Let me briefly address increased credit losses we saw in Q3 that were the primary cause of the decline in margin.\n\nFleet credit losses were above the high end of our range at 30.9 basis points of spend volume including approximately 11 basis points of fraud losses. Let me start with credit losses, while we have a healthy portfolio overall. In the over the road trucking business, we are seeing slower payments from newer small customers likely due to declining spot shipping rates after large increases during the pandemic. As a result, we increased our reserves for these customers, including a qualitative reserve based on our economic outlook.\n\nThis was the primary reason for higher credit losses in Q3 versus the prior quarter. We are very focused on actively managing the portfolio, including hiring additional collections personnel, adjusting our credit models and reducing credit terms were warranted. Next, onto fraud losses, while we have seen our application fraud rates improved sequentially, transaction fraud rates remain elevated. We are not satisfied with this outcome and we will continue to aggressively attack this problem until it is resolved.\n\nOur point of compromise model has determined that the transactional fraud is concentrated in our over the road business in a specific set of geographies with a limited number of merchants. Our actions include continuing to enhance our monitoring tools and account policies and updating our product offering with additional fraud controls while working closely with our merchant partners. Turning now to travel and corporate solutions. Total segment revenue for the quarter increased 25% to $114 million.\n\nPurchase volume issued by WEX was $20.7 billion, which is an increase of 61% versus last year. The net interchange rate in the segment was down three basis points sequentially, predominantly due to travel customers contributing a larger percentage of total purchase volume. Breaking the segment down further, travel related customer volume represented approximately 74% of the total spend and grew 70% compared to last year. Revenue from travel related customers was up 107% versus Q3 2021.\n\nThis reflects continued strength in consumer travel demand. We are very pleased with these results. corporate payments customer volume grew 41% versus last year and revenue was down 14% as reported, but it is up 9% after adjusting for an accounting presentation change. This growth was led by continued strength in the partner channel.\n\nThe segment delivered an adjusted operating income margin of 52.9% up from 34.1% in Q3 last year. There has been significant improvement in these margins as travel-related volume accelerated. Our business model here is very strong, and revenue drop-through for this segment is high given our relatively fixed cost base. Finally, let's take a look at the Health segment.\n\nWe continued to drive strong growth resulting in Q3 revenue of $124.1 million. This represents an 18% increase over the prior year. SaaS account growth was 8% in Q3 versus the prior year, adjusting for approximately 1 million temporary COBRA accounts last year, account growth was 13% in Q3. Health segment purchase volume increased 15% leading to a 16% increase in payment processing revenue.\n\nWe also realized approximately $16 million in revenue from the HSA deposits that were invested by WEX Bank starting late last year and funds held at third-party banks. The Health segment adjusted operating income margin was 24.4%, compared to 22.6% in 2021. The revenue from the invested HSA deposits is the primary driver of the increase in margin. Shifting gears now, I will provide an update on the balance sheet in our liquidity position.\n\nWe remain in a healthy financial position and end of the quarter with $759 million in cash. We have $811 million of available borrowing capacity and corporate cash of $129 million as defined under the company's credit agreement at quarter end. As you'd expect, we saw a sizable $615 million decrease in our accounts receivable versus last quarter as fuel prices moderated. At the end of the quarter, the total outstanding balance on our revolving line of credit, term loans and convertible notes was $2.7 billion.\n\nThe leverage ratio is defined in the credit agreement stands at 2.7 times, which is nearing the bottom end of our long-term target of two and a half to three and a half times and down from the end of 2021 due primarily the strong earnings. Next, I would like to turn to cash flow. WEX generates a significant amount of cash. We have included the graph on Slide 8 with a summary of adjusted free cash flow, which is how we view the cash generation performance of the company.\n\nUsing our definition, adjusted free cash flow is $407 million through Q3. As Melissa discussed, our primary use of free cash flow this year has been to repurchase shares. We will continue to manage capital allocation between organic investment, M&A and returning capital to shareholders. Finally, let's move to revenue and earnings guides in the fourth quarter and full year on Slide 9.\n\nThe third quarter was a very good quarter for us, and I'm pleased to share that we are again increasing our guidance for 2022. Starting with the fourth quarter, we expect to report revenue in the range of $570 million to $580 million. We expect ANI EPS to be between $3.15 and $3.25 per diluted share. For the full year, we expect to report revenue in the range of $2.30 billion to $2.31 billion.\n\nWe expect ANI EPS to be between $13.24 and $13.34 per diluted share. For the full year, these updated ranges represent an increase of $42 million in revenue and $0.12 of EPS compared to the mid-point of our previous guidance. You can find additional assumptions for guidance on Slide 10. As I complete my prepared remarks, I would like to emphasize how pleased we were with our Q3 results and to take a moment to reflect on our 2023 expectations.\n\nAt the top of everyone's mind is the macro economy. Let me start with fuel prices which have been volatile, we may continue to see movement heading into next year. As of last week, the NYMEX futures curve is showing an average fuel price of $3.87 for next year. We will obviously update our fuel price assumptions when we give formal guidance in February.\n\nNext, I will turn to interest rates, which have increased significantly over the past year. We think the impact of higher interest rates on WEX is more balanced than is generally understood. Obviously, we have some floating rate debt today and $750 million of interest rates hedges that will expire between Q4 and Q1 next year, increasing the effective amount of floating debt that we have unless we add to our hedges. We also have an income stream from $1.4 billion of HSA deposits that are invested, another billion dollars of HSA assets held at third-party banks, including $500 million monetized at floating rates.\n\nInterest rates have also risen to the point where we will see some benefit from interest rate escalator causes in our fuel new merchant interchange rates and the low rate environment that we've been in for the last few years. We have not talked much about this lever, but we have the contractual ability to raise interchange rates as interest rates go higher once we hit a negotiated floor level in rates. Given all of this over the long-term, we see the impacts of interest rate changes as more balanced. Finally, we have great confidence in our ability to win new customers, expand with existing customers, and bring new products to market leading to long-term growth targets of the company.\n\nWith that operator, please open the line for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Ramsey El-Assal with Barclays. Your line is open.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi, thanks for taking my question and nice to see super strong numbers this quarter. Could you give us any read that you have on whether you're seeing sort of macro stress in the portfolio? It sounded like the credit deterioration fleet was a little more due to changes in shipping spot rates. Are you seeing any broader macro impacts and I guess how the same story sales look in that context?\n\nJagtar Narula -- Chief Financial Officer\n\nYeah. Hey, Ramsey. Thanks for the words on the quarter. This is Jagtar.\n\nLet me address the -- what we're seeing in the macro side. Obviously, we talked about credit and fraud losses being up this quarter. I'll break that down into two parts. On the credit loss side, that was 20 points of the 11 point, the 31 point movement that I talked about.\n\nWhat we're seeing there really came down to a judgmental reserve that we took. What we saw -- it's limited to our over the road part of our business, where we're seeing spot rates declining and a result that putting some pressure on sort of smaller fee cost customers, mostly owner operators. We haven't seen specifically an increase in losses, but we did see some delayed payments as I talked about. And as a result, we took a judgemental reserve on that just accounting for the higher rates of delinquent payments.\n\nSo we're seeing overall things pretty balanced, the overall quality of the fleet portfolio, the North American fleet portfolio is still good. So we feel generally good about things. But we saw some parts in certain areas that we addressed.\n\nMelissa Smith -- Chief Executive Officer\n\nAnd this to expand on that, yes, but same store sales. It's Melissa. On the North American fleet business in the quarter, we saw upside percent in same store sales, so a real strength, over-the-road business was flat and same store sales. So what we're seeing within the portfolio as Jagtar talked about the smaller over-the-road customers that are losing some share, because of what's happened with spot rates.\n\nBut so far for us that volume's been picked up with some of the larger guys. And you can see that continuing through in what we're seeing for results in October as well. So if you look kind of across the portfolio of Wex overall you've seen really strong trends, which factored through to the volumes that you saw us post in Q3.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGreat. Let me sneak one last one in here. In the slide deck, I think you talked about expanding product set usage in the OTR segment and a $7 million contribution, I think that's cross sell. If that's the case, can you give us more color on what is working there, where you're seeing success and should we expect that number to grow as we move forward?\n\nMelissa Smith -- Chief Executive Officer\n\nYeah. We've done actually a lot over the last quarter. So we talked about the $7 million of revenue that we had specifically of increasing wallet share between the over-the-road customers and our corporate payments products. We have over the last quarter segmented the portfolio.\n\nSo we've gone across and built a qualified sales lead list. And so if you think about the portfolio, the smaller customers we attend to really go after more digitally. The larger customers is where we've created this qualified lead list that we are working our way through. So we feel really bullish about the ability to extend the wallet share that we have with our customers.\n\nThe way that we think about that is on investor day, we had framed in our long-term growth framework 4% to 5% growth that should come from existing customers. And this is one of the mechanisms we intend to hit that.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nTerrific. Thank you very much.\n\nOperator\n\nOur next question comes from Nik Cremo with Credit Suisse. Your line is open.\n\nNik Cremo -- Credit Suisse -- Analyst\n\nHey. Good morning, and thanks for taking my question. First I just wanted to get more color on the $100 million run rate efficiency improvements by the end of 2024. And how much of those benefits could Wex realize next year in 2023 and also related operating expenses in 2023.\n\nI know that there were some more one time investments in the back half of this year, so I did on the last call. And I was just curious if we could ballpark the size of those investments.\n\nMelissa Smith -- Chief Executive Officer\n\nYeah. Why don't I start and Jagtar probably will fill in a little bit here. But when we were looking last quarter, we started talking about the fact that we were making investments. We've been focused on is where we can use technology to create automation that increases the customer experience.\n\nI think that is the twofer. We have the ability to actually have a better customer experience at a lower cost and more scalability. When we first started down this path, we were really thinking about how to derisk growth, because of just what we're seeing where labor shortages in the marketplace. So that was really our primary focus.\n\nBut as we got into this, we'd think it just builds into the resiliency of the model and a lot of this work has pretty quick payback periods. So again, what we're looking at is that end-to-end experience. You've heard us talk a lot about how we've transformed our technology stack and moved into the cloud, how we've increased the digital marketing capability that we have. And so this is just taking that thread in pulling it all the way through that customer experience.\n\nJagtar Narula -- Chief Financial Officer\n\nI'll jump in and just answer a couple of questions on how we expect it to ramp and what we're seeing from the investment side this quarter. So on the ramping, as we said in the prepared remarks, we're expecting $100 million of run rate savings by the end of 2024. We're still working through our 2023 budget, so I'm not going to kind of get into a guidance discussion. But we do expect that to kind of ramp through 2023.\n\nSo we'll exit 2023 with half to two-thirds of that from a run rate basis. And then on the investments that we're seeing, so we talked I think last call about $5 million to $10 million a quarter that we expected to see in the back half of the year from the investments we were making. And you can see that in the sequential results. If you look at Q2 versus Q3, you can see the $5 million to $10 million it's roughly $6 million laying in Q3 results.\n\nNik Cremo -- Credit Suisse -- Analyst\n\nGot it. And thanks so much for all the incremental color. If I could just sneak in a quick follow-up on the corporate payments yield. I know it was expected to taper down in the back half of this year related to a large customer.\n\nIt looks like it came in like low to mid 70s, like 73%. Like how should we think about that yield into Q4 in 2023, if that's like a good run rate to use or if it should come down a little more? Thank you.\n\nMelissa Smith -- Chief Executive Officer\n\nI think it's really important to...\n\nJagtar Narula -- Chief Financial Officer\n\nYeah. Go ahead.\n\nMelissa Smith -- Chief Executive Officer\n\nSorry. Let me start and then you can go, Jagtar. I think it's really important when you actually look at that segment to pars it into two pieces. So think about and we've actually been disclosing for probably four quarters now the split between the two.\n\nSo you can see with our Travel business there's been a lot of stability in the rate in the course of this year. We said that going into the year and that's what we've experienced. And then with the corporate payments business, it has been really about mix shift to the extent that we're seeing more of a mix into our embedded payments products that mixes that rate down. We said we expected that to happen during the course of this year and it has.\n\nAnd so there's a lot of nicks that plays out. You can see from a profitability perspective that we've seen significant drop through of revenue, which has increased our margin profile. So while some of the take rates in some of the products may be lower, there are less costs associated with those as well. And that all factors into how we think about it from a pricing perspective.\n\nSo going forward, Jagtar said we're still working through the budget and some of this will depend on mix of what we expect to see next year. But we've seen a lot of stability in the overall travel rates. And again, when it gets to the corporate payments business, it really depends on mix. We have had great success with our embedded payment products in the marketplace, which again has that lower take rate.\n\nSo I would expect to see that continued to factor into that rate declining a little bit going into 2023.\n\nNik Cremo -- Credit Suisse -- Analyst\n\nUnderstood. Thanks so much for explaining that.\n\nOperator\n\nOur next question comes from Mihir Bhatia with Bank of America. Your line is open.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nGood morning. Thank you for taking my question. Maybe I wanted to start with travel volumes. Came nicely this quarter and a little bit than we expected, but just can you talk about where the improvement came from quarter over quarter in 3Q and any geographies worth calling out? And then just staying with travel into 4Q, is there more recovery tailwind to come? Just thinking between holidays in the U.S., summer in Australia, that can maybe contribute some outsized growth again in 4Q there? Thanks.\n\nMelissa Smith -- Chief Executive Officer\n\nYeah. With travel, what we've been doing is comping it back to 2019, so pre-pandemic and then pro forma in as if we owned eNett and Optal. And Q3 was about 107% of Q3 volume in 2019. But the thing I would say that stands out and it was true last quarter, even more so this quarter, is that there are definitely price increases that are coming through in that.\n\nSo when we talk about some of the resilience that we have against inflation, this is a great example of that. Even sequentially from Q2 to Q3, the average ticket that we saw went up 8%. So the volume is still below the 2019 levels, but spend volume is above and that has a lot to do with pricing increases or mix change that's happened within the portfolio, but it's an higher average ticket price. From a geo perspective, I'd say similar trends to what we saw in the last quarter, great growth in Europe still -- we're still down in Asia, which is a smaller part of the portfolio.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And then maybe just on Flume, appreciate some of the anecdotal or other a load of detail that you provided in the prepared remarks. But off 450,000 customers that you're targeting, what's a realistic target for how many you can sign up and let's say the next year or so? Are there any mile markers you can share for us, which you'll be using to judge if Flume is performing in line with expectations and the growth is coming through? Thank you.\n\nMelissa Smith -- Chief Executive Officer\n\nYeah, it's an interesting question. When we think of our existing small customer base, 450,000 customers is an opportunity for us to increase market share. And we've had some evidence of that with the products that we've rolled out and specifically with Flume so far. I think that we're still early.\n\nWe went from beta launch to this quarter. We had told you last quarter was that we would go into full launch in the third quarter, which we did. And that we were going to learn from this full launch of -- what that looks like from an actual take rate across the portfolio. So I think you need to give us a little bit more time and get more experience behind us, but we feel really bullish around a bunch of things here.\n\nFirst of all, it just the ability to bring product into the marketplace. I talked earlier about all the work done on the technology side over many years. This is, you can see the benefit of that as we're moving product into the market. It's part of why we added in a whole digital team at the beginning of the year, is that ability to actually take advantage of the technology.\n\nThe ability to move the product, the ability to rapidly introduce new features into the product, the ability to integrate through APIs across our portfolio so that you can share technologies, just in a totally different place. And so I think we're going to learn a lot, not just how we sell this into the marketplace, but how we use, I talked about using this as the chassis for us in small business because there are a lot of pieces that we've developed that we will deploy in other parts of the company.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you. And if I could just squeeze one last one in there, just on the impairment charge, what happened this quarter? Did something change in the quarter that made you take it this quarter? Just trying to understand like, it's a fairly large amount so, thank you.\n\nJagtar Narula -- Chief Financial Officer\n\nYeah, I'll address that one. So the impairment charge was largely macro related, right? So, we're seeing rising interest rates, which impact the discount rate we use in our impairment analysis, market valuations of change, which also impact a number of impairment analysis. And then the economic environment, Europe is impacted kind of free cash flow of the business in the near term. So we factor that all together.\n\nIt's largely macro related, and we determined that the impairment charges going to.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Bob Napoli with William Blair. Your line is open.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nThank you, and good morning. Having watched WEX through a number of macroeconomic cycles, your payment processing transactions are -- have been a pretty good leading indicator. We're getting a lot of mixed news out of the trucking and space, but your transactions held up pretty well this quarter. What are your thoughts as you look in, Melissa, as you look into next year on the macro? And are you seeing, I mean, how are those transactions holding up so far in the fourth quarter? I mean, have you been surprised by the stability there?\n\nMelissa Smith -- Chief Executive Officer\n\nWell, if you look across the portfolio in, obviously we're looking at volume when we give guidance for the fourth quarter, but it in October, we continue to see volume growth across the fleet business. Really strong volume growth of how travel and corporate payments and really strong volume growth in our health business. So but I think about macro and I talk a little bit about resiliency for a minute, because I want to hit on from the points that we said in our prepared remarks. But the business, when I think about how much more diversified that we have -- we are, and we've done a lot to buffer our interest rate sensitivity, the HSA deposits that we've added into the mix or really helping and we look forward at very many different scenarios of what could happen in the future.\n\nWe're benefiting right now from inflation, because you're seeing that coming through not in just higher energy costs, but higher costs that are getting charged across the portfolio. We're going into open enrollment season and we're trending positive from that we've got 80% of our revenue that's reoccurring in nature and we're much more diversified across the business and across the geos. So we feel good about all of that when we talk about resiliency, and it's part of why we felt really comfortable around increasing our shared buyback program was looking at many of the different scenarios that could play out in just the cash flow generation that we have. From a macro perspective, when we talked to our customers across the different segments, the number one thing we continue to hear from them is still about labor and access to labor.\n\nThe over the road marketplace, we hit on earlier, the smaller, over the road customers, which is, a micro segment of a micro segment for us, is being impacted by spot rate. Again, so far a lot of that volume has been picked up by the larger customers. We do think that this is more cyclical part of the business, and if you go back to even 2019, there was softness in that part of the business same-store sales were down 2% or 3%, I think, in 2019 with flat again this last quarter. So that's one segment that I think we are hearing a little bit of distress, again, with a micro segment of that.\n\nBut then across the broader portfolio we're seeing actually really positive trends.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nGreat. Thank you. Interesting. follow up just on your M&A, and your historic M&A, I guess, you have been active, but we should, we see more M&A I guess going into 2023, and as you look at like some of your acquisitions in the past I mean, how have you -- how would you say you've done overall your -- what grade would you give for yourself or which -- what acquisitions have outperformed, which have underperformed? Obviously, Europe has been tough in fleet, but some of your U.S.\n\nfleet acquisitions. So just any thoughts around M&A, historical M&A and performance versus expectations?\n\nMelissa Smith -- Chief Executive Officer\n\nYeah. One of the things we do as look back across the portfolio of M&A and we feel really good about the way that we've delivered against the original deal models how we've reached synergy targets across the portfolio and then the most recent with eNett being folded in, you can see that just how we've delivered, really strong earnings growth. You can see that coming through the segment, related to that transaction, which again is the most recent one. So when we think about M&A and more broadly of a capital allocation, we still start with how we're going to invest money internally, which is a key focus of ours as we also think about building capability as opposed to just buying.\n\nThen we look at M&A, we've got a pipeline that we have had active. As long as I can remember, we're moving assets through that pipeline. In the market so far over the last, probably six to nine months, we've seen still continue to have elevated multiples and or assets that either or we think complicating and what we're trying to do strategically, so therefore distracting. And so we haven't executed on something recently, but we are very active in the marketplace.\n\nWe think it's an important part of our growth. It's part of the 2% -- we say 2% to 3% of a long-term growth framework is going to come through M&A. What we really spend time is if you look at the current market environment, we see the purchase of our own shares is a very compelling value. And we think we can do both.\n\nWe generate a lot of cash. So an ability to continue to be active in the marketplace from an M&A perspective and to buyback shares.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nThank you. Appreciate it.\n\nOperator\n\nOur next question comes from Sanjay Sakhrani with KBW. Your line is open.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. Good morning. Want to start where you just discussed Melissa, just, it was nice to see the large increase in the repurchase authorization. I'm just curious, like how aggressive do you expect to be with that $575 million or so that's remaining.\n\nAnd are there any limitations on how much you could buy? Thanks.\n\nMelissa Smith -- Chief Executive Officer\n\nI think Jagtar is probably going to plug in another piece of this. You can see, and then in the course of this year, we've been pretty ratable about how we've used in opportunistic about how we've used our share buyback authorizations so far. So kind of keep that in the backdrop of how we're thinking about that and Jagtar, if you talk more about limitations.\n\nJagtar Narula -- Chief Financial Officer\n\nYeah, we have some limitations in our debt covenants Sanjay. I'm doing this off the top of my head. I think it's $350 million once debt to EBITDA goes up above. I want to say two, it's like two eight times something like that, three times.\n\nSo we've got some room there and should we end up with at those levels and the limitations. We could obviously go back to our lenders. So I feel pretty good about our ability to continue to execute our share repurchase program along the lines that were authorized.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nOK, great. And then I'd just like two quick follow-ups on a couple of points that were discussed before. On the interest rate sensitivity, I just want to make sure I understand like the HSA deposits are a hedge and the assets that you have against them aren't a hedge against the floating rate debt that you have, as well as the hedge is right? And the discount rate ladders, I mean, you expect to use them if you need to, but those other factors are, or the hedge. I'm just trying to think through, how we make the machinations of those? And then yeah, and I'll have one more, sorry.\n\nJagtar Narula -- Chief Financial Officer\n\nYeah, sure, Sanjay. Why don't I walk you through the math, I think would be helpful. So we have about $2.7 million of financing debt, right? This is our term loans, our revolver. We have another kind of $3.6 billion of what I call operational debt.\n\nSo these are the bank deposits, money market deposits, and the HSA deposits. When I look at within that group of liabilities, the interest rate swaps that we have that fix some of it and things like the convert that are essentially fixed. We end up roughly with about $2 billion of liabilities that float with interest rates. On the assets side of the equations, we have the items that you talked about.\n\nSo we have the HSA assets, the assets -- the HSA deposits are invested in as well as the escalator clauses in some of our contracts with merchants. So when I net those two together, I end up with roughly about $1 billion net liabilities that would move with interest rates. I think of it as 100 basis point movements. Net result is a $10 million interest in fact.\n\nSo it nets down a bit lower than you would look at if you were just to kind of look at our balance sheet.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nOK. All right. Wonderful. And then just final point on the impairment charge.\n\nI mean, how should we think about any further necessary charges? I understand like this was related to macro, you made a change, but should we see more of these going forward if maybe or this is pretty much it? Thanks.\n\nJagtar Narula -- Chief Financial Officer\n\nYeah, no Sanjay, I'm not expecting any further charges. There's no remaining goodwill on our near teen fleet business and I would say the rest of our portfolio's got a lot of headroom, so I'm not expecting any further charges.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question comes from Darrin Peller with Wolfe Research. Your line is open.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHey, nice guys. I just want to start off going back to the lead side for a minute. When I look at the macro adjusted growth, I think mid-teens type levels, I know comps got a little bit easier this quarter, but I mean, where are we in terms of recovery back, in terms of normalized trends? Just seems a little stronger than one would've expected even with that. And so I guess I wonder if there's something -- some nuances or drivers that you see as sustainable that can drive a little bit more of an elevated growth rate, or is it really just the comps and recoveries? If you could just touch on that for a moment.\n\nMelissa Smith -- Chief Executive Officer\n\nI think with -- the part that's important is that we continue to win business. We have high retention rates, we have you a very strong sales capability and so what you're seeing is the combination of those two things coming together, so that rebound in some areas or continuing to see rebound from the pandemic levels. And then on top of that you're seeing our execution of things that we sold last year that we're adding into the portfolio, things that we're selling this year that are adding into the portfolio is an example, if you look at vehicle growth in the quarter as we added, we talked about the Exxon portfolios that we were going to add into the mix and we did in the course of the quarter. So you can see the benefit of that coming through, which we'll realize through the next four quarters.\n\nIf part of why we keep talking about names of customers that we're bringing on, because it is an important part of our ability to grow in the business. So in the fourth quarter you start to see it normalize a little bit more. So the growth in the company is more about just organic sales growth that's coming through in again customer retention, some increased penetration with the existing customers. The long-term model that we put out there, just as a reminder we said that we would grow 4% to 5% should exist customers 3% to 5% net new, one to two from products and two to three from M&A long-term and we've clearly over delivered on that in the course of this year.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nOK. Thanks, Melissa. The other question I have is really more about expense management now, just kind of through the cycle and potentially a tough economy next year and just -- it's really a combination of a willingness and a capability in terms of what you want to do to protect the bottom line on that front. And then maybe just if you could remind us the levers you think you have to be flexible?\n\nMelissa Smith -- Chief Executive Officer\n\nLet me start and then Jagtar, you can add to this. I think we have so much opportunity that we want to make sure that we are being thoughtful about investing through cycles and that we continue to invest to make sure that the enterprise can reach its potential and to hit our long-term growth factors. And I think that's an important aspect of that. We managed the business as if it feels price neutral.\n\nAnd that being said we talked about some of the ways that we're focusing on squeezing out efficiencies. We're trying to do that thinking about ways that we can create a better customer experience and create an efficiency. So the very big focus of ours of simplifying the way that we do business for our customers for their benefit. And we think that, that is a way of you created an investment, it's a relatively short term investment.\n\nYou actually get quite a bit of benefit from that and lead the way Jagtar.\n\nJagtar Narula -- Chief Financial Officer\n\nYes. I think generally concur with what Melissa said. I think our focus for the next year will be on the cost savings that Melissa identified. So I think when we have some levers to work on costs, I think our focus next year will really be that, that $100 million number and getting as much of that into next year as we can.\n\nI think that's the big number for us, basically the economic environment.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nGot it. All right. Thanks guys.\n\nOperator\n\nOur next question comes from Sheriq Sumar with Evercore ISI. Your line is open.\n\nSheriq Sumar -- Evercore ISI -- Analyst\n\nHey. Thanks a lot for taking my question. The health and benefits account, I mean, that's all like a nice pickup in the average SaaS accounts I believe you said when on the American side. But just to kind of for our understanding as to what's the strength out there in terms of WEX's offering versus the competitors? And how should we think about that trend going forward from here?\n\nMelissa Smith -- Chief Executive Officer\n\nYes. So we talked about the fact that we saw 8% account growth, but that we had some temporary accounts last year. So if you normalize that it was a 13%, which tracked more consistently with spent-on that we saw in the Health and Employee Benefit Solutions that the really -- the big things for us we're really uniquely positioned in health and benefit ecosystem because of just the sheer size of customer base that we have both directly with our partners. We have 18 million SaaS accounts, over 50% Fortune 1000s that do business with us.\n\nAnd that enables us to collect data that can do things like help a consumer determine, where's the best place, how much money should they be putting away in an HSA or an FSA account, helping them determine benefit options and all of that data creates wisdom for our customers and creates this nice cycle for us also that end-to-end capability with our partners and our customers because we are able to do FSA and HSA and then admin and in a whole host of account types and capability that sits across our portfolio. They like that ease of use of being able to do that all with one partner. And just to highlight again, like we are going into open enrollment season, which is a really important time, and trying to think positively right now, is a testament to the fact that that the offering is resonating in the marketplace.\n\nSheriq Sumar -- Evercore ISI -- Analyst\n\nGot it. That's helpful. And if I can just squeeze one in, can you provide an update on where does Flume stands and what's the cross-selling opportunity out there for Flume?\n\nMelissa Smith -- Chief Executive Officer\n\nIt's a Flume we moved from a beta launch into a full product launch this quarter. And say really early, the offering that we have in the marketplace, we're seeing we have customers that are both outside of our business and customers where we're increasing wallet share with their existing customers for us. And so we think that this creates a unique opportunity for us to deepen wallet share that we have with within the small business portfolio, the 450,000 customers that we have. It is a model that's fast plus, so we charge SaaS fees plus other transaction related fees.\n\nAnd so it also gives us an opportunity to broaden and diversify our revenue stream, but it says early and we will talk more about it as we go through next year.\n\nSheriq Sumar -- Evercore ISI -- Analyst\n\nThank you so much. Thanks a lot.\n\nOperator\n\nOur next question comes from Jeff Cantwell with Wells Fargo. Your line is open.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nHey, thanks so much. Most of my questions have answered. I wanted to ask a follow up question on Flume based on a prior question and you have any, now it's in full production, so obviously we understand these very early days, but we've been hearing a lot of good things about Flume. So just a couple questions there first the way that we're understanding the underlying point of the commentary is you're thinking offensively for Flume into 2023 and 2024.\n\nI just want to confirm that, so this business is a creative as kind of the underlying question. And then second have you thought at all about what type of growth you expect there in revenue and what are the, impacts actually on firm mine margins or help us kind of think about the potential for Flume, as you're thinking about it. Any color there would be great. Thanks very much.\n\nMelissa Smith -- Chief Executive Officer\n\nYeah, sure. Going to kind of impact that a little bit, the way that we're thinking about Flume is it gives us an ability to increase wallet share with our existing customers. The way that we designed it, was working with very small customers so that, think of this as kind of like a micro segment that sits within when we started segmenting our small business customer base we were targeting the customers that were seeing within our existing portfolio. We also through the product process brought in people who are not using our existing products as well.\n\nSo it was very customer informed. The places, that we have been focusing on it was pretty clear that getting paid is an important part of the small business offering. And the other things that became clear is that, this customer base wants something that is digital nature but moves them into the digital age. These are often customers are not highly digitally enabled.\n\nAnd so the way that the look in the field, the way that was designed was with that in mind it appeals to people who are digitally enabled, but is really thoughtful about the fact that, many of these customers, and I give an example and prepared remarks, are using very manual processes now. And so if we thought about this, we were able to move it into the marketplace rapidly. We have an ability to cross-sell it into our existing customer base and potentially use that more directly in the, the marketplace outside of our existing customer base. I'd say the kind of the primary focus as we were thinking about this was meeting a need that we have for their existing customers.\n\nAnd then maybe opportunistically being able to pick up customers outside of that. Again, we're early, we're going to learn a lot and then it, I think we'll be better able to size what the opportunity is.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nOK. Great. Appreciate all the color. Thanks very much.\n\nOperator\n\nWe have run out of time for the question-and-answer session. I'll turn the call back over to Steve for closing remarks.\n\nSteve Elder -- Vice President, Investor Relations\n\nThank you everyone. I know we went a few minutes over, but appreciate everyone's attention and time for the call today and we'll look forward to speaking with you again for our fourth quarter earnings.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteve Elder -- Vice President, Investor Relations\n\nMelissa Smith -- Chief Executive Officer\n\nJagtar Narula -- Chief Financial Officer\n\nRamsey El-Assal -- Barclays -- Analyst\n\nNik Cremo -- Credit Suisse -- Analyst\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nBob Napoli -- William Blair and Company -- Analyst\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nSheriq Sumar -- Evercore ISI -- Analyst\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nMore WEX analysis\n\nAll earnings call transcripts"
}