{
  "companyName": "Coupa Software",
  "companyTicker": "COUP",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/06/coupa-software-coup-q2-2023-earnings-call-transcri/",
  "content": "Coupa Software (COUP -0.03%)\nQ2 2023 Earnings Call\nSep 06, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the Coupa Software second quarter fiscal year 2023 earnings conference call. Our host for today's call is Steven Horwitz. At this time, all participants will be in a listen-only mode. Later, we will conduct a question-and-answer session.\n\nI would now like to turn the call over to your host, Mr. Horwitz. You may begin, sir.\n\nSteven Horwitz -- Investor Relations\n\nThank you. Good afternoon, and welcome to Coupa Software's second quarter conference call. Joining me today are Rob Bernshteyn, Coupa's CEO; and Tony Tiscornia, CFO. Our remarks today include forward-looking statements about guidance and future results of operations, strategies, market size, products, competitive position, and potential growth opportunities.\n\nOur actual results may be materially different. Forward-looking statements involve risks and uncertainties and assumptions that are described in our most recently filed 10-Q. These forward-looking statements are based on our beliefs and assumptions today, and we disclaim any obligation to update any forward-looking statements. If this call is replayed after today, the information presented may not contain current or accurate information.\n\nWe also present both GAAP and non-GAAP financial measures. A reconciliation of certain of these measures is included in today's earnings release, which you can find on our investor relations website. A replay of this call will also be available. Unless otherwise stated, growth comparisons are against the same period of the prior year.\n\nWith that, I will now turn the call over to Rob.\n\nRob Bernshteyn -- Chief Executive Officer\n\nThanks, Steven. Hello, and welcome back from what I hope was a safe and enjoyable Labor Day weekend for everyone. Let me begin by sharing a few key metrics that best illustrate our financial performance for the second quarter, our 54th quarter of execution. We delivered $193 million in subscription revenue and $217 million in subscription calculated billings representing year-over-year growth of 23% and 25%, respectively.\n\nAnd with a continued focus on profitability, we demonstrated strong operating efficiency by delivering an 80% subscription gross margin, 74% total gross margin, and an 11% operating margin for the quarter. In Q2, we saw a very strong performance in the North America enterprise market, new customers such as Avient, LinkedIn, and Royal Caribbean chose our ROI-driven business spend management platform to optimize their spend. While demand in North America continued to be very strong, it's worth noting that European demand remains softer. Now when looking at our business holistically going forward, we're encouraged by our largest ever pipeline and the training, enablement, and ramp of our new sales colleagues we added earlier in the year progresses -- continues to progress well.\n\nThe question that continues to be debated broadly in the market is whether we are headed for a recession or a soft landing. Our most recent Business Spend Index provides some interesting insights into this topic with respect to macroeconomic data, unemployment, and inflation. Just as an example, we have seen significant increases in airfare prices. Yet despite the uptick in prices, demand has not fallen, but rather has increased as businesses progress toward returning to pre-pandemic levels of travel.\n\nThe net effect of the underlying data shows some signs of projected growth in certain areas and signs of potential contraction in others. For broader insights, I once again suggest exploring our Business Spend Index on spendindex.com. Now as many of you have come to know, we pride ourselves on managing our business with discipline. We've done so during times of strong prosperity, as well as during times of contraction.\n\nThis approach has become a foundational element of our management philosophy and stewardship of Coupa. I'm sure we can all agree that the current environment is highly dynamic and how the macro picture plays out is yet to be known. That ambiguity is being contemplated by leaders across industries and businesses globally. For Coupa, let me articulate what we mean by thoughtful, disciplined execution and share our current thinking in this area.\n\nIf we take a moment to isolate the variable of future demand uncertainty, there are several scenarios that could play out. First scenario would be that the economy experiences a softer landing, and the demand environment remains relatively healthy. In this scenario, we will continue to thoughtfully invest for growth and as always, balance with profitability. Of course, a recession is possible.\n\nSo, another scenario would be that we enter an environment that impacts IT spending budgets in the near term. In this scenario, we are prepared to moderate our investments appropriately, resulting in increased profitability and cash flows. In more extreme cases, we will show spend discipline at significantly increased levels. Now near-term scenarios aside, we are proudly the clear leader in business spend management.\n\nOur total addressable market is massive and underpenetrated, and we are excited as ever in our pursuit to revolutionize this market and deliver customer success like never seen before. Speaking of customer success, let me -- we now have well over 2,500 Coupa customers and thousands of prospects who seek to partner with us and benefit from our Value as a Service solutions. They need to have BSM discipline and use it a lot. And so, with that, let me share some examples of customers investing in BSM transformation done in the context of our three-wave strategy.\n\nWave 1, of course, is capturing all spend. It's a strategy to capture all spend through our highly scalable and configurable transactional core. The first example I'll share is that of ProPetro, an oilfield services company. They implemented the Coupa platform to enable process improvements, efficiencies, and increase controls.\n\n94% of their spend is now preapproved and they are electronically processing 89% of their purchase orders and 80% of their invoices. By capturing the spend, they have visibility and control freeing them to focus on growth-oriented initiatives. Another energy company, Talos Energy, requires timely operational support to keep their 60 drilling operations platforms running 24/7. Manual procurement processes left the company vulnerable to duplicate or missed orders, resulting in inventory overages, shortages, and costly overnight delivery orders.\n\nPreviously, their accounts payable personnel dedicated nights and weekends to verify receipts, assigning GL codes, and posting accruals. Talos implemented Coupa in just three months and was able to automate their processes and reduce invoice cycle times by 90%. Their procurement lead stated, \"Our platform operations now run more smoothly while spend visibility and control helps our reporting and our bottom line.\" These are examples of our wave 1 strategy in action for our customers. Let me also share a few of the most recent enhancements from our September release related to our first wave.\n\nIn this release, we streamlined the mobile app for expenses. We improved visibility into reimbursable spend. We made it easier to manage unused travel tickets, and we integrated virtual cards into our travel offering and much, much more. Integrating virtual cards into T&E allows our customers to unlock additional synergistic value.\n\nIt also provides another avenue to drive incremental total payment volume through our platform. To that end, our cumulative total payment volume reached nearly $15 billion by quarter end as more customers continue to come online. That's nearly a 50% increase in approximately two quarters. Now let me move on to the second wave of our strategy, which is optimizing every dollar spent through Suite Synergy.\n\nMany of our customers maximize their savings and efficiency by leveraging power user applications within our suite. One of these companies is Maersk, a Danish multinational shipping and container logistics giant. They digitized their entire procurement process and are using Coupa for procure to pay, supplier risk management, and sourcing optimization. With sourcing optimization, Maersk identified over $100 million of potential savings by utilizing reverse auctions where several shippers are bidding for their business.\n\nIt's not just savings, it's about efficiency. With the help of Coupa, Maersk only needs seven people to cover thousands of supplier negotiations and auctions per year. We were humbly appreciative of their comments. They said it's actually relatively easy from a technology -- technical point of view.\n\nSince it's SaaS, you can get it up and running, generating impact for your business in weeks. Maersk is also leveraging our platform to support their sustainability goal of achieving carbon neutrality by 2050. We truly are thrilled to be part of this journey with Maersk. We're very proud to have Maersk and many other customers among our ever-expanding community, which has now driven more than $3.8 trillion in cumulative spend under management through the platform.\n\nThe resulting data from this spend is what fuels the third wave of our winning strategy, amplifying community value. As you may recall, community.ai can be broken into three areas: the pooling of customer spend, such as with Coupa Advantage; the pooling of brainpower and collaboration among community members; and the pooling of data through AI and machine learning, the intelligence component. This quarter, I'll share an example of how our Spend Guard solution utilizes this third area, the pooling of data, for fraud protection and prevention. Spend Guard leverages AI and machine learning technology to automatically analyze a customer's business spend and flag suspicious transactions in real time.\n\nSo let me share a real-life customer example from the Salling Group. Salling is a diverse European retail group that processes several hundred thousand invoices, POs, and expense reports through our platform annually. Immediately upon implementing Spend Guard, they halted a large duplicate invoice before a payment could be made. Now I can't emphasize how important it is to capture these issues before money leaves a customer's bank account.\n\nIt saves them from having to recover cash. This importance wasn't lost on one of their leaders who said, Coupa Community AI is a must-have. Within three days of uptime, it has paid back our investment. Another example is that of a globally recognized provider of electronic solutions with over 45,000 employees in more than 40 countries.\n\nBy identifying noncompliant purchase order spend, Spend Guard allowed them to edit or withdraw certain purchase orders prior to their suppliers incurring any costs or invoicing them. In less than a year, Spend Guard helped this company save tens of millions of dollars. Now as I've mentioned before, this is just the tip of the iceberg of what our community.ai platform can do. And we are still in the early days of delivering true Value as a Service in this area at the scale that we envision.\n\nThese solutions will only become more and more valuable as we continue to develop the third wave of our strategy and our community.ai vision becomes fully realized. This three-wave strategy is, of course, underscored by our vision areas, as exemplified by the letters in the name Coupa, which stands for a comprehensive, open, user-centric, prescriptive, and accelerated. Now switching to our core values. Let me highlight this quarter's most valuable players who represent -- best represent each value as selected by our colleagues.\n\nI'll start with Sunil Gautam from our technology support team, who won the award for our first core value of ensuring success. Sunil goes above and beyond when helping others across groups and across regions. He's incredibly effective at understanding where problems exist and determining the best approach to solving them. His colleagues have conveyed to us that his contributions are so meaningful that they typically save at least 50% of a developer's time.\n\nNext is Jake Sells from our cloud operations support team, the winner of our second core value of focusing on results. Jake has put forward significant time and effort that has yielded multiple platform improvements. He co-led an automation effort that tremendously improved the workflow for our colleagues. Jake's contributions have been key to enabling platform agility, automating security, and allowing for continuous improvement on our platform.\n\nLast but certainly not least, Bonnie Ho from our channel marketing team won the award for our third core value of striving for excellence. Bonnie goes above and beyond to promote a collaborative environment with our partners and her Coupa colleagues. She is passionate and is dedicated to driving more effective events, which in turn helps us bring more customers into the community. As Bonnie excels at her job, it saves Coupa time, money and ensures that the right customers are being introduced to the right products.\n\nCongratulations and thank you, Sunil, Jake, and Bonnie, for embodying the core values which lay the foundation for the special culture we're developing at Coupa, which just last month, has once again globally certified -- been certified as a Great Place to Work. We're really proud that the Great Place to Work survey revealed that 95% of our employee respondents ascribed to each of our three core values. Now obviously, our third core value dictates that we still have work to do to get the other 5% on board, and we plan to continue our efforts to do just that. We were also recently recognized by Fast Company as a great -- as a Best Workplace for Innovators.\n\nAdditionally, we earned a leading position on The Software Report's Top 100 Software Companies of 2022 list. We're building something really special here, and we'll work tirelessly to continue to build a stronger company, a stronger platform, and a stronger community. Now before I close, let me make you aware of our second annual ESG report, which can be found on the Corporate Sustainability page of our website. I'll share our mission statement with you.\n\nThrough the power of trillions of dollars of business spend, our mission is to unlock our customers' full potential to do well and do good, anchored in a shared belief that we are smarter together. Before I hand the call over to Tony, let me emphasize that managing business spend to drive agility, savings and increased profitability is now more important than ever. The solutions with a demonstrable and measurable ROI are rightfully moving to the forefront. Together, we can leverage the strength of the Coupa platform and our community to help our customers navigate through these uncertain times.\n\nWith that, let me turn the call over to our CFO, Tony Tiscornia. Tony?\n\nTony Tiscornia -- Chief Financial Officer\n\nThanks, Rob, and good afternoon, everyone. As Rob highlighted, we delivered strong top-line growth, margins and cash flows for the second quarter. Let me dive right into the numbers. Subscription revenue for Q2 was $193 million, up 23% or 24% on a constant-currency basis.\n\nTotal revenue was $211 million, up 18% year over year or 19% on a constant-currency basis. Subscription calculated billings were $217 million, up 25% year over year or 27% on a constant-currency basis. Non-GAAP gross margin for the quarter was 74.5%, highlighted by subscription gross margin of 80%. Non-GAAP operating income was $24 million or 11% of total revenue.\n\nAnd non-GAAP net income was $16 million or $0.20 per share on approximately 87 million diluted shares. Cash at quarter end was $809 million, Q2 operating cash flows were $29 million, and adjusted free cash flows were $25 million, this coming off very strong operating and adjusted free cash flow results for Q1 of $50 million and $46 million, respectively. For the trailing 12-month period, adjusted free cash flows were $159 million or 20% of total revenue. Our Rule of 40 on a trailing 12-month basis exiting Q2 was 43%.\n\nAs a reminder, we define Rule of 40 as the total revenue growth rate plus the adjusted free cash flow margin for the period. In Q2, our gross renewal rate and net retention rates were in the consistent historical range of approximately 94% to 96% and 110% to 112%, respectively. The number of customers with annualized subscription revenue greater than $100,000 was 1,519 at the end of the quarter, up 23% from a year ago. These results illustrate the leverage and scale we have in our financial model.\n\nWe are focused on top-line growth, but as Rob noted, we also prioritize strong unit economics, gross and operating margins, and free cash flow margins. With that, let's now turn to guidance. As Rob noted in his remarks and as we discussed last quarter, in Europe, we continue to see a softer demand environment with lengthening sales cycles, which is factored into our guidance. Consistent with Q1, our Q2 performance in North America was strong.\n\nHowever, we recognize the global macro environment is uncertain. So, we have factored the potential for additional macro headwinds into our guidance to derisk the outlook for the back half. For Q3, we expect subscription revenue of $194 million to $196 million. We expect professional services and other revenue of approximately $17 million to $18 million, and we expect total revenue of $211 million to $214 million.\n\nFor Q3, we expect subscription calculated billings of approximately $198 million. Moving down the income statement. We expect the Q3 non-GAAP gross margin of approximately 73%. We expect non-GAAP operating income of $14 million to $16 million and non-GAAP net income of $7 million to $9 million, resulting in non-GAAP net income per share of $0.08 to $0.10 on approximately 87.5 million diluted shares for the quarter.\n\nWe expect Q3 adjusted free cash flows of approximately $20 million. Now let's move on to full year fiscal '23 guidance. We expect subscription revenue of $766 million to $771 million, representing an increase from last quarter's full year guide of $4 million at the midpoint. We expect professional services and other revenue of $72 million to $73 million or 9% of total revenue.\n\nThis would result in total revenue of $838 million to $844 million for fiscal '23. We expect a non-GAAP gross margin for the year of 73% and non-GAAP operating income for the year of $62.5 million to $68.5 million, resulting in non-GAAP net income per share of $0.37 to $0.44 on approximately 87.5 million weighted average diluted shares for the year. Finally, today, we announced the approval of a 10b-18 open market share repurchase program of up to $100 million. This program reflects the confidence we have in our business and our ability to create shareholder value while also serving as a way to reduce net share dilution.\n\nThat concludes our prepared remarks. We will now take your questions. Operator?\n\nOperator\n\n[Operator instructions] Please keep your questions to -- or please keep it to a single question to allow time for everyone to ask their questions. [Operator instructions] And our first question comes from Keith Weiss. Your line is open.\n\nChris Quintero -- Morgan Stanley -- Analyst\n\nHey, guys. This is Chris Quintero on for Keith. Congrats on the quarter. Question from our end.\n\nRob, last quarter, you talked about the softness in Europe being more of a lagging indicator than a leading one. Did anything change in the quarter where now you're continuing to see some of that European weakness throughout the quarter?\n\nRob Bernshteyn -- Chief Executive Officer\n\nSure. Thanks for the question. Look, lengthening sales cycles is what we saw last quarter. We saw some of the same elements this quarter.\n\nI won't say much worse or much better. So, it remains an area that we're watching very carefully. We believe largely due to greater levels of uncertainty in the region and then obviously, we look at it country by country and segment by segment, but broadly speaking, that's what we're seeing.\n\nOperator\n\nOur next question comes from Alex Zukin. Your line is open.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for taking the question. Just a two-parter for me. I guess the -- Rob, you talked a little bit about longer sales cycles in Europe.\n\nI want -- and I think, Tony, you talked about reflecting some incremental conservatism to derisk the guide for the year, seeing if that activity spreads to the U.S. I wondered if you could talk about where, from a vertical perspective, you're seeing areas of weakness and areas of strength. And then, Tony, maybe just commenting on the guide, I think -- is that an aspect of seasonality for subscription billings? I think prior to that, we had a little bit of a more even weighting, if you will, on subscription billings in Q3 to Q4. So just any color or commentary there would be helpful.\n\nTony Tiscornia -- Chief Financial Officer\n\nYeah. Thanks, Alex. I'll take the first one. Nothing really to call out by industry at this time that's significant for us and the way that pie is split up over the years of building out the business.\n\nBut I would say, certainly, the impact is -- seems to be much more geographically based and that is worth calling out.\n\nRob Bernshteyn -- Chief Executive Officer\n\nYeah. And Alex, I don't think it's -- we have our typical seasonality. I think I would classify this as typical seasonality, nothing outside the norm. As we noted, there's some uncertainty out there with respect to the global macro picture and how things will play out.\n\nSo, for that reason, we've factored some incremental impact from potential broader macroeconomic headwinds into our guide.\n\nOperator\n\nAnd we have a question from Brad Sills. Your line is open.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nOh, great. Thanks so much for taking my question, guys. I wanted to ask one on kind of the macro a little differently, if I could, please. To what extent is reopening providing some tailwind to the business that perhaps would be an offset to slowing macro here? Does the value proposition change at all as employees are back in the office for just core procure? And then second question would just be any color or commentary on what you might have seen across the different power user apps? Were there any relative areas of strength whether it's CLM or supplier information, Coupa Pay? Any color on that, please? Thank you so much.\n\nRob Bernshteyn -- Chief Executive Officer\n\nYeah. I wouldn't say so much that there's a -- due to the fact that more folks are physically in offices that, that's provided a tailwind for us. But I think the fact that folks are more engaged in transformational projects through the use of technology has been a tailwind. And I think that can be correlated pretty well with a very strong North America enterprise business we saw this past quarter; with the scalable mid-market business we continue to drive.\n\nSo, I think it's more of the reengagement, whether it's physical or not, kind of post-COVID. I think that's more correlated. And then definitely nothing overly significant in this quarter in a sort of product-by-product kind of mix. There are quarters where we see supplier risk being at the front end of the drivers, some quarters where the travel component of our T&E offering is seeing some greater pull.\n\nBut nothing that I would call and say, well, this module really drove the suite sales. It continues to be the vision lock we have with our customers around where BSM is going and their confidence in us being able to take them there.\n\nOperator\n\nOur next question comes from Raimo Lenschow. Your line is open.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nHey, thank you. And, Rob, thanks for the clarity about the different scenarios. Just -- I hope it's the last question on macro, but what are you seeing in terms of pipeline, pipeline evolution at the moment in terms of like is that -- are we still seeing the same number of projects? Are you kind of pushing for slightly more pipeline coverage given kind of potential issues on closure rates further in the second half of the year? Can you just speak to that scenario, please? Thank you.\n\nRob Bernshteyn -- Chief Executive Officer\n\nYeah, sure. Look, I mean, from a pipeline perspective, things are very healthy with this business in terms of new pipeline being created and the size of the pipeline we continue to move. We're seeing, as I mentioned, really strong results in each of the segments by region. I mentioned enterprise mid-market.\n\nWe're seeing the reps that we're bringing on continue to ramp pretty well, get acculturated, understand how to navigate within our authentic culture and collaborate on deal closure. And we're seeing some really good results in virtually over all of our developing markets from Lat Am to Asia and beyond. But maybe to the root of your question, of course, we're keeping our eyes very closely in terms of monitoring time to close and how deals are progressing through that pipeline from the early stages of awareness through close to give us any leading indicators of various scenarios that play out, as I shared in the prepared remarks.\n\nOperator\n\nOur next question is from Bob Napoli.\n\nBob Napoli -- William Blair -- Analyst\n\nThank you. Good afternoon. Solid results. I'd like to get maybe a little more of an update on Coupa Pay.\n\nLast quarter, you talked about some pretty attractive attach rates in mid-market, some very good momentum there. You were talking about virtual cards. Any -- can you give any color on the revenue from Coupa Pay revenue growth rates? Or is the revenue yield trending up? Virtual card cross-border would be much higher-yield products, but just anything -- any update on Coupa Pay on the economics of Coupa Pay and the addition of new products? Thanks.\n\nRob Bernshteyn -- Chief Executive Officer\n\nYeah. Sure, Bob. So, look, first of all, customer acquisition has continued to be consistently quite strong, right, greater than 30% overall; mid-market, over 50% of our deals, right? So, the demand for the offering that we're both in market with -- the offerings that we're in market with and the desire higher upmarket for fully built-out offerings is there. Total payment volume since inception has increased by 50% over just the last six months as one data point.\n\nBut probably one of the most exciting things is the enterprise solution around digital payments, right, that we're getting closer and closer to introducing. Early enterprise adopters should be using the platform in likely two to three quarters. And that's why I feel we'll really be able to test out the overall value proposition of the offerings under the kind of Coupa Pay umbrella.\n\nOperator\n\nOur next question comes from Ryan MacDonald. Your line is open.\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nHi. Thanks for taking my question. Rob, it's great to hear the commentary about sales reps ramping well and progressing well as you go through the year. Can you talk about what KPIs you're watching and measuring to sort of gauge those sales rep ramping? And then a follow-up for Tony.\n\n73% gross margins for third quarter and full year in the guide. Can you just remind us what sort of headwinds or why we should expect a step-down? I think last year, those -- at least on the subscription side, remained at 80% plus in the back half. Would love some more color there. Thanks.\n\nRob Bernshteyn -- Chief Executive Officer\n\nSure. So, thanks for the question. Look, I'm not going to bore the whole audience with every KPI that we look at for running this business. There's literally hundreds of them every quarter.\n\nBut as you'd expect, all the likely ones of ability to get onboard with any kind of deals, ability to get within a certain set percentile of quota attainment, time to ramp. We classify our sales reps into what we kind of call freshmen, sophomore, juniors, and seniors, and expectations we have for each. So, we have a lot of KPIs to help us really sense what's happening there. But I'd like to refer you to the answer I gave to an earlier question, which is we're not just looking at that.\n\nWe're looking at how the pipeline continues to develop. We're looking at the time to close from awareness to close and how the pipeline moves through the stages. We're looking at rep ramp scale in each of our segments, enterprise, mid-market, and core, and in each of our geos. So, there's a lot that goes into really gauging the health of the business and then figuring out the right level of investment to push into it quarter in, quarter out, as we've been doing now for 54 quarters. \n\nTony Tiscornia -- Chief Financial Officer\n\nYeah. Ryan, on your gross margin question, nothing, in particular, to call out that would be a one-off or a headwind heading into Q3 and the back half of the year. Our midterm target gross margins are 74% to 75%. We delivered obviously on that the last couple of quarters.\n\nAnd we believe with good execution, our prospects of delivering that again would be strong.\n\nOperator\n\nWe have a question from Terry Tillman. Your line is open.\n\nRobert Dee -- Truist Securities -- Analyst\n\nGreat. Thanks for taking the question. This is Robert Dee on for Terry. Curious to get an update on the Federal side with the recent FedRAMP authorization.\n\nHow has traction been in that vertical? And anything to share on the execution of that pipeline? Thanks.\n\nRob Bernshteyn -- Chief Executive Officer\n\nPipeline in that area continues to develop really well. We had a number of pretty early stage but very interesting accomplishments that we actually considered maybe sharing on the call but decided to hold off. I think we'll have a lot more to report around our traction there as we get through Q4 and get into the early part of next year.\n\nOperator\n\n[Operator instructions] And please limit yourself to one question to allow time for everyone. And our next question comes from Michael Turrin. Your line is open.\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nHey there. Thanks. Good afternoon. Appreciate you taking the question.\n\nIn terms of LLamasoft and the supply chain design category, wondering if anything you can share just around migration efforts there, if things continue to be progressing well and if that's at all an area of increasing focus from the demand side, as the uncertainty we're all hearing more about continues to form. And just a small follow-up. I just want to be clear in terms of the outlook in North America specifically. It sounded like you're taking potential for some headwinds there to perform, but not anything that you're seeing currently.\n\nJust want to make sure that's clear as well. Thank you.\n\nRob Bernshteyn -- Chief Executive Officer\n\nYeah, I think you got the second part right. On the first part, in supply chain design and planning, we're continuing to leverage our solutions in these distinct use cases that I've shared in the past that -- where they can play the greatest role and deliver the greatest value. Episodic use cases, for example, like transport optimization, which is a huge issue currently for so many of our customers. But they're still in what we believe to be in an acute phase of dealing with supply chain disruption.\n\nAnd we're doing everything in our power to really solidify our offer in applications during this time so that we can be in a position to really drive into more transformational projects once this acute phase gets settled.\n\nOperator\n\nOur next question comes from Brian Peterson. Your line is open.\n\nBrian Peterson -- Raymond James -- Analyst\n\nHi, gentlemen. Thanks for taking the question. So Tony, just one for you. Obviously, the margin guidance is moving a lot higher.\n\nI'd be curious, what are some of the key drivers or any context you can add there? And I'd love to maybe specifically get a stance on how you're looking on hiring or thinking about sales capacity as we're going throughout the year. Thanks.\n\nTony Tiscornia -- Chief Financial Officer\n\nYeah. Hey, Brian, I think the margin profile of our business and the fact that we've been in the 74% to 75% range the last couple of quarters, to your point, our guidance is higher, is reflective of really the scale that we have and the leverage we have in our model -- in our business model. I think hiring continues to go along as planned. And with good execution, the midterm target of 74% to 75% gross margins that we're operating in now, we think, are attainable with good execution.\n\nOperator\n\nWe have a question from Robert Simmons. Your line is open.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nHey, thanks for taking the question. You bumped up subscription revenue guide for the year but lowered professional services and other. Is that due to LLama conversions going well? Or is there something else driving that change?\n\nTony Tiscornia -- Chief Financial Officer\n\nYeah. I mean I think LLamasoft supply chain term license conversion from the legacy business have gone very well. We're not completely done with those. But for all intents and purposes, you probably won't hear us talk much about it anymore because they're mostly completed.\n\nReally, I mean, when you think about our model, we have said for many years that we would like our professional services and other revenue as a percentage of total to be in that kind of 8% to 10% range. We have a partner-led model, and we continue to focus as a key strategic element of our business on partners leading implementation. So, I think more than anything, that's reflective of that.\n\nOperator\n\nAnd we have a question from Josh Beck. Your line is open.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nYeah. Thank you for taking the question. I have one maybe going back to kind of the CIO level. Are you seeing any slowdown with respect to modernizing ERP systems? Obviously, I think that's a project that brings in procurement and BSM in many cases.\n\nOr is it maybe they're moving forward with those projects but maybe wanting to have a narrower budget? Just curious if there's anything that you're seeing on that front.\n\nRob Bernshteyn -- Chief Executive Officer\n\nProstatics are rightfully cost-conscious. They've always been cost conscious. And in that light, we've still been able to drive our average annual subscription value per deal up virtually every quarter for 54 quarters, which tells us we have something with incredible value to offer. And I think both scenarios are playing out that you raised.\n\nOne is there are folks that are retaining their existing ERP deployments, which we're completely comfortable with, because we -- our strategic extension to ERP, as it pertains to business spending, give them a lot of leverage out of the many ERP systems they may have in their IT environment. And in some cases, they are considering upgrading their entire ERP platform, which is part of our broader transformation initiative. And very often, we fit very well at the very front end of that because the savings generated through our platform can actually pay, in many cases, for some of that transformation that would happen downstream. So, both dynamics put us in a pretty interesting position, and our sales reps continue to offer a unique value proposition.\n\nOperator\n\nOur next question comes from Siti Panigrahi. Your line is open.\n\nUnknown speaker\n\nHi. This is Avidav on for Siti Panigrahi. Just a kind of question to breaking out the pipeline a little bit. What are you guys seeing in terms of later-stage pipeline versus more top of the funnel? Kind of what is -- how does that break out? And then, I guess, along those lines, the same thing for new logos versus cross-sell.\n\nAre you starting to see more and more cross-sell activity as the business environment has started to slow down? Or what does it look like from both of those vectors? Thank you.\n\nRob Bernshteyn -- Chief Executive Officer\n\nYeah. Look, the pipeline continues to develop in a healthy way, both at the very front end, as well as through stages of pipeline. And as I mentioned earlier, the key process, carefully monitoring movement from early stage awareness all the way through close, which we have our eyes very firmly planted on. In terms of your question about expansion, I can tell you, we've been at this for well over a decade, and we've developed a pretty comprehensive business spend management platform that now has over a dozen market-leading capabilities.\n\nSo, while we're still primarily focused on hunting and landing net new logos, we have begun iterating on what our harvesting model could look like, looking at the right regions, the right products, the right customer segments we might want to focus on. So, we're in the early stages of evaluating how to fully maximize that potential for us downstream.\n\nOperator\n\nWe have a question from Peter Levine. Your line is open.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nHi. Thank you for taking my questions. Maybe just one for you, Tony, is how should we think about the durability of -- or sustaining your targeted 25% subscription billings started going forward? I don't want to corner you into giving guidance, but maybe walk us through the variables that would alter that trajectory, given the current environment and then some of the near-term scenarios you outlined earlier on the call.\n\nTony Tiscornia -- Chief Financial Officer\n\nSure. Thanks for the question, Peter. I think Rob outlined really well some of the different variables in play with respect to the macro environment and how that looks and some of the softness we've seen in Europe, the strength we've seen in North America. To your point, I mean, we've already provided guidance on this call with respect to subscription billings for Q3.\n\nSo, for us, it's partly about that and also about execution.\n\nOperator\n\nOur next question is from Daniel Jester. Your line is open.\n\nDaniel Jester -- BMO Capital Markets -- Analyst\n\nGreat. Thanks for taking my question. Just on the scenarios, Rob, that you mentioned at the beginning of the call about the different macroeconomic outlooks and how you can adjust the levers of the business. I mean, how real time can that -- the leverage be pulled? Is that something that we could see within a quarter or 2? Or are you thinking about the longer term when you're framing those scenarios in your ability to toggle expenses? Thanks.\n\nRob Bernshteyn -- Chief Executive Officer\n\nDaniel, I think that's a phenomenal question and one I really appreciate. And for those of you who know our business well and how we run it, we do quarterly releases of discretionary budget, talent headcount, all expenditures in the company. So, yeah, absolutely. That's the type of thing that is very dynamic for us and managed quarterly.\n\nOperator\n\nOur next question is from Taylor McGinnis. Your line is open.\n\nTaylor McGinnis -- UBS -- Analyst\n\nYeah. Hi. Thanks for giving me for taking my question. I guess just given the current macro, the subscription billings upside in the quarter was pretty solid.\n\nSo, can you talk about what drove the upside? Were there any deals that slipped last quarter that ended up closing or any uptick in large deal activity to flag? And maybe as a second part to this question, long-term DR has been increasing as a percentage of the mix of total DR and seems to maybe have benefited billings a bit. So, can you just like, as a second part, maybe comment on what's driving that as well, too?\n\nRob Bernshteyn -- Chief Executive Officer\n\nSo, this is Rob. Nothing that I see significant on sort of pushes and pulls of deals from quarter to quarter to your first question. And maybe, Tony --\n\nTony Tiscornia -- Chief Financial Officer\n\nYeah. On the second question, Taylor, we noted this last quarter as well. In an environment like this, which I think has some uncertainty, we're likely out in front of our customers sooner and more often than we typically would be in the past. And so just aligning with them on renewals, renewal terms, so that could be part of the equation with respect to long-term deferred revenue.\n\nOperator\n\nAnd we have a question from Gabriela Borges. Your line is open.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nGood afternoon. Good afternoon. Thank you. For Rob or for Tony, I would like to ask the question on EMEA versus North America in a slightly different way, which is how did activity compare relative to your expectations? And specifically, what was better than you originally expected three months ago? And then a follow-up for Tony, if I may.\n\nBack in March, we had a discussion around the potential for acceleration into fiscal year 2024. Does the commentary on the macro change your conviction in what the trajectory could look like into 2024? Or is there enough company-specific drivers to reiterate essentially the view on acceleration? Thank you.\n\nRob Bernshteyn -- Chief Executive Officer\n\nYeah. Thank you, Gabriela. The first question is a really great one. The -- what was much stronger than we anticipated, call it, three to six months ago, was the level of engagement we're seeing across Europe.\n\nWe thought it wouldn't be at total levels that it was. And it was really, really strong, which left us fairly encouraged on what we could see in terms of movement of pipe from awareness to close. And that second portion didn't materialize, so we were underwhelmed with the second portion and overwhelmed with what we saw on the front end of the pipe.\n\nTony Tiscornia -- Chief Financial Officer\n\nYeah, Gabriela, on your -- on the second part of your question, I'd say the following. When we look at the additional capacity that we hired in Q4 and Q1 of this year, definitely, we're seeing great progress in the ramp of those colleagues, the sales colleagues that we discussed. So that's one variable. I think Rob isolated the other variables, which are macro environment.\n\nWe talked about Europe and Rob mentioned -- as Rob mentioned, none of us know exactly where that's all headed. That could certainly have an impact, but we still have to see how that plays out.\n\nOperator\n\nOur next question comes from Steve Koenig. Your line is open.\n\nOwen Haworth -- SMBC Nikko Securities -- Analyst\n\nHey, guys, thanks for taking the question. This is Owen Haworth on for Steve. I'm wondering if you can just give a little more color on the conversations you're having with these European customers. And to what extent is the softness? Is that softness there from a change in prioritization of their BSM initiatives? And then as a quick second, how are you adjusting your go-to-market motions and sales focus for these demand headwinds, if at all? Thank you.\n\nRob Bernshteyn -- Chief Executive Officer\n\nConversations are good. They just -- more approvers, more time being spent, more evaluation, more uncertainty in the European context, which is definitely not a prioritization change. It's not a removal of initiatives around Coupa from the list of priorities. It's simply a longer time in the pipe.\n\nOperator\n\nAnd our final question comes from Pat Walravens. Your line is open.\n\nPat Walravens -- JMP Securities -- Analyst\n\nGreat. Thank you. Thank you. So, Rob, a year ago, I asked you what your top three priorities were.\n\nSo from my note in September 2021, they were, number one, cement the organization because you've grown a lot both organically and inorganically. Number two, you said, was set the pace, make sure everyone is running in the right direction. And number three was establish the second and third levels of leadership to scale. So, what are they today?\n\nRob Bernshteyn -- Chief Executive Officer\n\nWell, I was going to actually report back on the goals that I had previously, Pat. So, on the org, I think a year ago, we were maybe 2,000 or so people, a little over that. We're 3,400 or so. As you see, we have more than 90% in the Best Place to Work survey that feel this is such a place, and more than 95% ascribe to our values.\n\nAnd part of our values is to maintain a pace. The second one is focused on results, so we feel pretty good about that. And when I look at the leadership at the second tier and third tier, I'm feeling more and more optimistic about that. Some really great acculturated colleagues that see our vision and see where we're going, so I feel like we're in a pretty good spot with that.\n\nAnd we set the themes, Pat, for the company, and I set those themes at the start of our calendar year. So, I'd love to pick up with that on you -- with you on that either on our next call or some time in between, so you could hear what we're thinking about there.\n\nOperator\n\nAnd we have no further questions in queue. \n\nSteven Horwitz -- Investor Relations\n\nWith that, thank you, everyone. We look forward to speaking to you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteven Horwitz -- Investor Relations\n\nRob Bernshteyn -- Chief Executive Officer\n\nTony Tiscornia -- Chief Financial Officer\n\nChris Quintero -- Morgan Stanley -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nBob Napoli -- William Blair -- Analyst\n\nRyan MacDonald -- Needham and Company -- Analyst\n\nRobert Dee -- Truist Securities -- Analyst\n\nMichael Turrin -- Wells Fargo Securities -- Analyst\n\nBrian Peterson -- Raymond James -- Analyst\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nUnknown speaker\n\nPeter Levine -- Evercore ISI -- Analyst\n\nDaniel Jester -- BMO Capital Markets -- Analyst\n\nTaylor McGinnis -- UBS -- Analyst\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nOwen Haworth -- SMBC Nikko Securities -- Analyst\n\nPat Walravens -- JMP Securities -- Analyst\n\nMore COUP analysis\n\nAll earnings call transcripts"
}