{
  "companyName": "Arista Networks",
  "companyTicker": "ANET",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/arista-networks-anet-q3-2022-earnings-call-transcr/",
  "content": "Arista Networks (ANET -0.43%)\nQ3 2022 Earnings Call\nOct 31, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the third quarter 2022 Arista Networks financial results earnings conference call. [Operator instructions] As a reminder, this conference is being recorded and will be available for replay from the investor relations section at the Arista website following this call. Ms. Liz Stine, Arista's director of investor relations.\n\nYou may begin.\n\nLiz Stine -- Director, Investor Relations\n\nThank you, operator. Good afternoon, everyone, and thank you for joining us. With me on today's call are Jayshree Ullal, Arista Networks' president and chief executive officer; and Ita Brennan, Arista's chief financial officer. This afternoon, Arista Networks issued a press release announcing the results for its fiscal third quarter ending September 30, 2022.\n\nIf you would like a copy of the release, you can access it online at our website. During the course of this conference call, Arista Networks management will make forward-looking statements, including those relating to our financial outlook for the fourth quarter of the 2022 fiscal year, longer-term financial outlook for 2022 and beyond, our total addressable market and strategy for addressing these market opportunities, supply chain constraints, component costs, manufacturing capacity, inventory purchases and inflationary pressures on our business, the potential impact of COVID-19, extended lead times, product innovations and the benefits of acquisitions, which are subject to the risks and uncertainties that we discussed in detail in our documents filed with the SEC, specifically in our most recent Form 10-Q and Form 10-K, and which could cause actual results to differ materially from those anticipated by these statements. These forward-looking statements apply as of today, and you should not rely on them as representing our views in the future. We undertake no obligation to update these statements after this call.\n\nAlso, please note that certain financial measures we use on this call are expressed on a non-GAAP basis and have been adjusted to exclude certain charges. We have provided reconciliations of these non-GAAP financial measures to GAAP financial measures in our earnings press release. With that, I will turn the call over to Jayshree.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nThank you, Liz. Thank you, everyone, for joining us this afternoon for our third quarter 2022 earnings call. We delivered record revenues of $1.17 billion for the quarter, with a non-GAAP earnings per share of $1.25. Services and software support renewals contributed approximately 16.3% of the revenue.\n\nOur non-GAAP gross margins of 61.2% was pressured by escalated costs due to supply chain, as well as a substantially higher cloud titan mix. We expect some of these trends to continue into 2023. Cloud Titan was our largest vertical, followed by enterprise and then cloud specialty providers, financials and finally, service providers. International contribution was at 17%, with the Americas at 83%, once again reflecting stronger cloud customer influence.\n\nOur Q3 2022 results reinforce Arista's customer relevance in both Cloud Titan and specialty cloud providers. I would like to invite Anshul Sadana, our chief operating officer and cloud [Inaudible] to shed some light on this.\n\nAnshul Sadana -- Senior Vice President and Chief Operating Officer\n\nThank you, Jayshree. Our partnership with the cloud Titans and specialty providers keeps getting stronger. While supply chain got most of the attention for the last two years, we have achieved several technical milestones with our customers during this period, taking our products from labs to pilot to high-volume deployments. We have successfully deployed in more use cases than before, including the leaf-spine cluster designs [Inaudible] data center interconnects, backbone, WAN and Edge.\n\nOur customers have a deep appreciation of our expertise and execution. The Titans, starting with Microsoft and Meta are continuing with their 400-gig journey. They're using our latest fixed and debugger modular 400-gig switches in these new deployments. We are continuing to expand our use cases with the other titans too.\n\nWhile they are relatively smaller, these partnerships are healthy and continuing to grow as well. The specialty cloud providers are continuing to grow, too. They have very similar leaf-spine designs, but with smaller clusters, and they too have the same DCI and regional designs, just fewer ports. We are in a competitive industry, and our customers like some diversity.\n\nHowever, we are very well-positioned to maintain and grow our share given our quality, execution and strong partnerships. Back to you, Jayshree.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nThanks, Anshul. We are experiencing one of our best ever cloud titan growth and revenue this year since IPO. Therefore, we expect north of 45% contribution in 2022 from this category with a diversified product portfolio and use cases, as you heard from Anshul. Speaking of new products, Arista introduced the next phase of routing this quarter in Q3.\n\nArista's Cloud-Grade routing platform, powered by Extensible Operating System, EOS and our Network Data Lake, NetDL, is built on a consistent architectural foundation for multiple routing use cases such as peering, content delivery, networks, Cloud Connect, Enterprise Edge, mobile and Metro Edge, as well as carrier core. We have successfully transformed legacy routers to modern routing. For our customers securing data in transit, Arista's innovative TunnelSec technology provides in-line encryption at wire speed from 10 gig all the way up to 400 gig, eliminating the performance bottleneck of traditional encryption. Arista's latest R3 series routing portfolio continues to deliver for our adjacent market sector that we began six years ago.\n\nAs I mentioned previously, our customer momentum continues. Our $1 million logos have doubled in the last three years and Arista's market share in 100, 200 and 400-gig ports clients placing us at a No. 1 market leader position according to many industry analysts. Let me illustrate with a few customer wins this year.\n\nThe recurring theme to remember is that Arista is diversifying its business with many use cases such as data center, campus, routing, cloud and edge based all on cloud principles. Our first enterprise win highlights the ever-growing strength of a single solution for diverse use cases in the data center, in the campus and in data center interconnect routing. Based on industry standards and monitoring capabilities with Arista's DANZ Monitoring Fabric, or DMF, Arista was uniquely positioned to provide a single EOS binary code version using CloudVision and our NetDL stack. The next is an international Americas win in the financial sector, providing secure data center solutions.\n\nArista's competitive advantage was twofold. First, our single U.S. stack provided reassurance that they could handle security patches, bug patches, new software code upgrades with zero down time, much better than our peers in the industry. Also, we can do much better automation.\n\nTraditionally, it used to take customers several months, if not years, to go live with a single data center with their incumbent vendor. Arista's programmatic APIs, continuous integration validation with DevOps integration was deployed across multiple data centers within just a few days with no human intervention or errors offering the lowest total cost of ownership. Our third win demonstrates our strength in campus in the healthcare sector. This customer was looking to upgrade its legacy infrastructure in multiple hospital locations and moving more to a cloud-operated model.\n\nArista provided that cloud-managed network offering across the data center campus and cognitive WiFi and also WAN Edge and Internet Edge. The single pane of glass offers real-time network-as-a-service with visibility, health checks, troubleshooting and provisioning to the client, all the way to campus and to the cloud infrastructure. The next international win shows our continuing presence in the public sector. This customer wanted to move to 100-gigabit Ethernet using Arista's Spline and Spine platforms to connect into incumbent DWDM, Edge and load balances for massive route scale.\n\nArista's advantage was the lowest software security vulnerabilities over a nine-year period compared to alternatives that were significantly higher. This, by the way, also applied to Arista's cognitive WiFi with zero vulnerabilities. Our final win emphasizes Arista's ability to provide encryption as a part of a secure routing solution. This was an international Tier 2 service provider, whereby Arista delivered full line rate data in transit for the customers' remote sites.\n\nThis bespoke design encompasses Layer 3 virtual private network, VPN, over VXLAN routing solutions with macro segmentation based on access list and direct flow rules, all managed by CloudVision. Overall, you can see that Arista continues to gain customer relevance and market share and building our vision for a client to cloud network. The promise of not only delivering on superior technology, but the ability to help our customers realize the operational benefits via world-class quality, support is a real compelling advantage. We look forward to sharing more of our vision and strategy at our Analyst Day this Thursday, November 3, 2022.\n\nNow I will turn over to Ita for our financial specifics.\n\nIta Brennan -- Chief Financial Officer\n\nThanks, Jayshree, and good afternoon. This analysis of our Q3 results and our guidance for Q4 2022 is based on non-GAAP and excludes all noncash stock-based compensation impacts, certain acquisition-related charges and other nonrecurring items. A full reconciliation of our selected GAAP to non-GAAP results is provided in our earnings release. Total revenues in Q3 were $1.177 billion, up 57.2% year over year and well above the upper end of our guidance range of $1.025 billion to $1.075 billion.\n\nOverall demand for our products remains healthy across all areas of the business. Supply challenges continued throughout the quarter, with ongoing supplier decommits, constraining shipments and requiring higher-cost broker purchases and expedite fees. Services and subscription software contributed approximately 16.3% of revenue in the third quarter, down from 17.6% in Q2. This largely reflected accelerated growth in product revenues, while service and software continue to grow on a more consistent basis.\n\nInternational revenues for the quarter came in at $199.1 million or 17% of total revenue, down from 20% in the second quarter. This reflected strength in U.S. revenues in the period and particularly with our larger cloud customers. Overall gross margin in Q3 was 61.2%, just above the midpoint of our guidance range of 60% to 62%.\n\nAs previously discussed, our current lower gross margin ranges reflect a healthy cloud mix and higher levels of broker component sourcing and expedite fees. Operating expenses for the period were mostly flat to last quarter at $227.7 million or 19.3% of revenue. R&D spending came in at $150.1 million or 12.8% of revenue up from last quarter at $148 million. This primarily reflected increased headcount costs in the period with slightly lower new product introduction costs.\n\nSales and marketing expense was $62.8 million or 5.3% of revenue and G&A costs were $14.7 million or 1.3% of revenue, both mostly consistent with last quarter. Our operating income for the quarter was $492.1 million or 41.8% of revenue. Other income and expense for the quarter was a favorable $6.1 million and our effective tax rate was approximately 21.3%. This resulted in net income for the quarter of $391.9 million or 33.3% of revenue.\n\nOur diluted share number was 314.4 million shares, resulting in a diluted earnings per share number for the quarter of $1.25, up approximately 69% from the prior year. Now turning to the balance sheet. Cash, cash equivalents and investments ended the quarter at approximately $2.98 billion. We repurchased $47.6 million of our common stock during the third quarter at an average price of approximately $99 per share.\n\nAs a reminder, we've now repurchased approximately $740 million or 7 million shares against our October 2021, $1 billion board authorization. The actual timing and amount of future repurchases will be dependent on market and business conditions, business requirements, stock price, acquisition opportunities and other factors. Now turning to our operating cash performance for the third quarter. We generated $134.1 million of cash from operations in the quarter, reflecting strong earnings performance, somewhat offset by increased working capital investments.\n\nIncreases in inventory and other assets are mainly driven by receipt of components for future shipments, including shipments delayed due to supplier decommits. This trend should reverse once overall supply conditions for these decommitted components improve. DSOs came in at 51 days, flat to last quarter. Inventory turns were 1.7 times, down from 1.9 times in the prior quarter.\n\nInventory increased to $1.1 billion in the quarter, up from $852.8 million in the prior period, reflecting higher component and peripherals inventory and an increase in switch-related finished goods in transit. Our purchase commitment number for the quarter was $4.3 billion, down from $4.5 billion in Q2. These multiyear purchase commitments reflect overall strength and demand and the current long lead time supply environment. As a reminder, we continue to prioritize newer early life cycle products for inclusion in these strategies in order to help mitigate the risk of excess or obsolescence.\n\nOur total deferred revenue balance was $941 million, down from $1 billion in Q2. The majority of the deferred revenue balance is services related and directly linked to the timing and term of service contracts, which can vary on a quarter-by-quarter basis. Approximately $165 million of the balance, down from $228 million last quarter, represents product deferred revenue largely related to customer-specific acceptance clauses for new products with our larger customers. Accounts payable days were 56 days, down from 63 days in Q2, reflecting the timing of inventory receipts and payments.\n\nCapital expenditures for the quarter were $10.4 million. Now turning to our outlook for the fourth quarter. We came into the year calling for 30% year-over-year revenue growth, somewhat balanced across our market sectors and heavily constrained by supply. We now expect revenue growth for the year of approximately 45% at the midpoint of our Q4 guidance with a healthy contribution coming from our Cloud Titan customers in what has remained a stubbornly constrained supply environment.\n\nOur Cloud Titan customers are now expected to account for approximately 45% of our revenue for the year with major contributions from Meta and Microsoft. Demand from our enterprise and provider businesses has also been strong, exceeding our original expectations from a demand perspective, but with revenue somewhat constrained by supply. We expect gross margin pressure to continue in the quarter with some continued need for broker purchases and expedite fees in response to ad hoc supplier decommits combined with a healthy cloud mix. Even allowing for the lower gross margins, we expect healthy operating margins for the quarter, again demonstrating the resiliency of the business model with significant bottom line flow-through from increased revenue scale.\n\nWith all of this as a backdrop, our guidance for the fourth quarter, which is based on non-GAAP results and excludes any noncash stock-based compensation impacts and other nonrecurring items is as follows: revenues of approximately $1.175 billion to $1.2 billion; gross margin of approximately 60% to 62%, operating margin of approximately 40%. Our effective tax rate is expected to be 21.5% with diluted shares on a post-fit basis of approximately 360 million shares. I will now turn the call back to Liz. Liz?\n\nLiz Stine -- Director, Investor Relations\n\nThank you, Ita. We will now move to the Q&A portion of the Arista earnings call. [Operator instructions] Thank you for your understanding. Operator, take it away.\n\nOperator\n\n[Operator instructions] Your first question today comes from the line of Tim Long with Barclays. Your line is now open.\n\nTim Long -- Barclays -- Analyst\n\nThank you. I was hoping you could just talk a little bit about kind of the enterprise and campus strategy. Obviously, you guys have been growing pretty well there. If you could kind of update the $400 million bogey for the year.\n\nAnd you've mentioned [Technical difficulty]\n\nJayshree Ullal -- President and Chief Executive Officer\n\nWe lost him. Tim, are you there? \n\nTim Long -- Barclays -- Analyst\n\n[Inaudible]\n\nJayshree Ullal -- President and Chief Executive Officer\n\nYour audio. Tim, you're sounding muffled. Why don't -- I think I'll interpret your question, Tim, even though I only heard half of it, which is what is your status on campus and enterprise strategy? And how are you doing the $400 million target. Obviously, we will get back to you when we have completed the year.\n\nBut at this point, we would say that the strength of our campus business from an order respective is [Inaudible] $400 million. We are very supply constrained. So we're not yet sure if we will hit a $400 million from a revenue and shipment perspective.\n\nTim Long -- Barclays -- Analyst\n\nI'm sorry, if you could just touch on the wireless LAN contribution. It sounds like that's doing a little bit better now. Sorry about that. I was muffled a little.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nYeah. No, we are very pleased with our wireless LAN contribution. If you think back, we acquired Mojo Networks in 2018, late 2018, early 2019, and it was a very small single-digit business. And we expect the wireless LAN contribution to become a triple-digit business next year.\n\nLiz Stine -- Director, Investor Relations\n\nThank you, Tim.\n\nTim Long -- Barclays -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour next question comes from the line of Alex Henderson with Needham. Your line is now open.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nGreat. Thank you very much. Spectacular results for the quarter, for the year, in fact of the results last year. And I guess the question really boils down to are we going to see a reversion to more normalized growth? And if that happens, does that bring the margins back into the 37% range? And have we set ourselves up against extremely difficult comps as we go into 2023.\n\nHow do we think about the mechanics of where we are alternatively? Clearly, supply constraints persist, you sound more constrained than you had earlier, and that would imply to me that at least for the first half of next year or even longer, you might still be in the strong growth trajectory. Can you just address how we should be thinking about the environment as we move forward? Thanks.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nAlex, thank you for the kind words, and I'll tee it up and certainly let Ita speak to some of the details you are asking about. First of all, I just want to say I'm very proud of the team for executing. As you know, we came into the year expecting 30% growth. And here we are telling you it's going to be 45%.\n\nSo a huge contribution from Anshul and the team, not only on the cloud titans, but also on the enterprise and rest of the cloud business, as we call it led by Anshul and Ashwin, a lot to be proud of, especially as the numbers get larger. So as you think about the numbers getting larger, it's going to be difficult to sustain 45% growth every year. I'd love to have it. But, as you know, Arista is a volatile business, and you have to think of us across a three- to five-year CAGR, not just on an annual basis.\n\nSo I still think we have a large TAM. We're going to do very well. But with the looming uncertainty of recession and capex spend, etc., it's definitely difficult to predict beyond a year. Having said that, I think, as I said before, we're having one of our best ever years in 2022.\n\nAnd even though the comps will be difficult, we feel confident that if supply chain gives us some relief, we can do well in 2023 as well. Ita, would you like to add [Inaudible]\n\nIta Brennan -- Chief Financial Officer\n\nYeah, I think, Alex, if you go back to the business model, Obviously, the gross margin kind of variability that we see that's kind of inherent to the business model is to do with the mix of the business, right? And that kind of works very nicely when you see accelerated cloud, you see that flow through to the operating margin line even though it might be impacting the gross margin in that time period, right? As we talk next Thursday, we'll talk some more about kind of what the growth rates look like for next year and kind of how that flows through the model. But there's no doubt that when we accelerate growth like this, it's hard for us to accelerate spending in the same rate and you never really kind of catch up [Inaudible]\n\nJayshree Ullal -- President and Chief Executive Officer\n\nIt's one to be proud of.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nThank you so much.\n\nOperator\n\nYour next question comes from the line of Paul Silverstein with Cowen. Your line is now open.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nI guess I shouldn't ask you what everybody wants to know, which is what's your outlook for next year?\n\nJayshree Ullal -- President and Chief Executive Officer\n\nYou wait a couple of more days, Paul. Just a couple of more days.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nI had to ask what everybody else is asking. So it's sort of at selling from the numbers that macro had much, if any impact, but last week did identify macro as a meaningful driver of a very disappointing outlook. Any thoughts you can share in terms of what you're seeing? Is it affecting one iota customer decisions as to your products and solutions. Any thoughts would be appreciated.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nLook, I don't think of Arista is a bellwether for macro. So we'll let the pundits on economists speak about that. But I think it's fair to say that data center spend has been very strong. And we're confident of our near-term strength, both in Cloud Titans, Enterprise and campus.\n\nIf there's a place that we see some softening at all geographically, I would point to Europe. They've had effect of the pandemic, the energy crisis, the war, the Brexit, it's just a whole lot of things going on there. But our numbers are small. And even there, I would say it's more enough to execute better.\n\nSo overall, macro is not yet an issue for us. We'll keep a vigilant eye on it, but so far, so good.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nJayshree, just to be clear, you're not seeing elongated sales cycles, you're not seeing cutbacks, deferrals or cancellations to any appreciable extent in orders, especially from enterprise. I appreciate that you're small, but your enterprise is not nothing. It's a growing business. And correct me if I'm wrong, but historically, in times of economic duress, most organizations have declined to change vendors or put off changes in their infrastructure that would result in bringing a new vendor like yourself?\n\nJayshree Ullal -- President and Chief Executive Officer\n\nRight. I don't think Arista is any more a new vendor. I think we are the best-of-breed vendor. And what we see, especially in networking, unlike any.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nNon-incumbent.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nYeah [Inaudible] I would say if anything, Paul, just to answer your question more directly, unlike server or storage, networking is a very, very strategic spend. There is a long qualification cycle that goes in, there's proof-of-concept labs, there's intense testing for scale. And we're all struggling with lead times. So switching vendors doesn't give you any particular advantage.\n\nAnd if you're looking for best-of-breed and best operational advantages, our customers would prefer to wait for us. So of course, we don't want to test their patients. We're going to do everything we can to execute. You're seeing that in our purchase commitment, but we've got to execute even better.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nAll right. I Appreciate your response. Thank you.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Simon Leopold with Raymond James. Your line is now open.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThanks for taking the question. I wanted to get a little bit of help understanding how to think about the purchase order commitment. Just looking at the prior 10-Q filing, you had a 12-month commitment of like $2.9 billion, and you mentioned today that the overall commitment came down a little bit to $4.3 billion. But what I'm struggling with is if we just sort of try to back into implied revenue, it's well above what most of the Street is modeling for the next year.\n\nAnd there are a number of ways that we could think about it. You could either write off inventory, you could hold higher inventory levels or certainly you could have much higher revenue than we expect. I'm wondering if you could give us some advice on how to interpret these purchase order commitment. Thank you.\n\nIta Brennan -- Chief Financial Officer\n\nYeah, Simon, I think obviously, the goal is to make the purchase commitments that we need to support the business, but it is multiyear, right? And we are thinking about this kind of longer term than just the year that's ahead, right? So that's why you're seeing the numbers kind of not match perfectly to whatever your revenue assumption is for just for 2023, right? So well, again, we'll talk about 2023 and the growth rate when we get to the Analyst Day. And then maybe you can ask this question again, and we'll try to provide some more guidance, but it really is about being multiyear, and some of these products are early stage products where we believe we can put [Inaudible] so that there's a limited risk in terms of E&O and reserves and really you're tying up cash, but that's kind of the -- that's worth it in terms of being able to have the products and have the components in place when we need them.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThank you.\n\nIta Brennan -- Chief Financial Officer\n\nThanks, Simon.\n\nOperator\n\nYour next question comes from the line of Meta Marshall with Morgan Stanley. Your line is now open.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Ita and Jayshree, maybe if you could just comment on whether some of the upside that you're seeing from the Cloud Titans this year is due to kind of greater ability to serve them and get them more product than they wanted or if you're actually getting kind of stronger orders than expected? And just kind of on the deferred revenue, being recognized if there are projects that are kind of changing and timing that led to kind of the stronger-than-expected results. Thanks.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nThanks, Meta. So I think it's fair to say, as Anshul has often said that our relationship and partnership with the Cloud Titans continues to be strong and couldn't be better. especially with Microsoft and Meta, who we fully expect to be greater than 10% concentration. I wish we could ship them more.\n\nAnd I think if they were hearing this call, they would be saying, I wish you could ship us more too. So I don't think it is a case of shipping more. I think it's a case of demand from them and a very strategic partnership at the engineering level, at the network design level, at the operational level, at the procurement level and actually Anshul, I'd like you to do -- since you're dealing with this daily, say some more.\n\nAnshul Sadana -- Senior Vice President and Chief Operating Officer\n\nMeta, the demand from these customers is just strong. Yes, there's some timing of revenue and deferred and so on. That's not what's leading into their strength, the raw demand from these customers continue to be strong. They want to do more build-outs.\n\nIf you look at how many data centers and regions they want to build out, it's very strong. you look at their DCI ads with 400-gig and 100-kilometer type of distances. Building big regions. That's very, very strong.\n\nAnd they love our execution. As Jayshree mentioned, if they could get them more product, they would happily take it as well. So all in all, a phenomenal outcome compared to where about two years ago, but in a very healthy cycle with our cloud customers.\n\nIta Brennan -- Chief Financial Officer\n\nAnd Meta, on the deferred, I mean nothing for the year and stage, right? If you look at it year-to-date, the really the deferred is not a contributor at all at this point.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nYour next question comes from the line of Ben Bollin with Cleveland Research. Your line is now open.\n\nBen Bollin -- Cleveland Research Company -- Analyst\n\nGood afternoon, everyone. Thanks for taking the question. I was hoping we could talk a little bit about just the broader supply and demand balance. I'm sure we'd all -- you included, would love to know when this ends, but I'm curious how you're thinking about evolving from a supply perspective, when you think it maybe get directionally better when it's really better? And then also curious how it's influencing the duration of visibility you're seeing from customers, that has gotten longer.\n\nIs it still getting longer? Is it starting to shrink? What are you seeing there? That's it for me. Thanks.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nOK. Hey, Ben, so you asked really two questions, what's the direction of our visibility? Is it getting longer? Generally, right now, because of our lead times, our visibility is approximately six months to a year. And we've now had that kind of visibility, particularly from our cloud providers. So directionally, it's not getting longer, but staying about the same is what I'd tell you.\n\nAnd then what are we seeing on supply chain and when is it going to get better, gosh, we -- one of the reasons that even Anshul and myself made such a concerted effort, we got board approval for very large purchase commitments, multiyear despite a smaller revenue is exactly not to be in the spot we are which is we wanted to get all our components. But sadly, we have almost all the components except a handful and you can't build a system without the last few components. So we do have still subsidies shortages, as I said before, we expect this to go into 2023. And I think our long lead times will persist in the industry for networking, especially for the next several months and for 2023.\n\nSo we don't see a lot of relief in sight until we can get all the components being short of a few components still means we can't build the system. So expect us -- it's improving, but expect us to really only see improvement a year from now.\n\nBen Bollin -- Cleveland Research Company -- Analyst\n\nThanks, Jayshree.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nThanks, Ben.\n\nOperator\n\nYour next question comes from the line of Matt Niknam with Deutsche Bank. Your line is now open.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nHey, thank you so much for taking the question. On the guide for the non-GAAP op income margin. So I think you did 42-ish percent this quarter. I know the guide talks about a nearly 200 basis point step down despite stable gross margins.\n\nSo I'm just wondering if you can talk about where you see opportunity for incremental investment. And then if I could just sneak in one follow-up on the deferred revenue question. So it looked like deferred dipped about -- deferred revenue dipped about $92 million sequentially. I'm just wondering what's baked into the revenue outlook for 4Q from a deferred perspective? Thanks.\n\nIta Brennan -- Chief Financial Officer\n\nYeah. So on the deferred, the product deferred decline in Q3 is about $60 million. So there's a piece of it is just services, service contract timing and stuff in there. So really, the thing that's kind of directly linked to the revenue is about $60 million.\n\nFor Q4 in the guide, we're assuming no deferred, right, and no deferred impact, right? So that's that question. And then the other question was the expenses and operating margin. I think look, we were flat pretty much on opex in Q3. Some of that is timing.\n\nThat wasn't the original plan, obviously. So some of that will recover. And some of -- as we head into Q4, we'll see some sales commissions and other things at the back end of the year, tend to be a little higher as well, right? So it's kind of a combination of maybe some timing and then just the normal kind of Q4 dynamics.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nThank you very much.\n\nIta Brennan -- Chief Financial Officer\n\nThank you.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nThanks, Matt. Welcome to your first call.\n\nOperator\n\nYour next question comes from the line of Fahad Najam with Loop Capital. Your line is now open.\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nThank you for taking my question. Jayshree, I think at a recent investor conference, you said that you think the industry could grow double-digit revenue, if I recall, you said you were connecting clouds of data or centers of data. So I want to understand your response to a previous question that if the supply chain improved next year, you would do well versus what that double-digit outlook that you had earlier? Is that what you're thinking? Can you help us understand?\n\nJayshree Ullal -- President and Chief Executive Officer\n\nYes, Fahad. I'll try. I think in terms of demand, we fully expect to grow double digits next year, and I hope for years to come unless there's some real macro issues. Specific to next year, again, we will guide specifically at Analyst Day.\n\nBut I think if supply chain would be relieved, we would grow double digits. If supply chain continues to be constrained, will still grow double digits. So either way, [Inaudible] well next year.\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nI have one follow-up. What's the --\n\nJayshree Ullal -- President and Chief Executive Officer\n\nIt's a question of how well.\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nWhat's the risk of your cloud customers having some level of inventory buildup? I understand that there is a significant constraint on the networking equipment, but there has been evidence of inventory mismatches in the server and storage space as some other Cloud Titans. And so what's the [Inaudible]\n\nJayshree Ullal -- President and Chief Executive Officer\n\nVery little, Fahad. I think it's important to understand that nobody has been in a position to have any kind of inventory on networking. Anshul, do you want to add to that?\n\nAnshul Sadana -- Senior Vice President and Chief Operating Officer\n\nYes, Fahad. Our customers will consume everything we can ship. We are not worried about inventory build out any time soon.\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nAppreciate it. Thank you.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nThanks, Fahad.\n\nOperator\n\nYour next question comes from the line of Ittai Kidron with Oppenheimer. Your line is now open.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThanks, ladies, and great quarter. I guess a couple of questions. Jayshree, you talked about your activity with the cloud guys and how that cloud guys do want diversity and suppliers. And of course, there's always timing and projects where you kind of run ahead or below where you probably should be just given the timing of projects.\n\nDo you get a sense right now on -- if you're punching above or below your weight kind of and I'm calling weight, whatever the cloud guys really think you should be at long term from a share standpoint?\n\nJayshree Ullal -- President and Chief Executive Officer\n\nYeah. That's -- welcome back, Ittai. We haven't chatted in a long time. That's a really good question.\n\nYou had to ask a tough one. I do think we're punching at our weight in terms of demand, even above our weight. In terms of actually supplying, maybe below our weight. But by the way, I'm only talking about the cloud guys, it's not myself.\n\nAnshul, do you want to add to that?\n\nAnshul Sadana -- Senior Vice President and Chief Operating Officer\n\nWell, I'm not here to ref a boxing match. But in terms of supply, and overall demand, our customers like to diversify. I think most customers have already set their plans. We're not expecting any big dramatic changes from here on.\n\nAnd we talked about a couple of years now, that customers truly like our product. They like our execution. The partnership is healthy. And we're not worried because of claims from many companies on how they'll be ahead and they will beat us and all of that.\n\nIn the end, we've done really well. If someone takes a share in one of the roles, we take share in other roles, too. So as a result, because of the expansion in WAN and Edge and routing other use cases, we've done well, and our expectation is we'll actually continue to do going forward as well.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nGot it. OK. And maybe as a follow-up, Jayshree, I mean you did talk about the weakness in Europe, and it's obvious that there should be weakness over there. But your business over there is down on a year-over-year basis.\n\nAnd I guess I'm kind of wondering -- the traction and the share gains that you're having in the U.S., one would think that even in the current environment, if you're able to get share gains in Europe as well, you'd still be able to get growth out of there, maybe not 30%, 40%, but perhaps a 10%, 15%. So help me understand what -- maybe you could go later deeper into what's going on in Europe? And do you think that the current environment, maybe going back to your previous question, Paul's question that in this environment, perhaps customers are just less likely to consider a change to just stick with what they've got and maybe that's a hindering element?\n\nJayshree Ullal -- President and Chief Executive Officer\n\nSo -- no, I don't -- I was answering the question, Ittai, more on, is there a recession in a broad sense, if at all, we are generally seeing very strong demand worldwide. If at all, we are seeing some softness in weakness, it would be in parts of Europe because of all the things through. Specific to Arista, I see no reason we shouldn't be growing everywhere, including Europe. But our rate of growth in Europe may be slower for exactly the reasons you mentioned that their overall economy, if you look at the GDP and if you look at the top three countries, Germany, U.K.\n\nand France, none of them are really substantially investing. So I think because we have small numbers, we can do fine. We should be able to still grow double digits, but that is the only sign of recession we have so far seen. \n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nGot it. Very good. Good luck. Thanks.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nJust to correct you, we did -- we are growing year over year in Europe as well.\n\nIta Brennan -- Chief Financial Officer\n\nYeah, the [Inaudible] numbers, Ittai, I have a lot of cloud influence in them. So it depends when you strip that out, the kind of in-region business is growing.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nOK. Well, maybe on that point, did the U.S. grow? Can you tell us how much the U.S. grew without the titans?\n\nIta Brennan -- Chief Financial Officer\n\nOff the top of my head, no. Yeah.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nWe do by year-end.\n\nIta Brennan -- Chief Financial Officer\n\nYes. We'll show you those done at year-end for sure on the verticals of the business.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nAppreciate it. Good luck, thanks.\n\nIta Brennan -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of David Vogt with UBS. Your line is now open.\n\nDavid Vogt -- UBS -- Analyst\n\nThanks guys for taking the question. I just want to go back to the margin performance. If I go back to 2019, I think your titan mix was relatively similar to where we are today, maybe a little bit less but your gross margins were almost 300 -- on your product gross margins were almost 300 basis points higher. So can we kind of disaggregate that delta is how much of that is from expedited freight, supply chain versus maybe somewhat structurally lower margins with some of the new titans and/or Microsoft and Meta.\n\nAnd then on opex, just a quick question. Growth has been 15% to 20% sort of on a year-over-year basis. Is that kind of how we should think about the business as we progress over a couple of year cycle? Thanks.\n\nIta Brennan -- Chief Financial Officer\n\nYeah, I think on the gross margin piece, I mean, there is more cloud mix in the business, I think that we've seen than we've ever seen.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nThan we've ever seen. This is the highest mix we've had.\n\nIta Brennan -- Chief Financial Officer\n\nBut we also have -- remember, don't forget the expediting fees and stuff we've talked about the 200 to 300 basis points. I mean that is still there. I think that will be there for a while. Certainly in our Q4 guide.\n\nSo I think it's a combination of those two, right? When you think back in that time period, you could run the business for costs, right? And we were optimizing costs in every way. Today, we're kind of hamstrung because of supply, so it's inefficient right now, to be honest, right, particularly with these decommits. So we need to get out of that, and then we can kind of start to drive for some improvements on the gross margin side as well. I think on the opex side, if you look back historically, we've probably been in the 20%, 22% growth type range on opex except in times of disruption, right? So I mean, that's probably not a bad way to think about it.\n\nDavid Vogt -- UBS -- Analyst\n\nGot it. And maybe just a quick follow-up. So it sounds like your structural margins on the titans are relatively unchanged over the last, call it, two to three years outside of the expedite fee and supply chain. Is that a fair characterization on the product side?\n\nIta Brennan -- Chief Financial Officer\n\nI think it depends on the product mix to some degree, right? I mean, you've got -- there's more -- you'd have to do more disaggregation to really get to what's happening there, right? But there's -- the product mix is a part of that as well.\n\nDavid Vogt -- UBS -- Analyst\n\nOK. Thanks, guys.\n\nOperator\n\nYour next question comes from the line of Amit Daryanani with Evercore. Your line is now open.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nThanks for taking my questions. Congrats on the good quarter. I guess the question is we on the Cloud Titan side, and on a broader level of vertical, we're seeing an increased focus on profitability from the cloud company. And I'm just wondering, as they start to focus perhaps more of the resources on their own core competencies, could you see a lot of these cloud companies started to shift from building their own solution on the networking side, which is starting to buy them more often nothing understand, a, from your existing customer base, are you seeing an expansion of engagement with them beyond what you've traditionally done? And then, b, more importantly, are you seeing newer customers come to you that want to start buying for other than building it organically themselves?\n\nJayshree Ullal -- President and Chief Executive Officer\n\nOK. I'll take it in -- Thank you, Amit. I take it in two parts. The Cloud Titans have always had a combination of build and buy.\n\nSo I don't think that's changing. They continue to look at whether it's SONiC or FBOSS, working closely with us, but in some layers, they are absolutely sourcing their own products and technology. At the same time, I think the cloud titans have to run very mission-critical networks, and they recognize the value in the partnership at an engineering level to not build themselves, but really co-develop with us. So these, I would say, are not built or buy.\n\nThey really codeveloped partnerships where they get the best of both, and despite all of their focus on costs, believe me, they're getting their best of both because they're getting great cost for us without making the direct investment themselves, and it really is a unique partnership. Anshul, you want to say some more to that?\n\nAnshul Sadana -- Senior Vice President and Chief Operating Officer\n\nSure. Amit, in general, these cloud companies keep exploring every possible way to go faster. There's a misunderstanding [Inaudible]. But it's on the Wall Street side of things, sometimes people have said, hey, people want to find something that's cheaper because they can save money.\n\nThe reality, they have to look at their total overall business impact. And if they can go faster and get a competitive advantage, that's a huge benefit to them. So most of these companies do not build their own products or stack just a bit cheaper. They build it because there's some secret sauce.\n\nThere's some IP, there's some integration. That's what you're seeing with the co-development we do with Meta and Microsoft, whether it's on the FBOSS, SONiC side or some of the hardware we developed as well. The other titans explore the same use cases are similar themes with us on an ongoing basis. So these are not new discussions to us, and I think we'll continue to execute well.\n\nClearly, the majority of the business continues to come from our top two customers. We are happy with that. The others are engaged as we talked to us on previously, but those are long running projects, but then I'm going to get to a decision point and actually impact, you have to wait several years and we'll get there. But there's nothing that's changed in the industry.\n\nPeople are in generally happy with the way status quo has been maintained with a little bit of let's explore other options in working with companies like us where possible.\n\nLiz Stine -- Director, Investor Relations\n\nThanks, Amit. Operator, we can take the next question.\n\nOperator\n\nYour next question comes from the line of Aaron Rakers with Wells Fargo. Your line is now open.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYeah. Thanks for taking the questions, and congratulations as well on the quarter. I wanted to ask a little bit more of a technical question. As we think about 400 gig and you think about the traction you're seeing with your cloud titans, as well as some of the specialty cloud guys, I'm just curious if you could level set us on where you think we're at in terms of the 400-gig cycle.\n\nAnd on that topic as well, any updated thoughts on this idea of the AI Fabric networks, representing an incremental adjacent growth driver for your business at the Cloud Titans? Thank you.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nUnquestionably, I think while majority of the enterprise is still on 10 and 40, we are seeing more and more combinations of 100 and 400 gig, not only in the Cloud Titans, but also in the rest of the customer base. Just to level set on the numbers, you may recall that we had 70 or so customers in 2020. We doubled to 300 into 2021. And if I had to guess, I would say we double again in 2022 in terms of 400-gig customers.\n\nBut the important thing to remember here is that they are not just 400. There really are a permutation and combination of multiple speeds, multiple use cases. And together, they are an important contributor, but it's never an isolation 100. Some of them are uplinks, some of them are native connections.\n\nSome of them, as Anshul alluded, are DCI routing solutions. So our market share in this combination of 100, 400 and in some cases, 200 is No. 1 for good reason because they really have to work together with the right software and right management. The AI spine cluster is emerging as a new use case.\n\nIt's still early days, and we've talked about it some. We'll talk about it more at the Analyst Day, but more use case emergence for applications that really push the speed and latency and performance and predictable bandwidth of 400 gig is going to add additional fuel to our 400-gig demand.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nLiz Stine -- Director, Investor Relations\n\nThank you, Aaron.\n\nOperator\n\nYour next question comes from the line of Jim Suva with Citigroup. Your line is now open.\n\nJim Suva -- Citi -- Analyst\n\nThank you. Jayshree, Ita, I noticed in your press release that you made a comment to new market expansion. Could you elaborate a little bit like what is that? Or is that going to be a focus for the event on Thursday? Because I assume it's not just continual strength of where you're seeing or maybe it is. But if you can give any expansion on that? Because I know in the past, currently, you've seen a lot of expansion in the campus growth, but I saw the new market expansion literally, word for word, and I got to think there was some purpose behind that.\n\nThank you.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nMaybe you read more into my quote than I meant. At the end of the day, Arista is viewed as a data center company. But if you look at the diversified portfolio, we're trying to say we're entering many more new markets like routing, like campus and even subsets of the market like securing our solutions better with encryption, with better visibility and observability. And indeed, we'll talk more about new market expansion in a couple of days.\n\nSo undoubtedly, we're moving from becoming a pure data center company to many more markets that center the data in different locations.\n\nJim Suva -- Citi -- Analyst\n\nThank you so much.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nThank you, Jim.\n\nOperator\n\nYour next question comes from the line of Samik Chatterjee with J.P. Morgan. Your line is now open.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nYup. Thank you. Hi, thanks for squeezing me in here. I guess it's a similar question to the last one, but Jayshree, I just wanted to understand, as we look at your growth with cloud customers, how should we think about sort of that growth relative to sort of how much of that growth is coming from the additional use cases you're addressing beyond traditional switching.\n\nSo for example, like DCI or routing, how much of that is probably contributing to the strong growth you're seeing with cloud customers? As we think about sort of the next couple of years, how should we think about the -- given the visibility you have in terms of designs, how is that sort of momentum progressing from here on? And just a quick follow-up there. So outside of Facebook and Meta as we think about the engagement with other cloud companies, is that on some of the new use cases? Or is that traditional switching in leaf and spine?\n\nJayshree Ullal -- President and Chief Executive Officer\n\nFirst, I think it's super important to understand that even though it's leaf and spine, Samik, these data centers, whether they be building them at a regional level or a mega scale level, the leaf and spine is really going to expand and explode as the Cloud Titans expand their presence. So that growth -- that organic growth that we began our journey with them will continue. And we will depend on that growth. In addition to that, as Anshul said, we will have new use cases on the WAN, the regional, the DCI and especially AI spine, particularly with the cloud titans.\n\nIt may expand to those new use cases and it may also expand to other specialty cloud providers. But I would say we would be looking for sources of growth in both areas, expansion of the existing data centers into new locations and more scale as well as new use cases.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nJust one and half a dozen of the other.\n\nLiz Stine -- Director, Investor Relations\n\nThanks Samik.\n\nOperator\n\nYour next question comes from the line of George Notter with Jefferies. Your line is now open.\n\nGeorge Notter -- Jefferies -- Analyst\n\nHi, guys. Thanks very much. I guess I wanted to go back to the question of the Cloud Titan customers potentially building inventory. And I guess, on an earlier question, Anshul, you were pretty dismissive of that idea.\n\nI guess I'm just wondering what additional detail you might kind of have that supports that idea. And if I look at your business, you've been growing product sales 55%, 67% year on year, the last couple of quarters, it's pretty outstanding growth. And given the mix shift in the company, I would guess that the cloud titan customers have been growing 70% or 80% year on year, right? So I know you guys are building your own inventories. Many companies are building their own inventory in the supply chain environment.\n\nSo I do think it is an important question and I guess I'm wondering exactly how you know customers aren't building inventory in your stuff. Thanks.\n\nAnshul Sadana -- Senior Vice President and Chief Operating Officer\n\nGeorge, that is a good question. I get asked that internally daily because we have to worry about what's going on in the other side, our customers buffering. I would say the best sign is the number of phone calls I get or Jayshree gets or others in the company get on when shipping? So these customers are still roughly hand-to-mouth. There are a few places where they can still calibrate for the computer to come up and so on.\n\nBut in most cases, customers are desperate, the deployment teams are waiting for the gear to show up, and they light it up as quickly as possible. You have to realize where we came from but since the start of COVID, the world has been constrained. And that constraint over such a long period, generally means people can't execute the project time lines, and they're still short. At some point, this will recover but nowhere close to that in today's time.\n\nSo I think it will take a long time, maybe I'll say if supply recovers by the end of '23, I think that's when customers will feel comfortable, and they will eventually have an opportunity to buffer up but not yet, not there today.\n\nGeorge Notter -- Jefferies -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour next question comes from the line of Sami Badri with Credit Suisse. Your line is now open.\n\nSami Badri -- Credit Suisse -- Analyst\n\nHi. Thank you. I wanted to go to gross margins. I think Ita, you've made two references on this call regarding just the trajectory of margins.\n\nI think you said that we're probably not going to see an improvement in gross margins for at least a year from now. And then the other comment you made regarding the 200 to 300 basis points, I think you said it's going to be there a while. So does that imply that we should be modeling gross margins at least through maybe the first half of 2023 a little bit more in line to last couple of quarters? That's the first question. Second question is if you were to give us an idea on how many ports or how many switches with 400-gig ports shift to 2022, could you give us kind of like a percentage of total shipments and maybe what that would look like in 2023?\n\nIta Brennan -- Chief Financial Officer\n\nYeah. Just on the gross margin. I think given where we are today, I think it's not a bad idea to model that gross margin as being kind of constrained until we get out from under the constraint, honestly. I think that's a very real kind of cost that we're carrying, and it's not clear yet exactly when that starts to improve.\n\nSo yeah, I think it's not a bad idea to hold it there until we're able to kind of show real demonstrable improvements and more predictability, I guess, on these decommitted parts.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nYeah. And to answer your question, we -- I don't have exact numbers on 400 gig, but if I had to guess even though we're gaining customers, most of them are as uplink. So the number of ports is still small. I would say our penetration is well under 10%, maybe even 5%.\n\nThat's just a good guess.\n\nSami Badri -- Credit Suisse -- Analyst\n\nAnd then -- thank you for answering gross margin and that piece. But when we go into 2023, are you seeing almost like a sharp increase in that from sub-10% to obviously much higher than that or not quite yet?\n\nJayshree Ullal -- President and Chief Executive Officer\n\nNo, no. If we go into '23, the way to think of this is people are still migrating from 10 gig and 10 and 40 to 100 will still be the largest migration. As a result of that migration, you will see more deployment of 400 gig. So 400 gig will still be small.\n\nMaybe it will go from 5 to 10.\n\nSami Badri -- Credit Suisse -- Analyst\n\nPerfect. All right. Thank you very much.\n\nOperator\n\nYour next question comes from the line of James Fish with Piper Sandler. Your line is now open.\n\nJames Fish -- Piper Sandler -- Analyst\n\nHey, ladies, nice quarter and also results. Well, it's a metric, Ita, I know you don't really want to emphasize as much as others do in your space. You still have visibility here and confidence in that visibility. Maybe asking in a different way than others.\n\nAs supply chain here starts to normalize, how are you guys thinking about how long that backlog actually takes to turn back to a more normal level? Is it four, six, kind of eight quarters, that's currently in your thought process for next year. Are you seeing any change in cancellation rates? And then just lastly, what's going on with that services deferred revenue as in aggregate, we were down about $92 million and product was only -- was down $63 million. So trying to understand why services is being impacted here.\n\nIta Brennan -- Chief Financial Officer\n\nYes. We start with the services piece. I mean it's just all about the timing of the of the service agreements, right? If you think about what deferred venue is, if I sign a contract on day one, it's a two-year, three-year contract, you're going to have the maximum amount of deferred revenue you can have. And then when it comes toward the renewal of that contract, you're going to have the least amount of deferred revenue that you could have from a services perspective, right? So it's purely on timing on the services side, right? The lumpier thing is obviously on the product, but the services is truly just the mechanics of how the services contracts flow, right? And then I guess on the cancellations, etc., I mean, we have not seen any change in the business.\n\nI think we're to Anshul's point, I mean, we're still seeing customers very intensely focused on getting products at this point. I'm not going to try to age out the backlog, it's kind of a -- we're not quite there ready to do that just given some of the uncertainties on supply and so on.\n\nJayshree Ullal -- President and Chief Executive Officer\n\nAnd I think as lead times improve, we expect customer visibility to shrink. But right now, we're working hard on that lead time improvement. So we're a year away from that.\n\nJames Fish -- Piper Sandler -- Analyst\n\nGot it. Thanks.\n\nLiz Stine -- Director, Investor Relations\n\nThanks, James. Operator, we have time for one more question.\n\nOperator\n\nYour last question today comes from the line of Tom Blakey with KeyBanc. Your line is now open.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nHey. Thanks for squeezing me in, and Happy Halloween, everybody. Looking at your -- curious about the cadence of the Cloud Titan revenue. It seems like a big uptick here in the second half, if I'm characterizing that correctly from kind of the mid- to high 30s to get to that 45% for the year, you need to imply kind of over half.\n\nAnd if I do that simple arithmetic, it implies that maybe the cumulative revenue of service providers, specialty service providers, financial enterprise will be kind of flattening out in the second half. So just maybe comment on is my characterization correct. And there as a follow-up, are we relying a little bit more on one of those particular Cloud Titans more than the other? And about a correlation to actual capex spend comment would be helpful, too. Thank you.\n\nIta Brennan -- Chief Financial Officer\n\nYeah. I mean I think as you look at the year, I mean, obviously, we've been ramping revenues and ramping shipments. So we have been ramping kind of with cloud as well, right? And cloud has grown faster. It started off from a lower base, obviously.\n\nSo it did need to recover, if you like, it was at 30%, which is pretty much the lowest we've seen it last year, and we -- so it's definitely recovered from there. I think on the rest of the business, the demand is there. The demand has certainly exceeded our expectations when we came into the year. But given the shipment constraints, etc., it's kind of a bit of -- we've been trying to stick to the FIFO first in, first out as much as we can.\n\nAnd -- so that has been more constrained. I think we'll expect to see that kind of start to improve, hopefully, here as we head into next year.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nThank you. Meta versus Microsoft maybe into the second half of the year?\n\nJayshree Ullal -- President and Chief Executive Officer\n\nYes. We will have to wait to year-end for that, I think.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nOK. Thanks everybody.\n\nLiz Stine -- Director, Investor Relations\n\nThis concludes the Arista Networks third quarter 2022 earnings call. We have posted a presentation, which provides additional information on our results, which you can access on the Investors section of our website. Thank you for joining us today, and thank you for your interest in Arista.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLiz Stine -- Director, Investor Relations\n\nJayshree Ullal -- President and Chief Executive Officer\n\nAnshul Sadana -- Senior Vice President and Chief Operating Officer\n\nIta Brennan -- Chief Financial Officer\n\nTim Long -- Barclays -- Analyst\n\nAlex Henderson -- Needham and Company -- Analyst\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nBen Bollin -- Cleveland Research Company -- Analyst\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nFahad Najam -- Loop Capital Markets -- Analyst\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nDavid Vogt -- UBS -- Analyst\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nJim Suva -- Citi -- Analyst\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nGeorge Notter -- Jefferies -- Analyst\n\nSami Badri -- Credit Suisse -- Analyst\n\nJames Fish -- Piper Sandler -- Analyst\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nMore ANET analysis\n\nAll earnings call transcripts"
}