{
  "companyName": "FiscalNote Holdings, Inc.",
  "companyTicker": "NOTE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/14/fiscalnote-holdings-inc-note-q3-2022-earnings-call/",
  "content": "FiscalNote Holdings, Inc. (NOTE 13.85%)\nQ3 2022 Earnings Call\nNov 14, 2022, 10:00 a.m. ET\n\nOperator\n\n[Operator instructions] Sara Buda, vice president of investor relations, you may begin your conference.\n\nSara Buda -- Vice President, Investor Relations\n\nThank you, operator, and welcome, everyone. During this call, we may make certain statements related to our business that are forward-looking statements under federal securities laws. These statements are not guarantees of future performance but rather are subject to a variety of risks and uncertainties. Our actual results could differ materially from expectations reflected in any forward-looking statements.\n\nFor a discussion of the material risks and other important factors that could affect our actual results, please refer to our SEC filings available on the SEC's EDGAR system and our website, as well as the risks and other important factors discussed in today's earnings press release. Additionally, non-GAAP financial measures and other KPIs will be discussed on this conference call. Please refer to the tables in our earnings release for a reconciliation of non-GAAP measures to their most directly comparable GAAP financial measure. With that, I'd like to turn the call over to FiscalNote's chairman, CEO, and co-founder, Tim Hwang.\n\nTim Hwang -- Founder and Chief Executive Officer\n\nThank you, Sara. I'm glad to be here today on our Q3 2022 earnings call, which marks our second earnings call as a public company. Today, I'm going to provide some insight on our mission as a company and the unparalleled value we deliver to our commercial and public sector customers every day, cover a brief summary of our quarterly results, and discuss the foundation we have in place today in our strategy to leverage our unparalleled market leadership to deliver consistent, ongoing, profitable, compounding growth in the long term. Then, I'll turn it over to Jon Slabaugh, our chief financial officer, to discuss the details of our results and our outlook for year-end.\n\nBecause many of you are new to the FiscalNote story, let me start with a brief reminder of who we are and the long-term vision of the company. At FiscalNote, we're on a mission to help our customers make sense of the complicated political and regulatory world we live in by building fast technology products that help aggregate and organize government information and understand the impact of public policies on their organizations. Changes in laws and regulations impact the decision-making of almost every organization around the world, from changes in a complicated tax code, to operational changes companies and organizations must make on an ongoing basis. FiscalNote's products help to make sense of the changing regulatory and legal obligations by aggregating vast amounts of information and serving it to them on a regular basis, along with proprietary analysis, using cutting-edge machine learning and AI capabilities.\n\nAs such, we're building an enduring and durable company for the world's most important decision-makers, ranging from hundreds of government agencies from the White House to the CDC, to half the Fortune 100. These organizations rely on FiscalNote every single day to help interpret the impact of policies, laws, and regulations to their institutions. We power decision-makers in the areas of international diplomacy, foreign direct investments, trade policy, political strategy, and everything in between. Since we founded the company 10 years ago, we have been building a disruptive category creator, which constantly innovates to turn insights into actions and convert challenges into opportunities.\n\nIn a sense, we've become an increasingly mission-critical and ubiquitous Bloomberg Terminal of political, legal, legislative, and regulatory information at the local, state, federal, and global levels. This is a tremendously important time for our customers because the insights and answers we bring have a direct positive impact on their operations, risk management, and business strategy. From geopolitical conflicts in a country where they store supplies, to changing labor policies and wage regulations in states where they employ talents, to local sustainability regulations in municipality they operate in, the regulatory and policy environment changes constantly at all levels of government. Traditionally, making sense of all this information has been a manual and opaque process, and remains a massive underserved opportunity.\n\nOnly FiscalNote has the breadth of data and information and the depth of proprietary AI cloud-based workflow software and analysis to make sense of this exploding volume of dynamic, unstructured data and information. As a result, more than 5,000 global customers in the commercial and public sectors depend on FiscalNote SaaS platforms and analysis to discover, process, and navigate the impact of government policymaking on their organizations and, more importantly, to take actions, which achieve their business objectives. FiscalNote steady and long-term compounding growth arise from a consistent need by organizations to respond to trigger events, ranging from a new change in congressional leadership as part of an election, rule changes at a regulatory agency, or a new court case that may change the requirements of organizations around the country. Given the myriad of political challenges that exist, we believe FiscalNote is well positioned to be a primary beneficiary of this policy complexity.\n\nIn FiscalNote's approach to building a long-term growth compounder, we believe that there are two key components required to drive our strategy: number one, continue our strategy for growth and customer acquisition and product development to increase our customer base and deepen our relationship with our customers; and number two, driving efficiency in our operations to drive sustainable, profitable growth in the future. First, on growth. You saw from today's press release, we recently secured new commercial logos and expanded key accounts, including many Fortune 100 enterprise customers across a wide range of industries and geographies. A few weeks ago, we also announced several new contract wins, expansions, and renewals for our public sector clients across the executive, legislative, and judicial branches of the United States government.\n\nTogether, they serve as breakthrough points about the value we bring and the enduring and expanding nature of our relationships. Additionally, we previously announced major enhancements to our European product lines and key integrations with companies like Asana for our ESG product line that provide new avenues for growth in both geographic and subject matter areas for FiscalNote. As part of our continued geographic expansion, we announced the acquisition of DT Global that gave us an expanding and great breadth of information and content in Eastern Europe and the Middle East, particularly as the attention of the world turns in that direction. Every day, we provide the world's most important decision-makers with information, fast workable tools, and expertise they need to navigate an increasingly complex, volatile, and unpredictable geopolitical environment.\n\nI'm immensely proud of our teams and the critical work we do. Second, in our drive to deliver sustainable, profitable growth into the future, for the past 12 quarters, FiscalNote has continued to make investments in areas of artificial intelligence, automation, and technology to drive a more sustainable rate of growth. We've also reduced our cost to serve by expanding our scalable service model, consolidating frontline management, standardizing operations, refining KPIs for effective performance management, and shifting select customer support staff to lower cost geographies. That gives you a sense of what we do and the importance of the solutions for our customers.\n\nI'd also like to talk to you about who we are as a company and how we are building an enduring and resilient market leader of the future. We're doing that by providing a SaaS-based information platform, which helps solve critical information challenges specific to legal policy and economic data, building a broad and diverse base of recurring revenue with global customers across public and private sectors, and deploying a capital allocation strategy and operation model, which could drive long-term sustainable growth. We are undeniably a company focused on being a long-term growth compounder. Our growth strategy is simple: renew our base of customers every year, cross-sell and upsell new solutions, and build on this platform to address truly transformative categories in the future.\n\nOur listing this year was an important milestone for FiscalNote. And now, we turn our attention to sustainable growth through smart capital allocation. As leaders, we, along with Josh Resnik, our president and chief operating officer; and Jon Slabaugh, our chief financial officer, spent an extraordinary amount of time focused on capital management strategies, which support our foundational growth to be an enduring, profitable leader in our sector. As such, as a team, we will never choose a growth-at-any-cost strategy.\n\nWe are building this business for the long term. And the decisions we make will always be driven by our unrelenting focus on fundamental, sustainable profitability and cash flow in the long term. With that in mind, as a reminder, FiscalNote has always been differentiated, given not only its recurring revenue base, but also its high gross margins. These gross margins, results of our business model and software and data products, provide the basis of strong cash flow in the future.\n\nAs we evaluate capital allocation strategies, we balance the goal of minimizing dilution for existing shareholders while optimizing return in our internal investments across product and sales, as well as in future acquisitions. The combination of a recurring revenue business model, a high gross margin that provides the foundation for increasing profitability, and a management team focused on driving the highest return on capital, both organically and organically, means we are laser-focused on delivering long-term shareholder value through our decision-making. With this backdrop, let me give you a brief summary of our third quarter financials. As you saw in the press release, we delivered GAAP revenue of 29 million for the quarter, marking growth of 34% year over year.\n\nOur Q3 adjusted EBITDA is at negative 7.4 million, on track with internal plans. We are reiterating our adjusted EBITDA guidance for 2022 and our goal of adjusted EBITDA profitability in Q4 of 2023. Finally, our capital structure positions us well to drive organic and inorganic growth and support our path to profitability. In addition to the standard metrics, which we share in our earnings release, we provide additional information to help you understand our business and our priorities as a management team.\n\nOur three core KPIs are as follows. Run-rate revenue. This is a key management metric and is defined as ARR plus nonsubscription revenue earned during the last 12 months. Run-rate revenue was 121 million as of September 30th.\n\nThis marks growth of 14% year on year, including '21 and '22 acquisitions. Annual recurring revenue. Annual recurring revenue was at 108 million at September 30th, growth of 14% year over year. Net revenue retention.\n\nNet retention continues to be strong at 99% in Q3, consistent with the prior quarter. Our growth remains durable, and our business continues to excel. And this brings me to our guidance. First, we reiterated our adjusted EBITDA expectations for fiscal year 2022.\n\nWe are clearly on path for the near-term profitability goals we've outlined despite macro and market headwinds. Our management team's primary goal is adjusted EBITDA profitability, and that is exactly what we are on track to deliver. This is a continued focus and drive for the business that remains unwavering and unchanged. We have taken a number of initiatives, both structurally and culturally, to drive sustainable and profitable growth into the future, particularly given the environment we all find ourselves in, reprioritizing our commitment to profitability in order to be prudent capital allocators and drive strong returns for our shareholders.\n\nSecond, given our durable net revenue retention rates and the underlying recurring revenue fundamentals of the business, we added GAAP revenue as one of the metrics we will guide to moving forward. Third, we updated our organic run-rate revenue expectations. We expect organic run-rate revenue to be in the range of 122 million to 126 million as of December 31st, as defined in the release. On that, let me provide some perspective.\n\nAs of the end of Q2, we had not seen an adverse impact from changing macroeconomic conditions in our sales efforts. In fact, throughout Q3, we secured a number of new high-profile customers as you saw from today's press release. Late in Q3, however, in September, we began to see some new prospects pause purchase decisions, plus elongating sales cycles, as a result of their own internal budget mandates brought on by the uncertainty of the macroeconomic forecasts. To be clear, new business was still strong in the quarter, just didn't come at the levels we initially forecasted due to the change in the macro environment.\n\nThat said, our year-over-year ARR growth remained strong, and our in-quarter net revenue retention rate is 99%. This demonstrates our customers rely on FiscalNote's must-have solutions to address existential issues now more than ever. We feel confident that we will continue to secure new business and grow relationships with our existing customers, given the importance of our products, as we have done for almost 10 years. By way of example, currently, customers are signing on or growing with us so that they can leverage our platforms to manage their existential issues they face from political, economic, and security risks.\n\nAs an example, businesses with supply chains impacted by turmoil in Eastern Europe; find incremental revenue opportunities by identifying and assessing new businesses, such as finding state and local government contracts after bid; and generate operational ROI by handling global compliance need more effectively, scaling their tracking and analysis of the platforms, rather than through manual efforts or internal resources. In sum, we believe we're more recession-resistant than many enterprise SaaS companies due to the stability of our government customer base and a mission-critical solutions we provide to our government and enterprise customers. But no company is completely immune to a more cautious enterprise decision-making cycle that occurs during macroeconomic uncertainty. Moving forward, we do have a number of indicators that indicate continued growth.\n\nFirst, given the critical nature of our solutions for both private sector and public sector organizations, the overall demand remains strong. Second, the business continues to have sound fundamentals, delivering strong net revenue retention and organic ARR growth. Third, in Q4, while still early days, we're starting to see an uptick in business activity as prospects gain clarity in their budgets that many of them did not see before. That said, the time to close new business is clearly elongated in this environment, and we are being prudent in our forecast.\n\nWhile we are not giving '23 guidance today, based on current activity, we expect to see fundamentals hold up, as we drive sustainable mid-teens organic growth year over year. In short, our compounding growth remain strong. Our GAAP revenue year-over-year growth of 34% this quarter demonstrates continued growth. With underlying ARR and a rich pipeline of new business, we are well positioned to drive ongoing organic growth.\n\nIn addition to organic growth, as a company, we continue to actively pursue accretive value-add acquisition, which provide cross-sell and upsell opportunities, which, in turn, form incremental growth opportunities in new customer segments and geographies. We have a strong and proven track record of accretive acquisitions which support our organic growth. As of today, our acquisition pipeline remains active. We are, however, being thoughtful as we pursue accretive acquisition and valuations aligned with the fundamentals of the business and the macro environment we're operating in today.\n\nAs I said, we are prudent capital allocators, and we'll always be judicious to prioritize investments that drive the highest return for our shareholders. In that spirit, before I turn over to Jon, let me summarize a few key points about FiscalNote and our strategy. We are a long-term growth compounder with a diverse and broad recurring revenue base of customers, which we renew and expand each year, which creates the foundation of an enduring and durable business in the long term. With a proven operational delivery model and a competitive moat based on the breadth of data analytics and insights we built over the past 10 years and the depth of our proprietary AI and SaaS workflows, we believe FiscalNote is well positioned to be a primary beneficiary of global policy complexity, given the myriad of political challenges that exist.\n\nWe are led by a disciplined, experienced, and exceptionally talented team with a relentless focus on sustainable, profitable growth, and smart capital allocation to build an enduring company for the future. Moving forward, we see several catalysts that will enable us to outperform over the long term. We will drive incremental growth and new value for our customers with additional data sets, insights and solutions, and workflows, giving us an expanding TAM and runway for growth in the mid to long term. We will add new investments in soft workflows, particularly in solutions, that allow us to enter new, transformative, regulated sectors in the future.\n\nWe will continue to make growth investments in Europe and APAC. We are tremendously early in our growth maturity. And we will meet our near-term and long-term profitability targets. In doing so, we ultimately lower cost of capital, which allows us to continue to build an enduring growth company and accelerate our market leadership position.\n\nThank you for your time. And with that, I'll hand it over to Jon Slabaugh, our chief financial officer and chief investment officer.\n\nJon Slabaugh -- Chief Financial Officer\n\nThank you, Tim, and good morning, everyone. I'd like to start off by providing more detail around the substantial progress we've made this quarter as we deliver on our profitability goals and further our strategy for becoming a long-term compounding growth company. Let me start off with revenue. For the third quarter, GAAP revenue was $29.1 million, up 34% year over year.\n\nYear-to-date revenue through September 30th was $82.3 million, marking over 40% growth from the same period last year. On an organic basis, our GAAP revenue growth rate was 13% year over year for Q3 and 14% year to date. What this states is very clear. Our underlying growth remains strong, and our M&A strategy is playing out largely as we expected, adding scale and giving us cross-sell and upsell opportunities to build on our compounding growth model.\n\nSubscription revenue, which makes up approximately 90% of our total revenue, was $26.1 million, an increase of $5.9 million or 30% from a year ago. Our advisory, advertising, and other revenue was $3 million in the quarter, an increase of $1.4 million from a year ago. As Tim mentioned, run-rate revenue is a key management metric defined as ARR plus nonsubscription revenue earned during the last 12 months. FiscalNote's run-rate revenue exiting September was $121 million, an increase of $15 million or 14% versus last year on a pro forma basis.\n\nOn an organic basis, run-rate revenue was $120 million as of September 30, 2022, including the Aicel acquisition but excluding other businesses acquired in 2022, also reflecting a 14% year-on-year growth rate. Our total annual recurring revenue, or ARR, rose to $108 million in September 30th, an increase of about $13 million or 14% compared to the same period in 2021 on a pro forma basis. Organic ARR also grew 14% year on year on a pro forma basis. Net revenue retention, or NRR, measures FiscalNote's success in retaining and growing our ARR for existing customers.\n\nARR was 99% for the quarter ending September 22, which is largely consistent with the same period in 2021. Our net revenue retention rate does fluctuate depending on the quarter and the sales mix between workflow and information services. Now, let's review some key profitability metrics. Gross profit was $20.4 million in Q3, representing a 70% gross margin.\n\nNon-GAAP adjusted gross profit was $23.3 million in Q3, representing 80% gross margin. To be clear on the difference, adjusted gross profit adjust for deferred revenue and amortization of intangible assets. Gross profit dollars in Q3 increased 25% versus a year ago. Both GAAP and non-GAAP gross margin percentages were down year over year, largely due to certain expense allocations from acquisitions.\n\nMoving forward, we expect non-GAAP gross profit margins to be relatively steady in the 75% to 80% range, barring any unusual items or variances of future acquisitions. Sales and marketing costs were $11.8 million in Q3, a notable increase from $7.5 million a year ago, as we continue to invest in sales and marketing and accounting for incremental sales expenses related to acquisitions. R&D expenses were $5.6 million in Q3, down from $6.4 million a year ago, in part due to increased software capex. Editorial cost in Q3 were $4.2 million compared to $3.8 million in 2021.\n\nG&A expenses were unusual in this period and were significantly impacted by some nonrecurring items, including $28.9 million relating to the accounting treatments of noncash stock-based compensation expense that was triggered as a result of our DSAC transaction. So, total G&A for Q3, inclusive of these charges, was $38.9 million. Excluding these noncash charges, G&A was $10.3 million, an increase of only about $1 million versus a year ago. The operating loss for Q3 2022 was $44.1 million in total.\n\nExcluding the noncash items I just mentioned, the operating loss was $15.5 million for the quarter. Interest expense was also impacted by nonrecurring expenses associated with our public listing in August. Total interest expense was $42.9 million in Q3. This includes a nonrecurring noncash charge of $32.1 million, recognized as interest expense related to the derecognition of beneficial conversion features that were embedded within certain convertible notes.\n\nBased on the Fed's most recent interest rate increase, we expect annual cash interest expense to be approximately $18 million. Offsetting some of this was a noncash gain of approximately $21.6 million related to the mark-to-market of the public and private warrant liabilities the company is required to fair value at each reporting date. Including these noncash nonrecurring items, the net loss for Q3 was $109 million on a GAAP basis. Our adjusted EBITDA for Q3 was a loss of $7.4 million, which excludes these and other noncash items as detailed in the reconciliation we provided.\n\nOur balance sheet remains in great shape with $78 million of cash and cash equivalents as of September 30th. We believe we have sufficient capital to support our growth initiatives and support our path to positive adjusted EBITDA as expected. This brings me to our guidance for 2022. We are reiterating our expectations for an adjusted EBITDA loss of approximately $23 million, which is the midpoint of our range for the full year 2022.\n\nWe are also reiterating our plan to be profitable on an adjusted EBITDA basis in the fourth quarter of 2023, only 12 short months from now. We are managing expenses and have strong recurring revenue base, which positions us well to achieve our profit goals amid uncertain economic environments. On the revenue side, given our underlying recurring nature of our revenue streams and the relatively strong visibility we have into organic growth, we are instituting annual GAAP revenue guidance. GAAP revenue for 2022 is expected to be between $112 million and $114 Million, which would represent about 36% year-on-year growth at the midpoint.\n\nThis growth demonstrates the compounding nature of FiscalNote's business model. In regard to the run-rate revenue guidance we provided in August, as Tim mentioned, we're updating our expectation for organic run-rate revenue to be in the range of $122 million to $126 million for 2022. This is a deviation from our initial guidance due to economic headwinds in the recently corresponding elongated sales cycles we began experiencing in September, particularly on larger new contracts. The sales cycle for our government business remains relatively steady and unchanged.\n\nOur M&A pipeline remains robust. Proprietary relationships and bilateral negotiations continue to be our most productive source of corporate development opportunities. Considering the current macroeconomic conditions, FiscalNote is being even more selective to ensure we find the right targets and the right valuations. Specifically, we are focusing on opportunities that uniquely address our customer's most pressing needs that will drive predictable, sustainable compounding growth.\n\nOur team has walked away from many opportunities this year, where we could not get comfortable with the target value proposition or growth prospects. We've also walked away from transactions where valuation expectations are not fully adjusted to the current market or macroeconomic realities. As Tim said, we are smart capital allocators, and we will always prioritize the strategic acquisitions that drive the highest returns for FiscalNote shareholders. We have proven our ability to make, integrate, and accelerate growth from acquisitions.\n\nM&A is a building block of FiscalNote's long-term growth strategy. Our pipeline is robust, and we will not push to make acquisitions simply to meet a target number. FiscalNote is currently progressing conversations with several attractive acquisition targets that meet our disciplined criteria. I look forward to providing an update on total run-rate revenue, inclusive of acquisitions, in our year-end results.\n\nIn the meantime, despite the macro environment, our ARR remains strong. Our net retention rates remain stable, and we're driving strong sustainable GAAP revenue growth year over year. This underscores the resilience of our business model and the critical nature of the services we provide to our customers. Most importantly, we are on target to our primary goal to achieve adjusted EBITDA profitability in the near term.\n\nIn sum, we are excited by the path in front of us today. We remain confident in our overall compelling growth trajectory. We are executing on our strategy to build a sustainable, profitable growth business that provides mission-critical solutions for the world's most important decision-makers. Moving forward, we will continue to capitalize on our strong position to drive compounding, profitable growth.\n\nAnd we look forward to working with you, our shareholders, as we build an enduring market leader of the future. With that, we will now open the call up to questions. Operator?\n\nOperator\n\n[Operator instructions] And your first question comes from the line of Matt VanVliet from BTIG. Your line is open.\n\nMatt VanVliet -- BTIG -- Analyst\n\nYeah. Good morning. Thanks for taking the question. I guess, first, would love to maybe dig in a little deeper on what you're seeing from some of the macro issues out there.\n\nYou know, I think you mentioned enterprise is maybe a little more impacted. But maybe just dive in, in any particular regions or size of companies, industry verticals that you're seeing continued strength in and, conversely, any you might call out that, you know, might be a little weaker through the end of the year that you're starting to work more aggressively on.\n\nTim Hwang -- Founder and Chief Executive Officer\n\nYeah. Thanks for the question. So, as I mentioned before, the best way to think about our customer base is this portfolio of customers between private sector and public sector customers. So, one of the things that we're looking at right now is, you know, on the public sector side, if there's any potential changes or whatnot to that particular customer segment.\n\nAnd as you mentioned before, we have not seen any particular changes there. That's largely due to the fact that, on the public sector side, you see a number of customers that are just really in line with congressional preparation cycles or public sectors, RFP processes, and the like. That segment of our business continues to chug along as we've seen in the past. On the enterprise side, you know, that is really where we see some of the potential macroeconomic impacts.\n\nAnd it's really not a particular sector, particular industry, and particular geography. It's fairly broad-based. And I think a lot of that just has to do with the fact that, you know, particularly, as I mentioned before, in September of this year, there's just a lot of noise that people are kind of seeing in the market, whether it was around inflation or labor changes or, you know, kind of changes around the interest rate environment and whatnot. And so, my -- our supposition was effectively that, you know, many of these companies were sitting there trying to make assessments around their P&L through the end of the year and that -- effectively elongated cycles.\n\nThat being said, I mean, we did, of course, book a number of new customers. And one of the biggest indicators, of course, is whether or not, you know, renewals continue to come in, you know, month over month or quarter over quarter. And that has continued to stay fairly stable. And that, obviously, kind of gives us a lot of confidence in terms of our business strategy moving forward.\n\nMatt VanVliet -- BTIG -- Analyst\n\nAnd then, on that front from a sales capacity side of things, you know, I guess, where do you feel like -- if things are slowing, even to a small extent, and seeing your targets for the end of the year, you know, where do you feel like you're at from a sales capacity side and an overall execution side, both into the end of the year and maybe in early '23 plans? You know, is there a lot of hiring that still needs to be done? Or is it a matter of kind of getting the deals that are in the pipeline books with the team you have in place? Thanks.\n\nJosh Resnick -- President and Chief Operating Officer\n\nSure. Hi, this is Josh Resnick, president and COO. I can address that. We actually feel pretty comfortable from a sales capacity standpoint.\n\nWe've invested in building out our sales teams over the course of the year and feel that we're well positioned to capture business, both from a new logo perspective and a renewal perspective, as we head into the new year.\n\nMatt VanVliet -- BTIG -- Analyst\n\nAll right. Good. Thank you.\n\nOperator\n\nYour next question comes from the line of Mike Latimore from Northland Capital Markets. Your line is open.\n\nMike Latimore -- Northland Securities -- Analyst\n\nGreat. Thank you. Yeah. Great to see the EBITDA reiteration here.\n\nI guess as I look to the fourth quarter, I think your EBITDA guidance implies a fourth quarter EBITDA improvement by a few million dollars. Can you just talk a little bit about the levers there to get to that goal?\n\nJon Slabaugh -- Chief Financial Officer\n\nSure, Mike. Thanks for the question. It's Jon. And in terms of the leverage, first of all, we have a great deal of visibility into the GAAP revenue recognized.\n\nSo, we know our pacing to the end of the year. And we've taken all the measures necessary from an operating standpoint to look at the expenses that we're in control of and make sure that they're in line with that level of revenue. So, it's -- we have a fair amount of visibility into it and feel confident in reiterating that number.\n\nMike Latimore -- Northland Securities -- Analyst\n\nYeah. And then, in terms of --\n\nJon Slabaugh -- Chief Financial Officer\n\nI'm sorry. Go ahead.\n\nMike Latimore -- Northland Securities -- Analyst\n\nYeah. So, basically just sort of blocking and tackling on the opex side of things, it sounds like?\n\nJon Slabaugh -- Chief Financial Officer\n\nThat's right.\n\nMike Latimore -- Northland Securities -- Analyst\n\nOK. And then in terms of the acquisition targets, can you talk a little bit about your valuation expectations, what you've been seeing? Do things loosen up next year, do you think?\n\nTim Hwang -- Founder and Chief Executive Officer\n\nWell, so, I can get started, and I'll past it over to Jon here. So, one of the things that we've been seeing, obviously, from an M&A perspective is that many, many companies have become more actionable in the past couple of months. That's due to a number of different factors. The first is primarily because, you know, in many portions of the capital markets, capital is effectively frozen up.\n\nAnd so, there's obviously a limited number of options for a number of companies as they kind of reviewed different strategic options and the like. On top of that, of course, we've seen changes in valuation expectations. And so, what we've seen previously is that maybe, you know, in the height of '21, there -- in our opinion, unrealistic expectations with respect to valuations. And so, those valuations have all come down, particularly in line with private and public capital markets.\n\nWe, of course, you know, in the grand scheme of things, are really trying to pick through, you know, all these different companies that are in the market right now and trying to figure out which ones align with our operating strategy, which ones we can effectively kind of combine with our cross-sell and upsell strategies, and which ones will kind of accretively add toward our P&L. So, that is something that we continue to do every single day. We are in market right now with several companies that we are pursuing on a pretty aggressive basis. And, hopefully, we'll be able to kind of provide some incremental news for everybody in the short term here.\n\nMike Latimore -- Northland Securities -- Analyst\n\nOK. Great. And then, I guess just last, any use cases that you see sort of where demand is intensifying or slowing early?\n\nJosh Resnick -- President and Chief Operating Officer\n\nHey. So, this is Josh. I can address that. Generally speaking, Tim touched upon in his remarks, we're actually seeing a significant need around companies who need to track regulation globally, so as they face, you know, issues that are existential for their business.\n\nAnd then, beyond that, around identifying and assessing needs related to changes in their business, whether it's seeking out incremental revenue opportunities that might be associated with government contracting opportunities, you know, as they're looking for every new opportunity in this environment, or even as they're looking to dial back operations in certain areas and wanting to understand the potential regulatory risks that they might have associated with that, or even understanding some of the economic forecasting associated with that. So, the use cases, one of -- in the private -- sorry, the use cases in the private sector tend to be pretty broad. And then, as Tim touched upon earlier, on the public sector side, it tends to be fairly steady around needs that are kind of generally consistent across the board in government.\n\nTim Hwang -- Founder and Chief Executive Officer\n\nOne of the things I mentioned in my remarks, of course, is that we effectively are thinking a lot about these \"trigger events.\" These trigger events are effectively areas where there's some political action that happens, and then there's an onslaught of, you know, demand or requirements by customers. And so, you can probably imagine a number of these trigger events being, you know, things like new proposed legislation in Congress, or a monumental Supreme Court opinion that changes regulatory environments, new trade, you know, kind of, you know, agreements, or whatever the case may be. And so, these trigger events are something that we watch out for quite aggressively. And I think we've talked about this in our last earnings call that, you know, the teams internally are very, very attuned to try to identify what those trigger events might be and effectively going after them, you know, using marketing campaigns or sales collaterals to try and really solve those problems for our customers on a day-to-day basis.\n\nMike Latimore -- Northland Securities -- Analyst\n\nOK. Great. Yeah. Thank you.\n\nOperator\n\nYour next question comes from the line of Rudy Kessinger from D.A. Davidson. Your line is open.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nHey, guys. Thanks for taking my questions. As I look at the revenue guidance, I mean, I know you hadn't previously given a GAAP revenue guide. But based on the non-GAAP revenue projection of 127 million and the run-rate and the deferred revenue adjustment, I mean, it seems like the prior guide is probably sitting around 123 or 124.\n\nThat's where the Street was sitting. So, you're taking it down by, you know, 11 million with just a quarter to go. And you guys reported pretty late on August 15th. And so, what changed in the macro? And how quickly did it change? And in hindsight, did you underestimate the macro impact at that point in time when you reported Q2 and gave the guide? And secondly, just with the magnitude as we take down the revenue guidance, where were your Q3 bookings relative to plan?\n\nTim Hwang -- Founder and Chief Executive Officer\n\nWell, so, I think I mentioned this, you know, in a portion of my remarks here that, you know, a lot of what we were looking at was, in 2022, the uncertainty that really popped up in September of this year or the like. And so, as we were looking at, you know, going into 2022, we were fairly confident that we were going to kind of hit the run-rate revenue guidance. We took that to account when we were providing those estimates. It really wasn't until September that we began to see these impacts from a new logo sales perspective.\n\nSo, you know, I think I mentioned this before, but these decision-makers are effectively starting to adjust their budgets on a pretty aggressive basis. And these sales cycles we saw were effectively elongating pretty dramatically and, you know, effectively something that we just had not anticipated. So, I do want to reiterate again, though, that, you know, in many of our kind of segments, particularly in the ones we just announced this morning, we do see continued ARR growth. We do continue to see our net retention continue to stay fairly steady.\n\nAnd so, it wasn't like there was any major change in the demand for our products or the need for our products. It was just when you're looking at the new bookings of our customer base, those sales cycles are effectively elongating. And so, it's hard to predict in that type of environment, you know, whether our sales -- the sales cycle will be four months or six months or nine months. I mean, that's why we're being a little bit more conservative when it comes to taking the December 31st point in time and what we expect our run-rate revenue to be at that point.\n\nJon Slabaugh -- Chief Financial Officer\n\nAnd, Rudy, to the second part of your question with regards to the GAAP versus where we expect it to be, we are, at the end of the third quarter, between $7 million and $8 million behind our original projections on run-rate revenue. And we were also kind of seeing -- taking adjustment against Q4 just to be conservative going forward. But we are seeing momentum now rebuilding the sales pipeline as well. But that's why we took the run-rate revenue estimate down.\n\nAnd as a result, as you can imagine, the flow through the GAAP revenue corresponds.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nYeah. OK. I guess -- and again, there's several different ways you could look at it. I guess one way, you know, the consensus -- and again, kind of your prior projections, we're looking for GAAP revenue go from about 27 million in Q2 to 38 million in Q4.\n\nSo, about 11 million growth. And now, you're effectively targeting, you know, just 3.5-ish million growth at the midpoint of the guide. So, again, that's substantial of a takedown of the guide. To what extent -- you know, if you look at it between the macro and just sales execution, irrespective of the macro, to what extent maybe poor sales execution outside of the macro impact results in the quarter in the updated guidance?\n\nJon Slabaugh -- Chief Financial Officer\n\nFirst of all, just to clarify one thing, this is the first time we initiated through GAAP revenue guidance. There is GAAP revenue that was kind of built on consensus as a result of looking at our run-rate revenue. I don't think that there's sales execution issue to really speak to. I think that -- and, Josh, you can weigh in, but the new logo acquisition is really the source of the shortfall.\n\nIs there anything you want to add there?\n\nJosh Resnick -- President and Chief Operating Officer\n\nNo, that's right, Jon. I mean, what we've seen has been exactly what we said, where it's a macro issue that is not specific to any particular individual or team. We have -- and as Jon was just saying a few minutes ago, we're actually seeing some of that thaw in the pipeline now. And so, while we're being conservative in the forecast, we do feel like we're seeing some promising trends.\n\nOperator\n\nAnd your next question comes from the line of Ben Piggott from EF Hutton. Your line is open.\n\nBen Piggott -- EF Hutton -- Analyst\n\nHey, guys. Appreciate you taking the question. Just on the concept of sales cycles elongating a little bit, any thoughts on using price as a tool to close as you go to year-end? Or do you really kind of holding the line on the line pricing dynamics of the product?\n\nJosh Resnick -- President and Chief Operating Officer\n\nSure. I can address that. I mean, you know, we're obviously thinking about all the opportunities we have in front of us in the ways that we can promote our products. You know, as Tim said, the way we think about even events on the political landscape that might trigger buying opportunities for our clients.\n\nSo, we're really looking at all the opportunities we have in front of us to maximize revenue in the fourth quarter and beyond. We actually think that, you know, our products are of substantial value to our clients. And we've actually seen actually some overall success in regards to our contract values and our pricing. And so, we haven't felt the need to discount -- don't want to, you know, of course, discount the value with them as well.\n\nBut we are thinking expansively about what we need to do in order to drive revenue, both in the near term and long term.\n\nBen Piggott -- EF Hutton -- Analyst\n\nGreat. Thank you.\n\nTim Hwang -- Founder and Chief Executive Officer\n\nI also want to mention that our entire growth strategy, you know, is really predicated on this ability to drive those cross-sells and upsells. And there is a fairly strong correlation between the level of commitment that our customer is going to give to our products and the ability for them to kind of continue to stay with us in the long term. And so, you know, as we think about, you know, bolt-on M&A strategies, new product innovations, and new growth, you know, we have seen, you know, continued increases in our average contract price Josh mentioned. And that's, of course, you know, bundled with our increasing or stable net retention rates.\n\nYou know, we are -- we just want to really drive the value of our products even on this macro environment. So, it is a lever, but it's not one that we're using right now.\n\nBen Piggott -- EF Hutton -- Analyst\n\nGreat. Thanks, guys.\n\nOperator\n\nAnd there are no further questions at this time. Mr. Tim Hwang, I'll turn the call back over to you for some final closing comments.\n\nTim Hwang -- Founder and Chief Executive Officer\n\nAll right. Well, appreciate everybody jumping on the call here. As you mentioned, we are very committed to building a long-term growth compounding business. It's something that we're very excited about and will continue to do in the future.\n\nSo, appreciate everybody jumping on the call. And if you have any further questions, feel free to reach out to Sara Buda or Jon Slabaugh on our team. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSara Buda -- Vice President, Investor Relations\n\nTim Hwang -- Founder and Chief Executive Officer\n\nJon Slabaugh -- Chief Financial Officer\n\nMatt VanVliet -- BTIG -- Analyst\n\nJosh Resnick -- President and Chief Operating Officer\n\nMike Latimore -- Northland Securities -- Analyst\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nBen Piggott -- EF Hutton -- Analyst\n\nMore NOTE analysis\n\nAll earnings call transcripts"
}