{
  "companyName": "Akoya Biosciences, Inc.",
  "companyTicker": "AKYA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/akoya-biosciences-inc-akya-q2-2022-earnings-call-t/",
  "content": "Akoya Biosciences, Inc. (AKYA 0.74%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the Akoya Biosciences second quarter 2022 earnings conference call. At this time, all participants are in listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator instructions] And now I'd like to introduce your host for today's program, Priyam Shah, head of investor relations.\n\nPlease go ahead.\n\nPriyam Shah -- Head of Investor Relations\n\nThank you, operator, and thank you to everyone who is joining us today on this call. I'm Priyam Shah, head of investor relations at Akoya Biosciences. On the call today, we have Brian McKelligon, chief executive officer; and Joe Driscoll, chief financial officer. Earlier today, Akoya released financial results for the second quarter ended June 30, 2022.\n\nA copy of the press release is available on the company's website. Before we begin, I'd like to remind you that management will make statements during this call that include forward-looking statements within the meaning of federal securities laws, which are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Any statements contained in this call that relate to expectations or predictions of future events, results, or performance are forward-looking statements. Actual results may differ materially from those expressed or implied in the forward-looking statements due to a variety of factors.\n\nFor a list and description of the risks and uncertainties associated with Akoya's business, please refer to the Risk Factors section of our Form 10-K filed with the Securities and Exchange Commission on March 15, 2022. We urge you to consider these factors and you should be aware that these statements should be considered estimates only and are not a guarantee of future performance. This conference call contains time-sensitive information and is accurate only as of the live broadcast today, August 8, 2022. Akoya disclaims any intention or obligation, except as required by law, to update or revise any financial projections or forward-looking statements, whether because of new information, future events, or otherwise.\n\nLastly, Akoya will be participating in the UBS Genomics 2.0 and the Canaccord Growth Conference this week, and we hope to see many of you in person, either in Dana Point or Boston. And with that, I'll turn the call over to Brian.\n\nBrian McKelligon -- Chief Executive Officer\n\nThank you, Priyam, and good afternoon to everyone, and thank you for joining us today. Akoya had a very strong first half of 2022 and the second quarter was highlighted by the continuation of the successful commercial launch of our new PhenoCycler-Fusion System. We reported record revenue of $17.9 million, representing a 37% growth compared to the second quarter of 2021. We achieved success globally across multiple categories with record revenue and products and services.\n\nWe sold a total of 60 instruments in the second quarter, consisting of 16 and 44 PhenoImagers, representing a 94% growth in placements from the prior-year period. And we ended the quarter with an installed base of over 800 instruments. This large installed base is a confirmation of our strong success to date. In addition, the rapidly accelerating publications featuring Akoya's platform, now over 600 to date, nearly doubling from a year ago, is a key indicator that this trend will continue.\n\nOur second quarter was further highlighted first with the announcement of our groundbreaking spatial companion diagnostic partnership with Acrivon Therapeutics; and second, AGBT, we were the first spatial biology company to demonstrate true multi-omic capabilities, measuring both RNA and protein at high plex on the same slide. These two milestones and our strong Q2 performance clearly demonstrate that as a company solely focused on spatial biology, our diversified portfolio is seeing strong adoption and delivering meaningful value discovery, translational, and now clinical markets. At the core, the speed and robustness of Akoya's industry-leading optics and cycling technologies are enabling whole slide single-cell spatial phenotyping to become the go-to method for unbiased tissue analysis. We are addressing key discovery and clinical questions in areas such as immunology, oncology, neurobiology, infectious disease, transplant medicine, and more.\n\nOur continued and growing success in the downstream translational and clinical markets is a byproduct of the expanded utilization of digital pathology and spatially based biomarker strategies in oncology and the unique capabilities of our PhenoImager HT workflow to meet these requirements. As I noted earlier, we recently announced an exclusive partnership with Acrivon Therapeutics to co-develop a first-of-its-kind spatial signature companion diagnostic called the OncoSignature test. The OncoSignature Companion Diagnostic will be used to identify cancer patients, most likely to respond to Acrivon's developmental agent, ACR-368, the targeted DNA damage response inhibitor entering phase 2 patient selection trials for platinum-resistant ovarian, endometrial, and bladder cancers. The OncoSignature test will leverage the spatial phenotyping capabilities of the PhenoImager HT to localize and quantify the expression of clinically relevant protein biomarkers that signal response to Acrivon's drug.\n\nOnce approved, OncoSignature will enable physicians to identify potential responders to ACR-368 prior to prescribing the drug. Together, Akoya and Acrivon will advance the OncoSignature test through development to commercialization. This partnership provides our other biopharma partners the confidence and evidence that Akoya has the internal expertise and capabilities to deliver on the necessary diligence and audits, development and validation work, and commercialization to deliver on a companion diagnostic program. Our advanced biopharma solutions CLIA lab at Marlborough has become a valued resource for our biopharmaceutical partners resulting in a meaningful expansion of our pipeline and programs with industry-leading oncology companies.\n\nSince formally launching ABS and achieving this CLIA certification last year, we have scaled that organization to meet this growing demand and are optimistic for its continued and expanding contribution to our success in the translational and clinical markets. Now, moving on to the discovery side of our portfolio. In addition to delivering on our commercial milestones, our focus in Q2 was to demonstrate our progress in expanding the capabilities of the PhenoCycler-Fusion to deliver ultra-high multiplexing in both RNA and protein applications with industry-leading speed and data quality. At AGBT in June, Akoya showcased the new data from the PhenoCycler-Fusion, where we demonstrated our new RNA chemistry in both a 100 plex RNA panel and a greater than 100 plex RNA and protein panel on the same tissue.\n\nThis first-of-its-kind multi-omic data set on the same tissue sample at single-cell resolution highlights two unique and powerful capabilities of our system. First, our PhenoCycler precisely and rapidly delivers to the reagents to and from a microscope slide in C2. And second, the proprietary optics of the Fusion deliver high-resolution imagery at speed. This AGBT data demonstration set follow a similar data showcased at AACR in April.\n\nWe demonstrated the ability of the PhenoCycler-Fusion to robustly run a 100 plex protein spatial phenotyping panel. The ability to perform whole slide spatial transcriptomics and proteomics with scale and speed at single-cell resolution on the same tissue sample represents a major step forward in this field. Throughout this year and next, we will migrate our 100 plex and multi-omic capabilities from demonstration, early access to commercialization. And we are also on track to deliver additional advancements to our product portfolio, providing our customers with ongoing improvements to the industry's most robust spatial phenotyping solution.\n\nThese include the following: later this year and throughout -- and through our partnership with Bio-Techne, we will launch the automation of the RNAscope chemistry on the PhenoCycler-Fusion System. As many of you know, RNAscope is the industry's most widely adopted solution for spatial RNA with over 4,500 publications and thousands of customers. We anticipate RNAscope will be used primarily for targeted applications and validation studies in the lower plex range and will also provide Akoya with access to a new and motivated customer base. And in parallel to enabling RNAscope, we will deliver to our new and existing customers and upgrade to their PhenoCycler-Fusion System that will double its throughput.\n\nThis capacity increase is part of our ongoing effort to simplify and accelerate our workflow. For example, we included with the Fusion at launch earlier this year, a proprietary 30x file compression algorithm, that converts our terabytes of image data into a gigabyte file, enabling real-time data analysis versus a serial very data-intensive process. This solves a major data storage and management expense for Akoya and our customers, the opportunity to focus on downstream interpretation. And at the end of this year, we will also launch our universal chemistry.\n\nThis novel assay is a hybrid between our PhenoCycler and our HT chemistries. When launched, it will enable rapid panel design and automation for high-volume translational studies and is ideal for validating biomarkers discovered using our high plex workflow. It will also leverage Akoya's antibodies and content, and both of these benefits will drive further pull-through on our PhenoImagers. So, let me now summarize our aggregate workflow and application advancements on the PhenoCycler-Fusion to provide a clear understanding of the platform's full capabilities.\n\nSo, we're -- first, we are further advancing our leadership position in speed with the Fusion upgrade later this year that doubles throughput. Second, we will deliver high plex multi-omic solutions that work on a single tissue, enabling more discovery power person. Finally, we will launch RNAscope in our new universal chemistry to enable our customers to rapidly validate the biomarkers discovered on the PhenoCycler-Fusion. It's worth reiterating a key point of competitive differentiation for Akoya here that is of great benefit to our customers.\n\nThis validation work can happen on the instrument that they already have with Fusion, not a separate box requiring a second capital purchase. That is they perform discovery studies with high plex multi-omics on the PhenoCycler-Fusion and then validate using the Fusion as a stand-alone. This is one solution for both discovery and validation. So, to summarize our updates for the first half of 2022, we're pleased with our strong financial and commercial performance as we continue to expand our leadership position in the spatial biology market, diversify our revenue and broaden our global reach.\n\nWe remain focused on the following targeted initiatives for the balance of the year: first, drive the continued adoption of the PhenoCycler-Fusion as the best-in-class in C2 imaging platform for the spatial discovery market; second, drive further workflow and speed improvements, as well as launch additional protein panels, RNA capabilities, and our new universal chemistry. Lastly, continue to partner with leading biopharma, medical centers, CROs, and other industry leaders to drive the adoption of the PhenoImager HT and the translational clinical markets and to deliver on our Acrivon Companion Diagnostic partnership. And with that, I will now turn the call over to Joe to discuss our financial results. Joe?\n\nJoe Driscoll -- Chief Financial Officer\n\nThanks, Brian. Hello, everyone. As Brian highlighted, total revenue for the second quarter of 2022 was $17.9 million as compared to $13.1 million in the second quarter of 2021, representing 37% growth. Year-to-date revenue of $34.8 million represents 38% growth over the prior-year period.\n\nProduct revenue, which includes instruments, reagents, and software was $14.2 million for the second quarter, compared to $10.7 million in the prior-year period, representing 33% growth. Within product revenue, instrument revenue was $9.5 million, compared to $6.3 million in the prior-year period, representing 51% growth. We had another strong quarter with 60 total instruments sold, of which 16 were PhenoCyclers and 44 were from the PhenoImager portfolio. The total installed base of instruments is now 808 as of June 30, which includes 212 and 596 PhenoImagers.\n\nWe are pleased to announce that as of June 30, a total of 62 Fusion instruments have already been shipped since the commercial launch of the Fusion, and we now have a total installed base of 55 for the combined PhenoCycler-Fusion System sold either as a combined system or upgraded from a previous stand-alone PhenoCycler instrument. The number of combined units is an important metric because this combination is projected to drive significant increases in reagent pull-through. We continue to track a very impressive fusion to PhenoCycler attach rate while maintaining our current estimates of 50% to 60% attach rate longer term. Reagent revenue was $4.5 million for the quarter versus $4.3 million in the prior-year period.\n\nRecall that in Q2 of 2021, there was a significant improvement in customer activity as Covid shutdowns started to pull back, and we saw a very sharp increase in our consumables revenue at this time last year as researchers return to labs. In addition, our second-quarter reagent revenue this year was somewhat muted by the COVID-related lab shutdowns in China, particularly in April and May. With an annualized pull-through in the mid-$30,000 range per instrument for both the PhenoCycler and the PhenoImager HT, we project two to three times that amount as the potential pull-through of the combined PhenoCycler-Fusion System, given that the increased speed and higher plex will, in turn, increase utilization. We strongly believe that the future of the Fusion instrument lies in pairing it with the PhenoCycler to really drive the focus from largely discovery to now creating a one-stop shop for discovery and validation.\n\nWe expect that the rollout of our higher plex multi-omic and universal chemistry solutions throughout 2022 and 2023 will drive further meaningful growth in pull-through and share of wallet across the entire portfolio from the PhenoCycler-Fusion to the PhenoImager HT. We continue to project that annual reagent revenue growth will be 40-plus percent per year for the next several years. Services and other revenue totaled $3.7 million as compared to $2.4 million in the prior-year period, representing 54% growth. Our advanced biopharma solutions CLIA Lab continues to gain significant traction directed to large pharma.\n\nGross profit was $10.3 million in the second quarter, compared to $8.1 million in the prior-year period. This resulted in a gross profit margin of 58%. The promotional pricing to drive early adoption of the Fusion had a slight impact on Q1 and Q2 gross margins along with investments we made in the CLIA service lab to support clinical trial enrollment and enable additional clinical diagnostic partnerships such as Acrivon. Operating expenses for the quarter totaled $26.7 million as compared to $25.7 million in Q1 of 2022.\n\nThrough the remainder of 2022, we will continue to make targeted investments in the company with a near-term focus on the commercial launch of the PhenoCycler-Fusion and R&D efforts to further enhance our speed, multi-omic menu content, and lab service capabilities. We ended the quarter with approximately $88 million of cash and cash equivalents. We project that cash will be in excess of $70 million as of the end of fiscal 2022, which provides ample runway to continue to invest in the business. Common shares outstanding are $37.8 million as of June 30 and fully diluted shares, including the impact of outstanding options and warrants, totals $40.3 million.\n\nTo summarize, we had another record-breaking quarter with $17.9 million in revenue. We sold 60 instruments in Q2 across the product portfolio and the sales in the first six months of the Fusion launch have exceeded our expectations. We remain very confident in our ability to deliver strong growth this year and are increasing our full-year 2022 preliminary revenue guidance range to $71 million to $74 million as we continue to see tailwinds for our business and the spatial biology market. Now, I'll turn it back over to Brian for closing remarks.\n\nBrian McKelligon -- Chief Executive Officer\n\nWell, thank you, Joe. And in summary, we're pleased to report a strong quarter and announce exciting new developments as we track the launch of the PhenoCycler-Fusion, expand our menu offerings, and build on our first-mover advantage in the clinic. We're thankful for the hard work of our fellow dedicated equines, as well as for the support of our customers and shareholders. Akoya remains well positioned for growth, and we're excited about the opportunities that lie ahead as we deliver new spatial solutions from the discovery to the clinical markets.\n\nAnd at this point, we will open the call for questions. Operator?\n\nOperator\n\nCertainly. [Operator instructions] And our first question comes from the line of Tejas Savant from Morgan Stanley. Your question, please.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nHi. This is Neil on for Tejas. Congrats on the quarter and the strong instrument placements. To start, I just wanted to dig in on the competitive landscape.\n\nSo, firstly, your peers have noted some significant challenges in China as a result of the lockdowns. And given your approximate 70% exposure to the region, could you speak to some of the trends you're seeing today? And what's baked into your guide in terms of recovery there?\n\nBrian McKelligon -- Chief Executive Officer\n\nYeah. Maybe what Joe can -- this is Brian. Thank you for the question, Neil. I think maybe what Joe can clarify is really the extent of our exposure because while there was some impact, our overall exposure to China isn't huge.\n\nSo, maybe, Joe, you want to speak more quantitatively to our -- the China impact for us in Q2.\n\nJoe Driscoll -- Chief Financial Officer\n\nSure. So, total APAC revenue is about 25% of our total revenue. Out of that, China, it's going to be 70% of that number. So, it's going to be about 16%, 17% of our total revenue.\n\nSo, in Q2, what we saw is that instrument sales were very solid. No real issues there. We did have a slowdown in reagent revenue primarily April and May because they did have lab shutdowns. But it didn't -- we have such great balance in our revenue streams that we're able to cover that shortfall with other areas.\n\nSo, overall, it was a little bit of a blip, but we were able to manage through it pretty successfully.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGot it. And following up on the competitive landscape. Some peers are going through some major commercial reorgs or reassessments of costs with some also noting an unexpected mix shift toward spatial imagers, particularly following the excitement generated from AGBT. Are you seeing any similar trends? And what's driving the more resilient nature of your business versus peers?\n\nBrian McKelligon -- Chief Executive Officer\n\nWell, I mean, let's talk about the last one. And I mean, I think I won't comment on our peers. I think what's unique about Akoya is that we really are single focused on spatial, Part 1. And Part 2, spatial imagers is spatial biology, right? Those are all of the products that are either coming or those are ours that are not.\n\nSo, that's the direction of the entire market segment. Earlier on, there was other methodologies to do spatial biology using additional instruments as a readout. And I think that migration is something that is recognized across the market. But I think for us, part of our strength is our entire portfolio has been image-based from the beginning.\n\nAnd the reason why that is necessary. It is useful and of most power to the customers is because it is the imaging approach that gives you single-cell whole slide across the entire tissue. So, the movement to an image-based approach, I think, is a recognition that to get the most value out of your dollar and out of your science and out of your study across these precious tissue samples is you've got to maximize your real estate. That is looking at every single slide across the whole tissue and imaging is the way to do that.\n\nAnd I think what's been instrumental in our success is that we really have the most powerful imaging technology on the market that initially came through that Phenoptics acquisition that is in the HT and it is in the Fusion. So, that gives us not just speed to capture these images, but equally important, is high-quality images that give that single-cell whole slide data, not just at speed, but also at high quality. That's kind of what we're seeing kind of in our universe and the market dynamics where we're seeing success.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGreat. Thank you for the color. So, turning to your pipeline, you have a number of launches coming up to build upon the breadth of your multi-omics capabilities. How should we think about the Universal chemistry and the early access launch for 100 plex, serving as a jumping-off point helps set the stage for your 1,000 plex launch next year?\n\nBrian McKelligon -- Chief Executive Officer\n\nYeah. I think those are -- maybe just to clarify, just as we think about our product launches, the value of the universal chemistry is really in validation going from validating biomarkers on the protein side to then scaling those up for high-volume, high-throughput assay. And so, the value that this universal chemistry brings to customers is that not only simplifies automation, it speeds up panel design, but it also gives them opportunity to choose from a suite of already proven antibodies that we have in our current PhenoCycler portfolio because it is a combinatorial approach. So, universal chemistry really is about us accelerating panel design and the panel validation on the Fusion stand-alone on HT as a follow and on to the discovery work you do in high plex.\n\nSo, that's the value to the customers, the value to us, it really drives pull-through because we're getting antibody and detection reagents and we're hopefully driving increased utilization as that universal chemistry gets to launch becomes more prominent. So, that's the value of the universal chemistry. And on the RNA side, just to clarify, the RNAscope, we're tying that to the Fusion 2.0 launch that I kind of referenced on the call. So, we have kind of one full upgrade.\n\nThat's when the RNAscope partnership is going to be rolled out. And then the 100 plex will start working with customers to give them visibility into that -- into our spatial transcriptomics approach, a higher plex approach so that when we hit the market in 2023, we've got a rich set of customers that are ready poised, ready to run. But what we'll also have is a really large installed base of PhenoCycler Fusions already up and running, ready to catch that product and really catalyze utilization with quick speed out of the gate.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nAppreciate the clarification there. And one last one for me on the active partnership. Could you provide more details on the scope of that agreement? Should we be expecting any major milestones? And should this be viewed as a template for more of such partnerships in the future?\n\nBrian McKelligon -- Chief Executive Officer\n\nYes, it's a great question. You know, thank you for asking that. In reverse order, it absolutely is a template. And I think it's a template in two regards.\n\nIn terms of the nature of the agreement, it really is a classic companion diagnostic agreement with milestones throughout and up to commercialization. So, not going to really get into the specifics of the dollars of timing, but that it is a template in that regard. But it's also a template that Akoya has now qualified and established in being able to prove our capabilities with our platform, with our quality systems, with our regulatory expertise, our supply chain and manufacturing our personnel, etc., that we now have a template that we can give other partners the confidence and belief that we can deliver on companion diagnostic partnerships. So, it's sort of a template, I think, in two regards, Neil.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nGot it. Thank you for the timing and on the strong quarter.\n\nOperator\n\nThank you. And our next question comes from the line of Julia Qin from JPMorgan. Your question, please.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nHi. Congrats on the quarter. This is Amy on for Julia. Thank you for taking the question.\n\nSo, my first question is about the universal chemistry and the high plex RNA transcriptomic platform. So, I'm just curious, like could you share with us any like initial insights from customer feedback? And like what would be the portal ramp-up look like for both the universal chemistry and the high plex RNA? Is it going to be like the same scale as the current consumables? Or it's going to be faster? I'm just curious, you know, especially the data after the HBT.\n\nBrian McKelligon -- Chief Executive Officer\n\nYeah. Thank you. It's a great question, Amy. On the universal chemistry, I think you should think of that as a migration from the prior chemistry to the new chemistry for existing customers and then for new customers of the HT, where they will likely start.\n\nSo, in terms of the universal chemistry's pull-through impact on the HT system, it's going to be a gradual but meaningful process. And we've not given any specific guidance and quantified the impact of it. But as I alluded to in Neil's questions, I think in describing the qualitative benefit to the customers, we think it's going to be received very well. And on the high plex RNA side, one of the reasons why we look at -- we've talked about on prior calls and that Joe alluded to, one of the reasons why we look at the attractiveness of the PhenoCycler-Fusion pull-through isn't just because we're scaling up the speed, we're scaling up the protein plexing, but also that we're going multi-omics, we'll be layering in our own RNA reagents.\n\nSo, it really is the aggregate of those increases in speed, layering in protein, layering in RNA and multi-omics, and delivering kind of high-quality images at speed. That's why we're talking about over time, the two to 3x pull-through on the PhenoCycler-Fusion relative to the PhenoCycler with a third-party microscope. So, again, I don't mean to dodge the question, Amy, but we've not called out and quantified the high plex RNA pull-through explicitly yet. Also in part, Amy, because we're doing a lot of voice to customers to really understand what they want, first and foremost, from our platform.\n\nWe suspect it's really multi-omic same slide, both RNA and protein. So, they no longer choose between analytes. That's all there on the same slide rather than different slides, one for RNA and one for protein. But we're also trying to understand what plex levels that they desire, is it the 1,000? Is it 100? So, there's a lot of additional work that we're doing as we advance the technology on final product configuration.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nOK. Thank you very much. And just my last question is on the cash. I appreciate you guys really prudent with the cash while expanding the pipeline development.\n\nI'm just curious, like, could you give me like an update on the cash burn for this year and the years forward?\n\nBrian McKelligon -- Chief Executive Officer\n\nYeah. Thanks for the question. Joe, do you want to maybe speak to that?\n\nJoe Driscoll -- Chief Financial Officer\n\nSure. So, we have $88 million of cash as of the end of Q2. That's really more than two years of cash. So, that gives us plenty of runway to continue to invest in the business.\n\nWe don't need to do anything right away in terms of a fundraise, but we are going to continue to be opportunistic and look at opportunities to raise a small amount in the market if conditions are favorable over the next 12 to 15 months. But we're confident where we are right now with our cash position. And as I said, we're going to continue to look at opportunities to boost that a little bit.\n\nBrian McKelligon -- Chief Executive Officer\n\nYeah. And I think, Amy, the other thing to look at is we continue to see strong growth in the business just under 40%. And we're going to continue to respond to our performance and the business and the market conditions. So, if we continue to outperform and show these improvements in our top line and show margin improvement, it's going to continue to dramatically reduce and mitigate any additional needs for financing.\n\nAnd that's kind of how we have been tracking. So, hopefully, that helps Amy.\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nYes, that's very helpful. I really appreciate it.\n\nOperator\n\nThank you. And our next question comes from the line of Kyle Mikson from Canaccord Genuity. Your question, please.\n\nKyle Mikson -- Canaccord Genuity -- Analyst\n\nHey, guys, thanks for taking the questions. And apologies if anything has already been asked but I touch on. Can you just talk about the traction of the interest among the genomics labs like the core, etc., that you're seeing today, how that's evolved in the recent quarters?\n\nBrian McKelligon -- Chief Executive Officer\n\nWell, it's a great question, Kyle. And I'm going to take some liberties to pull back a little bit and say there's no dialog in the marketplace around products that sometimes unless you're kind of living in the forest in the weeds like we are, maybe you don't see the forest. So, sometimes, I think there's a conflation of future products versus current products. So, right now, we are marching toward delivering a multi-omic solution.\n\nBut right now, our product today is still focused on high plex protein. And so, the genomics customers that have interest in us have an explicit interest to layer in single-cell whole slide, high plex protein. Now, there's going to be some early movers that recognize that we're going into the genomic space here in short order. So, there's going to be some early movers.\n\nBut overwhelmingly, our existing customer base are cores and customers that understand high plex protein, that understand flow, that are interested in cell, not, for example, like you might see with some of our other peer companies, not really focused on genomics customer base. That said, that's going to change pretty rapidly as soon as we come out with products that do target that genomic segment. So, we'll be actively participating in existing projects with those customers.\n\nKyle Mikson -- Canaccord Genuity -- Analyst\n\nOK. Thanks, Brian. And then just kind of jumping on with all this buzz from AGBT. It sounds like there's quite a bit of interest in single-cell and sub-cell spatial.\n\nAny sense, perhaps, explain what that is? And where does look the demand mix kind of shake out between profiling platforms for discovery and then the imagers that are more simple for blood translational work? How do you think that kind of shakes that over time, Brian?\n\nBrian McKelligon -- Chief Executive Officer\n\nHow do we think the market shakes out in terms of the needs for discovery versus translational customers, imager, nonimager? I just want to make sure I'm addressing your question.\n\nKyle Mikson -- Canaccord Genuity -- Analyst\n\nThere seems to be like a lot of interest in demand for the subcellular kind of in the test right now, which is mainly -- you can think of that as being translational validation. So, I just broke it up that way, but mainly, it's around single cell, subcell demand toward that. Is that going to even out when you guys lay off? Any kind of --\n\nBrian McKelligon -- Chief Executive Officer\n\nYou can correct me if I'm not hitting your question. I would say that spatial biology is imaging period. That's my opinion. That the future of spatial biology is going to be an imaging-based readout.\n\nThe difference between what a discovery customer wants versus what a translational customer wants, I think simply put really has to do with scale of plex versus scale of sample. So, your discovery customer really wants to maximize every single sample with a project that's going to be 10, 30, 40 samples, something like that. Your translational customer is really now validating those discoveries on a smaller subset of markers and marching those further downstream. So, that's kind of how we look at it.\n\nSo, there's going to be an existing population of customers that may want to do readouts on other methodologies like a sequencing-based readout, but I think that's a small minority in the future, maybe 10% of spatial on the discovery side. But I think the real difference to reiterate between a discovery and a translational customer has to do with scale of throughput and desires around level of plex. So, we think the discovery customers want really high plex, multi-omic same slide and then the ability to validate those. That's why we designed the PhenoCycler-Fusion to be able to do that discovery and validation on the same system.\n\nAnd then the same chemistry, the same imaging methodologies, the same universal chemistry, you can take those validated marker sets and move those to the HT system for much higher throughput, latter-stage translational studies to clinical. So, that's our approach is to try to own that continuum from discovery all the way through clinical and have nonoverlapping products, so they stay on our portfolio as they move from one stage to the next.\n\nKyle Mikson -- Canaccord Genuity -- Analyst\n\nOK. And are you seeing like a market shift from now at all? And we're hearing that from others?\n\nBrian McKelligon -- Chief Executive Officer\n\nWell, you know, I'd say that that's the neighborhood we've only lived in, Kyle. We've always only been imaging-based. And I think what you're going to see is that that's going to be the growing market requirement that people recognize, I think as -- I think as Neil was asking, as people recognize that to get real high powerful spatial data, imaging is the way to do that. And that's the only way we've done it from the beginning.\n\nWe're just continuing to improve on that.\n\nKyle Mikson -- Canaccord Genuity -- Analyst\n\nOK. Perfect. Just thinking about the near-term outlook. So, the guidance was increased.\n\nCould you guys talk about what that kind of bakes in for the acceleration of Fusion placements to make that assumes of a deceleration?\n\nBrian McKelligon -- Chief Executive Officer\n\nIt doesn't assume a deceleration. I think from an instrument sense, I mean, it's following what you would expect from us based on first half and how we kind of seasonally move to the second half.\n\nJoe Driscoll -- Chief Financial Officer\n\nNo. There's no deceleration in our Fusion forecast. We're trying to maintain a very conservative posture in our guidance. We want to make sure we beat and exceed every single quarter.\n\nSo, I wouldn't read into it too much other than we're trying to be very conservative and make sure we hit our numbers every quarter.\n\nKyle Mikson -- Canaccord Genuity -- Analyst\n\nOK. And then, Joe, just the last one from me. So, pull-through looks like that was a little bit softer in the second quarter, if I'm doing the math right. I know -- I'm sure there's a bunch of reasons why that would have been.\n\nBut were there any other factors at play besides the placement strength and then probably more new users as well? Because you still have this guidance about 40% growth over the long term. So, I mean, obviously, still the core sort of strong underlying strength in [Inaudible]. Just curious we have in this quarter.\n\nJoe Driscoll -- Chief Financial Officer\n\nYeah. Very specifically, it was the China issue. So, that impacted our reagent revenue in Q2. That far and away was the biggest issue in Q2.\n\nApril and May were very light in terms of China reagent revenue, and you know, we're expecting that to recover as the year moves along.\n\nBrian McKelligon -- Chief Executive Officer\n\nAnd, Kyle, aggregate -- excuse me, for the first half in aggregate, our reagent revenue growth is 40%. And so, I think we'll maintain that through second half.\n\nKyle Mikson -- Canaccord Genuity -- Analyst\n\nOK. Thanks, guys. Appreciate it.\n\nOperator\n\nThank you. [Operator instructions] One moment for our next question. And our next question comes from the line of Mark Massaro from BTIG. Your question, please.\n\nMark Massaro -- BTIG -- Analyst\n\nHey, Brian and Joe, thanks for the questions. Congrats on the beat and raise. I guess you guys have a pretty diversified suite of customers ranging across core labs and academic medical centers, biopharma companies, CROs and now selling into genomics customers. So, I guess, like in light of some macroeconomic concerns and potential budget constraints at any of these end users.\n\nCan you just maybe touch on what you're seeing? Obviously, you raised the guidance. So, I have to imagine that you carried over the beat a little bit, but maybe on the second half, how do you see budgets and macro potentially impacting your business?\n\nBrian McKelligon -- Chief Executive Officer\n\nWell, I would just say -- thanks for the question, Mark. I would say per Joe's prior comment, while we -- as you noted, while we've got a really diversified portfolio that hits across multiple market segments, instruments, reagent software services, that gives us lots of opportunities for growth, and we're hitting across all of those. And so, that buffers exposure. Our products are really not overlapping.\n\nSo, we don't -- with this diversified portfolio across multiple market segments, we don't see really any cannibalization. So, to the extent there's budgetary impact, I think we've got a lot of ways to respond. If capital purchases, for example, look constrained, we've got a really robust service business. And so, that affords us some buffer to any macro changes.\n\nBut also, as was noted earlier, there's a growing recognition that an imager-based approach is really what the market wants. And as I noted earlier, that's kind of the address we've been sitting in. And I think that's helping keep us really in a highly competitive position. And we're maintaining a conservative posture for second half just to make sure we protect to get some of these macro things.\n\nSo, there's multiple ways to the tool, and that's kind of how we're approaching it kind of in a very thoughtful manner. Hopefully, that makes sense, Mark.\n\nMark Massaro -- BTIG -- Analyst\n\nYes, it does. Maybe one more two-part question. You know, as you're planning to roll out the PhenoCycler from 50 to 100 plex, what's left remaining to do in order to ensure a successful launch? And then the second part is, is there any update on the work with PathAI, and anything we can sort of look forward to, you know, over the coming quarters?\n\nBrian McKelligon -- Chief Executive Officer\n\nYes. On the PathAI front, I mean, those -- part of that stuff is confidential, but we've got really a great interactive partnership with them in terms of coactivity. A lot of great benefit kind of viewed by the customers because it's kind of -- it's a really clean hand-off, Mark, because we've got this high-volume, high-quality CLIA-based service lab, generating real high-value data. And that's exactly where they can pick it up from there and leverage their graft neuro networks in their army of pathologists to really extract meeting.\n\nSo, a really clean hand-off, nothing yet that I think we can speak to externally. And to your question around the rollout from the 50 to 100, it's actually already happening. It's a gradual walk where customers prior could do 40, 50 plex. Now they're enabled to do a 60, 70, 80 plex.\n\nSo, those sorts of capabilities are kind of rolling out gradually Mark, and it's not a single-step function. I think the release of the capacity increase and the speed increase that we talked about for the end of the year is going to further motivate our customers to even go to move into that higher plex because they'll be able to get kind of more samples per unit time or more markers per unit time.\n\nMark Massaro -- BTIG -- Analyst\n\nSounds good. Thanks so much for the questions.\n\nBrian McKelligon -- Chief Executive Officer\n\nThanks, Mark.\n\nOperator\n\nThank you. Our next question comes from the line of David Westenberg from Piper Sandler. Your question, please.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nThanks. Well, I'll start with the consumables. And then sorry, I know everyone's hitting on this. It was a great quarter, great placements.\n\nBut I guess, generally speaking, everything is good and then one little count that's not -- you didn't hit our numbers and of course, we'd pick on that. So, can you care to quantify maybe what China would have done in the quarter? Just trying to get a magnitude of like quantitatively what that might have done.\n\nBrian McKelligon -- Chief Executive Officer\n\nI mean, I'll let Joe answer that. I think there's two things to look at in terms of -- there's the number and then there's the growth percentage. So, let me take the latter one first, and Joe can speak to how much granularity we want to get into the actual number, David. But if you just look at last year, that first half was wild, right? Everything was still shut down in Q1.\n\nSo, that's a relatively low comp. And what we saw in the first couple of months of Q2 was just this massive surge of orders. I sort of bent up Covid demand that sort of now started to level out as you got to the rest of Q2 and second half. So, there's a bit of a hyper comp as you look at Q2.\n\nBut in terms of the raw numbers, Joe, do you want to speak to that, the level of granularity we're comfortable?\n\nJoe Driscoll -- Chief Financial Officer\n\nYeah. So, you know, the April and May reductions in China have cost us -- if you look at what we did in Q1 in China versus what we did in Q2 is probably 500, 600 of consumables revenue that we went down in China in Q2. So, that's the numeric impact. And as Brian said, you know, last year's Q2 reagent number was very high.\n\nAnd you know it's very high because it actually came down in Q3 last year. It went from $4.3 million to $3.4 million. So, Q2 of last year was really kind of a very, very big number. So, those are a few factors at play here.\n\nBrian McKelligon -- Chief Executive Officer\n\nAnd, David -- as we noted with Kyle, David, as we get into second half, we are projecting to continue 40% growth year over year. Just to clarify.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nGot it. Yeah. And then I guess the other -- you kind of answered it with Mark too on kind of what we're looking at in the second half in macro, but I think a lot of your peers, and I guess I'm just kind of reiterating the question, maybe asking it differently. I have really been talking about the slowdown in Europe.\n\nIt definitely seems like, in your guidance, you're not seeing that same kind of thing. Is there something specific with maybe your portfolio that makes you more than -- or maybe, I should say, less susceptible to some of those slowdowns in Europe because it doesn't really seem to have as much rhyme and reason? It just seems like blanket every instrument companies have, you know, struggled there.\n\nBrian McKelligon -- Chief Executive Officer\n\nWell, I think -- I'll just kind of reiterate what we said to Mark. We've got a portfolio of instruments that are really purpose-built. We've got an HT that's really purpose-built for that late translational clinical customer, clinical research customer. And we have the PhenoCycler that is really ideally designed for that early discovery customer.\n\nAnd then we have the Fusion as an instrument that really helps bridge that gap. And as you look at the instrument portfolio, they're really stand-alone in terms of the market segments that they serve. So, if I walk into the door to see you, I can talk to you about what is your interest. Are you doing early discovery studies? Do you have something you want to validate.\n\nAnd I can point you to a portfolio. And so, I've got a high probability of success. I think that, I think, coupled to, I think, the recognition that single cell whole-slide high-quality images at speed, the spatial market has matured to where those are a given. And I think we're thankful that that's been our message from the beginning.\n\nAnd as we start layering in RNA and multi-omics and people seeing where we're going, I think the existing capabilities and what we're doing in the future, I think, are giving our customers a lot of hope that purchasing the PhenoCycler-Fusion as an example, is a powerful box today that's also future-proof that we're going into multi-omics. We'll continue to invest in speed. We'll continue to invest in panels. So, I think our customers have a lot of confidence that will continue to execute, so we better.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nGot it. Sorry, I was on mute. Got it. No, that's helpful.\n\nAnd then maybe can you mention some of the currency stuff in the Quarter 2. And then both in the quarter and then also for anticipation in the second half of the year because you did -- again, you reiterated guidance, it's a good thing, but I just want to kind of quantify some of the stuff that's happening.\n\nBrian McKelligon -- Chief Executive Officer\n\nYeah. Joe, you got that.\n\nJoe Driscoll -- Chief Financial Officer\n\nYeah. The vast majority of our business is in U.S. dollars. So, all the North America business, APAC, as well as a good chunk of Europe.\n\nSo, it's a very, very minor impact, and it's all baked into the guidance that we've given. So, as we sit here today, not a huge impact from that.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nGot it. And then maybe I'll just ask one more on the Fusion. Good ramp. How should we think about the launch kind of cadence in terms of a yearly impact? I mean, is this kind of a product that's going to accelerate? I mean, do you see this product as kind of, you know, as we're doing our 2023, 2024? Is it a lowest-hanging fruit kind of thing? Any color there would be helpful.\n\nAnd you know, I'm taking a lot of your time, so I'll stop that for now.\n\nBrian McKelligon -- Chief Executive Officer\n\nWell, I think it's going to continue to grow, David, it's going to continue to grow on two fronts. It's going to be really the central pillar of a single purchase, where you can -- as I noted in my opening comments, where you can discover with the PhenoCycler and the Fusion in a multi-omic fashion or protein-only or an RNA-only, you can do discovery and then you can use the fusion as a stand-alone to validate. So, really, it's a two-on-one. So, it's going to continue to scale in terms of our sales of the box.\n\nBut equally important with our investments across the reagent portfolio that we outlined, it's going to continue to scale and pull through. And that's what's going to help drive further diversification of our revenue, smoothing out of that -- the seasonality and driving equally important margins and cash. That's kind of how we think about the PhenoCycler-Fusion really as an apex of our growth in discovery and translational markets.\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nGot it. Thank you, guys. \n\nBrian McKelligon -- Chief Executive Officer\n\nThanks, David.\n\nOperator\n\nThank you. This does conclude the question-and-answer session of today's program. I'd like to hand the program back to Brian McKelligon for any further remarks.\n\nBrian McKelligon -- Chief Executive Officer\n\nWell, nothing further. I just -- all I would say is just kind of as noted in the closing comments during our opening statements, I just want to thank all of you for your time, thank our fellow clients, our shareholders, Neil, Amy, Kyle, Mark, David, for your time. Really thank you all for your time and your support, and we look forward to following up with all of you. So, have a great rest of your day and evening, following up to all of you.\n\nSo, have a great rest of your day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPriyam Shah -- Head of Investor Relations\n\nBrian McKelligon -- Chief Executive Officer\n\nJoe Driscoll -- Chief Financial Officer\n\nUnknown speaker -- Morgan Stanley -- Analyst\n\nKyle Mikson -- Canaccord Genuity -- Analyst\n\nMark Massaro -- BTIG -- Analyst\n\nDavid Westenberg -- Piper Sandler -- Analyst\n\nMore AKYA analysis\n\nAll earnings call transcripts"
}