{
  "companyName": "The Bank of Nova Scotia",
  "companyTicker": "BNS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/the-bank-of-nova-scotia-bns-q3-2022-earnings-call/",
  "content": "The Bank of Nova Scotia (BNS -0.47%)\nQ3 2022 Earnings Call\nAug 23, 2022, 8:00 a.m. ET\n\nJohn McCartney\n\nGood morning, and welcome to Scotiabank's 2022 third quarter results presentation. My name is John McCartney, and I'm head of investor relations here at Scotiabank. Presenting to you this morning are Brian Porter, Scotiabank's president and chief executive officer; Raj Viswanathan, our chief financial officer; and Phil Thomas, our chief risk officer. Following our comments, we'll be glad to take your questions.\n\nAlso present to take questions are the following Scotiabank executives: Dan Rees from Canadian banking; Glen Gowland from global wealth management; Nacho Deschamps from international banking; and Jake Lawrence from global banking and markets. Before we start, on behalf of those speaking today, I'll refer you to Slide 2 of our presentation, which contains Scotiabank's caution regarding forward-looking statements. And with that, I will now turn the call over to Brian.\n\nBrian Porter -- President and Chief Executive Officer\n\nThank you, John, and good morning, everyone. This morning, Scotiabank announced third quarter earnings of $2.6 billion or $2.10 per share, representing a 4% year-over-year increase. Strong personal, commercial and corporate banking activity resulted in another quarter of solid earnings in a period where market sensitive business were challenged globally. The bank's trading revenues within GBM and GBM LatAm were down over $250 million year over year and $150 million quarter over quarter due to lower client activity.\n\nAsset growth of 13% year over year and strong credit quality, combined with prudent expense management, positions the bank well for continued earnings growth. The macroeconomic backdrop of our key geographies remains positive as economies begin to stabilize from a unique confluence of circumstances. In Canada, we see the strength of the labor market as an important counterbalance to the impact of inflation and consumer contents. In the Pacific Alliance countries, growth is moderating somewhat from the rapid post-pandemic GDP recovery experienced over the last year.\n\nCentral banks in the region have acted quickly and decisively to date to control inflation. Our credit outlook remains favorable, a result of our high-quality, highly secured portfolio. Delinquencies and write-offs have continued to trend positively, which in absolute terms are lower than our pre-pandemic experience. We are closely monitoring customer balance sheets and spending behavior for early signs of stress and the impact of recent inflationary pressure on the daily cost of living.\n\nDespite our current experience and confidence in the strength of our portfolio, we have made conservative adjustments to reflect the possibility of future economic outcomes, resulting in higher PCLs in the international retail division this quarter. Average customer deposit balances remained significantly above pre-pandemic levels with observable additions and term products in response to rate increases. But by strong employment, overall consumer spending in Canada also showed strength in the quarter, up nearly 20% with year-over-year increases in discretionary categories. Plus the obvious impact of higher gasoline and grocery prices.\n\nLower market valuations and a slowdown in the financing transactions in public equity and fixed income markets, and impacted our market-sensitive GBM and wealth business results. Our personal and commercial businesses, however, both domestically and in our international banking division, have delivered strong volume growth in line with our risk appetite. Canadian banking delivered strong earnings growth of 12% year over year. Residential mortgage activity held a robust level through the quarter.\n\nOur efforts to grow and sectorally diversify our commercial banking businesses resulted in a very strong contribution once again this quarter, and we saw a continued recovery in card and auto balances. Importantly, strategies implemented to improve deposit momentum resulted in our deposit growth matching our Canadian banking loan growth in the quarter, both up 3% from Q2. During the quarter, we were very pleased to announce a significant expansion of the existing scene loyalty offering, adding the ability to earn and redeem points on more categories covering everyday spend, including grocery and pharmacy. The evolution from an entertainment loyalty offering to an expanded lifestyle platform is clear as we welcome the Empire brands, including Sobey's, and Safeway to the Scene+ partnership.\n\nWe believe the scene program will be an important driver for the bank in terms of customer acquisition. The Atlantic Canada rollout kicked off just last week, added 150,000 new Scene members during the rollout. The rollout will continue in stages across the country in the coming months. International banking also delivered strong earnings growth, up 30% on the back of solid loan and revenue growth while managing through higher interest rates and inflation.\n\nOur Caribbean business is recovering strongly now and reflecting a more normalized level of contribution. global wealth management results showed good stability and earnings resilience, down a modest 3% year over year, considering that equity and debt markets experienced double-digit declines. Thoughtful expense control, market share gains and growth in our private banking and advisory channels, including international wealth, helped mitigate the impact of lower fixed income and equity markets. We continue to build on our capabilities with the goal of delivering comprehensive wealth advice and solutions through our strong and trusted brands: ScotiaMcLeod, MD Financial Management and Jarislowsky Fraser.\n\nThe integration of our private banking professionals into these relationship channels has been a significant growth driver for our business. Global banking markets saw a strong loan growth of 9% in the quarter. Robust business lending activity was offset by an extremely quiet period for capital markets issuance, and and challenging markets for trading. Average deposit growth was strong in the quarter, driven by new client acquisitions.\n\nAnd last week, we announced the launch of Scotia TranXact our digital payments platform for business banking clients, which we expect to further bolster our continued deposit strength. We continue to invest significantly in both technology and people. Despite high expense pressures, each of our Canadian banking, international banking and global wealth businesses continued to generate positive operating leverage. Our common equity Tier 1 capital ratio ended the quarter at 11.4% as we deployed capital primarily to support organic loan growth while continuing to return capital to our shareholders.\n\nWe view our current capital levels as prudent and appropriate given the current environment. The bank continues to be recognized as a global leader in the markets we operate. At the recent 2022 Euro Money Awards for Excellence, Scotiabank was named the Best Canada as well as North America's Best Bank for Sustainability Finance and Best Investment Bank in Chile. We also continue to invest at the grassroots level in the communities where we live and work.\n\nWe released the inaugurable ScotiaRISE impact report, highlighting the first year's results detailing 200 community partnerships and $26 million in community investments globally. Recent commitments include programs to help newcomer Canadian use stay in school and $100 million in support of Black-led small businesses here in Canada. Overall, we are pleased with our Q3 results and believe the bank is very well positioned from a risk management perspective and continue to execute on long-term oriented growth strategies regardless of volatility in markets. in a more variable near-term economic outlook.\n\nAnd with that, I'll turn the call over to Raj for a detailed financial review.\n\nRaj Viswanathan -- Chief Financial Officer\n\nThank you, Brian, and good morning, everyone. Before I begin, I'd like to note that all my comments on the bank and business line results are on an adjusted basis. I'll review the performance for the quarter, starting on Slide 5. The bank reported another strong quarterly earnings of $2.6 billion and diluted earnings per share of $2.10, an increase in EPS of 4% year over year.\n\nReturn on equity was 15.4% this quarter. While all-bank pre-tax pre-provision earnings decreased 1% year over year, the pre-tax pre-provision earnings for the four business lines in aggregate increased 3%. Revenues were up 1% year over year as an increase in net interest income of 11% more than offset a decline in noninterest revenue of 12% primarily relating to trading and advisory revenues being lower. The increase in net interest income was driven by strong loan growth across all business lines.\n\nThe net interest margin declined a modest 1-basis-point quarter over quarter. Interest expense increased during the quarter driven by a couple of key factors. With Central Banks decreasing rates quite rapidly, we are seeing liabilities reprice largely in line with these rising interest rates. Secondly, customers are choosing to move deposits toward higher paying term deposits.\n\nThe combination of these two factors offset by the benefits from interest rate risk management initiatives has resulted in the modest margin compression during the quarter. We expect the pace of asset repricing to pick up in future quarters. non-interest income declined $417 million or 12%. Fee and commission income fell 3% in spite of an 8% growth in banking revenues as wealth management revenues declined 3% and underwriting and advisory fees was down $100 million or 49%.\n\nTrading revenues were down $167 million or 35% in both GBM and GBM LatAm driven by volatile markets and low client activity. The PCL ratio was 22 basis points for the quarter, up 9 basis points from the last quarter. Year-over-year adjusted expenses increased modestly by 2%, driven by higher personnel costs and share-based compensation and advertising and technology-related spend to support business growth. The productivity ratio was 53.4% this quarter, while our year-to-date operating leverage was a negative 0.9%.\n\nOn Slide 6, we provide an evolution of our common equity Tier 1 ratio over the quarter as well as support us change in risk-weighted assets. The bank reported a common equity Tier 1 ratio of 11.4%, down 20 basis points from 11.6% last quarter, primarily from strong earnings that was offset by organic growth and the impact of share repurchases. This represents approximately $4 billion of excess capital over the 10.5% level. Strong return on capital generation of 28 basis points was entirely offset by growth in organic risk-weighted assets.\n\nDuring Q3, the bank repurchased approximately five million shares, deploying 9 basis points of capital. The bank has deployed capital in line with our strategy to grow the bank organically being opportunistic on inorganic opportunities while returning capital to shareholders during 2022. Year-to-date, the bank has deployed all the internal capital generated of approximately 90 basis points to grow RWA organically that will support future capital generation. In addition, the bank used 62 basis points of excess capital to repurchase approximately 31 million shares year to date.\n\nOur priority remains to deploy capital to support organic growth initiatives in each business line, while prudently managing capital in the face of a less certain economic outlook. Turning now to the business line results, beginning on Slide 7. Canadian banking reported earnings of $1.2 billion, up 12% year over year. Pretax pre-provision earnings also grew 13% year over year driven by strong revenue growth of 12%.\n\nNet interest income increased 16% following several quarters of volume growth and recent margin expansion. Residential mortgages grew 14% while business loans grew 23% compared to last year. We would note that the anticipated slowdown in mortgage growth is reflected in the quarter-over-quarter increase, which moderated to 2%. Deposit growth during the quarter was also healthy at 4% year over year.\n\nNet interest margin expanded by 7 basis points quarter over quarter to 2.29%, benefiting from higher deposit spreads and the impact of the Bank of Canada rate increases. The portfolio mix remains skewed toward secured retail lending and commercial loans, thus partially offsetting the NIM expansion. non-interest income was in line with last quarter, but declined modestly by 1% as the prior year had elevated earnings attributable to private equity and income from associates, though partially offset by higher banking revenues, insurance fees and foreign exchange fees. Expenses increased 9% year over year driven by higher technology, advertising and personnel costs to support business growth.\n\nThe segment generated positive operating leverage for the seventh consecutive quarter and achieved year-to-date operating leverage of 2.4%. The PCL ratio was 9 basis points, an increase of 2 basis points compared to the prior year. Turning now to global wealth management on Slide 8. Earnings of $383 million declined a modest 3% year over year impacted by equity and bond markets that are down significantly more.\n\nRevenue declined 2% due primarily to lower fee income driven by lower assets under management and trading volumes partially offset by higher interest income from strong private banking volume growth and margin expansion. Expenses declined 2% as lower volume-related expenses, primarily compensation, were partly offset by higher costs to support business initiatives. The productivity ratio this quarter was 59.9%, improving 30 basis points from last year. This division has generated positive operating leverage in 10 of the last 11 quarters, and the year-to-date operating leverage was positive 0.3% despite revenue headwinds.\n\nThe assets under management decreased 6% to $320 billion, while assets under administration decreased $1 billion to $581 billion, primarily due to market depreciation. This quarter saw strong growth across several wealth business lines in Canada and international despite the impact of market quality on assets under management, reflecting the benefits of diversified business model. On a pre-tax pay provision basis, Canadian Wealth earnings were essentially in line with the prior year, excluding the impact of high trade, our retail trading platform that saw volume moderation. International Wealth continued to grow with pre-tax pre-provision earnings up 5% year over year.\n\nNow referring to Slide 9. Global banking and markets generated earnings of $378 million, down 26% compared to the prior year. The results were driven by solid business banking performance as loans grew 22% and deposits grew 9% with improving margins, mainly in the United States, in line with our growth strategy there. Client acquisition and engagement are positive and the loan and M&A pipelines remain strong.\n\nRevenue declined 8% due entirely to lower capital market activities both advisory and trading. Capital markets revenue was down this quarter with fixed-income revenues down 34% and equities down 25% year over year. Although models considering the fixed income and equity issuances in the Canadian market were down 70% and 80%, respectively. Net interest income increased 12%.\n\nAverage loans and acceptances increased $9 billion or 9% quarter over quarter and $20 billion or 22% year over year. Sequential loan growth accelerated this quarter in Canada and the U.S., while average deposit balances increased 4% quarter over quarter and 9% year over year. Non-interest income decreased by $143 million or 16% compared to the prior year, driven by reductions in underwriting and advisory due to lack of customer activity. and slightly lower trading revenues.\n\nExpenses were flat quarter over quarter as the business manage expense growth to respond to lower capital markets revenue. Expenses were up 6% year over year due mainly to technology costs to support business development, partly offset by lower personnel costs. Continued PCL recoveries reflect the high credit quality of the lending book. GBM LatAm, which is reported as part of international banking, reported earnings of $192 million, the second highest quarter, up 5% year over year as business banking earnings more than offset a weaker capital markets performance.\n\nThis business has continued to deliver good growth, despite the challenging market conditions we referenced earlier, driven by our focused banking activities to large corporate clients in the pacific alliance. Slide 10 shows the international banking results. My comments that follow are on an adjusted and constant dollar basis. International banking reported another solid quarter with net income of $631 million up 30% year over year.\n\nThe segment's net earnings continued to grow in line with the economic recovery and has steadily delivered improving results for eight consecutive quarters. Pretax pre-provision earnings grew 7% year over year, with a strong recovery in the Caribbean and Central America that grew 31%, which more than offset a 4% decline in the Pacific Alliance. Year-over-year loans grew 13% with commercial loans up 14% and mortgages up 16%, while personal loans and credit cards also grew 7%. Revenue was up 3% year over year by higher net interest income, which was partially offset by lower non-interest income.\n\nQuarter over quarter, net interest margin declined a modest 1-basis-point to 385 basis points. Recall the net interest margin expanded 17 basis points in the first two quarters of 2022 in this segment. The slight net interest margin compression was a result of higher cost of funds driven by a steep increase in total bank rates, movement of deposits from coal to term and deposit fee pricing faster than assets. Although noninterest revenue was down $106 million, fee and commission revenue was up 9%.\n\nThe remaining decline was due to lower trading income mainly in Peru and Chile, lower insurance revenue and higher investment gains last year. The provision for credit loss ratio declined year over year by 16 basis points to 84 basis points. Non-interest expenses were flat compared with the prior year despite high inflation of around 10% in the Pacific Alliance countries and increases related to business growth, which were mostly offset by benefits from accelerated digital progress and efficiency initiatives. This segment has generated positive operating leverage of two and a half percent year to date.\n\nOn Slide 11, I'd like to briefly highlight the aggregate performance of the four business lines. Despite challenges in market-facing businesses, total revenues and pre-tax free provisions for the four business lines together grew 3% while year-to-date operating leverage was positive 1%. These metrics, once again, speak to the resilience and diversified earnings potential of our key operating segments. Now turning to the other segment.\n\nWe reported a modest adjusted net loss of $52 million compared to a loss of $10 million in the prior quarter and $7 million in the prior year. year over year, the change was a result of lower contribution from asset liability management activities and significantly lower investment gain that was offset by lower taxes and lower non-interest expenses. With that, I'll now turn the call over to Phil to discuss loans.\n\nPhil Thomas -- Chief Risk Officer\n\nThank you, Raj. Good morning, everyone. As Brian highlighted, the macroeconomic outlook has evolved since last quarter. Despite higher inflation, additional interest rate hikes and moderating GDP forecast, the credit quality of our portfolio remains strong.\n\nThe following factors give us confidence across our footprint. First, the strong health of our customers and a favorable business mix continues to deliver low delinquency rates, low impaired formations and improved write-off trends. Deposit levels remain high and we are seeing our customers exhibit prudent financial management. Secondly, loan originations across all portfolios continue to be at high quality.\n\nThirdly, corporate credit is a positive differentiator with no material bridge book exposures or watch list accounts. And finally, despite these trends, we are thoughtful about the less favorable macroeconomic forecast. The increase in our PCL ratio this quarter is primarily driven by expectations of longer-lasting inflationary pressure and more central bank rate increases. Our ACL coverage reflects this outlook.\n\nWith this backdrop, I will highlight a few points on what we are seeing across our portfolios. In our Canadian portfolio, performance remains favorable compared to pre-pandemic levels. delinquency of 90-plus days for retail was 15 basis points or roughly half of the pre-pandemic ratio. Customer deposits, on average, are 14% higher than they were two and a half years ago.\n\nAnd while consumer spending remains high, the payment trends show improvement. Our Canadian uninsured mortgage portfolio remained strong with LTVs of 46% and an average FICO score of 800. While we continue to see some preference toward variable rate mortgages, we note that 97% of our variable rate mortgage customers are above prime and have FICO scores of approximately 800. These customers also have solid balance sheets with approximately 40% higher balances in their deposit accounts compared to fixed rate customers.\n\nSupporting these strong consumer metrics is a tight labor market, with unemployment remains at all-time lows of 4.9%. In our commercial portfolio, our growth is the result of a targeted high credit quality strategy. We are focused on sectors with favorable industry fundamentals such as commercial real estate, agriculture and automotive. The bank's commercial real estate portfolio remains solid, made up of residential projects with Tier 1 developers who have strong balance sheets and industrial properties where demand continues to exceed supply.\n\nMoving on to international banking retail. Our credit quality is better positioned than it was prepandemic. Our portfolio is now 72% secured versus 65% pre-pandemic, driven by mortgage growth of 15% year over year in international banking. Origination quality continues to improve.\n\nOur focus on high credit quality rated customers remains and has increased to 96% for originations versus 80% pre-pandemic. Portfolio delinquency of 90-plus days decreased 88 basis points versus pre-pandemic as a result of prudent credit practices. Now turning to PCL on Page 15 and 16. PCLs this quarter were $412 million or 22 basis points.\n\nThe increase in last quarter was primarily driven by higher performing PCLs, up $210 million, due to loan growth and a less favorable macroeconomic outlook. Impaired PCL were $389 million this quarter, down $406 million from last quarter and remain at historical lows. We continue to see low levels of delinquency in both Canadian and international banking. Our current allowances for credit loss this quarter were $5.3 billion or an ACL of 72 basis points.\n\nNonperforming clan stable, in line with historically low yield formations and net write-offs. Total ACL coverage represents about 12 quarters of net write-offs, almost double our pre-pandemic levels. In summer, our customers continue to exhibit strong financial health. On a product-by-product basis, the ACL ratio is higher for most retail products relative to prepandemic levels, reflecting current environment.\n\nOur lower all-bank PCL ratio of 72 basis points versus pre-pandemic was driven by our change in business mix in favor of secured products offset by additional weighting to downside risk related to a less favorable macroeconomic forecast. Lastly, despite the current macroeconomic headline concerns, we remain confident in the quality of our repositioned portfolio and prudent credit practices. With that, I will turn the call back to Brian for closing remarks.\n\nBrian Porter -- President and Chief Executive Officer\n\nThank you, Phil. Despite the heightened volatility in recent months and the resulting impact on our market-facing businesses, the bank remains on track to deliver a strong overall performance in fiscal 2022. As such, our commitments to deliver earnings growth, return on equity and prudent expense management while maintaining a strong balance sheet, remain intact. We have taken appropriate action to ensure we are conservatively provisioned in light of a less certain economic outlook.\n\nWe will continue to closely monitor changes as they impact our businesses and the financial health of our customers. Greater than 95% of our double-digit loan growth this year to date represents exposure to very high-quality investment-grade corporate and commercial customers for secured retail borrowers. The typical indicators of softening demand or data suggests business confidence in the real economy is trending lower, is just not present. Any project or investment deferrals we've seen from our corporate and commercial customers have been driven by prudence related to uncertain completion costs or labor availability rather than demand side concerns.\n\nThe portfolio repositioning we have undertaken in recent years by customer profile and geography as the bank set to capitalize on attractive higher-growth markets and product segments consistent with our organizationwide risk framework. In summary, we are pleased with the operating performance of the bank this quarter. We are encouraged by the resilience and growth potential of the markets where we operate. We expect our P&C businesses in Canada and international to grow earnings through high-quality secured loan growth that will continue to support stable loan loss provisions.\n\nWe are pleased by the expansion of the Scene loyalty program this quarter and the potential that presents in terms of customer acquisition and supporting our growth. We are very pleased with the resilient performance of the wealth management businesses in the face of double-digit contraction in equity and fixed income markets this quarter. We are well positioned to capture the money that is in motion with our diversified product offering. We expect the GBM business to bounce back in Q4.\n\nAnd Origination businesses are rebounding and loan deposit and M&A pipelines remain strong. We remain highly confident that the diversification of our business model, prudent risk management and focusing on meeting the needs of our customers, especially through challenging times, will yield strong long-term results for all our key stakeholders.\n\nJohn McCartney\n\nThank you, Brian. We will now be pleased to take your questions. Please limit yourself to one question and then rejoin the queue to allow everyone the opportunity to participate in the call. Operator, can we have the first question on the phone, please?\n\nOperator\n\nThank you. The first question is from Ebrahim Poonawala from Bank of America. Please go ahead.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGood morning. I guess, maybe the first -- I'll do one question. If you could spend some time on the margin outlook, Raj? One, just talk to us in terms of expectations for consolidated NIM, NII, understanding your hedging program that's been ongoing. And secondly, if you could, both in Canadian and international banking, where do you see the margin going over the next few quarters? And for international, do we see -- do we need Central Banks to stop rate hikes before we see the margin expansion in international IB? Just give us a sense of the trajectory of the margin in international.\n\nWhat could be the end state for that segment in terms of the margin. Thank you.\n\nRaj Viswanathan -- Chief Financial Officer\n\nSure. Thanks, Ebrahim. Good morning, and thanks for the question. Let me just address the modest margin compression of one basis points we saw this quarter at the all bank level, and then I'll get to the two business lines you referenced.\n\nI'll point out a few reasons. The rapid increase in administered rates was offered in deposit repricing faster and a move to term deposits, which I referenced in my prepared remarks, both in Canada as well as in the Pacific Alliance countries. Significant increase, as you know, is across all the best clients countries. Brian referenced a 300 basis points in Columbia, for example.\n\nThis also results in an increased cost of funds, both deposits and term funding from the wholesale markets. What we've seen is stronger-than-anticipated growth in lower-margin products to corporate, commercial mortgages, that's also impacted what I would call the asset market. And then asset repricing is ongoing, that's obviously not kept pace with the changes in deposit rate pricing. So that's kind of the explanation for the one basis point.\n\nBut looking forward, we expect asset repricing to continue. That should improve the margin in future quarters. I'm talking about all banks now. and a modest margin compression, frankly, the result of the hedging that you referenced, the benefits that we have at the all bank level.\n\nAnd as you know, we typically hedge the US and CAD, and not necessarily the Pacific Alliance interest rates, because you don't have the ability to hedge. But specifically for the two business lines you referenced, Canadian margin, you saw expanding. A lot of it came from the deposit side. asset margins are lower, as you would expect in this rising rate environment in the medium term or in the short term, I should say, and start repricing through the medium term, and then we should start seeing asset margin expand in the Canadian bank.\n\nThe same thing applies to international banking. It's only slightly different in that the rapid rate of increases have been exponentially high say, compared to Canada. So you're seeing a bigger impact in the international banking margin. But I go back to the same thing in my prepared remarks there, Ebrahim.\n\nThat margin quickly rebounded from 369 to 386 until last quarter of 17 basis points. That's the impact we see and the modest margin progression of one basis point is for the same reasons that I quoted, which applies to the all banks, deposits are moving faster, conversion of what we would call co-deposit, short-term deposits happening pretty quickly in some of the countries in the Pacific Alliance. We should see margin expansion happening through the international banking business line as well. I'm not going to say in Q4 is going to start expanding.\n\nI think Q4 will remain maybe likely stable. But looking forward into 2023, and we'll speak more in detail in November, we would expect that we should see an expansion in the international banking space as well.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGot it. That was helpful. And just -- I'm sorry if I missed it. Did you talk about what you expect in terms of just consolidated all bank NIM for the fourth quarter? How much of expansion you expect near term?\n\nRaj Viswanathan -- Chief Financial Officer\n\nYeah, I think it should be fairly stable, Ebrahim, because I think the international banking being stable. Cost of funds are not coming down fairly quickly as we all know, as Central Banks are trying to deal with inflation effects. I think the Canadian margin will, I would say, modestly expand as deposits margin contributed a little bit more. So I'd say it's likely expected to be in line with what you saw this quarter, maybe a basis point of 2, one way or the other.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGot it. I'll requeue. Thank you.\n\nRaj Viswanathan -- Chief Financial Officer\n\nThank you, Ebrahim.\n\nOperator\n\nThank you. The next question is from Gabriel Dechaine from National Bank Financial. Please go ahead.\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nGood morning. I just have a question on the deposit substitution effect. It sounds like you're seeing it more in the international segment, switching from zero cost to term deposits. Is there any chance we start to see that in a more accelerated fashion in Canada? And then just a quick one on the client activity comment in GBM.\n\nI get that characterization. I'm just wondering if you can put some -- maybe frame it with your numbers. And more importantly, are you starting to see that reverse in the current quarter? Thanks.\n\nRaj Viswanathan -- Chief Financial Officer\n\nSure, Gabe. I'll start, and I'm sure Dan might have other tough stuff say or not so specific to this business. This conversion, if I can call it that, between call to term is actually happening in the Canadian Bank too. This is the deposit base is significantly larger, so it's not actually showing as big as it's showing up in the international banking space.\n\nThat's the short version of the answer. Specific numbers, we have seen already about $4 billion moved from call to term deposits. and in the Internal Banking, it's been about $1 billion. But relatively speaking, we've seen similar trends in both businesses that I think is expected to continue until Central Bank rate increased a stock, I would say, in the international banking space specifically.\n\nAnd Jake, do you want to take a question on the GBM?\n\nJake Lawrence -- Group Head, Global Banking and Markets\n\nFor sure. Thanks, Raj. And Gabe, thanks for your question. To give you some dimensions or framing around it, I'll talk about Canada and the U.S.\n\nWe've seen a decline in ECM issuance north of 80% in both of those markets, and those are our two largest markets. After that, on the debt capital market side, you've seen issuance decline north of in the quarter in those same two markets Canada in the U.S. And to further frame that out, that's the lowest issuance levels we've seen in these markets at any point in the past five years. And so that's important because it obviously impacts some of the fee lines, but those new issuance also then contribute to activating the capital markets, whether it's secondary trading or whether it's hedging activity, etc.\n\nSo does have a material impact in the quarter. In terms of outlook, we have already started to see it rebound. It's still early in Q4. We're only a few weeks in, but we're seeing our ECM business at a stronger level than where we were throughout all of Q3.\n\nSo there are some signs of the rebound happening including in ECM and DCM in those key markets in Canada and the U.S., so we're favorably disposed as we work through Q4 here. I hope that answers it.\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nYeah, I was thinking more. The ECM, DCM activity we've all seen, I was thinking more along the lines of whether it's prime brokerage or some of the other business lines we don't see as clearly and declines in margin loans, stuff like that, but I guess it's probably along the same lines.\n\nJake Lawrence -- Group Head, Global Banking and Markets\n\nSure. We're happy to add some color in around that too. So during the quarter, you obviously saw mix shoot up. You saw equity indices be quite volatile and come down.\n\nAnd with that, we also saw cost of funds, as Raj alluded to, move up. And so you had two effects happening. Spreads narrowing on financing businesses and in trading margins, and at the same time, you would have seen clients de-grossing the exposure to a downward pressure market. And so that would have taken trading assets and trading securities down in the quarter, which you would have seen.\n\nBut we've been thoughtful on our balance sheet structure. So has that come down and as clients have not been accessing the primary market, whether it's debt or equity, we've been able to grow our loan side but the sheet and support our client growth there. And so you've seen continued strong loan growth in our focused markets like the U.S. and Canada, and you've seen continued good deposit growth to fund that at the end of the day.\n\nSo then we see reduction in trading activities with clients, both corporate and institutional move to the sideline. Also saw in financing businesses as well as spreads got more narrow and as clients de-gross their investment portfolios.\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nThanks, and enjoy the rest of your summer.\n\nJake Lawrence -- Group Head, Global Banking and Markets\n\nThanks, Gabe.\n\nOperator\n\nThank you. The next question is from John Aiken from Barclays. Please go ahead.\n\nJohn Aiken -- Barclays -- Analyst\n\nGood morning, Jake, f you can stay on the microphone for a second. I understand the impact on trading from the ECM and the DCM, but I was a little bit surprised to see the down graph in the FX trading specifically. Is this just a spillover impact on the FX trading from what you saw in the markets? Or were there actually trading losses generated? Like, I noticed that -- two days of trading losses during the quarter. Was that specifically ascribed to FX or is this just client volumes were down and you just weren't able to generate the same amount of trading?\n\nRaj Viswanathan -- Chief Financial Officer\n\nJohn, I'll start. It's Raj. And then I'll pass it on to Jake for additional specific to FX. What you're referencing is what we categorize as FX and other.\n\nI think in the trading related soft pack page and I think the key is the other over there. FX been actually fairly good when you look at it quarter over quarter or year over year. So that's not the contributor. Commodity goes into it.\n\nAnd we have a lot of what I would call other derivative-related trading activities. And a lot of it is hedged for the state products that we have, which goes through NII in the GBM LatAm business, which is in international banking. That's what you're seeing the year over year. And some component of it relates to -- last year, as you know, we had some opportunities both in Peru and in one other country in the Latin American space because of political turmoil.\n\nWe had opportunities to actually monetize some sort of trading revenues. That's what you're not seeing this quarter compared to Q3 of 2021. So there's not much there relating to FX specifically, but there are various other, what I would call, trading-related activities that go under that line. And it tends to be not as volatile as what you've seen in this quarter, but you could see from time to time moments in that line.\n\nJake, do you want to add some color on FX?\n\nJake Lawrence -- Group Head, Global Banking and Markets\n\nYes. I think you've answered that question well. And John, we're not seeing any real material change in the current period around client FX activity. As Raj noted, it was a bit elevated back in Q3 last year due to some good conditions we saw, particularly in the GBM LatAm piece of the business.\n\nAnd with specific request your comment around -- we did have two trading loss days in the quarter. Nothing material, nothing broken there and not ascribed to any bad FX trades in any way, just weaker market base for the platform.\n\nJohn Aiken -- Barclays -- Analyst\n\nGreat. Thanks for the color. I'll requeue.\n\nOperator\n\nThank you. The next question is from Scott Chan from Canaccord Genuity. Please go ahead.\n\nScott Chan -- Canaccord Genuity -- Analyst\n\nGood morning. Maybe for Phil on credit. Thanks for the incremental data points that you talked about on the call. Is there anything that's any change in terms of your prior fiscal 2023 total PCL target ratio in the mid-30s intra-quarter? I'm just trying to assess quarter over quarter what -- having inflation, something like that, does it incrementally or materially change your outlook there?\n\nPhil Thomas -- Chief Risk Officer\n\nThanks for the question, Scott. I appreciate it. We're not going to -- I won't restate guidance for '23 now, but I'll give you some indicators of what we're seeing in our portfolios that may be helpful to you. I think first off, if I start to cover our current portfolio to pre-pandemic, we're running somewhere in the lines of half of our delinquency rates, half of our net write-off rates big move to secured lending away from unsecured lending.\n\nAnd the other thing, if you look at our international footprint, we've really repositioned in terms of the quality of originations there. In addition to we'll have the sale of Credit Scotia, our Peruvian consumer finance portfolio, that will be coming through into the -- in October this year. So that will also represent a bit of a tailwind from a PCL perspective for us heading into next year. But we're seeing both in our international platform and our Canadian platform, really healthy consumers.\n\nAnd even in ID, we're -- when we might look at how our deposit account customers or payroll account customers are performing, they're still holding liquidity in their accounts versus prepandemic. And we're seeing that same sort of trend in Canada. So we're not seeing any big credit headwinds on the horizon. And if I could just reiterate, health of the consumers continues to be very, very strong and all the sort of credit key risk indicators continue to be positive.\n\nScott Chan -- Canaccord Genuity -- Analyst\n\nRight. If I could sneak a quick one for Raj. Slide 24 in your investor presentation, the rate sensitivity. I noticed over the past couple of quarters, a 100 parallel shift upward would negatively impact your NII.\n\nIt is contrary to Peru, is it all hedging or just some other aspects that makes that sensitivity that way?\n\nRaj Viswanathan -- Chief Financial Officer\n\nYeah, these are good questions, Scott. I think you're referring to the 100-basis-point sensitivity, right, which increased from $126 million to $267 million this quarter. You're absolutely right. I think, as I mentioned before, this table captures the impact of a parallel shift.\n\nSo I won't repeat all that stuff. But what I will say is, as rates have gone up, we know that certainly did not happen. So short end went up long in did not move, frankly. So our view on hedging remains the same.\n\nShort-term it went up, term rates remain the same, anticipated additional Central Bank rate hike has already been what we think is priced into the rate curve in the medium term whether it's three years, five years, how would you look at it? What we started doing in Q4 to anyone's car is we started capturing the benefit from higher term rates that the market is already indicating by cautiously extending what we call the bank's balance sheet duration, not all of it, some portion of it. That's what resulted in lower NII sensitivity. So every time you extend duration, the sensitivity is going to go down, as you would expect, is already captured in the net interest income line, what we report quarter after quarter. So that's what you're seeing.\n\nWe do believe that we are positioned appropriately. And you being reflected, like I talked a little bit earlier about why our NIM compressed only one basis point. The benefit of the hedging active to offset some of what we expect as deposit rate going up significantly. So that's what you're seeing.\n\nAnd we'll continue to extend generation thoughtfully as we look at the rate curve as well as the construct of our balance sheet and how our balance sheet is evolving be it on the asset side or on the deposit side.\n\nScott Chan -- Canaccord Genuity -- Analyst\n\nOK, that's helpful. Thank you very much.\n\nRaj Viswanathan -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nThank you. The next question is from Mario Mendonca from TD Securities. Please go ahead.\n\nMario Mendonca -- TD Securities -- Analyst\n\nGood morning. Raj, if we could go back to the International segment, specifically Pacific Alliance, so last quarter, the margin was up 9 basis points. This quarter, down 20 basis points. I'm trying to understand that type of volatility over a 2-quarter period.\n\nIs it all sort of deposit activity and deposit behavior or was there something else going on in that segment related to, as you just mentioned, extending duration? Is there anything else going on besides just deposit behavior -- depositor behavior?\n\nRaj Viswanathan -- Chief Financial Officer\n\nYeah, I'll answer the second part first, which is extending duration, Mario. Our extension of duration is generally focused only on CAD and US because that's where we have the ability to hedge derivatives and all that stuff. I'll pass it on to Nacho to speak specifically about what you see in the Pacific Alliance countries relating to the margin compression this quarter compared to the expansion we saw in two quarters.\n\nNacho Deschamps -- Group Head, International Banking\n\nSure. Good morning, Mario. The reason I think Raj mentioned earlier, this volatility in our NIM is driven by very steep increases in central bank interest rates. Just in the last quarter, it was 2.5% on average in the Pacific Alliance countries, 4% increase in Colombia, 2.75% in Chile, 2% in Peru.\n\nSo what you are seeing really deposit repricing happening faster than asset repricing. However, as you mentioned, the first two quarters, if you take not only the second quarter with the first two quarters, Pacific Alliance countries expanded market by 20 bps that we came above this quarter. We expect, as Raj mentioned, this margin compression to net to be temporary because we are repricing our assets. And as soon as interest rates stabilize and then trend downwards, we will see margin expansion.\n\nCentral banks in the region have proactively raised rates in advance of the Fed. And as a result, inflation appears to have picked in Peru and soon in the other three countries. In fact, the four countries are one of the few, which already have positive real interest rates adjusted by 2023 forward-looking inflation. So if you combine this trend, with very strong asset growth we are seeing in the Pacific Alliance countries, 16% expansion of our loan book year over year, 4% in the quarter, 4% in retail, 5% in commercial.\n\nSo eventually, this trend will be positive to revenue growth when we see stability in our cost of funds and then a downward trend.\n\nMario Mendonca -- TD Securities -- Analyst\n\nOK. Nacho, could you talk then about the average duration of the loan book and maybe the earning asset book in international banking generally and maybe Pacific Alliance as well?\n\nRaj Viswanathan -- Chief Financial Officer\n\nSure. I'll start, Mario. I think one of the nuances we have, which is a positive specifically in the commercial side of the international banking book, repricing happens every quarter. Typical it every three months you have the ability to reprice.\n\nYou can price to win, you can price to not win. So we have a lot of flexibility there. The average duration will be one to one and a half years, if you want to look across the portfolio, be it on the retail side or on the commercial lending side. But important to remember, our commercial book is actually bigger than our retail book and international banking, just by size.\n\nIt's almost $80 billion while the retail book tends to be between 65% to 70%, depending on the quarter that it goes. So I think the ability to reprice is fairly quick on the commercial book side -- sorry, on that side. And then it gets to the real side of the book. We have a lot of mortgages and so on, which is increasing the duration a little bit, but still well within the two-year mark.\n\nMario Mendonca -- TD Securities -- Analyst\n\nOK. So it sounds to me, Raj, not to put words in your mouth, but we could see that as early as the first half of '23, some margin expansion then?\n\nRaj Viswanathan -- Chief Financial Officer\n\nDefinitely. I think -- to expand a little bit on what Nacho said, what we saw in the first two quarters, Mario, was asset margin expansion in IB. What is offsetting now is the deposit margins, which is under pressure in the go because of the steep increase in rates. So as asset margins start to come back, which we do expect, I think your hypothesis is correct.\n\nOperator\n\nThank you. The next question is from Lemar Persaud from Cormark Securities. Please go ahead.\n\nLemar Persaud -- Cormark Securities -- Analyst\n\nThanks. Maybe for Raj, I appreciate that you already provided an outlook on margins at the all-bank level, but I'm wondering if you could just talk a little bit about the divergence of the margin performance at the all bank level versus the retail segments broadly. Like, Canadian banking margin is up 7 basis points sequentially, International is down one basis point. Now I can appreciate that, that isn't the all bank -- doesn't make up the all bank NII.\n\nIt does make up a bulk of it. So do we see this dynamic playing out that is kind of good margin performance in the retail segments, but all bank margins continue to move lower? Or is it just something you see this quarter that weighed at the all bank level?\n\nRaj Viswanathan -- Chief Financial Officer\n\nHey, Lemar, thank you for the question. And I'll take your last sentence as yes, it is something unique this quarter. I'll speak a little bit about how it works between, like you said, the corporate segment and say the Canadian bank, which is the easy one to talk about. As you know, transfer pricing works on both the deposit side and the asset side.\n\nSo what you saw this quarter is when deposits start repricing quickly, mechanically, we pay the Canadian bank from the corporate segment, and we charge them for the asset side. So as we look forward, as asset margins start expanding in the Canadian Bank as well, you'll see the offset coming, which the Canadian Bank should be flat, should not be a headwind to the Canadian Bank margin, but you will see the pickup at the all bank level. Now how soon that will happen, it depends on how soon asset margins start expanding, which is already happening, but you should see the exponential component of it over the next couple of quarters. Shouldn't impact the creative banking margin, to be clear, will help the all bank margin stabilize.\n\nLemar Persaud -- Cormark Securities -- Analyst\n\nOK. I appreciate that. And then if I could squeeze another one in maybe for Dan. I'm just wondering if you could drill down into what drove the strong business loan growth this quarter? Was it market share gains? Maybe talk to what provinces and industries this growth came from? And then with -- based to one or two chunky loans and then maybe offer an outlook for Q3.\n\nI guess what I'm going with this is. I'm wondering if any borrowers are starting to show signs of hesitation given the challenging macroeconomic environment. Thanks.\n\nDan Rees -- Group Head, Canadian Banking\n\nYes. Thank you, Lemar. It's Dan here. Look, I think our strategic emphasis on growing our market position in business banking played again this quarter.\n\nYou're perhaps referring to loan growth, but we're very pleased with the deposit growth. including sequentially in commercial. That's important because this segment sell funds, more deposits and loans. And so as Raj mentioned, we're expecting to see our ongoing emphasis on deposits in commercial continue into Q4.\n\nWe are undersized in this segment. Our investments and the core operating performance of the teams is what's driving the growth rate. I think if you adjust for our starting position, meaning the smallest of the big 5, our growth rate looks more in line. Thank you for calling up the provinces.\n\nAs I've said many times, we're particularly -- we have a particular opportunity in British Columbia and Quebec. They are growing above the national growth rate, both in loans and deposits. So we're pleased with the dynamics there. And to reemphasize, we are not -- our credit appetite remains consistent.\n\nWe've invested in expanding our sales teams and providing them with better technologies. And that's what's contributing to steady market share gains, whether it's in those provinces or in important industries like agriculture, transportation, real estate, technology and distribution. So the balance of growth in the last couple of quarters has been more balanced than previous a year or two ago, we would have been calling out real estate exposure as a main driver that's now much more balanced, which you can imagine you're pleased about. In terms of outlook, we're not seeing any hesitance from commercial borrowers to continue to invest in their business.\n\nWe're not seeing any pressure on utilization rates. Credit migration has actually been improving. And so the tone from the majority of our customers has been medium-term orientation, invest in capital equipment, land and people, and they're struggling to find product and they're struggling to find people, and they're investing in the assumption that the economic outlook will be good over the medium term. So our emphasis there will continue and as well our emphasis on deposits.\n\nOK, thanks.\n\nOperator\n\nThank you. The next question is from Doug Young from Desjardin Capital Markets. Please go ahead.\n\nDoug Young -- Desjardins Capital Markets -- Analyst\n\nGood morning. Hopefully, this is a quick one. Just on international banking. When I think back over the last year, you put through cost reductions.\n\nYou picked up an extra stake in Chile this year. And I get that headwinds have been pressured in the capital market discussion as well. But I figured we'd start to see more sequential growth in pre-tax pre-provision earnings. And I guess my question is, is that a realistic expectation as we go into Q4 or into next year? And you've talked a bit about NIMs and what your expectations are.\n\nBut maybe just kind of backing up, taking to the big picture level, is that a realistic expectation? Or are the headwinds still really too big at this point?\n\nNacho Deschamps -- Group Head, International Banking\n\nNo, I think it's a realistic expectation. Actually, we saw revenues growing up 2% Q-o-Q despite the NIM being relatively flat. And we are seeing very good business growth momentum, both in commercial but in -- and retail. So we expect this loan and deposit growth to continue.\n\nAs you mentioned, we have been managing very well our expenses. Our expenses are flat year over year despite high inflation of average 10% in the country. So this is driven by very strong digital progress and timely execution of all efficiency gains that we committed with the restructuring charge last year. So our operating leverage year to date is 250 bps.\n\nSo looking forward, I expect this good momentum in normal deposits to continue translating into revenue growth with some volatility as we have explained today, driven by Central Bank interest rate movements and market-related revenues, and we also expect positive operating leverage and good expense management to continue.\n\nBrian Porter -- President and Chief Executive Officer\n\nI'm just going to add something. It's Brian. And I think Nacho answered the question exceedingly well. I just focus on the macro picture.\n\nAsset growth is going to continue. The demand for credit is strong. We have significant pipelines on the corporate commercial and retail businesses. And then as we answered earlier, asset repricing is happening now and will continue through the balance of fiscal '23.\n\nAnd I'm not going to forecast rates, but we've commented rates in the last quarter were up 400 basis points in Colombia, 275 basis points in Chile. The base rate in Peru has gone from 25 basis points to 725 in the last nine months, to give you some idea of how rates have increased and how dramatically. But rates that are peaking. And it's a question whether there's one more or Central Banks are done.\n\nSo that positions us very well in terms of the asset growth pipelines and the margin in our business.\n\nDoug Young -- Desjardins Capital Markets -- Analyst\n\nI appreciate it. Maybe just one quick one for Raj. I think you talked about targeting positive bank operating leverage in fiscal '22. You're negative year to date, as one quarter left to go, do you still think you can actuate positive operating leverage for this year?\n\nRaj Viswanathan -- Chief Financial Officer\n\nLet me give you a little more elaborate answer than that. I think three of our business lines are expected to deliver positive offer. It will be Canadian international banking as well as Wealth Management. GBM is coming off two strong years, will not, primarily due to lower trading and advisory revenue that is unfortunately impacted by lack of client activity.\n\nI don't think that's going to correct it so fast quickly in Q4. What that will likely result for the bank, the operating leverage will be slightly negative. I think it's 0.9% negative this quarter -- sorry, year to date. I believe it will be that.\n\nBut what I do want to point out is we're meeting all our other medium objectives like ROE, EPS growth or sound capital ratios.\n\nDoug Young -- Desjardins Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is from Sohrab Movahedi from BMO Capital Markets. Please go ahead.\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nThank you. Wanted to just go to Dan. Dan, your segment has had double-digit pre-tax pre-provision growth for a number of quarters now. I don't want to say is this as good as it gets, but what's your outlook here for your pre-tax pre-provision? And the flip side of the question, I guess, a broader question for Brian.\n\nThe International segment is back for second quarter in a row now of $600 million plus in earnings. But I think it's still only around 25% of the total bank when you have depressed kind of GBM results resilient wealth results, but presumably GBM and wealth will kind of rebound, trying to kind of get a feel for how much of the total bank is international going to be once you have some, I'll call it, a mean reversion in some of the other segments, keeping in mind that probably Canadian banking is going to moderate frontier or that compounds follow depending on how Dan answers the question, I suppose.\n\nDan Rees -- Group Head, Canadian Banking\n\nThank you, Sohrab. Obviously, we're pleased with double-digit PTPP growth rates and for a little while now. That is outsized in terms of the long-run performance of this segment in general in the industry. So some normalization would be a reasonable expectation.\n\nWe're certainly pleased to have published seven quarters of positive operating leverage. You've noticed for a while now we're hovering around 44% productivity ratio. So much of our confidence in PTPP going forward rests on the production and productivity of the sales and the digital teams. I think notwithstanding the fact that there are some views that the economy could slow dramatically from here.\n\nOur belief is that the performance of the of the segment the way that the system is better fit together gives us confidence that we'll outperform on a fair basis in terms of PTPP growth rate over the medium term, including into next year. In terms of projecting levels, I think -- the team here prefer to leave the outlook for next year, next quarter. And I'll pass it to Brian for his comments.\n\nBrian Porter -- President and Chief Executive Officer\n\nYeah. Thank you for the question, Sohrab. Just a comment on international, which I think is important is that -- and sometimes, it gets buried in the detail. But Raj did mention in his comments, GBM LatAm produced profit of $192 million this quarter, I think the second highest on record.\n\nThat business continues to do exceedingly well. And we have great prospects for that business. And as I said, related to another question, a great pipeline of business there. The international wealth results were up this quarter, and we see good growth trends in that business.\n\nSo the international business, it's in an entirety. And I'm really pleased with the results out of the division quarter because, as I said, this was given the rapid and rate increases that we've seen and the impact on the liability side of the balance sheet and how we responded with her -- with our customers. I'm very pleased with the results. So then we will benefit from asset repricing in subsequent quarters.\n\nSo we're starting to see that already. So the international business, and the last point I'd make is -- the Caribbean results this quarter were very strong. We haven't seen that for a while. And it shows you the diversification benefit of our business as tourism has picked up, and we expect a strong 2023 for our Caribbean business.\n\nSo international, the outlook for international is very strong and bright indeed, and we look forward to continued improving results.\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nOK. I appreciate it. Can I just do one quick follow-up with Dan? And if push came to shove, what sort of -- where can you get operating leverage? Do you have room on your expenses? Or if revenue growth slowed down could be the case with negative operating leverage?\n\nDan Rees -- Group Head, Canadian Banking\n\nLook, I think margin has a big impact, right? NII is such a big piece of the line. I think we've said on a few prior quarters or a we haven't seen the full pickup yet compared to prepandemic and credit cards, in automotive. And those two books combined represent a significant portion of total revenues. We've been producing substantial operating leverage for a long time now in the business bank.\n\nSo the larger that share becomes of the total makes a big difference. And obviously, Tangerine is a beneficiary of a deposit growing environment. And so I think our ambition is to continue to print positive operating leverage on quarterly certainly on a full year basis this year and into next year, regardless of what happens with expenses.\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nI appreciate that. Thank you.\n\nRaj Viswanathan -- Chief Financial Officer\n\nOK. On behalf of the entire management team, I want to thank everyone for participating in our call today. And we went a little bit over. I look forward to speaking with you again at our Q4 2022 call in November.\n\nHave a great day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn McCartney\n\nBrian Porter -- President and Chief Executive Officer\n\nRaj Viswanathan -- Chief Financial Officer\n\nPhil Thomas -- Chief Risk Officer\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGabriel Dechaine -- National Bank Financial -- Analyst\n\nJake Lawrence -- Group Head, Global Banking and Markets\n\nJohn Aiken -- Barclays -- Analyst\n\nScott Chan -- Canaccord Genuity -- Analyst\n\nMario Mendonca -- TD Securities -- Analyst\n\nNacho Deschamps -- Group Head, International Banking\n\nLemar Persaud -- Cormark Securities -- Analyst\n\nDan Rees -- Group Head, Canadian Banking\n\nDoug Young -- Desjardins Capital Markets -- Analyst\n\nSohrab Movahedi -- BMO Capital Markets -- Analyst\n\nMore BNS analysis\n\nAll earnings call transcripts"
}