{
  "companyName": "360 Finance Inc",
  "companyTicker": "QFIN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/19/360-finance-inc-qfin-q2-2022-earnings-call-transcr/",
  "content": "360 Finance Inc (QFIN 0.10%)\nQ2 2022 Earnings Call\nAug 18, 2022, 8:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. And welcome to the 360 DigiTech second quarter 2022 earnings conference call. [Operator instructions] At this time, I'd like to turn the conference call over to Ms. Mandy Dong, IR director.\n\nPlease go ahead, Mandy.\n\nMandy Dong -- Director, Investor Relations\n\nThank you. Hello, everyone, and welcome to our second quarter 2022 earnings conference call. Our results were issued earlier today, and it can be found on our IR website. Joining me today are Mr.\n\nWu Haisheng, our CEO and director; Mr. Alex Xu, our CFO and director; and then Mr. Zheng Yan, our CIO. Before we begin our prepared remarks, I'd like to remind you of our safe harbor statement in our earnings press release, which also applies to this call.\n\nWe may refer to forward-looking statements based on our current plans, estimates, and projections. Also, this call includes discussions of certain non-GAAP measures. Please refer to our earnings release for a reconciliation between non-GAAP and GAAP ones. Last, unless otherwise stated, all figures mentioned are in RMB.\n\nI will now turn the call over to our CEO, Mr. Wu Haisheng.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nHello, everyone. I'm very happy to report another strong quarter in Q2. Total loan origination and the facilitation volume reached RMB 98.3 billion, up 11% y-o-y. Outstanding loan balance reached RMB 150.5 billion, up 28% y-o-y.\n\nDespite an unusually volatile macro environment with the Shanghai lockdown and the resurgence of COVID in multiple cities, we delivered a solid performance which once again demonstrated the resilience of our operations and the risk management capabilities facing adversity.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nOn the regulatory grounds, there are further developments in rectification work of platform economies. Recent regulatory meetings have all sent a clear signal that the reform is reaching an ending phase. Going forward, regulators will put the emphasis on driving healthy and sustainable industry development through normalized supervision. As the regulatory environment gradually stabilize, we sea clearer guidance.\n\nOn July 28, the Central Political Bureau of the Communities Party of China set up economic priorities for the second half of the year. The policymakers pledge to promote healthy, orderly development of the platform economy, completing the rectification work and to conduct regular supervision. At a follow-up meeting by the PBOC on August 1st, the central bank remarked significant progress of major platform rectification. And these will urge these companies to complete the whole rectification project, place them under regular supervision that is more generalized, transparent, and predictable.\n\nAs a result, this promotes the role of the platform economy in job creation and the boosting consumption.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nWe have completed most of the rectification work according to the regulatory requirements and now in a stage of regular data reporting. Regarding credit agency report [Inaudible] we have already submitted our execution plans to regulators and have since maintained close dialogues with them. Based on feedback and direction from the regulators, we started to work with other business partners to implement our plans.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nIn July, the CBIRC published a notice on strengthening the management of internal loans business of commercial banks and improving the quality and the efficiency of financial services, namely Circular No. 14. The document is consistent with earlier guidance, including Circular No. 24 in 2021 and the Circular No.\n\n9 in 2020 with the grace period extended for one year until June 30, 2023. In addition, the document once again acknowledged the collaborative business model between commercial banks and the related party in internet lending business. We have already implemented the specific requirements outlined in this circular in our daily operations.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nIn Q2, despite multiple headwinds from the macro economy and unexpected pandemic resurgence, we remain committed to our strategy set at the beginning of the year. In this extreme volatile market, we successfully executed our operational strategy and made great progress in funding product, risk management and the customer base, as well as tech upgrading.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nOnly the funding front, we further optimized our funding structure. During the quarter, we added 10 more joint top banks and the major urban and rural commercial banks with over RMB 1 trillion AUM, which make our funding supply more abundant and to improve the funding supply and the resumption of insurance of ABS. Our funding cost for a credit driven loan decreased by 21 basis points on sequential basis. Since the beginning of Q2, we have issued a total of RMB 3.3 billion ABS at an average funding cost of 5%.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nOn the product front, we continue to optimize product portfolios and lowered our average price. This marks our full compliance of 24% regulatory requirements.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nOn the customer acquisition front, we continued to upgrade our user base during the quarter by expanding the coverage of our intelligent market RTA, namely real-time API model. We further increased the number of high-quality users and improved overall user quality. The coverage ratio, our precise targeting increased from 50% in Q1 to almost 100% in Q2. In the online advertising channels, the number of high-quality user with granted credit line increased by 51% from Q1.\n\nLooking at across all customer acquisition channels, the credit approval rate of high-quality user increased by roughly 20% on a sequential basis. Meanwhile, we continue to enhance effectiveness of targeted customer acquisition. On one hand, we continuously upgrade our model with user-quality screening. On the other hand, we expanded our media partner network for joint modeling and onboarded new partner, such as [Inaudible], or our existing partners such as Baidu, [Inaudible] we continued to upgrade our model.\n\nIn other areas, we optimize the cost efficiency of user acquisition by upgrading our intelligent marketing platform. We also connected to new user acquisition resource, such as Baidu open screen app and the total RTA resource.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nIn Q2, we quickly adapted our risk strategies in response to a resurgence of the pandemic, including acquiring higher-quality customers and gradually cutting off high-risk users. We also completed major upgrade our base models to further leverage own users data. As a result, risk performance of the new loan organization was great. First payment day-1 delinquency rate of new customers dropped to 3.01% in Q2 from 3.56% in Q1.\n\nAnd the first payment delinquency 30 days was less than 0.25% in Q2. In the meantime, day-1 delinquency rate of our current loan book gradually went down to 4.71% in June from 5.11% in March. Such positive trends continued into July, with day-1 delinquency rate further dropped to 4.64%. The M1 collection rate of current loan book trended up to 86.9% in June compared to 85.2% in March.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nDespite the impact of the pandemic, our overall asset quality improved in Q2, especially for new loan origination. This reflected the effectiveness of the adjustments we made and our ability to counter pandemic-related challenges. If macro circumstances stabilize for the rest of the year, we expect our risk management strategy to bring further improvement in asset quality.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nIn terms of upgrading strategy, we maintained that 55.7% of the loans originated and facilitated was under the capital-light model and other tech solutions in Q2. In the long run, we plan to modulate our leading technology into more products and to better serve diverse financial institutions. In addition, the China Academy of Information and Communication Technology, namely CAICT, credits us among the first batch of companies under the Business Security Initiative, namely BSI, together industry giants including China Mobile, Ant Group, Baidu and [Inaudible]. This was a strong statement of our capabilities in business security management and technology.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nIn Q2, we navigated through the extreme pandemic situation of citywide lockdown and other multiple macro fluctuation with strong operational and financial results. Looking ahead into Q3, we will stay vigilant on the macroeconomy environment and the pandemic's developments. Meanwhile, we are seeing an increasingly stable policy environment and a healthier industry ecosystem. We will maintain our prudent operational strategy, continue to upgrade our technology and customer base, and to finish our rectification packs.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nAlex Xu -- Chief Financial Officer and Director\n\nOK. Thank you, everyone. Thank you, Haisheng. Good morning, and good evening, everyone.\n\nWelcome to our second quarter earnings call. As Haisheng discussed, we delivered another solid quarter in a rather challenging period of time from macroeconomic perspective. Early in the quarter, COVID lockdowns in Shanghai and other regions of the nation noticeably weakened consumers' confidence and altered consumption pattern for many. Since the lockdown removed in June, we have observed some recovery in consumers' demand for credit, although the pace of the recovery are expected to be gradual and modest.\n\nDespite the impact from COVID and the generally softer macro environment, we continue to push for steady improvement in overall asset quality throughout the quarter and the year. With optimization of the risk model and the contribution from high-quality new borrowers, overall day-1 delinquency has been declining sequentially each and every month since beginning of this year, even during the peak of the COVID lockdown in April and May. It was 4.9% for Q2 versus 5.2% in Q1, and further declined to 4.6% in July, particularly day-1 delinquency new borrowers in Q2 was well below 4%, indicating a clear, better quality versus existing borrowers. 30-day collection rate remained stable at around 86% in Q2.\n\nCOVID lockdowns significant hampered our collection operation in April and early May. 30-day collection rate hit the lowest point of this cycle in April, and less than 85%, then start to recover. By July, it was already above 87%, the highest point so far this year. Again, we see clear outperformance by new borrowers versus existing borrowers.\n\nFor new borrowers, 30-day collection rate was above 90% in Q2. These risk metrics continue to support our current user acquisition strategy, which focused on high-quality segment of the market. Total net revenues for Q2 was 4.2 billion versus 4.3 billion in Q1 and 4 billion a year ago. Revenue from credit-driven service, capital-heavy, was 2.9 billion compared to 2.9 billion in Q1 and 2.4 billion a year ago.\n\nThe year-on-year growth was mainly due to growth in loan volume and longer average tenure of the loans, more than offsetting the negative impact from declining in average prices of the loans. Capital-heavy facilitation revenue take rate actually improved modestly versus Q1, also due to a longer loan tenure. Revenue from platform service, capital-light, was 1.2 billion compared to 1.4 billion in Q1 and 1.6 billion a year ago. The year-on-year sequential decline was mainly due to the decline in loan volume and the average price of the capital-light loan facilitation.\n\nDuring the quarter, capital-light loan facilitation, ICE, and other technology solutions combined account for roughly 56% of the total loan volume. Given the challenging macro environment, we purposely increased the portion of the loans processed through ICE and other technology solutions to further mitigate potential risks so far this year. Such services typically have different commercial terms compared to regular capital-light loan facilitation. Overall, in the long run, we will continue to pursue a technology-driven business model and expect capital-light and other technology solutions to eventually become a significant majority of our business.\n\nDuring the quarter average IRR prices of the loans we originated and/or facilitated further dropped to between 22% and 23%, well within the 24% rate cap requirement. We expect pricing to be relatively stable for the coming quarters. Sales and marketing expenses increased approximately 11% sequentially in Q2, mainly because of the increase in high-quality user acquisition. Specifically, if we exclude backend expenses, the increase in average cost to acquire 360 account new credit line user through third-party traffic sources were roughly in line with the increase in the average size of the new credit lines.\n\nAs such, the average cost per dollar amount new credit line remained relatively stable q-on-q. As always, we will continue to use lifecycle ROI and LTV as a key metric to determine the pace and scope of our user acquisition strategy to ensure the sustainability and the profitability of our operations. Although the overall risk profile of our loan portfolio continued to improve in Q2 due to the contribution from new loans from high-quality new users, impacts from micro uncertainty and COVID were still apparent on old loans from existing users. Therefore, we continue to take prudent approach in booking provisions against potential credit loss.\n\nNew provisions for contingent liability for loans facilitated in the quarter was approximately 1.3 billion. With strong operational results and a stable contribution from capital-light model, our leverage ratio, which is defined as risk bearing loan balance divided by shareholder's equity, was at an historical low of 4.0 times in Q2, compared to 4.8 a year ago. We expect to see a rather stable leverage ratio for the time being until capital-light and other technology solution contribution become a bigger portion of the business in the future. We generate 1.1 billion cash from operations in Q2 compared to 1.4 billion in Q1.\n\nThe sequential decline in operating cash flow was in part due to some COVID-related timing issue. As Shanghai being gradually reopened in late Q2, some of the business and administrative procedures within the financial system were still not running as efficient as what normally should be. Therefore, causing some delays in collecting receivables from some of our financial institution partners. Total cash and cash equivalents was 11.4 billion in Q2 compared to 9.8 billion in Q1.\n\nNonrestricted cash was approximately 7 billion in Q2 versus 6.2 billion in Q1. As always, a significant portion of our cash will normally be allocated to support the security deposit with our institution partners in normal business course. As we continue to generate healthy cash flow from operations, we believe our current cash position is sufficient to support the growth of our business, to invest in key technologies and to satisfy potential regulatory requirements, and to return to our shareholders. In accordance to the dividend policy approved by our board last year, we declared another quarterly dividend of $0.18 per ADS for Q2.\n\nThe cash dividends represent approximately 20% of our Q2 earnings. Finally, regarding our outlook for 2022. As we discussed previously, we believe 2022 will be a fairly challenging year for the industry as the participants are settling in a new regulatory environment. Meanwhile, the on-and-off outbreak of COVID, as well as associated measures to control the outbreak, added additional uncertainties to an already soft macro economy.\n\nTherefore, we want to maintain a prudent approach to plan our business and to mitigate potential risk. At this point in time, we would like to keep our full year loan volume guidance of between RMB 410 billion and RMB 450 billion unchanged, representing year-on-year growth of 15% to 26%. We view this transitional year as an opportunity for us to further optimize our operation, strengthen our technology platform, and upgrading our customer base to build an even stronger foundation for our future growth. As always, the forecast reflects the company's current and preliminary view, which is subject to material changes.\n\nWith that, I would like to conclude our prepared remarks. Operator, we can now take some questions.\n\nOperator\n\n[Operator instructions] Our first question is Yada Li, CICC. Please go ahead.\n\nYada Li -- CICC -- Analyst\n\n[Foreign language] OK, then I'll do the translation part. Under the current macroeconomic and the pandemic uncertainties, so we've got most of the retail credit service providers. The financial institutions generally has encountered a certain pressure, such as the increase of customers or a prepayment, the customer acquisition challenges after the pricing adjustment. So, I was wondering, in the context of these uncertainties, are there any changes in the willingness of our bank partners to cooperate with us? And are there any changes in the funding cost that the customer acquisition cost and also the actual borrowing demand of our potential customers? And if there were some certain challenges with our plans, how are we going to overcome it? Thanks, management.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nYes. I will answer your question, Yada. First, your observation is correct. Due to the impact of macro economy, financial institutions are under some pressures.\n\nHowever, thanks to our, number one, accumulated credibility in the market for our consumer loan business; number two, financial institutions pressure from other asset class. Actually, in Q2, our high-quality consumer loan asset is in high demand from financial institutions. That is reflected by the drop in funding costs that we already discussed. In July and others, we are seeing the trending down of our funding cost further.\n\nFor your second question, as for the customer acquisition activities, due to the lockdown of pandemic, of offline activities, our customer drawdown activities is, to some extent, negatively impacted. Then to our -- a series of countermeasures that we apply more precise customer targeting that in the drawdown activity our users are boosting. We have done a lot of work in Q2. We are expecting to see the work bearing fruit in Q3.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nYada Li -- CICC -- Analyst\n\n[Foreign language]\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nOperator\n\nOur next question is Thomas Chong from Jefferies.\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language] Thanks, management, for taking my questions. My first question is about our SME strategies. Given the current macro backdrops, will we scale back the pace of our SME business, as well as the offline sales team? And my second question is about the average ticket size. Given the uncertainties of the macroenvironment, are we seeing -- the borders are getting a lower ticket size and they are getting a bit more prudent in [Inaudible] thank you.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nYes. Regarding SME business, naturally, this is more signaling code than our consumer loan business that we take a more prudent approach on this business. We have tightened our credit standard for this business. As you can see the total loan origination or facilitation in SME business in Q2 dropped big.\n\nThis is number one. For the second point, as for the customer acquisition channel, for external channels that we have less control, we scaled back the volume and more focused on our direct sales team of customer acquisition.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nYes, Thomas, your observation that the customer consumption wellness jobs due to the impact of pandemic is correct. However, we released a few countermeasures. Number one is we tightened the credit standards. That means we make -- the approve rate is lower.\n\nNumber two, we focused more on the high-quality customers, which bring more value to the business. Two measures together, that makes our ticket size rather relatively stable.\n\nAlex Xu -- Chief Financial Officer and Director\n\nOK. Thomas, just add a couple more point there. One is on the SME as Haisheng mentioned, if you look at our earnings release, this quarter the credit line, the new credit line granted to SME is about 4.9 billion and the actual loan facilitator or originated to SME is about 7.8 billion, roughly. Compared to last quarter, that loan volume was a little bit over 10 billion.\n\nSo that's the numbers there. But I just want to make sure, when we talk about SME, we are talking about rather narrowly defined SME. So, meaning like that's real SME as opposed to some of the players talking about more broadly defined SME. So, that makes a difference.\n\nSecondly, regarding the ticket size, if you look at, for example, our average drawdown we look at for Q2 is increased by roughly 5% sequentially. So, you know, that's just added point to Haisheng's comments. Once we pass through the lockdown period, we actually see pretty -- you know, still see pretty noticeable growth in terms of ticket size in consumption. Thank you.\n\nThomas Chong -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question is Alex Ye from UBS.\n\nAlex Ye -- UBS -- Analyst\n\n[Foreign language] So, my question is for mainly on your take rate outlook. So, during -- you have mentioned that your average IRR during the quarter was 22% to 23% and expect that to remain stable going forward. And you also mentioned that your funding cost is improving and your credit performance is also stabilizing. So, I'm wondering if we could expect some stabilization or improvement or your takeaway going forward.\n\nThank you.\n\nAlex Xu -- Chief Financial Officer and Director\n\nSure. Alex. Let me take your question here. You are -- generally, you're right.\n\nGiven that we are already reached a point in terms of pricing goal, based on the regulatory guidelines. So, we don't see really too much pricing downward trend going forward for the remainder of the year. And with that, the overall take rate I would say you probably will see a more stable take rate. If anything, there could be some improvement there.\n\nBut of course, other factors you need to consider is the, number one, the microenvironment. And, you know, that will have I would say more impact than usual. If we have a rather stable microenvironment than other assumptions, we can assume it will be a stable to maybe modestly improved take rate. But if some something unexpected happening on the micro front, then there will be another question there.\n\nFrom funding cost, as Haisheng mentioned, sure, you know, second quarter we are 6.8%. And right now, we are sitting at about 6.5%. So, there's maybe still a little bit room to go in terms of lowering funding cost, given the current money supply is pretty, you know, available out there. There may be some -- still some room to go.\n\nBut overall, I would say from our modeling perspective, we are conservatively, you can model a rather stable take rate. You know, if you want to add some to it modestly, that's also fine.\n\nAlex Ye -- UBS -- Analyst\n\nOK. That's very clear. Thank you.\n\nAlex Xu -- Chief Financial Officer and Director\n\nOK. Thank you.\n\nOperator\n\nOur next question is Richard from Morgan Stanley.\n\nRichard Xu -- Morgan Stanley -- Analyst\n\n[Foreign language] Basically, my question is on the competitive environment in China at the moment, given 360 DigiTech is also aiming for low-risk bars. You know, basically it's also some overlap with the targeted customer by like Ant, banks, etc. So, what's the competitive landscape at the moment?\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nYes, Richard, you are right. After we lower our average product price, the overlap of target markets with other drawings, like you mentioned, and banks, that increased a little bit. However, we do not see the direct head-to-head competition with them. There are a few reasons.\n\nNumber one, the consumer loan market is the grant market with multilayers. For example, banks, they have 10% price product and has 15%. Our price range, as we discussed previously, is between 22% to 23%. Number two, we believe different companies can derive and prosper based on their unique competence.\n\nFor example, Ant has [Inaudible] their unique ecosystem. For us, we do not have any e-commerce platform or e-commerce ecosystem. Therefore, we can collaborate with all the platform in the market and cover the full spectrum of customer groups.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nRichard Xu -- Morgan Stanley -- Analyst\n\n[Foreign language]\n\nHaisheng Wu -- Chief Executive Officer and Director\n\nThank you.\n\nOperator\n\nAnd our next question is [Inaudible] CLSA.\n\nUnknown speaker\n\n[Foreign language] So, my question is more quality. Management just mentioned that looking to the second half, we're going to see improvement in the overall risk indicator. My question is more about how do we see the path of this improvement? Is it like a gradual bumpy one, or like a notable options, especially regarding the COVID, you know, flare-ups recently in across many cities. And also, when do we expect the 90-day delinquency ratio to pick? Yeah, that's my question.\n\nThank you.\n\nHaisheng Wu -- Chief Executive Officer and Director\n\n[Foreign language]\n\nMandy Dong -- Director, Investor Relations\n\nOK. So, our risk management team has been working with other teams closely to make several adjustments in the second quarter. Firstly, improving the quality of nearly acquired customers with the comprehensive coverage of RTA and in duration of the model. The number of our best quality customers has been doubled compared with the first quarter.\n\nAnd secondly, improving the data mining of the People's Bank of China credit report. We have set up a joint project team and derived 18,000 effective variables from the credit report, covering the optimization of several models, including competitive offer exploration, high-quality customers identification, bad customers identification, career model, income and liability model, etc. And in the meanwhile we evaluate customers with poor credit performance more cautiously. Thirdly, we improved the resource allocation to high-quality customers on the operation side, including pricing, credit lines, and promotions.\n\nWith these actions, the credit performance of new transactions has been improved. We have seen that FTD 30 days Q2 dropped by about 20% compares with first quarter. And it's maintained a downward trend in July and August. With the academic outbreak, we can see lower risks, which truly demonstrates the resilience of our team and our asset.\n\nNow, over the results of some actions mentioned above have not been fully reflected as some actions are in pilot testing. We need to absorb long-term performance. Therefore, with fully adoptions of these actions, we are very confident to retain stable risk performance in the future. As for 90-day delinquency rates, it will be lower in third quarter.\n\nAs we focus more on 30-day delinquency rates, it has been the lowest in July. And our future target will be within 2.5% to 3%. Hope this can clarify your question.\n\nUnknown speaker\n\n[Foreign language]\n\nOperator\n\nAnd this is the end of our question-and-answer session. And now, I hand back to your management for conclusion.\n\nAlex Xu -- Chief Financial Officer and Director\n\nOK. Thanks again for joining us, the conference call. If you have any additional question, please feel free to contact us offline. Thank you.\n\nDuration: 0 minutes\n\nMandy Dong -- Director, Investor Relations\n\nHaisheng Wu -- Chief Executive Officer and Director\n\nAlex Xu -- Chief Financial Officer and Director\n\nYada Li -- CICC -- Analyst\n\nThomas Chong -- Jefferies -- Analyst\n\nAlex Ye -- UBS -- Analyst\n\nRichard Xu -- Morgan Stanley -- Analyst\n\nUnknown speaker\n\nMore QFIN analysis\n\nAll earnings call transcripts"
}