{
  "companyName": "Expedia",
  "companyTicker": "EXPE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/expedia-expe-q3-2022-earnings-call-transcript/",
  "content": "Expedia (EXPE 0.54%)\nQ3 2022 Earnings Call\nNov 03, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Expedia Group Q3 2022 financial results teleconference. My name is Nadia, and I'll be the operator for today's call. [Operator instructions] For opening remarks, I will turn the call over to SVP, corporate development, strategy, and investor relations, Harshit Vaish. Please go ahead.\n\nHarshit Vaish -- Senior Vice President, Corporate Development, Strategy, and Investor Relations\n\nGood afternoon, and welcome to Expedia Group's earnings call for the third quarter of 2022 that ended September 30. I'm pleased to be joined on the call today by our CEO, Peter Kern; and our CFO, Julie Whalen. The following discussion, including responses to your questions, reflects management's view as of today, November 3, 2022, only. We do not undertake any obligation to update or revise this information.\n\nAs always, some of the statements made on today's call are forward-looking, typically preceded by words such as we plan, we expect, we believe, we anticipate, we are optimistic, or confident that or similar statements. Please refer to today's earnings release and the company's filings with the SEC for information about factors, which could cause our actual results to differ materially from these forward-looking statements. You will find reconciliation of non-GAAP measures to the most comparable GAAP measures discussed today in our earnings release, which is posted on the company's Investor Relations website at ir.expediagroup.com. And I encourage you to consistently visit our IR website for other important information.\n\nUnless otherwise stated, any reference to expenses exclude stock-based compensation. And with that, let me turn the call over to Peter.\n\nPeter Kern -- Chief Executive Officer\n\nThank you, Harshit. Good afternoon, everyone, and thanks for joining us today. Before we get started with the update on the quarter, I'd like to formally welcome our new CFO, Julie Whalen to her first earnings call. I'm excited to add Julie to our leadership team.\n\nDuring her 10 years as CFO at Williams Sonoma, she helped drive significant growth in the business and in shareholder returns. I've also worked alongside Julie on our board since 2019 and she just Chaired our Audit Committee since 2020. So, she comes with a great sense of our strategic priorities and what we're trying to achieve. I look forward to the expertise she can bring to our finance, board, and across our entire company.\n\nNow, moving into the quarter. We were very pleased with our record-breaking performance in the third quarter. We delivered our highest-ever quarterly revenue and adjusted EBITDA, the latter exceeding $1 billion for the first time in our history. We also delivered record third-quarter lodging gross bookings.\n\nDespite some macroeconomic uncertainty and some short-term impact from Hurricane Ian, travel demand has remained strong and ADRs remain substantially elevated relative to pre-pandemic levels. This quarter, we also further delevered our balance sheet, which put us in a position to resume buying back our stock, which we continue to believe is highly undervalued. Going forward, we expect to continue to reduce leverage and return capital to our shareholders. Now, moving to the B2C side of our business.\n\nAs we discussed before, our goal is to use great product innovation and unmatched membership benefits to drive more engagement with our customers and ultimately higher lifetime value from those customers. And the two biggest drivers of lifetime value are improving loyalty membership and app usage. I'm proud to announce that in Q3, we reached an all-time high in active loyalty members, surpassing 2019 levels in August. New Expedia customers that became loyalty members in the quarter grew by nearly 50% versus third quarter 2019 and the rollout of verified loyalty program One Key is on track for next year, which will be a big catalyst for continued membership growth.\n\nOur app downloads continue to be strong as well, but even more importantly the downloaded app usage is at an all-time high with quarterly active app users increasing nearly 40% versus 2019. And in the quarter, we continue to see almost two-thirds of our gross bookings result from direct traffic. We are also continuing to see leverage versus 2019 when we compare our all-up marketing spend against booked gross profit. And as a reminder, this spend includes direct marketing, but also discounting our loyalty spend, which are recorded as contra revenues.\n\nIn terms of our marketing mix, we have been shifting toward longer-term channels, including app downloads and other methods to capture traveler intent outside of classic performance channels. These longer-term marketing investments, including loyalty and brand, are helping us build a larger base of long-term high-value customers. But as important as marketing is, we are ultimately marketing a product, and the product has to be great. So, most of our energy is going into product innovation to build the best customer experience we can with the most customer benefits to drive loyalty and consumer love.\n\nAmong our recent successes, we have introduced exciting new product features, including price tracking, trip boards, and smart shopping, all of which are designed to engage customers, to inform customers, and to ensure they are finding the right product at the right time at the right price. So, just to remind you, our flight price tracking feature, which we launched earlier this year, has been a great engagement tool. Since launch, we have seen exceptionally high notification open rates, which demonstrates the value that our customers see in this tool. This feature is currently live on our app in the U.S.\n\nand is on track for global rollout in the first quarter of 2023. In Q3, we launched trip boards on Brand Expedia, where users can save their favorite lodging and activities and share and collaborate on trip details. This feature not only increased conversion but has helped us expand our base of customers through sharing with family and friends. In the first two months since its broader launch, we saw trip board users have twice the repeat visit rate, they were twice as likely to purchase multiple products, and most importantly, they transacted at four times the conversion rate versus nonusers.\n\nAnd as for smart shopping, which is a tool that really helps travelers comparing and choosing between available rooms for a given property, we began leveraging machine learning recommendations to better match our customers with the right products and options. This has led to better consumer outcomes, more premium product sales for our partners, and ultimately higher value transactions for us. In addition to these new features, during Q3, we finished the migration of the Hotels.com front end onto the Expedia platform, which allowed us to accelerate our optimization programs across our entire conventional lodging portfolio. While we are just getting started, the ability to test and deploy faster across one platform is already driving higher customer conversion, better customer experience, and improved sign-ups to our loyalty program.\n\nSo overall, we've seen a great reception from customers on these new features and benefits. And for us, it has led to increased engagement, better conversion, and higher revenue per customer. I'm really excited about the success we have seen so far, and we have a bunch of new features in the pipeline and a terrific opportunity to roll out all of these features worldwide. Moving on to the B2B front.\n\nWe remain bullish on this massive opportunity and excited about our expanding role in the travel ecosystem. Everything we are doing on the main technology stack for our B2C products will have benefits that inure to the B2B business, as well as a ton of work we are doing specific to the B2B business that will lead to new products, new partners, and new revenue streams. In the third quarter, B2B continued to demonstrate success with growth across our key product lines as we won wallet share with many of our existing partners, driven by our expanded capabilities and improved product offerings. As excited as we are about the momentum in our existing business, we continue to build pilot, and deploy new products and services for our Open World platform.\n\nThis quarter, we signed the first pilot partner for our best-in-class fraud prevention product. And next year, we plan to continue to deliver more new commercial products and services. I'm really excited about what's on our road map for B2B and the reception we've been getting from the industry. So, to sum it all up, we delivered another record quarter of results, rolled out more products, features, and member benefits, and continue to add significantly to our member base and our app usage, all of which will be great for our future performance and build the base that we are looking for to grow in the future.\n\nSo, all in all, we're feeling really good about our progress, not least of all because of the phenomenal team of people we have assembled, to drive all of our acceleration. And with that, I will pass it off to one of our newest, Julie.\n\nJulie Whalen -- Chief Financial Officer\n\nThanks, Peter, and hello, everyone. I'm excited to be here to be a part of the team. As you may or may not know, I've been on the board here since 2019. So, I've had the opportunity to develop a great deal of respect and admiration for the leadership team and the growth strategy that the company is executing against.\n\nAnd I know there is significant opportunity for growth and profitability ahead of us, and I look forward to helping the company to deliver against these growth initiatives and to maximize shareholder returns. As it relates specifically to the third quarter, we are pleased to see the continued momentum in our business, resulting in revenue and profitability to levels we haven't seen before, which clearly speaks to the early success we are seeing with our initiatives to drive long-term profitable growth. As far as the details regarding our financial performance for the quarter, similar to previous earnings calls, I will discuss our revenue-related and adjusted EBITDA growth metrics both on a reported and like-for-like basis. The like-for-like growth rates excludes contribution from Egencia, Amex GBT, and the non-lodging elements of our Chase relationship.\n\nAnd as a reminder, on November 1, 2021, we completed the sale of Egencia, and our EPS business entered into a 10-year lodging supply agreement with Amex GBT. We believe these like-for-like numbers are helpful in assessing the performance of our business. It is also important to note that our third-quarter growth rates as compared to 2019 were negatively impacted by FX headwinds of approximately 200 basis points to gross bookings and revenue and 300 basis points to adjusted EBITDA. Moving on to the gross booking trends in the quarter.\n\nTotal gross bookings were down 11% on a reported basis and down 2% on a like-for-like basis versus the third quarter of 2019. Total gross bookings for the quarter were impacted primarily by the industrywide slowdown we saw in early July. However, since early July, we saw trends meaningfully improved, primarily driven by lodging bookings growth, our largest line of business, with continued ADR strength. Total lodging gross bookings, which were the highest Q3 on record, grew 5% on a reported basis and grew 7% on a like-for-like basis versus Q3 2019.\n\nThe cadence throughout the quarter was consistent with the trends in total gross bookings. Lodging gross bookings on a reported basis was down 1% in July and the rest of the quarter rebounded to up 9% in August and up 6% in September, which was impacted by Hurricane Ian. October was also impacted by the hurricane but was still up approximately 5%. If not for the hurricane, both September and October would have been relative in line with August.\n\nOverall, we are pleased to see strong demand expand into the fourth quarter as consumers continue to prioritize travel spend over other discretionary spending. And while it is still early in the quarter, we are seeing total lodging bookings for stays expected to occur in the balance of the year and into 2023, continuing to outpace 2019 levels. Moving to the key financial metrics in the P&L, starting with total revenue. Revenue of $3.6 billion was up 2% on a reported basis and up 5% on a like-for-like basis versus Q3 2019.\n\nIt was great to see another quarter positive and sequentially improving revenue growth. Our revenue margin also improved to 15% for the quarter or up approximately 190 basis points versus Q3 2019. This revenue strength resulted from a mix shift toward our lodging business, including our higher ADR Vrbo business. Cost of sales in the third quarter was $451 million, which was down 17% versus 2019, driven by cost reductions, primarily resulting from our divestiture of Egencia and from ongoing efficiencies across our customer support operations, resulting from the automation initiatives we have been implementing over the past couple of years.\n\nDirect sales and marketing expense in the third quarter was $1.5 billion, which was up 8% versus 2019, which includes spend with a longer-term return profile to drive more profitable future growth. As a reminder, we are focused on acquiring high-lifetime-value customers. As a result, we are allocating more marketing dollars on channels that have a longer-term return profile such as brand awareness, loyalty, and paid app installs, which, as Peter mentioned, are already beginning to drive growth in loyalty members and app usage. Our sales and marketing expense is also impacted by an increase in commissions paid to our partners, which is a direct reflection of the accelerating growth we continue to see in our core B2B business.\n\nOverhead expenses were $569 million, down $144 million or 20% versus the third quarter 2019. We continue to remain disciplined on our cost structure and are always looking for ways to drive more efficiency. Overhead expenses slightly increased from the second quarter, approximately $19 million or 3%, primarily associated with our ongoing focus on investing in top talent across our product and technology teams to help accelerate our various platform initiatives, which we believe will ultimately drive future top-line growth and margin expansion. These results with another quarter of strong revenue and expense discipline allowed us to deliver our highest quarter of profitability on record.\n\nAdjusted EBITDA grew 18% versus third quarter 2019 and grew 20% on a like-for-like basis to $1.1 billion. The adjusted EBITDA margin was nearly 30%, an expansion of approximately 420 basis points over the third quarter of 2019 on a reported basis. Free cash flow was negative $1.2 billion in the third quarter and over $200 million improvement over prior year due to higher EBITDA levels. As a reminder, the third quarter is a negative free cash flow quarter due to the seasonality of business.\n\nYear to date, our free cash flow remained strong at a positive $3.1 billion, more than double where we were year to date in 2019. On the balance sheet, we ended the quarter with strong liquidity of $7.1 billion from both our unrestricted cash and our undrawn revolving line of credit, which provides us with ample access to cash to operate the business. This quarter, we continue to focus on delevering our balance sheet, improving our leverage ratios, and solidifying our investment-grade rating. As a result, in September, we redeemed an additional $500 million of our senior notes as part of a tender offer, resulting in a total repayment of debt and preferred equity of $3.4 billion over the last 18 months.\n\nThese balance sheet actions, along with our significant growth and adjusted EBITDA, has enabled us the additional flexibility to begin returning capital to shareholders again. As such, we repurchased approximately $200 million or 2 million shares through October and have approximately 21 million shares remaining under our existing authorization for future repurchases. As we move forward, given our strong liquidity, our confidence in the business, and the fact our stock continues to be highly undervalued, we expect to further delever the balance sheet and continue returning capital to shareholders in the form of share buybacks. In summary, our third quarter results demonstrate some of the early wins we are starting to see from the transformation of the business and the success of our strategic growth initiatives.\n\nThese early wins give us confidence that a huge opportunity in front of us to drive long-term profitable growth and to maximize shareholder value. And I couldn't be more thrilled to be a part of this company and this leadership team that we unlock the significant opportunity for growth together. And I look forward to getting to know all of you in the travel investment community soon. And with that, I would now like to open the call for questions.\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Our first question today goes to Eric Sheridan of Goldman Sachs. Eric, please go ahead. Your line is open.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the question. Maybe two if I can. First, in terms of the broader end demand environment, I think there continues to be a lot of investor questions about levels of ADR, as you look out through the December quarter and into next year or elements of how you're thinking about the booking windows more broadly. Any sense you can give us on the way you're thinking about what you see in the business today against elements of potentially more volatile macroeconomic environment as we move into next year? That would be number one.\n\nAnd I appreciate all the color on the capital return. Are there any guardrails we should be keeping in mind around levels of gross debt or net debt that you want to sort of keep front of mind for investors in terms of what might balance prudence versus capital return over the next couple of years? Thanks so much.\n\nPeter Kern -- Chief Executive Officer\n\nThanks, Eric. I'll take the first part first. I think this is consistent with a lot of what you've heard from the travel industry over the last couple of weeks based on what we've seen. But there really haven't been any material signs of falloff in demand or ADR for that matter in the world.\n\nThere is a little bit of geographical mix change. APAC sort of coming back now with the opening of Japan and a few other markets. So, there's a little balanced shift issues and there could be ADR change because of mix for certain players, including us. But there has been no real let-up in ADR, and there has been no real let-up in demand.\n\nWe still see pacings for the rest of this year and next year considerably above where we were in 2019. So, I think there's a lot we all think about and watch CNBC or whatever. But so far, there's really no evidence to suggest there is some bigger macroeconomic thing happening.\n\nJulie Whalen -- Chief Financial Officer\n\nAs far as our capital allocation, I would just say that, first of all, we're pleased that we're in a much stronger position than we've been in the past. We've seen improving profitability. Obviously, I mentioned that we at record levels of EBITDA, has enabled us to generate strong cash flow, strong free cash flow, has enabled us to delever more on the balance sheet and resume our share buyback program, which we stopped a little bit. And so, going forward, given the strength in our position, certainly, this enables us to continue to delever and buy back more stock, which we think is the right thing to do.\n\nCertainly, by delevering on the balance sheet, it fortifies our investment-grade rating and gives us more flexibility to be able to return more to shareholders, which we think is the right thing to do, certainly given the fact that we are very confident in the future growth of our business, that our stock is highly undervalued, and we have strong liquidity, and we have 21 million shares remaining on our existing share repurchase authorization to do buybacks. So, obviously, with that in mind, we think it's the right thing to do going forward.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nJulie Whalen -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. And the next question goes to Naved Khan of Truist. Naved, please go ahead. Your line is open.\n\nNaved Khan -- Truist Securities -- Analyst\n\nYeah. Thanks a lot. Two questions. So, first, maybe just on the expense side of things.\n\nGiven the uncertain macro, how are you thinking about growing the fixed expense over the next 12 months or so? And then maybe just on the -- another sort of macro question. Are you seeing any kind of sort of consumer demand shift in terms of either trade-downs or maybe consumers sort of looking to book maybe drive-to versus fly to kind of destinations?\n\nPeter Kern -- Chief Executive Officer\n\nYeah. Thanks, Naved. So, on the expense side, I would say, as Julie mentioned, we've been trying to hold the line pretty clearly. Obviously, there's been inflation over the last few years, particularly in people and we've certainly invested in people to build all the technology that we want, etc.\n\nBut as I've also mentioned before, we see plenty of opportunity ahead to become more efficient. So, we will keep a pretty tight hand on fixed expenses going into next year. And again, as technology delivers, we think there's lots of opportunity to continue to become more efficient. We think we can drive growth certainly without much more fixed investment and there's more opportunities for efficiency than there are for increased investments.\n\nSo, we are pushing hard to get across the line on a number of technology fronts. We have -- we've built up, in some cases, capacity -- human capacity to do some of that work. But overall, we think that's a general directional move toward greater efficiency. So, will hold the line, but we expect, longer term, more efficiency coming out of the business.\n\nAnd then as far as the often-asked question about consumer demand, the answer is no. We have not seen trade-downs. We have not seen -- we have not seen any major moves, shifts in demand patterns. Obviously, putting hurricane aside, which [Inaudible] and things like that, it's really been a very steady, very strong demand picture.\n\nAs you know, we've been differently selective about the traffic and the consumers we're looking to get and how we're building them up into long-term valuable customers. But overall macro demand seems quite strong still. And as I said, the pacings for next year are strong. So, a lot to still be filled in next year.\n\nBut so far, we haven't seen any of it.\n\nNaved Khan -- Truist Securities -- Analyst\n\nThank you, Peter.\n\nPeter Kern -- Chief Executive Officer\n\nYep.\n\nOperator\n\nThank you. And the next question goes to Lee Horowitz of Deutsche Bank. Lee, please go ahead. Your line is open.\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nGreat. Thanks. Maybe one on sales and marketing. We continue to see that deleverage a little bit, say, quarter on quarter and versus '19 as a percentage of bookings, given your investments in longer-dated ROI initiatives.\n\nI guess my question here is, what sort of time frame should we be thinking about it in order to see the ROI on these investments flow through the P&L and begin to see some of the sales and marketing leverage and some of the initiatives that you've taken across the sales and marketing organization to drive leverage longer-term [Inauidble]? Thanks a lot.\n\nPeter Kern -- Chief Executive Officer\n\nYeah. Thanks, Lee. So, I think the answer to that is we are already seeing benefit, but we are also investing more benefit back into long-term ROI. So, you're sort of not seeing the net benefit, if you will.\n\nBut as -- we believe that as we build that base of customers, as I mentioned, our membership base is now high -- our active membership base is higher than it's ever been and growing faster than it ever has, our app usage likewise. And that all gives us the ability to build more direct traffic, which gives us the ability to invest in driving more direct traffic. Now, those lines will start to separate over time. And we will get, we believe, the margin expansion and the incremental leverage.\n\nBut right now, we're still -- we've still been refilling the bucket to drive, in essence, use this base of high LTV customers to drive as much or more demand that we used to get just by buying traffic out of the marketplace and having them be nonmembers and anonymous customers. So, it's really a transition we're going through, and we think that separation will come, but we are continuing and will continue in the fourth quarter to invest in these longer-dated return opportunities like apps, etc. So, we think we'll continue to see it. We think we're already seeing it, but it's hard to see from the outside.\n\nYou'll see the separation over time as we continue to build that base of members higher and higher and higher. And then as to your question on more broadly, how that affects us? I guess, going forward, I think we will watch that. We put the money back in. But we expect to see expanding leverage in this as we go forward.\n\nI would just add that we have the loyalty program 1Q rolling out next year, that will expand loyalty to many customers who weren't in the program before. We think that's going to drive a lot of business, but it will again drive a little bit of noise as we try to help you figure out where the leverage is. So, just fair warning, like it's a great opportunity. But in terms of like this linear road, it's going to be a little bumpy as we roll some of these things out, and we'll help you understand those as we go.\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nThat's super helpful. Thank you.\n\nPeter Kern -- Chief Executive Officer\n\nYep.\n\nOperator\n\nThank you. And the next question goes to Kevin Kopelman of Cowen. Kevin, please go ahead. Your line is open.\n\nKevin Kopelman -- Cowen and Company -- Analyst\n\nThanks. I appreciate it. A couple of quick follow-ups there. Could you give a little bit more color on how you're thinking about the 1Q launch and the type of investment that will be needed in that launch for next year? And also, as you are thinking about app downloads in longer-term or longer-dated returns on those channels, how long is that when you are acquiring new customers through that channel? Is it six months? Is it a year? How are you thinking about that? Thanks.\n\nPeter Kern -- Chief Executive Officer\n\nYeah. I'll maybe take those in reverse, Kevin. On the -- when we think about LTV, it's over a longer horizon, it's usually 18 to 24 months. So, we're not -- and as you all know, travel for many people is not a, you know, five times a year kind of thing.\n\nIt can be a twice-a-year or once-a-year kind of thing. So, it does take a little longer, as I mentioned before, for some of these LTV investments to return, but that's how we think about that timeline is we're sort of normalizing it over more like an 18- to 24-month period as opposed to six months or something like that. And that's really the trade-off you're making in many cases, is buying that very short-term intent perhaps unprofitably versus buying long-term intent and long-term LTV, but it takes longer to pay out. So, that's the trade we're making with a portion of our investment.\n\nIt's not everything, obviously, but we have directed money that used to be in that short-term intent bucket into these longer-term buckets. So, that's why it takes time. It's why we didn't pivot it all at once because it takes time to build those customer bases that are those high LTV customer bases, that are then paying out at higher levels than the short-term intent that we used to buy. So, that's how we think about that.\n\nIt's a balance, and we're constantly balancing it. As far as 1Q goes, we will launch next year. We will incorporate Vrbo customers among others into the plan. We will try to move customers who are in other brands into the brands that have loyalty.\n\nSo, everything -- we want everybody in the loyalty bucket. The value -- as you know, we've had many different plans of many different values. We will normalize around one single value for everything for the currency. And we think we've settled in a place that will be very good for the customers.\n\nThey're gaining flexibility. They're getting the opportunity to use the value on all our products, which is highly valuable, and we know they want it. And yes, we will have more customers in that base. So, we would expect that base to grow over time.\n\nBut the short-term movements will be sort of the movements between putting Vrbo customers into the base, changing some of the platforms like the Hotels.com platform, the Sam's platform into a points platform, and so forth. And so, there will be some short-term puts and takes. But over time, it's something we think will grow at a rational level. It's not going to spike to some crazy number, it's not going to shrink.\n\nBut it's going to -- we're going to take that capital, deploy it better across our entire customer base. And then hopefully, if it's successful, which we believe it will be, it will continue to build on itself and more people will join. And we think the economics of that are very attractive.\n\nKevin Kopelman -- Cowen and Company -- Analyst\n\nGreat. Thanks, Peter.\n\nPeter Kern -- Chief Executive Officer\n\nYeah.\n\nOperator\n\nThank you. And the next question goes to Deepak Mathivanan of Wolfe Research. Deepak, please go ahead. Your line is open.\n\nZach Morrissey -- Wolfe Research -- Analyst\n\nHey, guys, this is Zach on for Deepak. Thanks for taking the question. Just wanted to talk about Vrbo real quick. Just providing any maybe high-level trends you guys are seeing there? How it came out of the starter travel season and maybe expectations and due to the holiday season? And then sort of related there as well, any trends in ADRs you're seeing for Vrbo?\n\nPeter Kern -- Chief Executive Officer\n\nYeah. Thanks, Zach. I think, you know, our broad comments hold for Vrbo as well. We haven't seen a lot of ADR pressure or anything that's really noticeable.\n\nADRs have held up very strongly and holiday demand is strong and pacing well. We did see disruption. We are -- we have a pretty good base of business in South Florida and the hurricane did some damage, which monkeyed with our September and October results. But -- and we think by now most of that, and it's never 100%, will get replaced into other properties and other spots.\n\nSo, there's a little bit of overhang from losing that supply for a little bit of time. But in general, we're pushing much harder into growing supply now again. We are seeing ADRs hold up. And so, far, the business broadly remains strong.\n\nAgain, you will see pockets of change as the world evolves, as certain -- as APAC opens up versus maybe we all worry about EMEA's economy or something like it. There may be shifts slightly. But broadly, we have not seen anything that is affecting the overall business.\n\nZach Morrissey -- Wolfe Research -- Analyst\n\nGreat. Thank you.\n\nPeter Kern -- Chief Executive Officer\n\nYeah.\n\nOperator\n\nThank you. And the next question goes to Lloyd Walmsley of UBS. Lloyd, please go ahead. Your line is open.\n\nLloyd Walmsley -- UBS -- Analyst\n\nGreat. Thanks. I wanted to go back to kind of the rollout of the integrated loyalty program and just understand the short-term trade-offs versus the long-term payback to the extent you feel like you have visibility on it. Just thinking back to the last time we saw this in 2011 and 2012, scaling up Expedia's loyalty program and globally expanding the Hotels.com program, it did seem to drive a headwind to revenue take rate.\n\nAnd so, with Vrbo not having a program prior to this, it would seem like it could be a take-rate headwind in '23. So, what kind of magnitude should we think about on that side? And then how long will it take to get that to a state where you can sort of wind back the marketing spend and reap the benefits of the rewards of that loyalty program on the positive side? Thanks.\n\nPeter Kern -- Chief Executive Officer\n\nYeah. Thanks, Lloyd. I think the way we think about it is we're going to balance -- we think of our portfolio of tools, including loyalty, regular way marketing, these discounting, and other tools we use to drive sales. We think of that as one pool of capital that we're investing to drive, you know, next year's results.\n\nAnd so, there are some things happening, including the ramp-up of loyalty that we are balancing against other types of investments. So, there is a little noise potentially, as you point out, between take rate, which is the contra revenue stuff above the line versus conventional sales and marketing below the line. But from our perspective, we look at it as one pool of capital, and we are trying to balance the investment and driving that long term. We think that loyalty hook of getting all of those Vrbo members been attached to our other brands and attached to our other products is going to drive a very nice result.\n\nNow it's not instantaneous as you point out, it's not like spending on meta. It takes time. They rack up points, they wait for their next trip, whatever. But we think that's a big benefit in terms of expanding our base of customers, expanding our direct traffic, etc.\n\nSo, yes, there will be some -- there may be some, I guess, I would say, across the P&L, there may be some movement top to bottom is a little more moves into loyalty perhaps when something gets taken out in some of the perhaps direct S&M spend, but we are looking to balance that whole thing. And as we get closer to it, we will give you insight into how to think about looking at the P&L going forward. But in general, we think we will balance it out. It's just that there could be some small movements as we light up the programs and certain programs get changed from one brand to another.\n\nThere may be some balance sheet adjustments for accruals and other things, noise like that. But in terms of driving the real P&L and real cash flow, we think we've got enough things to offset it and some other opportunities to expand margins at that we can pretty much absorb it and chew it up in other places and again, manage that balance as we go forward of driving these long-term investments as against the short-term ones.\n\nLloyd Walmsley -- UBS -- Analyst\n\nYeah. Yeah, that makes sense. It seems like your take rate is below the kind of competitive environment for shorter. So, that seems like one area, and you could pick up for it.\n\nI don't know if that's one of the ideas, but curious anything you could share there. Thanks.\n\nPeter Kern -- Chief Executive Officer\n\nYeah. I think, look, we are under our competitors. We are thoughtful about how we want to deal with that with -- for our host partners and for our consumers, there's volume trade-offs for when you increase take rates as well. So, there's a bunch of things to balance, but we are looking at all of those things and have opportunity.\n\nLloyd Walmsley -- UBS -- Analyst\n\nAll right. Thank you.\n\nPeter Kern -- Chief Executive Officer\n\nYeah. Thank you.\n\nOperator\n\nThank you. And the next question goes to Mark Mahaney of Evercore ISI. Mark, please go ahead. Your line is open.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nThanks. Two questions, please. First, could you just address the issue of whether there are material share shifts going on in North America in the lodging market? And then secondly, I think you just touched briefly in the last question or two on Asia Pacific. To what extent have you -- just any color commentary on -- I think that's sort of the last shoe to drop, so just what that recovery path looks like for that region.\n\nThank you.\n\nPeter Kern -- Chief Executive Officer\n\nYes, sure. Thanks, Mark. I would say to address your first question, some of what we saw in, let's call it, the middle of the summer, and I talked about some of this on our last quarterly numbers, we had -- we were moving platforms. We were doing a variety of things.\n\nWe were -- and pulled back on some discounting and some other things where the competition have been very heavy. We've seen that normalize and we are -- we don't see, if anything, we think we're gaining ground, but there hasn't been a continued erosion. And I think you can see that in the relative growth rates, although, again, we are still being more selective about the business we buy and everything else, we are stable, and others have seen growth rates decline. But -- so we think the U.S.\n\nis pretty stable to slightly in our favor. And again, we believe that as we continue to build this base of business and base of members, which is largely U.S.-driven given our relative strength in the U.S. that that starts to be a repeating underpinning of our business, that drives us up as opposed to just buying in meta, the old-fashioned way that the -- the [Inaudible] ground war took place. So, we think we're setting up quite well for that, and we like our position there.\n\nObviously, we would have liked to not giving up some free room nights, but not all room nights are valuable and not all room nights are profitable and we don't view it as strictly a room night game. But we're setting up well, and we like our position, and that noise has definitely stabilized from when we were doing all the platform transitions. As far as APAC goes, I wish it were a bigger part of our business. It's not a huge part of our business.\n\nWe have a very nice B2B business there that's been largely stifled by the closed APAC market, so as our B2B -- B2C business. And our B2C business, like many parts of the world, is much more internationally driven. So, even though there has been some opening; Japan has opened up; somewhat Korea; China, yet it's been more domestic travel than international. International airlift, Asia is still much more reduced than the rest of the world.\n\nSo, I think we'll see that come back. I think you'll probably see some shift if Europe slows down, you'll see airlift move to APAC if APAC is opening up and you'll see opportunities. Obviously, currency will play a role in where people are willing to go and how far their money goes in different regions. Again, we think that's probably net good for us being relatively heavy in North America where the dollar is strong.\n\nBut again, we expect that to open up sequentially. Hopefully, China will open at some point this coming year, and we have a very good relationship with Ctrip and power a lot of their outbound international travel. So, I think there's opportunity for us, but that is the next shoe to drop. We agree with that.\n\nThat will be the next rising tide, as it were, as we reverse our stories, and the rest of the world will see.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nThank you, Peter.\n\nPeter Kern -- Chief Executive Officer\n\nYeah. Thank you.\n\nOperator\n\nThank you. And your next question goes to Brian Fitzgerald of Wells Fargo. Brian, please go ahead. Your line is open.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nVrbo recently came with its known tech stack and there are different value propositions from the front end versus HCOM and Expedia. But is there more leverage to be gained there? Can we get an update on the progress of back and front of unification work? And then it just seems, Peter, you mentioned trip boards and smart shopping and airfare tracker. Just -- this may be stating the obvious. The rate of iteration or testing or innovation is accelerating.\n\nIs that true now that you have a more homogenized base of technology and tools, and should we expect more of the same?\n\nPeter Kern -- Chief Executive Officer\n\nYeah. I mean, we're pushing in heavily into that. I would segment the last part to say there's testing and optimization work, which is ramping up significantly right now and was what was sort of on hiatus in the middle of the year as we were moving Hotels.com. That's now allowed us to be in a new position to roll out innovation winners, etc., across a much wider base and to test across a much wider base of our consumers.\n\nYour first question, Vrbo, that's still on its own stack. It is next up. It is literally going to start testing traffic on the single platform by the end of this year, before the end of this year. But it will be a gentle -- we mean to disrupt it as little as possible.\n\nBut that, again, will give us potential future innovation. Now, the Vrbo stack and the Vrbo shopping experience is a quite different thing than conventional lodging and shopping, I'm sure you're familiar. So, the ability to test the same types of winners across conventional lodging and Vrbo may not be quite as dramatic. But there are a lot of cross-cutting benefits like trip planning potentially or checkout or other things that will work for multiple products.\n\nSo, it's all on a journey there. Vrbo's the next to go. But I'd say the big benefit on the conventional lodging side, we've gotten across and now we are starting to iterate significantly on. And then the feature part, whether it's trip planning or flight tracking or other things, that's really another category that's like innovating into new ways of shopping, new ways of sharing and collaborating, and we think that's the future of the business.\n\nWe think there hasn't been much innovation in the space. We want to lead in this space. We -- the consumer adoption has been very good. But of course, we've got to get it everywhere on everything.\n\nAnd we've got to keep going. So, we really want to differentiate on the product on benefits of being a member, including loyalty, but also pricing and packaging, and other capabilities. All of that, we think, is what makes the product sticky. We're doing a much better job of it now, but we will do a much, much better job of going into next year.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nThanks, Peter. Appreciate it.\n\nPeter Kern -- Chief Executive Officer\n\nYeah, you bet.\n\nOperator\n\nThank you. And the next question goes to Anthony Post of Bank of America Merrill Lynch. Anthony, please go ahead. Your line is open.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nThank you. A couple of questions for you. First, Peter, you look at -- traditionally, we look at marketing to bookings, and I think you're kind of arguing we should look at gross profit, which is up since 2019. So, can you just kind of help people understand how you're looking at your marketing spend maybe differently than the old management team? And then, Julie, welcome aboard.\n\nI think the stock has been under pressure. There's been a little disappointment that some of the margin improvement that was kind of speculated on after the cost cuts in 2000 hasn't been as evident. Is there an opportunity to kind of -- and maybe not on this call, of course, but in the future, give some guideposts for long-term margins for the company to help the street? Thank you.\n\nPeter Kern -- Chief Executive Officer\n\nThanks, Anthony. I'll take the marketing point first. I can't speak for prior management. I think it is slightly different, though.\n\nThe point I mentioned about thinking of the whole pool of spend on customers, be it loyalty, direct marketing brand, etc. That's how we're looking at it now, which was not entirely held and looked at before. These are all from our perspective, ways to drive transactions, drive value and we're looking at that as a complete pool of spend. So, that's different.\n\nAnd then yes, we think you have to look at it relative to GP because volume by room nights is not relevant, right? It has to be a question of how much GP you're deriving on a given transaction because ultimately, GP is what turns into real margin into a real contribution. So, we are -- if you use that room was $100 and now $200 or our take was $100 on transaction and now it's $200, you're not going to bid the same thing you would bid or invest the same thing you would invest to get a $100 transaction, you'd be willing to invest more to get a $200 transaction. So, you have to look at it at as GP. We recognize it's challenging for the outside world to know what our book GP is but we're trying to express to everybody that that is the -- from our perspective, the right way to look at it.\n\nYou are investing a portion of your profits back into keeping the machine growing. And that is how we look at it. So, I'd say the big differences are we're looking at it at the entire pool, not discrete, like loyalty can be X, but marketing should be Y or it's all about direct marketing as a percentage of revenue, right? That's not the right math from our perspective. But we recognize that it makes it more complex to understand from the outside because booked GP is obviously correlated to booked room nights is correlated to other things.\n\nBut there's noise in it because most of us have here and other things floating through the gross booking lines, and it gets a little confusing. But that is how we look at it. That is how we think it's the right way to look at it. And as I've said a couple of times, it's all for us about balancing this journey into this long-term investment pool without over-indexing to it and giving up too much short-term business but getting there over time because we believe it's absolutely the right answer to long-term profitable growth with higher margins, etc.\n\nSo, that's what we're pushing into, and that's that we totally believe in that model.\n\nJulie Whalen -- Chief Financial Officer\n\nHi, Anthony. Nice to meet you. Regarding your margin comment, obviously, that is something we're very focused on. I mean, certainly, in 2021, we took $1 billion of cost out and that certainly was the start of our hampering improvement.\n\nAnd if you look even through the third quarter today, we're at 30% margin, which is over 400 basis points over 2019 levels. So, we're still holding those cost savings from where they were with some slight movements here and there. But certainly, even as Peter mentioned earlier, we're all about still maintaining efficiency, maintaining a culture of strong financial discipline. And certainly, that's something that I look forward to bringing to the table as well.\n\nIt's something that's in my track record. And so, there'll be things that we're going to continue to look for and drive that margin even higher. And certainly, all the things that we're doing from a strategic growth initiative perspective is all about driving profitable revenue and not just driving revenue at any cost. And so, therefore, we do expect to have margin expansion over time.\n\nI mean, setting a target is always difficult because then you set a target we want to be even higher. So, I think at this moment, we're just focused on growing that margin as fast as we can as a result of all of our strategic initiatives.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. And the next question goes to Tom Champion of Piper Sandler. Tom, please go ahead. Your line is open.\n\nTom Champion -- Piper Sandler -- Analyst\n\nHi. Good afternoon. Peter, I don't know if you could add any comments on the B2B business and the opportunity there. Revenue in the quarter was obviously very strong.\n\nBut just any highlights from your perspective? And then Julie, likewise, it's great to speak with you this afternoon. I'm curious if you could just talk a little bit about what attracted you to the role and the opportunity. You're obviously familiar with the company, but just curious if you could elaborate on that and maybe your areas of focus into '23? Thank you.\n\nPeter Kern -- Chief Executive Officer\n\nYeah. Thanks, Tom. I'll go first. I think B2B has been doing extremely well for us.\n\nWe view it as a tactical way to play in some parts of the world. Where we don't play a B2C business, we view it as an opportunity to grow, grow our number of partners, grow our wallet share, as I referenced, and of course, grow our product offerings. And we've had incremental improvement over the years as we've added things like our wholesale business-optimized distribution, which is expanding quite well. I mentioned we grew wallet share.\n\nWe have many new partners in the pipeline, and we've acquired new partners. We don't announce every one, but it's a continuing expanding base. So, we see a lot of really attractive opportunity. We think there are lots of pockets of demand out there that we have not yet reached and that are challenging to reach without going to those partners directly and those partners view us as an extremely good and safe partner in the travel space to go to because we can do everything.\n\nWe do it well, and they get all the benefits of all our technological advances as we make them. So, we think there's a lot of benefits in that core business. And then as I've said, we've been pushing into this idea of externalizing more of our capabilities as microservices. That's what our fraud test is about.\n\nWe will test many other things this coming year, and we're piloting them with different partners. But it's a real opportunity for us to take our technological advances and bring them to the industry and help create greater efficiency in our partners running their businesses and then ultimately expand the universe of partners who can sell travel. So, that goes to social commerce and other things that have been talked about in other industries, but we're really in a pretty unique position to do that at scale as we roll out these technical capabilities. So, we're extremely bullish there.\n\nWe've expanded and improved our partnerships with many of our biggest supply partners through this kind of technological relationships, and we're feeling quite good about it. Some of this stuff is very early. Those new products are quite early days, and they've got to get perfected and rolled out and then scaled. But that's the pipeline of the future.\n\nAnd in the meantime, our core business and some of the more recent additions like our wholesale business, etc., are expanding quite nicely, and we continue to win business across the globe. So, feeling really great about that business.\n\nJulie Whalen -- Chief Financial Officer\n\nTom, it's Julie. Nice to meet you as well. As far as what attracted me to come here, quite honestly, I have the benefit of being on the board since 2019. And so, because of that, I was able to certainly be involved with the management team that's here and also to be sort of under the covers, if you will, with the strategic opportunities that they were executing against and certainly, of course, like some of the financials and all of the capital allocation policy and things like that.\n\nBut really, the strategic initiatives that I was able to see that they were transforming the business. And some of the things they were doing are just game changers. And some of this, I had actually at my previous company. And once we had some of that, it really enabled the business to take off in a big way.\n\nSo, I knew they were at the pivotal point as the company to launch these changes. And so, I just thought there's tremendous opportunity for growth and profitability of this company, and I wanted to be a part of it. As far as changes that could be coming down the way, I mean, first and foremost, I'm just trying to learn as fast as I can, the details of the company, certainly, as I said, I knew the bigger picture. And so, there's not -- no plans for any major changes shorter term.\n\nBut certainly, if you look back at my track record, which I mentioned earlier, certainly all about strong financial discipline, driving efficiencies, making sure we're generating investments with high returns, and that we have a capital allocation policy that really favors our shareholders. And so, that's something that is certainly going to be behind as we move forward and as this business continues to outperform.\n\nTom Champion -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And the next question goes to John Colantuoni of Jefferies. John, please go ahead. Your line is open.\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nThanks for taking my questions. So, you've been pretty clear about prioritizing customer LTV in your marketing approach. But I'm curious how you're thinking about the opportunity cost of losing out potential customers to competitors as they remain aggressive in driving share gains in your core market. And at some point, does their aggressiveness necessitate a shift in marketing strategy toward some of those lower ROI channels in case it's reducing your opportunity to attract higher-value travelers and also to avoid the unintended impact of your pullback in those channels, helping competitors realize higher ROI because you inadvertently reduced the competitiveness in the keyword bidding environment? And I have a follow-up.\n\nThanks.\n\nPeter Kern -- Chief Executive Officer\n\nOK. Thanks, John. A lot to talk about there. But I would say, at a high level, it's what I've said a couple of times now, which is it's all -- you're right, it's all about balancing that, right? You're making a transition of trying to build a base of customers that actually left your product, have found benefit in your product, and will drive longer-term returns.\n\nThere is a lot of traffic out there every day. I think the industry has proven for decades really that there's a mass of people that are up for grabs every day. The challenge hasn't been buying them. That's just a question of how big a check you're willing to write.\n\nThe challenge has been keeping them. And I think that's been true for everybody in the industry. We're really invested, as you can probably tell in making the product better, making the benefits better, making people stick, and making sure they get the benefit of being with us. But of course, there's a balance to be struck.\n\nAnd we're not suggesting we found a perfect balance, but we're moving across a journey where we think we can get to a place where the core base of long-term valuable customers becomes a new threshold level that you're building on top of. And we also believe as the product improves and as we're better at getting people into membership and into experiencing the benefits that those otherwise cheap, less valuable pieces of business that, you know, we've sort of pursued during this period become more valuable to us over time. In other words, we'll be able to buy let's say, meta traffic or other kinds of traffic more efficiently because we're better at keeping them and turning them into long-term customers. So those things are in flux all of the time, and we are looking to optimize it all at the time.\n\nwe're not looking to throw business to the wild and let somebody else get it, but we're also not willing to just be upside down at any price to buy traffic and prey. So, it's something we're balancing literally every day, and we're continuing to balance. And as we plan for next year, we'll continue to balance. But we think we're directionally right.\n\nWe won't be perfect, but we're directionally right. And as we continue to build up this huge base of members and reduce churn and include more of them through the broader loyalty plan, we think that's going to be incredibly valuable to us. So, we feel good about that trade. But your question is fair, and we look at it every day.\n\nAnd so, that's -- we will keep looking at it every day.\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nThanks. I appreciate that. And you mentioned some more opportunities to drive efficiency over time. Can you just outline some of the more impactful buckets you have for incremental efficiency gains on the fixed cost side? Thanks.\n\nPeter Kern -- Chief Executive Officer\n\nYou know, I think it's twofold, right? It's both driving faster growth, which is getting some of the benefit of the members, etc., that we've been stacking up well these many months and into next year and having that expansion come to more direct business that we don't have to pay to get regained. So, that's where we pay through loyalty, but that's a much smaller cost to us. So, that's a big area of separation, where I think the margin dollars will expand because we won't be paying incrementally all the time for the same business. And then I think on the fixed cost side, there's all kinds of efforts going on.\n\nWe haven't fully optimized the cloud. But we've moved a lot of technology into the cloud, but we have a lot of work to do. We're still synthesizing our data pools to be more efficient around data, all of those things have knock-on effects and costs in compute time and cloud. So, there's a bunch of work going on there.\n\nThere's a bunch of opportunity as we move to this one platform to optimize better, and every optimization is essentially a chance of efficiency, right? It's more conversion, more dollars per transaction, but it's not more people, it's not more anything. It's just better technology, more use of machine learning, etc. So, there's a bunch of big pockets. There's no like, oh, by the way, there's -- I can tell you where $1 billion is hiding, but we spent a ton of money on cloud.\n\nWe spent a ton of money on adding capabilities. And over time, as you do it on one platform, it all becomes more efficient. So, I think it's a lot of little things, but it adds up with our base of people and fixed cost, it adds up significantly over time. We've been able to maintain our headcount at a level we feel good about, and we think we can grow massively on top of that without having to add lots of pockets to be able to do it.\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nThanks. Appreciate the details.\n\nOperator\n\nThank you. And the final question goes to Jed Kelly of Oppenheimer. Jed, please go ahead. Your line is open.\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nHey, great. Thanks for sneaking me in. Just two if I may. Peter, I think you mentioned earlier this year, you had pulled back marketing in some of the European countries because you weren't happy with the ROI.\n\nCan you talk about where the product is for you to lean back into those countries? And then just on Vrbo, just on the supply, can you talk about any benefit you're seeing from higher interest rates and potentially getting more Vrbo supply? Thanks.\n\nPeter Kern -- Chief Executive Officer\n\nYeah. I wish we had a quick-enough twitch muscle to tell you that interest rates are driving homeowners to us. What I can tell you is Vrbo all through COVID and still produces more for homeowner and more for house than any of our competitors. So, I think we're in a great place for homeowners who want to monetize their assets [Inaudible], assuming it's in places that are interesting to us and where we can drive business.\n\nSo, I think we set up quite nicely if you believe in that construct that people need to monetize their homes, their assets, their second homes, etc. Again, we do -- we're not doing a lot of primary home where people move out of their house and rent it for two days or whatever. That's not really our business model. But there is lots of opportunity.\n\nAnd presumably, people are maybe a little less flush with the cost of capital and may want to monetize that. So, I think directionally, it's positive, but it's not that quick switch thing, that we see a massive uplift just because rates increase. But we're pushing into it, and we expect supply to grow meaningfully next year. As far as the marketing question, it goes back really beyond this past year.\n\nI mean, we saw a lot of pockets where we were overinvested, weren't getting the return, weren't getting the long-term return that even made sense of what we were investing to buy traffic in some parts of Europe and other places, and we ratcheted that back. We found this, as I mentioned, as we keep rebalancing, sometimes we're finding opportunity to push back in some of those places. So, it's not -- it's not like there's a line in the sand, and we got to it and we're staying there, like we pulled back and then we saw opportunity, and in some cases, we pushed in a little bit more. But I think broadly, at the heart of your question, which is right, we want to be lined up with all the right product capabilities to go after a market fully.\n\nAnd right now, we're sort of perfecting our product in North America in terms of how everything works, how loyalty rolls out, how people get signed up, how we engage them with CRM, and everything. And that's a model we then want to repeat. Now, many big markets across the globe, we have many of those things. But we have a very focused idea of we're going to get the product set up end-to-end, then we're going to go hard after markets, and then we believe we can win with the strategy that we think is winning right now here.\n\nSo, we'll keep pushing on it. And we're not there yet. But I think as we get into next year, we will have a much clearer idea of where you'll see us, take some more aggressive action in certain markets where we think there's opportunity. Of course, there's some macroeconomic noise to watch out for there because there may be markets we want to get aggressive in that may have economic challenges.\n\nSo, we'll have to balance all of those things. But that is our approach to it. We want the end-to-end product to be great. We want the loyalty and all the pieces to be there.\n\nAnd when we have like our full suite of weapons, we're going to go at these markets one by one and try to win.\n\nOperator\n\nThank you.\n\nPeter Kern -- Chief Executive Officer\n\nThank you, everybody. I think that's it so-go ahead, operator. sorry.\n\nOperator\n\n[Operator signoff]\n\nPeter Kern -- Chief Executive Officer\n\nThank you, everyone. Take care.\n\nDuration: 0 minutes\n\nHarshit Vaish -- Senior Vice President, Corporate Development, Strategy, and Investor Relations\n\nPeter Kern -- Chief Executive Officer\n\nJulie Whalen -- Chief Financial Officer\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nNaved Khan -- Truist Securities -- Analyst\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nKevin Kopelman -- Cowen and Company -- Analyst\n\nZach Morrissey -- Wolfe Research -- Analyst\n\nLloyd Walmsley -- UBS -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nTom Champion -- Piper Sandler -- Analyst\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nJed Kelly -- Oppenheimer and Company -- Analyst\n\nMore EXPE analysis\n\nAll earnings call transcripts"
}