{
  "companyName": "IBEX Limited",
  "companyTicker": "IBEX",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/23/ibex-limited-ibex-q4-2022-earnings-call-transcript/",
  "content": "IBEX Limited (IBEX -0.88%)\nQ4 2022 Earnings Call\nSep 22, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the IBEX fourth quarter and fiscal year 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator instructions] To note, there is also an accompanying earnings deck presentation available on the IBEX Investor Relations website at investors.ibex.co.\n\nI will now turn this conference over to your host, Ms. Brinlea Johnson with The Blueshirt Group.\n\nBrinlea Johnson -- Investor Relations\n\nGood afternoon, and thank you for joining us today. Before we begin, I want to remind you that matters discussed on today's call may include forward-looking statements related to our operating performance, financial goals, and business outlook, which are based on management's current beliefs and assumptions. Please note that these forward-looking statements reflect our opinion as of the date of this call, and we undertake no obligation to revise this information as a result of new developments, which may occur. Forward-looking statements are subject to various risks, uncertainties, and other factors that could cause our actual results to differ materially from those expected and described today.\n\nFor a more detailed description of our risk factors, please review our annual report on Form 20-F filed with the U.S. Securities and Exchange Commission on October 14, 2021. With that, I'll turn it over to Bob Dechant, CEO.\n\nBob Dechant -- Chief Executive Officer\n\nThank you, Brinlea. Good afternoon, everyone, and thank you all for joining Karl and me today as we share our fourth quarter and fiscal year 2022 results. FY '22 was a record year across multiple fronts, including revenue, EBITDA, net income, EPS, free cash flow, and new client revenue. We accomplished this in the face of continued pressures related to COVID-19 and an increasingly volatile market.\n\nWe have demonstrated that we can execute and deliver results during the most difficult times and our momentum continues to build. In the last three consecutive quarters, we accelerated revenue growth to 15%, which is well above our historical 10% rate. And we achieved our revenue guidance for the fiscal year 2022. Our EBITDA margins continue to expand over the same period.\n\nAnd we are proud to report we achieved 15.1% EBITDA margin in the quarter, a record for the fourth quarter on a year-over-year basis. At the core of IBEX is our powerful new logo engine and our ability to land and expand these partnerships. FY '22 was a banner year as we won 23 great new clients. IBEX has a unique ability to win new business with both large digitally transforming blue-chip clients and pure-play new economy, digitally first brands.\n\nWe continue to successfully compete against both multibillion-dollar companies, as well as new economy-only focused providers. These attributes are enabling us to navigate well through the current market conditions as our clients continue to look to outsource more. IBEX is winning because our differentiators are impactful. There are many elements to our BPO 2.0 capabilities that continue to resonate well in the market.\n\nOur Wave X technology stack is a key enabler for IBEX to consistently outperform our competitors. Our agent-first culture is simply the best in the markets where we operate. This allows us to attract and retain great brand ambassadors, which is another key ingredient for us to perform well for our clients. Our world-class contact centers are complemented by creative client branding on the production floor, creating a tight link between IBEX and the great brands of our clients.\n\nAdditionally, our current and prospective clients see an exceptional management team that is leaned into the business and one that is fast and flexible. These are the capabilities they are looking for. That's who IBEX is. These traits enable our continued delivery of key client wins, rapid speed-to-green performance, and market share gains away from our competitors.\n\nThe result is a transformed business in terms of client diversification, key vertical growth, and strategic geographic expansion that will continue to strengthen as our new logo engine gains even more speed. As it relates to geographic expansion, if you recall, we made a strategic decision to aggressively build out capacity throughout the pandemic, while operating in a socially distant environment. I am pleased to report that we now have resumed to a pre-pandemic operating model in all of our regions. And as a result, we have over 10,000 seats to sell into.\n\nWith this additional capacity and our sales pipeline at an all-time high, I'm very excited about our growth and margin trajectory as we head into FY '23. Q4 was a very strong quarter for IBEX. We delivered organic revenue growth of 13.6%, EBITDA margin of 15.1%, and generated $25 million in free cash flow. Our revenue generated from new clients won since FY '16, our BPO 2.0 clients, continue to grow at an impressive rate of 43% for the quarter.\n\nThis powerful growth exemplifies not only our ability to attract and win with elite high-growth clients but also our strategy to expand our solutions and become a trusted, differentiated partner. I'm most excited that these new customers now make up 74% of our total company revenues as we exited Q4, up from 59% a year ago. Our revenue growth is driven primarily by the continued success of our new logo engine which sells differentiated BPO 2.0 solutions to many of the world's best brands. This quarter, we won four new clients across our key verticals for a total of 23 new clients for the fiscal year.\n\nThis cohort of new clients generated approximately $50 million of in-year revenue, up 67% from our previous high in FY '21. And we expect these clients to generate well over $100 million in FY '23. We have done an amazing job in our strategic verticals of HealthTech and FinTech, which includes both new economy brands, as well as traditional blue-chip companies. These two key verticals now represent over 30% of our business, up from approximately 20% in Q4 FY '21.\n\nIf you recall, we began targeting these verticals in FY '20, and to build this organically to greater than 30% in three years is not only a remarkable accomplishment but a testimony to our team. And the new logo engine continues to run full throttle into FY '23. I am delighted to announce that we just signed a very exciting contract with one of the largest healthcare companies in the world for a sizable launch scheduled for the Philippines in October, where we will provide member services for Medicaid subscribers. We expect this client to grow into one of our largest clients over the next several years.\n\nAnother key vector for our revenue growth is expansion with our embedded base clients where we continue to land and expand, resulting in increased market share. As a representative example, we won and launched a major Fortune top 10 client in the beginning of FY '22. Twelve months later, we have displaced two multibillion-dollar competitors and now have 100% market share to complement their captive centers. They are now one of our top 10 clients, demonstrating our ability to scale and outperform.\n\nAs a result of our new client wins and expansion within key verticals, we have created a business where our client diversification is among the industry best. Compared to Q4 in fiscal year 2021, our top five customers now represent 37% of the revenue, down from 45%. Our top 10 customers represent 55% of total revenues versus 63% and our top 25 customers now represent 83% of revenues, down from 89%. IBEX has a great brand with our employees and a very strong reputation with our clients.\n\nTo this point, we recently completed net promoter surveys with both our employees and our clients. I'm delighted to inform you that our employee NPS is among the industry best at 71. This is a testament to our unparalleled employee engagement and culture. As an example, in August, we held our regional agent VIP event in Jamaica for over 500 of our best performers.\n\nWe hosted them for a two-and-a-half-day event at a local resort, where my leadership team and I together celebrated their successes. Social media was on fire with the IBEX brand as everyone witnessed the unique environment, an agent-first culture of IBEX. As part of our IBEX Cares initiative, this group of 500 top-performing IBEXors worked side by side with me and my leadership team, painting an underprivileged school, donating books, toys, and money, as well as cleaning up a local beach. I am and continue to be extremely proud of our team.\n\nThe IBEX brand continues to get stronger in the markets where we operate. A prime example of this, we won Best Places to Work in the Caribbean and Latin America three years in a row and best places to work for women in back-to-back years. Additionally, I am proud of our deep client relationships and our track record of becoming a trusted partner to the world's best brands. Our recent client NPS survey results yielded a top-quartile score of 65.\n\nThis is a validation of the client partnerships we have built into our ability to deliver on our promises and outperform the competition. Moving on to profitability. Adjusted EBITDA margins improved sequentially this quarter to a very healthy 15.1%. Our last three quarters have shown EBITDA margin expanding from 10.6% in Q1 to 13.5% in Q2, 14.6% in Q3, and now north of 15% in Q4.\n\nThis was accomplished while we strategically exited a legacy relationship with our lowest margin client and replaced it with an exciting high-growth HealthTech client who we are now servicing in two geographies. This pivot which started and ended in the quarter had transition costs that impacted both revenue and margin in Q4, resulting in us narrowly missing the low end of EBITDA guidance. However, we believe this will result in a long-term benefit to the company beginning this quarter in FY '23. We are also encouraged about the outlook of margin improvement.\n\nThe majority of our growth continues to occur in our high-margin regions with digitally focused BPO 2.0 clients. And now we have an enviable position of significant capacity to sell into as a result of the removal of social distancing requirements. With this in mind, we expect to realize meaningful margin improvement as we sell into this capacity. Over the last two years, through foresight and planning for expanded growth, we built out world-class capacity to sell into for our clients.\n\nAnd we believe this capacity will accommodate accelerated growth from our both new and existing clients. As such, we believe we have reached our peak spending. And we expect to see significantly lower capital needs going forward to support our growth. As we foreshadowed in previous calls, this will result in a meaningful inflection in our free cash flow.\n\nIn fact, our free cash flow for the fourth quarter was $25.1 million, up from negative $3.2 million a year ago last quarter. Karl will provide more details into free cash flow into his section. We ended the year with a strong balance sheet of $49 million of cash, which in a turbulent market is a desirable position to be in. We believe M&A can and will be an important part of our growth and differentiation strategy going forward.\n\nWe continue to look at acquisitions that will be accretive to the business. We believe our strong balance sheet positions us well once we evaluate the right opportunities. Looking forward to FY '23, we are confident that we have built a business where revenues will accelerate beyond our historical rates and margins will continue to expand. Our success on client diversification and strategic vertical expansions has positioned us well in today's market as we have less exposure to any one client or any one vertical.\n\nTherefore, in FY '23, we expect revenue to be in the range of $545 million to $555 million, representing a year-over-year growth of 11.4% at the midpoint. We anticipate EBITDA to be in the range of $77 million to $79 million, representing a margin of 14.2% at the respective midpoints, up from 13.5% in FY '22. Additionally, we expect capex to be between $18 million and $22 million for the year. While we have not given quarterly guidance in the past, I believe with all the market turbulence that it would be appropriate and helpful to discuss Q1 FY '23.\n\nFor Q1, we expect revenue to grow to a range of $124 million to $127 million, with a midpoint growth of 15.6% versus prior-year quarter and adjusted EBITDA of $16.5 million to $18.5 million, resulting in an EBITDA margin of 13.9% at the respective midpoints. Our business has great momentum. And we are very excited about the future buybacks into FY '23 and beyond. I will now turn the call over to Karl to go into more details on the financials.\n\nKarl?\n\nKarl Gabel -- Chief Financial Officer\n\nThank you, Bob, and good afternoon, everyone. Thank you for joining the call today. We had a strong year with record results in top-line revenue and net income growth and adjusted EBITDA. The demand for our solutions continues to increase both organically with our existing clients and through new logo wins.\n\nOur client diversification is a strength and continues to improve as we added new high-profile HealthTech, FinTech, and retail e-commerce clients over the course of the year. I'll start with a review of our fourth quarter, followed by fiscal year '22 financial results. In my discussion, references to revenue, net income, and net cash generated from operations are on an IFRS basis, while adjusted net income, adjusted earnings per share, adjusted EBITDA, and free cash flow are on a non-GAAP basis. Reconciliations of our IFRS to non-GAAP measures are included in the tables attached to our earnings press release.\n\nFourth-quarter revenue increased 13.6% to $123.7 million, compared to $108.9 million in the prior-year quarter. We continue to experience high growth in our cohort of clients won since fiscal year '16, particularly in HealthTech and FinTech, retail and e-commerce, and travel, transportation, and logistics verticals. This cohort grew by 43% over the prior-year quarter and now represents 74% of our total revenue versus 59% in the prior-year quarter. The above revenue growth was partially offset by continued decreases related to our legacy free clients, which now represent only 15% of our total revenue.\n\nDuring the quarter, the company strategically replaced one legacy client with the new fast-growing HealthTech client. The transition suppressed revenue by $3.9 million and negatively impacted margin compared to last quarter as we moved our agents to this new high-growth launch. Net income increased to $4.9 million versus $4 million in the prior-year quarter. The increase in net income was primarily driven by stronger operating results, including a decrease in nonrecurring costs and a deferred tax benefit recognized in the current quarter, partially offset by increased depreciation and a negative impact from fair value measurement of share warrants.\n\nOn a non-GAAP basis, adjusted net income increased to $7.9 million, compared to $5.8 million in the prior-year quarter. Non-GAAP fully diluted adjusted earnings per share increased 35% to $0.42, compared to $0.31 in the prior-year quarter. The increase in adjusted net income and adjusted fully diluted earnings per share was primarily driven by stronger operating results and a tax benefit recognized in the current quarter, partially offset by increased depreciation. Adjusted EBITDA increased to $18.7 million or 15.1% of revenue, compared to $15.9 million or 14.6% of revenue for the same period last year.\n\nThe increase in adjusted EBITDA margin was primarily driven by growth in our new clients since fiscal year '16, along with continued revenue growth in higher margin near shore and offshore regions, offset by costs associated with ramping a new HealthTech client in the current quarter. Net cash generated from operations was $27.8 million for the quarter, compared to $1.8 million in the prior-year quarter primarily due to higher collections, stronger operating results, including lower nonrecurring expenses, and lower cash taxes. Our DSOs continue to be well below the industry average. In the fourth quarter, our DSOs improved to 55 days, down one day year over year, down five days sequentially.\n\nWe reduced total capital expenditures to $2.7 million or 2.2% of revenue in the fourth quarter of fiscal year '22 versus $5 million or 4.5% of revenue last year as we began utilizing our open capacity we have as a result of the removal of social distancing requirements. Non-GAAP free cash flow increased to $25.1 million in the current quarter, compared to negative $3.2 million in the prior-year quarter. Fiscal year '22 revenue increased 11.2% to $493.6 million compared to the prior year. This is our shift to the digital-first marketplace in fiscal year 2016, the clients we have won since then make up more than $342 million or approximately 69% of our fiscal year '22 revenues.\n\nNew clients launched in fiscal year 2022 contributed approximately $49 million in revenue in the year. Revenue related to our remaining legacy clients in Q4 fiscal year '22 was approximately $17 million. And we currently expect it will continue in that range going forward. Net income for the fiscal year was $23 million, compared to $2.8 million in fiscal year '21.\n\nThe increase in net income was primarily due to stronger operating results, including lower nonrecurring expenses, a positive impact from the fair value adjustment of warrants, a decrease in share-based payments expense, and a deferred tax benefit, partially offset by higher depreciation related to our capacity expansion over the last two years. Our annual effective tax rate on a normalized basis, excluding the effect of the warrant fair value adjustment and the one-time deferred tax benefit of $4 million was approximately 10% in fiscal year '22, which is down from 13% in fiscal year '21 as a result of our ongoing tax planning efforts. On a non-GAAP basis, fiscal year '22, adjusted net income was $24.6 million versus $23.6 million last year, and fiscal year '22 adjusted fully diluted earnings per share was $1.32 versus $1.28 in the prior year. The increase in adjusted net income and adjusted fully diluted earnings per share was primarily driven by lower taxes, partially offset by higher depreciation in the current fiscal year.\n\nFiscal year '22 adjusted EBITDA increased to $66.8 million or 13.5% of revenue, compared to $66.2 million or 14.9% of revenue in the prior year. The adjusted EBITDA margin decreased compared to the prior year primarily due to costs associated with ramping new business, particularly in the first and fourth quarters of fiscal year '22. For fiscal year 2022, our top five client concentration decreased to 39% from 50% of overall revenue last year, exiting the year at 37% in the fourth quarter. Our top 10 clients now account for 57% of total revenue, down from 70% in the prior fiscal year.\n\nWe have worked hard to diversify our client base and are proud of the progress we've made this year. Switching to verticals. Retail and e-commerce increased to 19.4% of annual revenue versus 18% in the prior year. Fintech and HealthTech increased to 26% of annual revenue versus 14.6% in the prior year.\n\nAnd travel, transportation, and logistics increased to 13.4% of annual revenue versus 10.2% in the prior year. Adversely our exposure to the Telecommunications vertical decreased to 18.1% of annual revenue versus 29.3% in the prior year. Net cash from operations was $50.1 million for the year ended June 30, 2022, compared to $25.9 million in fiscal year 2021. The increase was primarily driven by stronger operating results, including lower nonrecurring expenses, improved working capital, and lower cash taxes paid in fiscal year 2022.\n\nThe capital expenditures were $25.9 million or 5.3% of revenue for the fiscal year '22 versus $20.8 million or 4.7% of revenue last year. Non-GAAP free cash flow increased to $24.2 million from $5.1 million in the prior year. Free cash flow increased as a result of higher net cash provided by operating activities, offset by an increase in capital expenditures over the prior year as we continue to invest primarily in near-shore capacity expansion. The company measures capacity utilization, including both agents working at home and on-site against total workstations.\n\nCapacity utilization decreased to 69% from 77% in the prior year as we continue to invest primarily in near-shore expansion while experiencing lower utilization relates due to pandemic-related restrictions, which have now been lifted in all regions. This will free up approximately 10,000 seats, which we can deploy for our robust revenue backlog in the coming year. We ended the fiscal year with $48.8 million in cash, down from $57.8 million in the prior year. Total debt was $104.7 million, including total borrowings of $15 million and lease liabilities of $89.7 million, down from total debt of $112.5 million as of the prior year.\n\nBorrowing availability under our revolving credit facilities was $50.5 million at June of 2022, compared to $33.6 million in the prior year. In closing, our business has great momentum. We continue to grow at a record pace and steadily expand our current base of business across multiple geographies. We remain extremely confident about the growth of our business and look forward to a strong year ahead.\n\nWith that, Bob and I will now take questions. Operator, please open the line.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Tobey Sommer from Truist. You may proceed.\n\nTobey Sommer -- Truist Securities\n\nThanks. Well, you talked about your sales pipeline being quite good. I was wondering if you could describe what the front of the top of the sales funnel looks like in terms of client behavior certainly relative to news flow and capital markets, there's volatility being expressed. And I'm wondering if there's any change in the top-of-the-funnel metrics in your sales process.\n\nBob Dechant -- Chief Executive Officer\n\nSure, Tobey, and thanks for that question and really kind of a very thoughtful considering where things are today. Look, I think the overall pipeline, as I said, is at an all-time high and really strong. But as you peel back the onion, and this is part of what we like in our position across multiple verticals with big blue chips, as well as some new economies. We are seeing a lot of fast deal flow, especially from the blue chips that are evaluating their current scenarios, their current captives, their current business that they have that are struggling, keeping those things operating and needing outsourcing to fill the gap on a fairly fast basis.\n\nAnd typically, because they know the pressures that exist in the U.S. market, we're seeing a lot of demand in, what I'll say, in our near shore and Philippine market. As an example, the very, very large healthcare provider. Originally, we were pretty close and in discussions with the U.S.\n\nlaunch, and then that pivoted late into that deal cycle for an extremely aggressive Philippine launch. And I think that's very representative. So, we feel that the pipeline is very strong. It will come in a lot of different fronts.\n\nBut we really like our position where we have our irons in the fire across multiple fronts. And we think decisions are being made relatively fast as a result of that.\n\nTobey Sommer -- Truist Securities\n\nI appreciate that. Thanks. Could you give us a little bit of color on the pace of what you expect for cash flow in fiscal '23? And I kind of ask that in the context of being pleasantly surprised at the cash from ops in the fourth quarter itself?\n\nBob Dechant -- Chief Executive Officer\n\nSure. Let me touch on the kind of the broad part. And then, Karl, if you want to then add in, feel free to do that. And we've been saying this, Tobey, for a while, that we aggressively -- the business was there, we aggressively built out in a socially distanced environment.\n\nSo, if we launched a 1,000-seat center, we were able to only use 500 seats with that. And with the growth that we had and have had, there was a lot of capex that we use. Now, we said when we will hit that inflection point at some point, we didn't know when. And then really, as we got to March and April, our markets all opened up.\n\nAnd now you see the power of the business that we built from a free cash flow standpoint. Now, as we think as into FY '23, we're looking at a fairly low capex spend for the year and very good EBITDA year. And so, when you put those together, we feel the outlook not only in '23 but also the size of the capacity we have, we look at that into '24 and also spilling it to 25. We think we are in a high cash kind of free cash flow generation here over the next quite some time and we're really excited about that.\n\nKarl, you may want to add some color.\n\nKarl Gabel -- Chief Financial Officer\n\nSure. Sure, Bob. Just to add to that, I'd say that, as Bob mentioned earlier, we hit our free cash flow inflection point in the back half, specifically in Q4. And if you look at the drivers that are -- while we don't give free cash flow guidance, but the guidance we do give indicates continued improvement, higher adjusted EBITDA and margins, lower capex.\n\nAnd I think the other point I'll just hit on that Bob didn't hit on is just the DSOs. We continue to focus in on DSOs with the company for working capital management and that is part of the free cash flow equation.\n\nTobey Sommer -- Truist Securities\n\nOK. Thank you very much. I'll get back in the queue.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Ryan Potter with Citi. Citi.\n\nYou may proceed.\n\nRyan Potter -- Citi -- Analyst\n\nHey, thanks for taking my question. I wanted to start on your new economy of client exposure. I was wondering if you first could remind us what your current exposure that is there in terms of percent of revenue, and then also what trends you've been seeing recently in your new economy clients, particularly as funding level have reduced for more start-up-tech companies?\n\nBob Dechant -- Chief Executive Officer\n\nYeah, so good question. And if we look at our new economy clients as a whole, I think that number, Ryan, maybe we'll get back to you on that, the exact total number. But when I drill down on the respective verticals that sit inside that or sub verticals, the one market that we have that we've done a really good job of winning in is in the crypto world. And so -- but that is much smaller.\n\nThere's other competitors of ours that have heavy exposure in the crypto world. And so, ours was probably about 5% of total as the crypto world kind of went upside down. And so, when I think of our current position with the new economy players, that's really the one market that we're seeing, I guess, what I would say, kind of sizable softness. But for us, our exposure has been only 5% in that.\n\nSo, we don't feel that any of those areas are going to impact what I think is -- what is a strong growth engine, really driven by the diversification of our clients, our segments, our winning with blue chips, our winning with, I think, leading new economy folks. And so, I feel very good. I feel that we've done an amazing job in building a very diversified business on all fronts.\n\nRyan Potter -- Citi -- Analyst\n\nGot it. And then I guess shifting gears to the talent and supply side. What are you seeing in terms of wage inflation and attrition trends? Have they begun to stabilize? And then also could you give an update on where you are in terms of return to office footprint overall? Like how many of the 10,000-seat capacity that you guys opened up can be kind of backfilled by employees returning to office versus hiring new employees?\n\nBob Dechant -- Chief Executive Officer\n\nYeah. So, let me touch the second part first because that's a really kind of important part of our business. So, we obviously went aggressively with work at home during the pandemic. And that started to reel back in over, let's say, the last four quarters.\n\nAnd today, we're about 20% work at home. We had a choice when these markets opened up to say we're going to push all those agents back into the centers to allow us to kind of maximize utilization in those centers or keep them at -- in a work-at-home environment. We chose to keep the lion's share of our people in a work-at-home environment because -- and many of my competitors have highlighted this that when they force their folks to go home -- go back into the center, attrition, agent attrition went through the roof. So, our attrition hasn't really moved significantly over this time frame because we kept our people in the environments that were.\n\nNow, the beauty of that for us is now we have all this capacity rather than moving all the people in and then utilizing a lot of your capacity for, call it, in that like-for-like and flat revenue. So, I think that decision is a great decision for our people, for our agents, for attrition, and then as a result, your costs associated with that. Now, on your first part of your question, certainly, wage inflation, wage pressures exist in all markets. And certainly, the U.S.\n\nwould be -- I think would be the market that has the most pressure. But we've done an amazing job in their selling to clients with high agent wage rates. And so, we are driving great results in the U.S. margins moving up, etc., kind of as a result of really that partnership with clients and the business we're attracting.\n\nIn some of the other markets, we see some wage pressures. Just to give you an idea, they would be -- and so we've had to do some wage adjustments at an agent level but nothing of major, so certainly less than 5% wage adjustments, probably more in the 3% adjustments. And the good news is the dollar has been extremely strong in those markets. So, we've insulated ourselves from an FX standpoint.\n\nBut more importantly, we've insulated ourselves from a client standpoint, where we've negotiated COLA increases in many of our contracts or we've negotiated successfully with clients outside of COLA provisions kind of outside of those timelines. And we've been very successful in getting appropriate price increases that allow us to move the wages. So, if you put all of that kind of in the mixer, I think the end result is -- will be stronger margin coming out of this business as a result of all of those elements.\n\nRyan Potter -- Citi -- Analyst\n\nGreat. Thanks again.\n\nOperator\n\nThank you. One moment for questions. Our next question comes from Robbie Bamberger with Baird. You may proceed.\n\nRobbie Bamberger -- Baird -- Analyst\n\nYeah. Thanks for taking my question. So, you're expecting about 15% growth in Q1, and then it seems like about 10% in Q2 through Q4. Is that deceleration just because of tough comps? And should we expect sort of the normal seasonality that we've seen typically where it's about the highest revenue in Q2 and then maybe mild deceleration, sequential deceleration after that?\n\nBob Dechant -- Chief Executive Officer\n\nYeah, Robbie, that's a good -- you know, it's a good question. Look, there's a lot of turbulence in this market and volatility, right? And so, our goal is to continue. So, just think about the last three quarters. If you put all that together, we were at about a 15% growth and we're seeing roughly that for this Quarter 1.\n\nOur goal is to push toward that. But just with a lot of turbulence in this market, we've just kind of taken a -- what, I guess, what I would say is a bit of a conservative approach on this, let's say, rather than leading with your chin, which we've seen that happened. And so, I think your math plays out right. But I think it's driven by us just kind of sitting and saying, with that volatility, let's make sure we're kind of just thinking through this conservatively.\n\nRobbie Bamberger -- Baird -- Analyst\n\nYeah, that makes sense. And then maybe on the largest healthcare client that you talked about, it seems like it's expected to grow into one of your biggest clients in the next few years. Are there other higher value-added services, it seems like, you're providing them? And can you maybe expand a little bit on those and if you could provide those to other healthcare companies or other companies outside of this company as well?\n\nBob Dechant -- Chief Executive Officer\n\nSure. And so, Robbie, while I -- let me just maybe add one other asterisk. So, this new client we announced that we won this quarter, the prior moved and the HealthTech client that we pivoted to, that client will be a top five client in this fiscal year. So, we're really excited about the traction we have in the healthcare, one landed in FY '22 in the second half of FY '22 will be a top five client in this year.\n\nNow add on that, now this healthcare provider. And this is one of those that we've been working with for several years. And we finally were able to break through with this provider as they finally said, and this is a really important point because we are winning against many multibillion-dollar players. The client finally said, we're ready to move to something that looks radically different, and IBEX fit their fit-the-bill.\n\nNow, our whole solution in healthcare spans revenue cycle management, member services things like that. So, a wide range, appointment schedule, so there's a wide range of solutions that we are providing in this space. With this client, we believe, and you know our largest client that we have and the diversification that we have with our current largest client, we believe that there's many lines of business, many services that we're going to use that as a model to try to drive to. And so, I feel very, very good about our footprint, our technology, and our ability to kind of very disruptively serve this client versus some of their legacy incumbents.\n\nThat recipe has worked in a big way multiple times, and I expect it to do the same here.\n\nRobbie Bamberger -- Baird -- Analyst\n\nGreat. Yeah. Thank you very much.\n\nBob Dechant -- Chief Executive Officer\n\nYeah. Thanks, Robert.\n\nOperator\n\nThank you. And our last question comes from Arvind Ramnani with Piper Sandler. You may proceed.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nHi. Thanks for taking my question. You know, most of them have been answered. But just a question on how much of your revenue is exposed to kind of transactional volume? For instance, if you have lift, I think, is an example you used before.\n\nI'm sure there's a certain amount of revenue you get from kind of resolving certain issues on lift. So, if you could just kind of outline how much of your revenue is exposed to transaction? What I'm really trying to get to here is like if you get into a tough macro and some of your volumes impacted because of transactions, but your contracts are intact. How much of downside would that really kind of suggest?\n\nBob Dechant -- Chief Executive Officer\n\nYeah, very thoughtful question, Arvind, and thank you for that. And look, between a lot that we do in the retail worlds and then, let's say, in the ridesharing world or some of these other areas in today's world, those are consumers. And those are consumers that are reaching out for service and support, whether it's kind of, you know, where's my stuff or whatever. And so, that's transactional.\n\nNow, let me give you a couple of examples. So, I highlighted in my remarks, if you heard those about in the -- with the Fortune 10 client that is big in membership, transactional and their volumes were a little bit under pressure. Well, we were outperforming. We were out -- as a result, we were then able to take market share into the market share to where we displaced fully displaced two multibillion-dollar providers to grow our business with an overall enterprise that's shrinking.\n\nI could go down my top 10 client list and articulate that same thing playing out multiple times with very, very large e-commerce providers. And so, in this space right now, even where there are challenges, be based on our ability to outperform the health of our relationships. And just the way we move fast, flexible, the fact that we actually went aggressively in build-outs when my competitors didn't, we're grabbing market share by grows out of these folks. So, on an overall macro sure, you get concerned about that.\n\nBut the DNA of these clients are, we're going to take out our bottom performers and give that business to our top performers. And I'll take that value proposition all day long because that's how we're winning huge market share inside those clients. Arvind, I don't know if there's a follow-on to that at all or -- but -- so certainly, we keep focused on it. But we really like our position on being able to keep our top line growing by grabbing market share even if the enterprise is shrinking.\n\nThat's probably the most important element.\n\nOperator\n\nThank you. And I'm not showing any further questions at this time. I would now like to turn the call back over to Bob Dechant for any further remarks.\n\nBob Dechant -- Chief Executive Officer\n\nGreat, Josh. Thanks very much and thank you all for joining us again. We're excited to be out in front of you all. We just love the position that we're in this business that we've built.\n\nAnd I think FY '23 you're going to see this momentum continue to go extremely strong. Thank you all for your continued interest and commitment into IBEX. Thanks. See you all.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrinlea Johnson -- Investor Relations\n\nBob Dechant -- Chief Executive Officer\n\nKarl Gabel -- Chief Financial Officer\n\nTobey Sommer -- Truist Securities\n\nRyan Potter -- Citi -- Analyst\n\nRobbie Bamberger -- Baird -- Analyst\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nMore IBEX analysis\n\nAll earnings call transcripts"
}