{
  "companyName": "VOXX International Corporation",
  "companyTicker": "VOXX",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/12/voxx-international-corporation-voxx-q2-2023-earnin/",
  "content": "VOXX International Corporation (VOXX 0.60%)\nQ2 2023 Earnings Call\nOct 12, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the fiscal 2023 second quarter results conference call. [Operator instructions] I would now like to hand the conference over to your speaker for today, Glenn Wiener, investor relations. You may begin.\n\nGlenn Wiener -- Investor Relations\n\nThank you, and good morning. Welcome to VOXX International's fiscal 2023 second quarter conference call. Yesterday, we filed our Form 10-Q and issued our press release. And this morning, we posted an updated investor presentation.\n\nAll of these documents can be found in the Investor Relations section of our website at www.voxxintl.com. Today, we'll have prepared remarks from Pat Lavelle, president and chief executive officer; and Michael Stoehr, senior vice president and chief financial officer. After which, we'll open up the call for questions. I would like to remind everyone that, except for historical information contained herein, statements made on today's call and webcast that would constitute forward-looking statements are based on currently available information.\n\nThe company assumes no responsibility to update any such forward-looking statements, and I would like to point you to the risk factors associated with our business, which are detailed in our Form 10-K for the period ended February 28, 2022. I'd like to thank you, all, for your continued support, and I would like to now turn the call over to Pat.\n\nPat Lavelle -- President and Chief Executive Officer\n\nThanks, Glenn, and good morning, everyone. Last quarter, I talked about the challenges we face given the state of the global economy. And our primary issue remains the industrywide availability of chips as this continues to slow down OEM production and the overall rate of the economy has resulted in lower inventory levels and purchased by retailers. We knew the first half would be difficult than it was.\n\nWe expect the second half to be better, though we have tempered our outlook as our customers work through market obstacles. We recently adjusted prices and implemented cost control measures, some of which are short term, others which will lead to a lower operating cost basis when conditions improve. Nothing has changed with respect to our optimism once economic conditions improve. I believe we remain positioned to drive both top and bottom-line growth and enhance many of our market-leading positions.\n\nThrough the first half of fiscal '23, sales were down approximately 9%. Gross margin declined by 180 basis points. Expenses were up 3%, and we posted an adjusted EBITDA loss of $3.4 million, compared to an adjusted EBITDA of $14.7 million in the first half of fiscal '22. We projected a top-line decline and a loss through the first half, though conditions in the second quarter were weaker than anticipated.\n\nAnd this is not just for Voxx, but our industry as a whole. Global economies are facing geopolitical shocks. The world is still recovering from COVID in different places, and we are experiencing inflation rates that we have not seen in decades. Inflation has driven up cost for business and prices up for consumers.\n\nAnd the Fed has indicated they will continue to raise interest rates to slow the economy further. The Voxx has been through recessions before, and we will get through this one. Looking back over the past two years, we posted strong operating results in mids COVID and the supply chain problems. This year has been harder as the economy has worsened in the U.S.\n\nand globally. We can manage costs and inventory, but we cannot control the impact chips scarcity has on our customers and lower consumer spending has on our major retailers. And therefore, we have taken aggressive steps to lower operating costs, and I believe that with the new businesses we've added over the last few years and the strength of our brands and market placement, we will be positioned to offset the weakness that the market is experiencing and that we anticipate. Within our automotive segment in the first half comparisons, our OEM business was relatively flat in spite of the fact that I believe the automotive industry has been in recessionary territory for the past three years.\n\nThe availability of chips has created problems not only for the carmakers but has prevented us for meeting demand as well. On our Q1 call, I discussed the fact that we had offered an alternative shift to Stellantis, where we would be able to meet their demand. We presented a solution, and I am happy to report today that the modifications have been validated and approved, and we will resume shipments toward the end of this month. This should help drive increases in our automotive OEM business in the second half of the year.\n\nOur programs with Ford remain on schedule, albeit at lower volumes than projected given the same challenges, but we were awarded new business last quarter, which increased the total value of the programs. Conditions have been getting somewhat better, and we recently launched the EVOLVE rear seat entertainment system for the Navigator and the expedition vehicles and are in process of finalizing programs for the Aviator and the Explorer. Other OEM programs are progressing and many of the contracts awarded through VSM will be starting in fiscal 2024. To offset the run-up in labor costs in the U.S., we began transitioning some of our OEM production lines to Mexico.\n\nAnd I spoke about this on our Q1 call. Our first line is now up and running, and we expect to be fully operational by the end of November. Labor costs are roughly half of what they are in the U.S. and the cost to operate is less as well, which will help improve margins and profitability.\n\nOur OEM business at this point is positioned very well. As you know, we have received approximately $750 million of new awards, most of which still remain in front of us. Our aftermarket automotive business is down $12.3 million through the first half due to the economy and the impact on our business with new car dealers and mobile retailers. The good news is we are now entering the winter season traditionally our strongest selling season within the aftermarket.\n\nWith the DEI acquisition, we now own most of the top-selling brands and through the integration synergies that we've realized, we expect greater profitability in our aftermarket business for the full fiscal year, even on lower sales. So to sum up automotive, chips are the biggest issue, and this is going to persist. New vehicle models and programs start soon, which should lead to growth. OEM margins should improve with the move to Mexico, recent price increases, and managing the supply chain effectively.\n\nWe have a steady flow of new OEM awards over the next several years, building on top of our normal base of business, and we have several more opportunities on the horizon with other OEM customers. Automotive remains on track to generate strong returns as ahead, and we will work with our customers to help them get the near term. Moving on to the consumer segment. The consumer sales segments were down approximately $14 million with both premium audio and product sales down due to the impact of inflation and the shift in consumer discretionary spending.\n\nAll nonessential leisure products are feeling the pinch, TVs, gaming systems, video systems, and laptops to name just a few. And our major retailers have lowered their levels of inventory carry because of lower sell-through and the fact that they know the supply chain is full and they can avail themselves to product quickly. Within Premium Audio, sales of premium home speakers and wireless speakers were down $24.5 million, but this was offset by an increase of $18.4 million in sales of Onkyo and Pioneer products and a $3.7 million increase in sales from our PAC Australia subsidiary. We own some of the top-selling brands in the industry, and our placement globally remains very strong.\n\nBut the reality is that with the state of the economies and a decline in consumer discretionary spending, volume for premium audio products will be less than what we initially forecasted. At Onkyo, we continue to ramp up production and are in position to meet retail consumer demand this year. Our Onkyo business was up in the first half, and we expect increases through the second half and more so in the future as we open up distribution in other parts of the world beyond North America. Near term, in light of the economic factors in play, again, industry sales of audio products are expected to decline.\n\nBut as we expand distribution throughout the world for Onkyo, Pioneer, and Integra products, we expect to offset that decline. Other CE products were down in the first half, but we have new placement at key retailers for our Acoustic Research outdoor speakers, which will positively impact this fourth quarter and into next fiscal year. We expect other CE products to perform better as people are once again coming together with fewer restrictions in place for the holidays. Our accessory business in Europe is down, primarily due to the drop in currency.\n\nWith Schweiger's market-leading position and do-it-yourself retailers, we could see a boost with more sales in this category resulting from inflation. As for our biometrics segment, we streamlined operations and enhanced distribution resulting in significantly less expenses with more efficient management. With sales relatively flat to the comparable six-month period, our operating expenses are down close to 40%, and our operating loss improved by over 40%. In fiscal '22, we added a new distribution partner, Galvanized Partners.\n\nAnd during the second quarter of fiscal '23, they announced a new program with Acxiom Bank to deploy a custom biometric device to enable touchless, highly secure authentication technology for the financial industry. We are working closely with Galvanize to utilize our technology to streamline the authentication process for financial transactions while enhancing security in a touchless and mobile environment. Our business with the Miami Lakes Auto Mall is progressing. This program is designed to increase lot protection of their vehicles.\n\nWe expanded the program last quarter to include perimeter access for the corporate infrastructure, which includes business access, hazardous material location, and garages. We have moved through all installation approvals and will roll out the program to their other 25 dealership locations. Recently, we won a deal with the city government of Leon in Mexico to accurately identify prisoners in correction facilities, as well as for access control for their 911 pulse secretors. The program has expanded into other sectors within the city and to other areas within the state of Guanduato, and EyeLock's IXT devices are now being used for authentication and city government buildings as well.\n\nThe project with Marubeni Corporation in Japan continues, and we are working with them to develop a logical access product for Pharma 4.0 in Japan. And lastly, although we remain in testing with the healthcare company we've been discussing, there are no pertinent updates at this time. But EyeLock is working with companies in the financial services, security, government, industrial, automotive, and gaming sectors. The pipeline is building as is interest in our technology, and we believe the financial picture at EyeLock will continue to improve.\n\nTo close, we expect to be profitable in the second half of the year, though the level of profitability is truly dependent on the economy, our customers, and the supply chain. Based on the first half and our revised outlook as a result of customer projections, we took significant actions over the past few months to cut costs across the board like we did when COVID hit. We have looked at all aspects of our business to identify costs that can be reduced without losing our ability to operate, meet launch dates, and exceed customer expectations. I estimate that we have implemented actions, both operational improvements and expense reductions totaling approximately $16 million out of the second half budget for fiscal '23.\n\nThis consists of freight surcharges, vendor reductions, container reductions, patent expirations, terminations, executive and board pay cuts, and more. We have and continue to look at duplication within our structure and waste to operate more efficiently. And not all of these actions will be permanent. But when things do improve, we should operate on a lower-cost basis similar to what transpired in fiscal '21 and '22, excluding costs related to acquisitions.\n\nAgain, this is not the first time Voxx has faced an economic downturn. We have been in business for over six decades, and we will get through this and be stronger. As we move into fiscal '24, if everything remains as is, no better, no worse, our performance should improve with new OEM programs, expanded production and distribution for Onkyo and Pioneer products, and the other initiatives underway across each of our business segments. There's no doubt, it's been challenging, and we're working through it, but I firmly believe the best is still to come for VOXX and our shareholders.\n\nI want to thank you. And now at this time, I'll turn the call over to Michael. Mike?\n\nMichael Stoehr -- Senior Vice President and Chief Financial Officer\n\nThanks, Pat. Good morning, everyone. I'll focus the majority of my remarks today on our second quarter comparisons and close with a few comments on our balance sheet. We reported net sales of $125.7 million, down $17.4 million year over year with automotive segment sales down $8.5 million.\n\nConsumer segment sales down $8.9 million and our biometrics segment sales up approximately $100,000. Within automotive, OEM product sales declined by $1.2 million. This was primarily a result of lower volume from the car manufacturers, though new programs with Solantusand Ford helped offset the decline with volume anticipated to increase with new vehicles and programs coming online. Aftermarket sales declined by $7.4 million.\n\nAnd as Pat noted, this was mainly due to a lack of new vehicles at car dealers and lower purchases at retail due to the economy. The aftermarket security category represented approximately 90% of the year-over-year decline, and we expect to see improvements in the second half of the year. Within consumer, Premium Audio product sales declined by $6.9 million. Retail store traffic slowed as has online purchasing given the current environment.\n\nAs a result, sales of home theater systems and sound bars declined both domestically and abroad. As an offset, we had higher sales of Onkyo and Pioneer products, higher sales from PAC Australia, and a modest sales increase of other distributed products sold through 11 TC. Lower discretionary spending in the U.S. and recession fears throughout Europe also had an impact on our CE product sales, which were down $2 million for the comparable periods.\n\nBiometric segment sales were up approximately $80,000 due to a new customer account, and we're expecting more meaningful top-line increases in the second half of the fiscal year. Gross margin was 23.3%, down 270 basis points, with the decline in our consumer segment, offset by increases in our automotive and biometrics segments. Automotive segment margins of 24.5% increased by 60 basis points. price increases, along with steps we've taken to mitigate higher costs drove the year-over-year improvement, partially offset by lower margins on certain new OEM rear-seat entertainment products, which we are currently working to improve and sure as volume ramps and production is more consistent.\n\nConsumer segment margins declined by 430 basis points, driven primarily by lower sales of premium home theater speaker products and higher supply chain costs, including freight to move the product to the U.S. today for holiday season. Higher sales of Onkyo and Pioneer products helped to offset the decline. Biometrics segment margins improved significantly on a percentage basis, but given the volume of sales, the gross dollar impact was minimal.\n\nMoving on to operating expenses. For the fiscal 2023 second quarter, we reported total operating expenses of $39.2 million, down approximately $700,000 year over year. Selling expenses were essentially flat with higher website and advertising expenses, offset by lower commission and salesman salaries. General and administrative expenses increased by $1.2 million due primarily to an $800,000 increase in depreciation and amortization expenses related primarily to the amortization of intangible assets of the new Onkyo subsidiary and approximately $200,000 increase in restructuring costs related to the relocation of certain OEM production operations to Mexico.\n\nThis was partially offset by a $300,000 decline in professional fees. There were other offsetting factors for the comparable periods. Lastly, engineering and technical support expenses increased by $400,000 as we had higher engineering labor expenses and related payroll expenses associated with the Onkyo subsidiary, partially offset by lower R&D expenses. R&D-related expenses for our automotive and biometric segments declined and was offset by product development projects related to Onkyo.\n\nDuring the fiscal 2022 second quarter, we incurred acquisition costs of $2.3 million related to the Onkyo asset purchase agreement and the joint venture created with Sharp to complete the transaction. In fiscal 2023, we did not have any acquisition-related expenses. Lower sales and gross margin, coupled with a modest increase in operating expenses resulted in operating loss of $10 million as compared to operating loss of $2.7 million in fiscal 2022 second quarter. Total other income and expense was a net loss of $1.7 million in fiscal 2023, second quarter as compared to total other income net of $1.8 million in the comparative fiscal 2022 period.\n\nThe primary drivers of the $3.7 million year-over-year increase were, one, a $1.7 million net foreign currency loss primarily related to the decline of the Japanese yen; and two, a $1 million charge representing interest expense related to the interim arbitration award accrued during fiscal 2023. We which was not present in comparable prior-year period. Interest and bank charges increased by $300,000 and equity and income of an equity investee, which relates to our 50-50 ASA joint venture declined by $300,000, making up the difference. Net loss attributable to VOXX was $10.2 million as compared to net income attributable to VOXX of $300,000 in the comparable fiscal 2022 period.\n\nLastly, adjusted EBITDA in the fiscal 2023 second quarter was a loss of $3.3 million as compared to adjusted EBITDA of $6.3 million in the second quarter of fiscal 2022. The -- this includes a $2.7 million in nonoperating cash or FX losses and internal award expenses, as well as adjustments for stock-based compensation, restructuring expenses, and nonroutine legal fees. Moving on to the balance sheet. Comparing our balance sheet as of August 31, 2022 to February 28, 2022, we had cash and cash equivalents of $4.3 million as compared to $27.8 million.\n\nTotal debt was $37.7 million as compared to $13.2 million, with the increase primarily related to $27.4 million outstanding on our domestic credit facility as we used our facility for working capital purposes to secure inventory moving into fiscal 2023 third quarter. The additional variances related to, one, a $1.9 million reduction in our euro ABL obligation for Voxx Germany, which was incurred in fiscal 2022, and nothing is currently outstanding; two, lower debt associated with our Florida mortgage and three, a decline in the shareholder loan payables Sharp. To summarize the first half and our outlook. Sales were lower than projected due to softness in the economy and retailers pulling back to mitigate risk.\n\nWe have new retail customers, new OEM programs, and many new products either in market or under development. And we have the inventory on hand or in transfer to meet customer needs in the second half of the year. Note, we increased our inventory carry throughout the year to ensure we secured what we needed, and we're continuing to diligently manage the supply chain to optimize capital resources. Our biggest obstacle is the economy and the current global environment, we are taking a prudent approach and prepared for whatever comes our way.\n\nOperator, we're now ready to open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Brian Ruttenbur with Imperial Capital. Your line is open.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nYeah. Thank you very much for taking my call. A couple of questions. First of all, I believe you stated that in the second half of the year, you'd be cash flow positive.\n\nMaybe you can elaborate on that. Does that mean third quarter or fourth quarter? And I believe you said cash flow positive. Maybe you could define what you're talking about in terms of cash flow.\n\nMichael Stoehr -- Senior Vice President and Chief Financial Officer\n\nHi, this is Mike speaking. Pat, you can go ahead, and then I'll fill in for what you have to say.\n\nPat Lavelle -- President and Chief Executive Officer\n\nNo, go ahead, Mike. You can take it.\n\nMichael Stoehr -- Senior Vice President and Chief Financial Officer\n\nJust from my standpoint, we -- historically, this is the seasonal nature of the company, which I think we referenced we're returning back to our seasonal patterns. As we work through the third and fourth quarter, as we reduce the inventory carry, that cash will spin out and will then pay down the debt, and we will be positive during the second half.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nOK. And so it's primarily taking inventory down is where you're going to be generating a lot of that cash. Is that correct?\n\nMichael Stoehr -- Senior Vice President and Chief Financial Officer\n\nRight. I'll just speaking for the balance sheet, yes. I'll let Pat talk to the P&L. But yes, that's where it's coming from.\n\nIf you look at the inventory position as of September -- as of August 31, it's $192 million. We'll be south of that number by February 28.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nPerfect. All right. Go ahead, Pat.\n\nPat Lavelle -- President and Chief Executive Officer\n\nAs far as the second half of our year is generally the stronger part of our year, one for holiday sales, one for remote start sales. So having the inventory in place in the warehouses so that we can capture those sales is very important. So as we make those sales, we're going to see the inventory. And as Mike says, we'll catch up.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nOK, great. And then maybe you can give me a little indication on -- you've made some big, big cuts, $16 million in all areas. Should I be looking at it proportionately coming out of selling, general administration, engineering? Is there something that is not getting cut? Is engineering getting cut, as well as G&A, at the same kind of rate?\n\nPat Lavelle -- President and Chief Executive Officer\n\nNo, no. We -- what we looked at and the $16 million is primarily about $9 million in savings, and others -- the other $7 million is somewhere in improvements. So we have had personnel terminations, personal furloughs, bonus reductions, senior executive, and board pay cuts. We've had reductions of third-party partners expenses, reduced show expenses, reduced travel, and things like that.\n\nThose will be regular reductions. But then in the improvements, we've put in freight surcharges because of the cost of freight that's going up between the automotive aftermarket and our domestic clips operations,  patent payments that expire, container reductions, some vendor reductions. So there's a combination of both. It's not in any one specific area.\n\nAnd one area that we are very careful to avoid cutting is in engineering because we have a number of launches that are in front of us in 2024 that we have to meet. So we believe that we've cut where we could, so as I indicated, where we can maintain our ability to operate and our ability to meet the launch dates that our customers expect.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nOK. And then just one other follow-up comment or question along those same lines in terms of -- just trying to understand revenues are likely going to be down year over year in third quarter and fourth quarter, but there should still be a seasonal pattern where third quarter is stronger than second quarter. Did I state anything incorrect?\n\nPat Lavelle -- President and Chief Executive Officer\n\nYou're right. I mean, we expect to see a significant improvement in the second quarter over the second half over the first half.\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nOK. But it will still be down year over year in the second half versus the second half of '22?\n\nPat Lavelle -- President and Chief Executive Officer\n\nNo, I'm not saying that. The second half of the year, we have, as I've indicated, we'll be resuming shipments to Stellantis. We have a number of new programs coming online. We're in a better position with inventory for certain holiday products that we missed some sales last year.\n\nSo I'm not saying that our sales will come in lower in the second half than last year. But again, it really does depend on what happens with the economy, how strong does the consumer feel going into the holiday season?\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Tom Forte with D.A. Davison.\n\nYour line is open.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. So Pat, Michael, thanks for taking my question. I have four. I'll go one at a time.\n\nright. So Pat as a longtime CEO in the consumer electronics category, I would appreciate your thoughts on the following: How does today's level of consumer demand compare against the Great Recession in '08 and '09, the air pocket we saw at the start of COVID and any other relevant periods of weakness we've seen in the past?\n\nPat Lavelle -- President and Chief Executive Officer\n\nI don't think at this particular point that it reaches those levels, but what we obviously get concerned with is a continued rise by the Fed, where their stated policies, to bring up unemployment, there will be a certain amount of sales destruction that go along with that. And then how long this recession is going to last before they can start easing up? But at this particular point is not as severe. We've also made, as you've heard me say, a number of cuts to offset, and we have new programs, especially as I've indicated, with Onkyo, Pioneer and Integra, and some of the other 11 TC brands that we've recently introduced, but they were primarily introduced only in North America because of the production problems. As the production increases over at Sharp, we plan to be able to expand into Europe, expand into APAC, expanded to South America, which should offset weakness that we may have here in the United States.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nAll right. That's very helpful, Thank you. So the second question is, I was hoping you could help me understand this situation. So it seems to me consumers are still spending money, but retailers being ultra conservative when it comes to inventory, especially in the consumer electronics category.\n\nI would appreciate any thoughts you have on that.\n\nPat Lavelle -- President and Chief Executive Officer\n\nWell, there's two areas that -- the first thing we do business with some of the biggest retailers in the world. And coming out of their first quarter, if you recall, they all missed their numbers and their reaction was to severely cut back on inventories. I mean, in many cases, we see their sell-through, they were selling through merchandise but not reordering. Their mantra was to bring down the overhead of inventory that they're carrying and that they've worked on for the better part of this year.\n\nWe do believe that if Christmas starts to materialize because we do agree that the consumer still has money, is that they'll have to reorder in order to make those sales. So that we look at somewhat of a positive. And that's been the biggest problem on the consumer side of the business. The retailers also know that unlike years previous with supply chain issues and everything that we have inventories and that they need it, they can order it and they'll get it.\n\nSo that's a different dynamic than what we've seen last year. As far as the consumer, we know that the demand for new cars is very, very strong. Even in a down economy, we expect that if the car manufacturers can start producing more vehicles because of the chip situation, if they can get that resolved, we think that sales of new vehicles will be quite robust. That will help us on the OEM side and as well on the aftermarket side, as 50% of our aftermarket business is done with new car dealers.\n\nOne of the issues that exist today, there are fewer and fewer cars sitting on the deal. There's lots waiting to be sold.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nOK. Good. All right. So I wanted to know two more.\n\nI wanted to know if you're able to take advantage of improving freight costs by getting more aggressive on pricing and promotions.\n\nPat Lavelle -- President and Chief Executive Officer\n\nWell, at this particular point, with the lead times that we have and the fact that through the supply chain issues, we had to essentially put 60 days more inventory into our cycle. So as we sell through that inventory, we will be able to assess to access the lower prices that we're starting to see on the spot market. We've worked with a number of shippers that we've contracted with. They are working with us.\n\nBut these would be more on newer shipments that we make over the next coming months. But certainly, we are working to lower our freight costs coming in.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nExcellent. All right. Last question. So I wanted to know how you're impacted by the strong U.S.\n\ndollar. For example, in the quarter, how much were your sales impacted by the strong dollar -- and then I also want to know if you have any expenses outside the U.S. in local currencies that essentially hedge some of the impact of a strong dollar on your profits?\n\nPat Lavelle -- President and Chief Executive Officer\n\nYes. Well, one of the -- obviously, the strong dollar is starting to impact us in Europe and places like that where our goods are more expensive because the dollar-denominated. But we have hedged -- we traditionally on our inventory buys have hedged so that we can maintain somewhat of a stable pricing structure. On the contrary, what we're talking to our manufacturers about is because of the strength of the dollar and they do pay them in dollars, and we're looking for additional discounts based on that.\n\nWhere we have been impacted negatively is on the yen-based loan that we have at OTKK, which is the Japanese Onkyo operation. And to date, we've taken about a $3 billion -- kind of somewhere around $3.4 million, $3.5 million currency charge, marking that loan to market, which is not going to be paid for -- it's not due for 10 years. So that's the one area that we've gotten hit. It's not an operational expense, but it does hit the pre-tax line.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. So thanks, Pat. Thanks for taking my questions.\n\nPat Lavelle -- President and Chief Executive Officer\n\nOK. Thank you.\n\nOperator\n\nThank you. I'm showing no further questions in the queue. I would now like to hand the call back over to Pat for closing remarks.\n\nPat Lavelle -- President and Chief Executive Officer\n\nWell, thank you, all. I would like to thank you for your interest today. Rest assure, we are monitoring all government and federal moves that we see, and we'll work closely with all of our customers and our OEMs to determine what any moves that the government makes, what does it affect their business and their volume, which eventually is our sales. So I want to thank you for coming on the call today and wish you a good rest of the day.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGlenn Wiener -- Investor Relations\n\nPat Lavelle -- President and Chief Executive Officer\n\nMichael Stoehr -- Senior Vice President and Chief Financial Officer\n\nBrian Ruttenbur -- Imperial Capital -- Analyst\n\nTom Forte -- D.A. Davidson -- Analyst\n\nMore VOXX analysis\n\nAll earnings call transcripts"
}