{
  "companyName": "Ulta Beauty",
  "companyTicker": "ULTA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/ulta-beauty-ulta-q3-2022-earnings-call-transcript/",
  "content": "Ulta Beauty (ULTA 0.91%)\nQ3 2022 Earnings Call\nDec 01, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Ulta Beauty's conference call to discuss results for the third quarter of fiscal '22. At this time, all participants are in a listen-only mode. A brief question-and-answer session will follow the formal presentation. We ask that you please limit yourself to one question and then reenter the queue for any additional questions.\n\n[Operator instructions] As a reminder, this conference is being recorded. And it is now my pleasure to introduce Ms. Kiley Rawlins, the vice president of investor relations. Thank you, Ms.\n\nRawlins, please proceed.\n\nKiley Rawlins -- Vice President, Investor Relations\n\nThank you, John. Good afternoon, everyone, and thank you for joining us today for our discussion of Ulta Beauty's results for the third quarter of fiscal 2022. Hosting our call are Dave Kimbell, chief executive officer; and Scott Settersten, chief financial officer. Kecia Steelman, chief operating officer, will join us for the Q&A session.\n\nThis afternoon, we announced our financial results for the third quarter. A copy of the press release is available in the investor relations section of our website. Before we begin, I'd like to remind you of the company's safe harbor language. The statements contained in this conference call, which are not historical facts, may be deemed to constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nActual future results may differ materially from those projected in such statements due to a number of risks and uncertainties, all of which are described in the company's filings with the SEC. We caution you not to place undue reliance on these forward-looking statements, which speak only as of today, December 1, 2022. We have no obligation to update or revise our forward-looking statements, except as required by law, and you should not expect us to do so. We'll begin this afternoon with prepared remarks from Dave and Scott.\n\nFollowing our prepared comments, we'll open the call for questions. To allow us to accommodate as many questions as possible during the hour scheduled for this call, we respectfully ask that you limit your time to one question and one follow-up question. If you have additional questions, we ask that you requeue. And as always, the IR team will be available for any follow-up questions after the call.\n\nNow, I'll turn the call over to Dave. Dave?\n\nDave Kimbell -- Chief Executive Officer\n\nThank you, Kiley, and good afternoon, everyone. We appreciate your interest in Ulta Beauty. The Ulta Beauty team delivered outstanding performance this quarter, with strong revenue growth driving operating margin expansion and double-digit earnings growth. We accomplished these results because the Ulta Beauty teams continue to execute at a high level, and I want to thank all of our associates for their commitment to delivering great guest experiences, ensuring operational excellence, strengthening our culture, and working together as one team to move our business forward as the leader in beauty.\n\nFor the third quarter, net sales increased 17.2% to $2.3 billion, and comp sales increased 14.6%. Operating margin increased to 15.5% of sales and diluted EPS increased 35.5% to $5.34 per share. Reflecting these results and our updated fourth quarter expectations, we have increased our outlook for the full year. Scott will share more details about our expectations later in the call.\n\nOur third quarter results are a testament to the resilience of the beauty category and our team's ability to drive strong guest engagement that fueled broad-based growth across our business. All major categories exceeded our expectations, and we increased our market share in prestige beauty versus the fiscal third quarter last year based on dollar sales according to point-of-sale data from the NPD Group. We delivered growth across our store and digital channels and achieved record loyalty membership of 39 million members. Additionally, we continue to see growth in spend per member across all income demographics.\n\nOur strategic framework, anchored by the power of our differentiated model, continues to drive our ambitions and successes as we work to expand our market leadership and drive profitable growth. This afternoon, I will share an update on our progress against several of our strategic pillars. Starting with our efforts to drive disruptive growth through an expanded definition of All Things Beauty, our strategy to engage and delight beauty enthusiasts with a thoughtfully curated assortment focused on inclusivity and leading trends is delivering results. Our double-digit comp this quarter was a result of growth from our core assortment, price increases executed this year, and compelling newness.\n\nAlthough pricing contributed more to our comp than last quarter, the majority of our third quarter comp was fueled by growth from our core assortment and newness. Historically, sales of new products have averaged 20% to 30% of our sales, and the overall mix of newness this year has been in line with our historical experience. Turning to performance by category. Skincare, fragrance and bath, hair care, and makeup all delivered double-digit comp growth against the third quarter last year.\n\nFrom a segment perspective, we saw double-digit sales growth across both prestige and mass, with mass generally outperforming prestige. While it's hard to know with certainty if we are starting to see consumers trade down, as the only beauty retailer that offers a wide variety of price points from entry-level mass to high-end luxury and everything in between, Ulta Beauty is uniquely positioned to capture any consumer shifts within price points in the beauty category. Turning to the performance of our core categories, starting with our fastest-growing category, skincare. Beauty enthusiasts are maintaining their skincare routines with a focus on science-backed and dermatologist-recommended products.\n\nGuests are engaging with newer brands, like Drunk Elephant, Supergoop!, and Good Molecules, while new products from established brands like The Ordinary, Hero Cosmetics, and La Roche-Posay also contributed to sales growth. To drive discovery and support guest education, this quarter, we introduced our Skincare We Love All in all stores. This curated presentation highlights exciting brands and best-selling items across key categories. The fragrance and bath category delivered another impressive quarter as Gen Z guests engaged with the category, leveraging multiple fragrances to express themselves.\n\nRecently launched Ulta Beauty exclusive Billie Eilish, as well as new scents from Burberry, Gucci, and Viktor&Rolf drove meaningful sales growth. While our monthly fragrance crush program drove engagement with established brands including Versace and Jimmy Choo. In addition, the category benefited from strong guest engagement with our holiday fragrance gift sets, which were available earlier this year. Haircare, our second largest category, delivered solid growth, primarily driven by newness and innovation.\n\nKey category trends include hair health, damage repair, and targeted treatments. Prestige brands, including Ouai and Briogeo, saw strength in treatments and core assortments, while masstige brands, including Eva NYC, Batiste, and Kristin Ess, and professional brands such as Pureology, Redken, and Kenra, continued to resonate with guests. Within the category, strong hair product growth was offset by softer performance in hair tools as we lapped strong performance last year. Finally, our largest category, makeup, delivered double-digit comp growth, driven by newness and the strength of our key events, including 21 Days of Beauty and Fall Haul.\n\nGrowth in foundation, concealers, blush, and lip continue to lead the category. New brands like Fenty, r.e.m. beauty, and Numero de CHANEL drove sales during the quarter, while new products from a wide range of brands, including Clinique, e.l.f., and NYX also contributed to growth. In addition, the expansion of MAC, CHANEL Beaute, and Bobbi Brown into more stores has continued to drive prestige sales.\n\nNow let me give you an update on our key cross-category platforms: conscious beauty, Black-owned, and BIPOC brands, and wellness. With 290 certified brands, conscious beauty continues to resonate strongly with beauty enthusiasts, reflecting growing interest in products that are good for the world. This quarter, we certified 15 new brands, including eight cosmetics, Morphe and DIME Beauty, and introduced the conscious beauty essentials kit, featuring minis for more than 15 brands, such as Dermalogica, COOLA, and our own Ulta Beauty Collection. During the quarter, we expanded our BIPOC brand assortment with four new BIPOC brands: BEVEL, BREAD BEAUTY SUPPLY, sugardoh, and Undefined Beauty.\n\nAs another way we look to create foundational industry change, we proudly launched our MUSE Accelerator program to support early stage BIPOC brands as they prepare for retail readiness. Our inaugural class included eight BIPOC founders, with innovative brands across skincare, makeup, fragrance, haircare, and wellness. In addition to financial support, each MUSE Accelerator participant took part in an intensive 10-week training program, learning from Ulta Beauty leaders, industry subject-matter experts, and leading BIPOC brand owners. We are honored and excited to be a part of their journey as they build their business and expand their reach.\n\nFinally, we continue to increase our presence in wellness. During the quarter, we further enhanced our assortment to reflect our guest-evolving needs. And in September, we expanded our offering to include intimate wellness as the sixth online-only pillar of the wellness shop. While wellness represents a small part of our overall business today, we believe it is a significant longer-term growth opportunity given the incrementality of the purchase and the strong emotional connection consumers have with self-care.\n\nTurning now to our efforts to evolve the omnichannel experience through a connected physical and digital ecosystem, all in your world. Store traffic trends accelerated this quarter and exceeded pre-pandemic levels for the first time, representing an important milestone in our COVID recovery. In addition to strong sales growth from stores, we continue to deliver growth in e-commerce, further reinforcing the incrementality of this important channel. The convenience of BOPIS for e-commerce orders continues to resonate with guests.\n\nDuring the quarter, BOPIS increased 18% to 23% of e-commerce sales, compared to 20% last year. Our services business accelerated and delivered another quarter of double-digit comp growth, primarily due to higher stylist retention, increased stylist productivity, and increased capacity in our salons as we lap capacity constraints due to the pandemic. Our targeted CRM efforts to drive awareness, trial, and frequency are working, delivering increases in salon appointments from both existing and new members. Additionally, our in-store back bar events continue to drive product attachment and new guest acquisition for participating brands.\n\nAs industry leaders, we're always working to enhance guest experiences across all of our platforms. During the quarter, we introduced a new layout in about a dozen stores to showcase our categories better, improve navigation, enhance the services experience, and create more opportunities for discovery. The most noticeable changes include the repositioning of skincare, an important growth category to the front of the store. All products grew by category with delineated fixtures and visuals and a flow from prestige to masstige to mass.\n\nElevated gondolas that showcase key iconic and service brands, new beauty bars that offer our brow and makeup services, as well as supporting in-store events, dedicated space in the front of the store to feature brand and product launches across categories and a relocated checkout closer to the salon. We are excited to introduce this new store layout to guest. And as we've done in the past, we intend to introduce this new experience in new stores, remodels, and relocations. At this time, we have no plans to retrofit existing stores.\n\nStores are a critical part of our ecosystem. And while most Ulta Beauty's transactions occur in stores, we know the guest journey often begins online. To assist guests along their journey, we offer a suite of virtual digital tools, including GLAMlab, Skin Advisor, and our hairstyle tool, among others. The latest addition is a fragrance finder designed to help guests explore fragrances by favorite brand or ingredient, launched just in time for the holiday season.\n\nFinally, we continue to be excited about the long-term opportunity with our strategic Target partnership. This touchpoint enables us to connect and reconnect with members. And while the partnership isn't material yet to our overall member growth, it has contributed positively. Importantly, we are seeing members bounce back to Ulta Beauty after becoming an active member while at the Ulta Beauty at Target shop.\n\nNow, let me give you an update on some of the steps we're taking to drive love, loyalty, and emotional connection with Ulta Beauty. Recognizing the beauty is personal, we are on a multiyear journey to create stronger, more emotional connections with our guests and bring our brand purpose to life. Launched in September, our latest brand-building campaign Beauty& is rooted in insights from cultural leaders and beauty enthusiasts. The creative content on owned and paid channels has driven broad improvement in top-of-mind awareness and is resonating with our guests, particularly Black and Latin beauty enthusiasts.\n\nTurning to our loyalty program. Our efforts to nurture loyalty in personalized ways is driving member growth and delivering incremental value. We ended the quarter with 39 million active members, 9% higher than the third quarter last year. Overall spend per member increased driven by increased frequency and higher average tickets.\n\nWhile price increases are having an impact, we are encouraged to see unit growth per member. Our loyalty program is a strategic asset and an important driver of our long-term growth. We prioritize member engagement, loyalty, and retention across every Ulta Beauty touch point. The growth and strength of our loyalty program starts with ensuring that our existing guests stay engaged.\n\nNurturing our existing members through our Member Love events and lifecycle marketing strategies has enabled us to maintain healthy retention rates, which have contributed to member growth and higher spend per member. Member reactivation remains a priority, and we are leveraging CRM tools to personalize offers and reengage members in more targeted ways. And, of course, conversion of new members also contributes to overall member growth, and we continue to acquire new members in our stores, digital platforms, and through our partnership with Target. Shifting now to our plans and expectations for the holiday.\n\nThe holiday season is in full flow, and our teams are executing well. While predicting holiday shopping patterns this year is challenging, I am optimistic about the opportunity for Ulta Beauty this holiday season. Our engaging holiday messaging, one-of-a-kind assortment, with exceptional seasonal options, and diverse touch points, all paired with our team's unrelenting passion for delivering great guest experiences, position us well to deliver another successful holiday season. Grounded and robust consumer insights, our holiday marketing strategy positions Ulta Beauty as the place for gifting, glamming, and self-care this season.\n\nOur intent is to empower guests to celebrate the season however they want. And our integrated media plan for the holiday aims to build broad awareness of Ulta Beauty as a holiday destination, spark connection with key audiences, leverage our beauty expertise, and drive consideration and purchase. Our merchandising team has built an outstanding holiday gifting assortment, whether guests want to gift others or treat themselves, we have thoughtfully curated options across every category and budget, with a balanced approach to the mix of seasonal holiday items and core items that make great guests. We entered the holiday season with well-staffed stores and DCs, and our teams are excited, engaged, and ready.\n\nFor the first time since 2019, our store teams gathered in person to review our holiday strategies. And I know their excitement and enthusiasm for our plans will be felt in every guest interaction. And our corporate and DC teams have worked cross-functionally to ensure Ulta Beauty is positioned to deliver for our store teams and our guests. In closing, I am incredibly proud of our year-to-date results, and I'm excited about our holiday plans.\n\nEven as consumers continue to navigate economic headwinds, we believe the beauty category will remain resilient, and we are confident that our differentiated model and growth strategy, combined with our outstanding associates, will continue to position Ulta Beauty as the preferred beauty destination. And now I will turn the call over to Scott for a discussion of the financial results. Scott?\n\nScott Settersten -- Chief Financial Officer\n\nThanks, Dave, and good afternoon, everyone. Today, we reported results that were better than our initial expectations. Strong double-digit revenue growth resulted in record-setting third quarter operating margin performance. These excellent results reflect the continued focus and hard work of our store, DC, and corporate teams.\n\nAnd I want to thank all of our Ulta Beauty associates for working together to deliver another outstanding quarter for our shareholders. Now to the financial results, starting with the income statement. Net sales for the quarter increased 17.2%, driven by comp sales growth of 14.6% and strong new store performance. In addition, other revenue increased $20 million, primarily due to credit card income growth, higher loyalty point redemptions, and an increase in royalty income from our partnership with Target.\n\nBreaking down the comp performance further, comp transactions for the quarter increased 10.7%, primarily driven by strong growth from in-store transactions. Average ticket increased 3.5% due to an increase in average selling price, partially offset by slightly lower average units per transaction. The increase in average selling price primarily reflects the impact of retail price increases executed this year. We estimate that price increases contributed about 500 basis points to the overall comp increase.\n\nWhile average units per transaction was slightly lower than last year, the total number of units sold increased about 10% on a comp basis. During the quarter, we opened 18 new stores, relocated one store and remodeled eight stores. For the quarter, gross margin increased 160 basis points to 41.2% of sales compared to 39.6% last year. The increase was primarily due to the leverage of store fixed costs, other revenue growth, and higher merchandise margin, partially offset by higher inventory shrink.\n\nRobust top-line growth and benefits from our ongoing occupancy cost optimization efforts resulted in healthy leverage of store fixed costs.The improvement in merchandise margin was primarily due to benefits resulting from the timing of retail price changes, partially offset by brand mix. As we have discussed, we have executed a number of price increases from our brand partners this year. Generally, when the new price is effective at the shelf, we are still selling the inventory purchased at the lower cost. As a result, there's a short-term benefit to cost of goods as we move through the lower-cost inventory.\n\nAs expected, our promotional activity increased from the second quarter, but the impact to margin was not meaningful compared to last year. SG&A increased 18.6% to $597.2 million. As a percentage of sales, SG&A increased 30 basis points to 25.5% compared to 25.2% last year, primarily due to increases in store payroll and benefits and corporate overhead, partially offset by lower marketing expenses. Store payroll and benefits deleverage this quarter primarily due to increased labor hours to maintain service standards, higher average wage rates to support recruitment and retention, and a timing shift of incentive compensation accruals.\n\nCorporate overhead expense deleveraged in the quarter, primarily reflecting investments related to our strategic priorities including Project SOAR and other IT capabilities, UB Media, and Ulta Beauty and Target. These headwinds were partially offset by lower marketing expense. As we have discussed on previous calls, this year, we are offsetting the incremental marketing expense of digital campaigns we manage for our brand partners, with vendor income that is a direct reimbursement for these specific costs within total marketing expense. Similar to what we saw in the first half, this resulted in about 70 basis points of favorable impact to SG&A in the quarter.\n\nOperating income for the quarter increased 27.3% to $361.9 million. As a percentage of sales, operating margin increased 130 basis points to 15.5% of sales compared to 14.2% last year. Diluted GAAP earnings per share increased 35.5% to $5.34 per share compared to $3.94 per share last year. Moving to the balance sheet and cash flow.\n\nTotal inventory increased 10.3%. In addition to the impact of 41 additional stores, the increase reflects purchases to support key brand launches and increases in inventory costs, as well as ongoing efforts to maintain strong in-stock to support expected demand. Capital expenditures in the quarter were $83.5 million compared to $51.1 million last year. The increase was primarily related to investments in new remodeled and relocated stores, IT projects, and merchandising improvements.\n\nDepreciation was $58.5 million compared to $65.2 million last year, primarily due to a shift of IT investments from capital to cloud expense. We ended the quarter with $250.6 million in cash and cash equivalents. During the quarter, we repurchased 340,000 shares at a cost of $137.5 million. At the end of the third quarter, we had $1.4 billion remaining under our current $2 billion repurchase authorization.\n\nTurning now to our outlook. We have raised our financial guidance for fiscal 2022 to reflect our strong third quarter performance and increased expectations for the fourth quarter. We now expect net sales for the year will be between $9.95 billion and $10 billion, with comp sales growth between 12.6% and 13.2%. This guidance reflects our expectation that fourth quarter comp growth will be between 6% and 8%, up from our previous expectation for low single-digit increase.\n\nSales growth moderated in November as we lapped last year's strong performance, but we are pleased with the sales trends we saw through the Thanksgiving holiday shopping weekend, including Cyber Monday. We still have several important weeks left in the holiday season, and the operating environment continues to be dynamic. Our Q4 comp outlook reflects both the expected resilience of the beauty category, as well as potential risks from shifts in consumer spending, increased points of distribution for prestige beauty, and higher promotional activity. For the year, we plan to open approximately 47 net new stores and remodel or relocate 33 stores.\n\nOur new store performance continues to be strong. But like many other major retailers, we are seeing project delays resulting from external real estate and construction issues, as well as supply chain disruption for key equipment. These external factors have impacted our fiscal 2022 plans and will likely shift new stores originally planned for fiscal 2023 into 2024. We continue to expect to open about 100 stores over the next two years, but the timing of opening between fiscal 2023 and 2024 may shift as we navigate these external challenges.\n\nThe operating environment is fluid, and we will provide specific targets for fiscal 2023 when we report in March. We now expect operating margins for the year will be between 15.5% and 15.6% of sales. We expect gross margin for the year will increase with leverage of fixed costs and growth in other revenue partially offset by lower merchandise margin, higher shrink and higher supply chain costs. We continue to expect SG&A expense for the year will increase between 15% and 16% and or approximately flat as a percentage of sales, driven primarily by $60 million to $65 million of expenses related to our strategic priorities, as well as higher wage rate growth across the enterprise, partially offset by lower marketing expense.\n\nReflecting these assumptions, we now expect diluted earnings per share for the year will be between $22.60 and $22.90. One final update. We now expect to spend between $300 million and $350 million in capex in fiscal 2022, including approximately $160 million for supply chain and IT, $140 million for new stores, remodels, and merchandise fixtures, and about $30 million for store maintenance and other. We expect depreciation for the year will be around $250 million.\n\nWhile we are not providing guidance for next year on this call, we want to share some high-level thoughts for your consideration as you model fiscal 2023. The beauty category has been stronger this year than expected. Barring a major economic event, we would expect category growth to continue in 2023, albeit at lower rates, reflecting strong consumer engagement with the category, and we remain confident we can deliver comp sales growth in fiscal 2023 within our longer-term targeted range of 3% to 5%. In this sales scenario, we would expect operating margin deleverage versus our fiscal 2022 guidance.\n\nIn addition to inflationary pressures on wage rates and other operational expenses, we expect to increase investment spending related to our strategic priorities, reflecting timing shifts from fiscal 2022 and the planned ramp-up of key IT and supply chain investments. Finally, fiscal 2023 will be a 53-week year for Ulta Beauty. We are still finalizing our budget for fiscal 2023 and plan to provide specific financial guidance and update our longer-term growth targets, if appropriate, on our March earnings call. And now, I'll turn the call back over to our operator to moderate the Q&A session.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for questions. And our first question comes from the line of Steven Forbes with Guggenheim Securities.\n\nPlease proceed with your question.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nGood evening, Dave, Scott. I wanted to focus and start with member engagement. But Dave, curious if you can expand on how member engagement trends within the recent member cohorts differ or I guess, are similar from the more mature cohorts in terms of retention, repeat behavior, the maturation of wallet share, channel preferences, really just any color that helps maybe underpin your conviction for a positive comp outlook next year?\n\nDave Kimbell -- Chief Executive Officer\n\nGreat. Thanks, Steve. Yeah, as I said in the remarks, our loyalty program, our membership, is vital and critical to our long-term success and one that we're extremely proud of what we've built the relationship that we have with our guests. Yes, I guess, a few things that I'd call out.\n\nNaturally, our longer tenured, you get your tenured three-plus years, we see kind of a higher level of retention, higher level of engagement that tends to grow over time. Greater percentage of our guests, the longer they're here, move into our higher levels, platinum and diamond levels. So naturally, with that tenure comes greater engagement. And as I mentioned, one of the drivers of our third quarter growth, 9% growth in our total membership was healthy retention and it's been a big focus for our entire team, our loyalty team, our store teams, our digital, everybody that participates into delivering a great experience.\n\nSo that's key and really job one is engaging and retaining our existing guests. Our newer members that we acquire in stores, online, and increasingly with our partnership with Target play an important role. Their spend per member makes sense. It's on average lower, and we work hard to get them into the full Ulta Beauty experience.\n\nOften, they enter into one category or one experience. They might come in-store. We try to move them online. They might come into makeup, we try to move them into skincare, get them into services.\n\nWe have a full suite of activities and experiences designed to engage our new members through in -- and including their what we call their sophomore year, their second year with us, which is important pivot year into long-term retention. So, we look across all spectrum, what we're excited about now and encouraged by is we're seeing strength across all sectors, all income demographics, all geographies. We have a healthy member base. That's what's driving the 9% growth in our loyalty, and of course, that, in turn, played a big role in the sales performance we had in the third quarter.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question comes from the line of Ike Boruchow with Wells Fargo. Please proceed with your question.\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nHey, everyone. Congrats. Great quarter. I guess, Scott, I was going to focus on the margins with you.\n\nMerch margin is better in 3Q. It sounds like you're off to a good start on the promotional side in 4Q as well. You're going to end the year -- I mean, it's a good problem to have. You're going to end the year closer to 16% margins.\n\nYour long-term target is 13% to 14%. I guess, just with merch margins as elevated as they are and as healthy as they are, are you guys starting to think more longer term about the AUR dynamics in the business and maybe that this elevated level of merch margin that you're at might be more sustainable than maybe what you had originally thought and maybe that 13% to 14% actually can move a bit higher? I mean, it more is a high-level question, not necessarily 2023, but that's kind of where I was coming from.\n\nScott Settersten -- Chief Financial Officer\n\nYeah. Thanks Mike. I think probably gets to a larger picture versus the AUR piece of your question there. So let me start it because I know this is at the top of the list for all investors right now as we're thinking about next year.\n\nSo let me start by saying we are very proud of what the Ulta Beauty team has been able to deliver over the last several years with respect to our operating margin profile overall. We continue to lead the beauty category, capture market share gains, and deliver some of the strongest operating margins in all of retail, while also absorbing significant cost pressures, driven by an e-commerce business that we doubled the size of since 2019, along with wage pressures, supply chain disruptions, fuel costs and other inflationary pressures across the business. And also continuing to make significant investments to innovate and build a healthy and vibrant business for the long term. Having said that, we've been very transparent with investors all year when discussing the continued beauty rebound in 2022, and that sales trends have been much stronger than what we expected back in the fall of 2021 when we provided our long-term financial outlook.\n\nAnd that sales performance is driving stronger-than-expected operating margins, driven primarily by fixed cost leverage price increase benefits in gross margin that are extraordinary this year and more moderate promotion levels and that the sales increases have been outpacing the inflationary cost pressures that we've seen in our business. So, again, big picture, let me just lay out a couple of the bigger variables here as we're thinking about modeling for next year. So again, back to what we referenced in the script, we do expect we can grow sales next year in line with our longer-term 3% to 5% comp target. So, on the top line, merchants have done an outstanding job.\n\nWe feel good about the queue for newness next year. We've got some great things lined up. But we're going to be lapping over some extraordinary newness this year, right, with these leading brands in each of our key categories, Fenty in makeup, Drunk Elephant in skincare, and OLAPLEX in haircare, all right? Price increase is another major lever. So, we're kind of in uncharted territory right now, right? The percentage of our assortment where we've seen increases and the depth of those increases is something we've never experienced in all the years here at Ulta Beauty.\n\nSo, we're going to be cycling over some of that next year, and it's kind of yet to be seen how the consumer is going to react to that over the longer period of time. So, elasticity and resilient, while it's been resilient so far, there's a question of how far we're able to push this without seeing some kind of impact. Lastly, on the top line, I'd say we're going to lean into our very powerful loyalty program, the benefits of our credit card. And of course, we're going to look to continue to see benefit from our Ulta Beauty at Target relationship next year.\n\nThinking about the rest of the P&L then, on the gross margin piece of it, promotion levels, we think, will likely be higher next year than they have been the last couple of years. Channel mix then kind of a benefit this year because stores, the big bounce back and traffic we see in stores has helped right some of the margin headwinds that we see from our digital business. Pricing benefits, again, this gross margin benefit from the timing between price versus the inventory change as it contributed meaningful benefits this year. And again, some of that will recur next year, but the question is, to what significance? Wage pressure will continue.\n\nFuel will probably moderate, right? We've seen that here more recently. Supply chain investments will ramp up next year. And of course, UB Media will accelerate, will step up there. So, ramp-up will contribute on the margin line, gross margin line.\n\nIn SG&A, we got store payroll upward pressure on wages, which we expect to continue, maybe not to the same rate we've seen here this year, but certainly will continue upward. Variable cost, inflationary pressures, again, credit card fees, I mean, we're seeing it in every part of our business right now. We've been able to mitigate a lot of that. And super high sales increases help camouflage that a bit as well.\n\nAnd then, of course, our strategic investments, as we mentioned in the script, we plan to ramp those up, and that's coming in 2023, so SOAR, IT, other digital investments, UB Media, and UB and Target as well. So, we've got mitigating strategies in place, right? You've heard us talk about some of these over the years, and we've demonstrated the company we are able to deliver, we've delivered hundreds of millions of dollars in benefits from our ESG efforts, and we've got plenty of margin enhancement, and cost optimization opportunities in front of us, and we're building out new continuous improvement capabilities, which, again, you've heard us talk about are building for the long-term cost optimization of the business. So, I'll close it up by saying, even in what we see as a more uncertain environment, being with us here into next year, we are well-positioned. We've got a strong business model.\n\nWe are in a great category that's growing and we've got a very -- a business that delivers very healthy margins. And we expect to be able to grow the top line next year even off extraordinary performance in 2021 and '22. So, we feel good about where we are.\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nThanks, Scott.\n\nOperator\n\nAnd our next question comes from the line of Lorraine Hutchinson with Bank of America. Please proceed with your question.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Good afternoon. Your sales guidance continues to include pressure from increased points of distribution for Prestige. Can you talk about what you're seeing in the fleet when one of these new stores open and how meaningful it is?\n\nDave Kimbell -- Chief Executive Officer\n\nYeah. We're certainly watching, monitoring, tracking all competitive activity across the landscape. And as I've said before, our focus continues to really be on offense for us to really leverage what we do best, the unique differentiated model we have. Nobody does what Ulta Beauty does.\n\nSo, our competitive strategy is to lead and to drive our business forward. Having said that, we are watching, there are changes. When stores, competitive stores open, depending on the circumstances of the situation, we can see a relatively minor impact. Typically, over time, our business sustains and recovers any short-term impact.\n\nSo, we're confident. And again, our focus is on delivering what our experience is. What we found over time is doing that allows us to continue to find growth and deliver an experience that our guest continues to want to find at Ulta Beauty.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question comes from the line of Ashley Helgans with Jefferies. Please proceed with your question.\n\nAshley Helgans -- Jefferies -- Analyst\n\nHi, thanks for taking our question, and congrats on the quarter. So, we just wanted to ask about the promotional landscape that you've seen heading into holiday. And if you feel discounting at other retailers has been as heavy as initially expected. Thanks.\n\nDave Kimbell -- Chief Executive Officer\n\nYeah. I guess, we'd say for holiday, a little early to know exactly. I mean, we're right in the middle of the battle here, I guess, with our biggest, biggest weeks of the holiday period still ahead of us. And we know we've been -- I think we shared this at our last call and really any time we're talking about holiday.\n\nHoliday is a more promotional period. The November, December period is different than the other 10 months of the year because the gifting aspects, the idea that we're not just competing with beauty. We're competing with other gift categories across retail. The landscape, it's hard for us to judge midstream exactly.\n\nWhat we've been delivering is an aggressive promotional, but not wildly different than what we've done in the past. So we've seen consistency there. So far, we're really encouraged by what we're seeing, feeling like Ulta Beauty is well-positioned and competing effectively, but we're also monitoring, tracking and ensuring that we close out this next, I guess, 24, 25 days with excellence as we complete the holiday, and that's our focus going forward.\n\nAshley Helgans -- Jefferies -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nAnd our next question comes from the line of Mike Baker with D.A. Davidson. Please proceed with your question.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nHey, thanks. I just wanted to ask a little bit about cadence, the month throughout the third quarter. And then November, you said it slowed. I guess, I'm just wondering, within your 6% to 8% guidance for the fourth quarter, we know the comparisons get easier in December relative to November.\n\nIs that contemplated within the guidance? Or maybe another way to ask it is, is November slow? Did it slow below 6% to 8% and you need to pick up to get there? Or is it within that range? Thanks.\n\nDave Kimbell -- Chief Executive Officer\n\nWell, what I will say is first on the third quarter, we saw a strong growth throughout the quarter, although October was modestly -- decelerated modestly, but still double-digit growth in each period of the quarter. As is suggested in our 6% to 8% guidance for the fourth quarter, we're anticipating deceleration from what we saw in the third quarter and really throughout the year. And we've been kind of anticipating this all year as we -- our comps are strong. And again, we're in a different type of period in holiday.\n\nWe're not going to get into specific week-by-week replay yet. Well, as I said, we're right in the middle of it. We've got big weeks ahead of us. We'll obviously share -- when we share our fourth quarter results, all the details.\n\nBut what I will say is, again, reflected in the six to eight is an anticipated healthy growth, but not to the level of what we saw in the third quarter, and we're encouraged by what we're seeing so far in the holiday period, knowing that there's a lot of ground still to cover as we complete holiday. And January is a big important period for us as well. So still a lot ahead of us but encouraged by what we're seeing so far.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question comes from the line of Adrienne Yih with Barclays. Please proceed with your question.\n\nAdrienne Yih -- Barclays -- Analyst\n\nGreat. Thank you very much. Scott, I was wondering if you can talk about -- you had mentioned sort of the vendor contribution that was offsetting some of the lower marketing spend. So does that mean that they want to present their brands more aggressively, and therefore, are taking more space either on the 21 Days of Beauty, or if we purchase that type of thing.\n\nAnd then I also wanted to know, Dave, at the beginning of the pandemic, you pulled out of the international Canada opening. Now that the domestic business seems to be on pretty good footing, how are you thinking about kind of reentry into that market? Thank you very much.\n\nScott Settersten -- Chief Financial Officer\n\nYeah. So, I'll start. So, the first part of your question, yes, it's an accounting recognition of how the debits and credits flow through the P&L, Adrienne. So, there's really nothing related to the vendor choices or how we work or execute any of those kinds of things.\n\nIt's just accounting convention. Matching up expense with income when it's incremental expenses related to these marketing activities and then the rest of it kind of rolls through the gross margin through our inventory accounting.\n\nAdrienne Yih -- Barclays -- Analyst\n\nOK. Thank you.\n\nDave Kimbell -- Chief Executive Officer\n\nAnd on your question about Canada and international, as you stated, we obviously stopped that early in the pandemic. Right now, we have no plans, consistent with what we shared at our Analyst Day. No plans to expand internationally at this time, although -- and we are always looking for opportunities to find new growth potential. And so, in our future at some point, that's possible, but nothing in our immediate plans for sure.\n\nAdrienne Yih -- Barclays -- Analyst\n\nOkay. Thank you very much. Best of luck and thank you.\n\nOperator\n\nAnd our next question comes from the line of Korinne Wolfmeyer with Piper Sandler. Please proceed with your question.\n\nKorinne Wolfmeyer -- Piper Sandler -- Analyst\n\nHey, good afternoon. Congrats on the quarter and thanks for taking the question. So, I'd like to expand a little bit on what you're seeing within the specific product categories. I mean, you did know pretty strong growth for all categories.\n\nBut as we head into the early parts here of Q4 and the holiday season, can you talk about kind of specific trends you're seeing for cosmetics, skincare, fragrance? What categories are maybe requiring a little bit heavier promotional activity for holiday? Just any color you can provide there would be helpful. Thank you.\n\nDave Kimbell -- Chief Executive Officer\n\nWell, I'll start with -- we're really encouraged by what we saw in the third quarter. And really, we've seen this trend for the first three quarters, a strong growth across all categories, which is obviously a great place to be. The strength we're seeing in our business is not outweighted by one specific category. It's balanced across our portfolio.\n\nAnd it's because we've -- our team across both merchandising, marketing, our stores have done a great job engaging our guests in our entire assortment. And so, we're excited and encouraged to see strength across double-digit growth across all key categories. Each one has unique stories, make up driven by this increased engagement in social activities, plus strong product trends that are highlighted through social media and new product growth that a spectrum of newness that's really working. So, a collection of activity that's coming together, both product newness, marketing newness, and engagement opportunities.\n\nSkincare, continued strength by both science-backed, clinically proven dermatologists recommended solutions. So, that engagement that many people elevated through the pandemic has been sustained. It's actually our fastest-growing category in the third quarter. Haircare, you know we've been driving that growth as a leader in hair care and strong trends, a healthy portfolio of newness that continues to drive great engagement.\n\nAnd then really all year, pleased with fragrance and bath. As I look and the innovation and engagement, I mentioned Gen Z being a part of that, and really the whole portfolio working quite well across that important category. As we look in the fourth quarter, again, not getting in, we won't get into any specifics right now. We're in the middle of holiday.\n\nAnd so, there's a lot to cover. I wouldn't say there's anything jumping out uniquely for any category from a promotional standpoint. And we come in really with a focus in the fourth quarter of what we call gifting and glamming. And the gifting component is a mix of holiday-specific, but core items that serve all year long, and the team has done a nice job with a balance there.\n\nSo we feel great about our assortment. It's -- again, we're encouraged by what we're seeing at this point in the holiday and confident that we'll be able to deliver a strong holiday across all of our categories.\n\nKorinne Wolfmeyer -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nAnd our next question comes from the line of Olivia Tong with Raymond James. Please proceed with your question.\n\nOlivia Tong -- Raymond James -- Analyst\n\nThanks. Good afternoon. I have two questions. First one on newness.\n\nBecause you had a few brands that really anchored newness and I would imagine contributed toward the upper end of your average ranges this year. So, could you talk about your view on innovation, the level of innovation as you think about the next 12 months versus the prior 12? And then you also mentioned in your prepared comments that mass is outperforming for stage, but in your view, wasn't definitively trade down. So, could we dig into that a little? Is there more newness in one versus the other? Or any other reason that you think that mass is starting to outperform prestige, if it wasn't related to such consumer? Thank you so much.\n\nDave Kimbell -- Chief Executive Officer\n\nYeah. So just on the broader idea of newness, it's important to our business and the beauty category always. And as I mentioned in our remarks, typically 20% to 30% of sales are new items, and that's the range that we will land this year, and anticipate we'll be able to continue to be in that range going forward. As I -- we did -- Scott mentioned, we had some really important new brands in 2022.\n\nBut we're excited and encouraged by the outlook. This category, both big brands like some mentioned, but also new and emerging brands that take off and connect. I mentioned a couple of those like Good Molecules, among others. So, we've got a portfolio of brands as we look forward into next year and confident about newness, both new brands and newness from our existing brands.\n\nThat plays a big role. And as we work with all of them and see their pipeline, we're encouraged by what we're seeing. The trends are strong across each of the categories. And we're seeing healthy growth.\n\nAnd we think newness will play an important part in that going forward, knowing that we've got some of these big brands that Scott mentioned earlier to launch or to lap. As it relates to the mass and prestige, we did see mass growing somewhat faster than prestige. But both sides were strong and healthy. So, I wouldn't say the strength in mass or the somewhat higher growth in mass as we look at it and do -- and analyze our members didn't come at the expense of Prestige.\n\nIt's just a came because mass is strong and there's good newness brands like e.l.f., NYX, Ordinary, La Roche-Posay, CeraVe, I mean there's strong, newness and engagement. And so, they're just capturing and growing. But prestige is doing really well, too. So, I don't look at them being a little bit higher than prestige as coming at the expense of just their -- several of these brands and some of our bigger brands are hitting the mark, and that's working.\n\nAll of our analysis suggests that we have not seen clear signs of trade down. But I'd reinforce, if there is that, we are uniquely positioned to deliver and support our guests regardless of what choices they make from a price point.\n\nOlivia Tong -- Raymond James -- Analyst\n\nGreat. Thank you. Best of luck.\n\nDave Kimbell -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Michael Lasser with UBS. Please proceed with your question.\n\nMichael Lasser -- UBS -- Analyst\n\nGood evening. Thanks a lot for taking my question. Scott, can you help stress test a couple of the key variables that are going to impact Ulta's gross overall operating margin in 2023 between the expense spending that you slated for this year and the step-up that you had originally planned for 2023? Is it reasonable that we think around -- about that as like a $50 million increase in the next year? And then the second part of the question, you're on pace to have a 15.5% to 15.6% operating margin this year. If you were to take the level of promotional activity from 2019 and apply it, all else being equal, to this year, is it reasonable that you would have like a 14.5% operating margin? So, a worst case, if promotions go back to 2019 levels, that would be like 100 basis points to the operating margin.\n\nThank you very much.\n\nScott Settersten -- Chief Financial Officer\n\nIs this a Michael Lasser that I know? I mean [Inaudible]\n\nMichael Lasser -- UBS -- Analyst\n\nI tried. I tried.\n\nScott Settersten -- Chief Financial Officer\n\nI appreciate your question, Michael. Yeah, and I understand. But we can't -- we're not going to piecemeal out the bits and pieces of the variables and the formula for our EBIT margin for next year. It's just -- it's too hard, and that's why we said we would -- we'll update in March if it's appropriate, OK? And we kind of see how 2022 shakes out here in totality.\n\nAnd then look at our '23 plan, which we're in the heat of battle on right now, finalizing here, which the final step of that is as we get finalized through the holiday season, so to see what the numbers look like. So, we either -- as I've laid out for Ike here a little bit earlier in the call, all the different variables, and of course, they're all on wide continuums, right? And so, we're doing our best to assess each one of those. And coming up with our best idea of how we think it's going to shake out for next year. Again, we're very optimistic about the long-term options for our business.\n\nI mean, we're in a great position. We've got lots of levers to push and pull, to deliver healthy operating margins over the long term.\n\nMichael Lasser -- UBS -- Analyst\n\nHave a great holiday. Thank you.\n\nKiley Rawlins -- Vice President, Investor Relations\n\nThanks, Michael. John, I think we have time for one more question, please.\n\nOperator\n\nOK, great. And the final question comes from the line of Michael Binetti with Credit Suisse. Please proceed with your question.\n\nMichael Binetti -- Credit Suisse -- Analyst\n\nHey, guys. Thanks for taking our question. Maybe since you mentioned it a few times now, how much is shrink versus 2019 as a percent of sales? I'm wondering if that's becoming a meaningful number. And maybe you could just help us orient how much incentive comp influences the margin this year.\n\nI don't know if I heard that. And I guess, just maybe touching on Michael's question, you seem to be getting the higher margins the right way here with all the extra sales and gross profit dollars from driving the business and leveraging the fixed costs. You'll be at a revenue level this year, we didn't expect to see until 2024, and you're still seeing the algo next year. I know you gave the long list to Ike in the middle of the P&L, but it feels like you earn some upside to the framework at that 13% to 14%.\n\nI'm just wondering if you can give us color on what you think relative to the framework you laid out remain structurally higher or what you think needs more investment than what you thought at the Analyst Day framework to bring all those extra dollars down to that 13 and 14?\n\nScott Settersten -- Chief Financial Officer\n\nYeah, Michael. So, working backwards. So, the shrink part of your question, I mean shrink like when you think about our category, we are especially susceptible to some of the trends that you see across retail. But that's not new to us.\n\nWe've been dealing with this since the very early days. because of the category we operated in. So, I want to make sure I say thank you to our teams, to our LP teams, our store operations teams, and all the support personnel that have been working hard to try to mitigate the losses that we've seen step up here, accelerate over the last couple of years. Again, when times get tough, shrink goes up.\n\nWe've seen that in retail over a long period of time. On the incentive compensation, I would say, we -- for the year, it's going to be flattish versus 2021. Again, our performance has been super strong this year. And then back to the operating margin question, which everyone has, again -- we really can't provide any more quantitative detail at this point in time.\n\nI would just point back to the long laundry list of different variables that I described earlier in the call. And just that we're a pragmatic team. We're trying to optimize with all the things that we have, the challenges and the opportunities, we're going to do our best to lean in where we can and try to optimize and deliver the best overall financial performance that we're capable of, whether it's the fourth quarter or 2023. You can rely on us for that.\n\nMichael Binetti -- Credit Suisse -- Analyst\n\nThanks, guys.\n\nDave Kimbell -- Chief Executive Officer\n\nAll right. With that, I'm going to wrap it up. But I want to first thank you. Thank you for your interest and engagement in Ulta Beauty.\n\nAnd I want to close by thanking our more than 40,000 Ulta Beauty associates for delivering another excellent quarter, while also executing against our strategic priorities. Our teams have been working hard to get our stores, digital channels, and DCs ready for this holiday season, and I sincerely appreciate their focus and commitment to delivering meaningful guest experiences across every single touch point. We hope you all have a happy and healthy holiday season, and we look forward to speaking to all of you again in early March when we report results for fiscal 2022 and share our plans for fiscal 2023. Have a great evening, everybody.\n\nThanks, again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKiley Rawlins -- Vice President, Investor Relations\n\nDave Kimbell -- Chief Executive Officer\n\nScott Settersten -- Chief Financial Officer\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nIke Boruchow -- Wells Fargo Securities -- Analyst\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nAshley Helgans -- Jefferies -- Analyst\n\nMike Baker -- D.A. Davidson -- Analyst\n\nAdrienne Yih -- Barclays -- Analyst\n\nKorinne Wolfmeyer -- Piper Sandler -- Analyst\n\nOlivia Tong -- Raymond James -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nMichael Binetti -- Credit Suisse -- Analyst\n\nMore ULTA analysis\n\nAll earnings call transcripts"
}