{
  "companyName": "PubMatic, Inc.",
  "companyTicker": "PUBM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/pubmatic-inc-pubm-q2-2022-earnings-call-transcript/",
  "content": "PubMatic, Inc. (PUBM -0.70%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nWell, hello, everyone, and welcome to PubMatic second quarter of 2022 earnings webinar. My name is Kelsey, and I will be your operator today. Before I hand the call over to the PubMatic team, I'd like to go over just a few housekeeping notes. As a reminder, this webinar is being recorded.\n\nAfter the speakers' remarks, there will be a Q&A session. [Operator instructions] We thank you all for your attendance today, and I will now turn the webinar over to Stacie Clements with the Blueshirt Group. Stacie, please go ahead.\n\nStacie Clements -- Investor Relations\n\nThank you, operator, and good afternoon, everyone. Thank you for joining us on PubMatic's earnings call for the second quarter ended June 30, 2022. Joining me on the call are Rajeev Goel, co-founder and CEO; and Steve Pantelick, CFO. Today's prepared remarks have been recorded, after which Rajeev and Steve will host live Q&A.\n\nA copy of our press release can be found on our website at investors.pubmatic.com. Before we start, I would like to remind participants that during this call, management will make forward-looking statements, including, without limitation, statements regarding our future performance, market opportunity, growth strategy, and financial outlook. Forward-looking statements are based on our current expectations and assumptions regarding our business, the economy, and other future conditions. These forward-looking statements are subject to inherent risks, uncertainties, and changes in circumstances that are difficult to predict.\n\nYou can find more information about these risks, uncertainties, and other factors in our reports filed from time to time with the Securities and Exchange Commission, including our most recent Form 10-K and any subsequent filings on Forms 10-Q or 8-K, which are on file with the Securities and Exchange Commission and are available at investors.pubmatic.com. Our actual results may differ materially from those contemplated by the forward-looking statements. We caution you, therefore, against relying on any of these forward-looking statements. All information discussed today is as of August 8, 2022, and we do not intend and undertake no obligation to update any forward-looking statement, whether as a result of new information, future developments, or otherwise, except as may be required by law.\n\nIn addition, today's discussion will include references to certain non-GAAP financial measures, including adjusted EBITDA and non-GAAP net income. These non-GAAP measures are presented for supplemental informational purposes only and should not be considered as a substitute for financial information presented in accordance with GAAP. A reconciliation of these measures to the most directly comparable GAAP measures is available in our press release. And now, I will turn the call over to Rajeev.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nThank you, Stacie, and welcome, everyone. We delivered another terrific quarter with revenue growth and profitability exceeding our expectations. Our compelling combination of durable, profitable growth once again demonstrates our market leadership based on our differentiated infrastructure-driven approach to digital advertising. Organic revenue grew 27% year over year, well above market growth rates.\n\nIn fact, we saw an acceleration in year-over-year growth as the quarter progressed, with June being our strongest month of the quarter. Our results demonstrate the number and magnitude of growth opportunities we have incorporated into our business. For Q2, key growth drivers that exceeded our expectations include broad strength in the Americas region, CTV publisher acquisition, and existing publisher expansion and supply path optimization. We also benefited from a well-diversified portfolio of advertisers with over 20 verticals contributing to growth.\n\nOur pace of growth reflects market share gains and our continued industry consolidation. GAAP net income margin was 12% and adjusted EBITDA margin was 37%. However, margin levels highlight the leverage in our model, which importantly allows us to invest for the future even during periods of macroeconomic uncertainty or downturn. We believe this is a strategic advantage as we're able to invest in our platform, solutions, and go-to-market efforts in a way that others may not be able to in uncertain times.\n\nJust as importantly, we generate healthy cash flows. I'm incredibly proud of what our team has achieved in Q2. This quarter was our most challenging yet since our IPO, given the number and magnitude of macro events that are buffeting the economy, including inflation, rising interest rates, war in Europe, and ongoing supply chain disruptions. These challenges required us to be nimble and agile in order to serve our customers well and grow our business in a highly efficient manner.\n\nWe rapidly developed software, leveraged our full operational control of our infrastructure, and continued to scale our go-to-market presence around the world. I cofounded this company under the premise that programmatic advertising has the potential to fuel the endless potential of digital content creators. The new cycle of the past few months has reinforced this idea with some of the world's most premium content companies announcing plans for programmatic advertising to be a critical component of their growth strategy. At PubMatic, we've built our business on the belief that all advertising will be digital and all digital advertising will be transacted programmatically.\n\nAnd this is quickly becoming reality. However, there are other crucial dynamics at play in our industry. With the rapid expansion of the digital advertising ecosystem, we are seeing both accelerated innovation and increased fragmentation across the supply chain with new solutions emerging and M&A shaking up the market. At the same time, our industry is attracting more scrutiny from privacy and antitrust regulators around the world.\n\nAs a result, our customers are increasingly looking for independent, unbiased solutions to help them navigate these changes and maximize the value of their advertising strategies. As champions of the open Internet, we have developed the technology to enable both our customers and us to succeed. We are building the supply chain of the future, one that is transparent, efficient, effective, privacy compliant, data-rich, and environmentally sustainable. Our focus on delivering the leading technology infrastructure to power this future is resonating with both new and existing customers and is a key driver of our continued success.\n\nThis summer, I spent considerable time working outside of the U.S. for the first time since the pandemic. I visited with customers, prospects, and partners at Cannes Lions, the first in-person global gathering of media and advertising leaders from around the world since 2020, where there was an overwhelming interest from our existing customers to find new opportunities to grow our relationship and from prospects wanting to take advantage of our technology and infrastructure. I also spent time in London, Madrid, and Milan, meeting with team members and customers from across the region.\n\nIn fact, at one point, I visited five countries in five days. I met with publishers, advertisers, agencies, DSPs, and online retailers. A consistent theme across many of my meetings is that they are consolidating their business relationships to fewer larger platforms. They no longer want to manage hundreds of vendors in their digital advertising supply chain but are instead focused on deepening their use of key technology partners to create more efficiencies within their business while generating superior outcomes.\n\nI came away optimistic for deeper supply path optimization partnerships with agencies and advertisers as our prior experience indicates that in times of economic stress, these entities lean into nimble, technology-driven partners that can increase their efficiency, help them save on operational costs, and enable new revenue streams. PubMatic is a leader in this consolidation as evidenced by our rapid growth, ongoing market share expansion, and strong net dollar retention rate. Our deep and long-standing customer relationships and track record of solid performance create opportunities for expanded use of our platform, increasing access to valuable inventory, and our ability to generate high-margin revenue for publishers is fueling growth. For the trailing 12 months, net dollar retention was 130%, a standout achievement among our software peers.\n\nOn the buy side of the ecosystem, consolidation is manifesting itself in several ways. In Q2, supply path optimization, or SPO, represented approximately 30% of total activity on our platform, up from 24% a year ago. In addition, the efficiency of our platform and the access to inventory and audiences from top publishers is reinforcing the value of our platform to both publishers and buyers. DSP partners are also engaging in consolidation, allocating more impression capacity to the PubMatic platform because of the quality of our inventory and the efficiency of our platform.\n\nFor example, in Q2, a major DSP nearly doubled the impression capacity allocated to PubMatic versus Q1, which allowed us to grow their spend with PubMatic considerably. Importantly, this fuels our flywheel. As we attract more spend from buyers, publishers increase their revenue from PubMatic, which causes them to add more inventory formats, geographies, or properties to our platform which, in turn, provides us with an increased ability to invest and innovate. We view this as a significant moat that we continue to scale as we secure growing capacity share for many of the largest DSPs.\n\nWith top publishers and buyers actively consolidating their spend on to PubMatic, our runway for growth has never been clear. I remain as optimistic as ever that we will meet our long-term market share goals of 20% plus. Customers and partners value our global omnichannel scale, as well as our robust solutions that solve for the future of audience addressability. They also benefit from the efficiencies gained from our owned and operated infrastructure, superior ROI outcomes, and our ability to invest in continued innovation on their behalf.\n\nAs macro uncertainties continue to unfold, it's possible that the efficiencies gained from our platform accelerate consolidation. By partnering with us, less capital is needed for publishers or buyers to build out addressability solutions, proprietary header bidding wrappers, or inventory connections. In addition, buyers and publishers gain efficiencies from our already scaled, owned, and operated infrastructure, which will take them years to achieve on their own. In an environment where investment and resources carry greater discipline, partnering versus building could be a strategic decision that accelerates industry consolidation onto those platforms that provide the most value.\n\nOur omnichannel approach gives buyers flexibility as consumer trends shift. It also instills resilience as we are not dependent on a single format or channel for growth. CTV, one of the fastest-growing formats, has been getting a lot of attention in the market over the past couple of years, and rightly so. The rapid consumer behavior shift toward streaming has unlocked tremendous opportunity for the market and we have certainly benefited from that momentum.\n\nIn Q2, we saw an increase of over 150% year over year in our CTV business, and we monetized inventory for 196 publishers as our pace of CTV new publisher acquisition accelerated. At the same time, the bigger market opportunity will remain in programmatic online video ad spend, which represents three to four times that of CTV and OTT. Our combined omnichannel video, including CTV, represented over 30% of revenue in Q2. As we move toward a post-cookie world, third-party data is increasingly becoming less sustainable and relevant.\n\nInstead, the value of data is shifting to the sell side of the ecosystem, which is at the nexus of the publisher and the consumer. We see a significant role to play as a result of being a leading technology provider to top publishers around the world. For this reason, we have been investing in industry-leading solutions in this area for over three years now. We recently launched Connect, a comprehensive and fully integrated platform for media buyers to seamlessly connect with their target audiences across the open Internet.\n\nConnect combines known identity, first and second-party data, contextual signals, seller-defined audiences and modeled audiences into one platform with robust reporting and transaction management capabilities. Buyers are seeing the benefits of activating this data on the sell side closer to the consumer in terms of both scale and performance. Sunscreen brand Banana Boat, who's able to achieve better campaign performance for a video ad campaign by activating Lotame's Panorama ID through our Connect platform, outperforming even cookie-based channels. This case study not only demonstrates the value of PubMatic's Connect solution but also how our technology prepares customers for the pending deprecation of the cookie.\n\nLotame is one of multiple identity and data providers currently available to be targeted through Connect. Our ability to connect audiences and media is driving further ad spend consolidation on our platform and will likely be a further driver of SPO. IPG's Matterkind and Omnicom Media Group's PHD media have seen significant results for their clients through Connect. Additionally, major agency holding companies such as the Havas Media Group are expanding their supply path optimization partnerships with PubMatic to take advantage of the cookieless benefits of Connect in addition to our omnichannel scale, efficiency and nimble technology development.\n\nAs more ad dollars flow into the open Internet, buyers and publishers are seeking transparent and efficient advertising solutions. Our unique approach to digital advertising provides infrastructure in which all stakeholders benefit, which is all the more valuable in today's dynamic economic environment. A further driver of our industry consolidation is the sustainable way in which we are building the digital advertising supply chain of the future as our customers and partners are increasingly seeking responsible technology partners. Along with our commitment to delivering value to our customers, we remain committed to the sustainability of the environment in which we all live.\n\nThis quarter, we announced that the energy use across our data centers is now 100% renewable energy. This is something we have been working toward for several years. With this announcement, any advertiser or agency looking to buy media in a sustainable way, and there is a rapidly growing group of buyers that are, can now do so on the PubMatic. As we look to the second half of the year, we will continue to see macro challenges.\n\nQ3 has typically been the most challenging quarter to forecast so we're being prudent in the very short term as advertisers adjust to the macroenvironment. As we take a broader six-month view, we are confident in our ability to operate with the same agility we always have. History has proved our resilience through peaks and balance as our business is increasingly well diversified across verticals, ad formats, and channels. Moreover, we have a significant number of growth opportunities that we are well positioned to take advantage of.\n\nDespite the near-term economic uncertainty, we know our usage-based model drives market share gains as we consolidate the space. With consolidation comes greater visibility, diversity in the business, and a widening competitive moat. It also fuels a high degree of profitability, which allows us to focus on the long term, creating value and innovation across the digital advertising ecosystem at every step. Before I turn it over to Steve, I want to give special thanks to our team for their strong execution in a challenging environment.\n\nTheir commitment to our customers and partners is unwavered. The digital advertising landscape continues to evolve at a rapid pace with growth to be had across formats, channels, geographies and new addressable markets like retail media. I couldn't be more excited for the future and how we are positioned for continued consolidation and market leadership. I also want to welcome Shelagh Glaser and Jacob Shulman to our board of directors and our Audit Committee.\n\nShelagh brings decades of financial experience from her work at Intel and currently as CFO of Zendesk. Like Shelagh, Jacob brings more than 25 years of experience, building financial infrastructure and driving growth at multinational enterprises. Jacob currently serves as CFO of JFrog. As we build for the future and continue to scale our business, their additions bring deep expertise to our organization.\n\nLet me now turn it over to our chief financial officer, Steve Pantelick, to provide additional detail.\n\nSteve Pantelick -- Chief Financial Officer\n\nThank you, Rajeev, and welcome, everyone. Our second quarter results exceeded our expectations and were noteworthy in light of the macro challenges across the globe. We delivered $63 million of revenue, representing year-over-year growth of 27%. GAAP net income was $7.8 million or 12% margin and fully diluted EPS was $0.14.\n\nAdjusted EBITDA was $23 million or 37% margin. Our cash flow from operations was $20.5 million. The second quarter marks our eighth straight quarter where we grew significantly above our long-term growth target of 20-plus percent, our 13th straight quarter of positive GAAP net income, and our 25th consecutive quarter of positive adjusted EBITDA. These results once again underscore the durable nature of our revenue and profit growth built on the multiple growth drivers embedded in our business.\n\nThey also vividly illustrate our diversified business within the open Internet, as well as our team's ability to consistently execute our business plan while navigating through obstacles and changing conditions. Turning to the highlights for Q2. We saw the importance and value of being a scaled omnichannel platform. Overall, advertiser usage increased in terms of the number of advertisers spending on our platform and average dollar spend.\n\nEach of our top 10 ad verticals grew double digits year over year. In aggregate, ad spend for the top 10 verticals increased more than 40%. Shopping continues to be a strong performer while travel extended its recovery and increased by over 100%. Food and drink, and arts and entertainment were also among the fastest-growing categories.\n\nAutomotive and personal finance, also included in our top 10 verticals, grew at a slower pace. In terms of the progression of ad spending through the quarter, we saw softness early in Q2 for some verticals that was more than offset by strength elsewhere. This underscores the advantage of operating a platform with diverse business activity that appeals to a broad range of brand and performance advertisers across both physical goods and services. In Q2, our year-over-year revenue growth accelerated led by mobile and omnichannel video which increased 43% year over year.\n\nThis growth was on top of prior year's growth of more than 100%. Overall, mobile plus omnichannel video represented a record high 72% of our total revenues. The star of the quarter was omnichannel video, which grew 58%. Within omnichannel video, CTV revenues increased 150% year over year.\n\nUnderscoring the diverse activity on our platform, our total display business also accelerated compared to Q1 and increased 19% year over year. In terms of our regional growth, there was some softness in EMEA and APAC but all regions grew double digits. Americas delivered above expectations. Supply path optimization relationships continue to play a key role in terms of our growth and revenue stickiness as advertisers and agencies expand usage of our platform.\n\nIn Q2, we signed new SPO deals, renewed existing agreements, and expanded activity via these deals. We plan to continue investing behind this opportunity focused on helping buyers find the right audiences and media on our platform. The proportion of SPO activation to total ad spend increased from Q1 and represented approximately 30% of activity on our platform. An important indicator of publisher satisfaction and usage of our platform is net dollar-based retention.\n\nOn a trailing 12-month basis, net dollar-based retention was 130%. As communicated in prior quarters, this metric has normalized now that Q2 2020 results are no longer in the comparison set. Our continued success in achieving high gross margins is a result of our strategy and execution. We aim to put into service our plan at maximum capacity every calendar year by the beginning of Q4.\n\nOnce capacity is put in place, it becomes a fixed cost in the near term that we then leverage over the succeeding periods. In seasonally lower spend periods such as Q1 and Q2, our gross margins are typically lower than second half levels. As the year progresses, the combination of ongoing infrastructure optimization, expansion of activity with our new and existing customers and higher seasonal ad spending results in significant gross margin leverage. By owning and operating our infrastructure, we have been able to drive down our unit costs.\n\nOver the last two years, we have reduced our cost of revenue per million impressions processed by approximately 50%. Our experience has shown us that the return on investment for incremental capacity is high and typically pays for itself on a cash basis in months. With this cost advantage, where we see incremental revenue opportunities, we will expand our processing capacity and further increase our competitive moat. In Q2, we continued making investments in innovation and adding go-to-market team members.\n\nThese investments, coupled with our focus on operational excellence have been instrumental to our strong financial results. Operating expenses in the second quarter were $34.3 million, up 30% year over year, reflecting a combination of increased headcount for growth and stock-based compensation. Excluding stock-based compensation, Q2 operating expenses increased 27%. Q2 GAAP net income was $7.8 million.\n\nNon-GAAP net income, which adjusts for stock-based compensation, the unrealized gain or loss on equity investments, and related income tax effects was $13 million or 21% of revenue. Diluted EPS was $0.14, and non-GAAP diluted EPS was $0.23. Turning to our cash flow. We generated net cash from operating activities of $20.5 million in Q2.\n\nOur free cash flow was $5.7 million. We ended the quarter with cash, cash equivalents, and marketable securities of $183 million and no debt. Now looking to the second half of the year, we've been closely monitoring recent trends. Based on our assessment of the uncertain economic environment and factoring in both headwinds and tailwinds, we are taking a conservative approach to our guidance.\n\nIn terms of headwinds, we are anticipating further softening of European consumer demand amid worsening economic conditions stemming from the uncertainty around energy supplies to high inflation and rising interest rates. In the APAC region, as a result of periodic COVID-induced lockdowns that affect both the supply chain and consumer activity, we expect muted ad spending through the end of the year. In the Americas, we anticipate some limited softness but are assuming generally stable economic conditions for the balance of the year. In terms of tailwinds, we continue to see strong momentum with our SPO relationships, continued growth of our online video and CTV businesses and incremental clinical ad spend that will offset some of these challenges.\n\nWe also anticipate continued benefits from PubMatic's diversified business within the open Internet ecosystem. Taking these headwinds and tailwinds into consideration, beginning in Q2, we proactively initiated several cost-saving measures. We reprioritized our hiring for the balance of the year and move some incremental hiring to 2023, as well as reduced a portion of discretionary expenses such as marketing and T&E. Including these savings achieved in Q2, we anticipate unlocking several million dollars of savings by the end of the year relative to our original planning expenses.\n\nWe proactively took these steps because a hallmark of our long-term success has been agile execution in a changing environment coupled with our dual focus on revenue growth and profitability, which ensures we have the resources to consistently invest for future revenue opportunities. For Q3, specifically, we expect revenue between $66 million and $68 million or 15% at the midpoint for year-over-year growth. Keep in mind that we're comparing against a 54% growth rate from Q3 last year. On a two-year stack basis, our guidance translates to approximately 70% growth.\n\nWe expect adjusted EBITDA between $23 million and $25 million or approximately a 36% margin at the midpoint. For Q4, we are adopting a conservative outlook as well based on the challenging economic conditions cited earlier. To be clear, we remain optimistic about growth from our SPO relationships, continued ramp-up of our omnichannel video business and incremental political ad spend. Based on our revenue overachievement in Q2 and the derisking of our second half, we are revising our full year revenue guidance to $277 million to $281 million, or 23% growth at the midpoint.\n\nWith digital advertising slated to grow approximately 12% in 2022, we are well positioned to continue to grow our market share. With the operating expense savings already in process, we anticipate that total second half GAAP operating expenses will be lower than previously communicated. We now expect full year operating expenses to increase approximately 30%. Due to the timing of investments, Q3 operating expenses will increase at a slightly faster rate year over year and Q4 expenses will increase at a slower rate.\n\nAs a result of our increasing global scale and favorable revenue mix toward high-margin video formats, combined with the cost optimization plans in place, we are increasing our full year adjusted EBITDA range to between $103 million and $108 million, or 38% margin at the midpoint. As has been the case in previous challenging environments we have successfully managed through, we will continue making targeted high ROI investments in pursuit of long-term market share gains. Our investment plans come from the conviction that we are still in the early days of our growth, and we see clear benefits from consistently investing to capture these large opportunities ahead of us. As previously shared, approximately 40% of our capex this year is focused on driving the newest and fastest-growing segments of our business, including new SPO capabilities, CTV expansion, and private marketplace scaling and efficacy.\n\nThis latter category, for example, grew over 150% this past quarter and is becoming an increasingly important part of our business. We anticipate capex between $33 million and $36 million this year. Based on timing of equipment availability and shipments, the bulk of our capex will occur this quarter and will reduce our free cash flow. We anticipate a return to a more typical pattern of free cash flow generation in Q4.\n\nLooking ahead, as video and other high-value formats become a greater share of our revenue mix and as we continue optimizing new infrastructure, we anticipate that our capex to revenue ratio will decline. With regard to the strengthening of the U.S. dollar, we anticipate the impact on our revenues to be neutral to positive because the transactions flowing through our platform are largely denominated in U.S. dollars.\n\nOn the expense side, we expect the U.S. dollar strength relative to the Indian rupee and U.K. British pound sterling to have a neutral to positive impact. In closing, our second quarter results underscore the strength of our platform and our team's ability to consistently execute our business plan while navigating through challenging conditions.\n\nThese factors give us confidence in our long-term prospects. We believe we have the right platform and the right approach to be at the forefront of our industry. We have built a business with structural advantages emanating from our owned and operated infrastructure and offshore R&D that enables us to expand our competitive moat and consistently invest in innovation on behalf of our publishers and buyers. We see a long runway of growth ahead of us as our TAM continues to grow, and we are well positioned with multiple growth drivers.\n\nWe are consolidating the sell side as one of the few scaled global omnichannel platforms. And our profitability gives us a high degree of agility and the ability to consistently invest for long-term market share gains. With that, I'll turn the call over to Stacie to open it up for questions.\n\nStacie Clements -- Investor Relations\n\nThank you, Steve. [Operator instructions] Our first question today comes from Shweta Khajuria at Evercore. Please go ahead, Shweta.\n\nOperator\n\nShweta, please go ahead with your question. You are now alive.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOh, I'm sorry. Can you hear me?\n\nStacie Clements -- Investor Relations\n\nYes.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nWe can, yes.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nSorry about that. OK, thanks Stacie. OK. A couple of questions for me, please.\n\nSo can you please talk about the macroenvironment that you're seeing quarter to date right now? So in the third quarter, A, across geographies, where is the most headwind you're seeing APAC or Europe; B, across channels; and C, also across verticals, which verticals are the weakest so far? And where do you see ongoing strength. That's the first question. And then the second is, could you please quantify the FX impact on your revenue and EBITDA in terms of dollar or percentage on your growth? Thank you.\n\nSteve Pantelick -- Chief Financial Officer\n\nSure. I'll take that. So let me start out with what we've seen quarter to date. First of all, there's two primary trends that we currently have observed.\n\nNumber one, we -- as I indicated in my prepared remarks, we saw some softness in a couple of verticals in Q2, and that softness has continued, notably in personal finance, in hobbies as an illustration. So those trends have stayed soft. In some cases, gotten a little weaker. Second, formerly fairly robust categories such as shopping and technology have also softened a bit over the last several weeks.\n\nNow stepping back and extrapolating from these recent data points, here are some of our observations. Number one, advertisers continue to spend based on the results in their own business. And while some are cutting back, others are certainly continuing to spend, and it's really a function of it's a case-by-case basis for advertisers. And what we think is going on in some cases, there's, I'll call it, a tapping on the brakes while advertisers assess their respective opportunities and challenges.\n\nNow the benefit of a company like ours is that we are a diversified business and we operate very -- relatively well in this kind of environment. So in terms of the -- where we're seeing the geographic weakness, we continue to see softness and our guidance assumes softness continuing in EMEA and APAC. At the same time, while we see some softness in the Americas currently, we're assuming that it's going to be a fairly stable economic environment during the balance of the year, and we don't see any dramatic changes in that regard. Now in terms of formats, we are seeing very strong results, as you saw in our Q2 numbers in the video category, omnichannel video, which is the composition of online video and CTV.\n\nAnd we do anticipate that's going to continue through the balance of the year. And then in terms of other areas of softness that we're seeing, I think in a big picture, it's probably display is the -- or non-video that we're seeing some softness.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you, Steve. And then could you please quantify the FX impact on the revenue and EBITDA?\n\nSteve Pantelick -- Chief Financial Officer\n\nSure. The benefit that we have as a company is that the large majority of our transactions are denominated in U.S. dollars, so we are actually seeing relatively limited FX impacts. And that's on the revenue side.\n\nAnd we're also seeing relative limited impacts on the expense side because our functional currency is U.S. dollar. So overall, FX is neutral to positive to PubMatic.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nAnd that was in Q2 and you expect that for the remainder of the year.\n\nSteve Pantelick -- Chief Financial Officer\n\nYes, absolutely.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thanks a lot, Steve.\n\nStacie Clements -- Investor Relations\n\nOur next question comes from Brent Thill at Jefferies.\n\nBrent Thill -- Jefferies -- Analyst\n\nGood afternoon. When you think about some of the areas that you showed really good strength, maybe perhaps better than a lot of us had anticipated, what do you think held up? What were the installations in your model and the areas that perhaps you maybe chime through that -- some of the fear of the digital ad space that slowed down? Why are you not maybe seeing it the same level as others have seen it?\n\nSteve Pantelick -- Chief Financial Officer\n\nSure. Hey, Brent, nice to connect with you. So I'll start out just why we had such a good Q2. You heard comments from Rajeev and I, but I'll just underscore a couple of really important points.\n\nWe saw significant growth in our omnichannel video business. It was up near 60% in Q2, and that was actually on top of over 100% year-over-year growth in the prior year for the same period. The other aspect is that our mobile plus omnichannel videos now -- video business is at a record high of over 70% of revenue. So what that demonstrates or illustrates is that we are indexed to the most favorable fastest-growing formats.\n\nAnd that's really a function of us being an omnichannel platform and we're able to deliver and offer to our advertisers the ability to reach the end consumer wherever they might be, which happens to be in mobile and omnichannel video. The other facet that was a notable strength in Q2 was the strength of our Americas business. And that helped offset the softness that we saw in EMEA and APAC. Now, specifically, in terms of where we're seeing strength, I'd say the strong performance in Q2 and anticipate continued strength as the year progresses, is shopping.\n\nTravel was very strong for us. Arts and entertainment, food and drink. Other areas, though, that were a bit softer, still growing double digits in Q2 was auto and personal finance. And as I mentioned a moment ago, we are seeing some softness in personal finance, which is not surprising given a lot of the challenging economic environment for folks and what they're reading in the newspaper, etc.\n\nSo overall, we believe that we are performing relatively better because of our diverse advertiser base and the fact that we're an omnichannel platform. And not to mention the fact that we've been consistently investing in these growth areas. And just a final point I make is when we are looking at these opportunities, we don't sort of wake up and start to invest and try to go after that. This is something we've been doing for many years.\n\nAnd for example, through the first half of this year, we increased our engineering headcount by over 30%. And if we compare it to our headcount in engineering to the end of '20, we've almost doubled that headcount. So by virtue of our strong profitable model, incremental cash flow, we've been consistently investing to take advantage of these opportunities.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. Great. I'll just add to that briefly, just to emphasize the really the number of growth drivers that we've incorporated into our business front. So I think we're well prepared for a variety of scenarios that may play out.\n\nObviously, we don't know exactly which way the economic winds will blow. But given the high-margin business that we've built and the stickiness and depth of relationships we have built with publishers and buyers over many years, we feel quite good about the resilience in the business. And oftentimes, what I've seen is that the uncertainty in the economic environment can actually drive customers and prospects to look for more help from us, not less. So for instance, our CTV publisher acquisition accelerated over the course of Q2 versus Q1, and I believe the prior quarter as well.\n\nAnd I think that's in part because some publishers are looking to us to help them weather the current or anticipated economic environment. Similarly, buyers will benefit from increased SPO as it makes them operationally more efficient, not to mention, more effective. So I think these are long term, very positive for us. And I do expect more customers and prospects to lean into working with us.\n\nBrent Thill -- Jefferies -- Analyst\n\nYes, Rajeev, just as a follow-up on CTV. Can you just give us your up to state union address on what you're seeing from your perspective? It seems like things are going really well. What's kind of the next chapter for this segment of business?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. I think for us, it's just continued focus on growing the publisher base, increasing monetization. We are very focused on doing that globally. I think in the last two years, we've seen a lot of strength in the U.S., and that's now being replicated in EMEA and APAC.\n\nAnd keep in mind, we're going after those programmatic dollars. And so those dollars we think are going to be there when there's a choppy economic environment and buyers want to make quick decisions in terms of where they're turning on spending, where they're not turning on spending. So I think that's a key part of it. And then the other part to highlight is our OpenWrap solution.\n\nSo that's the management various bidders. We have extended that into OpenWrap -- sorry, into OTT via our OpenWrap OTT product. So we're starting to see some nice traction in that area as well. And then maybe the last thing to comment on, Brent, as it relates to CTV is obviously, we saw the news with Netflix partnering with Microsoft.\n\nWe have a very positive relationship with Microsoft, and we look forward to the opportunity to expand our relationship with them as they work through their plans for Netflix. But I think more broadly, Netflix move into ad-supported streaming will put pressure on many other content owners to embrace an ad-supported model, which is something that I would expect us to benefit from. In fact, we're already seeing some major content owners accelerate their ad-supported streaming timelines in response to what Netflix is up to.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks, gentlemen.\n\nStacie Clements -- Investor Relations\n\nOur next question comes from Matt Swanson at RBC. Please go ahead, Matt.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYes. Thank you. And thank you guys and congratulations on the quarter, especially in this macroenvironment. Rajeev, if I could follow up on Brent's question on CTV? And I think taking your last point, maybe a half step further, there's a lot of premium inventory that's going to be heading into the market over the next year.\n\nHow do you think this can maybe accelerate the move toward header bidding? Like you mentioned before, there's going to be a lot more services. Are you going to want to buy direct off 20 different platforms? Do you see this kind of accelerating the market toward your vision?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah, I think you're spot on, Matt. So our -- remember our focus, our vision has been really around building an efficient auction marketplace, whether it's programmatic guaranteed deals, private marketplace deals, or other types of transactions. And the reason is that we firmly believe that, that type of auction environment, the transparency, and efficiency that it delivers is really the only way to scale tens of billions of dollars CTV industry that's going to have, we think, thousands of apps or content owners on the supply side and then tens of thousands, maybe hundreds of thousands of advertisers on the demand side. And so when somebody like Netflix comes in, I think it does a couple of things.\n\nIt brings more supply, more inventory into the market because Netflix is going to be going after, I would imagine, linear cable TV budgets, not just digital ad budgets. And so if you're a broadcaster that has been leaning away from streaming, now your core business may be under attack, so you've got to respond and go on the offensive. And then it also brings a lot more choice to the buyers. So the buyers are going to be sitting there saying, OK, I have more places than ever to buy from.\n\nAnd so a couple of things happen in that situation. One is they need help from technology specialists like us to bring that inventory to market in a consistent, transparent, fraud-free way. And that's obviously one of the things that we specialize in. And so that's key outside of, let's say, the top 10 or top 15 players.\n\nAnd then second is the complexity of waterfalls and direct deals starts to really take its toll from an operational perspective when you have more and more media companies, more and more publishers involved. And so that's again where that auction-based environment that allows sellers to sell directly, but to transact in a very efficient way, that's again a kind of a key benefit. So we think, as I mentioned in the prepared remarks, more and more of the industry is moving toward digital, of course, but more and more is moving toward programmatic, and we should be a major beneficiary of that.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYes, that's super helpful. And then maybe flipping to Steve. So I mean, looking at your guide, obviously, a lot better than most of us expected. And I know you kind of personally took a lot of pride enduring the beginning of the pandemic to be able to show that adjusted EBITDA profitability still.\n\nSo when we think about looking forward and kind of balancing the macro challenges, cost savings with the opportunity in front of you, like how are you thinking about protecting margins while continuing to invest in the places you need to grow?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYes. Let me let Steve take that from a short term and maybe I can round it out afterwards.\n\nSteve Pantelick -- Chief Financial Officer\n\nOK. Great. So, Matt, the way that we're thinking about it is that, number one, relying on the strength of our business model, which emanates from the fact that we own and operate our equipment so we can constantly optimize that we're not dependent on others to drive down our own costs. So that's something that we've consistently done.\n\nWe did it again this past quarter, and I anticipate our ability to continue to do that going forward. So we have a very robust gross margin. And then in terms of thinking about the balance between investment and adjusted EBITDA profitability. We feel like we're in a good spot right now in terms of knowing which of those product opportunities are clearly high ROI for us.\n\nWe understand the path to go from input to output. And so we have been selectively making those investments. I described some of those around the engineering team a couple of moments ago. And so you factor in strong foundational business that's diverse on a GEO and a format basis, coupled with the strength of the model, we feel very good about continuing to invest and deliver adjusted EBITDA margins in the high 30s, the guidance that calls for a midpoint of 38%.\n\nAnd so of course, there's always going to be a need to constantly triangulate, assess what's going on, on a macro level. But we start off from a very strong position. We have a significant amount of cash, no debt, and a real clear path to incremental revenue. So that's how we're balancing out.\n\nAnd I think my expectation is that I'm bullish on the gross margin trends and adjusted EBITDA trends. Over to you, Rajeev.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. Thanks, Steve. Yeah, just to kind of give a little bit of a broader perspective on that, Matt. I mean, I think as you highlighted, we did, I think, some very different things when COVID first hit, right, which was to use the strength of our ongoing profitability and cash flow, as well as our balance sheet to actually be able to invest into the opportunity and drive rates of growth that were roughly two times the rate of the market.\n\nAnd I think this whatever, economic environment, whatever word you want to use to describe it and what may be coming is not that different in the sense that we approach it from, I think, a really strong position financially. And we are focused on our long-term market share objective of 20%. We're at 3% to 4% as of the beginning of the year. And so we're going to look at this environment as a further opportunity to grow that share and really think about what are the right priority investments that can help us make sure that we're well positioned whenever the economy returns to solid growth.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nThank you for the time, guys.\n\nStacie Clements -- Investor Relations\n\nOur next question comes from Andrew Marok from Raymond James. Please go ahead, Andrew.\n\nAndrew Marok -- Raymond James -- Analyst\n\nHi guys. Thanks for taking my questions. I've been bouncing around between a couple of calls, so apologies if anything has already been covered. First, can we talk about the cookie deprecation deadline? And did that push impact conversations around identity hub or Audience Encore at all? Do you feel lessening urgency around the cookie transition? Or is that really highlighting the need to prepare? And second, can you talk a bit more about your SPO 2.0 relationships? Obviously, SPO trending really well in 2Q.\n\nBut just those next-level deals, I know the GroupM deal kind of being the most prominent, I guess, how those are going in general, how those are taking share and outlooks for that over the course of the next 12 to 18 months? And do they present an increased value proposition in times of macro weakness? Thank you.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. Great, Andrew. So let me start with the first question on the cookies. So obviously, Google announced that they're going to delay by roughly a year the timeline for the deprecation of the cookie.\n\nI think any time I hear that something is two years out, it means, obviously, there's a high degree of uncertainty, right, even around that timing. So, we can maybe think about that as a minimum expectation of timing, but would not be surprised if it was longer than that. But I would say that we don't really expect that timing to affect us based on the multiyear investment we've made in addressability solutions and our Connect offering. We feel like we're in a leadership position to manage the transition.\n\nThere's an increasing number of customers and prospects that are adopting cookie alternatives. And I think what's different now than maybe a year ago, is that we have case studies and data that really demonstrate the efficacy of these approaches. For example, the Banana Boat case study that we released recently. And I think these are pretty powerful in demonstrating that there are better solutions out there and that they can scale.\n\nSo there's a segment of the market now that's basically saying, hey, this is not about replacing the cookie kind of getting back to something that we already had. But instead, it's about having a better solution that respects consumer privacy, but also continues to allow for delivery of relevant ads to consumers and in some cases where the relevancy is even higher. And I think a key point to keep in mind here is that there will be a transition with buyers moving their activity from the buy side of the ecosystem in terms of data and how they apply it to the sell side of the ecosystem, and we're in a strong position to capitalize on this. So, while maybe it would have been nicer if they kept to the original timeline, we look forward to the whole industry moving on to sustainable solutions.\n\nNow turning to your second question around SPO, just going to have my notes here, how the kind of next-level deals are taking shape. I mean I think the common characteristic in deals where we are building on some initial SPO relationship and going deeper is that there is significant custom workflow or development work that goes into place. So, whether it's GroupM or others, these are all about the buyer consolidating even further based on success that they've already seen with us. And so that means they're going to go deeper in terms of how SPO drives their business.\n\nAnd so that invariably means some level of customization of the technology or infrastructure workflow that's underlying that relationship. And so those can take time because we've got a build code and implement it and things like that. But it certainly makes for a much stickier and, I think, longer-term relationship. And so, we are very happy to and excited to invest in those types of SPO renewal or expansion opportunities.\n\nAnd Steve highlighted some of the growth in engineering, and a meaningful chunk of that engineering growth is targeted toward these very deep relationships.\n\nAndrew Marok -- Raymond James -- Analyst\n\nGreat. Thank you.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nThanks, Andrew.\n\nStacie Clements -- Investor Relations\n\nOur next question comes from Justin Patterson at KeyBanc.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nGreat, thank you very much. Rajeev, I was hoping you can provide an update on just where you are in retail media. I know you've called that a growth initiative on the prior call. So any updates on how that's trending would be great to hear.\n\nAnd then, Steve, I appreciate the full year guidance in there. I know you talked about a conservative outlook for Q3. When we look at just the implication for Q4, it still implies a fairly healthy sequential uptick. So curious what you're seeing right now to give you some comfort around Q4.\n\nI know political in the past wasn't a huge channel for you. So, any more details on how you're thinking about Q4 would be appreciated. Thank you.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. Let me take the first part of that on retail, and, Steve, I'll turn it over to you. So, Justin, on retail, it's still, I would say, early going for us. And we're having a lot of conversations in market.\n\nI think the types of solutions that retailers are looking for, there's a wide variety of solutions. So, there are no, I'll call them, standard models or standard approaches to retail media. There's a couple of patterns that may be emerging, but I think it's still pretty early going. And so, we're in a heavy kind of conversation, listen, build type of mindset, where we're -- as we talk to these customers, finding the commonalities, finding the patterns, looking for the things that we can build and move the needle for these retail customers and then rolling up our sleeves and doing that work.\n\nSo again, I would say we're still at fairly early stages. And I think we'll have more to share in this area in subsequent quarters. Steve, over to you.\n\nSteve Pantelick -- Chief Financial Officer\n\nSure. So, Justin, as you rightly described, we are taking a conservative viewpoint on the second half, Q3 in particular. There are a couple of things that do make us positive about Q4. And it really does start out with the growth drivers that we already have in place.\n\nSo, there's going to be some incremental activity but we see great continued growth on a variety of fronts. Of course, you have the peak season, which we are fairly well indexed in terms of the spending that occurs. But overall, our baseline assumption when you think about our Q4 is that economic activity will remain relatively stable in the Americas. And the data that we're looking at that gives us that perspective is, by and large, the labor market remains positive, consumers have resources spending.\n\nInflation expectations down the road look to be coming down a bit. And people are still adjusting to the post-pandemic world. Now to be clear, it doesn't mean that there's going to be smooth sailing, but we believe that our business is very well equipped to sort of navigate through that volatility. And I'll reinforce a couple of the points.\n\nWe have a diverse business. We have a very strong usage-based model, so we are completely aligned with our publisher success. And we have significant cash and debt. And so we have the ability to continue to invest and to take advantage of the opportunities.\n\nNow in terms of ad spending. As you know, in the fourth quarter, there's several categories that really have peak spending. Of course, it's shopping, technology, arts and entertainment, food and drink, just to name a few. From our perspective, we're very well indexed in terms of diverse advertiser base and omnichannel platform that connects to all of the publishers that where advertisers want to be.\n\nNow, we've evaluated our business from a bottoms up, looking at regions. I shared some of my perspective on what the regional trends look like. We have a strong net dollar retention and I expect that to continue. SPO activity has been picking up.\n\nWe've had -- saw a nice uptick in Q2, and I expect that to continue to grow through the balance of the year. And then, of course, the all-time record in terms of the omnichannel video plus mobile mix of our business. So, where consumers are? And if I take a look at disaggregating that, if you look back over the not quite a decade but close to a decade, there has historically been in up markets and down markets relative to the Q3, a 25% to 30% uptick. And then on top of that seasonality and the indexing that we see, we do see the incremental activity related to CTV, political ad spending, and SPO expansion.\n\nSo, to take the sort of our guidance in the right context, it's predicated on, there's continued to be stability in the Americas and all indications are that it will be. Anything you want to add, Rajeev?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nNo, I think you covered it well.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thank you very much.\n\nStacie Clements -- Investor Relations\n\nOur next question comes from Andrew Boone at JMP. Please go ahead, Andrew.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nHi, guys. Thanks for fitting me in, and I'll keep it just one. The general consensus out there is just that consumers were out more in Q2. So I want to juxtapose that with just the reacceleration of impressive growth that we saw in the quarter.\n\nCan you just double-click on that? Is that just more agency SPO contracts in the past that are just maturing? Is there something else to highlight and just how we should think about the underlying acceleration for impression growth? Thanks so much.\n\nSteve Pantelick -- Chief Financial Officer\n\nSo, part of it clearly is us going out and very proactively adding new publishers. We commented on the expansion of our CTV publishers. Also, just the activity of consumers going into sort of mobile environments, on app. And then, of course, online video, which was really the star of the quarter.\n\nSo, the cumulative impact of sort of you have the supply and then the demand via our SPO increase. And then underneath that, as I've shared in the past, we've been consistently investing in infrastructure because we can optimize it and then get yield on that over the long run. And again, we proved that with our reduced cost of revenue per million impressions in Q2. So, think of it as our focus on high ROI opportunities, we are indexed to the fastest-growing formats, we have the wherewithal to invest and take advantage of it when we do have those opportunities.\n\nAnd that's telling me that we're going to obviously be prudent and very judicious about when we look at opportunities through the balance of the year. But we feel like we're in a good spot in terms of balancing off investment in infrastructure, the mix that we have toward video, and then, of course, the fact that we are investing for the next leg of growth across multiple areas.\n\nStacie Clements -- Investor Relations\n\nGreat, thank you, Steve. Our next question comes from Jason Helfstein at Oppenheimer.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nHey, I'll stick to one since we're coming up on the hour. Rajeev, maybe you can comment. Your publisher client wins, where are they coming from? Are these new publishers? Are these publishers who previously only sold direct? Is this share loss by competitors? Is it all of the above? Just maybe elaborate on that a bit. Thanks.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nSure. Yes. I mean it's a bit, Jason, of all of the above. we had specific go-to-market efforts around the world, right, in all of the markets that we're operating in, focused on omnichannel publishers, CTV-only publishers, mobile app-only publishers, and then mid-market build issues as well.\n\nSo, it's a pretty significant pool that we're going after. But we don't sign up anybody and everybody. We have a pretty rigorous process of vetting publishers before they get assigned to a salesperson, and we're vetting for quality, for scale, our view on are these profitable impressions that we can bring on from that publisher. And then we also are talking to the buy side constantly to say, OK, who are you spending on that we don't have for you right now that you would like to be able to buy through us.\n\nAnd then we go in and go after those publishers as well. So, it's a pretty mature process at this point. But there's a -- as we add more and more ad formats, right, CTV obviously being the latest but we're never -- I would say, we're never fully penetrated even in display or online video or mobile app, which are formats that we've had on the platform for many years now. So we're constantly going after these new publishers that we think will be profitable additions to us.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nOK.\n\nStacie Clements -- Investor Relations\n\nAnd our last question today comes from Vasily at Cannonball. Please go ahead, Vasily.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nThank you very much. Rajeev, I think this one is for you. It's sort of a big picture in the vein of the retail media one. So first of all, we've -- just to set the table for way people here.\n\nIs it correct to understand that whenever there is a DSP business to be had, there is -- needs to be a SSP? And the reason I'm going with this is one of the -- some of the DSPs are talking a lot about programmatic shopper marketing, which is a big opportunity now, right? So, can you help us understand if, even theoretically, not -- is there a role for SSP to play in that value chain? And if so, how do you think about your positioning in that regard?\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah, absolutely. So, Vasily, I think it is correct to say that anytime there's a DSP, there needs to be SSP functionality, and that SSP functionality can take the role, can be done by somebody like us. Very, very rarely a publisher will build it on their own, like Facebook, for instance, or it could be a two-sided company like Google, right, providing both DSP and SSP functionality. But I would say that an SSP, that functionality is needed to bring the inventory to the programmatic market, meaning all of the infrastructure required to describe the impression, make it available for bidding and then run the auction and do all the transaction management that happens after the fact.\n\nAnd that does include shopper marketing. And so that's in part why we think there's such a great opportunity for us in retail media because those impressions need to go through an SSP, that SSP set of functionality. There's a heavy opportunity around using alternative methods of identifying the user besides the cookie, like logged in users or first-party data. And this is an area that we've built out over many years, of course, with our Connect offering now.\n\nAnd then third is that most consumers are interacting with retailers or in the shopper media category in an omnichannel basis. So, meaning you might have a mobile app for a retailer. You might be using mobile web. You might be using a desktop, depending on what kind of price point and consideration cycle you have.\n\nAnd so, these all play into our strength. And then the last thing I would call out is that agencies are increasingly interested in this category. So, you may have seen, for instance, in Cannes, Omnicom came out with the whole series every day of announcements around shopper retail media category. And so we are, of course, more and more embedded with the agencies via supply path optimization.\n\nAnd so we are uncovering those needs and those opportunities to work with them, and we think there's a lot that we can do there. So, $140-plus billion category, and it's still very early for us, but we think there's a great runway of growth and opportunity there for us.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nAnd regarding your position relative to your competitors here, who are your competitors because you don't hear a lot about sort of explanations like you just gave.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. I think it's not, let's say, the traditional rest of the SSP category that we see. It's more so companies like Criteo, for instance, right, that are, I think, squarely focused on Retail Media. But I think we come at it from a different perspective than they do.\n\nObviously, they have a long history of advertiser relationships from their retargeting business. But I think their technology stack looks quite different than ours. And I think there'll be a lot of opportunities where there will be more than one company, could be us and Criteo or us and somebody else that's involved in helping that publisher or that retailer monetize.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nThank you very much. Very helpful.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nYeah. Thanks, Vasily.\n\nStacie Clements -- Investor Relations\n\nThanks, Vasily. And that was our last question for this afternoon. So, Rajeev, I'm going to punt it back over to you for closing remarks.\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nGreat. Well, thank you, everyone, for joining us today. We delivered another strong quarter of revenue growth and profitability ahead of our expectations, demonstrating the number and magnitude of growth opportunities we have incorporated into our business. And as our results indicate, our business is omnichannel and diverse, which provides a level of resiliency in the face of near-term macroeconomic uncertainty.\n\nWe continue to focus on the long-term opportunity in front of us. And I look forward to connecting with many of you at upcoming investor conferences. Thank you, all.\n\nDuration: 0 minutes\n\nStacie Clements -- Investor Relations\n\nRajeev Goel -- Co-Founder and Chief Executive Officer\n\nSteve Pantelick -- Chief Financial Officer\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nAndrew Marok -- Raymond James -- Analyst\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nMore PUBM analysis\n\nAll earnings call transcripts"
}