{
  "companyName": "Planet Fitness",
  "companyTicker": "PLNT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/planet-fitness-plnt-q2-2022-earnings-call-transcri/",
  "content": "Planet Fitness (PLNT -0.48%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, and welcome to the Planet Fitness Q2 2022 quarterly earnings call. My name is Jordan, and I'll be coordinating your call today. [Operator instructions] I'm now going to hand over to Stacey Caravella, VP of investor relations, to begin. Stacey, please go ahead.\n\nStacey Caravella -- Investor Relations\n\nThank you, operator, and good morning, everyone. Speaking on today's call will be Planet Fitness Chief Executive Officer Chris Rondeau and Chief Financial Officer Tom Fitzgerald. We also have Dorvin Lively, president of Planet Fitness, here, who will be available for questions during the Q&A session following the prepared remarks. Today's call is being webcast live and recorded for replay.\n\nBefore I turn the call over to Chris, I'd like to remind everyone that the language on forward-looking statements included in our earnings release also applies to our comments made during this call. Our release can be found on our website investor.planetfitness.com, along with any reconciliation of non-GAAP financial measures mentioned on the call with their corresponding GAAP measures. Now I'll turn the call over to Chris.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you, Stacey, and thank you, everyone, for joining us for the Planet Fitness Q2 earnings call. We continue to be well-positioned for disruptive growth. We're adding new members and new stores, even with the near-term challenges from lingering COVID impacts due to the broader economy and the current climate around recession and inflation. During the second quarter, we added 300,000 net new members, ending the quarter with 16.5 million, and we grew our store base to more than 2,300 locations with the addition of 34 new stores.\n\nWe believe our high-quality affordable fitness experience will resonate now more than ever as Americans are seeking value and feeling the rising costs of everyday items, such as food and gas. We also believe that people will continue to prioritize their health and wellness while being more cost conscious, even trading down to Planet from high-priced gyms if they're not using the basketball court, the pool, day care, etc. During the most recent financial crisis from 2007 to 2009, we added 1.1 million members, grew same-store sales by double digits and nearly doubled our store count. Even though we were a much smaller brand at that time, this gives us confidence that should the economy worsen, we are well-positioned to continue to grow.\n\nCOVID created a very challenging time in the health club industry. The majority of health and fitness locations globally experienced some type of temporary closure due to COVID, with 25% of U.S. gyms permanently closed as a result. Given the resiliency of our franchisees, along with our low-cost economic model, we did not permanently close a single store due to COVID.\n\nWe surpassed our all-time member record in Q1 this year. During the second quarter, 34% of our mature stores were at or above pre-COVID membership levels. We continue to see consistent momentum toward full recovery the longer our stores have been open since the temporary COVID closures. Systemwide, our stores are only 6% below pre-COVID membership levels.\n\nAnd we've added more than 330 new locations since the beginning of 2020. We anticipate more normalized joining trends and seasonality to continue for the balance of this year. We expect the percent of our mature stores that have recovered to previous membership levels to stabilize given that mature store membership growth is typically flat in the second half of the year. Our brand continues to resonate with younger generations at rates that surpassed prior generations as awareness of health and wellness continuously increases.\n\nGen Zs continues to be the fastest-growing demographic group of our membership. Our share of that generation over the age of 15 is 9%, which is much greater than it was from millennials at that same age. In Q2, we launched High School Summer Pass program, its rebranded version of the Teen Summer Challenge program we ran in 2019 where high school-aged teens could work out for free in all our stores all summer long. We believe High School Summer Pass is extremely timely and incredibly important given the alarming teen mental health crisis coming out from pandemic.\n\nAt the end of July, we had more than 3 million teens enrolled in the program versus just 1 million in 2019. This is more than the total paid membership of any of our high-value or low-price competitors. It also represents more than 15% penetration of all high school-aged teens in the U.S. between our Summer Pass participants and paying teenage members.\n\nAnd not only have they enrolled, teens have logged more than 14 million workouts. We made the sign-up process even more seamless this year, allowing teens to register online and enabling us to capture contact info for both the teen and the parent. In fact, our app topped the most downloaded list of all apps in the Apple Store during its initial days following the launch, even above TikTok and Instagram. In June, we fielded a survey of some of the participants and their parents and learned that for two-thirds of the high schoolers, this summer represents the first time they stepped into any fitness club.\n\nThis is absolutely what our brand is about, getting people off the couch to start and to lead a healthier life. And we're getting that to happen even earlier in their lives. More than 80% of respondents' parents reported that seeing their teen exercise has inspired other family members to get more physically active, while half of them said that they had worked out with their teens at some point this summer. Personally, I'm moved by some of the notes that we received from both parents and teens.\n\nOne teen participant wrote, this experience has transformed not only my mental health, but my physical health. And this gym membership has really helped me stay on track with my fitness and health journey. I will absolutely be purchasing a membership once it ends. And from a parent, I've seen some extremely positive growth in my son.\n\nI know it comes from that quality time with friends, from being physically active and the independence he gets from taking charge of his health. We believe this program is the right thing to do, and we are helping teens establish healthy habits they can build upon the future. We estimate that there has been a slight negative impact on our paid membership during the quarter as some teenagers likely participate in High School Summer Pass who otherwise would have paid for a membership. But we are focused on building a lifelong brand loyalty with that generation.\n\nIn New Hampshire where we tested this program back in 2018, we now have 20% penetration versus 15% nationwide. This demonstrates that the more years of running this program, the greater brand awareness we're building with Gen Zs. And we're just getting started with our efforts to capture Gen Z members. Pre-pandemic, we had 8% penetration of millennials, and today, that is 9%.\n\nPre-pandemic, we had 5.5% of Gen Zs that were over the age of 15. And today, that is also 9%. We are gaining even greater share of each successive generation. It's also encouraging that after we ran 2019's Teen Summer Challenge, 25% of participants became members at one point.\n\n11% of them are still members, along with 5% of their parents. In May, we increased the Black Card membership to $24.99 from $22.99 for all new joiners. The systemwide rollout of the increase has so far outperformed the test results across key metrics, such as acquisition rates, retention, average monthly dues per member, and margin. In fact, we haven't seen an initial dip in our Black Card percentage rate as we did with the past price increases.\n\nDuring Q2, the Black Card membership penetration was 63.5% from 62.2% in the second quarter last year. Working with our franchisees, we continue to make progress with our national and local marketing agency consolidation effort. Despite challenges along the way, we have been looking for a new marketing leader for the past few months. As our business has scaled over several years, we decided to use this opportunity to restructure our marketing organization to better align with how our system operates.\n\nWe announced this morning that we named a chief brand officer, Jamie Medeiros, who has been with Planet Fitness for 22 years, most recently serving as our VP of national marketing. She will lead marketing, drive our national and local marketing strategy, oversee our international agency of record, and work collaboratively across the organization to bring our brand vision to life. Like me, Jamie started the front desk and joined the brand working at our third location. She has extensive knowledge of our brand, and importantly, our member, and has played a major role in defining our unique successful marketing positioning.\n\nShe also has strong relationships with our franchisees. Additionally, after careful evaluation of our marketing agency structure, we believe the best path forward to meet the needs of our systems to transition back to our prior agency, Barkley, to manage our national ad fund. We have a long-standing relationship with Barkley team and are confident in their proven track record. And on the local side, our franchisees still have three agencies to choose from at this time to handle their local advertising.\n\nWe believe few agencies provide greater consistency across our markets and increase data visibility while still giving franchisees choice. We are a brand whose growth is fueled by the strength of our collective marketing efforts. We believe that this marketing structure and the agency transition enable us to both effectively go after the 80% of Americans who do not currently go in to a gym. To summarize.\n\nThe trends in our business are positive. Our usage is back above the 90% index of 2019. We continue to see that people who are working out are doing so more frequently. The younger generations prioritizing of fitness is driving down the average age of our member.\n\nAnd there are strong tailwinds behind the focus on overall health and wellness coming out of the pandemic. We are confident based on past performance that we can not only survive but thrive in a high inflation or possibly recessionary environment. Looking to the future, I'm confident that we will continue to be a differentiator in disruptive force in the health and wellness industry. And we believe that fitness is essential, and that our industry is a key part to today's healthcare delivery system.\n\nAnd finally, before I hand it over to Tom, I'd like to address our announcement this morning that Dorvin Lively, president, has decided to retire and will transition through the next couple of months. Dorvin joined Planet Fitness in 2013 as our CFO and was instrumental in developing our finance organization, preparing us to go public and then leading our IPO in 2015, and more broadly, expanding our brand, both domestically and globally. We are grateful to Dorvin's leadership, friendship, passion for our members and franchisees, and significant contributions to the brand over the past nine years. We have begun a search for a new president, but we know these are big shoes to fill.\n\nPersonally, I'd like to thank Dorvin for helping me lead the company, and I'm forever grateful for his guidance and support. I'll now turn the call over to Tom.\n\nTom Fitzgerald -- Chief Financial Officer\n\nThanks, Chris, and good morning, everyone. In the first half of 2022, we completed three transactions to strengthen our resilient asset-light franchise business model. First, we closed the Sunshine Fitness acquisition, which diversified the geographic profile of our corporate stores, as well as added stores with better profit margins, while keeping our ownership level at just 10% of the total system. Second, we refinanced and upsized a portion of our debt and have locked in low fixed interest rates, as well as paid off our variable funding note.\n\nAnd finally, in Q2, we executed a $44 million share repurchase at an average price of approximately $63.50, which underscored the strength of our balance sheet only two years after having all of our stores temporarily closed due to the pandemic. Now I will cover our Q2 results. All of my comments regarding our second quarter performance will be comparing Q2 2022 to Q2 of last year, unless otherwise noted. It's important to note that this is the first quarter that reflects a complete quarter of operating results from Sunshine Fitness in our corporate-owned store segment.\n\nAs a reminder, we completed the Sunshine deal in mid-February. Therefore, our full year results will only reflect 10.5 months of the financial impact from the acquisition. We opened 34 stores, compared to 24 last year. We had positive same-store sales growth of 13.6% in the second quarter.\n\nFranchisee same-store sales grew 13.4% and corporate same-store sales increased 15.7%. As a reminder, Sunshine same-store sales will not be reflected in our corporate-owned same-store sales until February of 2023, but they will continue to be reflected in systemwide same-store sales. This is consistent with how we've treated prior acquisitions. Approximately 80% of our Q2 comp increase was driven by net member growth, with the balance being rate growth.\n\nThe rate growth was primarily driven by 130-basis-point increase in our Black Card penetration to 63.5%. As a reminder, our Black Card price increase that we took in May was only for new joins. So that will slowly begin to drive the rate up going forward. For the second quarter, total revenue was $224.4 million, compared to $137.3 million.\n\nThe increase was primarily driven by revenue growth across all three segments. The 13.3% increase in franchise segment revenue was primarily due to an increase in royalties from same-store sales growth, new stores, and stores that were opened this year that were temporarily closed last year, as well as an increase in placement revenue. Partially offsetting the royalty revenue increase was a decrease of approximately $3.1 million as a result of the stores acquired in the Sunshine Fitness transaction moving from the franchise segment to the corporate-owned segment. For the second quarter, the average royalty rate was 6.4%, which was a 9-basis-point increase.\n\nThe 150% increase in revenue in the corporate-owned store segment was primarily driven by the Sunshine Fitness transaction, as well as same-store sales growth, new store openings, and the cycling of temporary store closures in the prior-year period. Equipment segment revenue increased 70%, driven by higher equipment sales to new and existing franchisee-owned stores. For the quarter, replacement equipment accounted for approximately 60% of total equipment revenue. We completed 26 new store placements in the quarter versus 19 last year.\n\nOur cost of revenue, which primarily relates to the cost of equipment sales to franchisee-owned stores, amounted to $32.5 million, compared to $18.5 million. Store operations expenses, which relate to our corporate-owned store segment, increased to $56.4 million from $28.4 million, primarily due to the additional stores from the Sunshine acquisition. SG&A for the quarter was $28.2 million, compared to $21.8 million. Payroll cost primarily drove the increase with the addition of the Sunshine Fitness management team, as well as increased travel expense.\n\nIncluded in the adjustments to EBITDA was approximately $1 million related to transaction fees and expenses incurred in connection with our acquisition of the Sunshine Fitness stores, as well as some additional one-time fees. National advertising fund expense was $18.9 million, compared to $13.5 million. Net income was $25.1 million. Adjusted net income was $34.5 million, and adjusted net income per diluted share was $0.38.\n\nA reconciliation of adjusted net income to GAAP net income can be found in the earnings release. Adjusted EBITDA was $89.9 million. And adjusted EBITDA margin was 40.1%, compared to $55.6 million, with adjusted EBITDA margin of 40.5%. A reconciliation of adjusted EBITDA to GAAP net income can also be found in the earnings release.\n\nNow by segment. Franchise adjusted EBITDA was $54.4 million and adjusted EBITDA margin was 65.9%. Corporate store adjusted EBITDA was $40.4 million and adjusted EBITDA margin was 39.8%. Equipment adjusted EBITDA was $10.2 million and adjusted EBITDA was 25.2%.\n\nNow turning to the balance sheet. As of June 30, 2022, we had total cash and cash equivalents of $446.3 million, compared to $603.9 million on December 31, 2021, which included $62.8 million and $58 million of restricted cash, respectively, in each period. As I mentioned earlier, during the quarter we paid off our $75 million variable funding note and we used $44 million to repurchase approximately 700,000 shares. Total long-term debt, excluding deferred financing costs, was $2.0 billion as of June 30, 2022, consisting of our four tranches of fixed-rate securitized debt that carries a blended interest rate of approximately 4%.\n\nFinally, to our 2022 outlook. We reiterated our guidance for 2022 in our press release this morning, with the exception of updating our adjusted diluted shares outstanding guidance to 90.7 million, reflecting our second quarter share repurchase, as well as our net interest expense to $86 million. As a reminder, our view for 2022 assumes there is no material resurgence of COVID that causes member or supplier disruptions, whether it be shutdowns or more stringent mandates that result in a significant change in membership behaviors. As Chris mentioned, the marketing agency consolidation effort has been more challenging than we expected.\n\nAnd as a result, the NAF is incurring additional expenses that we did not anticipate. Therefore, expenses will be higher than collections this year, a portion of which was reflected in the second quarter. Additionally, the HVAC supply shortage has not lessened as the impact from the China COVID manufacturing shutdown lingers. We're monitoring the situation carefully and are working with our franchisees on alternatives, such as keeping in place an existing HVAC system in certain locations.\n\nBut the supply constraint has not eased since we reported our first quarter earnings. We still believe that we can deliver our full year forecast, even with these two developments, although they are likely to limit any upside. Importantly, we believe that they are both near-term one-off issues that will not prevent us from capitalizing on our long-term growth opportunities. I'll now turn the call back to the operator to open it up for Q&A.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Randy Konik of Jefferies. Randy, the line is yours.\n\nRandy Konik -- Jefferies -- Analyst\n\nThanks, guys. Good morning. I guess first question, on the Sunshine team, I believe you mentioned -- I think, Tom, you mentioned that the comps of Sunshine were outperforming the core corporate owned by, I think, 200 or more basis points. So can you just give us some perspective on the processes that Sunshine is going to be kind of taking on broadening out to the other corporate clubs? And when you might see the gap in comp of those corporate-owned stores start to kind of narrow to Sunshine?\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah. Hey, Randy, thanks. So I think maybe a couple of things. One is the overall corporate store segment is outperforming the franchise segment in comps, primarily because our stores in the -- in our legacy markets, which are still what's in the corporate store same-store sales, were hit harder by the pandemic and had experienced longer closures, longer mandates just given the regionality of that business.\n\nSo that's a little bit why our corporate store same-store sales are stronger as they recover faster like the rest of the system that was impacted in the similar way in those markets. So in terms of the best practices -- better practices, that's happening. Shane and the team have realigned some of the pricing and the different promotions and the marketing, pushing Black Cards. So we're seeing that traction for sure.\n\nAnd I think at the end of the day, when Sunshine -- obviously, we see it internally, we're not disclosing it externally, but they continue to be a strong performer. They're just not part of corporate stores as we've -- similar to how we treated other acquisitions, as I said in the script. They're part of the total system, just not part of corporate stores.\n\nRandy Konik -- Jefferies -- Analyst\n\nGot it. And I guess lastly, I believe you guys are hosting a franchisee convention, I believe, next month for the first time in a couple of years. Maybe, Chris, kind of give us your perspective on how important that event is to have an obviously in person and kind of some things that you've worked on in the past conventions, what you kind of think about as a focus point with your franchisees at this convention in terms of new areas for development, etc. Just give us some flavor on that event.\n\nThanks.\n\nChris Rondeau -- Chief Executive Officer\n\nSure, Randy. Yes. It is next month. And it's the first time we've been together since 2019 -- September 2019, so three years almost on the dot.\n\nA lot of excitement. There's well over 1,000 attendees already registered to go. And besides my main address here on stage and then some fireside chats with Tom and the rest of the IFC franchisee committee, then we'll have breakout sessions for a couple of days. So there'll be a marketing breakout.\n\nThere'll be a development breakout. There'll be operational breakout, best practices, training. So there's a lot of -- it's a lot of just education and reeducation, I guess, I should say, too, that gets people back, making sure everybody is running tip top shape here when they're running their clubs. So a lot of that stuff.\n\nAnd then -- and now as you heard this morning with the announcement of Jamie Medeiros, who's the chief brand officer now, and now her also presenting with Sherrill, our chief digital officer. So there's a big kind of a marketing reset here and the marketing team that's, I think, much more in depth that can help drive these sales. So there will be a lot going on, a lot of excitement. And actually, everything is back, it's like a pep rally.\n\nSo they come back and excited to get back to work after all they hear and see from us and trends and data.\n\nRandy Konik -- Jefferies -- Analyst\n\nGreat. Thanks, guys. Good luck at the convention.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you, Randy.\n\nTom Fitzgerald -- Chief Financial Officer\n\nThanks, Randy.\n\nOperator\n\nOur next question comes from John Heinbockel of Guggenheim Partners. John, please go ahead.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nSo Chris, two separate marketing-related questions. One, if you look out over the next, I don't know, six, seven, eight months, what's the general plan, right? So you'll do New Year's Eve. Will you do anything different? I assume you'll be back at the Super Bowl. Do you do anything different there? And then creative, right, do you had the kind of B-list celebrity creative? I assume you'll add to that, bring that back and maybe add some other people.\n\nSo that's number one, that thought. And then secondly, when do you -- the best practice by really diving into the local spend, when does that start to make an impact? Is that still far out on the horizon, sometime deep into '23?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. Thanks, John. Good questions. Yeah.\n\nSo the New Year's Eve is still on queue at the VMA as we speak. So that thing is all going in the same way. You won't see anything different than you've normally seen in the last six, seven years here. Super Bowl is still up in the year.\n\nWe haven't committed to that just yet. But we'll see the same normal cadence, the big January sales, we always see coming into New Year's, and also the normal cadence this year second half as far as marketing for October and so on. So nothing there should really change much. I think one thing to those is to note with the High School Summer Passes.\n\nAnd you probably remember us talking in previous calls is where we've seen 25% of 2019 Teen Summer Challenge kids had joined at one point. Today, 11% of those teens from 2019 are still members and 5% of their parents. So with over 3 million teens this year, naturally, we're going to have a much more probably aggressive marketing campaign to get a lot of them to join. And also, you probably recall this year, we actually used our app to sign a lot of these people up with the website.\n\nSo we have a lot more data in way to contact both teens and parents to hopefully get them to convert into a paying membership going forward. It's also interesting, we have, like I said, 25% of those teens joined since 2019, 11% of them are members today, but that was also six months later the pandemic hit. So there's a lot of disruption in that normal probably join cycle. So it could be really interesting what we see from the 3 million teens and their parents.\n\nThat's some of the marketing product play that we never really had before the rest of this year and beyond. So that could be exciting. As far as best practices, it was already starting somewhat, even from January, we first started to see the data that we hadn't really seen before from the LAF spend. But it's really a learn and tune and learn and tune and learn and tune.\n\nSo it's going to be an evolution that probably really never changes. And even if you think about today, the amount of Gen Zs that are joining and how we target them, when you go back pre-pandemic, we only had 5% penetration of Gen Zs. Now we're at 9%. So that's next generation here that we probably have to think maybe a little differently than just strictly television and network as opposed to streaming and TikTok, for example.\n\nSo -- but it's going to be always an evolution of learn and then fine-tune and tweak sale to sale. But now that we're capturing the data, this is the benefit of it.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nAnd one last thing. When you think about monetizing your membership, right, and I think we've talked about this before, right, in terms of Black Card partners, is there a level here of membership? Is it 20 million, right? Or do you think you're there now? Where you -- and I know you've done a few things. But in a broader way, right, to bring on more partners and create more out-of-the-box value.\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. I mean, I think we're starting to see -- with Sherrill's help, chief digital officer, I think with the Perks page and the button on the website -- the app, the traction we've gotten from that and the data we're capturing so that we can show true click-throughs and conversion for other partners. That I think we're now on the cusp of now starting to not only just get the discounts, but actually even drive maybe some revenue from those discounts internally from shared revenue or whatever or commission. So I think we're just getting there right now.\n\nBut the partnerships and people that are -- want to work with us, now since there's actually a way to prove data has been light years different than it was two or three years ago when we talked about perks.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nOK. Thank you.\n\nChris Rondeau -- Chief Executive Officer\n\nThanks, John.\n\nTom Fitzgerald -- Chief Financial Officer\n\nThanks, John.\n\nOperator\n\nOur next question comes from Brian Harbour of Morgan Stanley. Brian, please go ahead.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nYeah. Good morning, guys. Maybe just a quick one to start. How many corporate stores did you open in the second quarter? And do you expect maybe somewhat of a similar pace to the second half? Or are you holding back on some of those just to help franchisees kind of get the proper equipment to some extent?\n\nTom Fitzgerald -- Chief Financial Officer\n\nHey, Brian. It's Tom. We opened four. And I think, we've talked about this before, I think you can expect we'll kind of be -- we'll try to keep pace with the system in terms of our penetration at 10%.\n\nIn different years, it may be plus or minus that. But -- so not speaking to quarters per se, but as you think about this year and coming years, that's kind of how we think about it.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nOK, great. Thanks. And on the High School Summer Pass, what do you think made that so successful this year? Was there anything you did differently just in terms of marketing it or maybe it's kind of a digital story? But what do you think kind of explains some of that success?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. I think the first thing I'd probably point to is just since even 2019, which hard to believe is three years ago now, that the pace of what we've seen Gen Zs join, and mostly the older Gen Zs, their counterparts that are in that early 20 stage, ideal Gen Zs is about 23, 24. But the rate of which they've been joining since the pandemic has been, I mean, they're joining about 150% over normal. So I think they're -- the younger counterparts, the high school teens are following in their footsteps.\n\nSo I think that drove a lot of the volume as well. But I think the ease of signing up, where before it wasn't digital really. They had to come in to the club. The parent had to come with them.\n\nThey had to sign the paperwork and then the waivers and someone where -- this is all done digitally through the app and website where parents and the kid had to sign up, get their emails and package. So just that we much more streamlined. I think that probably helped the ease of volume of sign-ups. So those two things.\n\nBesides that, nothing really that large. So it wasn't like we did a big media push. It was mostly just all free press that it gained. But I think coming out of COVID and what we're seeing from the older Gen Zs is just their propensity to join, I think, with mental health and physical health, I think they're just at a different place than they were in 2019, which drove the volume.\n\nBut it's been over 3 million logged, over 14 million workouts. It's been -- it's quite amazing actually.\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nOK, great. Thank you.\n\nTom Fitzgerald -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Max Rakhlenko of Cowen and Company. Max, please go ahead.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nGreat. Thanks a lot, guys, and congrats, Dorvin, on the retirement. So first, can you just talk to franchisee sentiment and enthusiasm to open gyms as we have seen rate -- interest rates tick up here, the macro slowing, and input costs are increasing? So do you think that there could be any sort of a temporary slowdown besides the HVAC issues, or anything else?\n\nDorvin Lively -- President\n\nThis is Dorvin. Thank you for the comment. I appreciate that. As we've talked about in the past, our franchisees pre-COVID were generally all developing ahead of their schedule.\n\nAnd we were in the 200-plus openings there for three years or so. I'd say the -- as we came out of COVID, no store closures, the momentum of getting members back in the clubs and then getting the membership growth back in place, the enthusiasm to open stores, these guys are still as bullish as they've ever been about the brand and the return on the investment that they can get. Internally, we, Tom, Chris, myself have thought about, and we've said this in the past that that 4,000 potential number of clubs, we feel even more confident today than we did, say, three years ago about the ability to continue to bring the brand to more and more markets and closer and closer to that 80% population that don't have a gym membership. With that said, this year, in particular -- late last year and into this year, the whole supply chain constraints has certainly been something that has had an impact on our business.\n\nAnd we feel pretty good about where we're at on the equipment side to be able to open new clubs. I'd say the HVAC issue has continued to be an issue that we deal with, quite frankly, day-to-day, week-to-week, with the shutdown of -- in China of some of the plants and just being able to maneuver around that. All of this certainly came into the consideration that we had when we gave the guidance that Tom spoke about. I'd say -- one last comment I'd make is in terms of just the overall retail environment with respect to our franchisees, their development teams and then landlords across the U.S., I think most likely because we were a great kind of pre-COVID with the economics of the model and the traffic we drive to the centers, etc., etc., and then on where we're at today with landlords realizing we didn't close a single store.\n\nWe've paid back all the rent that got deferred during COVID. So we're still one of the most attractive tenants to have in markets out there. I'd say rents haven't really moved a lot. What we found is landlords have certainly been willing to pay more tenant improvement dollars to get us into a space.\n\nBut in terms of the franchisees wanting to get back into that pace of where we were pre-COVID, we certainly think we can get there, and we don't have any doubts that they won't be willing to do it.\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nThat's very helpful. And then as a follow-up, what is your expectation for when the mature gyms will reach pre-pandemic membership levels? Obviously, sort of we discussed being flattish for back half of the year. But is 1Q '23 the right bogey to think about? Thanks a lot.\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah. Hey, Max. This is Tom. It's a good question, and we think it's tough to really put a time frame on when all of the store -- all the mature stores will be back to their pre-COVID membership levels.\n\nI think it's very encouraging to see that it's continuing to tick up with each passing quarter. Clearly, what happened with Omicron and Q1 that we discussed previously, hurt didn't help. So we believe that this January, this Q1, hopefully, will be more of a typical strong Q1 for us. Again, we don't see anything competitively that's a threat on the horizon that's going to change anything.\n\nIt's just a matter of time and how long our continued investment in marketing drives the members of the -- drives our target off the couch to join. So it's really hard to say when that will be. But we are encouraged by the continued progress and look forward to a strong Q1 to boost that.\n\nOperator\n\nOur next question comes from Sharon Zackfia of William Blair. Sharon, please go ahead.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nI'm curious whether you're seeing any kind of change in usage patterns or join beyond normal seasonality in some of the areas where we're seeing kind of some pandemic flare-ups. I know others have mentioned Southern California and the Northeast as maybe a bit more challenged recently from a COVID perspective. I'm curious what you're seeing there. And then secondarily, if I'm doing the math right, it seems like replacement equipment is still kind of well below the trend line that you saw pre-pandemic.\n\nI mean, I'm calculating maybe 30% below even though you've got more clubs in the first half of this year than in 2019. Can you talk about what's going on in replacement equipment? Are franchisees kind of deferring that longer? Or is there something else going on there where we'll see some sort of catch up at some point?\n\nChris Rondeau -- Chief Executive Officer\n\nSure. Sharon, this is Chris. I'll take over the first part of that question. We aren't seeing anything geographically or anything or expressed country based on any of the small flare-ups or anything like that anywhere.\n\nAnd all those are acting very similar to each other. They're not -- even like pre-pandemic, we never really had any regions that acted very differently. So we haven't seen anything there. I think a lot of that with a 30 -- almost 35% of the clubs are pre-pandemic, it's just more, I think, back to Tom's point, a matter of time.\n\nAnd naturally, most of the stores -- I mean, the average clubs were closed six months, but some clubs were closed two months, and some were a year. So a lot of it's just timing and how long they've been already open. Like again, if people have a -- club in Florida, for example, they've been open for well over two years at this point, where other parts of the country have been really a year. So it's just a matter of time at the end of the day.\n\nBut we're not seeing anything change or act differently from a membership join trend. Just the only one really, just the Gen Zs is just joining well above normal at this point where the other generations aren't.\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah. Hey, Sharon. It's Tom. On the reequipped piece, I think there's a couple of things.\n\nOne is the lockdowns in China, primarily Shanghai, but certainly the other provinces, hurt our manufacturers of equipment. We don't see it as a full year risk. In fact, there's a lot of inventory stateside. Once those provinces reopened, our primary vendor matrix essentially ran us full out -- ran our equipment full out.\n\nSo it did cause a little bit of a timing shift on some reequips from Q2 to Q3, but doesn't impact the year from everything we can see.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nGreat, and we wish Dorvin the best.\n\nDorvin Lively -- President\n\nThank you, Sharon. Appreciate it.\n\nOperator\n\nOur next question comes from Jonathan Komp of Baird. Jonathan, please go ahead.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nYeah. Hi. Thank you. A bit of a modeling question, Tom.\n\nI'm just curious as you look to the back half, any shaping cadence that you think is important from new openings or with reequip or even if you could quantify that the NAF comments you made about some of the investments you're making there?\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah, John. I think -- and Dorvin may add some to this. I think as is pretty typical, the back end for new store openings is weighted more heavily, and that may be -- particularly on the reequip side, as I just mentioned, maybe also a little bit more back-end heavy just given the disruptions in China in Q2. In terms of NAF, what we're reflecting as a year-to-date GAAP in the P&L is essentially half of what our expected full year shortfall will be plus or minus.\n\nSo hopefully, that helps answer your questions.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nYeah. That's really helpful. Thank you. And then just a broader question on capital allocation.\n\nI was curious to see that the buyback activity restarts. So I just want to get your perspective on sort of the rationale there and then how we should think going forward. So you still have a sizable cash balance and lots of cash flow generated. Thanks.\n\nTom Fitzgerald -- Chief Financial Officer\n\nYeah. I think it's -- there was obviously a lot of market volatility going on earlier. And frankly, we thought it drove the stock too low. So we put in a 10b5-1 while we could to essentially buy back and frankly stay at or below what we bought back before.\n\nYou'll remember, but just for everybody else, in the couple of years prior to the pandemic, we bought back about 800 million shares. I think the average price was $67, almost 12 million shares. So that -- we thought that's been our typical way of returning cash to shareholders. We had a -- we were sitting on a lot of cash and thought in discussions with our board, as we've talked about, that it was a prudent move to take down roughly a quarter of our outstanding authorization.\n\nThe board had authorized $500 million. We took down $300 million with an ASR back in '19 and early '20 and had $200 million remaining. So we put that in place. And we're also just looking at rising rates.\n\nThe great news is our debt, as you know, is fixed. Fixed rate, it's not L plus or SOFR plus. So -- but the VFN, the variable funding note for $75 million that we had drawn back in 2020 was not. That's a floating rate.\n\nSo we just thought it made sense to pay that off, do the share repurchase. And we like where we sit with our cash. Still a very strong balance sheet. We want to be conservative and prudent as we're facing here higher inflationary period and potentially recession.\n\nWe just want to make sure that we have sufficient cash should anything cause any kind of disruption. So we kind of like where we are. And we thought it was a prudent thing to do given what had happened to the stock price.\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nThat's great. Thanks for the color.\n\nChris Rondeau -- Chief Executive Officer\n\nYou bet.\n\nOperator\n\nOur next question comes from John Ivankoe of J.P. Morgan. John, please go ahead.\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nHi. Thank you. A couple, if I may. First, remind us of what the reason was for NAF expenses to be higher than revenue? I thought kind of a whole point of the NAF is that the two would basically offset each other.\n\nAnd I'll continue on that. The split that you guys have, 2% national, 7% local, I mean, at least in terms of restaurants, is highly unusual. In fact, I think it's unique, both in terms of the percentage of advertising that the system spends, but also a very heavy allocation of national to local as local is generally seen as much less efficient than national. So I guess where are we on that 9% being the right level? I mean, is there an opportunity to maybe allocate some of that 9% someplace else? And how far along the path are we in terms of maybe rethinking some of that 2% to 7% split that you have historically had? And if possible, I'd like another question after.\n\nTom Fitzgerald -- Chief Financial Officer\n\nHey, John. It's Tom. First of all, I'll get to your NAF question. I may have misstated something there.\n\nWe prior to the pandemic bought back $800 million worth of stock, 12 million shares, average about $67, just to make sure everybody has that. So in terms of NAF, I think prior to COVID, we absolutely wanted to make sure what -- we spent what we collected, and that's what we did. Clearly, COVID caused the disruption and 2020 was the first period, as you know, all the reasons for, that we spent more than we collected to really jump start the marketing after a period of temporary store closures. And then 2021 as well.\n\n2022 is a different -- we're still in the pandemic, as we all know. And it has continued to cause some disruptions, including the softer January. So our collections were not ultimately where we thought they would be. But also, the agency change has caused some incremental expenses that we didn't expect to pay.\n\nAnd we thought, taking the long view that it was the right thing to do to incur the expenses that arose, but also to -- and make sure we fund the national sales that we want to fund, but also to appropriately transition to the new agency back to the former agency, Barkley. So our intent is, once this thing is in the rearview mirror, absolutely, the collections -- we intend to match the collections to the spend, unless there's some unusual circumstance. But I think still being in the pandemic, going through an agency transition, that clearly had its challenges, as Chris articulated. We thought, playing the long game, it was the right thing to do because we got to move forward, still invest to drive membership.\n\nAnd no matter what, the -- as you've heard us talk about, the lifetime value of a membership far exceeds the cost even with some temporary overspends and NAF. It's orders of magnitude difference between the two.\n\nChris Rondeau -- Chief Executive Officer\n\nI think the split, John, I think maybe, again, in time as we mentioned in the past that once we get through this hopefully final transition here and begin to use best practices, as I said earlier, fine-tune and sale after sale and quarter after quarter. And I guess two things. One, is 9% the right number? And then what should the split really be to be more effective? And as we get better at spending, then we can make those calls. But you're right.\n\nI think longer term, more NAF probably does make some sense. But again, it's hard to really make that call until we get data, it's not going to be something tomorrow or even next year, it could be something that goes 24 months or plus, so we have to really figure out exactly how we -- how would it all play out.\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nOK. Understood. And next, it is interesting to see a brand that -- I mean, you have an attractive experience and offering for the baby boomers all the way down to Gen Z, and those aren't necessarily consumer cohorts that kind of like are able to use a brand kind of in the same way at the same time. So I guess, am I overthinking that, hey, you guys may have some challenges in terms of being attractive to both? I mean, both whatever, the 18-year-old and the 60-year-old? As the brand, by definition, shifts to a different generation, do you think it makes sense to change something, I don't know what that will necessarily be, but change something about the in-gym consumer experience to make yourself even more attractive to that younger consumer over time? In other words, how do you envision the in-gym Planet Fitness experience changing?\n\nChris Rondeau -- Chief Executive Officer\n\nSure. Yeah. And I think one thing is, too, is that boomer population in our clubs is only about 13% of our base. So it's not a huge part of our membership.\n\nBut for somebody living on a fixed income or what have you, and we have tons of cardio, you're not walking on the street, and you can be in air conditioning, in a safe place, I mean, that's why I think boomers come to us a lot and always have. But again, it's a small part of our base. I think a little bit to your question on Gen Zs, I think the one thing that's somewhat anecdotal, but I think a little bit from some of our manufacturers that, from the younger generations, we're not seeing them use probably cardio like the older generations do. Meaning they're not getting on a treadmill for 45 minutes as much like they used to.\n\nThey're more functional training, John, so they're more using the kettle bells and the functional areas, which is why we started putting functional areas in our clubs about five years ago, six years ago. There's no doubt that there's a shift there. So it's just a matter of, I think, slowly and carefully transitioning as we watch trends so that we're definitely still getting Gen Zs to gravitate toward us and then Gen Alpha eventually. So -- but right now, I think we're doing the right thing.\n\nFunctional area is definitely busy. They could be expanded I think in time if this trend continues and as a boomer population seems to be a smaller part of our base over years.\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nI got it. Thank you.\n\nChris Rondeau -- Chief Executive Officer\n\nThanks, John.\n\nOperator\n\nOur next question comes from Simeon Siegel of BMO Capital. Simeon, please go ahead.\n\nGarrett Klingshirn -- BMO Capital Markets -- Analyst\n\nHi. This is Garrett Klingshirn on for Simeon. Thanks for taking our questions. I'm just hoping you could give a little color on digital.\n\nYou mentioned kind of High School Summer Pass benefiting from sign up from online and being able to not have to do that entirely in store. I'm just curious how you're thinking about innovations on the digital side within the clubs and what are you're thinking about investments there?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. I think there's a few different buckets. And I think one thing that when most people first think digital, the first thing that comes to mind is the digital workouts in an exercise, which is a part of the app for sure and always will be. And people have -- two things.\n\nOne is how they better use the equipment in the club and acclimate themselves at the club easier without having to either get a trainer or to go find somebody to show them something. And we put QR codes on almost all the equipment where people use the app to scan the QR code on equipment with a quick 15, 30 seconds tutorial on how to use the equipment. You have some workouts that you can do in club. They follow through the app.\n\nAnd then we have out of the clubs. So you can workout at home if you can't make it to the club or if you're traveling and what have you. So that's the digital component piece of it. But I think the -- probably the bigger part of the digital component is more the -- how do you improve customer experience and remove friction? And a lot of it is -- if you think about pre-pandemic, you couldn't even join on our app.\n\nAnd today, it's about 20%, 25% of our joins are in our app, and that didn't exist pre-COVID. People now pay their balances in the app. And a big portion of our balance payments systemwide are done through the app, which that didn't exist even this time last year. So a lot of it is reducing friction to help improve customer experience, the crowd meter, I can go on and on.\n\nNow the Perks button to expand with more and more benefits there. We did the Shell Gasoline one last November, and that continues to run. They're very happy. I think it's upwards of almost -- almost approaching 2 million gallons in the gas at this point that the members have redeemed.\n\nThe Crocs partnership, which was a Gen Z favorite. Crocs actually was extremely happy over three months, how much they did and the discount there. So I think it's just how do we give benefit? How do we improve customer experience and not just look at it as a fitness only component of digital? But we'll continue to evolve it as we learn more. And the big beauty of this is we can track all the trends and all the data that comes and supports around that, where previous to this, we really didn't have much to do.\n\nAnd on top of that, one thing I always talk about where, in this industry, unless somebody walks through the front door, we really didn't have a way to engage our member outside our four walls. So unless somebody walked through our door, we gave him a hello and a good buy and kept the clean club. They never really got to experience or touch Planet, and now we can reach out and touch them when they're not in the club, which I think is important.\n\nGarrett Klingshirn -- BMO Capital Markets -- Analyst\n\nGot you. Appreciate that. And I know you guys don't comment on churn, but I'm just kind of curious if we're thinking about kind of recession times from the past, then you kind of maybe gave all that great color earlier. How did churn kind of compare within Black Card versus kind of the classic membership? Were there any notable differences within there? And kind of how do you think that would maybe trend this time around if there is a recession or an economic downturn?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. I can't recall back from '08, '09 of the top of my head. But I mean, even recent trends, we've seen that even through COVID, that the Black Card members are canceling slower than the White Card as crazy as that sounds. And even more recently with our Black Card increase in pricing, that our Black Card acquisition is actually going up, which is kind of counterintuitive to what you would expect.\n\nSo I think that's great to see.\n\nGarrett Klingshirn -- BMO Capital Markets -- Analyst\n\nOK, great. Appreciate the color.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you.\n\nTom Fitzgerald -- Chief Financial Officer\n\nThanks, Garrett.\n\nOperator\n\nOur next question comes from Alex Perry of Bank of America. Alex, please go ahead.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking my questions. I'd like to echo my congrats on your retirement, Dorvin. Just first, I wanted to circle back to some questions earlier.\n\nCould you give us some more color on how you're thinking about conversion for Summer Pass participants and their family members? How could this year be different? Would you still sort of expect that 25% conversion rate? And then maybe just remind us on sort of the timing of that. And then what is the participation rate of the 3.3 million Summer Pass participants then? Are you seeing similar levels of usage from them as you saw in sort of 2019? Thank you.\n\nChris Rondeau -- Chief Executive Officer\n\nHi. Thanks, Alex. This is Chris. Yeah, I think the -- so when I say 25% of the 2019 High School Summer Pass kids, they joined at one point from 2019 till today.\n\nAnd today, 11% are still current members. 5% of their parents are still current members. So -- and remember that has COVID and a shutdown in the middle of that. So I would imagine if you were to take these teens and you fast forward the next three years without any kind of shutdown or lockdown, you have to imagine it'd be higher.\n\nAnd I think on top of that is the trend that we saw in the last couple of years here after COVID, that the older Gen Z population is joining. I said -- talked about this a little earlier, the older Gen Z population is joining much higher than they were pre-COVID. So I would imagine these high school teens, which are Gen Z, will probably have a same kind of trend. So I can -- I think 25%, I would say, on the lower side are conservative.\n\nAnd then on top of that, we have a lot more ways of contacting and reaching up between emails of both parents and kids. And they all have the app to get into the club, right, to check in. So we have in-app messaging now that we can message all these kids to get them to hopefully join in the future as well, whether it's right in September or it's -- they have the app on the phone and its next February. So I think just being able to reach out and talk to them, heck a lot easier and more efficient than we definitely had in the past I think are the two big things that will help us on a conversion standpoint.\n\nTheir usage, so with that they've logged over 14 million workouts. But they're usage is pretty much a -- believe it or not, it's actually pretty much the same as a normal Gen X. It's not their usage patterns aren't really necessarily any more or less than a typical member that we normally have. I'd say their day part usage is slightly different naturally.\n\nWe saw it as more and more of the country get out of school because High School Summer Pass launched in mid-May in some of the country, a lot of good portions of the country like the Northeast is still in school until the end of June. And we saw usage shift from the after-school evenings like most of their older generations coming out of work to then they started bumping up forward into the day parts of the day where they weren't in school any longer.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. That's really helpful. And then just a follow-up here. Could you just give us a little more color on how the business performed in prior economic downturns? Are you already seeing any benefits of trade down with new joins coming from some higher-priced clubs? And then would you expect similar levels of Black Card penetration? Or would you expect more joins to come from that sort of entry-level price point?\n\nChris Rondeau -- Chief Executive Officer\n\nYeah. But we haven't seen any real data that shows that's coming from trade downs yet. We have to do some sort of survey or some sort -- to try to capture that stuff -- that part of it. I think just the retention trend on the Black Card membership and then the more recent trends we're seeing on the Black Card price and the acquisition of Black Cards leads me to believe that I don't think it's going to be a White Card only option because Black Card's too expensive.\n\nI think we probably would have saw that through the last couple of two, three years and then the more recent price increase, but we're not seeing that.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. That's really helpful. Best of luck going forward.\n\nChris Rondeau -- Chief Executive Officer\n\nThanks, Alex.\n\nOperator\n\nOur next question comes from Chris O'Cull of Stifel. Chris, please go ahead.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nThanks. Good morning, guys. Chris, it's been well publicized that roughly 25% of gyms permanently closed since the start of the pandemic. But it seems that those operating still haven't been able to get back to that pre-COVID average store membership level.\n\nSo I guess the question is, what has your research indicated as the reason these members haven't returned to gyms? And what opportunities do you think you have to bring them back? And then I have a follow-up.\n\nChris Rondeau -- Chief Executive Officer\n\nSure. And I think it's -- one good thing that we've seen since coming out of COVID when we reopened our stores is our rejoin rate is higher than it's ever been historically over decades. So our rejoin rate is still -- about 30% of our joins are rejoins. The second quarter was about 33% were rejoins.\n\nSo people are coming back to gyms at a faster rate or more volume than they have ever had in the past. So that's a good thing. I just think it's taking them a lot longer to break the couch trend. They were told to go home and sit down and not work out.\n\nAnd now they've got to come back, and it's just -- it is a slow process to get them to convince them to get off the couch and join again. But -- and even though the Gen Zs are way above what we've seen in prior years on a joining ratio, where millennial, the boomers, the Gen Xs aren't quite back to where they should be. At the same token, I think it's important to note that our penetration of those generations are also increasing. So with Gen Zs and millennials are above where they were at the close period.\n\nSo their now penetration is higher. It's just the Gen X and boomers, they're going in the right direction, but they're still going to take some time to get back to where we were pre-COVID. So I think it's just time. And back to what Tom mentioned a little earlier, but it's not a matter of effort, it's just time, which is that -- it's not like we're going to a -- the industry is going to have a hockey stick recovery.\n\nAnd everybody then decides in one month, I'll get off the couch and make fitness a new hobby. So it's -- I think unfortunately, it takes a little bit of time, and we're just going to have to keep marketing our way out of this. But there's -- nothing points to the fact that it's not going to get there. If you go pre-COVID, we had over 13 years of positive comps, averaging 12% over those 13 years.\n\nAnd most of it's member growth. So outside of COVID, there was nothing that would have stopped that trend. So now we'll just kind of pick it where we left off and get the momentum back.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nOK. And then my second question relates to development. Do you have any visibility as to how long the HVAC and other equipment issues will continue to remain a challenge in terms of just lengthening project time lines? And then can you give us any sense of the '23 pipeline and your confidence level that you can accelerate development next year?\n\nChris Rondeau -- Chief Executive Officer\n\nNo. As I said earlier --\n\nTom Fitzgerald -- Chief Financial Officer\n\nMaybe I'll start that -- go ahead.\n\nChris Rondeau -- Chief Executive Officer\n\nPlease add to it, Tom. I think the one comment I'd make is that we -- throughout the year, we've worked very closely with our franchisees and the various venders that they use. And we've never really required a particular vendor for, say, an HVAC system, etc., and never had a problem to this point. And as we got into some of these supply chain constraints, one thing that we've done on the franchisor side, the corporate side, is to try to work more with some of the bigger guys and work with almost consolidating some of those types of purchases so that the bigger suppliers knew that they had maybe a bigger piece of the business now and potentially going forward.\n\nWith that said though, these guys are constrained, too. It may be that only a certain couple of parts to what they need to fulfill in the entire system from an HVAC perspective is missing and everything else is here. So they're obviously -- they're working their channels on the supply chain to be able to do that. One thing that -- in the past, pre-COVID, we generally would never do would be to try to take the existing HVAC system that's there in that facility that we're taking over per new store and either try to do a bit of maintenance and have some extended life on that old system for our new club.\n\nWe're doing more and more of that today just to buy some time so that instead of trying to open the brand-new Planet with a brand-new HVAC system, we're able to open some of those with some existing systems that are there. And then sometime, down the road when the supply chain constraints ease up a bit, they'll have time to be able to do some replacements there. So I think the short answer is it's still somewhat of a day-by-day. But I think that the further we get along, the more we're able to see things moving and the supply chain moving along.\n\nIt's just that basically us and everybody else out there, no one's caught up yet in terms of our vendors with not only us, but there are other customers as well. I don't know, Tom, do you want to add to that or not.\n\nTom Fitzgerald -- Chief Financial Officer\n\nNo, I think you covered it well.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nOK. Thanks, guys.\n\nChris Rondeau -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nI'll hand back to Chris for closing remarks.\n\nChris Rondeau -- Chief Executive Officer\n\nGreat. Well, thank you, everybody, for joining today. I couldn't be pleased with the second quarter, how it ended up and adding more members per store here and coming out of -- I don't know pandemic and fighting our way back. So pretty happy with that and really pleased with how High School Summer Pass has gone.\n\nI mean, it's truly amazing to see this many teens getting off the couch, using our stores here. And to be more than three times the 2019 shows how the younger generations are really gravitating toward health and wellness. So it's just a great tailwind to have now and in the future and our ways of being able to convert them to memberships to longer terms. So it's a great place to be than to not have a younger generation that gravitates to a brand.\n\nSo it feels really great and look forward to being with our franchisees next month, the first time in three years, seeing them all face-to-face, talk some strategy, talk future, and talk execution. So I look forward to that wholeheartedly. Have a great day -- afternoon. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStacey Caravella -- Investor Relations\n\nChris Rondeau -- Chief Executive Officer\n\nTom Fitzgerald -- Chief Financial Officer\n\nRandy Konik -- Jefferies -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nBrian Harbour -- Morgan Stanley -- Analyst\n\nMax Rakhlenko -- Cowen and Company -- Analyst\n\nDorvin Lively -- President\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nJonathan Komp -- Robert W. Baird and Company -- Analyst\n\nJohn Ivankoe -- J.P. Morgan -- Analyst\n\nGarrett Klingshirn -- BMO Capital Markets -- Analyst\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nMore PLNT analysis\n\nAll earnings call transcripts"
}