{
  "companyName": "Autodesk",
  "companyTicker": "ADSK",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/autodesk-adsk-q2-2023-earnings-call-transcript/",
  "content": "Autodesk (ADSK -0.66%)\nQ2 2023 Earnings Call\nAug 24, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to Autodesk's second quarter fiscal 2023 earnings conference call. At this time, all participants are in a listen-only mode. After the speaker presentation there will be a question-and-answer session. [Operator instructions] I would now like to hand the call over to Simon Mays-Smith, vice president, investor relations.\n\nPlease go ahead.\n\nSimon Mays-Smith -- Vice President, Investor Relations\n\nThanks, operator, and good afternoon. Thank you for joining our conference call to discuss the second quarter results of our fiscal '23. On the line with me are Andrew Anagnost, our CEO; and Debbie Clifford, our CFO. Today's conference call is being broadcast live via webcast.\n\nIn addition, a replay of the call will be available at autodesk.com/investor. You can find the earnings press release, slide presentation, and transcript of today's opening commentary on our investor relations website following this call. During this call, we may make forward-looking statements about our outlook, future results, and related assumptions, acquisitions, products, and product capabilities and strategies. These statements reflect our best judgment based on currently known factors.\n\nActual events or results could differ materially. Please refer to our SEC filings, including our most recent Form 10-K and the Form 8-K filed with today's press release for important risks and other factors that may cause our actual results to differ from those in our forward-looking statements. Forward-looking statements made during the call are being made as of today. If this call is replayed or reviewed after today, the information presented during the call may not contain current or accurate information.\n\nAutodesk disclaims any obligation to update or revise any forward-looking statements. During the call, we will quote several numeric or growth changes as we discuss our financial performance. Unless otherwise noted, each such reference represents a year-on-year comparison. All non-GAAP numbers referenced in today's call are reconciled in our press release or Excel financials and other supplemental materials available on our Investor Relations website.\n\nAnd now I will turn the call over to Andrew.\n\nAndrew Anagnost -- Chief Executive Officer\n\nThank you, Simon, and welcome, everyone, to the call. Today, we reported record second quarter revenue, non-GAAP operating margin, and free cash flow. End market demand remained strong during the quarter, resulting in robust new business activity. Renewal rates were again excellent.\n\nAll of this and our strong competitive performance more than offset the direct and indirect impact of geopolitical, macroeconomic, policy, and COVID-19-related factors. Growing commercial usage outside China, Russia, and Ukraine, record bid activity on BuildingConnected, and continued channel partner optimism leave us well placed to achieve our FY '23 goals. As I said last quarter, the structural growth drivers for our business that were critical to our performance during the pandemic, such as flexibility and agility, continue to support and propel us during this period of elevated uncertainty. These growth drivers further cement the important role we play in our customers' digital transformations and increase our confidence in our strategy.\n\nOur steady strategy, industry-leading products, platform, and business model innovation, sustained and focused investment and strong execution are creating additional opportunities for Autodesk. By accelerating the convergence of workflows within and between the industries we serve, we create broader and deeper partnerships with existing customers and bring new customers into our ecosystem. In pursuit of these goals, we announced at Autodesk University last year that we were moving from products to platforms and capabilities and bringing these capabilities to any device anywhere through the cloud. Over the coming weeks, months, and years, you will hear a lot more from us about our plans and progress to build a world-class customer experience, catalyze our customers' digital transformation and establish industry-leading platforms for design and make.\n\nAs evidence of the progress we have made already, Fusion 360 flew past 200,000 subscribers during the second quarter and signed its first million-dollar contract, both important milestones and indications of the opportunities ahead. I will now turn the call over to Debbie to take you through the details of our quarterly financial performance and guidance for the year. I'll then come back to provide an update on our strategic growth initiatives.\n\nDebbie Clifford -- Chief Financial Officer\n\nThanks, Andrew. Q2 was a strong quarter across products and channels. Our end markets were broadly consistent with last quarter, with our strongest growth in North America and growth in Europe and APAC impacted by the war in Ukraine and COVID lockdowns in China. Total revenue grew 17%, both as reported and at constant currency.\n\nBy product, AutoCAD and AutoCAD LT revenue grew 13%, AEC revenue grew 18%, manufacturing revenue grew 16% and M&E revenue grew 20%. By region, revenue grew 22% in the Americas, 15% in EMEA and 10% in APAC or 13% at constant currency. By channel, direct revenue increased 18%, representing 34% of total revenue while indirect revenue grew 16%. Our product subscription renewal rates remain strong, and our net revenue retention rate was comfortably within our 100% to 110% target range.\n\nBillings increased 17% to $1.2 billion, reflecting robust underlying demand. Total deferred revenue grew 12% to $3.7 billion. Total RPO of $4.7 billion and current RPO of $3.1 billion grew 13% and 10%, respectively, reflecting strong billings growth and, as we've highlighted in the last two quarters, the timing and volume of multiyear contracts, which are typically on a three-year cycle. Multiyear contract volume remained strong during the quarter, as expected and as you can see from the uptick in long-term deferred as a percent of total deferred.\n\nTurning to the P&L. Non-GAAP gross margin remained broadly level at 92%, while non-GAAP operating margin increased by 5 percentage points to approximately 36%, reflecting strong revenue growth and ongoing cost discipline. GAAP operating margins increased by 6 percentage points to approximately 20%. We delivered record second quarter free cash flow of $246 million, up 32% year over year, reflecting strong billings growth in both Q1 and Q2.\n\nWe continued our accelerated share repurchasing during the quarter. We purchased 1.4 million shares for $257 million at an average price of approximately $182 per share, which, when compared to last year, contributed to a reduction in our weighted average shares outstanding by approximately 3 million to 270 million shares. While our capital allocation strategy remains unchanged, you can expect that we will continue to invest organically and inorganically to drive growth. We've proactively used our strong liquidity to repurchase 3.5 million shares in the first half of this year, front-loading the offset of next year's dilution.\n\nNow let me finish with guidance. The underlying business conditions we've been seeing are broadly unchanged. As I mentioned earlier, we're seeing strength in North America and continued healthy growth in Europe and Asia, outside of Russia and China, due to the geopolitical situation in both regions, as well as the COVID lockdowns in China. Our renewals business continues to be a highlight, reflecting the ongoing importance of our software and helping our customers achieve their goals.\n\nAs we look ahead and as with previous quarters, our fiscal '23 guidance assumes that market conditions remain consistent for the remainder of fiscal '23. The strengthening of the U.S. dollar during the quarter generated slight incremental FX headwinds, which reduced full year billings, revenue, and free cash flow by approximately $20 million, $5 million, and $5 million, respectively. Bringing these factors together, the overall headline for guidance is that it is unchanged at the midpoint across all metrics, with the underlying momentum of the business offsetting those incremental FX headwinds.\n\nWe are narrowing the fiscal '23 revenue range to be between $4.99 billion and $5.04 billion. We continue to expect non-GAAP operating margin to be approximately 36% and free cash flow to be between $2 billion and $2.08 billion. The slide deck and updated Excel financials on our website have more details on modeling assumptions for Q3 and full year fiscal '23. While the challenges our customers face are changing, the growth drivers underpinning our strategy have only been reinforced, which gives us confidence in our long-term growth potential.\n\nWe continue to target double-digit revenue growth, non-GAAP operating margins in the 38% to 40% range, and double-digit free cash flow growth on a compound annual basis. These metrics are intended to provide a floor to our revenue growth ambitions and a ceiling to our spend growth expectations. Andrew, back to you.\n\nAndrew Anagnost -- Chief Executive Officer\n\nThank you, Debbie. Our strategy is to transform the industries we serve with end-to-end cloud-based solutions that drive efficiency and sustainability for our customers. Our business is scalable and extensible into adjacent vertical, from architecture and engineering through construction and operations, from product engineering to product data management and product manufacturing. It is also scalable and extensible between verticals, with industrialized construction, and into new workflows like XR.\n\nBy accelerating the convergence of workflows within and between the industries we serve, we are also creating broader and deeper partnerships with existing customers and bringing new customers into our ecosystem. For example, Kimley-Horn, one of the nation's premier planning and design consultants, expanded its EBA in Q2, broadening and deepening its long-standing partnership with Autodesk. In addition to increasing its utilization of Civil 3D and Revit and driving further operational efficiency gains through BIM and cloud collaboration, it also chose to expand use of Innovyze in its rapidly growing water practice to help drive more growth opportunities and productivity gains. As we highlighted last quarter, digital workflows are being adopted across the infrastructure life cycle from asset owners, architects, and engineers to construction to drive improved efficiency and sustainability.\n\nThe Indiana Department of Transportation, which was looking for an efficient solution to simplify its document management and field collaboration, is another good Q2 example. By adopting Autodesk Build and ACC Connect, it will improve communication and coordination throughout the construction process and streamline the documentation of citizen issues, resulting in less waste and more return per taxpayer dollar. Across construction, the industry continues to look to connect workflows from planning and design to preconstruction, construction, and ultimately, operations and maintenance. And we are enabling our customers to connect those workflows on a single platform.\n\nFor example, a commercial real estate and property management company focused on owners, investors and occupants was tired of having multiple platforms across the project life cycle, resulting in inconsistencies, rework, and poor handoffs. In Q2, it adopted the full Autodesk Construction Cloud to connect preconstruction with project management. It added quantification estimating to BuildingConnected and BIM Collaborate Pro in preconstruction and Autodesk Build for project management to give themselves a competitive advantage and increase profitability through improved collaboration and data management. Across the globe, our customers seek to connect and streamline their construction workflows, and we are enabling and accelerating that through our partner network, launching Autodesk Build in new markets like Japan, enabling more data formats on more devices, and delivering more value to our customers through account-based pricing.\n\nWe're also giving our customers control of their data through Bridge, leveraging the power of machine learning to anticipate project risk and seamlessly connecting workflows like takeoff, estimating, and budgeting to delight our customers and improve their productivity. With monthly active users growing more than 45% quarter over quarter, Autodesk Build is being rapidly adopted by existing and new customers to connect and streamline their construction workflows. Turning to manufacturing. We sustained strong momentum in our manufacturing portfolio this quarter as we connected more workflows beyond the design studio, developed more on-ramps to our manufacturing platform and delivered new powerful tools and functionality through Fusion 360 extensions.\n\nCustomers continue to expand their adoption of the Fusion platform beyond design and engineering. This quarter, a U.S. supplier of metal cutting tools chose to create a state-of-the-art collaboration tool on Fusion to enable its sales organization to demonstrate its digital manufacturing technology to customers. By enabling customer customization to be immediately reflected in factory manufacturing instructions, the tool will be a competitive advantage during the selling process.\n\nFor Autodesk, it adds a significant new persona group to Fusion's addressable market opportunity. In automotive, we continue to grow our footprint beyond the design studio into manufacturing as automotive OEMs seek to break down the work silos and shorten the handoff and design cycles. For example, a top-tier commercial vehicle manufacturer renewed and increased its partnership with Autodesk as part of its strategic focus on building a sustainable product and service portfolio, which leverages new technologies and digital innovation to accelerate electrical vehicle solutions. In addition to Alias, which it already uses for surfacing work of all its vehicles, it is utilizing VR technology from the wild in combination with VRED and Navisworks to drive innovation and visualization from design and engineering through factory design.\n\nOur Fusion 360 platform approach enables customers to seamlessly connect workflows and push the boundaries of innovation through the advanced design and manufacturing technologies and extensions. For example, a global leader in seat manufacturing, which works with many major automakers worldwide, engaged Autodesk Consulting to develop a blended workflow across design, product engineering, and manufacturing. The result was a seat that proves passenger comfort and safety while reducing the weight and number of parts. Using Autodesk design tools like Alias Conceptual Design and Fusion 360 design, it was able to redefine the seat design with thinner seat sections and improved comfort and safety.\n\nFusion 360's commercial subscribers grew steadily, ending the quarter with 205,000 subscribers, and demand for our new extensions, including machining, generative design, and nesting and fabrication continuing to grow at an exceptional pace. In education, engineering students are using Fusion 360 to learn the skills of the future in institutions like Grwp Llandrillo Menai, the largest further education college group in Wales. Students there are applying their studies to benefit local industry partners and businesses. For example, students recently used Fusion 360's cloud-based data management and advanced 3D machining to help a local RV manufacturer improve its output by about 50%.\n\nThe college is now planning to integrate Fusion 360 across its 11 campuses due to its ease of use, modern user interface, accessibility across devices, and ability to collaborate on team projects and share data. And finally, we continue to bring more users into our ecosystem through business model innovation and license compliance initiatives. When one of our EMEA customers realized that some usage from its international offices was noncompliant, it needed time and data to better understand its users before purchasing subscriptions. By purchasing our first-ever 100,000-pack of Flex tokens, the customer gained instant access to Autodesk's portfolio of products and usage data to make informed decisions on its future subscription purchases while also opening up new competitive opportunities for Autodesk.\n\nDuring the quarter, we closed seven deals over $500,000 with our license compliance initiatives, three of which were over $1 million. Flex and Premium are also helping customers transition from multiuser to named user contracts. A leading supplier of concrete formwork and scaffolding systems in Europe has been unifying internally around BIM to accelerate its digital transformation. It added Premium plan to its transitions and named trade-ins to centralize software management, enable user-based analytics and license optimization and benefit from single sign-on security.\n\nIt can also purchase Flex token to cover its occasional user needs. Let me finish where I started. Strong demand and robust competitive performance delivered excellent Q2 results. Our subscription business continues to demonstrate its growth potential and resilience.\n\nBy accelerating the convergence of workflows within and between the industries we serve, we are accelerating the digital transformation of our customers and creating broader and deeper partnerships with them. And by moving from products to platforms and capabilities and bringing those capabilities to any device anywhere through the cloud, we are expanding our opportunity horizon. Look for us to talk more about that over the coming weeks, months, and years. We look forward to seeing many of you at Autodesk University in a few weeks.\n\nOperator, we would now like to open the call for questions.\n\nOperator\n\n[Operator instructions] Please stand by while we compile the Q&A roster. Our first question comes from the line of Saket Kalia of Barclays. Saket Kalia, your line is open.\n\nSaket Kalia -- Barclays -- Analyst\n\nOK, great. Hey, Andrew, hey, Debbie. Thanks for taking my questions here.\n\nAndrew Anagnost -- Chief Executive Officer\n\nHow are you, Saket?\n\nSaket Kalia -- Barclays -- Analyst\n\nExcellent. Same here. Andrew, maybe first for you. Maybe we'll start [Inaudible] I wondered if you could expand a little bit on the comment around moving from products to platforms that we can all talk about [Inaudible] as the platform has evolved.\n\nBut maybe you can just walk us through what that looks like in the future in terms of a platform from your perspective?\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. I want to be careful not to give away all the AU tidbits in some of those discussions. But it's an important question. Saket, I -- to put it in perspective, right now, we sell literally hundreds of products.\n\nAnd the challenges for our customers is trying to find out which one of these products solves which problems for them and also the fact that a lot of these products don't talk to each other very easily. So when you're selling hundreds of products, it's really difficult to connect data flows across all those capabilities. It's also really difficult to uniformly deliver multi-platform support, multi-device support, cloud computing, and AI automation, which is really challenging. So what we're doing is we're moving away from this kind of disconnected portfolio of products to really a set of platforms to target each one of our industries with some underlying core technologies that support all of it.\n\nThat will enable us to actually deploy capabilities to our customers as they need them for particular types of process, right, advanced manufacturing capabilities on a time-bound basis or a consumption basis, accumulation capabilities on a time-bound basis or a consumption basis. So they get access to what they need when they need it, and it's all unified from a data flow point of view. This is kind of going to be revolutionary for a lot of our customers in terms of the evolution and where we're taking them. So it's really valuable for our customers in terms of connecting how they work and the value they get from each one of our products.\n\nAnd it's really important to us in terms of delivering more layers of automation and power to them to the cloud. So it is a journey. It's not going to happen overnight, but Fusion is an excellent example of where we're going and how we could deploy some of these things to our customers, especially when you look at the way extensions work, consumption works on top of the Fusion platform. It's a good model for where we're taking industry platforms for each one of our industries.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it, got it. That's really helpful. And it sounds like it will be exciting at AU. Debbie, a follow-up for you.\n\nCan you just talk a little bit about the multiyear [Inaudible] business? How are those renewals? I know they're starting to trickle in from three years ago in a bigger way. How are those renewals kind of coming in versus your expectations? And maybe looking forward, how do you plan on phasing that option out, I think, [Inaudible]\n\nDebbie Clifford -- Chief Financial Officer\n\nSure. So, we continue to track the multiyear cohort closely. Our proportional volume for multiyear has been in line with our expectations for the first half of fiscal '23, so that gives us confidence in our fiscal '23 outlook. We also saw long-term deferred revenue as a percent of total deferred revenue tick up.\n\nThat, too, was in line with our expectations. As we look ahead to the transition from upfront to annual billings, well, it hasn't started yet. We anticipate that the transition's going to start in early fiscal '24, and we continue to work through the programmatic and operational details to get there, things like a partner transition plan, back-office system upgrades. But I'll say again, it's our bias to go as quickly as possible.\n\nIn the meantime, obviously, we're focused on closing out this year, making sure that those multiyears come in consistent with historical patterns. And the fact that they are is giving us that confidence as we look to achieve our goals for this year.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. Very clear. Thanks guys.\n\nOperator\n\nThank you. Our next question comes from the line of Phil Winslow of Credit Suisse. Phil Winslow, your line is open.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nThanks for taking my question, and congrats on another quarter, reinforcing how Autodesk grows is simply not as cyclical anymore. Andrew, I wanted to focus on the AEC side because this is the area that I get the most questions on in terms of cyclicality, with two questions of my own for you. Firstly, what are you hearing from design customers in this segment about what continues to drive your incremental spending on Autodesk despite the cloudier macro? And then secondly, the 45% quarter-to-quarter growth in Autodesk Build MAUs in the slide deck and your commentary on just the BuildingConnected volumes also really stood out to us. Similarly, what are you hearing from these construction customers about why they also continue to lean in on digitizing their workloads in spite of the macro? Or is this becoming because of the macro volatility that they're digitizing? Thanks.\n\nAndrew Anagnost -- Chief Executive Officer\n\nThat was a multi-part question. I will address it. So first off, let's talk about what we're hearing from design customers. The No.\n\n1 thing we're hearing from the design segment is the backlog of business, right? They have more business right now than they're able to effectively execute on. And the requirements of that business are increasing in terms of what kind of tools they need to use, how they need to approach the problems, owners, municipalities, all sorts of customers they deal with are putting more requirements on how they have to work. So they're all looking to kind of up their game in digital tools. The biggest challenge we hear from these customers is hiring, frankly.\n\nWe were hearing last year a lot of conversations about, oh boy, fixed bid contracts and inflationary pressures and all these things. As I've said previously, they bake these things now into their business bids and they're able to capture those costs in their contracts. But what they're struggling with is hiring. We're still growing even if they struggle to hire because they're getting people in but they have more demand for manpower and person power than they actually are able to capture at this point, OK? So that's something we're hearing really robustly.\n\nNow, let's go to the growth in construction. First off, I want to give you my quarterly disclaimer. When you look at the construction business, the make number does not capture the full story in the construction business. The EBA growth in the design bucket.\n\nSo when you count how we're doing with our enterprise business agreements and the overall territory business, that we grew close to 30% in that business. So that's really quite nice growth. And what we're hearing, and I'm glad you picked up on the 45% growth on monthly active users, we're hearing a couple of things. One, first off, we've lit up our territory business, our partners in the territory.\n\nThis is driving a lot of really nice growth in the U.S. and in Europe, and it's going to continue to drive that growth. And that's bringing us closer to certain customers lower down in the market, the mid-market and below, which I think is a really important point in our journey, OK? The other thing I want to talk about is when customers are starting to realize is they need a lot more than just a project management or a construction site management tool. They really are looking to their future where they're trying to connect the design and the build all the way together continuously.\n\nAnd one of the big linchpins in all of that is preconstruction planning. The vast majority of the cost and complexity of a construction project is built in during the preconstruction planning phase. You get that wrong, you bid wrong, you come in with lower margins, you have more churn and complexity in your project. So this connection between design, preconstruction all the way to build is increasingly really important to their customers.\n\nSo customers are taking a lot more time to evaluate what they're trying to invest in. And I think you also probably noticed, at least a little bit in the introductory commentary, that infrastructure is a big play for us here. So Department of Transportation, and you saw Indiana, the Indiana Department of Transportation lean into our portfolio for looking at their future needs. We're hearing more and more from Departments of Transportation that are really looking to upgrade and modify their stack to be much more designed to build on a much more modern cloud infrastructure.\n\nSo there's a lot going on in construction, Phil, and it's coming at us from multiple directions, and right now, it's all positive.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nAwesome. Appreciate all the details. Thank you, and keep up the great work.\n\nAndrew Anagnost -- Chief Executive Officer\n\nThanks, Phil.\n\nOperator\n\nThank you. Our next question comes from the line of Jay Vleeschhouwer of Griffin Securities. Jay Vleeschhouwer, your line is open.\n\nJay Vleeschhouwer -- Griffin Securities -- Analyst\n\nGood evening, Andrew, Debbie, and Simon. Andrew, you have, by our calculation, the largest R&D budget in your peer group, but you don't necessarily have the largest headcount in R&D. And so the question is, particularly given your earlier comment about the large number of products that you're currently developing and having to manage, how you see or how are you working on improving your R&D productivity or effectivity, if you will, in terms of your core platform, your applications technology and ultimately, product usability to drive MAUs and further enlarging the installed base? And then for Debbie, you commented earlier with respect to your back-office as part of your initiatives over the next number of years. On that point, could you comment on where you are in terms of your operational capacity for the new licensing model and deliverables that you're going to have as you have an increasingly complex offering to customers in terms of Flex and everything else you're doing, the platform Andrew mentioned? Are you, in fact, going to have the requisite back office to handle all of that?\n\nAndrew Anagnost -- Chief Executive Officer\n\nAll right. So, Jay, let me start with your questions. Yeah, you are correct. We have the largest R&D budget but we don't necessarily have the largest headcount on R&D.\n\nPart of that is because of where we concentrate on R&D and what kind of talent we're pursuing. We're pursuing a lot of cloud talent, a lot of cloud-native talent, full staff development talent that allows us to build out the core cloud capabilities and continue to expand them. That talent resides in certain places, and it has certain costs associated with it and we think that's the right strategy. We don't hire a lot of R&D content headcount that's associated specifically with customer-specific development in, say, other parts of the world.\n\nSo we do hire in specific areas because of what we're trying to do. And when it comes to developer productivity, you hit on a really important aspect of why do we have platform services. Why are we extending the depth and breadth of the things that we build in the platform services? One of the reasons we're doing that is to lift the burden away from some of these development teams on things like data flow, on things like visualization and capabilities that should be uniform across every platform or product that we -- or capability that we deploy. So more and more, as you see these -- the portfolio of platform capabilities not only mature but expand, it's going to increase the productivity of the teams that are looking at features that are facing particular industries and capabilities that are facing particular industries.\n\nIt's a big part of why we have these services, and we're already starting to see some of those benefits, especially with regards to data flow, which is an initiative driven primarily by the platform organization within Autodesk. And it's being aligned across the various industries to make sure that we get the right kind of synergies and lift from our data APIs and our data connectivity. So, yeah, you will see increasing productivity associated with this. We're definitely spending on quality over quantity, and I think that's the right strategy for where we're at right now.\n\nDebbie Clifford -- Chief Financial Officer\n\nAnd then Jay, to answer your question about operational capacity for things like new business model, I would say that we are well on our way on this journey but we still have some ground to cover in order to be where we need to be. And I think that that's an appropriate place to be at this stage of the journey. Now, of course, we don't launch new business models without the ability to support them, which is why, as one example, we are delaying the shift to annual billings until next year so that we can spend the time that we need to be able to invest in our back-office systems to make sure that we have a good customer experience and that we have the right controls and automated capabilities in the back office. I mean, ultimately, this is something that we focus on not only to make sure that we have the capacity to support new business models but also so we can scale.\n\nIf we want to achieve our long-term growth aspirations, we need to continue to invest in our back-office infrastructure in order to be able to scale efficiently, effectively and in an automated way to do it.\n\nJay Vleeschhouwer -- Griffin Securities -- Analyst\n\nOK. Thank you very much.\n\nAndrew Anagnost -- Chief Executive Officer\n\nThank you, Jay.\n\nOperator\n\nThank you. Our next question comes from the line of Matt Hedberg of RBC Capital Markets. Your question please, Matt Hedberg.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nHey, thanks, guys. Andrew, for you, the growth in Fusion 360 was really fantastic to hear. Can you talk about sort of where those subs are coming from? Are these greenfields? Are they replacements? And maybe just a little bit more on sort of with a lot of alternatives, why Fusion 360?\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. So first half is a bit of a mix, all right? A lot of these are greenfield investors acquiring design software connected to manufacturing software for the first time. But there's a lot of rip and replace going on. I think you've probably heard me talk many times about how we're going into accounts where people might have a seat of SolidWorks and a seat of Mastercam or some kind of other CAM software and they're saying, \"Well, Fusion is all I need.\" And we're -- we've been consistently creating and growing subscribers from that type of business.\n\nBut what we're seeing more and more, and I think this is one of the things that is important about the user growth you're seeing, is that where we've gone in and we've started some department or part of a particular company, we're starting to grow the installed base within those companies. So we're still bringing in new customers, primarily along this design to make vector, but we're starting to grow within the accounts we've captured. This is the kind of flywheel you'd like to see as you start to mature a business, and we're starting to see some of that. The reason people buy is there is there's three kind of vectors here that people pay attention to: One, of course, is the price.\n\nThe pricing model for Fusion is disruptive. It's native subscription-based. It's not a reimagining of an existing perpetual business. It's a native subscription-based business.\n\nIt has extensions and things and consumptive models that allow people to pay for what they use and manage how much it costs from the use of software. They love that. Two, they love the design to make integration, the end-to-end integration from the design process all the way to actually programming and driving the machine on the shop floor. This kind of merger and convergence of design and make something that's really valuable to a lot of people.\n\nAnd the third thing might surprise you a little bit. It's our YouTube community. It's the amount of content that's out there on YouTube, which by the way, exceeds even much more mature products that are out there in the market, where people cannot only learn how to do something in Fusion, they can learn how to do it exceptionally in Fusion. It's a very passionate, very engaged, and really very knowledgeable community that's publishing all this content.\n\nAnd people really buy for those reasons. They buy for the disruptive business model, they buy for the design make integration and they buy for the fact that they can find just a tutorial about just about anything you can think of to get really expert level in the product.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThat's super, super helpful. And then Debbie, the consistency is obviously really good to see. The macroenvironment, this is not easy, clearly, but the consistency was great. I'm wondering if you could talk a little bit about the linearity in the quarter.\n\nAnd maybe what are you seeing thus far in August?\n\nDebbie Clifford -- Chief Financial Officer\n\nSo the linearity that we saw during the quarter is consistent with what we've seen in previous periods. I would say nothing newsworthy to report there. And obviously, at this point, we're not commenting on what we're seeing in August.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Adam Borg of Stifel. Your line is open, Adam Borg.\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nGuys, and thanks so much for taking the question. Maybe just first for Andrew on the Infrastructure Bill. I know that's something we talked about in the past and the positive tailwinds that could have for Autodesk. So maybe just a quick update here.\n\nAnd then as I think about the recently passed Inflation Reduction Act, there's a lot of language in there about clean energy and sustainability. I'd love to hear how you think about that impacting Autodesk over time as well.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. And so first, let's talk about the Infrastructure Bill. As with any of these goals and like I've said in the past, the money is slowly trickling out, all right? And what you're seeing is people are actually starting to begin the process of planning around particular types of projects. But more importantly, what's happening is a lot of the recipients of some of these funds, particularly Departments of Transportation, are starting to rethink how they're approaching their design processes.\n\nAnd by the way, energy efficiency and sustainability play into how they think about some of these things. So remember, there was a seed money in that bill to enable Departments of Transportation to explore and expand digital transformation in their processes. This is bringing about a lot of introspection and thought within these departments. And they're starting to look at their next 10-year portfolio of tools.\n\nAnd they're looking to buy ahead of their ability to plan and execute some of these infrastructure projects. We are absolutely seeing that early activity with regards to our relationship with large firms like AECOM that engage in the infrastructure and how they're going to engage over the next 10 years and Departments of Transportation that have similar challenges and similar needs over the next 10-year period, OK? So that's something we're seeing live. Now with regards to the Inflation Reduction Act, the jury is out on that, all right? Anything that drives energy efficiency and sustainability is ultimately going to trickle down into what the requirements are for some of our customers, especially when electrification is becoming so important. So you're going to see a lot more electrification and efficiency spec for our customers.\n\nBut unclear where that will fall with regards to impact on our business.\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nThat's great. And maybe just a quick follow-up, even on Matt's question on Fusion 360. Just on manufacturing more broadly, we'd love to hear more about Upchain and how that fits in the broader strategy you've been talking about here with Fusion 360 today. Thank you, guys.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. So Upchain is the data management layer that's cloud-native that allows us to actually not only manage the flow of Fusion information environment but any other heterogeneous data that might exist in the environment. All of our customers live in a heterogeneous world. We will never have a customer that is uniformly using just an Autodesk product or just Autodesk's portfolio.\n\nSo not only does Upchain bring us cloud-native data management but it also brings us heterogeneous management of this data and the ability to manage this flow and reconcile things in the cloud, which has huge power for how people use data management in the future. If you look at the evolution of Upchain, it's going to more and more just merge with some of the Fusion life cycle and Fusion managed capabilities we already have and will become the native cloud data management platform for Fusion. So that's where Upchain plays. It's basically a deep and wide native data management platform in the cloud for us.\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nExcellent. Thanks, again.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYou're very welcome.\n\nOperator\n\nThank you. Our next question comes from Joe Vruwink of Baird. Your question please, Joe Vruwink.\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nGreat. Thank you. I guess I'll stick on manufacturing because I think to get 16% growth there, the desktop products have to be contributing at a pretty high level. What's been the driver of success there? And then you shared an interesting anecdote just in automotive and seeing broader usage.\n\nHow much can that same playbook be used in process or some of your other discrete sectors where you have exposure?\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. So you picked up on something, we're growing faster than any of our competitors so we continue to take share in manufacturing. And yes, you're right, it's our whole portfolio that's continuing to grow the share in manufacturing. And why is that? So there's a couple of reasons.\n\nOne, we keep introducing new technologies, all right? And we bring these new technologies to our customers in a way that if you buy the present, you get the future, right? So if you're buying, you get Fusion. And that allows you to not only feel good about the product you're using today but know that you're hooked up to where the company is going over the next five to 10 years. And I think that's a real competitive advantage for us in terms of how we bring technology to market. But you're also seeing us blend new types of technologies into the workflows that our customers are trying to do in automotive and other places.\n\nI think one of the things that was interesting about what I said in my opening commentary was the blending of both The Wild and VRED which is -- The Wild was a very early acquisition and then we have VRED, which is an existing mature technology. People are exploring the intersections of various technologies that we have. And you've probably picked up on the fact that our strength in manufacturing has extended more into facilities management with large manufacturers and looking to manage their actual factory assets. So there's overlap associated with those things and there's some overlap with our AEC business with regard to that.\n\nBut those are the things that are kind of driving our growth in manufacturing. You're right, it's the whole portfolio. The whole portfolio is moving forward and you're also seeing obviously tremendous growth with Fusion, right? We have to maintain that. We like what we see, but customers like what we're doing.\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nOK, that's great. And then just trying to put the pieces together with guidance. So you're raising the organic forecast by a bit. This still sounds like it assumes the same underlying macro assumptions.\n\nSo ultimately, it's Autodesk's execution that's driving the organic raise. I guess what is the driver of better-than-expected performance there?\n\nDebbie Clifford -- Chief Financial Officer\n\nUltimately, it is about execution but it's the momentum in the business that we saw, particularly as we exited Q2. So here's how we're thinking about guidance. We had that slight lead in Q2. But of course, we kept our full year guidance flat [Inaudible] of the currency headwinds.\n\nThe guidance does reflect the demand environment that we saw as we exited Q2. That's consistent with what we've done with previous quarters. The business continues to perform strongly. We have that resilient subscription business model, which is durable during a potential economic downturn and we exited Q2, as I said, with strong momentum.\n\nSo these are all the factors that are baked into our guidance. I also want to point out that we did retain a range of $50 million on revenue. That gives us some flexibility, especially with that subscription business model, which is more predictable and a significant portion of our future revenue is already on the balance sheet.\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from Jason Celino of KeyBanc Capital Markets. Jason Celino, your line is open.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nGreat, thanks. It's good to hear the strong bidding activity through BuildingConnected. With customer backlogs still lengthened and these hiring challenges that you keep hearing about, is there any change to the lead time on the projects being bid on? I guess what I'm asking is, is the strong activity you're seeing for next year, following year, how does that kind of pan out?\n\nAndrew Anagnost -- Chief Executive Officer\n\nYou know what, that is an excellent question. I'm not sure I can answer it in a satisfying way. But here's what I will say. Current bidding activity is a predictor of future build activity, right? Bidding with contractors and other things is an early process in actually executing a project.\n\nSo when you see an increase in bid activity on BuildingConnected, what you're actually seeing is an increase in the book of business of projects that will actually get executed downstream, right? So this is a good predictor of ongoing activity as you close a bid, you actually then move into execution with that particular subcontractor and some of the things associated with that. So it does give us a forward indication of how much site activity is going to be happening and how much actual real building is going to be going on. And that's one of the reasons why we highlighted one of the reasons we value that connection to the bid activity so much. Not exactly what you asked but that's the depth that I can answer at this point.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nOK, perfect. And then on Innovyze, I think you mentioned it kind of in one deal in your prepared remarks, but how is it performing? Any change to win rates since you've acquired it? And then I think at some point, there was going to be some sort of subscription effort transition for the existing base. Any worthwhile update there?\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. So Innovyze continues to perform well. It's doing particularly well in terms of our EBA businesses. A lot of our enterprise business agreement customers are looking to incorporate Innovyze into their contracts with us, which is exactly one of the big synergies we expected when we acquired Innovyze.\n\nThey have begun their business model transformation. They're in the throes of that right now. It's going quite well. We expect to finish that in a reasonable amount of time.\n\nSo that's going quite well. But the business is doing well, and we continue to get a lot of interest not only in water in general from our customers, but also in the owner side of Innovyze where they're building solutions that actually manage the operation of the water facilities.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nPerfect. Thanks, Andrew.\n\nAndrew Anagnost -- Chief Executive Officer\n\nThank you, Jason.\n\nOperator\n\nThank you. Our next question comes from Michael Funk of Bank of America. Michael Funk, your line is open.\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Thank you for the question this evening. A couple if I could. Just back to the comments of the uniformity of products as you move to a platform or saying you don't want to tip your hand here.\n\nBut how heavy of a lift is this? And what is the timing involved? And then in addition to the increased attractiveness for customers, are there efficiencies that will accrue to Autodesk as well by adding more uniformity across the platforms?\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. So first off, let's be super clear. This isn't something that we're just suddenly starting out of the blue, right? It's been going on for quite some time in various forms. It is the most mature in its journey in the manufacturing space with what we're doing with Fusion 360.\n\nAnd that gives you a lot of visibility to what happens and how the portfolio is consolidated over time. A lot of capabilities that exist as separate products have shown up as extensions and native capabilities in the Fusion environment. And that absolutely gives us long-term synergies where we're building on one environment versus trying to support the multiple products and their multiple needs. So you actually do get a lot of synergies.\n\nRight now, of course, we're double spending on a lot of things and we will double spend for some time. But the journey is not new to us. Fusion is quite mature. AEC is beginning its journey, seated with some of the cloud-native acquisitions we did particularly around what we did with Spacemaker, a team that has been very much focused on the future of how people do building information model on a cloud platform, building information modeling on a cloud platform.\n\nAnd we have other things that we'll be showing up in the media and entertainment space, again not wanting to tip my hand for some of the discussions we'll have later. But yeah, there are long-term synergies here. We are absolutely and will continue to double spend for a period of five to 10 years on some of these. Products overlap for a long time.\n\nWe've been through several transformations of products, AutoCAD and Revit, Mechanical Desktop and Adventure in the past for those of you who are familiar with some of those names. And yes, the overlap takes a while but eventually, what happens is most of the engineering effort and capability goes to the new platform and we evolve away in that direction.\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood, yes. Long-term complex project. And then the earlier comments on the delay and shift to annual billing. Just want to make sure I completely understood.\n\nWas the comment that you wanted to make sure that the processes were better than they are now and the back office is better than it is right now? And if that's correct, I guess what were the issues that you were seeing that you wanted to streamline just to make that a more enjoyable process for the customers?\n\nDebbie Clifford -- Chief Financial Officer\n\nYeah. So first, let's level set on our intention to move from a multiyear upfront annual billings was always intended to start at the beginning of next year. So that's not any change that we've made on our side. And the reason why we did that was twofold: one, we needed to invest in our back-office systems infrastructure to make sure that we could execute on this transition at scale in an automated way, such that our customers would have a good customer experience, and we would have the controls and automated processes in place that we need in our back office.\n\nSo that's point number one. Maybe more importantly is point number two. Our partners are a really important part of our ecosystem. And so it was important to us to give them advanced notice, getting back to our last Investor Day, that we intended to embark on this journey so that we could work together with them to build the program, policies and all the things that we needed to do to make sure that they were along with us on the journey and that the entire ecosystem benefits from the shift to annual billings because just like it will be predictable for us to have an annual billing cycle, so too will it be for our customers and our partners.\n\nBut our partners needed time to plan. And so we wanted to make sure that we were collaborating with them in a healthy way as we move toward this transition.\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nYes, that's pretty helpful color. Thank you.\n\nOperator\n\nThank you. Our next question comes from Bhavin Shah of Deutsche Bank. Bhavin Shah, your line is open.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nAndrew, we continue to hear very good things about BIM Collaborate Pro within the architecture and engineering customer base. Can you maybe better help us understand where we are in terms of adoption of Collaborate Pro within like the Revit customer base? And how we should think about the adoption curve going forward?\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. It's an excellent question. Look, it's still actually really early. I mean, BIM Collaborate Pro continues to grow robustly.\n\nAs you recall, when we were -- during the pandemic, we saw quite a surge in the adoption of that product, and the adoption of it has continued post the pandemic period as more and more people become aware of the capabilities of BIM Collaborate Pro. In terms of total penetration into the Revit base, it's still really early days in terms of penetrating the vast majority of the Revit base. In fact, interestingly enough, one of the biggest requests we get is to make BIM Collaborate Pro work as robustly with Civil 3D as it does with Revit. And that's something that we're addressing, which is another vector where Collaborate Pro is going to be able to penetrate the infrastructure space as well.\n\nStill, really early days though in total penetration of the Revit base. Continues to grow. It's an on-ramp to digital preconstruction and Autodesk Construction Cloud in many ways. And we're really happy with the way customers are adopting that.\n\nIt was one of the unexpected silver linings of the turmoil and tragedy of the pandemic that customers finally realize that that is a utility that is valuable to them now and in the future.\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nMakes a ton of sense. And I guess along those lines and you kind of intimated at this a little bit, like in terms of adoption here, have you seen that accelerate customers' journeys toward some of your other cloud-based solutions that you guys offer?\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. It absolutely does. It's a -- I hesitate to call it an on-ramp to our full portfolio of cloud solutions. But what it does is it gives customers a lot of confidence in how the cloud actually changes their processes.\n\nThey actually start to understand that, wow, this isn't just better. It's actually different and better. And it allows them and empowers them and encourages them to explore some of the other capabilities. Oh, maybe I should be doing a preconstruction planning in the cloud.\n\nOh, if I'm doing preconstruction planning in the cloud, I should be doing online site management in the cloud as well. So it absolutely demystifies the cloud for them and shows some of the core benefits. It really does educate a lot of our customer base on why the cloud matters and why it's so important to their distributed and highly collaborative future.\n\nOperator\n\nWe'll go to our next question, which comes from the line of Gal Munda of Wolfe Research. Gal Munda, your line is open.\n\nGal Munda -- Wolfe Research -- Analyst\n\nThank you for taking my question. And maybe, Andrew, just for you to start. You are calling out the noncompliant users again, and it seems like you're running roughly at a run rate that you were pre-pandemic again. How much of that is just having a Flex model as well as being able to go more effectively toward your accounts that already pay you but maybe not pay enough and now you have a tool in order to monetize that? And maybe just how big Flex could be in the future as you embark on that opportunity?\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. So actually, Gal, you're picking up on something that was implied in the opening commentary that Flex is a highly valuable tool when you go and you reach the noncompliant users. In a lot of cases, what you're finding in a noncompliant usage situation is it's a multiuser situation gone bad, all right, where they've over-installed software or they've tried to use software in unlicensed ways. And what they're really trying to do is distribute usage, enable occasional usage, and some of the things associated with that.\n\nFlex is an excellent way to walk into some of those accounts and, in a collaborative manner, get them exploring other ways of engaging with Autodesk. And it absolutely will have some positive impacts on how we do license compliance business. Now as we look broadly at Flex, again, it's still really early days with Flex. We continue to see growth and we continue to see a lot of new users coming in with Flex.\n\nOne of the growth vectors for Flex that I'm particularly excited about is in the long tail of our business. Because what Flex allows you to do, if you're in a smaller company, say you're in a five-person company and you want to occasionally use Revit for some of the projects you bid on, but the vast majority of your projects are AutoCAD or you want to engage in structural simulation for a particular product, the Flex model lets people dabble. It lets people engage with advanced functionality and advanced capabilities on a pay-per-use basis. And they don't have to commit to an annual subscription or a multiyear subscription to get some of these capabilities.\n\nSo I think there's a lot of long-term growth capabilities built into the long tail of our business that Flex will likely unlock. The jury is still out. We're early on the journey so we'll see where that heads. That's one of the areas that I think is very interesting for Flex.\n\nOperator\n\nAnd as that is all the time we have for questions, I'd like to turn the call back over to Simon Mays-Smith for any closing remarks.\n\nSimon Mays-Smith -- Vice President, Investor Relations\n\nThanks, everyone, for joining us. We'll look forward to seeing, we hope, many of you at AU, Autodesk University, in a few weeks' time in New Orleans. I'm sure I'm pronouncing the name correctly. Thanks, everyone.\n\nThank you, Latif.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSimon Mays-Smith -- Vice President, Investor Relations\n\nAndrew Anagnost -- Chief Executive Officer\n\nDebbie Clifford -- Chief Financial Officer\n\nSaket Kalia -- Barclays -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nJay Vleeschhouwer -- Griffin Securities -- Analyst\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nJoe Vruwink -- Robert W. Baird and Company -- Analyst\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nBhavin Shah -- Deutsche Bank -- Analyst\n\nGal Munda -- Wolfe Research -- Analyst\n\nMore ADSK analysis\n\nAll earnings call transcripts"
}