{
  "companyName": "Xometry, Inc.",
  "companyTicker": "XMTR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/xometry-inc-xmtr-q2-2022-earnings-call-transcript/",
  "content": "Xometry, Inc. (XMTR 5.60%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by, and welcome to Xometry Inc. second quarter 2022 financial results conference call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question-and-answer session.[Operator instructions].\n\nPlease be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Shawn Milne, head of investor relations. Please go ahead.\n\nShawn Milne -- Vice President, Investor Relations\n\nGood morning, and thank you for joining us on Xometry's Q2 2022 earnings call. Joining me are Randy Altschuler, our chief executive officer; and Jim Rallo, our chief financial officer. During today's call, we will review our financial results for the second quarter and discuss our guidance for the third quarter and full year 2022. During today's call, we will make forward-looking statements, including statements related to the expected performance of our business, future financial results, strategy, long-term growth, and overall future prospects.\n\nSuch statements may be identified by terms such as believe, expect, intend and may. These statements are subject to risks and uncertainties, which could cause them to differ materially from actual results. Information concerning those risks is available in our earnings press release distributed before the market opened today in our SEC filings included in the Form 10-Q for the quarter ended June 30, 2022, that will be filed with the SEC. We caution you not to place undue reliance on forward-looking statements and undertake no duty or obligation to update any forward-looking statements as a result of new information, future events or changes in our expectations.\n\nWe'd also like to point out that on today's call, we will report GAAP and non-GAAP results. We use these non-GAAP financial measures internally for financial and operating decision-making purposes and as a means to evaluate period-to-period comparisons. Non-GAAP financial measures are presented in addition to and not as a substitute or superior to measures of financial performance prepared in accordance with U.S. GAAP.\n\nTo see the reconciliations of these non-GAAP measures, please refer to our earnings press release distributed today in our investor presentation, both of which are available on the Investors section of our website at investors.xometry.com. A replay of today's call will also be posted on our IR website. With that, I'd like to turn the call over to Randy.\n\nRandy Altschuler -- Chief Executive Officer\n\nThanks, Shawn. Good morning, everyone, and thank you for joining us for our Q2 2022 earnings call. We are pleased to report another strong quarter with record revenue and gross profits. We delivered 89% revenue growth and 217% gross profit growth year-over-year in Q2.\n\nWe reduced our adjusted EBITDA loss by $4.4 million quarter-over-quarter to $8.3 million, making significant progress to being adjusted EBITDA positive in 2023. We are rapidly delivering on our mission to build a leading global digital manufacturing marketplace, transforming one of the largest industries in the world. While we are still in the early innings of the secular shift to the digital for manufacturing, Fortune 1000 companies are increasingly rethinking their supply chains and manufacturing strategies. Xometry is uniquely positioned to meet their needs through the breadth of our platform across verticals, processes and capabilities.\n\nLikewise, we are uniquely positioned to meet the needs of our suppliers through our growing suite of supplier services. At the end of Q2, we hosted our first Xometry summit to showcase product releases that enable Xometry to increasingly become the de facto operating system for buyers and suppliers to connect and deliver in our over $2 trillion market. By providing buyers with more choices, we will capture more of their spend and gradually become their one-stop shop for all their needs. The same thing is true for the suppliers, many of whom are not currently Xometry partners.\n\nWith our new cloud-based software platform Xometry work center, we aim to be the operating system for hundreds of thousands of suppliers. We are opening a work center to third-party developers to create integrated applications to benefit suppliers. If we can find additional ways to provide value to those suppliers, the size of our supplier base will grow exponentially. For those who did not see the event, it is archived at live.xometry.com.\n\nI will discuss these launches in more detail later in the call. Since our founding in 2013, Xometry has grown very quickly. This growth has continued unimpeded during the disruptive events over the last two years, proving that our marketplace can deliver durable growth, irrespective of the macro environment. Our unique ability to match buyers and suppliers in real-time and our weekly updates to our AI-driven pricing model provides reliable pricing and predictable margins, even during periods of inflation.\n\nLikewise, with our supplier network expanding domestically and abroad, we offer customers resilient supply chain. Moving on to our Q2 results. I will provide a review of our second quarter performance and provide an update on key business initiatives, including the recent launches of the new industrial buying engine on Thomasnet and Workcenter, then I will turn the call over to our CFO, Jim Rallo, for a more in-depth review of our financial results and outlook. We had a strong Q2, with revenues of $95.6 million, driven by accelerated marketplace growth and expanding supplier services with the addition of Thomas.\n\nQ2 Marketplace revenue was $75.6 million, growing over 55% year-over-year and 17% quarter-over-quarter. Marketplace revenue consists entirely of the historical Xometry business, excluding Xometry supplies and financial services. Marketplace revenue growth was driven by continued strong growth in active buyers and the rapid adoption of the platform by larger accounts across both North America and Europe. Likewise, we experienced strong year-over-year growth in many of the different manufacturing processes offered in our marketplace.\n\nIn Q2, active buyers increased 40% year-over-year to 33,491, adding a record 2,808 in Q2. We saw strength across multiple verticals, including automotive, electronics and semiconductors, robotics and automation as well as ongoing strength in general manufacturing. The number of accounts with last 12-month spend of at least $50,000 increased 76% year-over-year to 894, adding a record 104 accounts in Q2. As we've discussed in our Q1 call, we continue to see growing traction in production orders from several customers across industries and manufacturing processes, including robotic assemblies in agriculture and injection molding for an electrical vehicle company.\n\nGiven the success of our land and expand strategy, we continue to invest in our enterprise sales engine. Q2 supplier services revenue was $20 million, including Thomas, which we acquired in December of 2021. The vast majority of supplier services revenue is the Thomas marketing services and advertising business, plus historical Xometry supplies and financial services. We provide convenient access to supplies, enabling manufacturers to lower their cost of operations.\n\nWe also improve their cash flow through our growing basket of fintech products. With Thomas, we've expanded our baskets' supplier services, including marketing and advertising solutions. Our international business continues to deliver strong growth with revenue increasing 136% year-over-year. In Q2, we further expanded our sales presence in the U.K., Germany, France and Nordic regions.\n\nAlongside strong top line growth, Europe continues to rapidly expand gross margins, underscoring the success and demand for our marketplace across geographies. In addition, we formally launched the platform in China at xometry.asia in late Q1 and began taking orders from Chinese customers in April. We are pleased with the initial launch and continue to scale up the in-country team and supplier base and expect China to contribute to revenue growth in 2023. On top of strong revenue growth, gross profit grew 217% year-over-year in Q2, driven by significant improvements in marketplace gross margin and the addition of higher-margin supplier services.\n\nIn Q2, marketplace gross margin increased 180 basis points quarter-over-quarter to 29.2% and increased significantly year-over-year. Over the past three years, marketplace gross margins have grown from 18% in 2019 to now to close to 30%. As our marketplace continues to scale and as the number of transactions grow, our machine learning becomes smarter, driving better matches for buyers and suppliers and helping improve gross margins. At the same time, we continue to ramp up our network of active suppliers which further enables our marketplace to successfully match supply and demand and improve gross margins.\n\nThe combination of these factors gives us significant confidence in reaching our long-term marketplace gross margin target of 35% to 40%. On top of strong financial results, Q2 marked the largest product release schedule in Xometry's history, as we introduce new products and services to provide an integrated solution for buyers and suppliers and further scale our networks. On June 29, we hosted our first Xometry summit with the theme of powering tomorrow supply chain. With Xometry's unique ability to match buyers and suppliers in real-time and through our expanding supplier networks in the United States and internationally, Xometry is helping buyers and suppliers come together and create locally resilient supply chains.\n\nAt the event, we announced the launch of the industrial buying engine on thomasnet.com. The industrial buying engine helps enterprise customers source and purchase from a large network of suppliers, all within the thomasnet.com ecosystem. The industrial buying engine provides buyer choice, including Xometry's instant quoting engine for those customers who want to buy it now. It also digitizes the cumbersome and time-consuming request for quote process, taking what was once done off-platform and integrating it into the heart of thomasnet.com.\n\nThe buyer gets to work with trusted high-value suppliers and benefits from the convenience of the secured checkout, payment options and customer support. Suppliers benefit from additional exposure to high-quality buyers and can take advantage of convenient payment options. With the industrial buying engine, we're creating an incremental and scalable revenue stream on thomasnet.com. We are pleased with the early activity in the industrial buying engine and are seeing healthy buyer demand at the top of the funnel as the number of projects initiated is beginning to scale at a good pace, and we're seeing increased engagement on the platform from suppliers.\n\nAs we review the data and receive feedback from buyers and suppliers in the IDE, we are regularly making changes to user experience to optimize transaction flows. Also at the summit, we introduced our new cloud-based software, Workcenter, to help suppliers digitize all aspects of their operations. Workcenter is a fully featured all-in-one manufacturing execution system that gives suppliers a one-stop view into all of their orders. The freemium version of the software was developed with the acquisition of FactoryFour in Q4 of 2021.\n\nXometry Workcenter brings everything our suppliers love about Xometry, like our popular job board and our financial services and everything they love about Thomasnet all into one easy-to-use system. By digitizing all aspects of their operations, it lets manufacturers focus on what they need to do to grow their business and to attract new buyers. One of the best features of Workcenter is that our suppliers can use it to manage all of their work, including work from their non-Xometry customers. All the cash flow benefits suppliers know and love are integrated seamlessly in the Xometry Workcenter.\n\nThrough the shop finances dashboard, suppliers can track payouts, take advantage of our InstantPay, FastPay, and Advance card financial products. We are pleased with the adoption of active suppliers in Workcenter since the launch. Additionally, we're opening up the API-enabled Workcenter to third-party developers. By expanding the ecosystem, we can provide our rapidly expanding supplier base with even more innovative products and services.\n\nAdditionally, late in Q2, we expanded the menu on our marketplace, extending our quoting capabilities into new categories based on the data and suppliers from the Thomas network. Buyers can choose from expanded categories and processes. The new processes include laser tube cutting and tube bending. These processes improve the marketplace ability to offer production orders and increasingly become a one-stop shop for our buyers.\n\nWe have limitless opportunities to fuel our growth. This year, we'll see us expand our marketplaces domestically and abroad and deliver additional services to buyers and suppliers. Our TAM is over $2 trillion in the massive $35 trillion global manufacturing industry. We will continue to invest to further capitalize on our position as the leading two-sided marketplace.\n\nIn 2020, our revenue was $141 million. In 2022, we expect that to nearly triple to $400 million. At the same time, we expect gross profit dollars to grow over fourfold with significant gross margin expansion. We are well on our path to adjusted EBITDA profitability.\n\nWith that, I will turn the call over to our CFO, Jim Rallo, for a closer look at second quarter financial results and the business outlook.\n\nJim Rallo -- Chief Financial Officer\n\nThanks, Randy, and good morning, everyone. As Randy mentioned, we had a strong second quarter, and we are expecting continued significant revenue and gross profit growth for the balance of 2022. We generated Q2 revenue of $95.6 million, up 89% year-over-year, driven by strong marketplace growth and the addition of Thomas in supplier services. Starting with Q1 2022 financial results, we provided an additional disclosure for marketplace and supplier services, including revenue and cost of goods sold for each.\n\nQ2 marketplace revenue was $75.6 million and supplier service revenue was $20 million. Marketplace growth was driven by a strong increase in the number of active buyers as well as existing buyers increasing their spend on the platform. Q2 active buyers increased 40% year-over-year to 33,491. In Q2, the percentage of revenue from existing accounts was 95% underscoring the efficiency and transparency of our business model, that lead to increasing account stickiness and spend over time.\n\nWe believe the repeat purchase activity from existing accounts reflects the underlying strength of our business and provides us with substantial revenue visibility and predictability. Once an account joins our platform, we aim to expand the relationship and increase engagement and spending activities from that account over time. The number of accounts with the last 12-month spend of at least $50,000 on our platform reached 894 at the end of Q2, up 76% year-over-year. Q2 gross profit was $37.7 million, an increase of 217% year-over-year.\n\nGross profit margin was 39.4%. Q2 gross margin for Marketplace was 29.2%, up 180 basis points quarter-over-quarter. As our marketplace continues to scale and as the number of transactions grow and as we expand our network of suppliers, our machine learning becomes smarter, driving better matches, increasing our gross margin over time. Q2 gross margin for supplier services was 77.9%, driven by the high gross margin of Thomas marketing and advertising services and growing financial services.\n\nMoving on to Q2 operating costs. Q2 total non-GAAP operating expenses increased 120% year-over-year to $46 million, driven by the addition of Thomas, continued investments in the business and incremental public company costs. Within our operating expenses, sales, and marketing is our largest variable component. Q2 GAAP sales and marketing expenses were $18.1 million, including a $1.9 million onetime noncash measurement benefit related to purchase accounting for the Thomas acquisition.\n\nIn Q2, non-GAAP sales and marketing expenses were $18 million, excluding the onetime benefit, stock-based compensation and amortization as compared to $8.5 million in Q2 2021. The increase in non-GAAP sales and marketing expenses on a year-over-year basis was driven by the addition of Thomas sales and marketing costs, continued investment to expand our network of buyers and sellers and hiring of additional salespeople to support strong growth in our land and expand strategy. Our adjusted EBITDA loss for Q2 was $8.3 million or 8.7% of revenue compared with 17.9% of revenue in Q2 2021. Our Q2 adjusted EBITDA does not include the $1.9 million onetime noncash accounting benefit.\n\nOne quick note on GAAP EPS in Q2, as part of the IPO, we pledged 1% of the company's capitalization or approximately 403,000 shares to xometry.org for charitable contributions to nonprofit organizations. As a result, we recorded a nonoperating charge in general and administrative expenses, which is excluded from adjusted EBITDA. In Q2, we recorded a six-month charge of $1.3 million as we did not record a charge in Q1 due to restrictions on trading windows. Turning to segment reporting.\n\nIn Q2, revenue from our U.S. and international operating segments was $87.7 million and $7.9 million, respectively. Segment loss from our U.S. and international operating segments for Q2 was $11.2 million and $5.3 million, respectively.\n\nWe continue to invest in our international business, which grew 136% year-over-year in Q2 with improving gross margins. At the end of the second quarter, cash and cash equivalents and marketable securities were $356.7 million. Now moving on to guidance. We expect Q3 2022 revenue in the range of $102 million to $104 million, representing year-over-year growth of 80% to 83%.\n\nIn Q3, we expect adjusted EBITDA loss to be in the range of $6 million to $7 million or 6% to 7% of revenue compared to a loss of $10 million or 17.7% in Q3 2021. As a reminder, as Marketplace revenue grows at a faster rate than supplier services, we would expect total gross margin to be slightly lower in Q3 than Q2. In Q3, we expect stock-based compensation expense to be approximately $5 million to $6 million, which we will exclude from adjusted EBITDA. For fiscal year '22, we are raising the bottom end of our revenue guidance and now expect revenue in the range of $395 million to $400 million, representing year-over-year growth of 81% to 83% versus prior guidance of $392 million to $400 million.\n\nWe expect strong growth for Marketplace revenue in the 50% to 60% range year-over-year. We are raising our gross margin range for fiscal year '22 to 38.5% to 39% from 38% to 39%, based on better-than-expected trends from marketplace gross margin. We expect our adjusted EBITDA loss to be in the range of $31 million to $33 million for 2022 versus our prior guidance of a loss of $32 million to $36 million. We expect operating leverage to improve going forward, driven by strong revenue and gross profit growth and the anniversary of our public company costs from our June 2021 IPO.\n\nWe expect to be profitable on an adjusted EBITDA basis for 2023. With that, operator, can you please open up the call for questions.\n\nOperator\n\nThank you. [Operator instructions]. Our first question comes from the line of Brian Drab with William Blair. Your line is now open.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nHey, good morning. Congrats on the great quarter. I was wondering, can you just talk a little bit more about the reception and traction you're getting with the industrial buying engine? And then also the Workcenter adoption and how -- what the adoption rate has been or the momentum you have there? And how exactly does that work? How do you get someone to use Workcenter, the mechanics in that?\n\nRandy Altschuler -- Chief Executive Officer\n\nSure. So, Brian, let me -- this is Randy. So let me take the second question, second half it, and then I'll go back to the first one. So as you -- as we talked about, Brian, we're intending for Workcenter to be the single pane of glass that suppliers are working with Xometry and with Thomasnet.\n\nSo if they're getting orders or work from the Xometry network, you'll see that in Workcenter. And likewise, if they're getting jobs to the industrial buying engine on Thomasnet, they'll also see it there as well. And equally important, they're going to be able to manage their own work using Workcenter. So we're giving -- we've got hundreds thousands of manufacturers in Thomasnet.\n\nMany of them have no manufacturing execution system at all, and we're offering them a free version of that. So we've been transitioning people away from to Xometry, our old system that we had managing our suppliers, and we've also been moving things on the Thomasnet as well. And we've gotten a great reception so far. We'll continue to develop it, but we're very encouraged by what we've been seeing, and we'll continue to move more and more suppliers there and expect to have strong adoption.\n\nIn terms of the IBE. As I mentioned in my -- and that's the IBE, the Industrial Buying Engine, which we've now got on Thomasnet. As I mentioned in my prepared remarks, we're seeing a good pace of buyer activity at the top of the funnel from the launch in early July, we rolled it out just at the end of June. And we expect that the number of new active buyers in Q3 will be very strong in part reflecting our recent product launches, including IBE.\n\nSo again, when you see the active buyer number that we'll be showing in Q3, that should be reflecting the progress we're making there. And then likewise, at the end of this year, we will evaluate and provide a set of supplier metrics for 2023. So we'll then come out in 2023 and start giving metrics to measure the success of our various supplier services, including IBE and Workcenter.\n\nBrian Drab -- William Blair and Company -- Analyst\n\nOK. I'll pass it on. Obviously, it's very impressive that you're in the marketplace gross margin to continue to climb. There are a lot of people that weren't sure you're going to be able to do that.\n\nSo congrats.\n\nRandy Altschuler -- Chief Executive Officer\n\nThanks so much, Brian.\n\nOperator\n\nThank you. One moment for our next question. And our next question comes from the line of Matthew Hedberg with RBC Capital Markets. Your line is open.\n\nMatthew Hedberg -- RBC Capital Markets -- Analyst\n\nHey, great. Thanks, guys, for taking my questions. Randy, maybe just dovetailing on the last question. I think we all look at the Thomas cross-sell opportunity as significant.\n\nCan you -- and obviously, Workcenter feels like it's sort of the next evolution of that ability to cross-sell. Can you maybe sort of like contextualize sort of some of the milestones you're looking at for bringing over buyers and sellers from Thomas and perhaps what sort of a time horizon? Because it feels like even if you just bring over, I don't know, 10%, it could be beneficial. But maybe just a little bit more sort of like philosophically how you're thinking about cross-selling Thomas?\n\nRandy Altschuler -- Chief Executive Officer\n\nYes. So look, I think as I sort of just go back to what I was saying to Brian before, I think you're going to be seeing a strong increase in the number of new active buyers in Q3. And I think that will be an increase that is stronger than what we've had historically. And that's a good indication that buyers are, particularly from Thomas, historical buyers are adopting our products and are -- we're benefiting -- we're finding those revenue synergies.\n\nAnd I think just overall, when we -- at the time of the acquisition, we had several goals in terms of product development and reaching revenue up to $400 million in 2022. And the good news is, particularly from a product perspective and also financially, we've delivered on our targets to date, and we feel really good where we are in the second half of this year. And just in 2021, we grew revenue about 52% organically. As we're sort of guiding to this year, we expect marketplace growth to be from 50% to 60%.\n\nAnd that, in part, reflects the synergies we're getting from that Thomas buyer base that you talked about. So I think we're feeling good about it. And as we get to the end of this year, as I mentioned, we'll have some more specific metrics to report out next year on supplier services overall.\n\nMatthew Hedberg -- RBC Capital Markets -- Analyst\n\nGot it. OK. And then maybe one for Jim. Strong results and sort of raised full year guidance a little bit on both revenue and adjusted EBITDA.\n\nThere was really no mention of macros or anything like that on the call. I'm curious, maybe just a little bit of comment on sort of macro. I mean was there anything supply chain related or anything else that you sort of saw or think about as we think about the second half of the year?\n\nJim Rallo -- Chief Financial Officer\n\nYes. No, we have not seen anything from a macro standpoint that's slowing us down. So I think, again, when you look at the size of our market, right, the TAM that we have and the opportunity, we're just -- we're still really small. So we've got a lot of room to grow, as we continue to roll out our products, we're getting a lot more traction.\n\nIf you look at the number of buyers that we added this quarter, unbelievable growth there. If you look at revenue per buyer, that's up as well. So really right now firing on all cylinders.\n\nShawn Milne -- Vice President, Investor Relations\n\nMatt, it's Shawn Milne. The only thing just to keep in mind in your model is we're basically soaking up $2 million in FX headwind in the second half of the year, and so we still raised the bottom end of the range.\n\nMatthew Hedberg -- RBC Capital Markets -- Analyst\n\nSuper helpful. Thanks. Thanks for that. I'll pass it on.\n\nThanks.\n\nOperator\n\nThank you. One moment for our next question. And our next question comes from the line of Eric Sheridan with Goldman Sachs. Your line is now open.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the questions, and thanks for all the details. Maybe two following up on the path to adjusted EBITDA profitable, can you just refresh a little bit so investors understand some of the building blocks we should be watching for in terms of elements of dollar growth and leverage in the business against that broader goal for fiscal '23? And then maybe a sort of more micro question is you called out the AI and machine learning ramp and how that will improve supply and matching and possibly be a tailwind for gross margin. Could you go a little bit deeper there in terms of how we should think about that as a gross margin amplifier within the broader bridge on adjusted EBITDA? Thanks so much.\n\nJim Rallo -- Chief Financial Officer\n\nYes. No, I appreciate the question. Look, I think that the last quarter obviously was really a forward-looking for what is going to continue to happen over the next several quarters, right? We've told people that we would be fully profitable on an adjusted EBITDA basis by the end of next year for the full year. We are making good progress toward that.\n\nIt's being driven by phenomenal revenue growth and continued increase in gross profit margin on the Marketplace side of the business. So we believe we're going to continue to do that. And so when you look at the top line revenue, the increased gross profit margin, and we're getting efficiencies in our operating lines. So we've got good efficiencies in our sales and marketing this quarter.\n\nWe expect to get good synergies or what I would say is good leverage in the rest of our operating lines. We're annualizing now our public company costs. We went public last year this quarter. So we'll get some leverage there as well.\n\nSo I think, again, you'll see a continued step function as we move through this year. And as we move through next year, we'd expect to have a small adjusted EBITDA loss probably in Q1 and Q2 next year and then be profitable for the last two quarters.\n\nRandy Altschuler -- Chief Executive Officer\n\nAnd then let me just -- Eric, just jump on. The second half of that question, this is Randy now, about gross profit. an again, just to provide some context. If you look at Xometry's overall gross margin in Q2 of last year, we were at 23.5%.\n\nAnd then if you look at the gross margin for marketplace, which is all the historical Xometry business, excluding supplies and our financial products, we're at 39.4%. So -- and that was driven by we've got more data and we've got more active buyers, and it's a huge uptick. And that's also up. Just to be clear, the growth in our gross margin for marketplace was up over 180 basis points from Q1 of this year.\n\nSo really strong growth in that number. And I'm sorry, I just misspoke I'm sorry, we were 29.2% for marketplace versus the 23.5% that we had last year. So a big jump in that. And machine learning, as we get more and more data and as we get more and more active suppliers that helps us make sure that the algorithms are doing the right matching and it helps us grow those gross margins.\n\nAnd we're continuing to enhance those algorithms, and we'll expect to continue to see the growth in that gross margin, which will provide some of that leverage as we talk about getting to profitability next year, that's an important component to that and getting to our long-term goals of 40% to 45% gross margins.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Karl Keirstead with UBS. Your line is now open.\n\nKarl Keirstead -- UBS -- Analyst\n\nGreat. Thanks. Randy, as you mentioned in your remarks, last quarter, you called out an anticipated mix shift to what you called larger production orders and that might create a little bit of lumpiness. I'm wondering if you can give an update on that phenomenon? Did you, in fact, secure a number of those in 2Q or is that a little bit more of a second half phenomenon? Thank you.\n\nRandy Altschuler -- Chief Executive Officer\n\nYes. I think a good metric, Karl, and thanks for that question, is when you look at customers who have more than $50,000 of LTM spend and that number grew in Q2 year-over-year 76%, and we added a record net add of 104. So going back to that question, we're continuing to see a really nice trend here. And we're increasing -- we're seeing increased activity in production orders in areas such as injection molding, dye casting, sheet metal stampings and these are continuing to be huge opportunities for growth for that.\n\nSo I think that growth in large customers more $50,000 spend is a good sense of where we are.\n\nKarl Keirstead -- UBS -- Analyst\n\nGot it. OK. And then for Jim, you obviously raised the full year guidance for marketplace gross margins from 75 to 80 to 80 to 85, fairly material bump. If you could put your finger on one thing that's driving your confidence in the durability of those marketplace gross margins into the second half that motivated you to make that guidance change, what would it be?\n\nJim Rallo -- Chief Financial Officer\n\nYes, so when you look at it, really, it's just about the more transactions we get, right, the more data we have and the better the matches are for our suppliers. In addition, we continue to grow the supplier base. So again, I think firing on all cylinders with the artificial intelligence right now, and we see continued opportunity there.\n\nKarl Keirstead -- UBS -- Analyst\n\nOK. Terrific. Thank you both.\n\nOperator\n\nThank you. [Operator instructions]. One moment for our next question. Next question comes from David Silver with C.L.\n\nKing. Your line is now open.\n\nDavid Silver -- C.L. King and Associates -- Analyst\n\nYes. Hi. Good morning. I had a couple of, I guess, more targeted questions, but I'm thinking about your strategies for buyers to adopt your platform and your services.\n\nBut just a couple of things, I think, that you've launched very recently, the instant quote function on the Thomas platform, for example and you've discussed the Workcenter product. Just curious, but can you tell, let's say, the adoption rate? In other words, can you figure out how many people are using the instant quote function or how many people are taking the Workcenter software and actually plugging it into their to their workplace, I don't know, resource planning system or computer operations?\n\nRandy Altschuler -- Chief Executive Officer\n\nYes. We do have access to those metrics. We're carefully tracking them. And so just as we sort of talked about, by the end of this year, we'll take a look at what we think are some good metrics to report starting reporting out in 2023 that give people some good visibility on the progress that we're making and the adoption of these products.\n\nSo absolutely, we're all over it. We're tracking them, and we'll be reporting some out next year so people have greater visibility.\n\nJim Rallo -- Chief Financial Officer\n\nYes, so David, when you look at the instant quoting, right, that's really being measured by our active biometric. So active buyers are up 40% year-over-year, they're up 9.2% quarter-over-quarter and revenue per buyer is up as well, we're over $2,800 per buyer right now.\n\nDavid Silver -- C.L. King and Associates -- Analyst\n\nOK. And shifting just to the seller side, but -- for a moment, but how would you characterize, I guess, the activity of sellers, let's say, shifting from that advertising-based Thomas platform over to the Xometry marketplace? I mean [Technical Difficulty] be eager to adopt that. But most of your comments have been on the buyer side here. So I'm just wondering about seller adoption of the marketplace product.\n\nRandy Altschuler -- Chief Executive Officer\n\nI think both options kind of like buyers like different ways to purchase, suppliers like different ways to operate their business as well. So some like the idea of getting work via Xometry, some like getting work via Thomasnet. So I think the idea that we're offering both opportunities and we're using Workcenter as a single painting glass and then both is attractive to folks. So we're encouraged by what we're seeing.\n\nJim Rallo -- Chief Financial Officer\n\nAnd, David, I'd point to, again, the seller adoption rate is increasing, when you look at, again, the gross profit margin in marketplace. So the more sellers we get involved the better gross profit margin we can drive throughout the marketplace.\n\nDavid Silver -- C.L. King and Associates -- Analyst\n\nAbsolutely, it has to be a balance there, I guess. And then just maybe a more philosophical question. But in recent comments, Randy, I mean, I definitely have noticed your focus on supplier or supply chain resilience as a driver for demand. And when I think about all the big macro pushes and pulls over the last year or so, I'm just wondering, is that an especially pulling in or useful element, let's say, for your overseas business? In other words, where maybe there's not just -- fundamentally just not going to be the same amount of options in a particular local region? And is that kind of a driver for penetration in new geographies, in particular? Or is there another area where you think that less secure supply chain is really driving people to your platform?\n\nRandy Altschuler -- Chief Executive Officer\n\nYes. Look, I think Xometry has experienced durable growth during all sorts of environments. And obviously, when we started the company in 2013, we opened our doors for business in 2014. We weren't facing issues today, and Xometry grew very rapidly.\n\nWe grew rapidly during the shutdowns with COVID and then now we've been growing rapidly during this. So I think we've built a very durable model, and we're really taking advantage of the secular shift to the digital, and we are the leading two-sided marketplace, and this has been done successfully in so many other industries. We're the leader here and now in the switch for manufacturing to do the same. So I think irrespective of the macro environment, Xometry will continue to have robust growth.\n\nI think one thing that we're seeing is that customers want options. So one option is a local supply chain and then sometimes they want option to have an international as well, and that's what we're endeavoring to do. We're endeavoring to build these locally resilient supply chains, whether it's in North America, whether it's in Europe, and now we've opened up in China for China. And then we also can give customers options if they want to avail themselves of international.\n\nSo I think giving customers options enables them to build their supply chain in the way that suits them the best. And with our marketplace model, we have the technology and extensible platform to do just that.\n\nDavid Silver -- C.L. King and Associates -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nShawn Milne -- Vice President, Investor Relations\n\nRandy Altschuler -- Chief Executive Officer\n\nJim Rallo -- Chief Financial Officer\n\nBrian Drab -- William Blair and Company -- Analyst\n\nMatthew Hedberg -- RBC Capital Markets -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nKarl Keirstead -- UBS -- Analyst\n\nDavid Silver -- C.L. King and Associates -- Analyst\n\nMore XMTR analysis\n\nAll earnings call transcripts"
}