{
  "companyName": "United Natural Foods",
  "companyTicker": "UNFI",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/27/united-natural-foods-unfi-q4-2022-earnings-call-tr/",
  "content": "United Natural Foods (UNFI -1.25%)\nQ4 2022 Earnings Call\nSep 27, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Rob, and I will be your conference operator today. At this time, I would like to welcome everyone to the UNFI fiscal 2022 fourth-quarter conference call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers.' Remarks, there will be a question-and-answer session. [Operator instructions] Thank you. Steve Bloomquist, vice president, investor relations, you may begin your conference.\n\nSteve Bloomquist -- Vice President, Investor Relations\n\nGood morning, everyone. Thank you for joining us on UNFI's fourth quarter fiscal 2022 earnings conference call. By now, you should have received a copy of the earnings release issued this morning. The press release and earnings presentation, which management will speak to, are available under the Investors section of the company's website at unfi.com on the Events tab.\n\nWe've also included a supplemental disclosure file in Microsoft Excel with key financial information. Joining me for today's call are Sandy Douglas, our chief executive officer; John Howard, our chief financial officer; Chris Testa, president of UNFI; Eric Dorne, our chief operating officer; and Kristyn Farahmand, SVP of investor relations and transformation finance. Sandy and John will provide a strategy and business update, after which we'll take your questions. Before we begin, I'd like to remind everyone that comments made by management during today's call may contain forward-looking statements.\n\nThese forward-looking statements include plans, expectations, estimates, and projections that might involve significant risks and uncertainties. These risks are discussed in the company's earnings release and SEC filings. Actual results may differ materially from the results discussed in these forward-looking statements. And lastly, I'd like to point out that during today's call, management will refer to certain non-GAAP financial measures.\n\nDefinitions and reconciliations to the most comparable GAAP financial measures are included in our press release and the end of our earnings presentation. I'd ask you to turn to Slide 6 of our presentation as I turn the call over to Sandy.\n\nSandy Douglas -- Chief Executive Officer\n\nThank you, Steve, and good morning, everyone. We appreciate you joining us for today's year-end call. Let me start by saying I'm proud of our team's work as we capped a year of improving operational performance, driving share gains and strong financial results. We broadly exceeded our prior outlook expectations, with adjusted EBITDA and adjusted EPS surpassing their respective midpoints of our outlook.\n\nNet leverage also fell slightly more than expected to under 2.6 times, and we ended the year with approximately $1.7 billion of liquidity. We achieved these results despite a challenging industry backdrop. Food and home inflation remains in the double digits, driving consumers to buy fewer items, fuel rates continue to be pressured and labor market tightness persists. Delivering these results in the face of such a complex environment is a testament to the agility of our team and the strategic value of our business.\n\nAs we enter the second year of our Fuel the Future strategy, we remain focused on driving operational improvement to optimize the value of our scaled and diversified platform across the $140 billion addressable market that we're pursuing in our core business. Notably, this market also continues to grow. According to McKinsey, U.S. grocery sales are expected to grow at an average annual rate of 4% from 2021 through 2026, with independent grocers expected to grow in line with the expectation for the overall market.\n\nOur Fuel the Future strategy is designed to drive above-market growth over a long-run basis, and continuous improvement by harnessing our competitive advantages to create value for all stakeholders. For our customers and suppliers, we are creating a one-stop shop for procurement, distribution, and services. This, in turn, will help us expand the opportunities we can offer to our associates as our business grows and evolves, while also enabling us to better support our communities and plan it through our ambitious ESG agenda. Importantly, we believe our focus in these four areas will enable us to create enduring value for our shareholders.\n\nOur scale remains a significant competitive advantage. As the largest grocery wholesaler in North America, distributing approximately 260,000 unique SKUs from around 12,000 suppliers to over 30,000 customer locations, we can procure product and administer promotions in a highly efficient manner, which makes UNFI a valuable partner for both suppliers and customers. This scale is complemented by our unmatched distribution network composed of 56 strategically located distribution centers across the United States and Canada. Our network has the capability to support our growth and enhances our adaptability as market shifts occur.\n\nWe also see meaningful opportunity to benefit from increased efficiency and growth enablement across this portfolio by strengthening best practices, employing technology, and investing in automation. This is a significant focus of our 2023 investment program and a driver of the agreement that we just announced with Symbotic. As an automation technology leader, we look forward to working with the company to help streamline and improve operations across strategic assets within our distribution network. We believe this will help us better serve our customers and enhance our long-term profitability.\n\nOur deep scale and geographic footprint across North America also enabled us to amass a vast amount of product and channel data. We're working to harness this data to help our customers and suppliers better understand their served markets and develop relevant and targeted strategies to grow their businesses. By becoming a stronger partner to our customers and suppliers, the value of working with UNFI increases. We believe diversification is one of our strengths as well.\n\nOur broad array of suppliers and products, including UNFI's owned brands, ensures we have the right items and solutions to meet the needs of each of our customers and their unique go-to-market strategies. This is especially important as the macroeconomic backdrop and consumer preferences continue to evolve. Our broad customer base also allows us to meet consumers where they prefer to shop. As we've seen over the past few years, these preferences can quickly evolve, and our diversified customer base enables greater stability and resiliency for our business.\n\nAnd finally, I believe a key differentiator is the talent that UNFI has at all levels of the organization. Our industry leadership position enables us to attract and retain key talent even in this challenging operating environment, such as the one we experienced in fiscal 2022. Over this past year, we've recruited senior leaders in areas where we see the great opportunity to drive value, and we have a great mix of experienced food industry veterans combined with strong functional leaders to drive the next chapter of UNFI's growth. And as we detailed last year as part of our Fuel the Future strategy, we're extremely focused on enhancing engagement with our associates across the company.\n\nWe achieved progress on this front in fiscal 2022 as our engagement scores improved during the year. Turning to Slide 7. The progress we're making under our Fuel the Future strategy is evident in our fiscal 2022 results and our expectations for fiscal 2023. A key goal of this strategy is to bring ever greater value to our customers and suppliers, which we expect will drive new customer wins and increased sales across our existing customer base.\n\nAs we've highlighted previously, our cross-selling capabilities are critical to our ability to deliver on this goal. Cross-selling has more than doubled since 2020 and contributed over $1 billion of sales in fiscal 2022. Our plans for fiscal 2023 also include investments in training necessary to develop a world-class sales force, with a goal of empowering our people to offer the highest levels of expertise and service that makes partnering with UNFI a simple and highly value-additive decision. Importantly, as we make these investments, we're remaining highly disciplined in managing our expenses.\n\nWe plan to fund these investments primarily by streamlining and redeploying funds from lower return uses within our existing expense base. This will enable us to preserve and expand our margins even as we make these elevated investments. We began this process in 2022 and have accelerated it within our fiscal 2023 plan. In conjunction with these investments, we're also prioritizing focus on our services platform, which encompasses professional services, our own brands, and innovation.\n\nAs we announced in July, we've established a new internal organization that is now solely focused on growing this platform. This integral component of our strategy will enable us to deliver insights and solutions to our customers and suppliers that will help them maximize the value of their own businesses while also offering significant margin accretion potential to our business. Today, this platform contributes over 22% of our adjusted EBITDA before corporate allocations, and we expect this number will continue to grow. Flipping to Slide 8.\n\nAnother important aspect of our growth strategy is our focus on enhancing efficiency and responsiveness, which is key to improving our business relationship with our customers and suppliers and helps us to optimize our margins. During fiscal 2023, we expect a significant portion of our planned capital expenditures to be focused on initiatives to increase efficiency. Our plan includes investments to drive distribution center automation, as well as to modernize and unify our enterprise resource planning and financial systems. Importantly, all approved projects have attractive projected returns above our cost of capital and are expected to enhance our long-term margin profile.\n\nThe steps we're taking in 2023 build on our fiscal 2022 achievements and will serve as the launch pad for our reinvigorated investment strategy and elevated long-term growth trajectory. In closing, let me reiterate how pleased and proud I am of how we finished fiscal 2022. We've demonstrated our ability to take share in a $140 billion addressable market with upside from our services platform, and plan to grow share within this market by continually looking for better ways to meet the needs of our many constituents. Our management team is highly focused on getting better across every operational dimension.\n\nOur customers, suppliers, and associates all benefit when we grow and improve. And as we improve, we expect this to create the flywheel effect I described last quarter, in which the business will expand and gain market share, which will further enhance our competitive advantages while improving our free cash flow generation and investment capabilities, and in turn, create incremental shareholder value. I look forward to reporting on our progress as 2023 unfolds. With that, I'll turn the call over to John for detail on our financial results, capital allocation strategy, and outlook.\n\nJohn Howard -- Chief Financial Officer\n\nThank you, Sandy, and good morning, everyone. As Sandy just highlighted, we're pleased with the finish we delivered to fiscal 2022. We ended the year with an improved balance sheet and ample liquidity to fund our growth initiatives and strategic capital allocation. We're also highly focused on enhancing our transparency and investor disclosures, and as Steve noted, we've posted an Excel supplemental with our key financial information on a historical basis alongside the rest of our earnings materials.\n\nThis will be a regular part of our quarterly reporting deliverables. With that, let's dive into our financial results, capital allocation strategy, and our fiscal 2023 outlook. Turning to Slide 10, sales for the fourth quarter grew 8% and totaled $7.3 billion, setting a new fourth quarter record. This increase was composed of inflation, net of elasticity of about 8.8%, and a volume decline of less than 1%.\n\nOur modest volume loss was significantly better than that of the broader industry, for which Nielsen reported units declined by close to 3% for the same period. This is an encouraging indicator of share gain. We again saw widespread growth across the business, with wholesale sales from our three primary channels increasing by 8.2% on a combined basis. This includes volume with new customers added earlier in the year, added categories and new store openings, and supernatural and incremental cross-selling made possible, as Sandy stated, by the SUPERVALU acquisition.\n\nOur wholesale new business pipeline also remains strong, with diversification across regions, as well as a solid representation from both new and existing customers. Additionally, a significant portion of our largest pipeline opportunities include both natural and conventional, which indicates continued opportunity to drive cross-selling expansion from the over $1 billion in cross-selling sales that benefited our 2022 results. Our wholesale growth was complemented by retail sales growth of over 1%. This primarily reflected strong growth in average unit retail, which was partially offset by a reduction in basket size.\n\nFlipping to Slide 11. Adjusted EBITDA grew 3.4% compared to the prior-year quarter to $213 million, while as expected, our adjusted EBITDA margin fell slightly. Our reported gross margin rate fell about 40 basis points to 14.5% as a result of a higher LIFO impact. A higher gross margin rate before LIFO impact was more than offset by a higher operating expense burden.\n\nOur fourth quarter gross margin rate, excluding the LIFO charge from both years, increased by around 20 basis points compared to last year's fourth quarter. Like last quarter, this growth, excluding LIFO, was driven by the continued impact from inflation and the benefits from our efficiency initiatives. Our operating expense rate before the impact of pension withdrawal charges in the prior-year quarter increased by about 30 basis points compared to last year. This was primarily driven by continued investments in distribution center and transportation labor to ensure the best service level attainable for our customers, as well as higher energy prices.\n\nThese were partially offset by some leveraging on our fixed costs. We're pleased that our distribution center job vacancy rate improved again this quarter, moving from 7% at the end of Q3 to 4% at the end of the fiscal year. We also made some progress on the driver side. The vacancy rate declined from 9% at the end of Q3 to 8% at year-end.\n\nWe view these improvements as a signal that the associate-friendly programs we've instituted are having a positive impact, and we expect these vacancy reductions will lead to improvement in our operating expense trends over the next few quarters as new associates get up to speed. This should drive efficiency gains, gradually reduce the need for third-party labor and improve the customer experience. We're also pleased with the 30% adjusted EBITDA growth achieved in retail when compared to last year's fourth quarter, and with its substantial sequential growth from the third quarter. The team managed both gross margin and direct store labor in a highly disciplined manner.\n\nGAAP EPS fell about 9%, while adjusted EPS grew nearly 2% to $1.27. The GAAP EPS contraction was primarily driven by a higher LIFO charge and tax rate, partially offset by net pension and benefit charges incurred last year. Adjusted EPS growth primarily reflects higher adjusted EBITDA, which contributed about $0.08, a $0.07 benefit from lower net interest expense, and about $0.02 from lower expense from other items. These were partially offset by about $0.09 of lower noncash pension income, $0.05 from a higher tax rate, and less than $0.01 from a slightly higher share count.\n\nThe decrease in noncash pension income was that we experienced as a result of the progress we've made in derisking the balance sheet, which has proceeded at an accelerated pace relative to our prior planning assumptions. This includes a single-employer pension plan, which is more than fully funded on a balance sheet basis. As such, planned assets help in lower risk, lower return investments, aligning more closely with the duration of the pension liabilities, and the assumed lower return from this portfolio results in lower noncash income to UNFI. We expect to further derisk this plan and project pension income will continue to decline in fiscal 2023 and beyond as a result.\n\nNotably, this lower noncash income reduced our fourth quarter adjusted EPS growth by over 7%. As Slide 12 illustrates, UNFI continues to be a strong cash-generating company. Operating cash flow before changes in working capital has increased at a 16% average growth rate over the past two years to nearly $700 million in fiscal 2022. We've used that cash to reinvest in the business, pay down debt in a disciplined manner, and specifically, in fiscal 2022, invest in working capital to support a new distribution center and customer growth.\n\nWhile deploying this capital, we've also strengthened our balance sheet. Over the last two years, we've reduced net leverage over 1.2 turns and ended the year at under 2.6 times, which is just north of our current target leverage range of two to 2.5 times and the detail is part of our Fuel the Future strategy. We expect this number will continue to decline during fiscal 2023 and beyond, putting aside any investments not currently contemplated in our plan and typical seasonality. We anticipate ending this fiscal year around the midpoint of our current target range or below and expect to operate toward the mid- to low end of this range for the remainder of our Fuel the Future strategy.\n\nWe plan to revisit this target leverage range once we close out fiscal 2024 and finish the long-range financial plan disclosed as part of this strategy. It is likely we will have more than sufficient operating flexibility to strategically fund growth at lower levels of leverage due to the adjusted EBITDA and cash flow growth we expect to generate over this time. As a result of this deleveraging, our ample liquidity of approximately $1.7 billion, and the increased investment capacity this position provides us, we are highly focused on refining our long-term capital allocation strategy to support our growth initiatives, to continue to strengthen our balance sheet and to opportunistically pursue share repurchases. As part of our capital allocation strategy, we expect to prioritize internal investments that help accelerate our growth and efficiency.\n\nAs Sandy detailed, this is a critical component of our 2023 plan which includes approximately $350 million in capital expenditures. After funding internal investments, we plan to evaluate external investments, including potential smaller, strategic, accretive, tuck-in M&A opportunities. The transaction pipeline is active, and we are focused on investments that bring new capabilities, improve our geographic depth, and further enhance our growth trajectory and cash flow resiliency. After considering funding for these investments, we will prioritize further debt repayment and pursue selective shareholder returns.\n\nAs we noted today in our earnings release, our board has approved a new $200 million share repurchase authorization that we can utilize over the next four years. We are pleased to have this new capital allocation lever at our disposal as it will enable us to opportunistically repurchase shares as we embark on a reinvigorated growth strategy. Given the operational momentum and growth opportunities we see on the horizon, we firmly believe in our ability to create compelling shareholder value, and that this new lever will further enhance our capital allocation strategy. Turning to Slide 13.\n\nOur strong finish to 2022, operational momentum, investment initiatives, and improved balance sheet set us up well to deliver another year of growth across our key financial metrics despite the challenging operating environment that persists. We expect fiscal 2023's full-year net sales to grow around 4% or approximately $1.2 billion, at the midpoint of our outlook to around $30.1 billion. Some of the drivers of this growth include the addition of new business from customers added in fiscal 2022 we've yet to cycle, the continued growth of selling more products to existing customers, new customer wins, and strong growth within our services platform. Full-year inflation is anticipated to be in the low to mid-single digits, and we're again expecting modest contraction in overall industry volumes, which is related to changes in consumer behavior resulting from the broad-based challenges of elevated inflation.\n\nFull-year fiscal 2023 adjusted EBITDA is expected to rise over 4% at the midpoint to around $865 million. This growth reflects elevated SG&A investments that we believe will better position us for accelerated growth beyond fiscal 2023. We expect this growth in adjusted EBITDA will drive similar adjusted EPS growth, with the midpoint of fiscal 2023 range at $5 per share. As you can see on Slide 14, fiscal 2023 adjusted EPS is expected to benefit from about $0.44 from higher adjusted EBITDA, about $0.11 due to lower net interest expense, and by around $0.01 to a slightly lower expected tax rate.\n\nWe expect this to be partially offset by a negative noncash impact of around $0.20 resulting from lower pension income and higher investment-driven depreciation and amortization, while other items and share count are expected to weigh on adjusted EPS by around $0.20 on a combined basis. In total, we expect adjusted EPS growth of approximately 3.5% for the fiscal year. This includes an expected drag of around 4% from lower noncash pension income and higher depreciation and amortization associated with increased investments. And as noted previously, we're actively assessing opportunities to strategically accelerate capital allocation, which could drive upside to our outlook expectations.\n\nTurning to Slide 15. Our solid growth expectations and strategic balance sheet management are expected to provide a significant discretionary capacity during fiscal 2023. In total, we expect to have around $400 million to help fund additional investments, debt repayment, and opportunistic shareholder returns even after considering the elevated capital expenditures embedded in our outlook. We expect to monetize certain accounts receivable in the first quarter and approximately $240 million benefit from this, as reflected on the slide.\n\nSuccessfully establishing this program will allow us to fund our business at a lower cost with minimal operational change. It will also reduce our reported net leverage significantly while slightly reducing our funding costs and provide increased flexibility under our borrowing facilities but is not expected to impact our credit ratings. In summary, as outlined on Slide 16, we're pleased with our performance during the quarter and throughout fiscal 2022, especially given the challenging operating environment for us and our customers. Based on inbound interest from potential customers, we believe today's backdrop accentuates the benefits of working with an industry leader who has a customer-centric focus, ample scale, diverse capabilities, and strong momentum.\n\nOur capital allocation plans include significant investment in projects expected to deliver improved efficiency and strong returns balanced with further debt reduction and selective share repurchases that are expected to be incrementally accretive to earnings. It's an exciting time to be at UNFI. We remain confident in our growth strategy and creating shareholder value remains a top priority for us. We look forward to updating you on our progress in early December.\n\nOperator, please open the line for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Bill Kirk from MKM Partners. Your line is open.\n\nBill Kirk -- MKM Partners -- Analyst\n\nHey, good morning. Thank you for taking the question. So, I wanted to go on the buyback and some of the comments on potential M&A tuck-ins. In 2017, there was a buyback announced for $200 million.\n\nObviously, some M&A got in the way of it all being used. I guess when we're talking about small potential tuck-in deals, how does that impact or does it stop or slow the repurchase program?\n\nSandy Douglas -- Chief Executive Officer\n\nHi, Bill. It's Sandy. Let me just address the tuck-in M&A question. Generally, we feel that we have a strong and well-diversified business and that we're capable of building our offerings largely through internal investment.\n\nHowever, when there's an opportunity to add a capability or a geographic piece that through acquisition gives us a better return than building it ourselves, we'll look at that as a tuck-in. Generally, we plan to focus our investment, both internal and external, on areas that raise our growth profile, build capability, and are accretive to our margins. John, do you want to add a piece relative to the share buyback?\n\nJohn Howard -- Chief Financial Officer\n\nYeah. I think that's spot on. I think the -- from a buyback perspective, as we announced with the $200 million, we're excited about that. We're pleased that we've gotten our leverage to a position where we can execute on that.\n\nAnd then as Sandy suggested, we're focused on the growth opportunities first. We're going to look for those opportunities. We're going to look for where we can better service our customers, where we can invest in the growth of the business. And then we'll focus on the capital allocation between debt and return to shareholders.\n\nBill Kirk -- MKM Partners -- Analyst\n\nOK. Thank you. And a follow-up. On the quarter, how much of the year-over-year SG&A increase as a percentage of sales, how much of that is maybe the Key Food's DC just being underutilized, and then that becomes more efficient? Or how big of a headwind is that item on that line?\n\nJohn Howard -- Chief Financial Officer\n\nYeah. I'll start, and Sandy can chime in. I would say not dramatic from a headwind as it relates to what we were expecting. Certainly, the -- standing up the DC will add costs year over year.\n\nThe DC was not operational in Q4 of last year. But certainly, nothing unusual and not expected in our numbers.\n\nBill Kirk -- MKM Partners -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour next question comes from the line of John Heinbockel from Guggenheim. Your line is open.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nHey, guys. Can you talk to the cadence of the rollout of automation, right? I know you're going to do five DCs over four years. Kind of how that rolls out? Any challenges, right, with retrofitting a facility upfront, right, in terms of cost, right? Is that a drag before it becomes a benefit? And you just -- order of magnitude, right? You're going to try to raise pieces, right, per man hour. Any sense of how much that can go up through automation? Is it 25%, 50%, or more?\n\nSandy Douglas -- Chief Executive Officer\n\nYeah. John, this is Sandy. We're going to strategically deploy automation across our network based on the greatest opportunity to benefit customers and generate a return from the investment. As to the specifics of the program, I'll call on Eric.\n\nEric Dorne -- Chief Operating Officer\n\nYeah. John, so we've looked at the automation and our relationship with Symbotic as a strategic growth enabler for our business and leveraging the capacity in our existing network, given the density of the storage that the automation provides. We're looking at overall customer quality of orders and the improvement there on order accuracy and order quality going out to the buildings. As far as productivity goes, I prefer not to share direct numbers on that, but that is built into our business model that will really guide us through the network as we deploy this over the next five years.\n\nSandy Douglas -- Chief Executive Officer\n\nAnd I guess the only other thing I'd add is that we see it as a business development and growth enabler. So, as our network plan meets the demand from the market, we'll be using automation to help propel our growth going forward on a geographic basis.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nOK. And maybe as a follow-up, I don't think you changed the '24 outlook, right, for either top line or EBITDA, so that sort of implies a step-up -- a nice step up in the growth rate in '24 EBITDA growth. Is that a better macro or the investments start to roll off notably or something else?\n\nSandy Douglas -- Chief Executive Officer\n\nYeah, John. I think the way to think about our guidance for '23 is that there's a fair amount of market uncertainty out there, and the way we have developed our guidance is to be pragmatic and make sure that we have the flexibility during the year to provide good returns, and at the same time, be flexible enough to meet whatever needs our customers have. That was our strategy in '22, and it worked well for us, and we intend to repeat it in '23. As far as looking out over a multiyear period, it's a dynamic situation.\n\nWe remain committed to the growth rates that we talked about, and we'll evaluate '24 guidance when we get there. But right now, the way we've laid out our '23 guidance reflects what? We're confident we can deliver, and yet remain flexible to be able to meet the needs of our customers.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Mark Carden from UBS. Your line is open.\n\nMark Carden -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my questions. Maybe a follow-up on the last one first. So, you talked a bit about the recent reorg on the call, with one aspect that jumps out being the increased focus on value-added services.\n\nGiven timing, is it fair to assume that this could be a material contributor to your implied expectations for the EBITDA growth step up in fiscal '24 to fiscal '23?\n\nSandy Douglas -- Chief Executive Officer\n\nSure. I guess the way I'd come at that is that we view the services platform -- actually, let me step back. The core of our business is our wholesale offer, and we drive that to be incredibly efficient for our customers so they can be highly competitive. That scale is part of the proposition.\n\nAnd then from there, what our services platform does is it allows us to add value-added services that help them grow faster, become more efficient, and generally more competitive. They're higher-margin offers because they create more value, and they're selected, curated list of brands, products, and services that we believe ultimately offers us a significant differentiator and offers our customers ways to be more successful and more competitive in the market. So, it's a correct read-through to see that we got the gas pedal down on that business. We think we have an advantage.\n\nWe think there's a long road map for improvement there, and that's why we wanted everyone to understand that it's over 20% of our EBITDA, and it's growing at an accelerated rate, and we've aligned our talent to take advantage of that opportunity.\n\nMark Carden -- UBS -- Analyst\n\nOK, great. And then another question on automation. Is there any reason why you couldn't use it to sort of bulk of your packaged assortment over time? And then do you see any opportunity on the more perishable side, or is it just too tough to do today? Thanks.\n\nSandy Douglas -- Chief Executive Officer\n\nYeah., I think our perspective around -- think about it as three levels of practice improvement in our supply chain. One is kind of post-pandemic screwing down standard operating procedure and process discipline, then using technology to improve accuracy, efficiency, quality, and support for our customers, and then automation. And we believe that that combination of three levers is a significant opportunity for us going forward. We wouldn't disclose ahead of time how we plan to deploy that.\n\nBut rest assured that that's -- those three tools are part of a long-range strategy to continue to make our supply chain more effective, more efficient, higher quality, and the best in the business for supporting independent customers.\n\nMark Carden -- UBS -- Analyst\n\nThanks so much and good luck.\n\nSandy Douglas -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Eric Larson from Seaport Research Partners. Your line is open.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nYeah. Thanks, guys. Appreciate the question. So, just -- I can't remember which slide it was, John, maybe this is for you.\n\nBut obviously, you're going to be growing your margins a bit this year, and it mostly just offsets some kind of below-the-line items. Obviously, more pension income and some share increases, etc., which are mostly cash -- noncash items anyway. But would you expect that trend to continue for a while, or you need to actually, on a reported and adjusted EPS basis, have to increase your margins to offset kind of the -- maybe a bit of a headwind from the kind of the nonoperating items?\n\nJohn Howard -- Chief Financial Officer\n\nYeah. So, I'll start on that, Eric. Good to hear from you. The way I think about that is these are largely noncash, particularly the pension, noncash items, and we're proactively managing those to derisk because we believe that's in the best interest for the company and the shareholders.\n\nI don't know if we would necessarily look to a noncash item such as a pension income as something that we would use to drive margin expansion one way or the other. We certainly wouldn't want to put that on the backs of our customers, but we do look for opportunities within our margin and our opex to drive that productivity so we can better share those results with our customers and make them competitive.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nOK. Thank you. And just another quick follow-up. It's on your guidance, and I think, Sandy, you addressed a little bit of it.\n\nSo, you're looking for roughly 4% revenue growth this year. But in the near term, like first half, or do you still doing a high degree of inflation -- it seems that your revenue growth rates in the first half will be fairly robust from an inflationary point of view, but it also is going to be a meaningful slowdown in how you're guiding for your second half. Is that just a conservative way to look at it? I mean, I know there's a lot of moving parts in this environment, but it just seems like your second half would have to be pretty slow relative to the first half to kind of get to your average guidance for the year.\n\nSandy Douglas -- Chief Executive Officer\n\nYeah. I think the way you're interpreting it is how you're deploying the set of -- the correct set of variables. There is inflation, there is unit growth and elasticity from inflation. There's new business that we might get with a new customer and expanded category, and our guidance reflects our expectations for that throughout the -- for the full year.\n\nWe don't do quarterly guidance. But you've got the pieces, and ultimately, we think the number that we've provided is the right one given the outlook.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nAll right. Thanks, John. I'll follow up with you later. Thanks.\n\nOperator\n\nYour next question comes from the line of Andrew Wolf from C.L. King. Your line is open.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nHi. Thank you. Good morning. I'd like to ask you a little about labor costs and wage rates in the quarter and what the outlook is.\n\nIt's baked into the guidance. Clearly, the industry been dealing with a lot of wage inflation and productivity issues, hiring new workers. Just -- could you give us a sense -- it looked like it might have incrementally improved, just looking at your operating expense ratio ever so much. But just a sense of how you guys are viewing that part of the business with respect to guidance, in particular?\n\nSandy Douglas -- Chief Executive Officer\n\nSure. This is Sandy. I'll give you a general answer, and then I'll call on Eric to drill in a little bit. I think the variables that affect our opex outlook start with vacancy rates.\n\nAnd as you followed last year, the vacancy rates were volatile last year. I mean, we started the year in the mid-teens. We narrowed it down to the low teens. Omicron's ended up over 20%, and then steadily have been improving our vacancy rates through Q3.\n\nIn our DCs, at the end of Q4, were down 4% and our driver vacancy rate had improved from 12% down to 8%. These are important because they affect our need for third-party labor and overtime, and they generally speak to the stability of the operation. And so, those are all factors going in, along with wage rates, as you called out. And then the use of technology and process improvement and automation, and all that comes together into what becomes our guidance.\n\nIt's the area of the P&L where we want to remain as flexible as we can, simply because when customers need products from us, we need to deliver them. But we have a plan to improve productivity in this area, and it's a combination of all those things working together and the innovative associate programs that we put out there around flex work and early payment of wages and other programs that our associates are telling us they like. But Eric, why don't you add any color that you might --\n\nEric Dorne -- Chief Operating Officer\n\nYes. Andrew, this is Eric. Thanks, Sandy. You pretty much covered it.\n\nAnd just to reinforce that going through COVID, we refocused ourselves on becoming a leader in retention. We've made a lot of adjustments in wages as the market demanded. We, as Sandy mentioned, put in a lot of new innovative programs, which are now maturing and being adaptive across the network, and it's starting to show in a 4% vacancy rate for warehouse and 8% for drivers. So, we are clearly making progress on this front, and that helps drive down the overall cost by eliminating third-party labor and the need for reactive versus proactive labor management.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nTerrific. So just a quick follow-up. So, is most of the improvement in the vacancy rates a result of retention?\n\nEric Dorne -- Chief Operating Officer\n\nIt is. I mean, we're actively hiring as the market and the demand needs, but retaining associates, letting them mature, going through full training, and becoming fully productive is what our driving force here is. And our DC and operations leadership have embraced that, and we're seeing the results of it.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nOK. If I could just add a second question. On the -- your units being down, I think, less than 1% versus the industry. I think you said three, coming from Nielsen or somebody.\n\nObviously, nice outperformance. Could you unpack that a little bit? I mean, you have two major business lines as I see it, Natural Foods versus Conventional. And obviously, you sell across a spectrum of types of stores serving different incomes. This is more of a general question, but helps us with some modeling, but also just thinking about where the industry is.\n\nAny color on different elasticities or how demand is changing in some of the large -- either product types you sell or customer groups would be helpful.\n\nSandy Douglas -- Chief Executive Officer\n\nYeah. This is Sandy. What I'd say about that is, first, let's start with the fact that we're talking to a wholesaler. So, we -- our units are driven by the general health and elasticity of the market on one hand, and then our ability to expand categories and/or expand net customers.\n\nSo, more customers buying more categories drives units, and then you have the market situation that can be a bit of a headwind, and that's how you get to our number versus the market. The broader kind of observation across different verticals and different positionings of retailers, I wouldn't offer anything that would add value to what you already know. The lower end of the socioeconomic levels is stressed right now, and we're seeing that in terms of mix and accelerated private brands, which is a major focus area for us. And the interchange between food service and food sourced at retail, taking home, is still very dynamic in this environment.\n\nBut again, you all are very steeped in the detail there. From a wholesale perspective, I think the reason why our units are a little better is that it's an indicator, as John said, that we're gaining some share.\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nOK. Thank you.\n\nOperator\n\nYour next question comes from the line of Scott Mushkin from R5 Capital. Your line is open.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nHey, guys, thanks for taking my question. So, I wanted to get back to the investments you're making in both technology and the DCs. How should we think about the risks associated with that automation? But also, on the technology side, I'm not sure you've gotten into details on what you're doing on the system side, like back office and stuff. But how are you guys thinking about the risks? And do you think you've modeled any of that into the outlook?\n\nSandy Douglas -- Chief Executive Officer\n\nYeah. Thanks, Scott. I'll make a comment on this, and then pass it over to Eric again. I think at the highest level, we have a multitrack approach.\n\nWe are partnering and exploring partnerships in each area so that we have more than one way to go. The technology front is particularly focused right now on quality, improving the on-time in full, accurate delivery because that was an opportunity that became stressed particularly during COVID. Because COVID created -- the spy environment was so unhinged almost that the buildings were constantly trying to figure out how to get product into stores and sometimes substitution and everything else led to the need to redrill in standard operating procedures, and then add technology to improve quality. So, that's kind of our focus there.\n\nAutomation, we've already talked about. But in all cases, we're pursuing multi-partner tracks to address any risk that might be inherent in one technology versus another. Eric, do you want to comment?\n\nEric Dorne -- Chief Operating Officer\n\nYeah. Scott, I would just add, it comes down to process and diligence and testing, and we're very mature in that space. We've been upgrading our DC network over the last many years, as you know, and we will continue to take that approach to manage the risk as we continue to deploy the technology.\n\nSandy Douglas -- Chief Executive Officer\n\nI guess one other thing I'd add is that we -- one of the things, and I mentioned this in the prepared remarks, that we've been focused a lot on is attracting count. And I view this general area is one where you can't have enough executive and mid-level management talent to drive technology and innovation, and we've made the recruitment of that particular area of priority over the last couple of years.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nAnd then as a follow-up, just on the kind of the market share gains, how are we supposed to think about that versus market wins that you guys have gotten that are driving volumes versus kind of the current customers? Are you seeing -- do you think your volume is positive to the industry if we look at just current customers? I don't know if I said that correctly.\n\nSandy Douglas -- Chief Executive Officer\n\nYeah. Well, let me throw out a couple of facts from what we said earlier and see if it answers your question. I mean, we saw some softness in units versus inflation. John went over, while you could unpack our sales report.\n\nAnd we clearly have more customers now than we did a year ago, so that implies that the customers we've had for more than a year, high unit performance that's weaker than the company's. Now that varies, because many of them are taking on new categories from us that we have been able to deliver because they value us as kind of a one-stop shop. And increasingly, customers are seeing that value and taking advantage of it. So, I can't really give you the color that you're looking for into kind of standard steady state because there's not a lot of steady state in our business, which is by design.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nI know it's hard to unpack, but thanks for the answer.\n\nOperator\n\nYour next question comes from the line of Edward Kelly from Wells Fargo. Your line is open.\n\nUnknown speaker\n\nYeah. Hey, good morning, guys. It's Anthony on for Ed. So, taking a step back on the margin guidance for fiscal '23, you're forecasting flat year-over-year margins at the midpoint.\n\nCan you just walk us through the different puts and takes in that figure as we think about your assumptions around things like distribution costs, labor mix, and other components of your cost structure?\n\nJohn Howard -- Chief Financial Officer\n\nYeah. We can talk about it at a high level. The way we think about it, there are a lot of levers. We saw this in FY '22, and I think we're going to see some of this in FY '23, where there's just a lot of levers within our business.\n\nAnd when we think about guidance, what we're thinking about is trying to balance inflation, the impact on fuel rates, the labor market, new business wins. All of those aspects that we try to bake into our guidance to try to come up with a number that we believe is reasonable given that economic backdrop, particularly given our desire to maintain that flexibility that Sandy mentioned so that we can continue to serve the customer as best as possible. So, there's a lot of those moving pieces buried in there, and we've tried to capture it as best we can with the guidance we provided at basically 4%, 4%, and 4% growth, and that's similar to what we provided at this time last year for FY '22.\n\nUnknown speaker\n\nGot it. That's really helpful. And then I just wanted to ask about promotional spend. I guess just anything that you guys are seeing here as pressure on the consumer continues to rise and unit volumes moderate a bit.\n\nAnd then can you just remind us how that works its way into your financials?\n\nSandy Douglas -- Chief Executive Officer\n\nSure. This is Sandy. Broadly speaking, we expect at some point for inflation to start to level off, and we expect suppliers then to want and need to drive margin through incremental sales. And the tool they'll use there is more likely than not to be accelerating promotions.\n\nAnd we're seeing some of that now, we expect more of that ahead of time, and that impacts our P&L. We pass all of it through to our customers, and then we have an administrative fee that goes back to our suppliers that's transparent in our value chain. But let me ask Chris to dive in a little bit more because he's had a lot of interaction with suppliers through the services platform.\n\nChris Testa -- President\n\nYeah. Sandy, I think you answered it well. I mean, what suppliers are saying to us and what we're doing is our customers right now, obviously, are looking for value. And we have a portfolio, a suite of programs that we're working with our suppliers to not only increase promotional spend but to deliver to our customers to what they need.\n\nGiven this inflationary environment, our customers have a high demand for value-type programs. We have good programs, and we're inventing more. So, as Sandy said, as the trends continue, we expect promotion to be a lever that our suppliers continue to pull throughout the year.\n\nSandy Douglas -- Chief Executive Officer\n\nAnd I would just add, we would encourage them to. I think that -- I think an important point for our customers is that we represent the 32,000 retail locations that we serve. An extraordinary brand-building community for CPGs to activate into, segmented all over the market, various brand positioning, etc. And it's incredibly important, as an ex-consumer products person, to have healthy activation in the stores that we serve.\n\nAnd promotions are a great way to do that, to help our customers stay competitive on key items, to help launch new items, and we're working hard to make them more visible so that suppliers can see the value of their investment. But we'd expect that to grow over time, and we think it's very much in the supplier's best interest to drive unit volume through our system.\n\nUnknown speaker\n\nUnderstood. Thanks so much, guys.\n\nOperator\n\nYour next question comes from the line of Kelly Bania from BMO Capital Markets. Your line is open.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nHi. Good morning. Thanks for taking our questions. Sandy, I just wanted to go back to the discussion of volume and inflation, and I think you made a comment that the double-digit inflation is driving consumers to buy fewer items.\n\nAnd so, just wondering if you think that volume does come back as inflation subsides? I think you commented that you're assuming a modest contraction in volumes in your fiscal '23 outlook. But just how you're seeing that unfold for your customers would be helpful.\n\nSandy Douglas -- Chief Executive Officer\n\nSure, Kelly. You know, you've got -- you laid out the facts that we said correctly. And so, now looking into my crystal ball, what I believe is that continued double-digit inflation is not sustainable. And as supply chain settles down, there won't be a case for it.\n\nNow I don't know when that happens exactly, and I wouldn't want to predict it. But as the situation normalizes in the supply chain, the labor environment and inflation starts to recede, then we'll be dealing with a growth environment where there won't be an accelerating headwind on the value of products. But to drive sales, we would expect suppliers to start to invest in promotions, and promotions will drive units. That's the whole purpose of them.\n\nAnd that's a healthy thing for suppliers because units represent consumption occasions for brands, and that's the business they're in. It's healthy for our customers because it serves their primary purpose, which is to sell products to their customers. And so, how that moderates and what the math will be is dependent on a lot of figures, including the economy. And as I mentioned earlier, our wholesale matrix, which involves new customers and new categories.\n\nSo, I wouldn't be able to unpack that for you in a credible way. But suffice to say we put all that together and we get to about 4% sales increase for next year or the year we're in now, and we think that's the right guidance given all those factors.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nOK. That's very helpful. Just another question on mix. There continues to be quite a big disparity between your top-line growth with supernatural and independents versus chains and your own retail segment.\n\nSo, just curious of how much of that is customer wins and cross-selling versus kind of underlying comp performance. And what is factored into your guidance for fiscal '23 from a customer mix standpoint?\n\nSandy Douglas -- Chief Executive Officer\n\nYeah. It's a good question. The answer is the driver of the difference, there's probably a lot of little drivers. But the big driver is category expansion and new customers.\n\nThe outlook for next year, we wouldn't provide it at that level. But as you can hear throughout everything that we say, it is our strategy to grow our capability so that we will continue to earn the business of more customers and more categories. That's at the heart of our model, and then from that strength of scale and earning business from the winning independent retail segment around the country, we then have the services platform to add value on top. And that's how we get to an accretive growth-oriented company that we're -- not only believe we are, but I think are proven we are.\n\nBut as it relates to looking backwards, the difference between the channels is driven by new customers and new categories.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nOK. That's very helpful. And then if I can just add one last in, it's on private label. I may have missed it.\n\nHow is your private label business performing in terms of units or sales, or anything you can help us with? And more broadly, just as you look at category performance, anything of note between conventional versus specialty, natural and organic? And any signs of trade down or what you're seeing there?\n\nSandy Douglas -- Chief Executive Officer\n\nSure. And I'm going to give the detail of this to Chris, but another very good question. Private Brands are definitely accelerating. We saw them sequentially accelerate in the third quarter and again in the fourth quarter, and our Private Brands business grew double digits in the fourth quarter.\n\nI'll let Chris get into the detail, but the strategic point I want to make as I hand it over to him is we view Private Brands as a very high priority for us in terms of delivering for our customers in this environment. And so, it's yet another reason why we isolated the services portfolio, which Private Brands is at the center of so that we could take what is a good program and try to make it a great program. So, Chris, do you want to provide a --\n\nChris Testa -- President\n\nYeah. I'll just add that, as Sandy said, it's continued to accelerate through the fourth quarter and then in the early innings here in fiscal '23. We are definitely seeing a trend toward our value brands. So, we have over 18 brands in our portfolio over -- one of our brands, essentially every day, is over $1 billion at retail, and that is a value brand.\n\nEqualine is a value brand, and we're seeing the demand come from consumers through our customers for those more value-centric brands.\n\nOperator\n\nAnd your final question comes from the line of Peter Saleh from BTIG. Your line is open.\n\nPeter Saleh -- BTIG -- Analyst\n\nGreat. Thank you. And thanks for all the color on the call this morning. Just a couple of questions.\n\nOne, maybe just coming back to capex. I think in FY '22, your capex was about $50 million less than what you had initially projected, and I think part of the shortfall was you can find the labor and the materials, and just to execute on that plan. In '23, it looks like that number is about $100 million higher. So, are you confident that you guys can hit that number? Do you have the right people in place to execute on these projects for '23 that you're projecting?\n\nSandy Douglas -- Chief Executive Officer\n\nI'm going to answer your question in a strategic way, and then I'm going to ask John to give you the color. But you're right. The shortfall in fiscal '22 was a function of the supply chain. It wasn't really our capability to execute.\n\nIt was more our ability to get the materials, think for forklifts, and other capital items for the supply chain. And the guide relative to capex in '23 is catching up with that and making strategic investment in automation and technology. But, John, do you want to talk about confidence level in that, and how to think about it?\n\nJohn Howard -- Chief Financial Officer\n\nYeah. No, I would say the exact same thing. That's exactly what happened in '22, and we're expecting some of that to recover in '23, hence, the increase. We feel good about the $350 million based on what we know today.\n\nAnd as that unfolds throughout the year, just like we did in FY '22, we'll just adjust and announce accordingly. But right now, we feel good about the $350 million and our ability to accomplish those projects this fiscal year.\n\nPeter Saleh -- BTIG -- Analyst\n\nGreat. Very helpful. And then just lastly, on the share repurchase. Can you just talk about what the -- if you do some share repurchase, what is the goal here? Is it to offset dilution, or is it to actually reduce the outstanding share count? Just trying to understand how you're thinking about that going forward.\n\nJohn Howard -- Chief Financial Officer\n\nYeah. I think we think about it through both of those lenses. So, from our perspective, it's just another tool that we can have in our capital allocation toolbox that allows us to think about ways to return value to shareholders after we've gone through, as we mentioned earlier, growth opportunities and the focus there, customer service and those types of items, and then we get into debt reduction and capital allocation with the share buybacks. And then it's just the -- where we think we're going to end up with that.\n\nAnd I think given the opportunity that we see with our share price today, I think there is a great chance to add value to our shareholders through that program.\n\nPeter Saleh -- BTIG -- Analyst\n\nAll right. Thank you very much.\n\nOperator\n\nAnd this concludes our question-and-answer session. I will now turn the call over to UNFI management for some final closing comments.\n\nSandy Douglas -- Chief Executive Officer\n\nThanks, operator, and thanks to everybody for joining us this morning. I hope you've heard and take away from today's call that UNFI has momentum as we enter fiscal 2023. We're growing and performing within a quickly evolving environment by steadfastly focusing on the four operating principles that I outlined on our last call, which underpin our execution of the Fuel the Future strategy. First, bringing value to our customers, then improving the way we partner with suppliers.\n\nThird is creating unmatched career opportunities for our associates, and last but not least, supporting our communities and the planet. As we enter the new fiscal year, we strongly believe we have the right leadership team to maximize the value creation of our Fuel the Future strategy, and we're committed to doing just that. Before we conclude the call, I did want to take a moment to thank Eric Dorne, our Chief Operating Officer, prior to his retirement at the end of this coming month, for his 11-plus years of service to UNFI and a leadership that he has shown throughout, Eric has been an amazing partner and a friend and a great executive here at UNFI, and we wish him good health and happiness in his future endeavors, and he will certainly be missed. For our customers and suppliers who are listening in, we thank you for your continued partnership and the business we do together.\n\nAnd for our UNFI associates listening today, our thanks to each of you for everything that you do for our business, our customers, our communities, and each other. And for our shareholders, thank you for the trust that you place in us through your continued investment in UNFI. We look forward to updating everyone again in December.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteve Bloomquist -- Vice President, Investor Relations\n\nSandy Douglas -- Chief Executive Officer\n\nJohn Howard -- Chief Financial Officer\n\nBill Kirk -- MKM Partners -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nEric Dorne -- Chief Operating Officer\n\nMark Carden -- UBS -- Analyst\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nAndrew Wolf -- C.L. King and Associates -- Analyst\n\nScott Mushkin -- R5 Capital -- Analyst\n\nUnknown speaker\n\nChris Testa -- President\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nPeter Saleh -- BTIG -- Analyst\n\nMore UNFI analysis\n\nAll earnings call transcripts"
}