{
  "companyName": "Vroom, Inc.",
  "companyTicker": "VRM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/vroom-inc-vrm-q2-2022-earnings-call-transcript/",
  "content": "Vroom, Inc. (VRM 2.50%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to Vroom's second quarter 2022 earnings call. [Operator instructions] I would now like to turn the conference over to your speaker today, Liam Harrington, vice president of investor relations. Please go ahead.\n\nLiam Harrington -- Vice President, Investor Relations\n\nThank you, operator. Good morning, everyone, and welcome to Vroom's second quarter 2022 earnings call. Joining us on the call today are Tom Shortt, chief executive officer; and Bob Krakowiak, chief financial officer. Please note this call will be simultaneously webcast on the investor relations section of the company's corporate website at ir.vroom.com.\n\nThe second quarter 2022 earnings release and earnings presentation are also posted to the investor relations website. Before we begin, please note that the discussion today includes forward-looking statements within the meaning of the federal securities laws, including but not limited to statements about Vroom's operations, and future financial performance. These and other forward-looking statements are based on management's current assumptions, and are neither promises nor guarantees and are subject to a number of risks, uncertainties and other important factors that may cause actual results to differ materially. We direct you to the company's most recent SEC filings, including the risk factors section of Vroom's most recent Form 10-K for the year ended December 31, 2021, as updated by our quarterly report on Form 10-Q for the three months ending June 30, 2022 for additional discussion of factors that could cause actual results to differ materially.\n\nPlease note further that today's discussion, including the forward-looking statements, speak only as of the date of this call, and Vroom assumes no obligation to update such statements. The company may also discuss certain non-GAAP financial measures during today's call. You can find a presentation of the most directly comparable GAAP measures and a reconciliation of those measures. In the second quarter 2022 earnings release and management presentation.\n\nI'd like to now hand the conference over to Tom Shortt, chief executive officer, Tom?\n\nTom Shortt -- Chief Executive Officer\n\nThank you, Liam, and thank you to all the investors, analysts, Vroommates, UACC colleagues, and third-party partners who are joining us today to discuss Vroom's second quarter earnings. I'll start on Slide 3. We introduced our long-term roadmap in our May 26th investor day, where we highlighted our midterm goal, which is a breakeven business and our long-term goal of a 5% to 10% adjusted EBITDA margin business. As we mentioned on investor day, we have made the choice to slow down.\n\nWe are slowing down with the intent to continue improving our customer experience. We plan to live within our means while we prioritize unit economics, profitability, and liquidity over growth. As previously announced, our roadmap relies on four focus strategic initiatives. First, build a well-oiled transaction machine.\n\nOur transaction machine includes titling and registration, selling, e-commerce, and marketing. Our primary focus in the short term is building a well-oiled titling and registration machine. Second, build a well-oiled metal machine, how we buy, move, recondition, sell, deliver, and price vehicles. Our goal is to optimize the end-to-end supply chain by synchronizing how we buy, move, recondition, and deliver vehicles to reduce cycle times, reduce supply chain costs, improve inventory turns, and improve customer delivery times.\n\nThird, build a regional operating model leveraging our national brand. We intend to sell nationally but operate more regionally around our reconditioning centers and transportation hubs. We expect to build density and regions to drive marketing and supply chain economics while improving customer delivery times. We have a significant opportunity to reduce the number of miles or vehicles travel and reduce inbound and outbound transportation costs.\n\nFourth, build our captive finance offering. We intend to expand on our captive finance offering for Vroom customers, which we believe will improve conversion rates and improve unit economics, while also improving the customer experience. We also intend to continue to grow the UACC third-party dealer business which contributes to our consolidated EBITDA. Moving to Slide 4, our second quarter highlights.\n\nWe improve the adjusted EBITDA, excluding the securitization gain in Q1 by $51 million, or 38% sequentially. Our e-commerce gross profit per unit, or GPPU, was $3,629 reflecting progress toward our long-term goal. We reduced adjusted SG&A by $52 million sequentially. We are making progress on our long-term roadmap on our core strategic initiatives.\n\nDevelopment of our captive financing operation is on point. Our pricing initiatives are driving GPPU improvements. We've made several process and tech improvements in transaction processing, including titling and registration, that are beginning to bear fruit. We have continued tech development and anticipate additional tech deployment in 2022 to progress us toward our goal of becoming best-in-class in titling and registration.\n\nGiven our quarter-over-quarter adjusted EBITDA improvement and our focus on profitability and liquidity over growth, for the year, we currently expect to be at the low end or below our forecasted e-commerce units, near or better than the midpoint of our forecasted adjusted EBITDA loss range, meaning an EBITDA loss between $325 million to $350 million and near the midpoint of our previously forecasted liquidity range. Turning to Slide 5. During investor day, we outlined these key unit economic drivers behind our four strategic initiatives that we believe will build a profitable business model. This slide is an update on our Q2 operational progress on our four strategic initiatives by financial lever.\n\nFor product and vehicle GPPU, we achieved $3,629 e-commerce GPPU, driven by our pricing initiative and captive financing operation. Development of our captive financing operation is on plan. We've recently announced that UACC completed its second securitization since our acquisition, and UACC's 14th securitization overall, demonstrating UACC's ability to leverage its substantial capital markets experience to opportunistically deploy securitization transaction and maintain capital flexibility even in a challenging market. SG&A logistics.\n\nWe reduced our all and logistics costs by $20 million sequentially. We began optimizing our logistics operations in Q3. Inventory. We achieved a 21% improvement in listed for sale inventory as a result of transforming the titling process.\n\nOur SG&A sales. We reduced our sales costs by $8 million sequentially. We began our sales pilot and launched new e-commerce initiatives in the quarter. SG&A for titling and registration.\n\nWe focused on improving the customer experience while we made improvements in transaction processes. This droves a $3 million increase sequentially. As I mentioned, we expect continued tech deployment in the second half of 2022. SG&A for marketing.\n\nWe reduced our marketing costs $15 million sequentially and saw improvement in our cost per opportunity as we focused on our high return on investment marketing channels. SG&A fixed cost. We reduced fixed costs $12 million sequentially. In the business realignment plan, we announced we were closing our TDA service business.\n\nWith that closure we determined that our TDA service business real estate is better suited for our reconditioning business. Accordingly, we plan to relocate our Stafford, Texas reconditioning facility to our lower-cost service site. This will further reduce our fixed costs once the transition is complete. The variable and fixed costs sequential changes represent a $52 million sequential reduction and adjusted SG&A mentioned earlier.\n\nI'll turn it over to Bob now to go through our financial performance in the second quarter and our forward outlook. Bob?\n\nBob Krakowiak -- Chief Financial Officer\n\nThank you, Tom. I would like to begin by providing more detail on our financial performance in the second quarter as we executed against our strategic initiatives, we initially outlined in our investor day presentation in May. Let's turn to Slide 7 for a summary of second quarter financial performance versus the first quarter. Total revenues of $475 million decreased 49% sequentially.\n\nAs we intentionally reduced e-commerce units. E-commerce units decreased 53% quarter over quarter as we chose to slow down our e-commerce business to focus on improving operational execution. We are pleased with our progress on gross profit per unit as we more than doubled e-commerce GPPU quarter over quarter to $3,629. This is a quarterly record for Vroom.\n\nI will discuss the drivers of this expansion in more detail on the following slide. Our adjusted EBITDA loss improved by $21 million sequentially. And our adjusted EBITDA, excluding securitization gain, improved $51 million sequentially in the second quarter. This was driven by our record e-commerce GPPU, as well as decreased fixed and variable costs as a result of our realignment plan and the initiative set forth in our long-term roadmap.\n\nAs a reminder, second quarter adjusted EBITDA and full year 2022 adjusted EBITDA guidance include impacts from nonrecurring costs to address operational and customer experience issues. We incurred approximately $8 million of these costs in the second quarter. Our adjusted EBITDA, excluding securitization gain and nonrecurring costs to address operational customer experience issues, improved by $59 million sequentially. Please turn to Slide 8, for a summary of our financial highlights for the second quarter.\n\nE-commerce units decreased 53% quarter over quarter to $9,233 as we chose to slow down e-commerce transactions to focus on improving operational execution. Let's dive further into our record GPPU performance. During the second quarter, we substantially grew vehicle and product GPPU. E-commerce vehicle GPPU increased 264% sequentially to $2,166 an increase of nearly $1,600.\n\nOur commitment to our strategic initiatives outlined at investor day help drive improvement in sales margin, as we revise pricing algorithms to focus on optimizing GPPU over transaction volume. As we move forward, we see additional opportunities to optimize our pricing strategy. E-commerce product GPPU increased 25% quarter over quarter to $1,463, an increase of nearly $300. This was primarily driven by higher interest income due to a higher volume of loans held by UACC for Vroom customers.\n\nFor review of how UACC in captive financing impact our financial statements, please refer to slide 11 of our first quarter management presentation. While we drove GPPU performance and significantly reduced our expense base, our adjusted EBITDA excluding securitization gain per unit decreased 32% quarter over quarter. As we expected in the short run, our expenses did not decrease at the same rate as e-commerce units during the second quarter. In addition to deleverage on select fixed costs, we also chose to support our goal of addressing the current titling and registration challenges and making titling and registration an area of competitive strength.\n\nNext, please turn to Slide 9, which provides a comparison of our adjusted EBITDA, excluding securitization gain versus the prior quarter. Let's start with a look at gross profit, which increased by $14 million in spite of a 53% contraction in units. There were three main areas that impacted gross profit versus the prior quarter. First, the reduction in e-commerce unit volume, reduced gross profit by $80 million.\n\nThis was mostly offset by increased e-commerce GPPU, which delivered an additional $17 million in gross profit. Non e-commerce gross profit improved by approximately $15 million, which was primarily driven by interest income within the retail financing segment. As a reminder, the retail financing segment includes results from UACC loans originated by third-party independent dealership customers. Our results in the second quarter benefited from having a full three months of business activity versus the prior quarter since the UACC acquisition closed in February.\n\nWe are pleased with the ongoing performance from our third-party independent dealership business. Moving on to expenses. Our largest reduction in expenditures was outbound logistics, primarily driven by lower variable expenses as we sold fewer units during the quarter. We successfully reduced marketing expenses by $15 million during the quarter.\n\nOn top of lower variable marketing costs, we also experienced savings as we prioritize our higher ROI channels of marketing. Overall, we reduced marketing expenses at a lower rate than unit volumes as we continue to invest in select brand building campaigns and initiatives. Next, our realignment plan drove $11 million in compensation and benefit cost reductions quarter over quarter. In total, we delivered approximately $59 million of improvement in adjusted EBITDA excluding securitization gain and nonrecurring costs to address operational and customer experience issues.\n\nPlease turn to Slide 10 for an update on liquidity. We ended the second quarter with $533 million in cash and cash equivalents, excluding restricted cash and continue to forecast $450 million to $565 million at year-end. We updated the bridge from the first quarter call with actual second quarter results to highlight the expected sources and uses of cash during the second half of the year. Our previously provided adjusted EBITDA loss guidance for the full year of $375 million to $325 million implies a loss of $182 million to $132 million of adjusted EBITDA during the second half of the year.\n\nNext, we expect approximately $26 million to $36 million in capital expenditures in the second half of the year, as well as $5 million to $10 million in stock-based compensation, and $10 million in UACC Vroom financing. We released $43 million of restricted cash to cash and cash equivalents in the second quarter. We forecast approximately $82 million to $107 million of additional cash released in the second half of the year, as we improve operations and speed up our transaction processing. Lastly, we forecast approximately $39 million to $64 million of cash in inventory to be released through the remainder of the year.\n\nWe anticipate improvements in cash in inventory, as we continue to improve our transaction and titling processes. Altogether, this implies approximately $500 million in liquidity at the end of the year. Now, I'd like to pass it back to Tom for a few final remarks. Tom?\n\nTom Shortt -- Chief Executive Officer\n\nThanks, Bob. Turning to Slide 11. We improved adjusted EBITDA, excluding the securitization gain, by $51 million, or 38%, sequentially. Our e-commerce GPPU of 3629 reflects progress toward our long-term goal.\n\nWe reduced adjusted SG&A by $52 million sequentially. Development of our captive finance operations are on plan. We made significant improvements in transaction processing, including titling and registration. We remain very focused on continued improvement in titling and registration in the short term.\n\nAs we look ahead through the remainder of the year, we expect to be within our profitability and liquidity forecasts. I look forward to updating you on our progress on our core strategic initiatives each quarter as we pursue our long-term roadmap. Thank you for your time and attention today. Operator, we are ready for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Zach Fadem with Wells Fargo. Your line is open.\n\nSam Reid -- Wells Fargo Securities -- Analyst\n\nHey, it's actually Sam Reid sitting in here for Zach. Wanted to dig a little deeper into SG&A. Because when we look at some of those line items on a per-unit basis, there was generally a pretty significant step-up across the board ex-logistics. Just what's your confidence that you can regain -- that you can rein in some of those line items where per-unit cost stepped up a bit sequentially? I'm talking compensation, marketing, occupancy, and other things? Thanks so much.\n\nTom Shortt -- Chief Executive Officer\n\nHi, Sam. This is Tom. Good morning. So, when we think about variable costs, especially the number of levers that we're moving relatively fast, they take a little bit of time to remove.\n\nSo, first you have to do the analytics, and you have to figure out the reductions, and then you have to actually execute the cost reductions. So, we feel pretty good that we'll be able to continue to reduce costs, which is why we wanted to show the dollar reduction, which we outlined on Slide 5. And it just takes a little bit of time to catch up with the rapid decline in unit volume. We feel pretty good about the targets we outlined in the investor day on terms of each of the SG&A, long -- mid- and long-term fixed costs.\n\nSo, I view this as just a short-term timing issue.\n\nBob Krakowiak -- Chief Financial Officer\n\nAnd I just wanted to add to that, just in terms of on the competence benefits, it was down about $6 million. But when you adjust for the top of the realignment plan, it was down about $11 million quarter over quarter.\n\nSam Reid -- Wells Fargo Securities -- Analyst\n\nThanks, guys. That's super helpful. And then, maybe one follow-up here. This is your first quarter operating at this lower unit level.\n\nCould you give us a sense as to where you think the units that you, you might not have sold this quarter because of that decision may have ended up? And then kind of wanted to also just touch on, you know, sort of the unit trajectory from here. I know you guys kind of refrained from doing that at the analyst day, but maybe just some high-level thoughts and where you think unit could go, you know, given this sort of dialed-back level. Thanks so much.\n\nTom Shortt -- Chief Executive Officer\n\nYeah. Thanks, Sam. We're really focused on the three objectives of unit economics, profitability, and liquidity. And that's our primary focus.\n\nAnd we'll forecast units, you know, in 2023, at the at the end of the year.\n\nSam Reid -- Wells Fargo Securities -- Analyst\n\nThank you, guys. Much appreciated.\n\nTom Shortt -- Chief Executive Officer\n\nThanks, Sam.\n\nOperator\n\nWe have a question from Scott David with Stifel. Your line is open.\n\nScott David -- Stifel Financial Corp. -- Analyst\n\nHi. Thank you. I wanted to go back a little bit further in time. The last time that the e-commerce units were at the level that they were in the second quarter was, I think, back in 3Q of '20.\n\nAnd at that point in time, SG&A was about $60 million. So, the SG&A is 2.5 times since then. And there's been a lot of change in the business model and need to invest. But I wonder if you could just speak to SG&A, relative to like, where the business was back then and, in terms of framing, the potential opportunity for lowering the cost base over time to the extent that exists.\n\nTom Shortt -- Chief Executive Officer\n\nYeah. It's hard to reflect back to that point, Scott. This is Tom. The way we're thinking about it now is we've got more variable and fixed costs to remove in the short-term, particularly to adjust to the units that you saw in Q2.\n\nAnd we have all the initiatives we laid out on investor day for all of our variable costs from logistics sale titling and registration and marketing. We're focused on driving those initiatives that we believe will get us to the long-term goals in the roadmap that we that we outlined.\n\nScott David -- Stifel Financial Corp. -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Colin Sebastian with Baird. Your line is open.\n\nColin Sebastian -- Baird -- Analyst\n\nThanks. Good morning, guys. A couple of for me as well, I guess, first of all, you know, just you've highlighted the higher GPPUs. And just want to understand, your view on the sustainability of that trend.\n\nSince, you know, near term, you're sort of unable to pick, you know, more of the higher margin units, as you sort of scale, scale volume down. But, you know, at some point, you scale that back up. So, how do we think about sort of sustainability of GPPUs, first? And then secondly, I know you're not talking about the unit outlook, but maybe you could help us a little bit with Q3 kind of near term and sort of setting expectations. Is this a further reset lower? Or have units sort of bottomed out here? If you can help us with that that would be helpful.\n\nThank you.\n\nTom Shortt -- Chief Executive Officer\n\nHi, Colin, it's Tom. On the GPPU, what I would say is, I feel like we've really just scratched the surface on all the levers that we articulated on investor day in terms of what we can do around pricing and assortment optimization. So, we feel pretty good about the long-term goals that we outlined on investor day. Having said that, we are really focused on the three objectives of unit economics, profitability, and liquidity.\n\nWe would expect some movement around the GPPU that we had in Q2 both up and down in the short-term as we really stay focused on those three objectives. And then in terms of units, we did update give a little additional color on our guidance, which is we expect to be right around the low end of our annual guidance of 45,000 units or possibly a little bit lower.\n\nBob Krakowiak -- Chief Financial Officer\n\nYes. And then I just wanted to add to that, Colin, thanks for your question that when you're thinking about the third quarter that we did announce that we completed in the third quarter of securitization. Our second securitization this year from UACC, and we are expecting an $18 million to $20 million gain in the third quarter as a result of that securitization. So, when you're thinking about, the impact of that transaction in our third quarter numbers.\n\nAnd we also have the -- we'll have the full benefit of the business realignment plan in the third quarter as well.\n\nColin Sebastian -- Baird -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Seth Basham with Wedbush Your line is open.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot, and good morning, I have a couple of questions around some of your operational objectives. Now, first up, pricing, provide some more color around what you're doing and titling and registration and where you are in terms of that process, with average turnaround time, etc. And then secondly, if you can provide some color around what you're doing to enhance reconditioning, were you consolidating from TDA, etc., that would be helpful.\n\nTom Shortt -- Chief Executive Officer\n\nYeah, sure. Good morning, Seth. So, the way we think about titling and registration. On titling, we're working to get titles faster, which you may have noticed, has impacted our inventory turns in our days of supply.\n\nAnd so if you go on our website, you'll see a lot of our cars are in coming soon status instead of available for sale. That's driven by how fast we can get titles and make sure that we have them vaulted. You may recall in our investor day, we talked about the digital title vault that we implemented recently. And so during the quarter because of the improvements in the titling process and getting titles faster, we were able to improve our for-sale inventory by 21%.\n\nSo, that's what's behind titling. When we think about registration, we're very focused on getting registrations done for every state faster. We made several improvements over the last several months on ensuring that we have the right processes, metrics, tools, and systems to drive those improvements and reduce the number of touches. I would say in Q2, we made a lot of blocking and tackling type improvements to make sure we're doing a much better job and taking care of our customers.\n\nBut I look to the back half of the year, I -- we're working on a lot of tech initiatives that we're hoping will speed up the process even further, as well as take a lot of additional steps, which would reduce our cost. In terms of reconditioning, we've brought in some new leadership and a couple of areas inside of Vroom. And in reconditioning, when we looked at our Stafford, Texas site, it was an old Sam's Club building, it really wasn't a great layout for the facility. And since we made the decision to close the service business, we realized that, over the longer run, we can exit that old Sam's Club facility and move into the service business on the TDA real estate, which will reduce our fixed costs.\n\nAnd it actually fits well with the model and the reconditioning needs, we think, we'll need in Houston.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. Thank you. That's helpful. And then just a follow-up, just trying to understand how you're thinking about balancing.\n\nSo, the human sales reps GPPU, you referenced this in response to one of the prior questions, but we've obviously seen quite a shift here improvement in gross profit dollars in e-commerce with a material reduction in units. But is this the right balance here on a go-forward basis? And when do you think about growth again in units?\n\nTom Shortt -- Chief Executive Officer\n\nYeah, Seth. So, I think it's the right balance now. We are very focused on unit economics, profitability, and liquidity, as well as, improving the customer experience. As the entire organization has made improvements across the board on customer experience, both in titling and registration and logistics, I would hope as we get further down the road that when we feel really great about the customer experience, that's when we'll begin to really start thinking about growing.\n\nWhat probably makes sense to give a little bit of color about the customer experience and the level of effort our Vroommates and UACC colleagues are working toward. We started -- after Investor Day, we started a monthly townhall to give all of our Vroommates and UACC colleagues an update on our transformation is outlined on May 26. And as part of that, we're really giving updates across all these initiatives in the financial levers that we outlined on Slide 5. And one of the good stories is, you know, we're really focused on delivering cars a lot faster to our customers.\n\nAnd we had one site that did a next-day and then a same-day delivery, and they were telling, sharing with the organization, their success. And it's really created a passion around customer excellence and an excitement around customer obsession, really, to where the hubs are now competing with each other. And over the last couple of months, we had one hub that was able to deliver a vehicle to a car within three hours of the purchase being finalized. So, we're really trying to get the organization rallied around this superior customer experience across all levels of the organization, from our hubs, to our associates in the sell -- selling organization and titling and registration.\n\nAnd as I see that momentum continue to progress each month, and we feel really good about our titling and registration process, that's when we'll begin to pivot and start thinking about growing.\n\nBob Krakowiak -- Chief Financial Officer\n\nI just want to add to what Tom said that we've proven that, the customer, that they really love our model, and we execute it well. And we've proven that we can grow that model. And just to highlight what Tom said that right now, we are focused on unit economic profitability and liquidity overgrowth at this point in time. But, you know, we have a ton of confidence that when the time is right, we'll be able to ramp this model back up like we have in the past.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. We got a question from Sharon Zackfia, with William Blair. Your line is open.\n\nSharon Zackfia -- William Blair -- Analyst\n\nHi, good morning. I apologize in advance. I had dueling conference calls. So, if you mentioned this, I'm sorry.\n\nBut I was curious about the vehicle GPPU at the 2,100-plus range versus I think the midterm goal you gave reached recently with 1,700. So, I know pricing algorithms are helping a lot. But is there something in the GPPU currently that we would expect to kind of come back before it goes forward again? Because I'm trying to think about that May $1,700 number you gave versus the obvious over achievement here. And then did you mention where UACC is now in terms of the capture rate on Vroom applicants and whether you're starting to see kind of a widening of the funnel of subprime customers being able now to purchase through Vroom?\n\nTom Shortt -- Chief Executive Officer\n\nGood morning, Sharon, I'll take the second one first. We have not disclosed what our capture rate is for Vroom. We're just indicating that UACC is originating loans for Vroom customers, and it is on plan. With regard to the vehicle GPPU, I've mentioned earlier, you may not have heard, I think we've really just scratched the surface in terms of what we can do as we outlined in the investor day.\n\nIn terms of pricing algorithms, and assortment optimization. Having said that, one of the levers that we outlined as we did implement shipping fees for terms of pricing algorithms and assortment optimization. Having said that, one of the levers that we outlined is we did implement shipping fees for especially very long-distance vehicles. And you might expect over time as we improve our logistics network that we might lower shipping or our costs.\n\nSo, that could potentially, you know, bring vehicle GPPU down but it would come out of SG&A. So, it might be in a different line on the P&L. But in aggregate, we feel -- we still believe that goals for aggregate gross profit dollars in our mid- and long-term range that we laid out investor day are an appropriate goal for us.\n\nSharon Zackfia -- William Blair -- Analyst\n\nRight. And then, just one follow-up. Have you made any significant changes in the vehicle mix that you're selling now that UACC is, you know, live and originating loans through Vroom?\n\nTom Shortt -- Chief Executive Officer\n\nYeah. We've seen a slight mix shift toward more vehicles that would be more tuned to UACC to subprime financing, but it's not significant. Our mix has been relatively consistent in the short term. That's still an opportunity for us as we move forward.\n\nSharon Zackfia -- William Blair -- Analyst\n\nOK. Thank you.\n\nTom Shortt -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext question comes from John Colantuoni with Jefferies. Your line is open.\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nHey. Thanks for my questions. I was just doing some back-of-the--envelope math on your 2022 outlook. And it looks like it implies that EBITDA losses per unit isn't expected to improve in the second half of the year.\n\nI guess I'm having some trouble seeing, you know, kind of where you get improved SG&A per unit was with lower unit sales, giving you the spreading fixed costs over less units. You know, I understand that cutting units helps reduce cash burn because it lowers variable cost. But I guess I'm just wondering if you could help, you know, me get a little bit more comfort around kind of the long-term strategy, you know, given the fixed cost component. And I have a follow-up.\n\nThanks.\n\nTom Shortt -- Chief Executive Officer\n\nYeah. Good morning, John. So, a couple elements. We are incurring, non-recurring costs around that, that we outlined in terms of customer make good payments.\n\nWe're also -- we increased our spend and title and registration for the quarter, even though we reduced volumes, which we felt was needed in the short term to get title and registration where we need it. Depending on the financial level we articulated on Slide 5, many of those in the quarter where we just were reducing with volume while we've just started initiatives around optimizing our logistics network and driving cost reductions in titling and improvement. As I mentioned, we've got several tech deployments that we expect entitling registration throughout this year that we believe will be very significant fruit in 2023.\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nGreat.\n\nTom Shortt -- Chief Executive Officer\n\nSo, we're really just getting started on the unit economic kind of drivers of productivity on the SG&A levers.\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nAppreciate that. And maybe you could just talk about your outlook for UACC and sort of the gain on sale profitability given a tougher environment for nonprime model securitizations. Is there an avenue for UACC to sell the loans to a large partner if the market for nonprime securitizations worsens further in the second half of the year? Just curious. Thanks.\n\nBob Krakowiak -- Chief Financial Officer\n\nYeah, John. Thanks for the question. This is Bob. You know, we remain -- we're confident in the guidance -- I talked about guidance for UACC for the full year on the last call, $65 million to $75 million EBITDA.\n\nWe remain very confident and comfortable in that range for the year. As I mentioned earlier, we completed a securitization during the third quarter. We'll talk about it more in the next call, but we're expecting an $18 million to $20 million securitization gain. And in terms of our strategy on securitizations going forward, you know, we're going to do what's in the best interest of the shareholders.\n\nYou know, we thought that -- the first transaction, the $30 million gain that we booked in Q1. In the third quarter, will book 18 to 20. And we thought it was in shareholders' best interest to complete that securitization and executed. But, we will look at holding the residual portions of securitizations as well, if we don't believe that the economics makes sense at the time of the other transaction but really continue to follow our, you know, just our overall -- just originate the sell model, but do it in a way that is always in the best interest of the shareholders.\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. And that's all the question in the queue. I'd like to turn the call back to management for any closing remarks.\n\nTom Shortt -- Chief Executive Officer\n\nThank you, everyone, for your time today, and have a fantastic day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLiam Harrington -- Vice President, Investor Relations\n\nTom Shortt -- Chief Executive Officer\n\nBob Krakowiak -- Chief Financial Officer\n\nSam Reid -- Wells Fargo Securities -- Analyst\n\nScott David -- Stifel Financial Corp. -- Analyst\n\nColin Sebastian -- Baird -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nSharon Zackfia -- William Blair -- Analyst\n\nJohn Colantuoni -- Jefferies -- Analyst\n\nMore VRM analysis\n\nAll earnings call transcripts"
}