{
  "companyName": "YY",
  "companyTicker": "YY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/yy-yy-q2-2022-earnings-call-transcript/",
  "content": "YY (YY -1.59%)\nQ2 2022 Earnings Call\nAug 29, 2022, 9:00 p.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen. Thank you for standing by, and welcome to the JOYY Inc. second quarter 2022 earnings call. [Operator instructions] I would now like to hand the conference over to your host, Jane Xie, the company's senior manager of investor relations.\n\nPlease go ahead, Jane.\n\nJane Xie -- Senior Manager, Investor Relations\n\nThank you, operator. Hello, everyone. Welcome to JOYY's second quarter 2022 earnings conference call. Joining us today are Mr.\n\nDavid Xueling Li, chairman and CEO of JOYY, Ms. Ting Li, our COO, and Mr. Alex Leo, the general manager of finance. For today's call, management will first provide a review of the quarter and then we will conduct a Q&A session.\n\nThe financial results and webcast of this conference call are available at ir.joyy.com. A replay of this call will also be available on our website in a few hours. Before we continue, I would like to remind you that we may make forward-looking statements, which are inherently subject to risks and uncertainties that may cause actual results to differ from our current expectations. For detailed discussions of the risks and uncertainties, please refer to our latest annual Report on Form 20-F and other documents filed with the SEC.\n\nFinally, please note that unless otherwise stated, all figures mentioned during this conference call are in U.S. dollar. I will now turn the call over to our Chairman and CEO, Mr. David Xueling Li.\n\nPlease go ahead, sir.\n\nDavid Xueling Li -- Chairman and Chief Executive Officer\n\nThank you. Hello, everyone. Welcome to our second quarter 2022 earnings call. Let me start with an overview of our quarterly results.\n\nDespite the global macroeconomic uncertainties and the seasonality impact of Ramadan holiday in the Middle East, we achieved the $598.1 million in revenues, including $502.6 million of revenue from Bigo, approaching the higher end of our previous guidance. We grew our non-GAAP net profit to $51.5 million at group level, realizing our non-GAAP net margin of 8.6%. Notably, the Bigo segment expanded its non-GAAP net profit to $86.3 million and improved its non-GAAP net margin to 17.2%. Our operating cash flow continued to be strong, reaching $61.7 million for the quarter.\n\nThe steady expansion of our profitability and this current market condition demonstrated the improved efficiency and enhanced resilience of our business. We are in an environment of increased macro uncertainty. Rising inflation and increased cost of living continued to massively impact consumer spending. The lifting of lockdown and travel restrictions imposed during the pandemic contributed to resurgence in travel demand during the summer season, further diverting consumers time and spending to offline activities.\n\nThe aggressive appreciation of the U.S. dollar was also an unfavorable factor as our price rose in local currency terms. Those various hirings had and will affect the softer monetization efficiency for a wide variety of global companies, including JOYY. Despite these macro-economic challenges, a significant proportion of global users is still under served for social entertainment services.\n\nIn time increased uncertainties, users are seeking more emotional value from their products such as a sense of belonging and meaningful connections with others. That's why we respond to this volatile macro environment first and foremost by turning inward, continuing to integrate our products and cultivate our user community, while maxing the emotional value our services can provide. In recent quarters, we launched several major products features updates including Bigo Live's virtual live and community, Likee's loop interest-based community feature, and HAGO, 3D HAGO Space. Those features serve to improve the quality and the efficiency of our users social experience, enabling them to better engage and foster meaningful connections with those who have a similar interest.\n\nTogether with our drivers and inclusive community culture, we believe those efforts will help our products deliver important and unique emotional value to our users. In addition to maxing this emotional value, we continued to be fully dedicated to creating value for our creators by providing creator-friendly video creation tools and monetization features and cultivating a user community that is built on equity and connections. We have established a creator-centric ecosystem that enable a large number of creators to showcase their talents in front of global audience and at the same time enjoying from seeing economic returns. Over the past few years, we have invested a cumulative total of our $1 billion in creators reward.\n\nWith the support of our global operation teams and implementation of variety of activities tailored to local users evolving needs, we empower our creators to gain exposure both locally and internationally and enable them to realize the new levels of personal and professional success. Going forward, we remain committed to delivering value to our users and creators. We will continue to cultivate diverse premium content, innovate interactive features and organize tailored local activities. We expect those efforts will further improve the user experience and ultimately facilitate the growth of our user community and the global business.\n\nTo mitigate risks against the current market, we proactively implemented a series of matters to further improve our efficiency and enhance the resilience of our business. As we continue to execute sustainable growth strategy and emphasize our products organic growth, we will be more adaptive in the execution of our user acquisition strategy. This means we will dynamically adjust our strategy based on our ROI and closely monitor shifting marketing conditions. For products that are still loss-making such as Likee and HAGO, we will focus on the steady improvement of their respective monetization capabilities, stick to disciplined sales and marketing strategy and optimize their cost structure in order to steadily narrow their respectively operation loss.\n\nWe will also continue to enhance product synergy and optimize our business process to drive further improvement of our operation efficiency at the group level. As we maintained a healthy growth trajectory in our profit and cash flow since 2021, we are in a strong financial position that allows us to have greater flexibility and continued investment in core area that build our long-term capabilities. We expect to emerge from the above recalibration as a more focused and more productive organization, better positioned to capture long-term growth opportunities. Now, let me dive deeper into the progress we made in each of our product line.\n\nLet's start with Bigo Live. As a result of macroeconomic uncertainties and the seasonality during to Ramadan holiday in the Middle East, Bigo Live's live streaming revenue and number of paying users declined during the second quarter. Yes, Bigo Live's user base and engagement live continued to grow, thanks to our innovative feature updates and localized activities with embraced original tradition -- regional traditions and user needs. During the second quarter, Bigo Live's MAU increased by 10.6% year over year to $32.6 million.\n\nNotably users in Southeast Asia and other emerging market increased by 18.6%, while user in Europe increased by 8.7% year over year. To help our users in the Middle East and certain Southeast Asia countries celebrated their Ramadan holiday, Bigo Live launched a series of live events that tailored to local traditions. This include cooking sessions, quiz shows and singing content and in Likee, the local celebrities and influencers to demonstrate the unique cultural tradition of their regions. Our new community feature, which was launched last quarter continued to contribute to content diversification and user engagement improvement in the BAR channel.\n\nBAR's average views per user increased by 14.1% and the volume of its video content increased by 7.3% sequentially. Bigo Live also upgraded its Virtual Live feature to enable tender live-streaming experience for its users, driving up both the number of users and cumulative time spent on Virtual Live session substantially over the previous quarter. Next, let's turn to Likee. During the second quarter, for similar reason to Bigo live, Likee's live streaming revenue and the number of paying user declined.\n\nAs mentioned earlier, given the current macro environment and the fact that short video monetization is still at an early stage of development, Likee continued to exercise prudence in its sales and the marketing strategy, further optimize its cost structure and actively explored new opportunities for monetization. We have made progress in executing those objectives. And we successfully narrowed Likee's operating loss by 85% year over year and during the first half of 2022. In mid-June, Likee launched a new feature called Loop in Europe and the U.S.\n\nLoop is community feature that helps users with similar interest connect with each other. And we have so far received positive feedback from our users. For example, shortly after Loop was launched, the anime community shared more than 6 million episodes of video content and over 50% of the user in the anime community are following one another. This indicates that Loop has contributed to the fostering of a high level of connection.\n\nWe also observed steady improvement in user engagement and stickiness especially in the region where Loop was introduced, and the average time spend on Likee per user increased sequentially by 10.2% globally and 22.7% in this region. During the second quarter, in addition to launching a variety of localized campaigns, Likee partnered with our charity organization in Middle East and South Asia to launch cross-regional donation campaign. By logging into Likee and participating in the Ramadan campaign, user collected energy points every day, which could later be converted to a certain donation amount to be made by Likee's local charity organizations. More than 200,000 users participated in this campaign, demonstrating that the user today seeks to make a positive impact on their communities while being entertained and engaged.\n\nWe will continue to actively explore other opportunities to further empower our user to make positive difference in their local communities. Next we can turn to HAGO. During the second quarter, HAGO's live streaming revenue increased by 7.1% year over year, and it's number of paying user grew by 12.8% over the same period. As we continue to optimize HAGO's content recommendation algorithm, HAGO's user engagement improved, as evidenced by a increase in its featured channel penetration rates of 1.8% sequentially.\n\nDuring the quarter HAGO focused on updating its newly launched 3D HAGO Space feature. HAGO introduced a more localized makeup, customers and accessories, enabling user to design their 3D avatars according to their personal and culture preferences. Additional interactive item and 3D virtual scenes were also introduced, both of which were well-received by HAGO user and demonstrated by the increase of HAGO Space next-day user retention rates by 14.9% sequentially. In the coming quarter, HAGO plan to further update users HAGO Space experience by introducing more 3D virtual scenes and items then to cater to local culture and user needs.\n\nWe expected to continuously increase the user penetration rates of our HAGO Space feature and further enrich HAGO users' total experience. Finally some updates on capital return. During the second quarter we bought back additional 12.1 million of our shares. We will continue to actively utilize our share repurchase program to enhance return to shareholders.\n\nTo conclude, we will always strive to establish the stability and find the opportunity in the uncertainty. The current macro environment does not change our demonstrated great track-record in capturing some of the largest growth opportunity, nor our long-term outlook on the industry. And we view the current market reflection as opportunities to deepen our focus and plan for the future. We remain committed to generating value for our users and creators, while improving efficiency and enhance the resilience.\n\nAs we continue to invest in building our long-term capabilities, we firmly believe that JOYY as a company will emerge from the current uncertainties as a more focused and productive organization and be well-positioned to capture long-term growth opportunities and generate sustainable shareholders value. This conclude my prepared remarks. I will now turn the call to our general manager of finance, Alex Leo, for our financial updates.\n\nAlex Leo -- General Manager, Finance\n\nThanks, David. Hello, everyone. Now, let me go through the details of our financial results. Please note that the financial information and the non-GAAP financial information disclosed in our earnings press release is presented on continuing operations basis, unless otherwise specifically stated.\n\nAs the sale of YY Live was substantially completed on February 8, 2021, with certain customary matters to be completed in the future. We have achieved consolidation of YY Live business since February 2021. Our total net revenues for the second quarter was $596.1 million compared to $661.7 million in the same period of 2021, primarily due to macroeconomic uncertainties and unfavorable exchange rates, which negatively affected paying user segment. Cost of revenues for the second quarter decreased by 17.6% year over year to $377.7 million.\n\nRevenue sharing fees and content costs was $247 million in the second quarter compared with $289.1 million in the same period of 2021, primarily due to optimization of revenue sharing costs. Bandwidth costs decreased to $20 million from $27.5 million in the same period of 2021, primarily due to the company's improved efficiency in bandwidth usage. As we continue to execute a sustainable growth strategy and proactively implemented a service of cost optimization measures, this effectively improved our efficiency and enhanced the resilience of our business and maintained a healthy growth in our growth and operating profitability. Gross profit increased to $218.4 million in the second quarter, with our gross margin improved to 36.6% from 30.7% in the same period of 2021.\n\nOur operating expenses for the second quarter decreased by 41.1% to $185 million from $314 million in the same period of 2021. Among the operating expenses, sales and marketing expenses decreased to $98.4 million from $112.2 million due to disciplined and efficient spending on user acquisition. General and administrative expenses decreased to $23.7 million for the second quarter of 2022 from $101.1 million in the corresponding period of 2021. Our general and administrative expenses was higher in second quarter of 2021 primarily due to a one-off impairment loss arising from certain equity investment.\n\nOur GAAP operating income for the second quarter was $38.7 million, compared to operating loss of $101.1 million in the same period of 2021. Operating income margin for the second quarter was 6.5% compared to operating loss margin of 15.3% in the same period of 2021. Our non-GAAP operating income for the second quarter, which excludes share-based compensation expense, amortization of intangible assets from business acquisitions, as well as impairment of goodwill and investment and gain on disposal of subsidiaries and business was $59.9 million in this quarter compared to non-GAAP operating loss of $13 million in the same period of 2021. Our non-GAAP operating income margin for the second quarter was 10% compared to non-GAAP operating loss margin of 2% in the prior year period.\n\nGAAP net income from continuing operations attributable to controlling interest of JOYY in the second quarter of 2022 was roughly $18.7 million compared to net loss of $109.3 million in the same period of 2021. Net income margin was 3.1% in the second quarter of 2022 compared to net loss margin of 16.5% in the corresponding period of 2021. Non-GAAP net income from continuing operations attributable to controlling interest of JOYY in the second quarter was $51.5 million compared to non-GAAP net loss of $0.5 million in the same period of 2021. The group's non-GAAP net income margin was 8.6% in the second quarter of 2022 compared to non-GAAP net loss margin of 0.1% in the same period of 2021.\n\nNotably because non-GAAP net income expanded to $86.3 million in the second quarter with its non-GAAP net income margin improved to 17.2% from 3.3% in the prior year. Together with our improving profitability, we have maintained a strong operating cash flow as well. Throughout the second quarter of 2022 we booked net cash inflows from operating activities of $61.7 million. We remain a healthy balance state with a strong cash position of $4.29 billion as of June 30th of 2022.\n\nImportantly we have continued to enhance returns to shareholders through dividends and the share repurchase. In accordance with our previously announced quarterly dividend plans approved in August and November 2020, we will be distributing a dividend of $0.51 per ADS for the second quarter of 2022 to shareholders of record as of the close of business on September '22. Additionally, we have repurchased 12.1 million of our shares and our previously announced share repurchase programs. As of June 30, 2022, we have in total repurchased approximately $327.9 million of our share repurchase programs.\n\nGiven our current cash position, we should be able to balance between keeping sufficient cash to invest in building our long-term capabilities and enhancing return for our shareholders. We will continue to actively utilize share repurchase to create value for our shareholders and current market condition. Going forward, as David just mentioned, we remain committed to delivering value to our users and creators, and we will continue to prioritize investment into the cultivation of our content, product and active features and localized activities. We will continue to enhance our operational efficiency and effectively execute our long-term growth strategies.\n\nFor our business outlook, we expect our net revenues for the third quarter of 2022 to be between 561.5 and $593.5 million. Without considering supply, we currently have limited visibility surrounding the macro-economic uncertainties of our business and the markets in which we operate. Therefore, this forecast only reflects our current and preliminary views on the market and operational conditions, which are subject to change. That concludes our prepared remarks.\n\nOperator, we would now like to open up the call to questions. Thanks.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Alex Poon from Morgan Stanley. Please go ahead.\n\nAlex Poon -- Morgan Stanley -- Analyst\n\n[Foreign language] Thanks, management, for taking my question. My first question is, how should we read our third quarter revenue guidance? And how management sees our growth trajectory in this year's second half, and next year? And also for user growth trend in the second half of next year? Thank you very much.\n\nDavid Xueling Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThis is David. I will firstly talk about the current macro headwinds that we faced regarding our revenue as well. The first half mainly comes from lifting of lockdown and travel restrictions. We are seeing a resurgence in travel demand during the quarter.\n\nAnd also we are seeing a lot of our creators and host are also having increased activity in offline traveling as well. So that is going to be a negative impact on our revenue. Secondly, with the rising inflation we're seeing the cost of living putting a higher pressure on our users. And thirdly, the aggressive appreciation of U.S.\n\ndollar means that we will need to adjust our price in accordance with the appreciation and that is going to create a negative impact on our revenue growth as well.\n\nDavid Xueling Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nSo as our strategy under such environment, we are going to adopt to a ROI driven sales and marketing strategy, prioritize our efficiency over the scale of our business. It means that we are going to continue to iterate our products and cultivate our services and to rely more on our products and services to achieve organic and effective growth.\n\nDavid Xueling Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nSo for our second question regarding the user growth trend, first of all for Bigo Live, I think we'd be able to observe that it has been continuously expand its product outreach by further diversifying its contents and innovates product features. That's why despite our sales and marketing expenses for Bigo Live decline Q-on-Q, Bigo Live's still sustained its user growth with its MAU growing by 10.6% year over year. And it proves the effective user acquisition strategy of Bigo Live. So as for our second year, we believe that Bigo Live will likely maintain its user growth momentum given its effective useracquisition strategy.\n\nDavid Xueling Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThank you for the question, and we will now next -- go to the next question.\n\nOperator\n\nThank you. Our next question comes from the line of Thomas Chong from Jefferies. Please go ahead.\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language] Thanks, management, for taking my questions. My question is about our cost efficiencies measures. Given that we have seen many Internet companies implementing measures on cost control, just want to get some color from management about the trend in operating expenses such as sales and marketing, R&D, G&A in the second half. And how we should think about the margin trend going forward? Thank you.\n\nAlex Leo -- General Manager, Finance\n\nHi, Thomas. [Foreign language]\n\nUnknown speaker\n\nThank you Thomas, this is Alex. I will answer your question. So you can see that in the second quarter, thanks to our sustainable growth strategy and continued optimization of costs, expenses, we have managed to enhance operating efficiency and achieve better than expected profitability. Bigo segment achieved a non-GAAP net margin of 17.2%, while the Group achieved a non-GAAP net margin of 8.6%.\n\nAnd if we take a closer look at Bigo segment, our gross margin was improved both year over year and Q-on-Q in the second quarter. And that is mainly due to optimization of content costs, improved bandwidth utilization, efficiency and also cost savings in the payment channel expenses. And for our non-GAAP operating expenses such as sales and marketing, G&A and R&D, we also saw cost savings happening across these expense items as well. And I would like to mention that the fact that we've been able to improve our efficiency despite short-term fluctuation in revenue demonstrate that we have been forward looking in our strategy planning while minimizing the potential negative impact from fixed cost.\n\nSo for our second half of the year and also full year of '22, we expect Bigo segment's gross margins to remain stable. And also given that our localized sales and marketing activities would be more active in the second half of the year, the amount of sales and marketing expenses should be slightly higher. And also we expect to continue to achieve certain cost savings across other expense items given improved efficiency. I was still confident to achieve higher non-GAAP profitability for Bigo segment in the full year '22 as compared to year '21.\n\nThank you. Next question.\n\nOperator\n\nThank you. Our next question comes from the line of Daniel Chen from J.P. Morgan. Please go ahead.\n\nDaniel Chen -- J.P. Morgan -- Analyst\n\n[Foreign language] I will translate myself. Can management maybe share your view on the live-streaming and the short video industry in the overseas market, in each of these segment market what are the major competitive landscape and what's the latest change in each of the markets? Thank you.\n\nDavid Xueling Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThis is David. I will answer your question. We can firstly look at the short video sector. We believe that there has been increasing competition in the short video sector, given that we have so many new products coming into the sector including increasing the larger companies like Google and Facebook, as well as TikTok.\n\nBut if we look at live-streaming, especially social live-streaming, we don't believe that the competition landscape has changed that much. I would believe that for social live-streaming, this is a product and sector that is hugely reliant on the community and the sticky connection among the users. If we look back, and we look at YY Live, which we used to operate in Mainland China, even when the domestic or the competitive landscape increased competition in the PRC markets, we see that YY Live user scale and also revenue scale remain relatively stable. And that is because for such a social live-streaming platforms usually takes five years to 10 years to build up a social connection and community where everyone is actually deeply connected.\n\nSo it's much more sticky and therefore having a relatively limited impact from additional competition, so I believe that we have a strong barrier in the global social live-streaming sector. Thank you. Next question, please.\n\nOperator\n\nThank you. Our next question comes from the line of Yiwen Zhang from China Renaissance. Please go ahead.\n\nYiwen Zhang -- China Renaissance -- Analyst\n\n[Foreign language] Thanks for taking my question. First regarding the Bigo Live. In prepared remarks, you mentioned our community culture. Can you elaborate on that, including how that had helped our user engagement and also the current ecosystem.\n\nAnd secondly can you give us an update on the Likee and HAGO business? Thank you.\n\nDavid Xueling Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nThank you for question. This is David. I will answer the question. So I've talked about Bigo Live previously, so now, I will mention mostly about HAGO and Likee.\n\nHAGO launched 3D space virtual reality social interaction feature last quarter, and it introduced a variety of virtual 3D scenes and virtual costumes during the quarter, significantly improving user experience and engagement. HAGO also completed the setup of the virtual costume stores for users so that they can freely shop and dress their digital avatars. And this should be a meaningful step forward to further improve HAGO's monetization efficiency and diversifying its revenue stream. And for Likee, it's still focusing on the cultivation of creators and facilitating the growth of interest-based communities.\n\nSo after the new community function loop has launched in Europe and U.S. during the quarter, we have observed improved our social interactivity on Likee. We plan to make loop available in more regions and facilitate the growth of each vertical community through more efficient interest content matching. We will also explore new monetization opportunities under the feature, more community-based social commerce for example.\n\nDavid Xueling Li -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAnd also some additional updates on Bigo Live. We've mentioned that the recent launch of Bigo Live Virtual Live and Community feature has been launched in the previous quarters and we have received positive feedbacks from our users. Both have contributed to increased activity in live-streaming sessions and also the content diversity and social activity on our BAR channel. In the second half of the year, we plan to launch some new features such as match, to further improve our user's social interaction experience.\n\nThank you. So that's the end of our call. And we look forward to speaking with everyone next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJane Xie -- Senior Manager, Investor Relations\n\nDavid Xueling Li -- Chairman and Chief Executive Officer\n\nAlex Leo -- General Manager, Finance\n\nAlex Poon -- Morgan Stanley -- Analyst\n\nUnknown speaker\n\nThomas Chong -- Jefferies -- Analyst\n\nDaniel Chen -- J.P. Morgan -- Analyst\n\nYiwen Zhang -- China Renaissance -- Analyst\n\nMore YY analysis\n\nAll earnings call transcripts"
}