{
  "companyName": "Nike",
  "companyTicker": "NKE",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/20/nike-nke-q2-2023-earnings-call-transcript/",
  "content": "Nike (NKE -0.29%)\nQ2 2023 Earnings Call\nDec 20, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone. Welcome to NIKE, Inc.'s fiscal 2023 second-quarter conference call. For those who want to reference today's press release, you'll find it at investors.nike.com. Leading today's call is Paul Trussell, vice president of investor relations and strategic finance.\n\nBefore I turn the call over to Mr. Trussell, let me remind you that participants on this call will make forward-looking statements based on current expectations. And those statements are subject to certain risks and uncertainties that could cause actual results to differ materially. These risks and uncertainties are detailed in NIKE's reports filed with the SEC.\n\nIn addition, participants may discuss non-GAAP financial measures and nonpublic financial and statistical information. Please refer to NIKE's earnings press release or NIKE's website, investors.nike.com, for comparable GAAP measures and quantitative reconciliations. Now, I'd like to turn the call over to Mr. Paul Trussell.\n\nPlease go ahead.\n\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\n\nThank you, operator. Hello, everyone, and thank you for joining us today to discuss NIKE, Inc.'s fiscal 2023 second-quarter results. Joining us on today's call will be Nike president and CEO, John Donahoe, and our chief financial officer, Matt Friend. Following their prepared remarks, we will take your questions.\n\nWe would like to allow as many of you to ask questions as possible in our allotted time, so we would appreciate you limiting your initial question to one. Thanks for your cooperation on this. I'll now -- I'll now turn the call over to NIKE, Inc. president and CEO, John Donahoe.\n\nJohn Donahoe -- President and Chief Executive Officer\n\nThank you, Paul. And hello to everyone on today's call. We delivered a strong quarter in Q2 with revenue growth of 17% on a reported basis, and 27% on a currency-neutral basis. And looking at the quarter's results, we delivered our Q2 expectations on revenue, profitability, and inventory.\n\nIn this current environment, our consumer demand stands out. Today, we're creating more separation between us and our competition, thanks to the meaningful relationships we have with consumers and the continued success of our strategy. Our Q2 growth was broad based across our brands, channels, and geographies. We had strong double-digit growth across both our partners and our direct business, which was once again led by our industry-leading digital performance.\n\nThe quarter saw more than 30% currency-neutral growth in our North America, EMEA, and APLA geographies. And after nearly two years of unprecedented disruptions, Greater China grew 6% on a currency-constant basis, translated to -3% on a reported basis due to foreign exchange. Clearly, our brand continues to, not only be top of mind, but prioritized by consumers around the globe. In addition to our results, we're executing in the areas we spoke to 90 days ago as we take decisive action to clear excess inventory.\n\nWe believe the inventory peak is behind us as actions we're taking in the marketplace are working. Later in the call, Matt will share more about our progress on inventory in North America and our return to healthy inventory levels in China. So, overall, our Q2 results give us confidence that we will deliver the year, and we remain on a path toward our long-term goals as well. Our current headwinds, such as foreign exchange and inventory challenges, are transitory, but our tailwinds are structural, like the expanding definition of sport, the consumers' move toward digital, and the cultural shifts toward comfort and health and wellness.\n\nMore importantly, our results speak to how we've leveraged our competitive advantages, which include a relentless innovation pipeline, unmatched brands, and deep consumer connections to build relative strength and stay ahead of competition. As you heard me say before, at NIKE, it all starts with product innovation. And this quarter, I'd like to highlight an important part of our culture of innovation: our constant pursuit to improve on our most popular platforms. We win with product because we know it's not only about individual innovations, but also about our ability to continuously bring newness to our greatest franchises.\n\nFor instance, earlier this quarter, we launched the LeBron 20 to strong consumer response. What's unique about LeBron 20 is that it's LeBron's first signature shoe to debut as a low top. Driven by consumer insight and performance demands from LeBron himself, this style combines innovation with sportswear design to create greater commercial appeal with its ability to be worn on the court and off. And we're not just bringing innovation and excitement to existing franchises.\n\nWe continue to expand the portfolio. Coming soon, we've got some exciting signature debuts in NIKE Basketball and Jordan brand that we can't wait for consumers to see. With our strong product portfolio and unparalleled roster of athletes that we have today, we couldn't be more excited about the future of our basketball business. Last quarter, I highlighted another franchise in another sport getting an upgrade, the Mercurial, which added Zoom airbag to create NIKE's fastest football boot ever.\n\nAnd during the exciting World Cup over the last several weeks, the new Mercurial scored more goals than any other boot, led by Kylian Mbappé who won the Golden Boot as the tournament's top scorer. In fact, NIKE's boots dominated the World Cup, scoring more goals than all other brands combined. And consumers have responded to this energy, giving the new material the highest full-price realization of any performance product, this quarter globally. And of course, for us, it doesn't just end in innovation with product.\n\nNIKE's innovation can also be felt with our rich and powerful storytelling and our deep brand engagement, particularly in global sport moments like the World Cup. NIKE's unique ability to bring together products, storytelling, and the world's best athletes has once again created something that only NIKE can. As I mentioned earlier, our Q2 results speak to the continued success of our strategy. Consumer direct acceleration is fueling our marketplace approach in which we directly connect with the consumer no matter where they shop.\n\nToday, our marketplace strategy is driving distinction in this current promotional environment. Our work to directly connect with consumers is founded on simple consumer insights. Consumers want to get what they want when they want it and how they want it. And consumers have told us they want a consistent, seamless, and premium experience, both digitally and physically around model brand and multi-brand.\n\nAnd so, we're serving consumers digitally with our suite of apps. We're extending our reach and convenience through our strategic wholesale partnerships and leveraging model brand doors to fill the gap for underserved opportunities like women's fitness and Jordan. The key is building meaningful, direct, lifelong relationships with consumer. We deeply believe this will be an important source of differentiation going forward.\n\nWhy? Well, for one, having a direct connection with consumers avoids the risk of disintermediation. In other words, with a consumer base that comes directly to our apps, to our website, and to our owned and partner stores, we, alongside our partners, are in a position to control our own destiny. And ultimately, this direct connection enables us to understand consumers better so that we can serve them better with the right assortment, with the right partners, and at the right touchpoints. And what showcases the success of this strategy is our membership base.\n\nMembership was a key reason our digital business grew an industry-leading 34% this quarter. Q2 was our biggest member demand quarter ever. We saw double-digit growth in member engagement. Today we have roughly 160 million active members who engage with us on a regular basis.\n\nAnd more importantly, our repeat-buying members who are more engaged, spend more, and spend more frequently are growing at an even faster pace of high double digits as they continue to be an important growth engine for our business. And our members also shop seamlessly across the marketplace. In addition to digital, a key member on-ramp for us is through our NIKE stores. In fact, more than 50% of store demand comes from members.\n\nAnd cross-channel members are even more valuable with higher demand per member than single channel members. And an important enabler of giving consumers a personalized shopping experience regardless of channel is our connected membership program with our strategic partners. You've heard us discuss it before, scaling connected membership with DSG, JD Sports, Zalando, and Topsports. And today, we're seeing results that are beneficial for everyone.\n\nNIKE is already learning more about our members, which helps us elevate in areas such as product creation, line planning, and the experiences we deliver. And our partners are telling us that these engaged members are driving improved traffic conversion and mutual profitability for them as well. And so, while it's still early days on this journey, we're excited by the foundation we're creating. The ability to give consumers a personalized experience across channels, fueled by data and insight, opens up a whole host of opportunity for us.\n\nIt positions us to empower consumers with their own choice while keeping the scalability and strengths in digital marketing, product creation, distribution, and more, which results from knowing them so well. So, ultimately, it'll make NIKE a better retailer and also a better wholesale partner. Last but not least, I want to take a moment to acknowledge our Greater China team and the 6% growth they just delivered. As I said earlier, it's been nearly two years of unprecedented disruption in China, but this team's resilience, experience, and strategy have set us apart to gain momentum on all fronts.\n\nLast month, we had a record-breaking 11.11 consumer moment, which concluded with double-digit demand growth and NIKE having outperformed the industry. And we keep setting new records as part of this important shopping holiday: No. 1 brand, No. 1 in traffic, No.\n\n1 in livestreaming, No. 1 flagship store, No. 1 in membership acquisition, and No. 1 in member demand penetration.\n\nAnd we're not just No. 1. This quarter, we saw movement and relative positioning as we create even more competitive separation coming out of this important consumer moment. And as you know, we have remained committed to investing in greater China for the long term.\n\nEven in this dynamic environment, we continue to invest in technology, local marketing, and more, as we believe the best way to capture demand in China is to serve consumers in a locally relevant way. And today, we're getting a true competitive boost from our investments in these new capabilities. Let me just highlight a few. We launched China-specific versions of our apps to build NIKE experiences that are faster, more engaging, and more personalized.\n\nWe created a first-of-its kind China-specific member journey with Tmall, which saw a significant uplift in new member recruitment and demand per member. We piloted connected membership with member-linked transactions to 42 NSP stores in 18 cities across China, driving conversion, member acquisition, and retaining high-value members. And our team continues to drive China-for-China capabilities, like delivering hyper-local product design and localizing marketing content creation. Thanks to this focus, we're now serving our consumers in China with an agile, dynamic, and personal way like never before.\n\nWe're confident in our ability to compete and win in this marketplace for the long term. In the end, I just want to say how proud I am of our entire global team. In times like this, it's people that make the difference. And a great team can turn challenges into opportunities, and we've got a great team, and that is exactly what they have done.\n\nThis is a group who will stay on the offense to deliver the business while also creating the future of NIKE. We'll continue to build an even stronger position, and I couldn't be more excited. And with that, I'll turn the call over to Matt.\n\nMatt Friend -- Chief Financial Officer\n\nThanks, John. And hello to everyone on the call. NIKE's second quarter of fiscal '23 demonstrated again the power of our portfolio of brands. Throughout the quarter, we leveraged our brand momentum and deepened our connections with consumers to drive strong revenue growth.\n\nBefore going into our second-quarter results and financial outlook, I want to provide more insight on the strong consumer demand that we continue to see and the progress that we have made over the past 90 days regarding our inventory. Consumer demand for our brands drove double-digit currency-neutral revenue growth across NIKE, Jordan, and Converse. Within NIKE Direct, retail traffic was up, conversion rates expanded, and member buying fueled record digital results. Within wholesale, we saw strong retail sales and market share gains across our top strategic partners.\n\nSince last quarter, our brand momentum has accelerated into the holiday season. In North America, our Black Friday and Cyber Week performance set record highs for demand and traffic, fueling strong double-digit revenue growth and exceeding our plan. In EMEA, we closed our biggest Cyber Week ever, increasing demand by 75% from last year. In Greater China, our 11.11 demand grew mid-teens, outpacing the sports industry.\n\nAnd globally, our holiday season momentum has continued through the first few weeks of December. Despite operating in a largely promotional marketplace, we're creating brand distinction by driving healthy, profitable growth. Full-price realization remains strong after strategic pricing increases, especially for our top innovation products in our largest footwear franchises. NIKE brand ASP is up year over year across our geographies even with higher discounts to liquidate excess inventory.\n\nThis quarter, we also leverage targeted promotions to serve and acquire NIKE members, strengthening an important foundation for sustainable growth. Above all, our Q2 -- Q2 results reinforce our confidence that NIKE's brand and business momentum starts with the value that we create for consumers through our product innovation, deep brand connection, and elevated experiences across the marketplace. Now. let me turn to inventory.\n\nLast quarter, we talked specifically about the actions we are taking to address excess inventory with focus on pockets of seasonally late products, predominantly in apparel. At the end of Q2, we are tracking in line with our plan, and we are pleased with the progress we have made over the last 90 days. Let me go deeper into what we are seeing and why I am optimistic about our path ahead. First, inventory dollars and units are down sequentially.\n\nPrior-year comparisons are distorted by last year's Vietnam factory closures. But compared to the prior quarter, inventory dollars are down 3%, and units are down high single digits with days in inventory at the lowest level in four quarters. Second, we are making progress where we are focused most. In North America, year-over-year growth in inventory dollars decelerated from 65% in Q1, to 54% in Q2.\n\nMore importantly, total inventory units are down low double digits from first-quarter levels even as spring product continues to arrive earlier with faster transit times. Third, the composition of our inventory is improving. In North America, apparel inventory units and apparel closeout units are both down mid-teens from the prior quarter. Last, we have proactively reduced forward supply.\n\nAs I mentioned last quarter, we have tightened our second-half buys to prioritize inventory health across the marketplace. As transit times stabilize, we are optimistic that we will begin to see a more normal and predictable flow of supply in a more capital-efficient manner. Looking ahead, we are confident that our decisive actions have put us on the right track within the financial parameters that we provided last quarter. Our focus continues to be positioning NIKE for future seasons of sustainable and profitable growth.\n\nNow, let me turn to our NIKE, Inc. second-quarter financial results. In Q2, NIKE, Inc. revenue grew 17%, and 27% on a currency-neutral basis, with strong growth across the portfolio.\n\nNIKE Direct grew by 25%, led by 34% growth in NIKE Digital and 11% growth in NIKE stores, highlighted by strong season-to-date holiday results. Wholesale grew by 30%, driven by strong demand for seasonal products, higher shipments based on earlier supply availability, and lower shipments in the prior year, given supply constraints. Second-quarter reported gross margins declined 300 basis points to 42.9%, primarily due to higher markdowns, mainly in North America, unfavorable changes in net foreign currency exchange rates, elevated freight and logistics costs, and increased product input costs, partially offset by strategic pricing actions. SG&A grew 10% in Q2, primarily due to wage-related expenses, strategic technology investments, higher NIKE Direct costs, and increased demand-creation expenses.\n\nOur effective tax rate for the quarter was 19.3%, compared to 10.9% for the same period last year, primarily due to decreased benefits from stock-based compensation and earnings mix. Second-quarter diluted earnings per share was $0.85. Now, let's review the operating segment results. In North America, we captured market share with strong holiday results and positive consumer response to new assortments.\n\nQ2 revenue grew 31% on a currency-neutral basis, and EBIT grew 21% on a reported basis. NIKE Direct grew 23% with NIKE Digital up 31% on double-digit growth in traffic and repeat member buying. Wholesale revenue grew 37% driven by strong marketplace partner demand and improved inventory supply. Performance innovation and fresh seasonal product resonated deeply with consumers.\n\nThe LeBron 20, KD, and Giannis fueled double-digit growth in basketball. And the AJ 11's Varsity Red shock drop highlighted Jordan brand's momentum. In women's, our new statement leggings, NIKE Go, launched with positive early response as the Free Metcon grew double digits. Dunk outperformed in men's, and Pegasus continues to win with everyday runners.\n\nBeyond product innovation, NIKE continues to create distinction at the intersection of culture and community. Ahead of homecoming season, our Yardrunners campaign elevated the voices of HBCU changemakers alongside the release of co-created product through our SNKRS app and neighborhood partners. In addition, with the recent announcement of future NIKE Off-White collections, we are deeply honored to introduce the next chapter of Virgil Abloh's continuing legacy with NIKE. In EMEA, our team landed yet another strong quarter.\n\nQ2 revenue grew 33% on a currency-neutral basis, and EBIT grew 23% on a reported basis. NIKE Direct grew 44% on a currency-neutral basis, with NIKE Digital growing 62%. Membership was an accelerator as members drove over 85% of demand during Cyber Week, our highest demand week ever in EMEA. Our campaign led with sport, adding more than 1 million new NIKE members, as we invited consumers to join us in celebrating the World Cup.\n\nThe power of our portfolio drove momentum across the marketplace. Earlier this month, we celebrated the Milan opening of Jordan World of Flight, a premium retail concept at the forefront of basketball culture. Meanwhile, NIKE dominated shoe and apparel counts at the Berlin and London marathons as Alphafly drove strong sell-through. Pegasus Shield and Winflo Shield grew double digits in women's running.\n\nZegama created energy in trail-running, the sport's fastest-growing segment. And global football grew double digits as we continue to celebrate an incredible year of sport. In Greater China, our brand and business momentum continued as Q2 revenue grew 6% on a currency-neutral basis, and EBIT declined 10% on a reported basis. NIKE Direct grew 4% on a currency-neutral basis with NIKE Digital growing 9%.\n\nIn addition to delivering positive growth, we achieved our goal of returning to inventory health at the end of Q2. Inventory dollars declined 3% this quarter, and closeout inventory was down high double digits versus the prior year with closeout mix now in line with pre-pandemic levels. Our team delivered these results while managing through significant COVID-related disruption, including the closure of over 1,500 owned and partner stores at the end of November. We continue to closely monitor ongoing risk while focusing on what we can control, deepening our connections with Chinese consumers.\n\nAs 18,000 runners joined in the return of the Shanghai Marathon, our brand presence was deeply felt, not only as the title sponsor, but also as NIKE dominated the shoe count and local NIKE athlete, Zhang Deshun, topped the podium. The energy extended into double-digit growth for our running business led by Zoom Fly and Vaporfly, as well as the Pegasus and Winflo. NIKE's brand momentum with our youngest Chinese consumers continues to grow as well. On 11.11, Gen Z demand for NIKE grew by 45% on Tmall.\n\nAnd with NIKE leading on 11.11 as the No. 1 store on Tmall's kid's footwear channel, plus, our top kids lifestyle footwear franchise is growing double digits in Q2, we are more excited than ever about NIKE's opportunity to serve the next generation. Finally, in APLA, our team continues to overdeliver in our fastest-growing, most diverse geography. Q2 revenue grew 34% on a currency-neutral basis, and EBIT grew 25% on a reported basis despite the transition of our circular territory to a distributor model.\n\nNIKE Direct grew 30% on a currency-neutral basis, and NIKE Digital grew 35%. We deepen consumer connections across territories with member days fueling robust growth. In Korea, one of our fastest-growing marketplaces, we're excited to integrate our digital business onto NIKE's global platform, which will enable us to serve Korean consumers through the NIKE SNKRS app. We also continue to strengthen local connections through our express lane with launches, such as our Somos Familia collection.\n\nAcross APLA, this quarter showed the power of our complete offense. In women's, we drove energy and lifestyle with local storytelling around the Air Force 1's 40th anniversary. Global football and running led the way in men's performance, and kids delivered balanced growth across apparel and footwear. Finally, the Jordan brand continues to be an incredible engine for growth, with momentum in streetwear and performance footwear.\n\nNow, I will turn to our financial outlook. As I said last quarter, we are taking a measured approach in the second half against an uncertain macro outlook as we continue to prioritize a healthy pull market. That said, we remain positive regarding the strong consumer demand we see across our portfolio of brands, as well as the health of our product franchises. From product innovation to rich storytelling, the value that NIKE creates for the consumer continues to drive business momentum and competitive separation across the marketplace.\n\nGiven our strong second-quarter performance, we now expect full-year revenue to grow low teens on a currency-neutral basis, an improvement from our low double-digit guidance in the prior quarter. As of today, we expect approximately 700 basis points of foreign exchange headwinds, resulting in full-year reported revenue growth of mid-single digits. Third-quarter revenue growth is expected to be higher than the fourth quarter due to timing of wholesale shipments. We continue to expect gross margin to decline between 200 to 250 basis points versus the prior year, reflecting ongoing liquidation actions in the second half.\n\nThis outlook reflects our strong performance in Q2, mostly offset by an additional 25 basis points of negative foreign exchange impact, now totaling 95 basis points for the full year. We expect that third-quarter gross margin will decline at a similar rate as the second quarter, including a 120 basis points of foreign exchange headwinds. For the full year, we continue to expect SG&A to increase high single digits. We expect third-quarter SG&A dollars to be in line with the second quarter.\n\nAnd we now expect our effective tax rate to be in the high teens range, primarily due to decreased benefits from stock-based compensation. As many of you know, we close out NIKE's 50th anniversary this year. And for all the history NIKE has already made, it's the future that inspires us most. After all, NIKE's culture of innovation doesn't just shape the products we create and the stories we tell; it also defines the way we adapt and accelerate through dynamic conditions.\n\nOver this past year, no matter what we have faced, our teammates have continued to come together and deliver. I could not be more proud of their efforts. And as we turn toward NIKE's next 50 years, I have every confidence in the future this team will create. To every member of our NIKE, Jordan, and Converse team around the world, thank you for all that you do and happy holidays.\n\nWith that, let's open up the call for questions.\n\nOperator\n\nThank you, Mr. Friend. [Operator instructions] With that, we go to our first question this afternoon from Jim Duffy at Stifel.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nThank you. Good afternoon. I'm hoping that you can --\n\nJohn Donahoe -- President and Chief Executive Officer\n\nGood afternoon.\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nThank you. I'm hoping you can help with more insights on the composition of growth in North America and where you stand with clearance efforts. I believe, Matt, you said ASP was up in all geographies. Is that true for North America as well? And then, looking at the split between footwear and apparel growth, footwear, very strong acceleration; apparel, more modest, despite what I would have expected, clearance efforts.\n\nCan you just speak to where you stand with respect to moving to those apparel balances?\n\nMatt Friend -- Chief Financial Officer\n\nSure, Jim. We saw strong growth in the North America marketplace, up 31%. And really, as you as you noted, it was -- it was really strong across channels, NIKE Direct and our wholesale partners, as well as across gender. Our Jordan brand delivered incredibly strong growth in the quarter, as well as our footwear business.\n\nYes, our ASPs overall for the geography were up. That was definitely benefited by strong performance in our footwear business. I mentioned our strong -- strong demand that we saw over the holiday season and, in particular, the consumer moments right at the end of the quarter. But throughout the entire quarter, we continue to see strong levels of full price realization in footwear, which continue to give us confidence in our most important product franchises, the stories that we continue to tell to refresh and make them relevant, as well as the new -- the new products that we continue to bring to market on a seasonal basis.\n\nSpecifically, to your question about inventory and our actions there in North America, I referenced that we saw our -- our units down versus Q1 levels, low double digits. And our focus in the quarter was really around our apparel liquidation, as well as managing apparel closeouts. And both those dimensions were down mid-teens from a unit perspective versus -- versus the prior quarter. We continue to see strong demand from our value partners on the wholesale side for -- for our out-of- season apparel.\n\nAnd, you know, we continue to be very confident in our ability to, you know, to -- to continue that liquidation through the balance of -- of this fiscal year.\n\nOperator\n\nThank you. We take our next question now from Bob Drbul at Guggenheim Securities.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nHi. Good afternoon. I guess just on the inventory, Matt, is there a number -- as you think through the next few quarters, you know, could you give us an idea of where you think you'll land in terms of, you know, the inventory levels or when you might have, sort of, a more normalized number, you know, either in North America, you know, or overall?\n\nMatt Friend -- Chief Financial Officer\n\nSure, Bob. Well, as I mentioned, we're really pleased with the progress that we delivered this quarter. And where we ended Q2 is in line with the plans that we set 90 days ago. I guess the first thing I'd say is, you know, our prior-year comparisons on inventory are really distorting the progress that we made this quarter because, a year ago, we were undergoing 15 weeks of lost production capacity from our factories being closed in Vietnam.\n\nAnd so, it depressed the base quite significantly. When we look at the progress that we made this quarter where we needed to focus most, we feel really good about the momentum that we have there. And when we look at the brand momentum that we had into the holiday seasons -- and into the holiday season and where our partners are at, we continue to be confident in -- in the momentum that we're building there, especially in the pockets of inventory that were elevated as a result of -- of -- of what transpired last quarter. I'll tell you two other things.\n\nYou know, as we look at transit times continuing to improve, one of the things that gives -- gives us greater confidence is a more predictable flow of supply on normal lead times. If you -- if you recall, we've been navigating over the past two years, it's been pretty significant and volatile, and it continues to increase our confidence levels. But we're focused on prioritizing healthy pull markets going into fiscal year '24. And so, we expect the spread of inventory growth to revenue growth to continue to narrow over the second half.\n\nWe already showed strong improvement this quarter. But we expect that spread to continue to narrow in the second half, and that will be driven based on strong demand and also the -- the buy -- the buy tightening that we did for the second half last quarter.\n\nOperator\n\nThank you. We go next now to Matthew Boss at J.P. Morgan.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks and congrats on a nice quarter. So, maybe for John, two straight quarters of double-digit, accelerating constant-currency revenue growth, I guess can you speak to the level of brand heat for NIKE that you're seeing in the marketplace today? Maybe elaborate, Matt, I think you cited market share gains that you're seeing in North America. And then, just what's your confidence in sustaining this kind of momentum as we think about your product pipeline moving forward?\n\nJohn Donahoe -- President and Chief Executive Officer\n\nYeah, sure, Matt. The -- you know, one of the phrases we've been using repeatedly, frankly, for the last two and a half years is, \"In times of turbulence, strong brands can get stronger.\" And that is our ultimate -- that's our ultimate goal, which is whatever challenges or opportunities get faced by everyone, we want to make sure that we capitalize better than others and get stronger and gain share. And that's -- that's what you're seeing through the last couple of quarters and, we believe, continuing into the next -- in the next several quarters. And frankly, the -- the fundamentals are simply leveraging our competitive advantages.\n\nIt's -- it's that sort of unique NIKE combination of great product, product innovation, like the material, or combined with great roster of athletes and teams with great storytelling that you really bring to life in moments like the Euro Chance for Women's last summer and Men's World Cup this year, combined with distribution where we're getting consumers what they want, when they want it, how they want it. And so, it's that combination that that certainly, and as we come out of more and more COVID, we're being able to to pull together time and time again. The LeBron 20, another great example, great product, great storytelling -- I hope everyone enjoyed those commercials -- with a great athlete. And that's all true throughout the globe very, very quickly.\n\nAnd if there's one dimension that I would say is kind of a fourth source of competitive advantage from our historical ones, it's this digital advantage. And it's, you know -- you see, we grew digital 34% in an e-commerce -- global e-commerce market that most people would say is low single digits. And that is where having the direct connection with consumers, having the best apps in the industry allows us to leverage the full funnel of our membership base. And we believe that's going to be an important and fourth source of competitive advantage, you know, throughout the globe.\n\nAnd that will continue for quarters and years to come. So, we're staying focused on the fundamentals, to be honest, and with the strong mantra is let's make sure we get stronger and create greater competitive separation regardless of what the environment throws us.\n\nMatt Friend -- Chief Financial Officer\n\nYeah, and I just would say on this -- on this -- on the comment about market share and confidence, really, you know, you saw the balanced growth we delivered this quarter across channels. And as John mentioned, it really does start with digital with that 34% growth. But I wouldn't -- I wouldn't want you to miss the -- the importance of the funnel and the way that we're converting active members to buying members and increasing member buying frequency because our growth in apps actually over-indexed our overall digital growth, really referencing that -- that strength of -- of the consumer coming in. From a wholesale standpoint, the -- the momentum that we're seeing is -- is -- is strong retail sales from our wholesale partners to consumers.\n\nBut you'll recall that we've been starving the wholesale channel for six to eight quarters because of supply constraints. And so, as we had supply constraints, we were prioritizing adequate inventory levels within NIKE Direct. And so, we're seeing strong demand as we go back into our wholesale partners with available supply that's enabling us to increase our open to buy in that channel. And -- and as inventory supply becomes available on a -- on a -- on a greater basis than it was, we continue to see our partners pulling on the available inventory.\n\nSo, we're competing in that channel there. It's an important channel for us to win in. And really, for the first time in six quarters or so, we can finally supply the channel against the level of demand we believe is there.\n\nOperator\n\nThank you. We'll take our next question now from Kate McShane of Goldman Sachs.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nGood afternoon. This is Brooke Roach filling in for Kate. Thank you so much for taking our question. John, I wanted to ask you a little bit about what you think the next phase of the membership journey for NIKE would look like following the successes achieved with that program to date.\n\nAnd then, perhaps more near-term, how much of the strength of NIKE Digital that you're seeing today is due to underlying full-price selling, and how much of that may be driven by increased step-up promotions driving the consumer to convert at a higher rate? Thank you.\n\nJohn Donahoe -- President and Chief Executive Officer\n\nWell on membership, the way we think about membership is along the full funnel. And so, you know, the first thing I'll say about that I think is a -- is a really important dimension of membership, is membership is no longer just something that happens in NIKE channels. Having connected membership with our strategic wholesale partners now allows the consumer to have a member experience regardless of where they shop. It allows our wholesale partners to -- to have the same advantages that we have by knowing who the consumer is, what they've bought, and being able to serve them in a more personalized way.\n\nAnd so, I would say we're still in the relative early innings of what we believe we can do on the membership -- on the membership front. We have 160 million active -- active members. We're working on engaging them more frequently, whether it's through NIKE Training Club, NIKE Run Club, the SNKRS app, where it's more than just what they buy, but it's their engagement. We think there's a lot of content that we can be bringing to those members.\n\nSo, you're going to see some, I think, interesting announcements in the coming -- coming weeks about -- about partnerships and things we're doing to drive engagement across NIKE members. And then, down to the bottom of the funnel, it's making sure we're getting them, as I say repeatedly, what they want, when they want it, how they want it, knowing -- knowing what -- what products they want, making sure they have the best possible experiences, making sure that repeat buying is made easy and convenient. I would say the supply chain dimension to what we've been doing with our membership is just phenomenal, having gone from 10% digital to 27%, delivering fast delivery times; fewer, reduced, and split shipments. And so, it's really -- it's really kind of a holistic approach and where we're going to just keep -- keep leveraging that and keep building upon that.\n\nAs I said, I think we're in the relatively early days. And then, our digital growth I think is a function of having the best apps in the industry or on the home screen of people's mobile apps, which is, you know, that scarce and valuable real estate. And we have a really clean experience across our apps and digitally, including nike.com. So, there's -- you know, we have good full price realization.\n\nAnd when we need to move things, we move it through discounting. And so, it obviously varies by product category and varies by time. But the quality of the business through NIKE Digital is among the highest quality that we have across any channel.\n\nMatt Friend -- Chief Financial Officer\n\nYeah, when you compare this quarter to last year, our inventory supply was so lean that, last year, we saw extraordinary levels of full-price realization through our digital channel and the lowest levels of discounts that we've ever experienced in running that channel. So, we expected that to normalize in this fiscal year and with where inventory is broadly across the marketplace, that the environment is definitely more promotional. But as John mentioned, when we look at our most important product franchises, we continue to see strong full-price realization in our own channels and in wholesale. And I'd say that the -- the other thing that we focused on this quarter was leveraging our investment in markdown to drive new member acquisition and to increase loyalty from our existing members.\n\nAnd we were able to accomplish that this quarter.\n\nOperator\n\nThank you. We take our next question now from Tom Nikic at Wedbush Securities.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nHi, everybody. You know, thanks for -- thanks for taking my question. I wanted to talk about China. So, you know, obviously, we're turning to growth, you know, in a pretty challenging environment, you know, fairly encouraging.\n\nYou know, how do we think about the path forward in -- in China from here? I know you mentioned that inventory is much cleaner in China now. So, should we think that, you know, you're kind of back to a pull market in China, you know, you should be able to sort of build off the momentum you've you've had this quarter, or just -- just how do we kind of think about the path forward in China from here?\n\nJohn Donahoe -- President and Chief Executive Officer\n\nYeah, Tom, well, maybe I'll take a piece of it. And then, Matt, you can comment as well because it's such an important topic. You know, you heard both of us talk about that -- that given all the short-, medium-term challenges, we are very pleased with the results in China this quarter. And the thing that we've been really focused on is the consumer, the Chinese consumer, and their connection to the NIKE, Jordan, and Converse brands.\n\nAnd the 11.11 holiday was one that we focused on a lot because it's really, in many ways, the first time in over two years that we could fully compete. We had the supply of the right product, including some of our hottest global and local product. We had a full local marketing capability going full stream, and we had our kind of entire offense. And the results of the 11 on the holiday were quite strong, both versus what our plan was and versus competition.\n\nYou know, we had mid-teens growth overall. We've been very focused on youth in China, the young consumer, both kids and Gen Z. You heard Matt say our Gen Z grew 45% in demand on Tmall through -- through 11.11. And as I said in my script, we're No.\n\n1 in traffic and brand and flagship and member acquisition, and the quality of that growth is quite strong. Underneath that, when you look at the Jordan brand, you look at -- I mentioned the LeBron 20, great full-price realization. So, we felt very good about the consumer fully back with NIKE, with Jordan, our ability to compete with both global and local competition, and we take that into the coming quarters.\n\nMatt Friend -- Chief Financial Officer\n\nYeah, and I just would comment on inventory. You know, we set a goal two quarters ago to be clean by the end of the second quarter. And we -- we reduced our buys, and we focused on -- on -- on moving through the excess inventory that we had. And so, we're incredibly pleased with the results that our team has delivered through the end of this quarter.\n\nWe think it puts us in a position of strength relative to the marketplace to be clean and to be ready to face whatever uncertainties are in front of us. I obviously mentioned that we had 1,500 of our stores closed in the last week in November. That was roughly five times the number of stores that were closed on average throughout the entire quarter. And -- and we also saw traffic impacts as the country navigates through this transition of its COVID policy.\n\nSo, we've taken a very cautious approach in our guidance to China given the short-term uncertainties that are there. But what you should be hearing from us is a consistent trend of confidence and encouragement in the consumer connections that we're creating that give us confidence in the long term.\n\nOperator\n\nThank you. We'll take our next question now from Adrienne Yih of Barclays.\n\nAdrienne Yih -- Barclays -- Analyst\n\nThank you very much. Good afternoon and congratulations, really an amazing quarter. My question is on Greater China. Obviously, this is the first quarter we're now starting to see that constant currency growth.\n\nSo, very happy to see that inflection. What have you seen sort of, you know, after the quarter as things have opened up even more sort of in the December time frame? And does it give you any -- you have any -- any more kind of solid thoughts on sort of what's the growth algorithm could look like maybe 2023 and beyond, or still very much too early? Last question is, when does -- that Shenzhen Tech Center, I believe it -- is it open now? And when is it starting to put forth that -- that China-specific product? Thank you very much.\n\nMatt Friend -- Chief Financial Officer\n\nSure, Adrienne. On the -- on your first question, I think I answered it in the last -- in the last question. But as it relates to our performance this quarter and how we're planning for the second half of this year, we've obviously been monitoring the China marketplace very carefully given the COVID-related disruptions that we've been experiencing. You sort of gone from one policy in terms of the way that the marketplace is being managed and to control the spread of the virus to this new -- this new approach.\n\nAnd I referenced the door closures that we saw at the end of -- at the end of the quarter. As it relates to our guidance and our expectations, I guess what I can say is that, you know, we're taking a very careful approach. You know, we have a lot of empathy for the consumers in terms of what they're going through in that environment. And we're watching traffic closely.\n\nBut having inventory cleaned at the end of the second quarter really gives us a position of strength to deal with whatever uncertainties that are in front of us. As far as the longer term goes, you know, it's a little bit too early to tell except, you know, we continue to think about the encouraging signs that we're seeing from a consumer perspective. And as John mentioned, 11.11 was really one of the first moments in several years that we felt like we were able to line the complete offense up in order to be able to engage across products -- product engines, gender, and brands. And we saw very strong consumer response.\n\nAnd so, when we look at the underlying macro drivers long term of the consumer -- consumer interest in sport, health in Greater China, we continue to view it as a -- as a growth driver for our business long term.\n\nOperator\n\nThank you. We'll move next now to Abbie Zvejnieks at Piper Sandler.\n\nAbbie Zvejnieks -- Piper Sandler -- Analyst\n\nGreat. Thanks so much for taking my question. Looking at the strength in wholesale -- and I know you said there was better inventory availability to ship through those wholesale channels -- but can you just talk about how you're viewing the wholesale channel, considering your direct strategy? And, you know, with that growth, did you enter or reenter any new doors, or was this growth mainly within those current partners you've already talked about? Thanks.\n\nJohn Donahoe -- President and Chief Executive Officer\n\nYeah, Abbie, the strategy remains very much the same. And as I mentioned repeatedly, it's consumer driven. It is -- it's consumers in this day and age who want to get what they want, when they want it, how they want it, and they want a consistent and seamless experience from us. The same consumers shop online and offline.\n\nThe same consumers shop model brand and multi-brand through different occasions. And so, our whole strategy is to offer them that choice in a seamless and premium way. And then, wholesale plays a very important part of that, right? It provides a very strong footprint, both physical footprint, as well as digital. And we mentioned last quarter, we had our -- our wholesale partners on campus in September for the first time in three years and expose them to our product innovation pipeline and just talked about how working together we can really serve that consumer through connected membership.\n\nAnd those conversations have just gone great. For instance, this quarter, we spent a lot of time with Mary Dillon and her team at Foot Locker, talking about how the next -- the next phase of growth for us can jointly be great around real opportunities of -- of -- of basketball and sneaker culture and kids. And so, there's a lot of excitement, I would say, with our wholesale partners and what we can accomplish together, and particularly through a connected membership environment, which allows us to serve our mutual consumers in a -- in a -- in a better way.\n\nMatt Friend -- Chief Financial Officer\n\nYeah. And I would just say that, from a revenue growth perspective, we think this quarter was clearly a peak in terms of year-over-year revenue growth in the channel. And that's primarily driven by timing -- timing implications. There's the prior-year comparison because we were low on available inventory for the wholesale channel, which depressed our growth in the prior year.\n\nAnd secondly, because we're seeing current season product becoming available earlier, we saw a stronger pull of shipments from Q3 into Q2 into -- into our revenue growth this quarter. And I think that's indicative of the demand that we're seeing and the strong sell-through that we're seeing through -- to the -- to the consumer. So, we continue to view this channel as being a channel that will drive growth. But for the balance of this year, the comparisons are going to be -- are going to be difficult to understand when compared to the prior year due to the -- the -- the supply constraints we had in the prior year.\n\nOperator\n\nThank you. We'll go next now to John Kernan at Cowen.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nExcellent. Congrats on a nice quarter and the acceleration. Just, Matt, as we look at the constant-currency revenue guidance implied for the back half of the year, it does assume a bit of a deceleration. Just talk about some of the assumptions regarding the macro.\n\nAnd is there a level of conservatism as you look in the back half of the year?\n\nMatt Friend -- Chief Financial Officer\n\nSure, John. Well, first, I'd say, you know, we raised our guidance to low teens on a currency-neutral basis, really reflecting the accelerating brand momentum that we saw in August, carrying through back to school into September, and then accelerating through the holiday season and even the first couple of weeks of December. And so, we do have confidence, as we're looking in the near term, that the consumer continues to be uniquely interested in NIKE, Jordan, and Converse, and it's fueling our growth. What I said last quarter is still true, though, which is that we -- we were concerned about the macro uncertainty and the indicators that we're seeing more broadly for the consumer.\n\nAnd while, over the last 90 days, we've seen strength, those macro concerns have not abated. They're still there for the consumer. And so, we continue to take a cautious approach to the second half. We buy our inventory, as you know, on six-month lead times.\n\nAnd so, we took some decisions in light of the inventory -- our inventory position at the end of Q1 to reduce our buys for the second half of the year. And we focused those reductions in -- in places where we had excess inventory, but we preserved the strength of our product franchises and the new innovation that John referenced earlier in the call that's going to be coming to market in the second half and in the beginning of '23. So, you know, we continue to take a cautious approach as we look at it. And to the extent that consumer demand continues to be strong with the supply chain that -- that's -- that's providing products in a more predictable manner, in a more timely manner, if we ended up overcorrecting on our buys, then we will -- we will chase demand as we -- as we exit this year and enter into fiscal year '24.\n\nOperator\n\nThank you. And ladies and gentlemen, we have time for one further question this afternoon, and we'll take that from Michael Binetti at Credit Suisse.\n\nMike Binetti -- Credit Suisse -- Analyst\n\nHey, guys. Thanks for getting us in here. Congrats on a great quarter, I know is a lot of heavy lifting. And maybe a simple question, but, you know, how do you feel on North America inventory in the channel? I know you moved the mountain, but you know, you have a big wholesale business.\n\nIt's hard for us to track inventory once it leaves your books. Are we past the peak promotions in the U.S., which is the highest level of promotions, in your -- in your view? It would seem so based on some of the inventory comments you gave on the U.S. I just wanted to check that. And then, I guess as you start to come out of some of the recent volatility, maybe you can help us connect back to your longer-term targets, in particular, the path to the high teens EBIT margins and the major input to getting there, the DTC versus wholesale transition, since we don't get many numbers reported on the margins between those two channels.\n\nHow would you tell us to think about building our understanding into how you get there from here? Because that seems, like, the next part of the NIKE story.\n\nMatt Friend -- Chief Financial Officer\n\nSure, Michael. Well, as it relates to North America and the marketplace, you know, we -- we -- we're seeing the momentum from a consumer perspective building across both channels over this holiday season. So, yes, promotional activity is higher than it was in the prior year. But we -- we do see strong full-price sales in footwear and in our seasonal inventory, and we see more promotional activity in areas that are -- where inventory has built and where there's is broader inventory availability in the marketplace.\n\nI think our focus continues to be in this environment on prioritizing our brand, getting to a healthy inventory position by the end of this fiscal year, which is why we've taken more aggressive action. But I think we've been -- we've been pleased at seeing the year-over-year ASP growth, not just in North America but across all our geographies, and high levels of full price realization in the areas where our consumers are most interested and it's hard to get access to the products that -- that they -- that they desire, which means that from a brand health perspective, even amid the promotions, the consumer continues to choose NIKE. As it relates to your question about the long-term margins, I guess, you know, the way that I think about it is we have structural drivers of profitability, and we have transitory impacts that we've been dealing with since the -- since fiscal '21. At this point in time, the transitory impacts roughly equate to about 350 basis points of -- of gross margin pressure, which directly drops to the EBIT margin.\n\nAnd those specifically relate to two successive years of elevated transit and freight costs, and then, secondarily, the costs to liquidate some of the excess inventory in North America. And -- and we do expect those to be transient or transitory. We should expect to start to see some recovery in fiscal year '24. We will give more detailed guidance on that in our normal course.\n\nBut -- but -- but those we do believe are -- are -- are recoverable. From a structural side, we have the same structural drivers that we've always had from a profitability perspective, and we continue to be focused on them. It starts with price value of our products and how we create value for consumers in the products that we make. You saw that we -- we increased prices by mid-single digits this quarter, and we continue to see that.\n\nSo long as that product is valued by the consumer, we've been able to stick those price increases in order to help offset, you know, growing input costs. There's cost initiatives in our FOBs that we're focused on. We have the shift toward NIKE Direct this quarter that didn't drive any benefit because we saw strong wholesale growth. But we do expect to see a benefit from a structural perspective as we continue to drive accelerated growth in NIKE Direct through our stores and through digital.\n\nWe continue to focus on supply chain efficiency opportunities, and then continuing to -- to drive higher full-price realization across the marketplace through better capabilities in demand and supply planning. So, you know, those -- those structural drivers, you know, we continue to believe are going to be accelerants for us. But given the size of the transitory impacts that we've dealt with over the past two years, it's really important that we drive focus and attention on -- on -- on recovery of -- of some of those elements. And, trust me, our teams are focused on it, and we believe those will be value drivers for us in the near term.\n\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\n\nAll right. Thank you, Michael, for the question, and everyone who was able to join in and participate in this call. We look forward to speaking with you next quarter. Happy holidays.\n\nJohn Donahoe -- President and Chief Executive Officer\n\nHappy holidays, everyone.\n\nDuration: 0 minutes\n\nPaul Trussell -- Vice President, Investor Relations and Strategic Finance\n\nJohn Donahoe -- President and Chief Executive Officer\n\nMatt Friend -- Chief Financial Officer\n\nJim Duffy -- Stifel Financial Corp. -- Analyst\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nAdrienne Yih -- Barclays -- Analyst\n\nAbbie Zvejnieks -- Piper Sandler -- Analyst\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nMike Binetti -- Credit Suisse -- Analyst\n\nMore NKE analysis\n\nAll earnings call transcripts"
}