{
  "companyName": "J.M. Smucker",
  "companyTicker": "SJM",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/jm-smucker-sjm-q1-2023-earnings-call-transcript/",
  "content": "J.M. Smucker (SJM -0.06%)\nQ1 2023 Earnings Call\nAug 23, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to The J. M. Smucker Company's fiscal 2023 first quarter earnings question-and-answer session. [Operator instructions] I will now turn the conference call over to Aaron Broholm, vice president, investor relations.\n\nPlease go ahead, sir.\n\nAaron Broholm -- Vice President, Investor Relations\n\nThank you, Kevin. Good morning, and thank you for joining our fiscal 2023 first quarter earnings question-and-answer session. I hope everyone has had a chance to review our results as detailed in this morning's press release and management's prepared remarks, which are available on our corporate website at jmsmucker.com. We will also post an audio replay of this call at the conclusion of this morning's Q&A session.\n\nDuring today's call, we may make forward-looking statements that reflect our current expectations about future plans and performance. These statements rely on assumptions and estimates. And actual results may differ materially due to risks and uncertainties. Additionally, we use non-GAAP results to evaluate performance internally.\n\nI encourage you to read the full disclosure concerning forward-looking statements and details on our non-GAAP measures in this morning's press release. Participating on this call are Mark Smucker, chair of the board, president and chief executive officer; and Tucker Marshall, chief financial officer. We will now open up the call for questions. Operator, please queue up the first question.\n\nOperator\n\n[Operator instructions] Our first question today comes from Andrew Lazar from Barclays. Your line is now live.\n\nAndrew Lazar -- Barclays -- Analyst\n\nGreat. Good morning. Thank you for the question.\n\nMark Smucker -- President and Chief Executive Officer\n\nGood morning, Andrew.\n\nTucker Marshall -- Chief Financial Officer\n\nGood morning.\n\nAndrew Lazar -- Barclays -- Analyst\n\nYou mentioned -- good morning. You mentioned some favorability in the commodity side for the full year versus expectations when you provided guidance last quarter. You know, the fact that you were able to raise the low end of your full year gross margin guidance as a result, you know, suggests that some of the benefit is expected to flow through, you know, maybe in contrast to what is kind of a prevailing concern among investors in the overall food space, you know, that margin recovery will essentially be promoted away, you know, under pressure from customers and others. So, I was hoping you could talk a little bit about your view on your margin progression as costs roll over, and if you still expect about a 15% benefit from price for the full year.\n\nThanks so much.\n\nTucker Marshall -- Chief Financial Officer\n\nAndrew, good morning. We are continuing to experience cost inflation that is having a mid- to high-teens impact on our cost of product goods sold. That is not a change from what we said in our initial outlook for this fiscal year. There are two areas that we continue to assess; one is the Jif impact is coming in better than anticipated, so that has supported our margin uplift from the bottom end of the range; and two, as we continue to manage costs within our overall infrastructure to the extent that we are able to in this environment.\n\nAs you have noted, we still anticipate 15 points of pricing for the full fiscal year. There is not a material change to that from our original guidance. And again, what we are carrying in from fiscal 2022 is about mid-single digits and actions that we have taken for the full benefit of fiscal 2023 is high-single digits as well on the pricing front.\n\nAndrew Lazar -- Barclays -- Analyst\n\nGot it. Thank you. And then just, I guess, as a quick follow-up. I noticed in the prepared remarks, you mentioned, when it's in the pet food space, there's sort of the concept of value, you know, a number of times.\n\nAnd I guess, I just wanted to get a sense from you on sort of what you are seeing on that front and maybe in past times of sort of macroeconomic stress on the consumer, what you have seen with respect to any trade down in pet? I guess, I was under the impression that, the, you know, growth obviously in the higher end was still pretty strong and consumers tend not to mess around with their pet food that often. So, any comments there would be helpful. Thank you.\n\nMark Smucker -- President and Chief Executive Officer\n\nYeah. Sure, Andrew. It's Mark. You know, when you think about just taking a real quick step back on our total portfolio, we participate, of course, in all segments of our categories, and that includes the entire value spectrum, if you will.\n\nAnd pet is no different. And so if you think about Milk-Bone and how Milk-Bone has outpaced the pet snacks segment, particularly in this last quarter and it actually gained share, that is driven both by some of the premiumization, the innovation that we have launched, but also just by base Milk-Bone, which is, quite frankly, a very affordable snack option for pets. And likewise, with Meow Mix having also taken the No. 1 spot in cat also, you know, meets the value equation for many consumers.\n\nSo, I think, you know, strategically, we want to continue to play across that spectrum in our categories and make sure that we are providing consumers with options.\n\nOperator\n\nThank you. Your next question is coming from Ken Goldman from J.P. Morgan. Your line is now live.\n\nUnknown speaker\n\nHi. This is [Inaudible] for Ken. Good morning.\n\nMark Smucker -- President and Chief Executive Officer\n\nGood morning.\n\nTucker Marshall -- Chief Financial Officer\n\nGood morning.\n\nUnknown speaker\n\nSo -- good morning. I wanted to ask about coffee. So, could you provide a little bit more color on why you are producing your expectations for growth for the year and then in the prepared remarks, you talked about volumes improving from here. So, what are you seeing that gives you confidence that they will and how much of that is driven by competitor actions versus things that are in your control, like, higher marketing and promotional spending? Thank you.\n\nMark Smucker -- President and Chief Executive Officer\n\nNora, it's Mark. I will start and Tucker may add. But, first of all, we are very pleased with our coffee performance. Again, it goes back to the comments I just made around Andrew's question.\n\nAnd, you know, we lead, so we did lead in taking price and that helped drive our dollar growth. And our dollar shares continue to be very strong across the coffee category. And although, we did anticipate some elasticity in the quarter, those were largely as expected as we are now seeing our competitors follow in pricing. And so as we move forward, we would continue to monitor very closely consumer behavior.\n\nBut we are encouraged by the fact that, you know, over 70% of cups consumed are still consumed at home. So, we still feel very good about our total coffee business, and we will continue to invest in it. We also noted, you know, the reinvestment in Folgers with a new advertising campaign to reinvigorate that brand as well. So, all signs are continuing to support the business and drive balanced growth.\n\nOperator\n\nThank you. Our next question is coming from Peter Galbo from Bank of America. Your line is now live.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Good morning. Thank you for taking the question.\n\nMark Smucker -- President and Chief Executive Officer\n\nGood morning.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nMark, maybe just to follow up on Andrew's question around pet food. I know you gave some comments on both treats and can food. You know, it seems like dog actually had a pretty solid quarter, I think, up 18%. So, if you can just comment there? I know you haven't put in the full brand refresh on Nutrish at this point, but just what you saw in dog specifically in the quarter in terms of trade-down and what you are expecting kind of over the balance of the year there? Thanks.\n\nMark Smucker -- President and Chief Executive Officer\n\nSure, Peter. Thanks a lot. So, in dog food, you know, I think, what you are seeing is, obviously, a very good quarter overall on dog food and that does include Nutrish and Kibbles 'N Bits. And part of that is really our efforts to stabilize our dog food portfolio, which we have talked that our priorities, first and foremost, snacks and cat.\n\nBut then stabilizing dog food has been a priority that includes optimizing the -- our offerings and making sure that we have a narrower but clearer set of offerings for the consumer. So, a lot of that is now in markets. There have also been a lot of supply disruptions across the entire dog food industry and that is not unique to Smucker. And part of our results there have us been benefiting from some of that supply disruption in terms of how we have been able to manage through and ensure that we are meeting demand.\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nGot it. That's helpful. Thanks, Mark. And then, Tucker, just -- I have gotten a couple of questions on this morning, but just wanted to understand the moving pieces on Jif.\n\nYou know, there was a pretty meaningful insurance recovery in the quarter. I believe that was contemplated already in the prior $0.90 guide that you had given, but just wanted to clarify that? And then just on the move from, I guess, $0.90 to $0.80, it seems like things have come back faster. I think there were $0.65 impact in the first quarter, so maybe a little bit still into 2Q. But just anything else you can help us to understand on the second quarter as it relates to Jif and then maybe just the quarter overall? Thanks.\n\nTucker Marshall -- Chief Financial Officer\n\nYeah. Absolutely. So, as you know, we came into the fiscal year with a $0.90 impact associated with the Jif peanut butter recall. That estimate is now $0.80.\n\nWe did have the opportunity to come back faster both from a manufacturing standpoint and then beginning to refill the shelves at the respective retailers and so we were able to see benefit, which enabled us to reduce from $0.90 to $0.80. To your point, we did contemplate in the estimate -- the anticipated insurance recovery. Folks may be reading the income statement classification of where that recovery resides, but it was always contemplated in the estimate. To your point, we had a $0.65 impact in Q1.\n\nTherefore, we have about $0.15 left to go in Q2 and a little bit into Q3. But again, nothing material beyond the first quarter.\n\nOperator\n\nThank you. Next question is coming from Chris Growe from Stifel. Your line is now live.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nHi. Good morning.\n\nMark Smucker -- President and Chief Executive Officer\n\nGood morning.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nHi. I just want to follow on quickly on that Jif discussion. And just to be clear, on the first quarter, do you have insurance recovery that is incorporated into that $0.65 figure? And is there more insurance recovery to come throughout the year? I just wanted to make sure we get a sense of how that's going to play out in the coming quarters.\n\nTucker Marshall -- Chief Financial Officer\n\nChris, the $0.65 impact in the quarter did have the anticipated insurance recovery. There's still a $0.15 exposure in Q2 and Q3.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nOK. And no further insurance recovery as best as you know, is that fair to say?\n\nTucker Marshall -- Chief Financial Officer\n\nCorrect. We have factored in --\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nYeah. OK.\n\nTucker Marshall -- Chief Financial Officer\n\nWhat we believe is the appropriate factor for the insurance recovery and our total $0.80 estimates. Again, the predominance that came through in Q1. And I just acknowledged to you that the impact was against the $0.65.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nOK. That makes sense. Thank you. And then I just had one other question on Uncrustables.\n\nAnd I think you -- you do expect -- the growth to pick up throughout the quarter, you expect it to improve as we go through the year. In fact, it's picked up quite dramatically. Do you have the kind of supply chain challenges there mostly out of the way? And from here, it's just a matter of continuing to grow as the brand would grow? And then I know you have Longmont, you know, capacity coming online later this year. Should that help accelerate the growth even further from what we are seeing today?\n\nMark Smucker -- President and Chief Executive Officer\n\nChris, it's Mark. Yes. We're still very bullish on Uncrustables. And everything related to it in terms of production remains on track.\n\nYou know, we are finishing the Longmont expansion, that's the Denver facility. And we are well underway in construction of the McCalla, which is Alabama facility. And so, all of that -- you know, remember, McCalla is not going to come online for a couple of years. But all of the efficiency improvements that we have seen in Kentucky, as well as Longmont are going to support us meeting demand.\n\nSo, although, we are not quite meeting demand, in other words, supply is not quite caught up with demand, all of the work on production is intended to do so over time. And we do expect that we have, again, significant runway and the ability to get that brand to $1 billion over time.\n\nOperator\n\nThank you. Our next question is coming from Robert Moskow from Credit Suisse. Your line is now live.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHey. A couple of questions. I want to make sure I understand the assumptions for profit growth for the rest of the year. From what I can tell, you are assuming kind of flattish operating profit, maybe even down a little bit for the next few quarters.\n\nAnd I just want to make sure I am doing the math right. Is that true? But, you know, especially given, you know, first quarter, it looks like your profit would have been well ahead of last year ex the Jif recall. And then a quick follow-up.\n\nTucker Marshall -- Chief Financial Officer\n\nRob, good morning. We brought the guidance range at the midpoint up $0.35. About $0.10 of that is coming from volume mix, about $0.15 of that is coming from cost of products sold. But then embedded in that first $0.25 is the $0.10 benefit from the Jif estimate going from $0.90 to $0.80.\n\nAnd then you have got about $0.10 of SG&A that comprises your $0.35. In terms of the flows, as you think about for the rest of the year, maybe we can follow up with that offline and help you with your flows. But that is how we are seeing the earnings construction from going from 8.05 at midpoint to currently 8.40. And then I would just lastly acknowledge that, as we continue to see the pet momentum continue through the balance of the year, as we continue to see consumer momentum inclusive of Jif recovery and the international Away From Home momentum, and then that's being partially offset by coffee top-line momentum.\n\nSo, just to give you a sense of how we are thinking about both bottom line and top line.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. And maybe more specific then, in the retail consumer foods segment, your profit was down about 65 million versus a year ago, but the 90 of that was the Jif recall. So, is this division's profit well ahead -- tracking well ahead of a year ago, ex the recall? And therefore, should we assume a higher -- a profit growth commensurate with that in this division for the rest of the year?\n\nTucker Marshall -- Chief Financial Officer\n\nYes. The profit growth should pick up on a sequential basis in the second, third and fourth quarters, as it gets beyond the first quarter impact associated with the Jif peanut butter recall.\n\nOperator\n\nThank you. Our next question is coming from Jason English from Goldman Sachs. Your line is now live.\n\nJason English -- Goldman Sachs -- Analyst\n\nHey. Good morning, folks.\n\nMark Smucker -- President and Chief Executive Officer\n\nGood morning.\n\nJason English -- Goldman Sachs -- Analyst\n\nTwo quick questions. Hey, there. So, since you last reported you guys filed your K, and in there, it revealed that your advertising spend was down around 21% last year. Given that you are over delivering so far, why not take some of the over delivery and reinvest back into advertising?\n\nTucker Marshall -- Chief Financial Officer\n\nYeah. Why don't I start just with our assumption around marketing spend for the fiscal year. So, we did experience some SG&A favorability in the first quarter associated with marketing. However, we remain committed to spending the dollars that we planned at the beginning of the year and are still maintaining our guidance of 5.5% of net sales spend against our brands.\n\nWe believe it's important for the ongoing reinvestment and growth of those brands and overall health and profitability of the company.\n\nMark Smucker -- President and Chief Executive Officer\n\nHey, Jason. It's Mark. I would just reinforce that we are committed to spending the dollars. And some of the dollars, they are going to flow through later in the year.\n\nAnd, you know, just keep in mind that because pricing is up and inflation has driven up top line to some degree, that would slightly mute the dollars as a percent of net sales. But rest assured that our commitment to continue to invest in our brands is solid. And the efficiencies, in other words, the bang for our buck that we are getting by getting more efficient on some of our marketing spend, is also helping deliver good results against brand investment.\n\nJason English -- Goldman Sachs -- Analyst\n\nOK. OK. And back to the question on coffee and why you expect volume to get better. I don't think I was -- I didn't walk away, feel like I had a lot of clarity on the answer there.\n\nSo, is -- I will ask a more direct question. Is it because you expect competitors to follow, therefore closing the price gaps? And if that's the answer, are you seeing it happen already? Or is it because you are expecting to maybe feather in some promotions to dampen those price gaps? And if so, what's the timing and cadence of that?\n\nMark Smucker -- President and Chief Executive Officer\n\nIt's more the former. It's more of the fact that we are seeing competitors follow. We manage price through a number of levers as you are well aware of, whether that's trade and whatnot. So, we have -- of course, our normal promotions planned through the holiday period.\n\nThose will continue to support the brand. But we do expect competitors to continue to follow our lead.\n\nOperator\n\nThank you. Next question is coming from Pamela Kaufman from Morgan Stanley. Your line is now live.\n\nPam Kaufman -- Morgan Stanley -- Analyst\n\nHi. Good morning.\n\nMark Smucker -- President and Chief Executive Officer\n\nGood morning.\n\nPam Kaufman -- Morgan Stanley -- Analyst\n\nSo, I just had a question on pricing and whether you have implemented all of your planned pricing actions for the year in the market, or is there going to be further pricing that comes through? And if so, in which categories will there be incremental pricing?\n\nMark Smucker -- President and Chief Executive Officer\n\nPam, we generally have implemented a majority of our pricing, but we still are in an inflationary environment. So, it remains to be seen if -- I would never use the word finished. And you will recall that when we do move price, we have consistent -- been consistent in moving price both up and down depending on our delivered costs. Obviously, it's been more up in the last year or so.\n\nBut we do believe that we have taken a majority of it. And we will watch carefully as we consider whether or not there may be further pricing required in the coming quarters.\n\nTucker Marshall -- Chief Financial Officer\n\nAnd, Pam, I would just acknowledge that our guidance reflects the pricing actions that we took in the spring timeframe in support of recovering the cost inflation in order to deliver our fiscal year.\n\nPam Kaufman -- Morgan Stanley -- Analyst\n\nOK. Thanks. That's helpful. And then my second question is just an update on your M&A strategy, given your comments earlier this year about your interest in potential acquisitions, where does this stand? Have you been evaluating any potential acquisitions? And can you remind us what the criteria is and if that's changed at all?\n\nMark Smucker -- President and Chief Executive Officer\n\nSure. The criteria hasn't changed. And I am happy to refresh our collective memory on that. The short answer to your question is always have lines in the water, constantly evaluating opportunities that come across our desks.\n\nBut, again, we want to invest in businesses and do it in a prudent way that will generate a good return. So, clearly, that is one of our key priorities. And as we have articulated over the last several quarters, we are interested in acquisitions that would add to our existing portfolio in our existing categories that would potentially round out our portfolio in coffee. Potentially our portfolio in pet snacks would be of interest.\n\nWe could be interested in more significant or meaningful acquisitions as well. To the extent that we are looking at newer categories or categories that we don't participate in, we have tried to be clear that we would not enter a new category unless we have the ability to acquire a meaningful or leadership position in those categories. So, it's quite simply meaningful leadership positions or rounding out our existing portfolio.\n\nOperator\n\nThank you. Our next question is coming from Cody Ross from UBS. Your line is now live.\n\nCody Ross -- UBS -- Analyst\n\nHi, there. Thank you for taking our questions.\n\nMark Smucker -- President and Chief Executive Officer\n\nGood morning.\n\nCody Ross -- UBS -- Analyst\n\nI just want to touch a little bit on pet. Pet has seen nice acceleration here, organic sales in the mid-teens. Did you have any benefit from inventory replenishment in the quarter stemming from your supply chain headwinds? And can you discuss what you are seeing from a market share perspective? Thanks.\n\nMark Smucker -- President and Chief Executive Officer\n\nThe answer to the first question is no.\n\nCody Ross -- UBS -- Analyst\n\nOK.\n\nMark Smucker -- President and Chief Executive Officer\n\nAnd the second part of your question, I'm sorry, Cody, was around market share? We have seen good share growth. Clearly, Milk-Bone and Meow Mix are, again, our areas of focus. Very pleased with the results there. About a full share point on Milk-Bone and continued share growth on Meow Mix.\n\nSo, really pleased, again, with the way our investments are playing out in those two segments. And then we spoke earlier just about dog food and our efforts there to stabilize that business.\n\nCody Ross -- UBS -- Analyst\n\nThank you for that. That's helpful. And then I just want to go back to one of Tucker's comments earlier about your revised EPS guide. You mentioned that SG&A is adding about $0.10 to your higher EPS outlook.\n\nCan you just provide more details about what's different today in your SG&A outlook versus prior? Thank you.\n\nTucker Marshall -- Chief Financial Officer\n\nSo, Cody, what's consistent is our reinvestment in the business of maintaining 5.5% of marketing spend as a percentage of net sales. So, there's no change there. Rather, what we are seeing in SG&A is just some favorability on the discretionary side that came through in the first quarter and how we want to continue that trend or trajectory through the balance of the year.\n\nOperator\n\nThank you. Our next question is coming from Alexia Howard from Bernstein. Your line is now live.\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nGood morning, everyone.\n\nMark Smucker -- President and Chief Executive Officer\n\nGood morning.\n\nTucker Marshall -- Chief Financial Officer\n\nGood morning.\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nOK. So, can I ask about retailer inventory levels? We have seen varying comments from different companies about whether the retailers have been holding safety stock and it needs to be run down. Or conversely, if service levels have been low, there may be a need to run it up. So, where do you guys sit across the portfolio? And is there a need to -- for retailer inventory levels to shift over the next couple of quarters?\n\nMark Smucker -- President and Chief Executive Officer\n\nAlexia, we really have not seen anything out of the ordinary on inventory levels on our businesses. So, for us it's pretty much business as usual.\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nGreat. Thank you very much. And then in the prepared remarks, I think, you made a comment that, obviously, the consumer environment is evolving. Could you just hit the high notes of what the key consumerships that you are working your way through are right now, and I will pass it on.\n\nThank you.\n\nMark Smucker -- President and Chief Executive Officer\n\nYeah. You know, there's a lot -- been a lot in the press in the media just around consumer sentiment and being a little bit more cautious. You know, we have seen a bit of that. I think if you look at our categories, they tend to be more resilient than the broader center of store categories.\n\nAnd so, we have benefited from that. Similarly, there's been, you know, some discussions around private label and this notion of trading down. My response to that would be twofold; number one, again, this notion of making sure we're offering brands across the entire spectrum of value. And although you have seen some private label share growth, that is pretty normal in these times, and it is not back to pre-pandemic levels.\n\nSo, although there is a little bit of -- there is some shifting in the categories, I would just point to the fact that our categories are resilient. And we will continue to invest in our brands.\n\nOperator\n\nThank you. Next question is coming from Scott Mushkin from R5 Capital. Your line is now live.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nThanks, guys. Thanks for taking my question. I actually wanted to clarify some of the comments around the pet food area. So, I think it was mentioned before that, you know, there were some out of stock issues.\n\nI guess, that's with competitors. Is that what I am taking? Because I think, you guys said you are fine on the inventory perspective and people haven't been replenishing. Did I get that correct?\n\nMark Smucker -- President and Chief Executive Officer\n\nWhat I said earlier, Scott, was that there have been broad supply chain challenges in the pet space, largely because pet products are formulated food which have a lot of input, a lot of ingredients. And that makes the supply chain a bit more complicated. And so, that has affected the industry broadly. But where we are very pleased is our ability to have -- having managed through a lot of those challenges and allowed us, and only just speaking for ourselves, to stay on shelf and in supply.\n\nScott Mushkin -- R5 Capital -- Analyst\n\nOK. That's actually -- that's a good clarification. Appreciate it. Then I wanted to ask company a little bit, you know, long-ranging.\n\nI have been talking to some of the distributors about, you know, what's going to happen here as maybe inflation cools off, as you guys think out next year, the year after. How do you guys think about that and how your businesses would look if we got a retrenchment that way? Nothing is going to happen, but if it did, if it were to happen? Thanks.\n\nMark Smucker -- President and Chief Executive Officer\n\nWell, first of all, it's hard to say. We -- a little relief would be great. But, you know, we -- my answer to that question, Scott, would simply be that we have been always prudent and disciplined about when we take cost up. And we would similar -- similarly be very prudent and disciplined if we had to lower prices over time.\n\nBut at this point, because it's still volatile, there's a lot of unknowns in the marketplace. We can't really provide any more color than that.\n\nTucker Marshall -- Chief Financial Officer\n\nScott, I would also add that, we remain committed to the profitability and margin profile of our brands and business. And so, as we continue to navigate this inflationary environment, as we continue to move forward, we will continue to reinvest in those brands on behalf of our business. And we'll continue to think through what ongoing continuous improvement or productivity programs will also mean sort of long-term health and strategy of the company.\n\nOperator\n\nThank you. Next question is coming from Rebecca Scheuneman from Morningstar. Your line is now live.\n\nRebecca Scheuneman -- Morningstar -- Analyst\n\nGreat. Good morning, and thanks for the question. So, my first question has to do with coffee margins. I think that they were down about 350 basis points in the quarter.\n\nThat was quite a bit more than I expected, obviously. I know that there's some volume issues there. But you had also mentioned that you are investing in Folgers marketing. So, I am just kind of wondering, like, as we look at the year, you know, and even if volumes, you know, start to perform better there, should we still expect those margins to be lower year on year, given the increases in marketing?\n\nTucker Marshall -- Chief Financial Officer\n\nSo, the coffee story is one of cost inflation that has needed to be recovered on a dollar-for-dollar basis. And this first quarter is our largest cost component or cost basket. So, that is really what is driving the year-over-year margin pressure. But as we move sequentially through the balance of the fiscal year, we would anticipate that our coffee margins improve.\n\nBut getting them back to the historical 30-plus percent level will still take us some time as we navigate this inflationary environment.\n\nRebecca Scheuneman -- Morningstar -- Analyst\n\nOK. Great. Thank you. And then my second question is about dog food.\n\nYou had mentioned either in the press release or the prepared comments that you think dog food is well-positioned for evolving consumer habits. I believe what you are referring to there is, kind of given inflation, you could see some consumers trading down from the premium and super premium to more of the mid-tier. First of all, is that what you are referring to? And if so, are you seeing that yet? Or is that something that you just anticipate you could be seeing? Thank you.\n\nMark Smucker -- President and Chief Executive Officer\n\nRebecca, there's a little bit of that. There's a little bit of trading down. You know, we -- again, going back to some of my earlier comments about making sure we are providing value to the consumer, the benefit to our dog food business this quarter is, again, around the fact that we have done a lot of work to stabilize the business, make sure that we are managing through the supply constraints. And we have benefited in that regard because we have done a good job of managing through some of the supply issues.\n\nAnd then, thirdly, there is a bit of the trading into our brands.\n\nRebecca Scheuneman -- Morningstar -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. We have reached the end of our question-and-answer session. I will now turn the call back to management to conclude.\n\nMark Smucker -- President and Chief Executive Officer\n\nWell, I want to thank everyone for your time joining us this morning. And, you know, as always, our results were made possible by our outstanding team, our employees. And I really want to just thank them for their discipline and hard work and dedication to our company and our brands. And we hope to see many of you in Boston at the Barclays Global Consumer Staples Conference in a couple of weeks.\n\nAnd there will be a live webcast of our presentation on September 6th at 2:15, and you can access that from our investor relations website. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAaron Broholm -- Vice President, Investor Relations\n\nAndrew Lazar -- Barclays -- Analyst\n\nMark Smucker -- President and Chief Executive Officer\n\nTucker Marshall -- Chief Financial Officer\n\nUnknown speaker\n\nPeter Galbo -- Bank of America Merrill Lynch -- Analyst\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nJason English -- Goldman Sachs -- Analyst\n\nPam Kaufman -- Morgan Stanley -- Analyst\n\nCody Ross -- UBS -- Analyst\n\nAlexia Howard -- AllianceBernstein -- Analyst\n\nScott Mushkin -- R5 Capital -- Analyst\n\nRebecca Scheuneman -- Morningstar -- Analyst\n\nMore SJM analysis\n\nAll earnings call transcripts"
}