{
  "companyName": "DaVita",
  "companyTicker": "DVA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/davita-dva-q3-2022-earnings-call-transcript/",
  "content": "DaVita (DVA -0.72%)\nQ3 2022 Earnings Call\nOct 28, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Amanda, and I will be your conference facilitator today. At this time, I would like to welcome everyone to the DaVita third-quarter 2022 earnings call. [Operator instructions] Thank you.\n\nMr. Ackerman, you may begin your conference.\n\nJoel Ackerman -- Chief Financial Officer\n\nThank you. And welcome, everyone, to our third quarter conference call. We appreciate your continued interest in our company. I am Joel Ackerman, CFO and treasurer.\n\nAnd joining me today is Javier Rodriguez, our CEO. Please note that during this call, we may make forward-looking statements within the meaning of the federal securities laws. All of these statements are subject to known and unknown risks and uncertainties that could cause the actual results to differ materially from those described in the forward-looking statements. For further details concerning these risks and uncertainties, please refer to our third quarter earnings press release and our SEC filings, including our most recent annual report on Form 10-K, and all subsequent quarterly reports on Form 10-Q, and other subsequent filings that we make with the SEC.\n\nOur forward-looking statements are based on information currently available to us, and we do not intend and undertake no duty to update these statements, except as may be required by law. Additionally, we'd like to remind you that during this call, we will discuss some non-GAAP financial measures. A reconciliation of these non-GAAP measures to the most comparable GAAP financial measures is included in our earnings press release, furnished to the SEC, and available on our website. I will now turn the call over to Javier Rodriguez.\n\nJavier Rodriguez -- Chief Executive Officer\n\nThank you, Joel. Good morning, everyone, and thank you for joining our call today. Q3 was a challenging quarter for us. While natural COVID statistics have been declining, the cumulative impact of COVID on the ESKD patient community continues to grow.\n\nDespite the economic challenges, we continue to deliver high-quality clinical care for our patients. We remain incredibly grateful for the amazing work of our frontline teammates who are unrelenting in their focus on caring for our patients. While our commitment to patients is a constant, it is particularly highlighted when a community is in need. As you know, on September 28, Hurricane Ian made landfall in southwest Florida, subjecting the community to sustain 100-plus mile-per-hour wind and significant flooding.\n\nThis led to many health and safety issues for the people in the area, especially people who require life-sustaining dialysis treatment. DaVita operates 230 dialysis centers in Florida with approximately 14,000 patients and 3,250 teammates. Through our comprehensive preparedness planning, I'm grateful that 100% of our patients were accounted for, and all had received dialysis within days of landfall of the hurricane. We deployed water tankers, generators, fuel tankers to quickly restore operations in affected areas as well as provide dialysis to patients from across the kidney care community.\n\nNow turning to our financial results. As I mentioned, it was a challenging quarter. For Q3, our adjusted operating income was $351 million, and adjusted earnings per share was $1.45. Adjusted operating income was down sequentially by $88 million from Q2 and was below our expectations for the quarter.\n\nThe headwinds in volumes have persisted longer than we assumed, and contract labor costs and productivity did not begin to improve in the quarter as we had expected. We are now assuming these pressures will continue longer than previously anticipated. As a result, and given the continued uncertainty from COVID and the labor market, we are lowering our guidance for the year and our outlook for 2023 as well. We are reducing our 2022 adjusted operating income guidance to a range of $1.375 billion to $1.45 billion, and our 2022 adjusted EPS guidance to $6.20 to $6.70 per share.\n\nFor 2023, we're updating our outlook for year-over-year adjusted operating income growth to negative $50 million to positive $150 million, as outlined in our press release for this quarter. As we have said in the past, volume and labor continue to be the biggest drivers of uncertainty in our results. Let me walk you through the details on what we have seen on each of these and what we're assuming going forward. Let's start with the three main drivers of volume: census growth before excess mortality, missed treatment rates, and excess mortality.\n\nI will cover each of these individually. First, on census growth excluding excess mortality, we had seen a decline in patient admissions during each COVID surge, followed by a rebound after each surge. The decline we saw earlier in the year was attributed to Omicron surge, which we anticipated would rebound in the second half of the year as it has in prior surges. We did not see the expected rebound in Q3 and are assuming continued pressure on admissions in Q4 and through 2023.\n\nNext, missed treatment rates. As we discussed during our Q1 earnings call, as a result of Omicron surge, missed treatment rates had increased and were having a meaningful impact on the change in our treatment volume. We anticipated these increases would return to seasonal norms after the winter surge, and they have not. As a result, we are now assuming these will remain elevated through the end of this year and through 2023.\n\nFinally, on excess mortality. While COVID mortality rates in 2022 are down from prior years, excess mortality remains a challenge for us. We expect this to persist in Q4 and into 2023. The magnitude of the impact will depend on the size and the severity of COVID surges this winter and through the rest of 2023.\n\nTaking these three metrics together, volume remains the biggest source of uncertainty in our forecast for Q4 2022 and 2023. Moving on to labor. I will cover three drivers: wage rate, contract labor, and training costs. As we've talked about in the past, we've been assuming significant wage pressure in 2022 with some offsets from lower benefit costs.\n\nOverall, we expected a headwind in 2022 of approximately $100 million to $125 million. Year to date, our results are consistent with this forecast. We had also seen significant pressure from contract labor costs in the first half of the year. We expect these to remain elevated in Q3, although at levels below Q2.\n\nIn fact, the contract labor cost in Q3 increased relative to Q2, and we're now forecasting that that decline will be later and slower than originally anticipated. On training, we went into Q3 with elevated costs as a result of more hires, which is consistent with the increases we have seen in past during hiring peaks. Training costs accelerated in Q3, which resulted in approximately $20 million higher costs in the quarter than expected. Because of the elevated turnover, this has not yet resulted in the magnitude of positive impact we would normally expect on contract labor or staffing level.\n\nAs a result, we expect training costs to remain elevated in Q4 and early 2023. In response to these challenges, we continue to work on a number of cost-saving initiatives for 2023. First, we expect to deliver meaningful savings from our new contract from anemia management. We will begin to transition to our new contract for Mircera in 2023.\n\nSecond, we are optimizing our clinic footprint for the current operational environment, which we expect to result in higher capacity utilization and better leveraging of our clinic fixed costs, including labor costs. Finally, we have initiatives underway to reduce our G&A in several areas of the business while investing in our future. As discussed, the cumulative and continued effects of COVID and labor are the key drivers of the shift in our outlook for the balance of 2022 and through 2023. We have anticipated that volume declines from COVID and labor market pressures would impact our revenue growth and margins in 2022, but we had expected release on both dimensions in 2023.\n\nWe are now assuming these challenges will persist longer than expected, which is what accounts for the change in our guidance. As we step back, we remain confident in our strategy, and we are focused on responding to the current industry challenges. We're dedicated to delivering high-quality care of our patients, creating a great place to work for our teammates, and sustaining our investment in the future to drive growth in integrated kidney care, have more patients treated home, and increase access to transplant. I will now turn it over to Joel to discuss our financial performance and outlook in greater detail.\n\nJoel Ackerman -- Chief Financial Officer\n\nThanks, Javier. Let me first give a few more details on Q3 results before I turn to the rest of 2022 and 2023. As Javier mentioned, we continue to experience treatment volume pressure and higher labor costs in Q3. These challenges were partially offset by lower spend on the ballot initiative than expected and lower losses than expected on ITC in the quarter.\n\nSpend on the ballot initiative this quarter was $28 million as compared to $23 million last quarter. We recognize the benefit in IKC of approximately $8 million related to shared savings revenue that was anticipated in Q4, and we anticipate could be offset with higher IKC losses in Q4 than expected. U.S. dialysis treatments per day were down 0.4% compared to the second quarter.\n\nApproximately half the decline was the result of elevated missed treatment and half from lower census. Revenue per treatment grew quarter over quarter by $2.13, primarily due to favorable adjustments, increased acute treatment, as well as the continued shift to MA plans, partially offset by the reinstatement of Medicare sequestration. Patient care cost per treatment was higher by $8.72 quarter over quarter, primarily due to higher wage rates, training expenses for new teammates due to increased hiring, and timing of teammate health benefit expenses. G&A expense was up approximately $56 million versus Q2.\n\n$46 million of the $56 million is the result of three items. First, in Q2, we had a one-time gain related to some self-developed properties of $22 million. Second, in Q3, there was $11 million of expense recognized related to closure charges. This $11 million is excluded from the adjusted OI.\n\nThird, there was our $28 million contribution to the industry campaign against the ballot initiative in California, an increase of $5 million over Q2. The balance of the quarter-over-quarter change is related to higher compensation expense and typical fluctuations in G&A spend. As I've discussed on previous calls, we've identified a number of initiatives to lower our fixed cost structure and our G&A. As part of these efforts, in Q3, we recorded $40 million of expense, including accelerated depreciation and the write-off of the net book value of assets related to certain centers we closed as we seek to optimize our clinic footprint.\n\nThese expenses are excluded from our adjusted operating income. We anticipate additional expenses will be excluded from our adjusted operating income in our guidance for both 2022 and 2023. I also want to add some details about 2023. As Javier mentioned, we've updated our year-over-year adjusted operating income growth estimate to negative $50 million to positive $150 million.\n\nThe change comes primarily in our assumptions around the continued headwind on treatment volume. We've also made small adjustments to 2 other drivers. First, we've changed the outlook on labor costs, primarily associated with training costs of new hires now pushed into 2023 as a result of 2022 performance and inflation. We've also lowered the range for year-over-year improvement in IKC operating income by $25 million.\n\nThis is due to outperformance in 2022 rather than a change in the outlook for 2023. Finally, during the quarter, we repurchased approximately 2.1 million shares which brought the total for 2022 thus far to approximately 8.1 million shares. Looking forward, we expect the pace of our share repurchases to slow significantly. We currently plan to focus more of our capital deployment to lowering our debt levels to get back to our target leverage ratio of 3 to 3.5 times EBITDA.\n\nOperator, please open the call for Q&A.\n\nOperator\n\nThank you. Our first question comes from Andrew Mok with UBS. Your line is open.\n\nAndrew Mok -- UBS -- Analyst\n\nHi. Good morning. I appreciate all the color on the headwinds. When I look at the guide though, it implies a Q4 range of about $240 million to $320 million of OI, which is a pretty material step-down from recent quarters.\n\nCan you maybe help rank order the headwinds you laid out for us in terms of what's driving the sequential decline? And what are you assuming with respect to COVID and its impact on treatment and labor in Q4? Thanks.\n\nJoel Ackerman -- Chief Financial Officer\n\nSure. Thanks, Andrew, for the question. So if I were to bridge Q3 to the middle of the range for Q4, first, we have the benefit of ballot. So that's in the high $28 million benefit.\n\nIn terms of the headwinds rank ordering them, 1 and 2 are SWB, salary, wage, and benefit would be number one. And that's higher training costs, wage rate increases, and some benefit seasonality. Number two would be volume, which is an accumulation of the census miss. So the kind of the full quarter's worth of the lower census we experienced in Q3, plus some additional census headwind, as well as a spike in the missed treatment rate.\n\nHistorically, missed treatment rates are lowest in Q3 and Q4 -- I'm sorry, in Q2 and Q3. They go up in Q4 and then again in Q1, partly due to weather and flu season, and then also partly due to holidays. And then third would be RPT. We had some favorable variability in Q3 that'll come down, and we typically see a bit of a decline in commercial mix from the middle of the year through the end of the year.\n\nSo those would be the big ones. I think there's a little bit of stuff in depreciation and amortization. I think IKC will come down a bit again as well, and there is some seasonality in G&A. So that would be the bridge.\n\nIn terms of what we're assuming here for Q4, we're assuming continued excess mortality, we're assuming the missed treatment rate that we've seen being above historical norms persists, and we're assuming some of the admissions or the, call it, organic growth challenges that we saw in Q3, we're assuming those persist as well.\n\nAndrew Mok -- UBS -- Analyst\n\nGot it. OK. Any color on...\n\nJavier Rodriguez -- Chief Executive Officer\n\nAndrew, let me just add a little color because of what you speak of as a magnitude. I think it's important to note that underlying all the assumptions that Joel just went through, we had a philosophical change in how we look at the future. So in the past, we were building in a rebound. We were assessing the uncertainties, but we thought that they would taper out by around Q3 and well into Q4.\n\nSo now we're assuming that COVID remains and that uncertainty on labor and volume stays longer, and so that really shifts the models in the dramatic way that you're trying to bridge.\n\nAndrew Mok -- UBS -- Analyst\n\nGot it. OK. That's helpful. Any color on how much higher the missed treatment rate is in 2022 versus historical levels?\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah, it's about 100 basis points higher. So you can think of that as just a 1% headwind on our treatment volume. And just to give you a number, 1% of treatment volume is worth about $50 million of operating income.\n\nAndrew Mok -- UBS -- Analyst\n\nGot it. And then you mentioned contract labor costs increased sequentially, which is a somewhat surprising trend. Was that driven by higher utilization or higher rates? And were there specific markets driving that sequential increase?\n\nJavier Rodriguez -- Chief Executive Officer\n\nYeah. Let me grab that one. The reality is there is no one market. It is spread across the country.\n\nAnd the reason why that variable, i.e., contract labor is behaving a little less predictable than usual is because, normally, you would look at your training as a leading indicator of the decrease of contract labor in the future, i.e., you're training a teammate and that person is going to hit the floor in, whatever, 3, 4 months. And then you would, in essence, model your contract labor decreasing. Because of persistence in turnover, unfortunately, our leading indicator of training is translating to lower contract labor, and therefore, we're having higher contract labor and higher training, which, of course, is the double whammy that we're speaking of.\n\nAndrew Mok -- UBS -- Analyst\n\nGot it. It's helpful. And then you mentioned...\n\nJoel Ackerman -- Chief Financial Officer\n\nJust to add on to Javier, it's more about the number of contract labors and less about rate.\n\nAndrew Mok -- UBS -- Analyst\n\nOK. That's helpful. Last question for me, and I'll hop back in the queue. You mentioned that you plan on switching your ESA regimen from Epogen to Mircera in 2023.\n\nCan you help us understand the pace of that transition?\n\nJavier Rodriguez -- Chief Executive Officer\n\nYeah. We've gotten a lot of questions on that. And as you can imagine, safety is utmost importance, and we want to do it at the right pace. We will be done by 2023.\n\nBut of course, the doctors have to review all the protocols and make sure that it's proper for their patient population, and so we don't have a particular goal. We're just saying please review the documents and get the proper prescription for your patients.\n\nAndrew Mok -- UBS -- Analyst\n\nOK. Thank you.\n\nJavier Rodriguez -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Kevin Fischbeck with Bank of America. Your line is open.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. I wanted to ask a little bit about the missed treatment dynamic. I guess is this something that you have seen happen in the past before? What would cause people to miss treatments on a consistent basis? It seems like something that it really can't happen for any extended period of time.\n\nSo has this ever happened? And how long does it normally take to come back? And what are the causes in your view of why it's happening now and persisting longer?\n\nJavier Rodriguez -- Chief Executive Officer\n\nYeah, Kevin, thanks for the question. Missed treatments are common at certain volumes because just life happens. Transportation, vacations, etc., where you missed one treatment. I think you are right in assessing that there's not what I'd call a chronic miss that you can go too long without dialysis.\n\nBut when we studied the data, we found that it is consolidated, meaning roughly 15% of the patients are causing 70% of the missed treatment. And so when we started to look into that, we found that roughly half of the missed treatments are hospitalizations. And the other half is a popery of things from the patient, him or herself, being ill with COVID or something else. So staying at home, transportation issues, either due to staffing or other things, and then scheduling either due to the patient or our center.\n\nAnd so there's a lot of things that go into the missed treatment. And what we're trying to do right now is make sure that we double down on our processes to reschedule the patients, but this is where it's all connected. If you have a tight labor market and staffing is tight, sometimes it's harder to get that rescheduled. So we're working on it.\n\nAnd basically, we had never really talked about missed treatment because it was pretty flat year over year. And then with the COVID sort of introduction, if you will, that number started to move, and we thought it would revert back to normal, and we're now seeing it stay elevated.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nOK. That makes sense. And then, I guess, what drove the commercial mix in the quarter? I think that was a headwind this quarter, but a tailwind year to date. So anything going on there? And any update or thoughts on whether Marietta is impacting pricing at all?\n\nJavier Rodriguez -- Chief Executive Officer\n\nYeah. No, commercial mix was flattish. And if it was down, it was down in what I'd call normal immaterial way on the commercial side. And you got to remember that mix is a numerator/denominator.\n\nAnd because of excess mortality and particularly in our older population, which is Medicare, that number is moving a little unusually as well, but there's nothing to report on that.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nAbout pricing, is Mircera having any impact there?\n\nJavier Rodriguez -- Chief Executive Officer\n\nNo. On pricing, I remember, our contracts are set for an extended period of time. And so if you were going to say the negative of our long-term pricing is that, of course, they didn't incorporate the inflation that we're experiencing. If you're going to look at the positive, and we've talked about this, is that we have very predictable and stable relationships with our payers.\n\nAnd therefore, you're not susceptible to the bumps of everyday life, you can plan with a 3-, 4-year time horizon.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nAll right. Great. Thanks.\n\nJavier Rodriguez -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from Pito Chickering with Deutsche Bank. Your line is open.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nYeah. Good morning, guys. Thanks for taking my questions. Going back to sort of 2Q when you reported sort of your results beginning of August, I'm just sort of curious what changed in August and September versus what you saw through July that's related to the sort of dramatic miss in kind of guidance?\n\nJavier Rodriguez -- Chief Executive Officer\n\nYeah. Let me grab the high level, and I think I'll be a little repetitive. The main thing, Pito, is the philosophical change in guidance. And so if you start to think we had this rebound that we thought a lot of these numbers that were high would revert to normal.\n\nWe've spoken of a couple, in particular, training and missed treatments already. And so when you grab all those numbers and you say they're going to revert to normal. And instead of that, it actually goes to an all-time high, meaning it goes the opposite way, then that starts to open up a big gap. And then instead of assuming, well, maybe the rebound is going to happen a quarter from now, we just said, we don't have any data that would make us any smarter on really predicting where this will change.\n\nAnd so we had conversations internally, and we had a couple of options. We had three options, right? The first one is you just don't give guidance at all because it is just too much to predict for 2023. The second is you try to predict the unpredictable and really try to make an educated prediction about when COVID and labor markets regulate, and then the last one is you assume the current environment doesn't change until there's clear data. And so we used to take something closer to option two, which is we had assumptions of COVID in volume, and we thought they would get better at the back end of '22 and improving into 2023.\n\nAnd now, we're taking closer to option three, which is we assume these dynamics that are strange in COVID volumes and the labor markets continue until we have further data.\n\nJoel Ackerman -- Chief Financial Officer\n\nSo Pito, let me fill in Javier's high-level view with just a little bit of quantification on the details. So if you look at our '22 guidance today versus where we were three months ago, it's down about $150 million at the center of the range. That is -- the biggest component of that is volume which is, I'd say, roughly split 50% from lower census and 50% from a higher missed treatment rate. And on the missed treatment rate, it's not that it's going up further, it's just that it's not coming down the way we had anticipated.\n\nSo that's '22. Looking forward to the change on 2023, it's really much more about volume. Again, census being the biggest driver on that, and missed treatment rates also not coming down with our new philosophy. And then the other big component would be labor, two-thirds training, one-thirds contract, and that's really about pushing out from the second half of this year to the first half of next year when we start seeing the benefits of some of the new hires that we're putting in place, and the reduction in training costs, and then ultimately lower contract volume.\n\nSo those are the numbers.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nOK. On the treatment assumptions -- or actually, on treatment, I guess, during 3Q, sort of ignoring the missed treatments for a second. If I should breakouts for the three key drivers here, it's incidence rate of new ESRD patients, patient mortality, and excess patient mortality from COVID. I guess can you just sort of break down what you saw this quarter in those three buckets? And is there a slower incidence rate, which could be leading to lower commercial mix in the quarter, the back half of the year?\n\nJavier Rodriguez -- Chief Executive Officer\n\nYeah. Let me grab those because you've got the components right, so let's just start from the top. You start with new admits. The new admits are down roughly a couple of thousand patients.\n\nThen you subtract transplants, which have been flattish. And then you subtract mortality, which, as we've discussed, has been higher. And then you subtract the missed treatments, which we've already discussed, has been higher, roughly 100 basis points depending on the starting point. And so that's the entire equation.\n\nThe next question, which we've been really studying is why are new admits down, what is happening with the population upstream, which is sort of the natural question. Unfortunately, that leads to a dissatisfying answer, and that's because of what we've talked about all along, which is there is very low visibility to the CKD population, and roughly half of the patients actually crash into dialysis. So you start getting into a lot of different data sources and datasets, and what we've looked at isn't conclusive. And so right now, the hypothesis, one could have a good hypothesis that says there happen to be a bit more depth in that patient population.\n\nThere are others that think that that might be offset over time because the volume and the pace at which someone will progress from CKD into ESKD will be bigger post time as COVID progresses. And so right now, unfortunately, again, the upstream is the one that we have the least visibility in the other variables we've already discussed.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nOK. Got it. I know you don't give revenue guidance for 2023, but after sort of this pretty large decrease of OI guidance, can you help guide us to what revenue growth you assume in 2023 over 2022 with all these changes that we're making?\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah. So I think the best components to think about would be RPT and volume. And I think at a very high level, they will offset each other next year. So again, I don't want to get into too much specificity, but I think thinking about RPT in the 2% may be a little bit better range.\n\nAnd then a volume decline, if you take everything we've said at the middle of the range, would be about a 2% volume decline, so those would offset each other and wind up at kind of flattish revenue.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nGreat. Great. Thanks so much.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from Justin Lake with Wolfe Research. Your line is open.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nJust a quick follow-up first on the volume question. So volumes down 2% for next year. Is that what you're assuming, guys, just to be clear?\n\nJavier Rodriguez -- Chief Executive Officer\n\nYes.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nThat's missed treatments?\n\nJoel Ackerman -- Chief Financial Officer\n\nYear over year, there's no missed treatment impact because what we're basically saying is it's running 100 basis points higher than normal in 2022, and we're assuming that it'll continue to run at that 100 basis point higher than normal level So it's 100 basis points relative to pre-COVID. But year over year, it's no change\n\nJustin Lake -- Wolfe Research -- Analyst\n\nGot it. So this is 100% coming from new admits below mortality?\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah. I mean it's a combination of new admits running below historical, plus continued excess mortality. And then I think the other important thing to recognize is as we have excess mortality throughout the year of 2022, that has a negative impact on the full year over year as that -- the impact of that mortality annualizes.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nOK. And then you talked about the clinic closures in the third quarter. Can you tell us how many clinics are closed in the third quarter? And then how many do you expect to close for the full year this year? And any insight into how many you closed in 2023?\n\nJavier Rodriguez -- Chief Executive Officer\n\nSure, Justin. For the year, there's a little timing in there. So let's give a range between 130 and 150 for the year or so. And for next year, we're forecasting between 50 and 60.\n\nAnd again, those could bounce around depending on timing. And so just to remind you because I think we spoke of this last time, we put through several lenses. The first is to make sure we have the right patient access. Secondly, we look for the availability of home.\n\nAnd then lastly, we look at sort of the local market dynamics, the lens of the leases, and those type of things. But it's a complicated process that we have to be really thoughtful to make sure that we're being responsible.\n\nJoel Ackerman -- Chief Financial Officer\n\nJustin, the number was 44.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nOK. Good. And then does this have any impact on patient growth as well? Or do you feel like you retain pretty close to 100% of these patients when you close the center?\n\nJoel Ackerman -- Chief Financial Officer\n\nWe don't retain 100%, but we retain the vast majority. So it shouldn't have much of an impact on volume.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nOK. And then last question before I jump back, in the leverage. So the -- would you agree EBITDA next year somewhere in the $2 billion range?\n\nJoel Ackerman -- Chief Financial Officer\n\nI don't want to get into the specifics. But I think if you're asking about leverage, where we round up to 3.9 this quarter is above our target range of 3 to 3.5 times. And we are -- we would like to get the leverage down over the course of next year. Obviously, what happens to EBITDA year over year will be an important driver of that.\n\nBut to further that effort, we are certainly going to rethink how much of our free cash flow we're deploying to share buybacks and lean more heavily to debt paydown. So the revolver was down from 450 last quarter to a draw of 275 this quarter. And I think it's fair to say that our share buyback pace, excuse me, will come down over the next year, and our leverage level should come down as well -- I'm sorry, our total leverage should come down as well.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nYeah. Joel, I guess what I was trying to know is like the number you have in the press release is a little bit backward-looking. I guess the EBITDA come -- is the OI coming down next year to 4.4? I'm assuming you get to like 221 like on EBITDA in total, right, with the D&A, so that would leave you closer. I think you said in the release you were at 8.8 net debt.\n\nSo that would put you at close to 4.4 on kind of a forward look versus the backward look that you have in the release, One, is that the right number? And then two, maybe I appreciate the help and understanding debt paydown over share repo. But if you could give us a little bit more color in terms of if you have $1 of free cash flow next year, maybe you could just tell us -- previously, it's been 100% toward share repo. Is it now 75-25. Or at 4.4 times, are you doing any share repo until you get closer to 3.5? Thanks.\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah. So I'd start with a higher EBITDA number for next year. If you take, I think, in the middle of our range, you get somewhere a little north of 1.45. I think it's 1.46 on OI.\n\nAdd back $700 million of depreciation and amortization, you'd get to an EBITDA number that's more in the 2.1 to 2.2 range. And then in terms of how much of the free cash flow we deploy, I would think it would be a higher percentage to debt pay down than the kind of 75-25. I don't want to give a specific number, but I think we're going to cut way back on share buyback.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nGot it. That's helpful, guys. I appreciate it.\n\nOperator\n\nThank you. Our next question. Our next question comes from Pito Chickering with Deutsche Bank. Your line is open.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nHey, guys. Just a sort of a follow-up here. Looking just at the fourth quarter, implied OI. If I annualize that, it's pretty -- a lot lower than sort of the new '23.\n\nJust curious sort of what costs are sort of more of one time in nature in 4Q that we won't take as a run rate into '23?\n\nJoel Ackerman -- Chief Financial Officer\n\nSure. So let me try and build that bridge up of Q4 annualized to the 2023 guide. I think wind up with about a $350 million gap that we would need to bridge, and here's how I do it. First, volume will be a headwind from Q4 to the full year, call that $100 million.\n\nRPT will be a, excuse me, tailwind north of $200 million. I think important to realize there, again, RPT, we think, will run stronger next year year over year than historically. One of the big drivers of that will be Medicare fee for service, where the final rule is not out. We're expecting it imminently.\n\nWe are anticipating that the final rule will be better than the preliminary rule, so that will help RPT and then just all the normal RPT increases. So call that north of $200 million. I would add in $150 million of cost savings, which is in the table that we called out in the press release, and then there is a bit of negative seasonality on Q4 that's probably worth $50 million to $75 million. So if you were to add that all up, you'd get somewhere around $350 million.\n\nThe one thing that wasn't on my list, I just want to highlight, was labor. Relative to Q4, we could see 2023 as being relatively flat -- labor being flat in 2023 relative to Q4. And what you see there is higher wage rates offset by the lower training costs, which we see coming down in the back half of the year as well as contract labor coming down over time.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nOK. Got it. And then I know versus the other moving parts of the small one. But on the IKC guidance for 2023, I guess what's changing your assumptions? Is it higher utilization that you're assuming? Is it lower reimbursement you're assuming? Is it increased investments? Kind of what's driving that change for IKC for 2023?\n\nJoel Ackerman -- Chief Financial Officer\n\nI'm sorry, Pito, I missed that. Could you repeat the question? I apologize.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nApologies. Looking at your 2023 guidance, previously, you're guiding to -- specifically on the IKC, you're guiding to $25 million tailwind. Now it's a $25 million headwind or to flat headwind, so the swing here in IKC guidance for next year. Just curious exactly what's driving that.\n\nIs it more utilization? Is it -- it was the key driver of that delta.\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah. Sorry about that. So if I look at '23 for IKC, I think there are really two factors at play here on the bridging it from '22 to '23. One is '22 is coming in a lot better than we expected.\n\nSo you're comping to a much smaller loss. The second thing is we now expect growth in 2023 again. And as we've called out in the past, IKC growth is a headwind in year one to OI. So your -- the overall result hasn't changed much.\n\nIt's that '22 has gotten better. And to some extent, some of the benefit we're seeing in '22 is gonna get offset by the impact of growth in '23.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nIs that growth coming from more MA contracts converting into IKC?\n\nJavier Rodriguez -- Chief Executive Officer\n\nThere's a little mix of that, but the bulk of it is we are opening a lot more of the CKCC program. So we had 11 this year, and we're doing 11 more next year. There will be a little more MA, but the predictable large volume will be government.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nOK. Fair enough. And then I guess with all the moving parts, do you view the breakeven point for IKC getting better or worse than previous guidance?\n\nJoel Ackerman -- Chief Financial Officer\n\nI would say the business is performing better than we expected. But in the short term, growth has a negative impact on OI.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nGreat. Thanks so much.\n\nJoel Ackerman -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Our last question comes from Andrew Mok with UBS. Your line is open.\n\nAndrew Mok -- UBS -- Analyst\n\nHi. Thanks for letting me back in the queue. First, do you have the excess mortality number in the quarter that you can give to us? And then you noted that the annualization of excess mortality is negative for next year. When you look at the patient population, are you seeing any evidence of reduced mortality rates for the current population such that when you finish annualizing this excess impact treatment should start to accelerate? Thanks.\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah. So excess mortality in the quarter was a little bit north of 1,000, call it, 1,100. In terms of are we seeing what we call the pull-forward effect, it is very hard for us to tease out the difference between higher COVID mortality and lower mortality from pull-forward. So the excess mortality number we give is effectively a blend or is a net of those two numbers.\n\nWe still believe in the concept of the pull-forward that some patients -- that our census is being positively impacted by lower mortality from the earlier excess mortality, but we're just not in a position to quantify it. So I think it is fair to think of our excess mortality as a net number of the number of patients in the quarter who died as a result of COVID, offset by a lower mortality from the prior mortality that isn't occurring this quarter. I hope that's clear.\n\nAndrew Mok -- UBS -- Analyst\n\nOK. I think I understand. And then on the hurricane, you noted that you're able to get all the patients down in Florida access to dialysis throughout the hurricane impact. Can you quantify what impact that had on your P&L this quarter? And is there any lingering impact of the hurricane into the fourth quarter?\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah. Andrew, there was no significant impact on the P&L, and again, nothing in Q4 for that.\n\nAndrew Mok -- UBS -- Analyst\n\nOK. And then on the Medicare rate, I think you said you're already assuming better Medicare rates. Is that 100 basis points better? Can you give us some color on what you're assuming there?\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah. That's a reasonable estimate. We've looked at what other sectors have seen in the delta between their prior and their final, so we're thinking about 3% and 3.4%, I think, is a reasonable number.\n\nAndrew Mok -- UBS -- Analyst\n\nOkay, That's all the question. Thank you.\n\nOperator\n\nThank you. We did have another question come through. Justin Lake with Wolfe Research, your line is open.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nGuys, can you hear me OK?\n\nJoel Ackerman -- Chief Financial Officer\n\nWe can hear you fine, Justin.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nSo I thought maybe we just throw in one more question on kind of cost going through 2023. And for instance, Andrew earlier brought up Mircera, you guys are gonna be implementing that through the year. So just looking to see, like is there any potential light at the end of the tunnel as we go through the year. So Mircera cost for the year, the benefit of that, you won't see it, but you will be at a higher run rate on savings at the end of '23 than you were through '23.\n\nWas also thinking about the potential, you talked about contract labor being higher than you expected, and that's going to hopefully moderate through 2023. So just wondering if you could give us some numbers around that, for instance. Is there -- within that cost-cutting, how much is Mircera in that cost-cutting number? And then how much do you think you could get out? How much will the total savings be that you could run rate in the 23%? And then maybe you could tell us what your contract labor costs are running in the third and fourth quarter and how you expect those to run through '23 so we could think about an exit rate in '23?\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah. So first, I think you're thinking about things directionally correctly, that the front half of the year will be tougher than the back half of the year. And for -- I put it into three buckets. One is Q1 is always seasonally tough because of revenue per treatment, and that's just how we account for the nonpayment or the bad debt associated with deductibles and co-pays.\n\nSecond is a combination of the savings from Mircera and some of the other initiatives building over the course of the year, combined with some of the pressures associated with contract labor and training declining over the course of the year. And then finally, IKC is a business that we have generally assumed will have a better Q4 than other quarters because of how revenue recognition works. We saw -- we're seeing less of that pattern in 2022. We've seen more of the revenue that we expected to recognize in Q4 earlier in the year.\n\nBut again, I think we're anticipating a better Q4 for IKC, although that's not something you could annualize. So those are the things. In terms of how to quantify some of this stuff, contract labor for Q3 is running at about -- a little bit north of $30 million for the quarter. We're looking at that to come down a bit in Q4 and Q1 and then really start declining starting Q2 of next year.\n\nAlthough we're assuming it'll remain elevated relative to our historical rate, which was almost insignificant. That's contract labor. In terms of quantifying the magnitude of the cost savings, so we've called out $150 million for next year at the middle of the range. Mircera is the biggest component of that.\n\nThe realignment of the footprint is number two, and the G&A is number three. So we're not going to give specific numbers on those things, but I think that can help you get in the right ballpark on those three numbers.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nGot it. Maybe on Mircera, would the fourth quarter run rate kind of be double, the benefit that versus the annualize? But is it gonna be something that's kind of ratable through the year or so the fourth quarter exit is going to be a lot higher than the full-year benefit?\n\nJoel Ackerman -- Chief Financial Officer\n\nIt's hard to tell, Justin. This -- remember, this isn't an operationally intensive effort. Ultimately, physicians do the prescribing, not us. And it will be a question of how they're thinking about it, how long it takes them to integrate the information, how many will make the change, and when.\n\nSo I don't think we're ready to make a prediction on that.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nOK. And then last question for me is on revenue per treatment. So you talked about there were some kind of moving parts there that benefited revenue per treatment. First, can you put a number around that in terms of how much dollars in revenue per treatment, you saw a benefit? Just trying to understand, one, how much that benefited the quarter; and two, what's a reasonable run rate to think about going into the fourth quarter? And then lastly, maybe you could give us a number on that commercial treatment, that commercial mix decline?\n\nJoel Ackerman -- Chief Financial Officer\n\nYeah. So I think you can think of the quarter as having benefited by $2 to $3 of normal fluctuation. We see that all the time. If you want a good exit run rate, I think $365 RPT is a reasonable exit run rate for Q4 and for the full year of 2022 off of which to build your '23 number.\n\nIn terms of commercial mix, it was a few basis points down for the quarter, so really not significant. It was -- I think it was 10.4% last quarter, and it rounds to 10.3% this quarter, but it was pretty small.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nGreat. Thanks for all the color.\n\nJoel Ackerman -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. I apologize. At this time, we have no further questions. Mr.\n\nRodriguez. I'll hand the call back to you.\n\nJavier Rodriguez -- Chief Executive Officer\n\nThank you, Amanda. As you can see from all the conversation we have, guidance is harder with the COVID uncertainty on volume and the labor dynamics that we have spoken of. We, of course, are working very hard to give you our best estimate and now are assuming that they will stay elevated for a period of time. Let me just close with a couple of comments.\n\nOne is these are very challenging times for DaVita, and they are challenging times for the broader kidney care community and all healthcare providers. But as I separate myself from this moment in time and I look further out, I can't help but to say we are incredibly well positioned to differentiate and outperform given the experience of our team, the clarity of our strategy, and the strength of our balance sheet. I appreciate your time today. Have a good day.\n\nTake care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoel Ackerman -- Chief Financial Officer\n\nJavier Rodriguez -- Chief Executive Officer\n\nAndrew Mok -- UBS -- Analyst\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nJustin Lake -- Wolfe Research -- Analyst\n\nMore DVA analysis\n\nAll earnings call transcripts"
}