{
  "companyName": "Southwest Airlines",
  "companyTicker": "LUV",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/southwest-airlines-luv-q3-2022-earnings-call-trans/",
  "content": "Southwest Airlines (LUV 0.87%)\nQ3 2022 Earnings Call\nOct 27, 2022, 12:30 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Southwest Airlines third quarter 2022 conference call. My name is Jamie, and I'll be moderating today's conference. This call is being recorded and a replay will be available on southwest.com in the Investor Relations section. [Operator instructions] At this time, I'd like to hand the conference over to Mr.\n\nRyan Martinez, vice president of investor relations. Sir, you may begin.\n\nRyan Martinez -- Vice President, Investor Relations\n\nThank you, operator, and welcome, everyone, to our third quarter earnings call. In just a moment, we will share some prepared remarks and then open it up for Q&A. And on the call today, we have our CEO, Bob Jordan; president, Mike Van de Ven; chief operating officer, Andrew Watterson; and executive vice president and CFO, Tammy Romo. We also have a few other senior leaders in the room today, including Ryan Green, our new executive vice president and chief commercial officer.\n\nA quick reminder that we will make forward-looking statements, which are based on our current expectations of future performance, and our actual results could differ. Also, we had a few special items in our third quarter results, which we excluded from our trends for non-GAAP purposes, and we will reference our non-GAAP results today. So please refer to the press release from this morning in our Investor Relations website for more information. And with that, Bob, I'll turn it over to you.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nAll right. Well, thank you, Ryan, and I appreciate everybody joining us this morning. I'm just really pleased to report another solid profit in the third quarter of $316 million, excluding special items, or $0.50 a share. All in all, third quarter's bottom line results came in almost right in line with our expectations back in July, slightly better, in fact, and that really speaks to the more stable environment that we are operating in today versus where we were just two quarters ago.\n\nWhile not fully recovered yet, it makes a big difference in our ability to more effectively plan, set our flight schedules and avoid revising them and deliver a more reliable operation both for our customers and our employees. That's exactly what we're doing in the second half of 2022, and that's what we plan to do going forward. Given the significant progress we've made thus far, we do not intend to republish or materially change our future flight schedules as was necessary to do during most of the pandemic. One of our primary goals for this year is returning to consistent profitability, and we are well on our way and continue to expect a solid profit for 2022.\n\nWe are coming off of a record third quarter revenues, and bookings appear strong as far as we can see in our booking curve. Demand trends, both volumes, and yields, are robust. We want to get properly staffed, and that's going very well. We remain on track with adding over 10,000 new employees this year, net of attrition, and we are getting much better staffed in key areas with the exception of pilots, where our aggressive hiring efforts continue.\n\nAnd we are on track to hire 1,200 pilots this year and 2,100 pilots next year as planned. we wanted to restore our operational reliability, and we are headed in the right direction, having made a lot of solid progress. As we shared previously, we restored some of our short-haul flying in the third quarter, which was a little early and at the expense of revenue now knowing where business demand has ended up. But the goal was to help the operation, and I believe we got the desired results in the third quarter.\n\nGoing forward, we believe we have capacity better matched seasonally to demand in the fourth quarter, and you can see the benefit in our sequential revenue improvement from 3Q to 4Q based on our guidance. And as Mike will cover, our on-time performance this month has been very strong with high completion rates. And the thanks, of course, goes to our people who have thoughtfully restored our customer service advantage this year, another one of our top priorities. For January through August, the most recent data available, we remain No.\n\n1 in customer service for the DOT's ranking for marketing carriers. I'm just so thankful for our employees and how they have worked tirelessly together as a team, no matter the obstacle, and they have us solidly back on top of the industry. Again, our employees are the central proof and essence here of Southwest Airlines, and I'm just so very proud of them and all that they have done. Jet fuel prices remain high, but we are 61% hedged in the fourth quarter and continue to expect healthy hedging gains.\n\nWe continue to expect both inflationary cost pressures and cost headwinds from lower productivity and efficiency in fourth quarter. This was all anticipated in our full year guidance. And other than some timing of costs between 3Q and 4Q, our cost trends have been very stable. We've been executing well on our full year 2022 cost plan since we provided our full year CASM-X guidance back in January.\n\nAnd but for the Hurricane Ian impact to capacity, we are also executing on our full year 2022 capacity plan. Specific areas of focus for 2023 are to maintain adequate staffing and get caught up in pilot staffing, get new contracts with all labor groups currently in negotiations, fully utilize our aircraft and optimize staffing to the fleet and flight activity, bring out cost inefficiencies and improve efficiency levels and operating leverage as we fully restore the network. Our primary gating factor to growth next year continues to be pilot hiring, and I don't expect that we will be fully utilizing the fleet until late 2023. As of today, our flight schedules are published through July 10, 2023, and we feel good about our ability to fly those schedules as published and planned despite some uncertainty around aircraft deliveries.\n\nWhile we expect a healthy amount of capacity growth next year, it is nearly all going back into key Southwest markets. These are markets that we borrowed from to fund new airport expansion during the pandemic. And as business demand improves, we have opportunities to build those backup. And this is lower-risk growth primarily in markets where we have the No.\n\n1 share and a strong Southwest customer base, so we don't believe the capacity additions carry near the risk of adding a new market. Our goal is to have the network fully restored by the end of 2023. And by summer 2023, we should be about 90% done. In closing, we've made tremendous progress this year, barring any significant unforeseen impacts, we should finish this year very strong given our fourth quarter outlook.\n\nWhile there's noise regarding whether we are headed into a recession or not or whether we may even be in one now, we have not seen any noticeable impact on our booking and revenue trends. There's also been a lot of discussion about the blending of business and leisure, why and where those trends may ultimately end up. But regardless, our overall revenue trends are strong and well above 2019 levels. Our work continues on developing a strong financial plan for next year, and we will share more about that at our upcoming Investor Day meeting in December.\n\nAnd I'm extremely proud of our employees for their dedication to the cause at Southwest Airlines. They're our greatest asset, our secret weapon. They're the best in the business, and I know I can count on them to rally together and help us improve further in 2023. And before I turn it over to Tammy, I just want to say a big thank you to Mike.\n\nMike has overseen the operations here at Southwest for over 16 years, and that is just a huge job and a huge task. He is a tremendous leader. I'm just very grateful, Mike, for all that you do. And I'm very grateful that you will continue to work as an advisor to me and others in the future.\n\nAnd I also want to say a big congrats to Andrew to Linda and to Ryan for taking even more. I really appreciate that. And today, Mike will report on operations, and Andrew will report on commercial. And then beginning at our December Investor Day, Andrew will speak to operations, and you will hear from Ryan regarding our commercial plans.\n\nAnd with that, I will turn it over to Tammy.\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nThank you, Bob, and thank you, Mike, my very good friend, for 3 decades of incredible leadership. And thanks also to all of our employees for their remarkable job throughout the quarter. In addition to delivering a high-quality experience for our customers, their efforts led to a solid third quarter performance. The strong demand trends from summer continued in third quarter, resulted in record third quarter revenue and record third quarter revenue passengers.\n\nOur third quarter operating revenues grew a healthy 10.3% versus 2019, aided by a very strong other revenue performance. Andrew will speak to our revenue trends in a minute, so I will turn to our cost performance and outlook. Our people did another great job managing costs in the quarter. Our fuel hedge continues to perform well in this environment where market prices remain volatile and elevated, saving the company about $220 million in fuel expense in third quarter alone.\n\nWe are 61% hedged for fourth quarter, and we currently estimate our fourth quarter fuel price to be in the $3.15 to $3.25 per gallon range, which would be a sequential improvement from third quarter's fuel price based on current prices. That estimate includes $0.37 of hedging gains, which equates to cost savings of more than $185 million in fourth quarter, which would put our full year 2022 fuel hedge benefit at roughly $1 billion. We recently added to our 2023 fuel hedge portfolio and are now 50% hedged, with a fair market value of around $390 million for full year 2023. The fair market value of our fuel hedge portfolio through 2024 is $685 million.\n\nWe will continue to seek opportunities to expand our hedging portfolio in 2024 and beyond, but we are in good shape headed into next year, especially given the volatile energy market over the past year that made it tough to materially expand our positions at historical premium cost. Taking a look at nonfuel cost, third quarter CASM, excluding special items and profit sharing, was toward the favorable end of our previous guidance range at up 12.2%, compared with third quarter 2019 due to lower-than-anticipated health and benefit costs as well as higher favorable airport settlements that we expected to receive this quarter but shifted earlier to third quarter. We currently estimate fourth quarter CASM-X to increase in the range of 14% to 18% compared with fourth quarter 2019. More than half of that increase continues to be driven by headwinds from operating at suboptimal productivity levels, compounded by decreased capacity levels here in fourth quarter relative to third quarter.\n\nThe remainder of the CASM-X increase continues to be primarily attributable to inflationary pressures, primarily in higher rates for labor, benefits and airports. All of that said, I am very pleased that we remain on track with our '22 cost plans, as Bob mentioned, especially in this environment. As we close out the year, our full year 2022 CASM-X guidance has narrowed to up 14% to 15% compared with 2019. As a reminder, this includes labor accruals for all contract labor groups beginning April 1st of this year, taking into account our best estimate for wage rate increases.\n\nLooking ahead to 2023, we continue to estimate full year CASM-X to decrease compared with this year. We now have our first half 2023 flight schedule pushed for sale, and we currently expect first half 2023 CASM-X to be in the range of flat to up 2% compared with first half 2022. Given the level of first half capacity growth, in a pre-pandemic period, we would have expected CASM-X to be subtly down year over year. However, we expect to continue experiencing unprecedented cost headwinds due to higher-than-expected inflation.\n\nAnd as part of that, keep in mind that we are accruing for all open labor contracts and further wage rate increases in 2023. So that is fully included in our guidance based on our best estimation of market rates. On top of wage rate inflation, we expect to continue hiring at a healthy pace next year to support 2023 capacity and scale for 2024 growth. Our productivity has not returned to pre-pandemic levels, which has required additional hiring to support the operation.\n\nIt seems that most industries and companies, including our peers, are experiencing a similar workforce dynamic. Based on our assumption that fleet utilization will be limited by pilot staffing constraints for the majority of 2023, these cost headwinds will persist throughout next year, but should improve somewhat in second half relative to first half 2023. We haven't finalized our second half 2023 capacity plans, but our current summation is that second half 2023 CASM-X will decrease in the low to mid-single-digit range compared with second half 2022. We continue to be focused on better optimization of staffing levels to our flight activity and improving our efficiency metrics and operating leverage.\n\nThat work will begin in 2023 and continue into 2024. Turning to our fleet. Our planning assumption for Boeing aircraft deliveries this year remains unchanged from what we shared in July. While our contractual order book still reflects 114 aircraft in 2022, we continue to expect 66 -8 MAX deliveries this year due to supply chain challenges that Boeing is dealing with as well as uncertainty regarding the timing of the -7 MAX certification.\n\nHowever, we are encouraged to have received all 23 -8 MAX aircraft in the third quarter as expected and continue to expect 31 -8 MAX aircraft deliveries here in the fourth quarter. We do not expect to take delivery of any -7 MAX aircraft this year. We continue ongoing discussions with Boeing and just recently made some modifications to our order book. In short, we converted more -7 MAX aircraft to -8 MAX aircraft in the near term.\n\nWe outlined the specific changes in our press release this morning, so I won't reiterate all the fleet out here. In terms of retirements, we now plan to retire a total of 26 -700 aircraft this year, a few less than previously expected, ending the year with an estimated 768 aircraft in our fleet. And our full year 2022 capex guidance remains unchanged at approximately $4 billion. Turning to our balance sheet.\n\nWe ended the quarter with cash and short-term investments of $13.7 billion after paying $1.9 billion to retire debt and finance lease obligations during third quarter. This included the full $1.2 billion outstanding amount of our 4.75% notes due 2023 and $184 million in principal of our convertible notes. We have now repurchased a total of $689 million of our convertible notes, roughly 30% of the original issuance, and have $1.6 billion currently outstanding. We remain in a net cash position with leverage at a very manageable 48%.\n\nWe continue to be the only U.S. airline with an investment-grade rating by all three rating agencies, which remains one of our key long-term competitive advantages in good times and in challenging times. With our strong balance sheet and continued financial strength, we will soon discuss our 2023 capital plans with our board of directors, but our capital allocation priorities remain unchanged. We have a long-standing dividend history, and reinstating a dividend remains a high priority.\n\nWe will also continue to look for opportunities to reduce debt. We will continue investing in the company and our people, and we are focused on wrapping up negotiations with all of our open contract labor groups. Last but not least, and at the right time, we intend to resume share repurchases as part of our shareholder return equation as we have in the past. And all of these intentions assume that the travel demand environment remains steady and we continue producing consistent quarterly profits.\n\nWe are mindful of the economy and recessionary risk, and we would like to monitor the environment to see if there is any noticeable impact on travel demand as we move into 2023. Again, we are not seeing any noticeable impact today, but we would like to preserve a higher-than-normal cash balance for some period of time into next year before we materially reduce our cash reserves. So while I can't commit to anything today, I hope that gives you an idea of how we are evaluating our capital allocation choices. In closing, third quarter represented another profitable quarter in our recovery.\n\nOur momentum is building here in fourth quarter, supported by a strong revenue outlook, and I am encouraged with the progress we have made as we look to close the year strong and turn our focus to 2023. We are committed to generating healthy returns on invested capital, and I am very pleased with the direction we are headed. With that, I will turn it over to Andrew.\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nThank you, Tammy. I'll provide some additional color on our Q3 revenue trends and Q4 outlook and point you to our earnings release for more detail. Overall, Q3 operating revenues came in right in line with the midpoint of our original guidance range, up 10.3% versus Q3 2019. Our path there was a bit different than anticipated, but a solid result nonetheless.\n\nWe had an 85.4% load factor, and yields increased 5.3% versus Q3 2019. In July and August, we saw a step back in close-end business demand, but that was coupled with stronger advanced purchase leisure demand. In September, we saw a nice sequential improvement in managed business revenues, and leisure demand remained stronger than anticipated and was particularly robust for a typically weaker leisure shoulder month post Labor Day. September managed business revenues finished down 25% versus Q3 2019.\n\nSo while Q3 took a bit of a step back on business trends, we finished the quarter on a strong note, and revenue momentum is picking up steam. As anticipated, we had a five-point sequential headwind from Q2 to Q3 for our travel credit expiration policy change in July, which resulted in lower breakage revenue in Q3. As Bob mentioned, we also increased our short-haul flying in Q3 in order to help with our operational stability. Mike will cover operational results in a moment.\n\nBut we over-indexed some short-haul flying in Q3 relative to where business demand ended up, which created a roughly two-point drag to Q3 operating revenue. As business demand rebound in September, the additional short-haul flying helped overall revenues, and our revenue trends in medium and long-haul segments were very strong throughout Q3. Our Q3 loyalty program revenue was exceptionally strong and the primary driver of the increase in the other revenues. We saw strong growth in retail sales, which was aided by incremental revenue from our co-brand credit card agreement with Chase that we secured at the end of last year.\n\nEven so, Q3 retail sales spend per cardholder and our overall portfolio size continue to grow versus 2019. We continue to be very pleased with the performance of our loyalty program and its significant revenue and EBIT contribution. Our ancillary products also performed well in Q3, in particular, our upgraded boarding product. This allows customers to purchase any unsold business select boarding positions in the A1 to A15 boarding group on the day of travel.\n\nWe recently rolled out a new digital self-service option to purchase this product, which was previously only available to purchase at the airport gate. Our portfolio of new cities and development markets performed in line with expectations in Q3. Hawaii outperformed our expectations, primarily due to stronger Mainland to Hawaii performance as we further invested in and we optimized our Hawaii franchise. And these actions are paying off.\n\nOur Hawaii interisland service will take longer to development, and our primary goal at this point is generating awareness among local travelers and incentivize them to try Southwest and experience our product. This is not uncommon with introduction of new service. Now looking at Q4, travel demand is strengthening, and we expect both leisure and business revenue trends to improve sequentially from Q3, and bookings for the holidays are strong. We expect Q4 operating revenues to increase in the range of 13% to 17% versus Q4 2019.\n\nWe expect sequential improvement in Q4 business revenue trends compared with September is down 25%, and we expect Q4 managed business revenues to be down 20% to 25% versus Q4 2019. The sequential improvement we are seeing in operating revenues is from base business improvement, in particular on the yield side, as we continue -- as well as continued ramp of benefits from revenue initiatives. Our Q3 capacity decreased slightly, down 0.3% versus Q3 2019, which was in line with our guidance despite flight cancelations from Hurricane Ian. Our Q4 capacity is a little lower than previously guided due to Hurricane Ian flight cancellations and is now expected to be down approximately 2% versus Q4 2019.\n\nStage length is increasing a bit as we move through Q4 and we continue to expect to be about 85% restored from a network perspective by this December. Looking ahead to next year, we expect Q1 2023 capacity to increase around 10% year over year and Q2 2023 capacity to increase around 14% year over year. While we aren't ready to provide full year '23 capacity guidance yet, that should give you an idea of the rate of capacity growth next year. When we talk about being fully restored from a network perspective, that means restoring the key Southwest markets that we borrowed from to fund the new airport growth during the pandemic.\n\nSo our year-end 2023 capacity goal would be network restoration plus our 18 new airports and recent Hawaii expansion. In closing, this will be my last earnings call covering the commercial update as our new chief commercial officer, Ryan Green, will take over going forward. I've worked with Ryan for a long time, and he's very prepared and well qualified for his expanded role. Some of you have met Ryan in the past, but he was most recently our chief marketing officer.\n\nAs I'm transitioning to chief operating officer, I will retain the network planning function as we strive to increase operating leverage as we move past the pandemic and reconstruct the network. And being conscious that I'm standing on his shoulders for my new job, I thank you, Mike, and turn it over to you.\n\nMike Van de Ven -- Chief Operating Officer\n\nThank you, Andrew, and hello, everyone. We're now through the busy summer travel season. And aside from some weather that the industry had to deal with, I am very pleased with the reliability of the operations that our employees delivered in the third quarter. They're working very hard to take great care of each other and our customers.\n\nAnd we've made tremendous progress in several areas, including getting properly staffed in most work groups, and we have more employees that have completed their initial training, and they're now contributing on the front line. So over 95% of our hiring has been in frontline and operations groups. Second, flying our published schedules without making material posting revisions. As Bob mentioned, our third quarter schedules were much more stable for our employees and our customers.\n\nAnd third, just as with last quarter, we have improved the quality of the schedule with more depth and more nonstop flights. Andrew mentioned we've added short-haul flights in business markets, and that provides more options when we have weather or ATC delays. We also have more flying between all of our crew bases, and all of those changes support a more stable operational performance. From Memorial Day through Labor Day, the heavy summer travel season, we improved year over year across nearly every operational metric, including our on-time performance.\n\nAnd our flight completion rate was 98.6%, which means we canceled slightly more than 1% of our scheduled flight, and that's in line with our pre-pandemic performance, and that's really where we aim to be. Digging into on-time performance for the third quarter, our on-time performance was 71.2%, which was referred to as A14 by the Department of Transportation or getting customers to their destination within 14 minutes of their scheduled arrival time. So if you look at getting our customers to their destination within 30 minutes, our on-time performance increased to 81.7%, and it was 90.4% within an hour. Well, we always want to be on time, but my point is, is that we are currently canceling very few flights, and we're consistently getting the vast majority of our customers to their destinations within a reasonable amount of time.\n\nWe are focused on improving our A14, and we know that the primary challenge is operating tempo. And I talked about this last quarter, but I think it's worth repeating. Our operating tempo is being impacted by the sheer number of new hires starting work. We've got more leisure customers that are in our load factors, the airport environment as well as air traffic control challenges from both weather and staffing.\n\nAnd all of these things tend to require more time and are causing us some delays that just didn't exist pre-pandemic. However, we have made solid progress toward our historical operational results, and we're doing that at nearly pre-pandemic capacity levels. We aim to continue improving. We've got great momentum here in October with our on-time performance running in the low 80% range.\n\nWe continue to hire and train new employees. And that should have us well prepared for the upcoming holiday season, and we should continue just to get better as we continue our network restoration through next year and get even more employees through training. And just a couple of more thoughts on hiring and training. We continue to hire most work groups in focused locations, and we still expect to add over 10,000 employees this year net of attrition.\n\nWe just -- we aren't just hiring for this year, though, we're hiring to support the spring and the summer of 2023 so that we have a more seasoned workforce in place. Our pilot hiring and training continues to be the pacing factor for growth as we move forward. We continue to attract high-quality pilot candidates, and the training program to onboard a new pilot to Southwest Airlines are robust. We're operating at our maximum training capacity for pilots, and that will continue well into 2023.\n\nAnd then just last, but certainly not least, I do want to congratulate my friend, Andrew Watterson, for his new role as chief operating officer. I've been doing that role for almost 17 years, and I know Andrew is well prepared to take on this role. I know he's going to continue driving to modernize the operation. He's going to bring a new perspective and energy that will serve our company well.\n\nAnd I'm looking forward to transitioning into an executive advisor role early next year and assisting Bob and the Southwest team on a variety of matters as needed. I would like to thank all of our employees for their hard work. I especially want to say thank you to the entire operations team that I've been a part of and have had the pleasure to support all these years. Southwest is truly a championship team, and I am grateful that I will continue to be a part of it.\n\nSo with that, Ryan, I will turn it back over to you.\n\nRyan Martinez -- Vice President, Investor Relations\n\nWell, thank you, Mike. We have analysts queued up for questions. [Operator instructions] Operator, please go ahead and begin our analyst Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from Andrew Didora from Bank of America. Please go ahead with your question.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good afternoon, everyone. Tammy, two quick questions on cost here. I know you've been accruing for labor most of this year.\n\nBut do any of the -- does the recent deal from one of your peers change in any way how you accrue for your agreements going forward? And then second, on costs, does the low single-digit CASM growth that you outlined at last Investor Day after 2023 still seem reasonable in the current environment?\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nYes. Thank you, Andrew, for your question. And yes, we've taken into consideration all of the current labor deals as we've contemplated our accruals here. So all of that has been baked into the guidance that we've shared with you.\n\nAnd in terms of the -- our investor -- the goal set -- our longer-term goal set we laid out with you at Investor Day, I think we're in line -- still in line with those longer-term goals. So clearly, we've had some choppiness here in terms of the rate that we're bringing back aircraft and employees and restoring the network, so that created some lumpiness in our cost trends. But we've done our very best here, at least looking ahead for 2023, to include all of those inflationary pressures and the guidance that we provided to you this morning.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nAndrew, this is Bob. Yes, I agree with Tammy. The goals stand. The -- if you're thinking that -- you saw we noted that deliveries as an example only, some of this delivery -- these delivery issues with Boeing could persist into '24, so you could still be, to some extent, wringing out some of the inefficiencies that are caused by some of that and just still folks entering training, going back to -- going out under the line.\n\nSome of that could persist early into '24, but no, absolutely, all the goals stand.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Understood. Then second, Tammy, nearly $14 billion in cash on the balance sheet. With the move-in rates, just -- how are you investing this cash? And how should we think about interest income going forward into 4Q? Because it looks like it's reaching a level where it offsets your interest expense.\n\nSo any color there would be great.\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nYes. No, great question. You're absolutely right. We saw an improvement in our other expenses as we've seen rates improve here.\n\nSo yes, no, we are investing that cash in obviously what we consider to be secure investments, but we do expect interest income to continue to outpace interest expense.\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Scott Group from Wolfe Research. Please go ahead with your question.\n\nScott Group -- Wolfe Research -- Analyst\n\nHey. Thanks. Afternoon. I want to ask about the 4Q RASM acceleration.\n\nIt's different than others, but I guess your third quarter deceleration was different than others. Is this just noise around breakage from Q3? Or is there some real underlying acceleration strengthening in the RASM trend Q4 versus Q3?\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nScott, I'll just start for just a second, and I'll let Andrew chime in here. There is a little noise between the quarters, but I think really it's just -- it's the continued strengthening in the underlying business. You've got leisure trends, which are really strong. And there's been all kinds of talk about what's going on there, the blending of leisure and business and everything.\n\nWe are seeing leisure strength in what would have been typically off-peak period. As just an example only, in a typical period or a typical year, September would have been two to three load factor points under the summer just sequentially. And this year, we didn't see that. So there were about two to three points above that sequential trend.\n\nSo the leisure traffic is really, really strong. Coming off, we did have a dip in business in July and August, and then we got those trends reversed in September, and we expect to see strengthening in the fourth quarter from September's down 25%. So no, you're seeing -- it's more about the continued strength in leisure and business revenues in the fourth quarter than it is noise. Andrew?\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nWhat I'd add is, yes, we had some company-specific drags in Q3 that have either gone away or attenuated. And at the same time, we saw some business travel weakness there during the summertime, which was unexpected. But then as we exit the summer, we saw business travel pick back up. And business travel, in general, has had a nice line -- trend line of restoration from post vaccines till today, but it's had some kind of ups and downs unexpected times.\n\nAnd it took kind of a down, as Tammy said, during early Q3, and now it's kind of ticked back up. And so that, combined with some of the actions we took on a little bit less short haul that we sent out, I think those things combined and showed us good both volume and yield acceleration from Q3 to Q4.\n\nScott Group -- Wolfe Research -- Analyst\n\nOK. And then, Tammy, your comments about wanting to keep elevated cash, is that sort of a signal \"don't expect much in terms of buyback dividend\" or \"don't expect much in terms of size of buyback dividend\"? I'm just -- if there's any sort of more color you want to share there.\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nYes. I covered that pretty well in my remarks. Obviously, we want to get back to our long-standing tradition of healthy shareholder returns. And we continue to be thoughtful in our capital allocation decisions.\n\nClearly, we want to drive future growth and value. As you're aware, the PSP restrictions on dividends and share repurchases just expired at the end of the third quarter. And we'll -- as we look ahead to December, we'll discuss our 2023 plans with you in more detail, but I would just say that our capital allocation priorities really haven't changed. And as I said earlier, we have a long-standing dividend history, so reinstating a dividend continues to be a high priority for us.\n\nAs we've been doing here this year, we've been looking for opportunities to reduce our debt, and we'll continue to look for opportunities that make sense for us there. And importantly, we continue to invest in our company and our people and are certainly focused on wrapping up our negotiation of all of our open labor contracts. And at the right time, it will -- we do intend to resume share repurchases as part of our shareholder return equation, just like we have done in the past. So we're just trying to balance all of that.\n\nAnd again, not to -- I think it is important to repeat, we just -- all of this assumes that the demand environment remains steady. And certainly, we haven't seen any step back here as we are talking to you today, but we'll want to continue to monitor the environment. But so far, so good on that front. And we'll just keep you apprised of our plans as we update them.\n\nScott Group -- Wolfe Research -- Analyst\n\nSuper helpful. Thank you.\n\nOperator\n\nOur next question comes from Jamie Baker from J.P. Morgan. Please go ahead with your question.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nHey, good afternoon, everybody. So Tammy, a follow-up to Andrew's question and just so I understand the accrual mechanism. Hypothetically, if American and United ratified pilot contracts tomorrow with a 30% date of signing increase -- I'm being deliberate here -- you would upwardly adjust your accrual to reflect that? Or is it just a \"set it and forget it\" metric in your model?\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nI'm not going to speculate with you, Jamie, on any particular percentages, but we certainly take labor contracts and what market rates in -- as an input into our accruals. So we do monitor those and do our best job to estimate labor rates. But obviously, there are estimations involved with that. But it's not -- we don't -- we evaluate that every quarter and update as we feel is necessary, which is what we've been doing really starting back in the beginning of the second quarter.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nRight. Not to throw you off with the percentage. I was just being dramatic for the data. But I did miss it.\n\nYou say you do or you don't upgrade or update it every quarter to reflect what's going on in the market?\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nWe do.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nYou do. OK. Perfect. And then second, when listing priorities, both in your prepared remarks and in the last question, you tend to emphasize labor deals, and then you bring up the topic of capital returns.\n\nIs that deliberate? Or put differently, should we view labor deals as one of the criteria you need to achieve before reinstating capital returns? Or am I reading just too much into it?\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nYes. Jamie, this is Bob. And again, we're going to be talking with our board in the next month about just capital returns, and then we'll be sharing a lot more of this with you at our Investor Day in December. I don't know that you can be that prescriptive in terms of the exact order, but it's very important for us to get these labor deals done.\n\nI mean it's -- I think we have great employees. We want to reward them. They're highly paid today. We want them to be even more even better paid.\n\nYou're starting to see deals by others. You're starting to see us get some TAs out there. So I think it's clear the high priority would be the dividend restoration. And then as you've seen us, we've had opportunities to take -- to reduce debt, which we've done.\n\nBut no, the -- getting our labor deals done is a very high priority for our people.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nOK. That's great. The bump, it sounds, obviously, like your answer as well, too. Sorry about that.\n\nThank you.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nYou may have a package on the porch.\n\nOperator\n\nOur next question comes from Ravi Shanker from Morgan Stanley. Please go ahead with your question.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nThank you, everyone. Great to see the traction on the operational reliability there after, obviously, a little over a year of trying. So I just wanted to get a sense of how robust or fragile that is given -- like if we had a really bad winter storm or there was a huge surge in travel like for -- like one or two days during Thanksgiving or something, do you feel like there's enough slack in the system to be able to support that?\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nRavi, this is Bob. I want to just add one couple of topside things, then Mike could talk about the details. But I think there are several things in here that are just macro helping drive the operational improvement. Number one is getting staffed.\n\nI mean, when you're understaffed, it affects everything, you don't have margin to deal with any kind of issue, and we are so much better staffed today than we were even three to four months ago. Obviously, we have a ways to go with our pilots. But really, what's happening there is we just aren't -- we are just under-flying our aircraft because of that. The other big thing is we committed, I think, late in the spring, early in the summer, we committed to not republishing our schedules any longer because it's really hard on our employees, it's very hard on our customers.\n\nAnd then republishing just -- it's part of what adds operational difficulty. So post the summer, we are committed to not republishing schedules, and you've seen improvement operationally in September and a real improvement here in October. I think our OTP in October is low 80s and our NPS scores are in the 60s. And so yes, you're always going to have IROPs, but I think the base stability of the operation is much better for those reasons.\n\nBut Mike?\n\nMike Van de Ven -- Chief Operating Officer\n\nYes, I don't have much to add there. But we've been very purposeful in trying to make sure that we match our resources to our schedules for the whole year. And we've had really good experience over the summer in difficult weather conditions with high load factors, all that kind of things that would be an operational challenge during the holidays, and we were -- we navigated through all of them very stably. So I feel like we're really set up to perform well over the holidays as we go into Thanksgiving and the Christmas season.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nVery encouraging. And maybe just a follow-up. I apologize if I missed this, but you guys introduced a new fare class structure a few months ago. What's the update of that? What's the take rate like? And how much of a boost could that be to TRASM? How much are we seeing already? And how much could it be in '23?\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nIt's Andrew. The new fare product, Wanna Get Away Plus, is one we talked about at Investor Day last year, and we rolled out in Q2. It was part of the bundle of initiatives we said next year would give us about between $1 billion and $1.5 billion of EBIT. So we didn't break out the line item for that nor do we break out the take rate.\n\nWhat I have said and will say again is that the large majority of our customers will still buy the anchor Wanna Get Away, so this allows us to have more bite-sized sell-ups for additional features that customers will only pay for and don't have a huge cost of delivery for us. So some intangible costs, but don't have a big cost for delivery. And we have a cross-functional team whose job it is, is to take that product, which was delivered exceptionally well from a technical perspective, and move it to our inside target take rate for the customers. They're making great progress on that.\n\nThey've already done a different -- taking different actions on merchandising and on price and how they communicate to customers. And so we are seeing really good progress. It's on its track to hit the business case, and we couldn't be happy with it.\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nThank you.\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nMy pleasure.\n\nOperator\n\nOur next question comes from Duane Pfennigwerth from Evercore. Please go ahead with your question.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nHey. Thanks. Andrew, since this is your last call on commercial, I wanted to ask you a revenue question. So just longer term, how do you think about the stickiness of yields in the context of an inflationary environment? Do you think people should still be indexing their thinking to 2019? Or has the world changed? And how much of the yield environment would you attribute to capacity deficiency? How are you thinking about the new normal here?\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nWell, I appreciate the philosophical question on my last revenue call. But I think entire 2019 comps, so hopefully, next year, we'll start talking about 2019. You do have a supply demand mismatch right now in the industry. And you have a bounce-back from this recession that was stronger than any other recession that kind of I recall.\n\nAnd certainly, going back maybe one of the '80s, early '80s, those recessions had a V like this, but it was extraordinary. So it's unusual you have demand quickly outstripping supply like this. So it's going to take a while, I think, for the industry to have supply come back up. Because whether you have economic softness for next quarter, next year, whatever, it will keep chugging along and generating more demand.\n\nAnd given that some airlines are having trouble getting pilots and the airframers are having trouble kind of meeting their target delivery dates, it's going to -- supply is going to be hard to come by at an industry level for a couple of years now. So I think we have a couple of years where demand and supply may not be as aligned as it was pre-pandemic, which I think will have these yield tailwinds for a while. So that's about as far as I think one can reasonably see in this industry, but definitely a couple of years of supply headwinds and demand tailwinds.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nAppreciate those thoughts. And then maybe for Bob or whoever wants it, Southwest is a margin-focused company, in our opinion. But in any given year, you might have different priorities. So what is your guiding light for 2023 growth? Are you solving for margin expansion next year? Or has this COVID recovery been so unique that the goal is sort of capacity restoration and we'll worry about margin expansion beyond this 2023 transition year?\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nDuane, I think they all hang together. So we -- I mean we've got several goals. We need to continue to restore our ops reliability. We've got to get staff, that's really pilots, next year so that we can fly our whole fleet.\n\nThat enables the ability to restore the network. In other words, get all the stuff that we flew pre-pandemic back into the network. We'll be sort of 90% restored this summer. We think 100% fully restored by the end of next year 2023.\n\nWhy that's important is because that capacity is going back into markets that we were in, so they're going into markets that we are very strong in, we have a strong customer base. So it comes on at much less risk than opening a new market. So that ties into the revenue performance in the discussion because it helps. The -- but no, the goal -- on top of those goals in 2023, the goal is to grow revenues, to grow profits, to grow margins, and to grow returns.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nAppreciate the thoughts.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nThank you.\n\nOperator\n\nOur next question comes from Conor Cunningham from Melius Research. Please go ahead with your question.\n\nConor Cunningham -- Melius Research -- Analyst\n\nHey, everyone. Thank you for the time. You talked a fair bit about just training in general, and it seems like that's one of your biggest problems from a pilot standpoint. I'm just -- is there anything you can do to bolster the throughput there? Like I feel like this has been an issue for a while, and I'm just surprised that it hasn't been fixed, but like there hasn't been a better solution in the near term that could drive some efficiencies there.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nYes. Connor, I just want to clear up, sometimes it's confusing between hiring and training. We were having not -- we're having -- I just want to point this out. We're not having any trouble hiring pilots.\n\nWe're getting all the pilots, good, great pilots that we need. We're overbooking classes as an example. That's different than getting everybody through the training process. There's just a max capacity.\n\nWe have a lot of simulators, like we have 23?\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\n26.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\n26. We're adding three here. So we've got a lot of simulators, but the training pipeline is full. You -- Andrew talking about the whole industry being constrained.\n\nI think that's really what's going on in the industry is this constraint to the -- to some extent, hiring for some carriers, but really the training processes. So if you ask about what can you do about it, it's really difficult because the lead time on a simulator is years, as an example. So by the time you get that in, you don't need it any longer in terms of managing this bubble. So -- but the main point is the hiring is going great.\n\nThe training is full. Our plan this year was to hire 1,200 pilots, and we will hit that. The plan next year is to hire 2,100 pilots, and we will hit that. And then the plan is to have sort of the pilots catch the aircraft late next year so that we're flying the whole fleet, and that will be our plan.\n\nMike, do you want to add anything?\n\nMike Van de Ven -- Chief Operating Officer\n\nYes. I'll just jump in, Connor. So yes, our training throughput, we're at maximum training throughput with all of the infrastructure that we have. So we've got, I think, 26 bays.\n\nWe'll have 26 simulators in there at the beginning of the year. We're fully staffed on lighting structures to go do that. We've got enough check airmen to go do that. So we're just hiring a lot of new pilots.\n\nWe've got a lot of captain upgrades. And we have the normal recurrent training. So we'll be at maximum training capacity in 2023, and then it falls off, as Bob mentioned, in 2024 and beyond there. So we're not -- we're bringing as many pilots through our system as we can.\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nAnd I have to compliment Mike and Tammy on this. In the middle of the pandemic, where people are focused on day to day, they made the decision to expand our training facility by putting in more bays, to order simulators when no one else is doing either. So when we came out, we actually have more training capacity now than we had pre-pandemic by quite a bit. And so even though we're at capacity, this capacity was added during the pandemic when everyone else was thinking about today, they were thinking about tomorrow.\n\nConor Cunningham -- Melius Research -- Analyst\n\nI appreciate that detail. And just -- sorry, I'd like to piggyback on Duane's margin question. But -- so you still have a fair bit of inefficiencies in the '23 and some of your hedge benefits probably roll off. So we're kind of banking on revenue being really strong.\n\nAnd I'm not really asking about forward pricing, but is there any other levers out there outside of revenue that could drive sustained profits higher next year that just people aren't thinking about? I appreciate it.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nWell, you've got again strong revenue performance, and that's for a number of reasons. The other thing, you've got our initiatives coming fully online, as Andrew pointed out. So the contribution is sort of one to 1.5 EBITDA in 2023, and we've been right on track, hitting the contributions that we told you about in terms of our revenue initiatives. We have work to do on the cost front.\n\nSome of our cost pressures are what everybody is seeing, their inflation, in particular, wage inflation, some other categories. Another piece of that are inefficiencies that again, I would argue, almost everybody is seeing. They're just folks in training, not flying all your fleet, just not back to the efficiency levels that you were pre-pandemic. And so we've got an opportunity to work on -- we talked to you about this, especially in the operations area, is tools, processes, ways to take cost out of our -- of the operation, in particular, and we'll be sharing a lot of that at Investor Day here in December.\n\nConor Cunningham -- Melius Research -- Analyst\n\nOK. Thank you.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nThank you.\n\nOperator\n\nOur next question comes from Savi Syth from Raymond James. Please go ahead with your question.\n\nSavi Syth -- Raymond James -- Analyst\n\nHey. Good afternoon. Can I ask on the managed business revenue? Is the decline that you saw from June, is that a function of pricing? Or is that volumes as well? Because I know you gave a revenue kind of outlook here. And I'm guessing pricing has been softer just generally from kind of the earlier in the summer.\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nYes. We did see coming out from June to July and August, both some volume and yield softness in managed business, which then turned around in September and in October. And so it was clearly different behavior. As I mentioned before, there's been kind of the start-stop, start-stop of managed business from kind of post-vaccine rollout.\n\nAnd it's hard to get -- be super clear on exactly the drivers are, but we do hear lots of anecdotes over the summer of companies reinstating PTO caps. Therefore, people had to take PTO during the summer. Also, many companies put in place kind of hybrid work, but then had remote July, where you could kind of work remotely for the month of July. And therefore, you don't travel for business reasons.\n\nSo lots of these anecdotes fit with a summer slowdown in travel, but then resume post Labor Day with a nice tick-up post Labor Day, and that trend continued to accelerate from September into October. So not too much about why, but it was clear this is what happened and both volume and fare are improving now for managed business as we exit the summer.\n\nSavi Syth -- Raymond James -- Analyst\n\nThat's helpful. And if I might, I know that there's a lot of uncertainty around delivery, but I'm wondering if you could put a guardrail around 2023 capacity plans or just even a guardrail around maybe what you could see in terms -- what you think is realistic in terms of kind of fleet delivery from a low end and a high end.\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nI think what Bob said earlier that we're pilot-constrained until the end of next year. So a lot of what we're doing for the bulk of next year is really paced by our pilot training capacity, not by Boeing deliveries. Obviously, these are much more efficient aircraft about to fly, but it's not the delivery rate that's really constraining 2023 for the bulk of the year.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nAnd I think of -- you've also got -- this is the way to think about the capacity that we've given you. So we've given you the 10% in the first quarter and the 14% in the second quarter, probably gives you some guidance out of -- we're not ready to offer 2023 full year capacity, but to give you some way maybe think about that. Another just -- it wasn't exactly your question, but just to tie to that, when you think about the capacity for the first half of the year, the vast majority of that is just carryover from capacity that was implemented in 2022. I think, Andrew, it's upwards of 90%.\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nYes. Just around 90%.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nSo you got about 90% of that capacity is just stuff that's carried over from things that were added back as we restore the network in 2022, if that helps. The -- I agree with Andrew on the delivery front. I don't -- we don't see a scenario right now where the Boeing deliveries are reduced to the point where somehow that limits our ability to put into place the capacity that we want. Because, again, we're pilot-constrained in all likelihood through the end of the year.\n\nSo we -- again, our intent is we publish schedules, our intent through the middle of the summer our intent is to fly those. I don't think those will be affected by any delivery issues. And I do expect to, like all companies, as the year moves along next year, I don't want to speak for Boeing, but as you continue to work on supply chain, whether that's engine or parts or whatever, I would assume they'll begin to stabilize those deliveries. And so no, I don't think it will have an impact on 2023.\n\nSavi Syth -- Raymond James -- Analyst\n\nThat's helpful color. Thank you.\n\nOperator\n\nAnd our next question comes from Brandon Oglenski from Barclays. Please go ahead with your question.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nHey. Good afternoon, everyone, and thanks for taking the question. I guess can we stay on this topic of being constrained by pilots and network recovery? Because I think if we're reading your op stats correctly, you actually have a lower average stage length now than you did in the past. So I get it, maybe the composition of the city pairs is not the same as the past, but it would seem some of that long-haul flying that was challenging you in the past maybe is coming out of the mix here.\n\nSo can you just help us understand like where are you scaled from a pilot perspective today? If you could have everyone trained, like how large of a fleet could you fly? And how much more could you scale capacity from here?\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nI think it's really -- it's not a -- we've changed the network is the driver. It's we have -- we picked an order in which we have restored capacity. And so we chose to restore some of the short-haul earlier this year, a little bit of a bet on business recovery, a lot of bet of that helps the operational reliability, which is what we're seeing here in the last few months, which is different than we've got a different network post pandemic. And so I think it's really the order of restoration.\n\nAnd I'm not sure this is exactly answering your question. But if we could fly all of our aircraft, that is we had enough pilots to fly the aircraft on property, we would be roughly 5%, 6%, 7%, 8% higher percentage of capacity or ASMs this year right now. That's about how much more we could fly. It's really more that's the factor that it is the mix of the flying short-haul, medium-haul, long-haul.\n\nBut Andrew, you want to add anything?\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nThat's true. We -- from last summer through last winter, we had a much longer stage length because we had fewer short-haul. That did hurt, we determined, the network stability, a bad day can become a very bad day. And so to hedge against that, we restored the short-haul sooner than we would have otherwise paced at base demand in starting Q2 of this year, and that has proven a robust decision because when we've had bad days, it was a lot of bad days of the summer, we operated just fine, got through them, in contrast with some of our competitors.\n\nNow that does lead to a kind of imbalanced network, where the stage length is much shorter, as you pointed out. And so when we talk about restoration, we're send talking about adding a longer-haul -- medium- to longer-haul departures now through the end of next year to fully restore the network. It will bring it back in balance. But while I won't say we'll have every city pair has the same number of frequency had before, we will -- every city will have a kind of pre-pandemic network as far as what it's serving customers who want to fly for business, visiting the relatives and holidays.\n\nSo I think you'll see a kind of regular Southwest network stage length and composition by the end of next year.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nOK. I appreciate the response. And just maybe a quick follow-up for Tammy. So the outlook for improved full year CASM-X in '23, I guess that's really not that contingent on Boeing deliveries then, right? It sounds like it's more of the pilot training issue is the biggest constraint?\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nThat -- yes, I think that is a fair assessment and how our ability to bring on that capacity. So yes, I would agree with that.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAnd our next question comes from Chris Stathoulopoulos from SIG. Please go ahead with your question.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nGood afternoon. I was wondering if you could give some color on how your strategy in Hawaii has evolved now over the last three or so years. And you mentioned in your prepared remarks about incentivizing travelers to try Southwest. And I realized that fare special is in place through the end of the year.\n\nBut should we think that, that level of pricing, which is clearly unsustainable, could persist, perhaps not at that absolute level? But as you talk about incentivizing or making travelers aware of Southwest that, that level of pricing could persist into next year?\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nIt's Andrew. I'll start off and then Bob can correct me where he needs to. Obviously, we won't talk about forward pricing, but what I will say is the current pricing is we have a special in effect since really the end of summer, where we have a low price, and we guarantee that low prices for customers. This is not all uncommon.\n\nYou look back over Southwest history, and we've done this many, many times. So it's not unusual that we do this to incent travel. Kind of work backwards here, we -- Bob and I were there this past summer, met with a lot of customers, a lot of stakeholders. And we saw the -- they were aware of Southwest, they knew us, they didn't know about us too much.\n\nThey had not tried us as much. And so to kind of incent that trial, we had this low fare and we had it available all the time just to make it really easy for people to try us, and we've seen a kind of explosive growth and use by the -- the local customer to fly us for travel between islands. The travel between the islands is much reduced from what it was before. That's because the mainland travel from vacationers has come back to its pre-pandemic levels, but it had not come back interisland.\n\nIn general, we were visiting people, we're not traveling in an island as much as they used to back up before it was a monopoly. And so we wanted to get people back in the habit of traveling to neighbor island, there was a family, to go to football games, for all the reasons, one might in the mainland getting your car and drive. And so it was really about getting people used to a different behavior, which is you can count on low prices between the islands. And once you kind of get them back to knowing that they can adjust how they're going to allocate their budget, what they're going to do on the weekends.\n\nAnd we think that ultimately ends up to having a more robust interisland market compared to before when it was characterized by high prices of monopoly service. And so we think this is a pathway on to that. Now our schedule and also, at the same time, been changed. Our entry into Hawaii, we view as a franchise, and that franchise includes mainland flying as well as our neighbor island flying.\n\nAnd we kind of dimensionalize that based on customer feedback. So we went on to Hawaii well before we start flying. And we heard from people, \"Yes, great you fly from the Mainland Southwest, but can you please give us interisland travel.\" We had all kinds of sad stories of not visiting friends and relatives. And so we came and we put that back into our business plan.\n\nWe figured out a good network that will provide good robust reliability and customer options to have very short and very short interisland flying and some long-haul mainland flight, and the combination looks good on paper to us. We've kind of adjusted that based on feedback. We heard from a lot of the local customers, \"Please fly to Vegas.\" So we added Vegas to it. They said, \"Hey, Southwest, it's great you're offering options, but I need more -- a better schedule so I can get back home.\n\nBecause if you've ever been to Maui, they have very nice hotels, but they're quite expensive.\" So if you're a business traveler, you don't stay over, you come back home. And so you look at that and you think of business travelers as your white collar workforce, which is true in Hawaii, but they also have a blue-collar workforce that travels for business, construction workers, dock workers, trades people. And so they need to be able to get back home each night when they go to neighbor island to serve their customers. So that led us to having a bit more of a schedule offering that kind of span the day.\n\nPeople are going to have that round trip ability. And because we had started off a little bit more of a looser schedule in Hawaii because it was very new to us to fly such a long stage length, we're able to kind of tighten up our schedule parameters and really didn't use a whole bunch more new aircraft and new crew time because both are there and just not as productive. So we're able to kind of increase that offering without a lot of cost to us. So this all fits down to, I think, a franchise that's maturing.\n\nWe love it, and I think our product fits with the local customer, and they're responding in droves by our introductory offer.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nYes. I would just say, Andrew and I had the pleasure of spending a week in Hawaii in May, and it was -- it's clear that people love us, but they don't all know us. And this gives us a chance to introduce ourselves. It was also really clear a much better interisland schedule was something they really wanted and needed.\n\nAnd the last thing I would just say, I've been with Southwest 34 years, and we've gone in -- in my time here, we've gone into lots and lots of new markets, new cities and has grown some of those to what today are what we would call mega stations. And using introductory pricing to really introduce ourselves to the market and drive traffic is a tactic that we have used very successfully here for years and years and years. And this is very similar.\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nOK. And a follow-up. So if we look at U.S. domestic capacity in the first half of next year, narrow-bodies.\n\nThis is for the U.S. as a whole now. Narrow-bodies are up low double digits. Wide-bodies up a few points.\n\nRJs down, obviously not completely relevant to you. But as we think about the capacity plans that you outlined for the first half, but also the yield environment for next year. Is the base-case scenario that this mix of equipment for U.S. domestic travel as a whole normalizes or perhaps just in an easier way that these narrow- and wide-bodies return to their more natural markets?\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nI really -- I can't speak to the industry and what their plans are. I think if you look at it, especially with aircraft. If you look ahead at the sort of the intermediate term in terms of capacity, as Andrew noted, a lot of carriers' capacity will remain moderated for a while here. We suspect that's because of the same pilot constraints that we have, but it does look like it will remain moderated for a while.\n\nAnd I'll go back to what I said in terms of ARC. So how that how that interacts with the yield environment, I think we'll just have to see. But the best guess would be that for a while you do have moderated overall capacity. Again, if you look at us, we've got more capacity growth.\n\nA lot of that is carryover, but it is nearly all back into markets that we served pre-pandemic, served successfully, have an established customer base. And so we see that as very different than going -- putting all the service into new markets that then have to be developed. So those will -- that's why the plans next year include continued expansion of the revenue plan, continuing expansion of margins, continuing expansion of profits. So I see those things a little bit differently.\n\nBut no, we can't -- I mean, we can't manage the industry environment. All we can do is manage Southwest Airlines.\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nI would say that the -- Bob says we're going back in the markets we're in before. We know there's travel demand. We know that we normally would service that trial demand, yet we're unable to at this point in time. So we know the demand is there, right? So we'll put the supply up against that demand.\n\nWe think that makes us to be quite low risk. It's clear that other carriers are having trouble scheduling all -- or servicing all of their RJs. And so the regional flying is down right now. If you look in the forward schedules, it kind of pops back up.\n\nSo obviously, they're not going to get regional pilots a cliff change here in the next year. So it's unlikely that the capacity that's kind of out there in regional flying can actually be serviced. So you imagine that would come down as they true up their plans.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nOK. Thank you.\n\nOperator\n\nAnd we have time for one more question. We'll take our last question from Sheila Kahyaoglu from Jefferies. Please go ahead with your question.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nThanks so much and good afternoon, everyone. I just have two questions on labor, if that's OK. So first, when we think about your net new hires for 2022, it's about 10,000 folks or 15% of the workforce who will have less than one year of experience. So how do we think about the timing of getting those employees up to speed? And is there a CASM impact associated with that for 2023?\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nYes. No, we've thought about all of that as we've shared our guidance with you this morning. But yes, there's certainly an impact as we hire new employees. There is some dilution as a result of that, that offset somewhat some of the inflation that we're seeing.\n\nAnd of course -- but on the other hand, there is a penalty, if you will, because we are continuing to hire to fund future growth. So that probably washes itself out a bit as we look ahead into 2023.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nAnd I think some of the -- that proficiency question, which we've been asked a lot, is probably different by work group. So you take a pilot, and they come out of training. And you've got two pilots in the cockpit and your provision. In other words, you're not becoming more productive over time.\n\nYou're flying the aircraft, and you're fully proficient. Other jobs, on the ramp, for example, you're trained, but it takes a long time to understand the nuance of the job, you're paired with somebody else. Mike uses the word, get our temple back. You're just slow at first, scan and bag, that kind of thing.\n\nSo you've got other jobs that over time we will gain efficiency. And as folks in those jobs get their tempo or their full proficiency back. So I think it does vary by workgroup. But there is opportunity, for sure.\n\nOpportunity, for sure, 2023, to begin to bring those efficiencies out of the operation.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nThat's helpful. And then just another follow-up on labor. I think, at the Analyst Day in 2021, you targeted 80 employees per aircraft. And we've seen that step up to 86 per aircraft today, granted that's hiring ahead of the aircraft coming in.\n\nSo how do we think about that level normalizing?\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nWell, we'll be sharing a lot of this in December at Investor Day. I think the -- I think that normalization of that number is being affected by a number of things. It's just, again, it's the inefficiency in the system that will take, I think, all of 2023 to wring that out. It will take flying all of our aircraft.\n\nIt will take becoming proficient. It's also going to take modernization of some of our tools and processes, taking -- and again, we're going to share a lot of this stuff, using new tools and processes, taking paper out of the turn so that it takes less labor in some areas, as an example, to perform the same tasks. We also have to take a look on the other side of things like -- if we're going to continue to take -- I'm just making this up, but the MAX 8 for a while, like we have been in lieu of the -7, well, it takes an extra flight attendant to manage that aircraft. And so we're going to have to just think about the 80 in that context.\n\nBut the goal remains to be efficient in terms of employees per aircraft. And we'll share an update on our thinking and then how to close that gap at our December Investor Day.\n\nRyan Martinez -- Vice President, Investor Relations\n\nOK. Well, that wraps up the analyst portion of our call today. I appreciate everyone joining, and have a great day.\n\nOperator\n\nLadies and gentlemen, we will now begin the media portion of today's call. I'd like to first introduce Ms. Linda Rutherford, chief administration and communications officer.\n\nLinda Rutherford -- Chief Administration and Communications Officer\n\nThank you, Jamie, and welcome to the members of the news media to our call today. We can go ahead and jump right into our Q&A. So Jamie, if you would just give them some queuing instructions, we'll get started.\n\nOperator\n\n[Operator instructions] And our first question today comes from Alison Sider from Wall Street Journal. Please go ahead with your question.\n\nAlison Sider -- Air Travel Reporter\n\nHi. Good afternoon. I guess on the MAX 7 certification, just curious if you could share anything. When did it become clear to you that, that certification wasn't going to happen this year? And sort of how did you find out about it? And anything you could share about kind of your reaction as that situation has evolved?\n\nMike Van de Ven -- Chief Operating Officer\n\nYes, Alison. This is Mike. We talked to Boeing continuously, and they're working diligently with the FAA to provide the information we need to get the airplane certified. And at this point in time, Boeing believes that there's a chance to get certified at the end of this year or early next year.\n\nAnd so that's -- I don't have anything other to add -- anything more to add other than that.\n\nAlison Sider -- Air Travel Reporter\n\nAnd I guess has there been any frustration regarding reports that Boeing sort of have gotten behind in some of the certification paperwork or some of the submissions were incomplete and the FAA's reaction to that?\n\nMike Van de Ven -- Chief Operating Officer\n\nWell, there's just -- there's a lot of -- I mean, it's a new process, both Boeing and the FAA go through. So when you just think about trying to go through the process with all the information, first of all, you want to have a format of that information to flow to the FAA with. And then you agree on that, they need to gather all that information and submit it. There's an analysis that needs to be done and there's questions.\n\nAnd I think all of that just takes time, and it's brand-new and they haven't had to do it before.\n\nAlison Sider -- Air Travel Reporter\n\nThank you.\n\nOperator\n\nAnd our next question comes from Robert Silk from Travel Weekly. Please go ahead with your question.\n\nRobert Silk -- Senior Editor\n\nYeah. Thanks for taking my call. So some of the other -- the big three carriers that have been talking about a little bit of narrowing of demand, the variation in demand across days of the week and even across hours of the day due to hybrid work schedules and leisure travel. Are you all seeing any of that?\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nI think every -- after every recession, business travel demand changes, behavior changes a little bit. So we should expect this time for it to change as well. So we did see during COVID, when business travel was much reduced, we did see leisure travel and periods where you didn't see it before. So you still have more leisure travel in July than you do in September.\n\nThe surprise finding is there's more leisure travel in September than it used to be. And now during COVID, that led to kind of more -- you had peaks and valleys that were kind of more prevalent in COVID because of the absence of business demand. Now as business demand comes back, as we discussed earlier, and that leisure demand is staying. And that's a surprise.\n\nIt's not the case that, as we rotate out of the pandemic and go back into the office, that, that leisure demand goes away in the off period of time. It appears to stick. And so that's quite welcome. And so that does tend to dampen some level of seasonality, but you're still going to have that seasonality.\n\nIt's a welcome development and -- but they're still going to have peak season and off-peak season.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nAnd Robert, the only thing I would add, I do think it's interesting, I mean these are new phenomenon, right? So these -- some of this -- the leisure strength has been with us for a long time now coming out of COVID. We've had very strong leisure. But the sort of the shifting of leisure into some of the prior periods and strength in typically off months like a September and day a week and all those things, they're noticeable. You can see them, and they're real.\n\nWhat I think we want to be careful with is trying to decide that this is forever. I think as we continue -- as the business travel continues to restore and as people's work habits, if that's a piece of this, as they continue to move, I think it's going to take a while for all of this to settle down, and I do think it continues to change. So I would -- I've personally been slow to decide that we have a new trend, and that's the trend for a long period of time. What's really -- what we're focused on is whatever the why and this idea of blending business and leisure, the trends are really good.\n\nThe leisure trends are really strong. The business trends have come out of that dip and they are strengthening. So our revenue trends overall are really strong. They're strengthening further in the fourth quarter.\n\nI think we think they'll strengthen further in 2023. So that's the focus versus trying to understand in exact detail whether some of these things are forever.\n\nRobert Silk -- Senior Editor\n\nOK. Thank you.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nThank you, Robert.\n\nOperator\n\nAnd our next question comes from David Slotnick from TPG. Please go ahead with your question.\n\nDavid Slotnick -- Senior Aviation Business Reporter\n\nI think pretty much the question. Thinking about just MAX 7, are you -- do you have a contingency or a Plan B for it's not certified this year and if Congress chooses not to pass the ICAS extension?\n\nMike Van de Ven -- Chief Operating Officer\n\nWell, David, Boeing is very confident that they've got a path to either certification or an extension. And I believe that that's going to happen as well. But if for some reason, by the off chance it doesn't happen, of course, we have plan Bs, but we're just not publicly discussing them at this point.\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nAnd as Bob talked, we can easily tolerate that next year. In fact, our network plan and business plan for next year assumes no MAX 7 deliveries. And so you've already figured out that we can operate 2023, just fine with all MAX 8 and the 7s we have today. So beyond that, we continue to take in MAX sakes for a period of time as well.\n\nThe benefit of having such a decentralized network and kind of really good options around the country is that we can rejigger our network without kind of unwinding it. If you have a big hub and spoke, it's pretty fragile. You have to operate the hubs and spokes just like the hub is supposed to operate, otherwise you miss connectivity for us. we have a lot of flexibility moving our assets around.\n\nSo that gives us a much bigger tolerance in some to deal with this.\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nYes. And just one last thought just to emphasize again in our order book that we have with Boeing gives us tremendous flexibility. And there's a lot of detail in our release today, and we've been converting, as you can see there, to -8s along the way here. So we've been able to manage through really without any issues so far.\n\nDavid Slotnick -- Senior Aviation Business Reporter\n\nSure. And then just looking at holiday travel coming up, forgive me if you said it before, are you planning just given the extended holiday period for staff incentives or any other kind of staffing plan, just avoiding the issues that some carriers have last year?\n\nMike Van de Ven -- Chief Operating Officer\n\nWell, David, last year, because of the -- where we were in the staffing, we did have incentive plans to try to incent people to come in on their days off. But our staffing level is significantly enhanced this year. And then we spent quite a bit of time making sure that the schedules that we published we've got matched to our resources. So we feel well prepared to go into the holiday travel just like we did in the summer.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nYes. I think we're in so much better shape. The other thing just to remember, especially Christmas and New Year's last year, we were dealing with omicron. So in addition to being a little tighter than we would like on staffing generally, we went in two to three weeks, we suddenly had thousands of employees that were out with omicron at the tail end of December and early January, which made the staffing, it just really compounded that staffing question.\n\nSo that's really what you saw last Christmas and New Year's. We -- as Mike mentioned, we've had focus on -- like always on managing the summer really well and then managing these holiday periods like the 4th of July really, really well because obviously, they're important to our customers. And our -- Mike, I think our cancel rate was well under 1%. I mean, we had terrific operations during those summer holiday periods, and we will focus on the operation overall.\n\nAnd then, of course, the holiday period is this fall. But bottom line, we are so much better staffed. And again, we -- I know I mentioned this three or four times, we've not republished our schedules. And that schedule stability, it just makes our staffing even more efficient because our crews haven't been moved around just like our customers have moved around if we have to republish the schedule.\n\nDavid Slotnick -- Senior Aviation Business Reporter\n\nThank you. Appreciate it.\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nThank you.\n\nOperator\n\nAnd our final question today comes from Leslie Josephs from CNBC. Please go ahead with your question.\n\nLeslie Josephs -- Airline Reporter\n\nHi, everyone. Thanks for taking the question. Just curious on the pilot negotiations and flight and other negotiations as well. How much do you think those contracts are going to add to your costs in 2023 if you do reach a deal soon? Because inflation is much higher than when you started negotiating.\n\nAnd then on the pilot shortage issue, in general, are you in favor of any increase in the pilot retirement age or changes to training from the 1,500-hour rule? I know Republicans had some trouble with that. How do you think about that? And do you think there's a need for any legislative or regulatory changes there?\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nLeslie -- Mike, I'll talk about the rates, and then you talked about the other -- on the rates, as Tammy pointed, we constantly update those. And I'm not going to talk about negotiations here, obviously. We're in mediation with both our pilots and our flight attendants. And I'm hopeful that helps, and it helps move us to a deal sooner.\n\nBecause again, I want to get contracts, and we'd love to get them soon with our awesome employees. But we are -- as you look at both inflation and then as you look at deals that are occurring in the industry, we had Alaska just had a pilot deal last week, for example. As Tammy mentioned, we look at those and then we manage our accruals accordingly. And I would say, you never know until you get there.\n\nBut I would say, right now, it feels like we're were adequately accrued for all our groups beginning last April, of course, but I think our approvals look really reasonable to me. Now the markets really move. Who knows? But in terms of what we've seen happen so far, our accruals are very reasonable. And Mike, just the changes to the pilot requirements.\n\nMike Van de Ven -- Chief Operating Officer\n\nNo, we're not. I don't think we're interested in the pilot age going up further than what it is, and then the pilot requirements are fine with us the way they are today. We're -- I think we're an employer of choice. We have -- I think, really all of our labor contracts, when you look at the scheduling and the quality of life, the compensation, the benefits, the retirements, I think we have best-in-class contracts.\n\nWe had that coming into the pandemic. I expect we'll have those going out of the pandemic. And as a result, we're able to recruit all the people that we need. So we haven't had a problem recruiting pilots or any other workgroups for that matter.\n\nLeslie Josephs -- Airline Reporter\n\nThank you.\n\nOperator\n\nAnd this concludes today's question-and-answer session. I'd like to turn the floor back over to Ms. Rutherford for any closing remarks.\n\nLinda Rutherford -- Chief Administration and Communications Officer\n\nThank you, Jamie. Thanks to the members of the media for joining us today. If you all have any other questions, you can reach out to our RockStar Communications Group at (214) 792-4847 or you can visit us at our media website at www.swamedia.com. Thank you so much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRyan Martinez -- Vice President, Investor Relations\n\nBob Jordan -- Executive Vice President, Corporate Services\n\nTammy Romo -- Executive Vice President and Chief Financial Officer\n\nAndrew Watterson -- Executive Vice President and Chief Commercial Officer\n\nMike Van de Ven -- Chief Operating Officer\n\nAndrew Didora -- Bank of America Merrill Lynch -- Analyst\n\nScott Group -- Wolfe Research -- Analyst\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nRavi Shanker -- Morgan Stanley -- Analyst\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nConor Cunningham -- Melius Research -- Analyst\n\nSavi Syth -- Raymond James -- Analyst\n\nBrandon Oglenski -- Barclays -- Analyst\n\nChris Stathoulopoulos -- Susquehanna International Group -- Analyst\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nLinda Rutherford -- Chief Administration and Communications Officer\n\nAlison Sider -- Air Travel Reporter\n\nRobert Silk -- Senior Editor\n\nDavid Slotnick -- Senior Aviation Business Reporter\n\nLeslie Josephs -- Airline Reporter\n\nMore LUV analysis\n\nAll earnings call transcripts"
}