{
  "companyName": "COMPASS Pathways plc",
  "companyTicker": "CMPS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/compass-pathways-plc-cmps-q3-2022-earnings-call-tr/",
  "content": "COMPASS Pathways plc (CMPS -1.83%)\nQ3 2022 Earnings Call\nNov 03, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen. And welcome to the COMPASS conference third quarter call. [Operator instructions] And I would now like to introduce your host for today's conference, Steven Schultz. Sir, you may begin.\n\nSteve Schultz -- Senior Vice President, Investor Relations\n\nWelcome, all of you, and thank you for joining us today for our third quarter 2022 results conference call. We hope you've had a chance to review the two press releases we issued earlier today, summarizing our accomplishments this quarter and announcing the publication of the results of our phase 2b trial for treatment-resistant depression in the New England Journal of Medicine. Again, my name is Steve Schultz, senior vice president of investor relations at COMPASS Pathways. And today, I'm joined by George Goldsmith, our co-founder and executive chairman; our chief executive officer, Kabir Nath; Dr.\n\nGuy Goodwin, chief medical officer; and Mike Falvey, our chief financial officer. The call is being recorded and will be available on the COMPASS Pathways investor relations website shortly after the conclusion of the call. Before we begin, let me remind everyone that during the call today, the team will be making forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 as amended. You should not place undue reliance on these forward-looking statements.\n\nActual events or results could differ materially from those expressed or implied by any forward-looking statements as a result of various risks, uncertainties, and other factors, including those risks and uncertainties described under the heading, Risk Factors, in our quarterly report on Form 10-Q, filed with the U.S. Securities and Exchange Commission and in subsequent filings made by COMPASS with the SEC. Additionally, these forward-looking statements represent our views only as of today and should not be relied upon as representing our views as of any subsequent date. We specifically disclaim any obligation to update or revise any forward-looking statement, even if our estimates or assumptions change.\n\nWith that, I'll hand the call over to George Goldsmith.\n\nGeorge Goldsmith -- Co-Founder and Executive Chairman\n\nThank you, Steve. And welcome, everyone. It's with excitement and some sadness that I open this call as my final quarterly results call for COMPASS. I will serve as executive chairman through the end of this year to ensure a smooth transition and to continue to serve as chairman of the board thereafter.\n\nAfter my comments, I will hand the baton to Kabir, who will provide the business update. Guy will then cover our clinical progress, and Mike will provide a financial review. After our prepared comments, we will open the call to questions. I am pleased to report that we've made strong progress on our journey to create the future of mental healthcare.\n\nConfidence has been a leader in developing innovative therapies, combining a powerful investigational drug candidate, psychological support, and digital tools. We're running groundbreaking trials, already delivering promising results for treatment-resistant depression, and we're exploring new indications and avenues where clear patient need exists. We're joining forces with patients, healthcare providers, researchers, and governments so we can forge new pathways to better mental health together. And together, we have an enormous opportunity to make a difference in many people's lives.\n\nWe created COMP360 psilocybin therapy, an investigational drug candidate combined with psychological support, that could be developed into a regulatory approved therapy that patients can rely on and have that therapy reimbursed by insurance. Our groundbreaking phase 2b trial of COMP360 psilocybin therapy in patients suffering with treatment-resistant depression provided the scientific rationale to announce a robust phase 3 program, which has now had several clinical sites initiated. This phase 2b trial received strong validation through today's publication in the New England Journal of Medicine. We're honored to have the leading peer-reviewed medical journal published not once but twice on COMP360.\n\nI want to express my gratitude to those of you who have supported our work or will do so in the future. Everyone has a story. Working together, we can improve the outcomes of these stories. With that, I turn today's program over to Kabir Nath, COMPASS Pathways' chief executive officer, who will lead us through today's program.\n\nKabir?\n\nKabir Nath -- Chief Executive Officer\n\nThank you very much, George, and good day to everyone. It's now been just over three months since I took over as CEO of COMPASS Pathways. And it's certainly been an exhilarating learning experience. Even with my prior exposure to COMPASS through my work at Otsuka, including their investment in the Series B round in 2020, I found the level of activity and accomplishment here extraordinarily high, particularly as we finalize the design of our phase 3 clinical program and presented it to you on October 12 during our capital markets day.\n\nIn that program, we covered not only the phase 3 design, but also several other important aspects of our work, including our approach to psychological support and digital tools, as well as the advanced work we're already doing to ensure successful commercialization. I urge you to view the archive of that program, if you've not already done so. One of the most striking things in preparing for that presentation was for me to understand the depth and breadth of experience that the executive leadership team here at COMPASS brings to our mission. These qualities, their passion, and their commitment to the vision of COMPASS were all evident in the team's presentation on capital markets day.\n\nAs we look forward to the start this year of our phase 3 program for patients suffering with treatment-resistant depression, my main priority will be to move COMP360 psilocybin therapy successfully through the clinical trial, regulatory, and reimbursement processes. We will also ensure that it's delivered into the healthcare system together with psychological and digital support for patients who urgently need it. At Otsuka, I led the development and commercialization of pharmaceutical products and digital solutions addressing complex mental health needs and so gained significant experience in integrating pharmaceutical products with digital support. I'm very happy to report that in this really complex area, the COMPASS team is executing very well and focused on the right areas to ensure success.\n\nI'm also pleased to report to you that during this quarter, COMPASS continued to make steady progress toward preparations for our phase 3 program. We've been bringing both experienced and new clinical sites online and also adding to our cohort of trained therapists with very active recruitment and training underway. In the quarter, we also completed the analysis of our phase 2b long-term outcome study, which Guy will share with you in a moment. Beyond our phase 3 program in TRD, we have two ongoing COMP360 phase 2 trials in anorexia nervosa and post-traumatic stress disorder, or PTSD.\n\nTRD and PTSD represent large patient populations that are underserved by existing treatment options. Anorexia nervosa is also an area of very high unmet need. It has the highest mortality rate of any psychiatric disorder. And to date, no medicines have been approved to treat it.\n\nWith that, let me now turn to Guy, who will provide his thoughts on the next steps in our planned phase 3 program and also discuss the phase 2b long-term outcome study. Guy?\n\nGuy Goodwin -- Chief Medical Officer\n\nThank you, Kabir. And good day, all. Let me begin by reviewing our phase 3 pivotal program design, the details of which we communicated during our capital markets day presentation, which is available on our website in the investors section. As a high-level overview, we are focused on building an overall dataset which will form the cornerstone of our new drug application with the FDA.\n\nWe are also looking beyond the approval to launch as well by generating the evidence that we believe will support reimbursement for this novel treatment at scale. Our pivotal phase 3 trials are designed to answer two important clinical questions. First, can we replicate and reconfirm the compelling treatment response exhibited in our phase 2b trial? And second, what is the impact of an additional dose on the number of responders and the quality of the response seen in the phase 2b trial? To generate the data that answers these questions, we will conduct two clinical studies: a single dose monotherapy trial we've named COMP 005 and a fixed repeat-dose monotherapy trial named COMP 006. These designs can answer additional important questions, such as, how does the safety profile of COMP360 compare to placebo? And how may the response differ between one dose and two doses of 10 milligram or 25 milligram? We also recognize the need to look at long-term follow-up study that may include elements of durability and retreatment.\n\nLet me point out that the robustness of the phase 2b trial, 233 patients in 22 sites in 10 countries and seven languages, provides us with confidence that we can deliver a successful phase 3 results. Our phase 2b trial went far beyond the scope of what traditionally have been smaller signal-generating studies. The phase 3 patient population will also be essentially the same as in our phase 2b trial. That is the same definition of treatment-resistant depression and the same core inclusion and exclusion criteria, which aids in our extrapolation from the phase 2b trial to our phase 3 trial size empowering.\n\nBoth of our pivotal studies have a primary endpoint of change from baseline in MADRS total score at week six. The week six end point is consistent with previous trials in depression. We will also be observing the patients at periodic points along the way through the week six end points measurement. Providing more detail on the pivotal trial, COMP 005 is a single-dose monotherapy trial comparing a 25-milligram dose of three COMP360 versus a true placebo.\n\nDrawing upon the experience with phase 2b and the treatment effect we observe and taking into account a 2-1 randomization to 25 milligram, we have determined a trial size of 378 patients. We expect that top-line data from this trial will be available by the end of 2024. The second pivotal trial is the fixed repeat-dose monotherapy COMP 006 trial, with three arms comparing COMP360 doses of 25, 10, and 1 milligram. Patients will receive the same dose at day one and week three.\n\nWith the three dosing arms and the 2-1-1 randomization, we have determined the trial size of 568 patients. Top-line data is expected to be available in mid-2025. The third phase 3 program trial is a long-term observational follow-up study. The design of which will be influenced by the observations and results of the phase 2b follow-up study, which we announced today in our quarterly results.\n\nThe 66 patients entering the phase 2b follow-up study were in varying states of response and may not have been fully representative of the main study population. These limitations demand caution so that our conclusions are preliminary and require confirmation in the larger follow-up study we will conduct in phase 3. The primary end point of this phase 2b follow-up with the median time to a new depressive event. Depressive events are, for example, initiation of antidepressant treatment, hospitalization due to depression or suicidality, MADRS worsening, discontinuing -- discontinuation for adverse events, or lack of efficacy.\n\nThe time for such an event was longer, 189 days, for the COMP360 25 milligram group compared to the COMP360 1 milligram group at 21 days and the 10 milligram group intermediate at 43 days. The small group in the study that initially responded or remitted with COMP360 25 milligrams appeared to have durability up to approximately six months. Twenty-seven or 40.9% of participants had an adverse event that was ongoing or started after week 12. And a lower proportion of participants started new treatments for depression in the 25 milligram and 10 milligram arm versus the 1 milligram arm.\n\nSuicidality, which is a regrettable risk in this population, was recorded as an adverse event twice in 25 milligram group, twice in the 10 milligram group, and once in the 1 milligram group. These findings also dovetail into our investigation of what a second administration of COMP360 may achieve regarding durability, response, and remission. It will give us additional safety information beyond the more than 500 participants who have been exposed to COMP360 so far. And with that overview, Mike, I hand it over to you.\n\nMike Falvey -- Chief Financial Officer\n\nThank you, Guy. I will now recap our financial results for the three months and nine months ended September 30, 2022. For the three months ended September 30, 2022, net loss was $18.4 million or $0.43 per share compared with a net loss of $15.8 million or $0.38 per share during the same period in 2021. These results include noncash share-based compensation of $3.5 million dollars in 2022 and $2.3 million in 2021.\n\nFor the nine months ended September 30, 2022, net loss was $60.6 million or $1.43 per share compared with a net loss of $46.1 million or $1.17 per share during the same period in 2021. These results included noncash share-based compensation of $9.8 million in 2022 and $5.9 million in 2021. For the three months ended September 30th, 2022, R&D expenses were $14 million, compared with $12.2 million during the same period in 2021. The growth was attributable to increased personnel and noncash share-based compensation costs as a result of hiring to support our digital and clinical programs in addition to external consulting expenses.\n\nThis increase was partially offset by a slight decrease in external development expenses attributable to decreased clinical trial expenses, which we expect to increase substantially in the near future as we initiate our phase 3 program. For the nine months ended September 30, 2022, R&D expenses were $45.3 million compared with $30.4 million during the same period in 2021. For the three months ended September 30, 2022, G&A expenses were $11.6 million compared with $9.6 million during the same period in 2021. This growth was attributable to increased personnel and noncash share-based compensation costs due to increased headcount, as well as increases in legal and professional fees, facilities, costs, and other expenses.\n\nFor the nine months ended September 30, 2022, G&A expenses were $33 million compared with $24.5 million during the same period in 2021. COMPASS continues to maintain a strong financial position with cash and cash equivalents of $173.1 million at September 30, 2022 compared with $273.2 million at December 31, 2021. The change in cash of $100 million over the first three quarters was due to cash used in operations of $60 million and a change of $40 million due to the impact of exchange rates on our cash balances held in British pounds. We hold our cash balances in dollars, pounds, and euros in proportion to our spending plans in each currency.\n\nThe pound depreciated significantly against the dollar over the second and third quarters. And as a result, our pound deposits translate into fewer dollars on our financial statements. Since we intend to spend these pound balances rather than exchange them into dollars, the pound's depreciation is not expected to impact our operations or our cash runway, which continues to extend into 2024. We view our strong balance sheet as an important strategic asset, which we intend to manage carefully as we invest to advance these promising potential therapies, while at the same time continuing to create value for our shareholders.\n\nThank you, and I'll now turn the call back to Kabir.\n\nKabir Nath -- Chief Executive Officer\n\nThank you, Mike. In closing, we're excited to be moving into phase 3 with our core program, the COMP360 psilocybin therapy, in treatment-resistant depression. We've shown you that we have a robust, comprehensive program, which will answer key strategic questions around durability and the value of retreatment and which builds on the compelling data we demonstrated in phase 2b. We're confident that these answers will support both the COMP360 psilocybin therapy regulatory approval, but also provide the evidence needed by payers to reimburse this new therapy upon launch.\n\nThis strategy is highly differentiating in our area of science and will lead to significant value creation over time. In our capital markets day presentation, which I remind you is archived on our website in the investors section, we offer views into aspects of our business that have not been covered in depth previously. Specifically, we spoke about our commercial strategy and the extensive work underway to prepare for a COMP360 launch, plus our advanced digital initiatives and the innovative tools which support safety and optimize the experience for patients and provide support, rigor, and consistency for therapists. As George has often said, and as I will continue to reinforce, our goal here at COMPASS is to turn our vision of building the future of mental healthcare into a reality.\n\nAs we enter the final stage of pivotal development in TRD, our sight is set on achieving this goal, improving patient outcomes, and creating value for health systems by combining our medicine with psychological support and digital innovation. We'll now open the line for questions. Operator, please?\n\nOperator\n\n[Operator instructions] Our first question will come from Charles Duncan of Cantor Fitzgerald. Your line is open.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nYeah, super. Thank you, George and team, Kabir, for taking our question. And congratulations on the New England Journal publication. Very, very good to see.\n\nAnd a couple of questions on, yeah, on the pipeline, obviously. With regard to the long-term observational study that you mentioned for phase 3, is that needed to be complete before an NDA is filed? And if not, could you help us understand when finally it could happen after the other two phase 3s? And then for Guy, you read through it pretty quickly. I just want to check that, yeah, time to depressive events for 25 mg was like 189 days, and I think you said 21 days for the first -- the 1 milligram. You changed the order a little bit.\n\nKabir Nath -- Chief Executive Officer\n\nThank you, Charles. So, let me ask Guy to fix that second point first, and then I'll come back to your first question.\n\nGuy Goodwin -- Chief Medical Officer\n\nYes. Thank you, Charles. You heard correctly that the difference between the 1 and the 25 was 180 versus 21 days. Yeah.\n\nKabir Nath -- Chief Executive Officer\n\nAnd in terms of the first question, obviously, it's a bit premature to speculate on our overall regulatory strategy right now. But we view 005 and 006 as the pivotal trials from a regulatory perspective. You know, typically, the observational follow up would indeed be that. Clearly, it's very important to continue to monitor for new safety events in particular.\n\nBut you should regard the pivotal packages, 005 and 006. That should be the base case.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nOK. OK. And then, just one clarification, if I may, with regard to the phase 2b long-term observational. I guess I'm wondering if the patients that enrolled in the -- or rolled over to the OLE, were they equally representative in the three groups? And if you can provide a little bit of color on that.\n\nAnd when would you anticipate presenting the data? This is very interesting.\n\nGuy Goodwin -- Chief Medical Officer\n\nWell, quite simply, there was not -- they didn't have the same response rates as the whole population at three weeks. So, there were certainly some unrepresentativeness in the patients rolling over, shall we say. And of course, the numbers give us relatively small numbers in each cell. So, we're going to be kind of very keen not to over-interpret our data.\n\nWe think the field is -- have too much of that already.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nYes.\n\nGuy Goodwin -- Chief Medical Officer\n\nSo, I think the way we publish this, we'll be cautious. So, you know, it's sort of supportive overall of the main finding, but it's limited in how far it adds to what that may claim.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nI got it. So, really more definitive with the 006 -- or, excuse me, the phase 3 program.\n\nGuy Goodwin -- Chief Medical Officer\n\nThe phase 3 program will have the numbers and the incentives for patients to join this trial, which I think will be important for getting a really representative group of patients on whom we can base really important plans about how to deliver this treatment in practice with free treatment, etc..\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nVery good. Last question, 005, in terms of time to data, end of '24, I guess I'm wondering if you could provide us some thoughts on what is really governing that time? Could it prove to be overly conservative?\n\nGuy Goodwin -- Chief Medical Officer\n\nWe certainly hope so. You know, we're very much in the hands of others in this regard. We think we have a realistic and conservative plan. And, of course, if it delivers before that actual time that we've given, we'll be delighted.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nWell, I'm sorry, is it enrollment? Or is it therapist availability, or something outside of, say, the patient population?\n\nGuy Goodwin -- Chief Medical Officer\n\nI mean, we can't really say what will be limiting in any individual site. But, you know, the overall rate of recruitment, we believe, will be satisfactory to deliver on the times that we've given.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nVery good. Thanks for taking my questions.\n\nKabir Nath -- Chief Executive Officer\n\nThanks, Charles.\n\nOperator\n\nThank you. One moment, please, for our next question. Our next question will come from Neena Bitritto-Garg of Citi. Your line is open.\n\nNeena Bitritto-Garg -- Citi -- Analyst\n\nHey, guys. Thanks for taking my question. So, just another follow-up question on the phase 3 long-term data that you talked about earlier. I know you mentioned that in the small group of initial responders or remitters, durability appeared to be sustained up to six months.\n\nI guess, can you just define what exactly you mean there? Like, what proportion of the patients who were responders and remitters, week three, were actually able to sustain that response out to six months? And then, just a question on the New England Journal publication. I noticed that it looked like patients who had higher severity on MDD 17 at baseline performed pretty similarly on change from baseline in address versus those who had less severe disease at baseline. And so, I'm just curious if that's kind of consistent with what you had expected. Thanks.\n\nGuy Goodwin -- Chief Medical Officer\n\nIf I could take the second question first. You make an interesting point. And there are many trials that people try to rescue by making a cut with the higher-severity illness versus the lower. We were very pleased to see that there was really no difference between the two, the severe and the moderately severe groups.\n\nWe thought that was a big plus. But it's not what you always see with other trials in this area, particularly in MDD. We are, of course, in treatment-resistant depression, and that does change the perspective and expectations a bit. But overall, it was very gratifying to see quality of effect and good news for the patients who fall into the two groups, of course.\n\nI think the issue is about the numbers. The numbers are small. We are, at this stage, publishing them in great detail. And it's really not possible to say how many of the patients in phase -- because of the relative stratification of the rollover, we're not confident that we have an absolutely representative group in the 25 going into the follow-up.\n\nBut those who did continue to remain with scores which were either half of the original baseline score, which is definition of response, or in remission up to the six-month period from the dosing. So, I think we can say that of the patients we observed who had responded and remitted and showed stable response in remission in 12 weeks, they continued to show that remission up to six months in the 25-milligram group. But it's a very small number. And beyond that point, we lose people from the study for various reasons.\n\nYou know, that just happens. But it's very hard to keep people in the study with relatively little incentive, and, therefore, we end up with very small numbers. So, beyond six months, we can't really make a meaningful statement.\n\nNeena Bitritto-Garg -- Citi -- Analyst\n\nOK. No, that's super helpful. Can you just remind us to how many people actually enter the open-label extension for the extension period?\n\nGuy Goodwin -- Chief Medical Officer\n\nSixty-six. So, it's about 20 in each of the three. Well, actually, no. It was 66, but that included patients from 003, which was the study with SSRI, if you recall.\n\nThat included a few patients in that group. But we were looking at about 19 patients in each of the cells, as I recall. So, you know, that's getting to numbers that, although others have made a big deal about some of those numbers, we were really reluctant to do so.\n\nNeena Bitritto-Garg -- Citi -- Analyst\n\nGot it. OK. That's helpful. Thank you.\n\nKabir Nath -- Chief Executive Officer\n\nThanks, Neena.\n\nOperator\n\nThank you. One moment, please, for our next question. And next, we have Ritu Baral of Cowen. Your line is open.\n\nRitu Baral -- Cowen and Company -- Analyst\n\nGood morning, everyone. Thanks for taking the question. Guys, forgive me. I got a quick follow-up to Neena's question again, just on these figures and the idea that these are not representative patients.\n\nIs your comment on the representativeness based mainly on the response rate to the treatment seen in the blinded portion? Or is it a function of sort of as you look at the baseline of these patients versus the overall baseline of everybody heading in that makes you believe it's not representative?\n\nGuy Goodwin -- Chief Medical Officer\n\nIt's entirely based on the response rate.\n\nRitu Baral -- Cowen and Company -- Analyst\n\nGot it.\n\nGuy Goodwin -- Chief Medical Officer\n\nWe're just concerned that we don't have a fully -- you know, they're not -- obviously, they are themselves. They were eligible patients. You know, there's nothing wrong with them as patients within the group. It's just that, as a group, their composition is a little unlike the actual composition of the 233 patients in the blinded phase of the trial.\n\nIt's just the -- the extrapolation is a little tricky. And, you know, when you have 19 patients, as I say, we --\n\nRitu Baral -- Cowen and Company -- Analyst\n\nRight. And --\n\nGuy Goodwin -- Chief Medical Officer\n\nWill just be less. A bit small, really.\n\nRitu Baral -- Cowen and Company -- Analyst\n\nOK. Got it. That makes sense. On the phase 3 program, has FDA mentioned anything about a requirement for treatment in patients on background, SSRIs, as part of the phase 3? Will those be allowed in the long-term follow-up? Or is there a proportion of patients or a cohort that you might allow in 005 or 006?\n\nGuy Goodwin -- Chief Medical Officer\n\nNot in 005 and 006. We're still thinking about the -- we're close to finalizing on the long-term follow-up, but we will announce that in due course.\n\nRitu Baral -- Cowen and Company -- Analyst\n\nGot it. And then just in terms of 006, the fixed repeat-dose study, you know, how should we be thinking of what that top-line data will show with the two doses? Right now, in the body of evidence that you guys have seen and in the granularity, do you expect, I guess, better three-week or six-week efficacy rates? Or do you believe that that double dose -- in double treatment, rather, is a -- it will have more of an effect on durability?\n\nGuy Goodwin -- Chief Medical Officer\n\nWell, it's a good question, and it's the reason we're doing the work. So, I think we can have a hypothesis, which is that we will see higher rates of remission after two treatments, particularly 25. It'll be very interesting. We simply don't know about the 10 milligram.\n\nThat's why we're doing the study. And durability, yeah, we will be delighted if it turns out to be the case. But, you know, we don't have a hard and fast prediction on that.\n\nRitu Baral -- Cowen and Company -- Analyst\n\nGot it. Thanks for taking all the questions.\n\nGuy Goodwin -- Chief Medical Officer\n\nPleasure.\n\nKabir Nath -- Chief Executive Officer\n\nThanks, Ritu.\n\nOperator\n\nThank you. One moment for our next question. The next question will come from Patrick Trucchio of H.C. Wainwright and Company.\n\nYour line is open.\n\nPatrick Trucchio -- H.C. Wainwright and Company -- Analyst\n\nHi. Good morning. I have a follow-up question on the phase 3 COMP360 program in TRD. I think one of the changes for the phase 3 from the phase 2 is the need for one person to provide psychological support rather than two.\n\nSo, I'm wondering if, you know, first, can you confirm that change? And then, can you discuss the implications of the change, including the regulatory input received regarding it and how it would be expected to impact the phase 3 program and eventual commercialization?\n\nKabir Nath -- Chief Executive Officer\n\nThank you, Patrick. This is Kabir. So, let me take that. So, yes, we can confirm that for the administration session, there will only be one person, one therapist required to be present.\n\nI think, you know, from a without going into great detail around our regulatory strategy, clearly, you know, it is not our intent to ask the FDA to regulate psychological support. That's not their role. Their role is to regulate drug therapy. And therefore, there is, you know, discretion to some degree around how psychological support is provided, though, clearly that, again, is something that needs to be aligned as appropriate from the point of view of how we think about that going forward.\n\nI think it's important to recognize that a trial setting is clearly different from a potential commercial setting. You know, in a trial setting, we are having to prepare patients for the possibility of different doses. There's a very different set of preparation and expectation that's required for that. So, we are already working through some of the ways in which that may change when we actually get to commercialization.\n\nAnd as we talked about on October 12 as well, we are looking at ways in which we can look at different ways of optimizing psychological support, working with what are likely to be some of the commercial sites of treatments, such as the chains of clinics, ketamine clinics, and so on that we referred to at that time. So, there will be work in parallel with the phase 3 to look at how we actually do optimize the psychological support piece as well.\n\nGuy Goodwin -- Chief Medical Officer\n\nCan I add, Patrick, that I think is also key, and it's not sometimes appreciated that the psychological support is offered equally across the three or the two arms of the study. So, any differences we observe are clearly attributable to the drug. I think, sometimes, there's a certain amount of confusion about that. So, irrespective of what the psychological support is, it's equal across the three arms and the differences that emerge in the trial are due to the drug differences.\n\nPatrick Trucchio -- H.C. Wainwright and Company -- Analyst\n\nRight. That that's helpful. And then just a follow up on the therapists for the phase 3 TRD program. I'm wondering if you could provide some insight into the training process for the therapist participating in the phase 3 program.\n\nYou know, is this consistent with, you know, what has been, you know, kind of previously published around the COMP360 protocol? Or do they have to complete a certain amount of training? Or is it maybe, I don't know -- is it streamlined from that? And is there any prior experience, you know, administering psychedelic medicines required? And how quickly, you know, would you anticipate this ramp-up progressing, you know, to ensure you can enroll the study on schedule? And then, just finally, would there be expected to be sort of a synergy or benefit from the training of these therapists to -- who could then, perhaps, participate in, you know, other COMP360 trials, such as those, you know, looking at other indications like PTSD, anorexia, etc.?\n\nKabir Nath -- Chief Executive Officer\n\nYeah. So, Patrick, let me try and take those elements in sequence. So, first, the training is similar. So, what we provided on the phase 2b, but we have streamlined it.\n\nAnd in particular, a lot more of it is delivered online. So, TherapistCompanion, which is the app that is designed to work with therapists, enables us to deliver significant amounts of that online. But, yes, there is still a tailored training requirement for therapists who participate in the phase 3 trial. In terms of the recruitment of therapists, the way we do it is we clearly identify sites.\n\nAnd the sites themselves, one of the criteria is that the sites themselves have competent therapists that they are used to working with, and they nominate the therapists. They then go through a qualification process with us, followed by the training, you know. For phase 2b, we used around 65 therapists. For phase 3, we will need to use somewhere in the order of 250.\n\nAs mentioned in the prepared remarks, we're already well underway with actually interviewing those that have been identified by new sites and training them. And I actually do not see that as any sort of barrier in terms of getting recruitment in place. I think we are confident of that from a therapy perspective. Yes, we would envisage the same therapists potentially being able to support other indications, though, recognize that particularly for anorexia, there is likely to be some different training content.\n\nIt is a very different disease from treatment-resistant depression. And then, you know, I think the final thing I'd just say is, clearly, you know, the cohort of trainers in phase 3 will be the nucleus of what could be the commercial cohort. And also, we are looking to identify, you know, train the trainers and mentors among these who can actually help us then build scale in the therapy network.\n\nPatrick Trucchio -- H.C. Wainwright and Company -- Analyst\n\nYeah. That's really helpful. Thank you so much.\n\nKabir Nath -- Chief Executive Officer\n\nThank you, Patrick.\n\nOperator\n\nThank you. One moment for our next question. Our next question will come from Francois Brisebois of Oppenheimer. Your line is open.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nThanks for taking the question. Just one here on -- I guess, to start. In terms of going from a one big placebo equivalent to a real placebo, I was just wondering, obviously, in terms of the effect, there shouldn't be much there. But do you anticipate -- you know, how do you deal with patients not, you know, at this point knowing that they might not have anything at all versus, you know, in a trial where the 1 mg placebo ensures that patients know that at least they're getting some sort of side?\n\nGuy Goodwin -- Chief Medical Officer\n\nYeah. Thank you. You make a very good point. I think the dilemma is that the only way to establish a true safety baseline is to use placebo.\n\nObviously, the patient experience is something that we're going to try and understand, and we're going to look at expectations and just how that relates to outcome. And obviously, placebo is not without an effect in depression. And in fact, it is often a big problem in depression trials, to put it mildly. And we expect that the whole experience, the multiple visits, the long time in a clean, pleasant environment, even the introspection, which we know that some people actually find very immersive, is not without an impact.\n\nSo, we will be interested to see what happens. And it's also worth saying that some people who get 25 actually don't get much of an effect either. So, you know, it's not a completely cut and dry. But it's clearly, as you're indicating, it's more different than in the case of a 1 milligram versus 25.\n\nBut it's really the only way we can do the necessary safety baseline.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nOK. OK. No, that's helpful. And then, in terms of the new sites, just to add on a little bit to Charles' question maybe in terms of barriers to enrollment, like, you know, any trial has sometimes, have you ever run into the issue with sites, or PIs from sites, or certain therapists that just -- there's a different, you know, thought process because this is so new between believer sites maybe or more skeptical site in terms of your enrollment? Or has a lot of maybe the initial skeptics, post the phase 2b data, are actually, you know, probably more excited now to join the study? Just thinking enrollment here.\n\nThank you.\n\nGuy Goodwin -- Chief Medical Officer\n\nI mean, we have some very enthusiastic sites. If you watch the capital markets day, you will have seen [Inaudible] you know, is an example of that. I don't think we are looking for not excited sites, to be absolutely honest. I mean, we want people who will be keen to recruit.\n\nI think that we had a proper skepticism in the original PI group. I haven't heard any of them push back on our interpretation of the findings. And they have, you know, been happy to be co-authors. As you will have noted, all of the people who've contributed materially to the study were co-authors in the New England Journal paper.\n\nSo, I think we have a very solid basis of understanding to move forward through to other sites, to sites who will get this educational input from us about the experience and about the outcomes from phase 2. So, I don't think we should worry too much about this. I think it's not going to prove to be a major issue.\n\nKabir Nath -- Chief Executive Officer\n\nNo. Thank you, Guy. Any anything I'd add, just to remind you, is that it's also important that we actually work with lots of sites that do not have experience in psychedelic, just really important from a generalizability that we see that. You know, we have, again, as in 2b, we are ensuring that the number of patients with prior experience is capped at a low number.\n\nBut it's also important that, you know, for generalizability, we also have sites that don't necessarily have psychedelic experience beforehand. And to build on Guy's point, we do not see this as any sort of gating item in the recruitment process.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nUnderstood. And then, just lastly, in terms of filing on the regulatory side, you mentioned, you know, that you consider the two phase 3s, not the extension, to be, you know, pivotal. At the same time, I was just wondering in terms of the outcome, a lot of learnings from the repeat dose. Is it -- is there an angle where one might be more important than the other to be positive? Could you -- you know, ultimately, can you file with only one positive outcome, or do you need both? Thank you.\n\nKabir Nath -- Chief Executive Officer\n\nIt's a fair question. But again, I mean, I think as Guy answered to an earlier question, we have to run the trials. You know, we can't answer that question in the abstract. But we have designed a program that we think between these two trials answers key questions around, you know, what does a repeat dose do, perhaps, in terms of efficacy and durability, as well as the pure placebo comparison from a safety perspective.\n\nBut honestly and truly, you know, until we run both the trials and seen the data and, you know, discussed with the FDA, that would be a review issue.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nOK. Thank you, and congrats on the publication.\n\nKabir Nath -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And one moment for our next question. And then a question will come from Bert Hazlett of BTIG. Your line is open.\n\nBert Hazlett -- BTIG -- Analyst\n\nYes. Thank you for taking the question, and my congratulations as well on the publication. Just coming back to one element of the time-to-event analysis in the phase 2b follow-up. And I guess it's focusing more on reimbursement in general, taking a step back.\n\nIs that magnitude of data -- or that magnitude of -- of difference, should you replicate that, is that something based on your discussions with payers? And as you think about reimbursement, is that something that should be sufficient to support the level of reimbursement you were thinking about with this program? Thank you.\n\nKabir Nath -- Chief Executive Officer\n\nThat's a really good question. So, I think a couple of points. I mean, while we've clearly had a number of discussion with payers around our overall strategy, we have not yet advanced to the point of that sort of level of detail discussion of really, you know, talking our value models in detail, let alone actually putting a price into them to discuss with payers. So, it's somewhat early for that.\n\nI think, you know, as Guy has said, we would be wary of reading too much into 004 as an evidence base. But, you know, I think with what we are designing in 005 and 006, and the fact that there will be, you know, available at the time of talking to payers, some data from 007 from the long-term observational, I'm confident that we will have enough data for the basis of those discussions. But I, I wouldn't say that we have it yet.\n\nBert Hazlett -- BTIG -- Analyst\n\nThat's helpful. And so, would you consider then this type of data central to that discussion? Or is it maybe more of a focus on remission? Or could you just give maybe a little bit more about how you're thinking about building in a reimbursement argument, if you will, into the phase 3 program?\n\nKabir Nath -- Chief Executive Officer\n\nSo, I think the first place we would start is, you know, simply the efficacy and safety of either even a single dose or potentially repeat dose relative to anything else that is available for patients in treatment-resistant depression. So, I think, you know, at first base, we have a very compelling traditional value argument around the benefit we bring in treatment-resistant depression. I think that, you know, as we get closer, as we actually see the data from 005 and 006, thinking about how we might explore more innovative discussions around reimbursement, around the potential of treating remission, and what that looks like from a value perspective, those are certainly all options. But you know, candidly, until we generated the initial data, it's premature to talk about what that strategy might be.\n\nBert Hazlett -- BTIG -- Analyst\n\nTerrific. Thank you for that. And then just one more quick one. I'm not sure whether I missed the potential timing of the readouts for phase 2 and PTSD and anorexia nervosa.\n\nIf there's any guidance there, that would be helpful.\n\nKabir Nath -- Chief Executive Officer\n\nIn the latter part of next year, late '23.\n\nBert Hazlett -- BTIG -- Analyst\n\nOK. Thank you very much. Congrats again.\n\nKabir Nath -- Chief Executive Officer\n\nThanks, Bert.\n\nOperator\n\nThank you. One moment for the next question. Our next question will come from Esther Hong of Loop Capital. Your line is open.\n\nEsther Hong -- Loop Capital Markets -- Analyst\n\nHi, good morning. Thanks for taking my questions. So, I wanted to know first, how did the long-term data inform the repeat dosing study? So, 006. And then a clarification on how many days out for the 10 mg.\n\nI know there's about 189 for the 25 mg and 21 for the 1 mg. And then, I've got a follow-up on training. Thanks.\n\nGuy Goodwin -- Chief Medical Officer\n\nOK. Well, the intermediate number was about 50 days for the time being. If you want to compare it with the 21 and the 180. So, it was intermediate.\n\nAnd in a sense, what this is reflecting is the pattern of response in the first 12 weeks that you can kind of see. Sorry, what was your first question?\n\nEsther Hong -- Loop Capital Markets -- Analyst\n\nSo, how did this data inform the repeat dosing study?\n\nGuy Goodwin -- Chief Medical Officer\n\nI'm not sure it fully informed it really. I mean, the repeat dose study was really based on the considerations of the 12 week data and the full data set. I mean, this follow-up element, as you as you've heard me say is something that we are not taking as being very definitive but simply supportive of what we had already concluded from the phase 2b 12-week study.\n\nEsther Hong -- Loop Capital Markets -- Analyst\n\nOK. And then, just as a follow up. So, these patients will have placebo, which, you know, is probably -- as Kabir said, probably the best measurement. But in the real world, do clinicians want to see practicing prescribers? Do they want to see the potential to how this is used with SSRIs or antidepressants in combination just to have that antidepressant as a backstop? Will they want to see more data like the study that you previously conducted?\n\nGuy Goodwin -- Chief Medical Officer\n\nWell, no inclinations. The simple answer is yes.\n\nKabir Nath -- Chief Executive Officer\n\nSo, Esther, so, just to build on that. I mean, it is a great question. I mean, we have deliberately made the choice, as we said earlier, that these are monotherapy trials. We think that is still needed in order to truly demonstrate the efficacy and safety of COMP360 psilocybin therapy.\n\nBut -- you know, and we do not intend to run a significant adjunct program as a randomized trial. But as Guy says, we recognize the reality of what the use will be. And again, you can expect us over the next few years in parallel with the randomized trials to be looking at real-world studies and other things that may actually help to answer that question. So, yeah, we recognize the reality of real-world use.\n\nEsther Hong -- Loop Capital Markets -- Analyst\n\nGot it. And then, just to follow up on Patrick's question on training, so MAPS will have their phase 3 program completed pretty soon for MDMA for PTSD. I was wondering if there's overlap between training therapies between for that program for massive MDMA and COMPASS' COMP360 such that, you know, each -- there are potentially more therapists in each of these sponsors have trained. Thanks.\n\nKabir Nath -- Chief Executive Officer\n\nSo I can't comment on how MAPS is heading about choosing or training therapies, honestly, because I actually don't know. But, you know, we are very focused, as I say, on the sites we work with. They actually nominate therapists. We then go through that process ourselves of assessing and training them.\n\nI think, you know, the broader picture is, you know, in the long run, we hope and believe that a number of these different molecules will end up being successfully approved for a number of different diseases and so on. And is it feasible that there is tailored training for each molecule for each indication? Almost certainly not. And I think, again, as this space continues to evolve, as other companies advance to phase 3 and beyond, as we have, then I think you will see this evolve. But right now, we're focused on the therapies required for our programs, and we're doing that, you know, on our own.\n\nEsther Hong -- Loop Capital Markets -- Analyst\n\nAll right. Thank you.\n\nKabir Nath -- Chief Executive Officer\n\nThank, Esther.\n\nOperator\n\nThank you. One moment, please, for our next question. The next question will come from Sumant Kulkarni of Canaccord Genuity. Your line is open.\n\nSumant Kulkarni -- Canaccord Genuity -- Analyst\n\nHi. It's nice to see your publication, and thanks for taking my questions. I have two, both on the COMP360 phase 3 design. First, do you expect to conduct an interim analysis on your COMP 005 phase 3 trial?\n\nGuy Goodwin -- Chief Medical Officer\n\nWe don't expect to, no.\n\nSumant Kulkarni -- Canaccord Genuity -- Analyst\n\nThanks. Second, at this time, we know you've chosen a fixed repeat-dose trials at 006 with a relatively short time between the first and the second dose. So, either in your internal deliberations or those with the FDA, did this design compete at all with an as-needed to be dose design over the course of a year, for example, of which would be somewhat similar to, say, just short-line program on Zuranolone? That's a nonpsychedelic compound obviously for MDD but has some commonality in that it has elements of episodic therapy for a condition that's currently treated chronically.\n\nKabir Nath -- Chief Executive Officer\n\nYeah, it's a good question. I mean, I think, you know, recognize that we're still at the relatively early stages of demonstrating the profile of COMP360. So, the decision here was that let's answer, you know, the question that came up repeatedly of 2b, which is what is the effect of a repeat dose? And really, that's what we've set out to answer in 006. But from -- can it -- you know, as we said and answered an earlier question, can it enhance either efficacy or durability, particularly what might two 10s do, given that 10 was not an active dose in the 2b.\n\nSumant Kulkarni -- Canaccord Genuity -- Analyst\n\nGreat. And I'll squeeze one in on the anorexia trial. Do you think the EDE scale is sensitive enough to pick up differences in maybe diet conditions post dosing? Because this is such a different kind of treatment paradigm compared to the typical dosing paradigm, I would guess, in anorexia.\n\nGuy Goodwin -- Chief Medical Officer\n\nYeah, that's a great question. And we've been concerned about that. I mean, it is the type of scale that has been used in psychotherapy trials. And so, you know, obviously you start with where the light is.\n\nWe've added sort clinical global impression, which is kind of something that will grow out of a detailed analysis of the EDE. If someone conducts an EDE, then they will have a good way, a good basis for making a clinical global impression. But actually, we started on the program. Because we're in phase 2, obviously, a certain amount of experimentation is permissible.\n\nWe've started looking at how we should actually develop scales for our phase 3 program. So, you know, you're absolutely right to highlight this, and we're on it.\n\nSumant Kulkarni -- Canaccord Genuity -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for the next question. The next question will come from Jason McCarthy of Maxim Group. Your line is open.\n\nMichael Okunewitch -- Maxim Group -- Analyst\n\nHey, guys, this is Michael Okunewitch, on the line for Jason. Thank you for taking the questions. So, I guess the first one, I'd just like to ask on the bifurcated phase 3 program, basically interested to see how your initial thoughts on how it might work out for labeling and for commercial use in a scenario where you had improved efficacy on the dual dose, but it's still significant on the single dose. Would you expect this to result in, perhaps, two different approved protocols? And would you be looking at any potential digital mild biomarkers to kind of predict which patients would be likely to benefit from that repeat dose?\n\nKabir Nath -- Chief Executive Officer\n\nSo, it's a great question. You know, I think, again, we clearly are only in the early stages of determining what our ultimate regulatory strategy would be, but you could certainly envisage a relatively broad label for the treatment of treatment-resistant depression with the different studies in the label, because I think -- I'll ask Guy to comment on this, our expectation is that psychiatrists would want significant flexibility about how they think around dosing and so on. In terms of the digital part, absolutely. In the future, we clearly see that.\n\nAnd we spoke a little about that at our capital markets day. But to be clear, in the phase 3, we'll be testing many of our hypotheses in terms of collecting digital markers from patients through the myPathfinder app, subject to patient consent, of course. And we will actually be using the phase 3 data to test many of these hypotheses. So, I would not envisage that, at launch, we would necessarily have the digital support to indicate which patient might fall into a single dose or repeat dosing category.\n\nBut in the long run, that is certainly part of our aspiration.\n\nGuy Goodwin -- Chief Medical Officer\n\nI think I would add that, you know, we're going to also learn from the patient experience from whether or not one or two is preferable, and that will be invaluable in thinking about the commercial.\n\nMichael Okunewitch -- Maxim Group -- Analyst\n\nAll right. Thank you. And then just as a follow-up, given what you saw on the open-label extension with a time to the depressive event of around six months, are there any thoughts toward running a study to evaluate the long-term repeat dosing, such as dosing after a relapse, possibly as a post-marketing study to maybe support with reimbursement?\n\nKabir Nath -- Chief Executive Officer\n\nI think that's a great question. And again, I'll be candid. Right now, we've been focused on the pivotal programs. We know that they will answer some of the questions.\n\nBut by no means all the questions, the long-term follow-up of these two will perhaps enable us to answer some of that what you've asked. But I, you know, I would expect that you would see, you know, whether it's COMPASS-sponsored post-marketing trials or other potential trials, real-world trials, that actually attempt to answer questions like that around, you know, the treat to remission or, you know, repeat at some point. And again, to build on your earlier question, clearly, having digital markers available would be, you know, both very relevant and very helpful to try [Audio gap]\n\nMichael Okunewitch -- Maxim Group -- Analyst\n\nAll right. Thank you very much. I really appreciate the additional clarity.\n\nKabir Nath -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. I see no further questions in the queue. I would now like to turn the conference back to management for closing remarks.\n\nKabir Nath -- Chief Executive Officer\n\nThank you very much, everyone. Thank you for the questions today. I think, again, this is a very big day for us with the publication of the New England Journal, which we are incredibly proud of. And again, reiterating the fact that we are excited that we are entering now the final phase of development of the treatment-resistant depression.\n\nWe have lots of opportunity to make a serious difference in outcomes for patients with serious mental illness. So, thank you for your support. Have a good day, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteve Schultz -- Senior Vice President, Investor Relations\n\nGeorge Goldsmith -- Co-Founder and Executive Chairman\n\nKabir Nath -- Chief Executive Officer\n\nGuy Goodwin -- Chief Medical Officer\n\nMike Falvey -- Chief Financial Officer\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nNeena Bitritto-Garg -- Citi -- Analyst\n\nRitu Baral -- Cowen and Company -- Analyst\n\nPatrick Trucchio -- H.C. Wainwright and Company -- Analyst\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nBert Hazlett -- BTIG -- Analyst\n\nEsther Hong -- Loop Capital Markets -- Analyst\n\nSumant Kulkarni -- Canaccord Genuity -- Analyst\n\nMichael Okunewitch -- Maxim Group -- Analyst\n\nMore CMPS analysis\n\nAll earnings call transcripts"
}