{
  "companyName": "Lineage Cell Therapeutics, Inc.",
  "companyTicker": "LCTX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/lineage-cell-therapeutics-inc-lctx-q2-2022-earning/",
  "content": "Lineage Cell Therapeutics, Inc. (LCTX -5.64%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the Lineage Cell Therapeutics second quarter 2022 conference call. [Operator instructions] An audio webcast of this call is available on the investors section of Lineage website at www.lineagecell.com. This call is subject to copyright and is the property of Lineage. And recordings, reproductions or transmission of this call without the expressed written consent of Lineage are strictly prohibited.\n\nAs a reminder, today's call is being recorded. I would now like to introduce your host for today's conference, Ioana Hone, head of investor relations at Lineage. Ms. Hone, Please go ahead.\n\nIoana Hone -- Head of Investor Relations\n\nThank you, Brianna. Good afternoon and thank you for joining us. A press release reporting our second quarter 2022 financial results was issued earlier today, August 11, 2022, and can be found on the Investors section of our website. Please note that today's remarks and responses to your questions reflect management's views as of today only and will contain forward-looking statements within the meaning of federal securities laws.\n\nStatements made during this discussion that are not statements of historical fact should be considered forward-looking statements, which are subject to significant risks and uncertainties. The company's actual results or performance may differ materially from the expectations indicated by such forward-looking statements. For a discussion of certain factors that could cause the company's results or performance to differ, we refer you to the forward-looking statements section in today's press release and in the company's SEC filings, including its most recent annual report on Form 10-K and its subsequent quarterly reports on Form 10-Q. We caution you not to place undue reliance on any forward-looking statements, which speak only as of today and are qualified by the cautionary statements and risk factors described in our SEC filings.\n\nWith us today are Brian Culley, our chief executive officer and interim chief financial officer, and Gary Hogge, our senior vice president of clinical and medical affairs. Brian will provide some prepared remarks, and then he and Gary will be available for questions from analysts. With that, I'd like to turn the call over to Brian.\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nThanks, Hone, and good afternoon, everyone. We appreciate you joining us on the call today. As you know, I currently am serving on an interim basis as the company's CFO. Several weeks ago, we initiated a nationwide CFO search with an accomplished recruiting firm, and we already are connected to some great candidates.\n\nSo I'm hopeful we'll have that position fill soon, and we will update you accordingly. Before I provide the business update today and identify a few events you can look forward to. I typically like to start off with a few general comments about the biotech environment and in particular, where I see Lineage within the field of cell therapy. Along those lines, one notable and recent event was yet another non-cancer cell therapy company, catching the attention of a much larger acquirer.\n\nIn this case, I'm, of course, referring to the acquisition of ViaCyte by Vertex. Although many investors focus on the oncology side of cell therapy and indeed, that is where cell therapy has established its strongest foothold. Additional success continues to occur among non-cancer cell therapy companies, such as through the acquisitions of Sema, BlueRock, most recently ViaCyte. And I would also include the partnership which we struck with Roche and Genentech as another significant event for the field of cell transplant medicine.\n\nReflecting positively on both IPS and ES companies and especially compared to some of the setbacks we've seen with certain mesenchymal or undifferentiated cell therapy companies. And as this field matures and more and more clinical data are generated, it increasingly appears that cell transplants when deployed in the right setting with the right delivery tools have the potential to become an important new branch of medicine. For this reason and others, Lineage will continue to try and position ourselves as a leader in this space through the combination of internal and partnered product development efforts. Thinking next about where Lineage sits within this emerging and promising field as a business and as an investment, I believe we continue to be in an environment where companies with three key characteristics may be in a better position than others to create value in the coming months and years.\n\nThose three characteristics are, one, having multiple years of cash. Two, having deals with big pharma companies. And three, having diversification through a portfolio of assets, preferably clinical-stage assets because those typically offer shorter timelines to approval than do preclinical ones. In those three features, cash, validation and a pipeline are attributes of Lineage, which I believe put us in a strong position to attract shareholder interest in the months and years ahead, and I'd like to touch on each of them briefly today.\n\nStarting with cash, it is clear that the biotech industry continues to be in a period of uncertainty and volatility. And for this reason, we have persisted with our disciplined use of capital. As of the end of the second quarter, we had a projected cash runway of at least two years. I will add that those two years do not include any cash milestones from the Roche agreement, which we may receive during that period.\n\nThis runway also does not include any revenues from business development deals, although we are putting greater efforts behind that area as well. As noted in today's press release, we expanded one of our existing agreements last quarter and have initiated multiple discussions for additional corporate alliances, which might help fund or otherwise enhance our assets. And as you know, we continue to be in close contact with SERM and intend to see grant support for the OPC1 program. We may consider SERM support for other programs as well.\n\nSo as I have said before and can reiterate again today, we believe Lineage continues to be in a period of good financial health, which allows us to focus on creating value across the spectrum of short, medium and most importantly, long-term time frames. With respect to the second attribute, validation from big pharma, everyone by now is aware of the alliance we entered into with Roche and Genentech last year for the development of OpRegen for dry-AMD with GA or as it is now called by Roche, RG6501. Although we're not able to share specifics, we're extremely pleased with the progress of OpRegen development since entering our collaboration with Roche and Genentech and the resources, which have been allocated to its furtherance. Most of the details are internal to the two companies, but I am able to say that during the second quarter, we made progress across all of the primary functional areas, including clinical, regulatory and manufacturing technology transfer activities, which are reflected in the additional $4.1 million of revenue recognized in the second quarter.\n\nLineage successfully completed additional manufacturing runs of OpRegen, along with their associated CMC activities. We continued with the planned technology transfer activities and held a series of joint advisory and separately joint manufacturing committee meetings, which are collaborative forums for discussion and planning for the next steps for OpRegen and its related activities. Long-term follow-up of patients from the phase 1-2A clinical study, which Lineage conducted is also ongoing. And most notably, those enrolled patients are still doing well, which supports the multiyear durability of a treatment effect with operegen.\n\nBolstered by the compelling body of data, which we generated from OpRegen in an early clinical trial, we will continue to work closely with the teams at Roche and Genentech to offer our support and experience and advance OpRegen ever closer to later-stage trials. We believe the results we have observed to date with OpRegen compare favorably against the various efforts focused on complement inhibition, which require a lifetime of frequent dosing, offer only a modest effect on GA progression and to our knowledge, have no or a minimal effect or benefit on visual acuity. For these reasons and many others, we're excited about generating further clinical data from this program as soon as possible. And thirdly, with respect to the diversification, which our promising and recently expanded pipeline offers to investors, the team made excellent progress in multiple areas with a particular focus on advancing certain clinical and regulatory steps, which are not only necessary to support any future trials, but also reduce risk across our portfolio.\n\nIn particular, efforts were made to prepare for regulatory interactions for both our OPC1 and VAC2 programs, which are necessary to support their next phases of clinical testing and spinal cord injury and oncology, respectively. And we also continue to engage in manufacturing and preclinical activities for our newly launched cell transplant programs for hearing loss and vision disorders. I'll add that activities which will support our regulatory interactions for OPC1 are nearing completion, which I believe is a positive reflection of our efforts to reduce cell therapy development timelines. Our new thaw and inject formulation of OPC1, which we manufactured via an improved and larger scale process has been undergoing preclinical testing, and I'm pleased to share today for the first time that our OPC1 cells from the improved formulation and process have successfully demonstrated functional recovery in a clinically relevant animal model for spinal cord injury, including improvement in gate coordination and motor performance, along with cell engraftment, which manifests as a reduction of the area of cavitation in the spinal cord.\n\nThese findings are consistent with prior data generated from a less efficient and lower scale manufacturing process, so we are delighted that our new and improved process has performed as intended in these studies. We expect that these results will be submitted and available for publication and review. In conjunction with our efforts on the cell side, the other cell side, we have been working on an improved delivery system for OPC1. We believe the novel delivery system, which we licensed from near gain will offer a safer and easier-to-use method for delivering OPC1, and I'm able to share today that most of the verification and validation activities for this delivery system, including its preclinical testing in support of a regulatory submission have been completed, which moves us closer to our goal of filing an IND amendment and testing the DFD clinically.\n\nWith both the cell and delivery activities making excellent progress this past quarter, we have reengaged with the California Institute of Regenerative Medicine, or CIRM, to open discussions about providing some financial support for this trial. We also have been reengaging with various industry and caregiver groups such as Spinal Cord Outcomes Partnership Endeavor, and American Spinal Injury Association, as well as with the contemporary thought leadership in spinal cord injuries and with prior study participants. Everything seems to be coming together nicely for the OPC1 program, which I will remind you, will include for the first time administering OPC1 to patients with chronic spinal cord injuries, not just sub-acute injuries in our planned clinical trial to evaluate the safety and performance of the novel delivery device. As OPC1 gets increasingly closer to returning to clinical testing, it's worth remembering why we are so excited to continue this program.\n\nNow, I won't repeat my usual comments about the enormous unmet medical need or the absence of any approved treatments but refer you instead to prior clinical data. The full study results from the 25 patients enrolled in the Phase 1-2A clinical study in sub-acute cervical spinal cord injury were recently published in the Journal of Neurosurgery Spine. In that publication, it was reported that OPC1 demonstrated an excellent safety profile and at one year post treatment, 96% of patients had recovered one or more levels of neurological function on at least one side of their body compared to an expected control rate of approximately 68% according to CSL. In addition, 32% of patients in that study recovered two or more levels of neurological function on at least one side of their body, which again is higher than what Steeves and Llull would have anticipated.\n\nFor these reasons and because there were many lessons learned from the initial trial of OPC1, which we aim to incorporate into the next study, we are very excited to put OPC1 back into clinical testing and evaluate the potential for our replace and restore technology to provide outsized clinical outcomes in spinal cord injury, not unlike our experience to date with the restoration of retinal tissue observed with OpRegen in the setting of dry-AMD. Moving next to our VAC2 program. We have similarly continued to make progress toward an IND submission in preparation for potential U.S. clinical testing next year.\n\nI'd like to remind everyone first that Cancer Research U.K. continues to follow patients in the phase one clinical study of VAC2 in non-small cell lung cancer, and the public release of clinical study results is entirely subject to their discretion and control. However, our team has received all the necessary clinical information, which is required to support the regulatory interactions which we are working toward in the U.S. Depending on the outcome from those FDA interactions, we would be permitted to conduct clinical testing of VAC2 at U.S.\n\nCenters for the first time. As we work toward those FDA interactions, I can update you today to share the following technology transfer of the VAC2 program from Cancer Research U.K. to Lineage, the Lineage team engaged in efforts to optimize the manufacturing process. The manufacturing team was able to successfully increase the production scale to a level compatible with early stage testing while also significantly reducing our cost of goods.\n\nI will add that part of the reduction in the cost of goods was due to scale, but a large amount of that reduction was attributable to new methods of production, which we deploy. The team also made marked improvements in the purity and functionality of the product candidate reflected in surface marker expression and in vitro functionality tests. I want to diverge for just a moment to highlight something, which I think has gone under the radar for some time. These manufacturing achievements, which I'm describing today reflect the third time for which Lineage's manufacturing team was able to meet ambitious production goals, goals which were unattainable by multiple prior sponsors and contract manufacturers.\n\nManufacturing specific cell populations in a reproducible and consistent manner is extremely difficult. And doing so using a process that can not only support initial clinical testing, but also have a line of sight on to a commercial platform is something we've done twice. First with OpRegen, then again with OPC1, and now we've nearly accomplished the third time with our dendritic cell program. I don't think we get full credit for our manufacturing capabilities today, but I do think awareness is rising about how the manufacturing portion of cell therapy product development is so critical and how doing it well can greatly reduce development cycles and avoid regulatory delays, the likes of which we have seen at some other companies.\n\nBut I also believe that with additional time and success, the capabilities and know-how of the Lineage's manufacturing team will be more fully appreciated. Returning back to our pipeline programs. I'll conclude by adding that we also have continued to advance our auditory neuron and photoreceptor programs. They both are proceeding through the required preclinical development manufacturing activities, which are necessary to support initial clinical testing.\n\nAnd as we generate data or have other interesting events, which we can share with you, you can expect updates from time to time on those two programs. Overall, our efforts at this time remain focused on conducting our share of the OpRegen development activities, as well as successfully completing a diverse set of regulatory preclinical and clinical events for our pipeline. Events, which will provide not only clarity on our development time lines, but also help de-risk and increase the value of our various assets. And because we're doing this work among the tailwinds of multiple years of cash, a big pharma partnership and a diverse set of unique yet related cell therapy assets, I'm encouraged by what the future may hold for Lineage.\n\nA handful of specific goals and objectives, which I'd like to invite you to be aware of include a planned interaction with the FDA in Q4, where we intend to discuss our OPC1 IND amendment submission to enable the clinical performance and safety testing of the novel delivery system in acute and chronic spinal cord injury patients. Second, a pre-IND regulatory interaction with the FDA also in Q4 to seek feedback on a VAC2 CMC nonclinical and clinical package to support U.S. clinical development. Third, evaluation of new partnership opportunities and/or expansion of existing collaborations, you saw recently that we are successful in expanding an existing collaboration with ABM for our HyStem technology and that we continue to work with our partner, Immunomic Therapeutics.\n\nBut we also would like to enter into additional alliances with larger economic benefits to Lineage and are aggressively seeking to identify opportunities to enter into such corporate alliances and help advance our assets. Fourth, we intend to submit a grant application to SERM for the continued support of the clinical development of OPC1. And fifth, we intend to generate preclinical data to support a pre-IND meeting with the FDA for our new auditory neuron program. We, of course, have other goals, but the ones that I've highlighted today, in particular, will provide additional regulatory and spending clarity and potential de-risking of our programs.\n\nWe believe that execution of these goals will continue to demonstrate our ability to successfully advance novel cell therapy product candidates. OK. With that, let me put on my interim CFO hat and turn next to our financial results. With respect to our balance sheet, we continue to be in a comfortable position as we expect to have more than two years of liquidity, not accounting for any of the Roche and Genentech milestones, which we may receive in the next two years nor for any business development or grant revenues, which we may receive.\n\nOur reported cash, cash equivalents and marketable securities as of Q2 totaled approximately $72 million. In comparison, our normalized net operational spending for the past two years was between $20 million and $25 million. So even though we likely will see that amount be closer to $30 million this year, we have more than doubled that amount in the bank and can continue to just focus on running the business. Total revenues for the second quarter were approximately $4.6 million, an increase of $4 million, representing an increase of over 700% compared to the same period in 2021.\n\nThe increase was due primarily to licensing fees in connection with the Roche collaboration agreement and reflecting our share of collaboration responsibilities. The largest portion of the activity attributed to this revenue was OpRegen manufacturing costs, but also include personnel, materials and clinical consulting expenses. As you may recall, we received a $50 million upfront payment from Roche in January on a cash basis, but on a GAAP basis, we are recognizing that $50 million over time as opposed to a point in time and utilizing an input method of costs incurred over total estimated costs to complete our performance obligations. The accounting recognition for the Roche upfront payment generally resembles a percent complete methodology but is a reflection of our proportional contribution and may vary from quarter to quarter.\n\nOverall, our revenue recognition for the second quarter was largely in line with our expectations. Total operating expenses for the second quarter were approximately $8.6 million, an increase of approximately $1.1 million compared to the same period in 2021. The increase was a result of increased R&D spending of approximately $400,000, primarily related to development activities in our new auditory neuron and photoreceptor cell therapy programs, as well as an increase in OpRegen related expenses to support the Roche collaboration. Furthermore, G&A expenses were up by approximately $700,000, mostly related to higher stock-based compensation and payroll and related benefits expense.\n\nOur loss from operations for the second quarter was approximately $4.2 million, a decrease of $2 million compared to the same period in 2021, resulting from the aforementioned $4 million increase in revenues and offset with a $1.1 million increase in operating expenses. The net loss attributable to Lineage for the second quarter was $6.8 million or $0.04 per share. And as we always say at this point in the call, it's important to remember that the variance between our loss from operations and our overall net loss is impacted by changes in the value of our investments, as well as by foreign currency exchange rate fluctuations related to our international subsidiaries. While these nonoperational fluctuations are important, we tend to utilize loss from operations as a more relevant measurement with regard to our clinical programs.\n\nTurning to the balance sheet. We reported cash and cash equivalents and marketable securities of approximately $72 million as of quarter end. And additionally, as disclosed as a subsequent event in our recently filed 10-Q, during July, we also received approximately $0.9 million in net proceeds from a warrant exercise at our subsidiary in Israel. As I mentioned earlier, we anticipate a modest increase in our normalized net spending this year compared to the prior year because our programs increased in number and continue to advance toward their next clinical trials.\n\nAnd we have certain performance obligations under the Roche agreement such as supplying OpRegen cells for the next clinical trial. But as I also noted earlier, we estimate our net operational spend for 2022 on a normalized basis will be less than $30 million. Overall, we intend to maintain the same spending discipline that we have adhered to so far and which has served us well in the past. We believe that this spending discipline, alongside our cash balance puts us in a good position to create value for shareholders from our investments.\n\nOur guiding principle at Lineage is to advance the emerging technology of cell transplant medicine and to show the potential for those transplants to outperform traditional approaches by providing the product attributes and rigorous clinical testing necessary to achieve commercially successful medicines in areas of high unmet need. To that end, we believe we have not only generated evocative data from our current clinical programs, but also have the opportunity to do so with our earlier stage initiatives. We've made significant investments in and improvements to areas such as production, scale, purity and delivery of our differentiated cells, which, overall, we believe, is a proven path to creating best-in-class products for end users and strong competitive advantages to protect lineages and our current and potential partner sales over the long term. We also are working hard to identify and execute on measures which can reduce cell therapy development timelines, which we believe is a new area of opportunity in this young field.\n\nWrapping up, as I speak with you today, we are confident in our cash position, our corporate alliances and our diverse portfolio of assets from which we can seek to optimize an attractive mix of development partnerships and internally developed programs. There is a lot to like about where we are today and much to anticipate from us in the coming weeks, months and years. We sincerely appreciate your support as we continue to position Lineage to become a leader in cell therapy and cell transplant medicine. And with that, operator, we are ready to respond to any questions from research analysts, which may be incoming.\n\nOperator\n\n[Operator instructions] Your first question comes from Mayank Mamtani with B. Riley Securities. Your line is now open.\n\nWilliam Wood -- B. Riley Securities -- Analyst\n\nThank you so much. This is William Wood on for Mamtani. Brian, congratulations to you and the Lineage team for another very productive quarter. Just a couple of questions from us here.\n\nSo just thinking about OPC1, maybe even in terms of OpRegen, where it sometimes takes a little bit longer for the sales to get in and really do what they're supposed to do and to really get the results you're looking for, obviously, already shown very nice results with OPC1 at one year. Just curious about some of the longer-term data for efficacy, potentially maintenance or even improvements or alternatively degradation of the recovery for our OPC1 treated from the side star or potentially even from earlier trials. Is that the recovery is maintained? And extra color, that would be great.\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nYes. So I'll invite Gary Hogge to comment. I think I'll just preface by saying it's a question we all have. I mean, how durable are these cells.\n\nThey continue to persist in patients. And so, potentially, they will essentially outlive the people that they are transplanted into. But Gary could be a little more specific about how long we monitor patients and how long we've seen these kinds of benefits.\n\nGary Hogge -- Senior Vice President of Clinical and Medical Affairs\n\nYes, sure. Thanks, Brian. So William, what we've observed to date is that the cells appear to persist at the site of administration so they don't migrate anywhere, they stay where they were put. And all systems on the MRI findings to date would say that they're durable up to the length of follow-up, which is greater than 10 years in some patients at this point.\n\nSo as we complete some of the additional animal models and look for the durability response in the animals, we didn't think that that will follow through with our individual patients. And one thing they were doing shortly is there'll be a management looking at the MRI finding, specifically to show that those improvements from the site of administration are maintained for a period of time. As Brian said, sometimes the patients with rehab also continued to improve, even if they don't necessarily gain multiple levels on the different assessments, but individual ability to move fingers or digits or risks can definitely improve quality of life. So we're also looking at being able to publish some of those data.\n\nWilliam Wood -- B. Riley Securities -- Analyst\n\nAlso curious, you've discussed a lot with potential partnerships or collaborations. I'm just curious where you've seen the most interest as far as from external programs looking at your specific internal programs, even considering also there's the most interesting manufacturing side of things? And then maybe kind of in addition to that, if there is a scenario where you potentially see sort of your manufacturing side spin out from the clinical development side or something to that degree? Just any extra information there.\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nYes. So as you know, I can't comment specifically on any discussions or any specific companies. What I'm able to say is that we are aware in particular, in an environment like we're in right now in biotech that there's trends benefit if you have a platform technology of working with multiple corporate partnerships because you're able to just conduct so much more, many more shots on goal, so much more productivity when you've got multiple parties working. The challenge for any company is if you have choices deciding how to sort of divide up a large either intellectual property estate or different parts of technology and sometimes parts of the technology overlap.\n\nFor example, there may be certain applications of intellectual property with respect to a manufacturing process, which we could deploy across related indications. And so, sometimes, you have to make decisions about how you're going to kind of divide up the pie if you have the opportunity to make those choices. So we're really keen to accelerate our product development because we obviously cannot manage 5 simultaneous pivotal trials. So we're really supportive and interested in business development.\n\nGenerally, with respect to more strategic considerations like manufacturing, I can't imagine scenarios where utilizing our manufacturing expertise could be valuable to our company. But I want to caution everyone that that does not mean turning into a lower-margin manufacturing CRO business. We'll always want to have a meaningful piece of the upside for any program. So I want to be clear that our jobs here involve creating value and sometimes that might mean you go in an unexpected direction in order to create that value, and that's OK.\n\nBut I do think that we recognize that our contribution and getting the best economics from any future deal is going to be driven by having a lot of value behind our contribution and not I would say, diminishing it or allowing us to get into relationships where we're not going to be paid a fair value for our contribution. So I recognize that that is very sort of a generic sort of response for reasons that you're already aware of. But nonetheless, these are the realities of how we view our business and what we have to offer.\n\nWilliam Wood -- B. Riley Securities -- Analyst\n\nYeah. No, that's. It's very helpful. I think I'll leave it there.\n\nI appreciate it, Brian. Congratulations again to you and the team and, yes, congratulations.\n\nOperator\n\nYour next question comes from Kristen Kluska with Cantor Fitzgerald. Your line is now open.\n\nRick Miller -- Cantor Fitzgerald -- Analyst\n\nGood afternoon. This is Rick for Kristen. We have two for you here. In the photoreceptor program, with the caveat that, of course, is in preclinical development still ongoing.\n\nAre you thinking about -- how are you thinking about potential learning that might be carried over from the OpRegen program in terms of delivery and the importance of covering affected areas of tissue in the ophthalmology space?\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nYes. I mean, I think one of the nice things about introducing another ophthalmology program is that there is much that we can learn, and we already have very established relationships in that space. So it was an easier area for us to get into. But let me again invite Gary to address some more specifics to your question.\n\nGary Hogge -- Senior Vice President of Clinical and Medical Affairs\n\nSure. So Rick, one thing is we've certainly got the experts in retinal physiology and disease cause disease at the back and call at this point is they're very engaged with the OpRegen data. So one thing we learned from OpRegen is delivery, delivery, delivery is critical. If you make the cells in the and they are the most functional, they will do their job as intended.\n\nSo the key alarms that would be early intervention, appropriate delivery in an area that is targeted to make a difference. So there are a number of diseases that impact the photoreceptors as you can imagine, and we're certainly open to considering all of those.\n\nRick Miller -- Cantor Fitzgerald -- Analyst\n\nOK. And maybe just one more. Looking ahead to regulatory interactions around OPC1, how are you thinking about how the preclinical activities that you mentioned could fit into the meeting? What do you believe regulators are looking for here?\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nWell, it's a tough question because it's sort of a moving answer. I think the FDA has been evolving in its own state of maturation in the field of cell and gene therapy. For example, I think that FDA has been increasingly interested in functional assay data from cell therapy manufacturers just to provide one example. We do know that they wanted to see specific to the OPC1 program, information about the device before they reviewed the information about the new process that we are utilizing.\n\nSo we're going to follow a sequential path there that they've outlined for us. But this is, I won't say, new territory, but there are not a large number of precedents for delivering cells like this to the spinal cord. So it's difficult for us to know and that, in fact, is part of the reason why we're trying to be comprehensive with our submission and get the agency as much information as we think they're looking for so that we can have some positive outcomes in an area which is breaking some new ground.\n\nRick Miller -- Cantor Fitzgerald -- Analyst\n\nThat's great. Thank you very much.\n\nOperator\n\nYour next question comes from Joe Pantginis with H.C. Wainwright. Your line is now open.\n\nJoe Pantginis -- H.C. Wainwright -- Analyst\n\nHey, everybody, good afternoon. Thanks for taking the question. If you don't mind, I'd like to ask CFO, Brian, a question first. I appreciate that you give the guidance about a little under $30 million or so for net spent this year.\n\nBut I was curious more specifically about the G&A line. That line tends to be a little choppy. Obviously, there are some noncash items that are included there. But I guess I would ask the question this way.\n\nEither does this quarter -- or I'm sorry, the second quarter number represent a baseline. Or how should we sort of view that with regard to the current rightsizing of the company's FTEs?\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nAs you know, this is my second tour of duty as an interim CFO. So of course, I'm not prepared to answer that question. So G&A was up only about $700,000, a lot of that is in fact, related to personnel. I am aware that many companies have been laying people off and that we are a bit of a salmon going in the opposite direction.\n\nThat's wonderful. I mean, that reflects that we're confident that we have the capital to be able to expand sensibly in this environment. And I also believe that we have a wonderful choices out there attributable to the fact that some very high-caliber companies are laying people off. And those people are going to be increasingly interested in a company like Lineage that has capital and some validation from big pharma, etc.\n\nSo I think that you could consider it to be more of a new baseline rather than a stand-alone one-off increase in the quarter because a lot of it is connected to personnel and we want to keep those personnel, but I think that's great. Change through growth and adding people is also going to turn into greater productivity and the breadth of what we're able to accomplish. So I'm really happy with where we've come in and our continued disciplined use of capital, and I'm particularly excited about some of the new hires that we've made and some of the candidates that we're continue looking at.\n\nJoe Pantginis -- H.C. Wainwright -- Analyst\n\nAnd then, I guess, my next question, I mean, it's surrounding Roche, and I know a lot of the details around my question are in the weeds of the confidential documents, but I guess I'll ask it this way. How far will you be taking? Or what do you feel you could share with us with regard to what your remaining responsibilities are with regard to manufacturing and CMC?\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nSo you're correct. The weeds are, in some places, so I think that they're redacting that information. So I'm not able to say really anything beyond what I shared today. Primarily, our contributions are around manufacturing for the next clinical study, completing the phase 1-2A study, which we already completed enrollment for, but we have to follow up patients.\n\nAnd we have sorted additional contributions largely in the form of sort of advisory I'd characterize them as advisory contributions. So it's really difficult for me to say anything more than that. However, as we do get closer and as some of the public information does get released, it will be easier for us to be able to either connect some dots or be able to make some explicit statements about the program, it's timeline, revenue recognition and everything in between those two.\n\nJoe Pantginis -- H.C. Wainwright -- Analyst\n\nAnd then my last question is more of a pie in the sky question because, look, you're very fortunate to have a strong cash balance, especially in this environment. And I'll preface my question by saying, obviously, you have a lot going on. So but with that said, would you be considering at any point? Or are you even bothering to look at any potential technologies or assets to bring in that might be complementary because of the depressed valuations that are out there?\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nI think the right answer is always yes. I think that in some environments, you're in a stronger position to be able to consider that. If you got a high equity price and a lot of capital, but I think the reality is that we are always looking at ways that we can accelerate the development of our programs. Are we spending more time thinking about those opportunities than we were one year ago? Yes.\n\nWe hired some additional personnel in business development and licensing, and that's one of their areas effort, but I would not say that we have an explicit campaign with narrow search criteria and an engaged investment bank to work on a project that would be beyond the scope of what we're doing. But when the phone rings and people want to talk about alliances, we always pick up and sometimes we're the ones that are dialing. So the answer is yes, but I also don't want to make more of it than our normal course of business, looking for ways that we can add or enhance to our business.\n\nJoe Pantginis -- H.C. Wainwright -- Analyst\n\nGot it. Thank you, Brian.\n\nOperator\n\nYour next question comes from Jason McCarthy with Maxim Group. Your line is now open.\n\nJason McCarthy -- Maxim Group -- Analyst\n\nHey, Brian, thanks for taking the questions. Two questions, and specific around VAC2 and one more broadly. But for VAC2, can you give us a sense of when we could see the Cancer Research U.K. phase one data in lung? Is that going to be this year? And how is that data going to be used to present to regulators for development in the U.S.? And my second question is more broadly, you had mentioned the Vertex ViaCyte acquisition.\n\nBut can you talk just a little bit about what we see is essentially most big pharmas and big biotech are now aligned or aligning themselves with cell therapy non-oncology initiatives?\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nSo question one is like itself a two-parter when VAC2 and then how would we use it. So I'll do Part 1. So it's up to Cancer Research U.K. and I'll just be very direct that one of the factors that led us to exercising our option to bring that program back was that we felt that it would move quicker in lineages hands than where it was.\n\nSo we don't know when that data will be available or published or presented. It's not our decision and it's not under our control. But when it does become available, we certainly will want to share it with everyone. And then, I'll hand off to Gary for how the information that we have collected can be useful to a U.S.\n\nfiling.\n\nGary Hogge -- Senior Vice President of Clinical and Medical Affairs\n\nYes. So one thing to keep in mind is that the endpoints, as he's shown on clintrials.gov are primarily safety at 5 years and signs of immune effector efficacy at two years. The last patient came on in February of this year. So that patient will take two years until February of 2024.\n\nSo we've got a ways to go for that patient, hopefully, because they continue to do well. We have the complete annual safety update. There are no untoward unexpected adverse events or serious adverse events, it's behaved as expected. Everything has been mild and well tolerated.\n\nAnd so, those safety data will contribute to our regulatory submissions and discussions with the agency. And again, we're focused on the FDA, but there are other regulatory bodies that we'd like to essentially consider as well.\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nAnd then returning back to your second question. This is a really exciting time in cell therapy because I think what we're seeing, and it would be a debated point. But my view of what we're seeing is that as data continues to be generated, the most promising data in my mind is emerging in the area of differentiated cell types going after areas like Type 1 diabetes and Parkinson's. It's not with the undifferentiated \"Adult cells\", the mesenchymal cells from adipose or umbilical cell.\n\nI think what's exciting in the seat that I sit in at Lineage and is shared with some of the companies that you have in mind when you're asking this question, are these non-oncology, so i.e., non-T cell non NK cell. Specific differentiated cell types that are used much like a bone marrow transplant. You are just manufacturing the cell type. The cell has a specific function.\n\nYou deliver it, you have to have a solution for how it can remain durable and not be rejected. But if the cells are there and they're functional, they may be able to provide that normal natural biological function that is somehow lost under certain conditions like dry-AMD with GA or Parkinson's disease or diabetes. And I agree with you entirely that it seems that more and more interest is being reflected by the international big pharma community, and they are sometimes making baby steps, sometimes making massive bites, but there does seem to be a trend in this direction, which I think is incredibly exciting because it is still a relatively early technology and early technologies get better with time. And so, I think you're going to see explosive growth in this field.\n\nI've been saying that for a couple of years. And I think there's increasingly evidence to support that. And it will just be a question of how high is the ceiling on this. And I believe it's very high indeed.\n\nJason McCarthy -- Maxim Group -- Analyst\n\nGreat. Thank you for taking my questions.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nIoana Hone -- Head of Investor Relations\n\nBrian Culley -- Chief Executive Officer and Interim Chief Financial Officer\n\nWilliam Wood -- B. Riley Securities -- Analyst\n\nGary Hogge -- Senior Vice President of Clinical and Medical Affairs\n\nRick Miller -- Cantor Fitzgerald -- Analyst\n\nJoe Pantginis -- H.C. Wainwright -- Analyst\n\nJason McCarthy -- Maxim Group -- Analyst\n\nMore LCTX analysis\n\nAll earnings call transcripts"
}