{
  "companyName": "Agree Realty",
  "companyTicker": "ADC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/agree-realty-adc-q3-2022-earnings-call-transcript/",
  "content": "Agree Realty (ADC -0.64%)\nQ3 2022 Earnings Call\nNov 02, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to Agree Realty third quarter 2022 conference call. [Operator instructions] I will now turn it over to Reuben Treatman, director of corporate finance. Please go ahead, Reuben.\n\nReuben Treatman -- Director, Corporate Finance\n\nThank you. Good morning, everyone. Thank you for joining us for Agree Realty's third quarter 2022 earnings call. Before turning the call over to Joey and Peter to discuss our results for the quarter, let me first run through the cautionary language.\n\nPlease note that during this call, we'll make certain statements that may be considered forward-looking under federal securities law. Our actual results may differ significantly from the matters discussed in any forward-looking statements for a number of reasons. Please see yesterday's earnings release and our SEC filings, including our latest annual report on Form 10-K, for a discussion of various risks and uncertainties underlying our forward-looking statements. In addition, we will discuss non-GAAP financial measures, including core funds from operations or core FFO, adjusted funds from operations or AFFO, and net debt to recurring EBITDA.\n\nReconciliations of these non-GAAP financial measures to the most directly comparable GAAP measures can be found in our earnings release, website, and SEC filings. I'll now turn the call over to Joey.\n\nJoey Agree -- President and Chief Executive Officer\n\nThank you, Reuben. Good morning, everyone, and thank you for joining us. Before running to our standard update, I'd like to take a step back to provide some observations on the current state of the market, as well as the steps we've taken to further strengthen our positioning in a challenging macro environment. Our recent capital markets transactions have bolstered our balance sheet with attractively priced capital.\n\nAt quarter end, our fortress balance sheet stood at approximately 3.1 times pro forma net debt to EBITDA, providing tremendous flexibility and enabling us to opportunistically execute as buyers and sellers continue to adjust to the market. Cap rates are creeping higher, most significantly in the merchant builder space, and provided us opportunities to take advantage of distressed situations. We have seen the levered buyer in a number of institutionally capitalized investors exit the market altogether or move significantly up the risk curve to drive incremental yield. As the bid ask spread continues to narrow and more sellers capitulate, our focus will remain on the strongest retailer in the country, with the balance sheet to execute their omnichannel strategy in a challenging retail environment.\n\nWe will not go up the risk curve in terms of tenant credit profile, single purpose assets, or private equity-sponsored sale leasebacks. Our working assumption is that attractively priced long-term debt does not return to the market for the foreseeable future. Hence, we are focused on unlevered returns on equity. We are very fortunate to have the balance sheet and cost of capital to still drive incremental spreads without leverage.\n\nOur focus continues to remain on per share AFFO growth while preserving the dry powder to execute on distress. I remind all investors that our company has thrived in times of economic uncertainty. We launched our acquisition platform after the great financial crisis and nearly doubled the size of our company during COVID. Candidly, I think the market has been ready for a reset for a while now, and I am confident that our team is ready to once again seize on the opportunities that will be forthcoming.\n\nMoving on to the third quarter activities, we selectively invested approximately $372 million in 121 properties across our three external growth platforms. Ninety-eight of these properties originated through our acquisition platform, representing volume of more than $360 million. The properties acquired during the quarter were leased to 39 tenants, including best-in-class operators of dollar stores, auto parts, farm and rural supply, grocery, home improvement, consumer electronics in the off-price sectors. The acquired properties had a weighted average cap rate of 6.2% and year-to-date record-weighted average lease term of 11.1 years.\n\nNearly 73% of the acquired properties will be used to invest in grid operators. During -- throughout the first nine months of the year, we've invested a record $1.2 billion in 328 retail net lease properties spanning 42 states. Over two-thirds of the annualized base rent acquired is derived from leading investment-grade retailers. These metrics demonstrate our continued focus on leveraging all three external growth platforms to execute on opportunities with best-in-class operators.\n\nGiven the increased visibility into our high-quality pipeline, we are increasing the bottom end of our acquisition guidance to $1.6 billion while maintaining the high end of our guidance at 1.7 billion. That said, we remain prudent and disciplined in how we deploy capital. Our investment activities were supported by almost $815 million of equity and debt raised during the quarter that fortified our balance sheet. At 9/30, we had over 630 million of forward equity in cash on the balance sheet with no outstanding balance and a revolving credit facility.\n\nMoving on to our development in partner capital solutions platforms, our team continues to uncover compelling opportunities helping to build the company's largest ever development pipeline. Our platform is uniquely situated to provide struggling merchant developers with the ability to lock in funding while providing us with additional opportunities to drive superior risk-adjusted returns. We continue to have dialogue with many of our retail partners to find solutions that fit their store growth strategies. During the quarter, we commenced two new developments in PCS projects, including one Gerber Collision located in Murrieta, California, as well as the Sunbelt Rentals in Wentzville, Missouri.\n\nWe also completed the development of two Gerber Collision locations, as well as in Burlington. Construction continued in 18 additional projects. In total, we had a record 25 projects either completed or under construction during the first nine months of the year, representing approximately $82 million of committed capital. Moving on to dispositions, we sold our Gardner-White Furniture store in Canton, Michigan for approximately $20 million during the quarter.\n\nAs noted on previous calls, this was the Art Van flagship we developed prior to the company's acquisition by T.H. Lee, which was subsequently released to Love's Furniture, and then, most recently, to Gardner-White. During that time we owned the asset, we were able to release this property twice, recapturing effectively 100% of rent without tenant improvement dollars. So, now three tenants in a pandemic later, we are ultimately selling the asset in an IRR of approximately 10%, which demonstrates our bottoms-up approach to real estate underwriting.\n\nThrough September 30th, we sold six properties for gross proceeds of nearly $45 million with a weighted average cap rate of 6.5%. Given our year-to-date activity, we are increasing the lower end of our disposition guidance range to $45 million while maintaining the upper end of our range at 75 million. On the leasing front, we execute a new leases extensions or options at approximately 192,000 square feet of gross leasable area. Notably, new leases extensions are options included in Dick's Sporting Goods in Saint Joseph, Missouri, and the Big Lots in Cedar Park, Texas.\n\nAt quarter end, our 2022 lease maturity stood at just 0.2% of annualized base rents. We're also in terrific position for the upcoming year, with only 1.5% of our portfolio wide leases maturing. At quarter end, our portfolio encompassed over 1,700 retail properties across all 48 continental United States, including 201 ground leases, representing 12.7% of total annualized base rents. Occupancy ticked up during the quarter to 99.7%, while investment-grade exposure stood at nearly 68%, representing a two-year stack increase of 530 basis points.\n\nOur portfolio is the best in the country and undoubtedly positioned to withstand any economic headwinds. With that, I'll hand the call over to Peter, and then we can open it up for questions.\n\nPeter Coughenour -- Chief Financial Officer\n\nThank you, Joey. Starting with the balance sheet, as Joey mentioned, we had another very active quarter in the capital markets, raising or settling almost $1.3 billion of capital. At quarter end, we had no floating rate exposure and approximately $252 million of cash on hand. In conjunction with no material debt maturities until 2028, we are well-positioned to withstand interest rate headwinds and volatility in the capital markets.\n\nIn August, we completed a $300 million public bond offering comprised of 4.8% senior unsecured notes due in 2032. In connection with the offering, we've terminated related swap agreements of $300 million, receiving approximately $28 million upon termination. Considering the effect of the terminated swap agreements, the effective all-in rate for the 2032 notes is 3.76%. The offering further staggered our maturities and extended our weighted average debt maturity to approximately eight years.\n\nDuring the quarter, we raised more than $500 million of additional forward equity. We sold nearly 1.7 million shares during the quarter via our ATM program, raising net proceeds of approximately $127 million. And in September, we completed a 5.8 million share forward offering for anticipated net proceeds of approximately $382 million upon settlement. In conjunction with the September forward equity offering, we settled all 8.7 million shares of outstanding forward equity, realizing net proceeds of approximately $601 million.\n\nAt quarter end, we still had 5.8 million shares anticipated to be settled from the September forward offering, representing anticipated net proceeds of approximately $382 million. Our capital markets transactions provided us with more than $1.6 billion of liquidity at quarter end, including cash on hand, full availability on our $1 billion revolving credit facility, and our aforementioned outstanding forward equity. As of September 30th, pro forma for the settlement of the 382 million of outstanding forward equity, our net debt to recurrent EBITDA was approximately 3.1 times. Excluding the impact of unsettled forward equity, our net debt to recurring EBITDA was approximately four times.\n\nTotal debt to enterprise value at quarter end stood at 24%, while our fixed charge coverage ratio, which includes principal amortization and the preferred dividend, remained at a very healthy level of five times. Moving to earnings, core FFO and AFFO for the quarter were $0.97 and $0.96 per share, representing 5.6% and 7.8% year-over-year increases, respectively. As I mentioned on prior calls, we continue to anticipate high single-digit AFFO per share growth in 2022, implying two-year stack growth in the high teens. As a reminder, Treasury stock is included within our diluted share count prior to settlement.\n\nIf and when ADC stock trades above the deal price of our outstanding forward equity offerings. The aggregate dilutive impact related to these offerings was $0.01 in the third quarter. During the third quarter, we declared monthly cash dividends of $0.234 per common share for July, August, and September. On an annualized basis, the monthly dividends represent a 7.8% increase over the annualized dividend from the third quarter of last year.\n\nWhile meaningfully increasing the common dividend over the past year, we maintained conservative payout ratios for the third quarter of 73% of core FFO per share and AFFO per share, respectively. Subsequent to quarter end, we again increased our monthly cash dividend by 2.6% to $0.24 per share for October. The monthly dividend reflects an annualized dividend amount of $2.88 per share, or a 5.7% increase, over the annualized dividend amount of $2.72 per share from the fourth quarter of 2021. General and administrative expenses totaled $7 million in the third quarter.\n\nG&A expense was 6.4% of total revenue, or 5.9% excluding the noncash amortization of above and below market lease intangibles. We now anticipate that G&A expense will decline between 40 to 50 basis points as a percentage of total adjusted revenue compared to last year from a prior anticipated range of 20 to 50 basis points. Total income tax expense for the third quarter was approximately $720,000. Our expectation for total income tax expense this year remains between $2.5 million and $3.5 million.\n\nIn summary, are well-positioned balance sheet affords us tremendous flexibility with pro forma net debt to recurring EBITDA of 3.1 times and roughly 1.6 billion of liquidity to fund our robust investment pipeline. With that, I'd like to turn the call back over to Joey.\n\nJoey Agree -- President and Chief Executive Officer\n\nThank you, Peter. At this time, operator, we'll open it up for questions.\n\nOperator\n\n[Operator instructions] First question will be from R.J. Milligan of Raymond James. Please go ahead.\n\nR.J. Milligan -- Raymond James -- Analyst\n\nHey. Good morning, guys.\n\nJoey Agree -- President and Chief Executive Officer\n\nGood morning, R.J.\n\nR.J. Milligan -- Raymond James -- Analyst\n\nSo, I'm going to start with my boilerplate question of this earnings season. What's your current weighted average cost of capital? And how do you calculate it?\n\nPeter Coughenour -- Chief Financial Officer\n\nThanks, R.J. This is Peter. I'd say, first, we're always looking to get ahead of our capital needs so that we can retain flexibility in terms of how and when we access the markets. And to that end, we raise their set of $900 million of capital during the third quarter.\n\nThat was used to fund our acquisitions during the quarter but also provides a significant runway moving forward. The breakdown in terms of the capital raised during the quarter includes $300 million of long-term debt, issued an all-in rate below 4%, and we also settled $600 million of forward equity with a cost in the mid to high fives. So, blending that all together, we raised $900 million during the quarter at a weighted average cost of around 5%, weighted two-thirds equity and one-third debt. As Joey mentioned in his prepared remarks, with the debt markets effectively frozen today, our long-term cost to borrow in the six is assuming a new 10-year public issuance.\n\nAnd so, absent any changes in the debt, capital markets will likely look to fund the business using equity only going forward while continuing to utilize the revolver for shorter-term borrowings. Today, we have more than $380 million of outstanding forward equity available to us. That was raised at a cost in the mid to high fives. And any incremental equity issued would be at a similar cost based on our current share price.\n\nI think, most importantly, we're going to continue to be disciplined and prudent in terms of investing in incremental capital. We're not going to deploy capital if it's only marginally accretive. And at the same time, we're not going to go up the risk curve just to achieve better spreads.\n\nR.J. Milligan -- Raymond James -- Analyst\n\nGot it. So, I think it's fair to acknowledge, obviously, the prefunding that you guys have executed on over the past few months. There is a pretty long equity runway relative to some of your peers. And you've got a cost of equity capital that still allows for accretive growth.\n\nBut if cap rates are moving higher, the expectation is that they are going to move higher. Why accelerate growth into 4Q versus waiting for the market to move?\n\nJoey Agree -- President and Chief Executive Officer\n\nWell, I think, R.J., that's opportunistic for us. So, I anticipate cap rates in Q4 to tick up for us with a similar credit profile to the third quarter and a similar term profile to this quarter as well. So, I would anticipate taking advantage of the merchant builder market where there's an immediate need to recycle capital. And I think we'll see that in Q4 given the increase in the bottom end of our guidance.\n\nGoing forward, we'll take qualitative and quantitative aspects, obviously, both into consideration as we deploy capital. I think the bottom line is this. We've taken flak historically. Not from you.\n\nBut we've taken a flak historically for running a very low levered balance sheet, introducing forward equity into net lease space, which wasn't really overly welcome the first time. It was introduced to maintaining a conservative approach. So, these are the times, frankly, when that pays off. And at the same time, we're going to continue to run a low levered balance sheet, stay within our historical sandbox of investing in the best retailers in the world.\n\nBecause, at some point, debt will come back into the market. I don't believe it's going to be anywhere near the rates that we've seen given this super cycle. But we'll be in a position to add incremental leverage at that time.\n\nR.J. Milligan -- Raymond James -- Analyst\n\nThanks for that. Joey, you've been pretty vocal over the past couple quarters that you expect M&A and in the broader REIT space and maybe a net lease. And we just see one of your peers taking private recently. Do you think there's more M&A to come?\n\nJoey Agree -- President and Chief Executive Officer\n\nFirst off, congratulations to Mary and her team. I mean, obviously, that was a terrific outcome for them. But I think we are not only in the net lease space. I think there are a number of companies situated, given their cost of capital and potentially their balance sheets and/or their investment strategies, which aren't able to drive those spreads.\n\nAnd as you know, it's very difficult to come back in the REIT space once you have an impaired cost of equity especially. And so, our approach, our bent has always been conservative, you know, in preparation for what's next. We'll continue to follow, obviously, that historical approach here that predates my time in terms of balance sheet management. And we'll see what happens in 2023.\n\nWe don't have a crystal ball here, but I wouldn't be surprised to see more M&A activity across the across the REIT space.\n\nR.J. Milligan -- Raymond James -- Analyst\n\nThank you, guys.\n\nJoey Agree -- President and Chief Executive Officer\n\nThanks, R.J.\n\nOperator\n\nThank you. Our next question comes from Brad Heffern, RBC Capital Markets. Please go ahead.\n\nBrad Heffern -- RBC Capital Markets -- Analyst\n\nHey, good morning, everyone. Joe, in your prepared comments, you mentioned distressed opportunities sort of in passing. I guess, how frequent are those? And what do they look like?\n\nJoey Agree -- President and Chief Executive Officer\n\nWell, I think the most \"distressed\" we're seeing right now is those that are in the need to sell, the need to recycle capital. And so, what you'll see again for us in Q4 is opportunistically working with those developers that have pipelines that are delivered that need to recycle capital, that are historic merchant builders across the space, and have recognized that the 1031 buyer of the 2021 pricing there isn't a feasible option for them to recycle capital into new projects or into other ventures. And so, that is, I will tell you, the true distress that we're seeing today. Those are the first to recognize the immediate expansion in cap rates.\n\nThe second level is those with debt maturing or having a defined use for other proceeds -- for those proceeds. And we're seeing that as well. You know, the remainder of the market continues to lag with wishful thinking for that miraculous 1031 buyer, or frankly, the person, the buyer who thinks we're still in 2021, or an all-cash buyer. That's where we really see the bid ask spread remaining.\n\nWe anticipate that, hopefully, to see more capitulation for that narrow as well.\n\nBrad Heffern -- RBC Capital Markets -- Analyst\n\nOK. And then, you said you won't invest if it's only marginally accretive. I know, historically, you've solved for a spread of, you know, 150 basis points, plus or minus. So, if you're saying cost of equity is in the high fives, do you anticipate cap rates going above 7% for your sandbox eventually?\n\nJoey Agree -- President and Chief Executive Officer\n\nWell, I would tell you, would I anticipate cap rates going? I mean, I'm looking into my crystal ball. I think history here is a useful guide between 2014 and 2018. There was approximately $55 billion of single tenant net lease. Retail traded, the tenure averaged about 2.5% at those times.\n\nAnd the average cap rate was 6.5%. So, I'm not going to sit here today and say I believe cap rates are going to go north of seven. That said, I have no idea what type of economic conditions we're going to be in 2023. I think if we're investing capital, and let's call it around 75 basis points unlevered on an accretive basis and high quality assets, with a later infusion of debt, again, not with the tenure at 2% and spreads back to 100, you know, with an all-in cost of 3%, I think we can get there.\n\nThat said, if we're unable to invest capital accretively, we're going to maintain our discipline. And so, we're not going to take this balance sheet to a leverage position. We're not going to get on a hamster wheel. Halloween is over.\n\nSo, we're going to find the best opportunities. What I can tell you is this. I can guarantee you that this team and this company will lead the cap rate expansion in our given space. And that's without going up the risk curve.\n\nThat's without moving into private equity-sponsored companies out of sale leaseback basis. That's without looking at short duration risk on assets. It's going to stay within our confines of what we're best at.\n\nBrad Heffern -- RBC Capital Markets -- Analyst\n\nOK. Thank you.\n\nJoey Agree -- President and Chief Executive Officer\n\nThanks, Brad.\n\nOperator\n\nThank you. Next question comes from Josh Dennerlein of Bank of America. Please go ahead.\n\nJosh Dennerlein -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Hey, guys. Joey, I want to explore your comment on the competitive debt, not returning the market anytime soon. I guess, what are you looking for when it comes to kind of recapping the debt markets? Or what or how do you really describe, like, competitive debt? Like, what does that mean to you guys?\n\nJoey Agree -- President and Chief Executive Officer\n\nWell, I think, look, first of all -- first off, I mean, debt today is outside our cost of equity. I mean, that's first off. So, I mean, there really is no true debt market today, especially in the 10-year unsecured space. I mean, obviously anyone can look at where investment-grade paper is trading today.\n\nWe've never historically been a short-term borrower. We're not going to run a significant balance on the facility and on a variable basis. So, debt, obviously, has to be accretive relative to our cost of equity. I think that that's the threshold.\n\nFrom there, we'll see -- look, I already said, I think the super cycle lower for longer is over. That's my best guess. But at the same time, maybe it's wishful thinking. I would hope in the back half of next year that we'll see a debt market that materializes and truly becomes a market again that is rent -- that companies are able to obviously raise debt capital in.\n\nJosh Dennerlein -- Bank of America Merrill Lynch -- Analyst\n\nAlright. And how are, like, sellers -- like, do they understand the change in the cost of capital that buyers have today? Like, what are the conversations like?\n\nJoey Agree -- President and Chief Executive Officer\n\nJosh, they are wide-ranging. I will tell you, there are sellers that still believe that wishful thinking maybe that will end with the Fed today. We'll see. But we are seeing more and more sellers recognize that we're in a very distant position from 2021 or even earlier this year.\n\nI think the most important thing there isn't really sellers' recognition of the macroeconomic conditions and/or uncertainty, it is the hope of the loan 1031 or all-cash buyer throwing in a bid for an asset. So, in conversations with brokers, and there's been notes to a similar degree, the assets that are out there widely marketed, asking low cap rates, sub five or five caps, for high-quality net lease assets, are getting two bids today. Maybe not 10. You know, activity is down to 20% of historical activity -- recent historical activity.\n\nSo, I think the biggest challenge there, again, is not pouring cold water. I think it's the wishful thinking in the hope for that 1031 buyer or all-cash buyer to return, or throw in a bid. I think as we move forward in this economy, as there's less 1031 dollars here deployed, we're going to see some changes, hopefully, in terms of sellers' expectations.\n\nJosh Dennerlein -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nJoey Agree -- President and Chief Executive Officer\n\nHopeful expectations, I should say. Thanks, Josh.\n\nOperator\n\nThank you. Next question comes from Ki Bin Kim of Truist. Please go ahead.\n\nKi Bin Kim -- Truist Securities -- Analyst\n\nThanks. Good morning. Joey. Sorry if I missed this, but what kind of capital should we expect over the next couple of quarters?\n\nJoey Agree -- President and Chief Executive Officer\n\nGood morning, Ki Bin. I -- next quarter is all we have visibility into. We just began sourcing for Q1. And I would expect cap rates to pick up moderately there again with similar profiles to the third quarter.\n\nQ2 was an aberration because of the large sale leaseback that we executed out in terms of investment-grade profile. But I would expect over 70% investment grade, similar to this quarter, at or near 11% -- or 11 years weighted average lease term. And I would also anticipate ground lease activity kicking up there as well.\n\nKi Bin Kim -- Truist Securities -- Analyst\n\nOK. And I know someone asked this previously, but let me try another stab at it. How do you balance looking at -- you know, you mentioned your WAC, obviously, was more favorable looking backwards and going forward for everybody. But how do you balance buying this type of volume? I know you can with a great balance sheet.\n\nBut how do you balance buying it versus, you know, with your view that cap rates need to be higher and maybe taking a little bit of, you know, a pullback?\n\nJoey Agree -- President and Chief Executive Officer\n\nSo, I think it's a great question. I think this is an art and not a science. Nobody has a crystal ball into 2023. We'll get hopefully a little bit more clarity from Mr.\n\nPowell shortly here. But nobody has clarity into 2023 yet. That's why I would refer back to Peter's comments. We will be disciplined.\n\nWe are going to make sure that transactions are accretive, both mathematically accretive but also qualitatively accretive. We are, by no means, is going to put the pedal to the metal here and lever up a balance sheet with spreads that don't make sense. And we're going to be disciplined and thoughtful like we've always been. But we are in very uncertain times.\n\nThere are many risks on the horizon, whether they're domestic or macro international risks. We're cognizant of those risks. Again, this balance sheet, this company was built for those risks. And so, every dollar we deploy has to be thoughtful and has to do with purpose.\n\nKi Bin Kim -- Truist Securities -- Analyst\n\nOK. And more a bigger picture question, I'm a little surprised that more triple net REITs have an issue with convertible debt. I mean, you guys report on a AFFO basis anyway, where the GAAP interest expense nonbenefit doesn't really matter. Just any broader thoughts on convertible debt and if that's a tool that makes sense for you guys at some point.\n\nJoey Agree -- President and Chief Executive Officer\n\nIt doesn't make any sense for us. Again, we're trading today on an implied or AFFO basis in the mid five range. Convertible doesn't make any sense for us today in terms of an option of capital source for other companies. I really haven't spent any time on it.\n\nKi Bin Kim -- Truist Securities -- Analyst\n\nOK. Thank you.\n\nJoey Agree -- President and Chief Executive Officer\n\nThanks, Ki Bin.\n\nOperator\n\nThank you. Next question will come from Nick Joseph of Citi. Please go ahead.\n\nNick Joseph -- Citi -- Analyst\n\nThanks. Joey, do you have any sense of how much 1031 money is still out there looking to be deployed?\n\nJoey Agree -- President and Chief Executive Officer\n\nI wish I did. It's amazing that even though -- I'll tell you, there's a lot of talk of it still. I think the feedback that we've gotten, that I've gotten from my team, especially from recent conferences, and road shows, and meetings, is that there's a recognition that that money is waning. So, there's a lot of talk about this.\n\nI'll tell you that the sentiment and the hope has gone from -- in the broader community has gone to wishful thinking, more from hopeful that there's 1031. And so, that has been recognized. I haven't seen anybody try to quantify those dollars. But undoubtedly, those dollars are beginning to wane the sheer number of real estate transactions in the commercial space as the velocity of them decrease significantly.\n\nNick Joseph -- Citi -- Analyst\n\nYeah, exactly. And then, what are you seeing in terms of the different stickiness for cap rates on ground leases versus traditional net lease?\n\nJoey Agree -- President and Chief Executive Officer\n\nReally the same. I think ground leases have gotten -- as I mentioned, probably on the last couple of calls, ground leases have gotten a lot of attention due to us to safe hold to the sell side covering them. I tell you that it's -- that market is very similar relative to the broader net lease market that there's still a bid ask spread. We're still looking for sellers to capitulate.\n\nThat said, I do anticipate our ground lease pipeline in Q4 will be fairly sizable.\n\nNick Joseph -- Citi -- Analyst\n\nThank you very much.\n\nJoey Agree -- President and Chief Executive Officer\n\nThanks, Nick.\n\nOperator\n\nThank you. Next question will come from Haendel St. Juste of Mizuho. Please go ahead.\n\nRavi Vaidya -- Mizuho Securities -- Analyst\n\nHi, good morning. This is Ravi Vaidya in the line for Haendel. Hope you guys are doing well.\n\nJoey Agree -- President and Chief Executive Officer\n\nGood morning.\n\nRavi Vaidya -- Mizuho Securities -- Analyst\n\nCan you comment on the acquisition -- good morning. Can you just comment in the acquisition pipeline? Are you targeting any new tenants or categories? Are you seeing any pricing differentials that you're seeing on a category basis?\n\nJoey Agree -- President and Chief Executive Officer\n\nSo, no new tenants or categories. I will tell you, you know, selectively, we will insert tenants into that sandbox, or we will remove them into that sandbox. But I don't think it's appropriate, any new tenants or categories on a holistic basis. In terms of cap rates by sector, we're seeing velocity in those sectors in terms of cap rate dispersion.\n\nWe're seeing velocity in the sectors that are driven by merchant builders. That's generally retailers that are growing at a fast clip or have leveraged the merchant build community and -- the builder community, excuse me, to drive new store growth from.\n\nRavi Vaidya -- Mizuho Securities -- Analyst\n\nGot it. Got it. Just one more here. I know you're shopping in the higher-quality end of the spectrum.\n\nThe cap rates tend to be stickier there. But can you comment how cap rates have shifted for investment-grade tenants versus noninvestment-grade tenants?\n\nJoey Agree -- President and Chief Executive Officer\n\nI would tell you, we don't spend much time -- look, investment grade, we've always said, is an output of our strategy. There are significant tenants in our portfolio that don't have ratings that have fantastic balance sheets. Many of them are transparent for the public to see, whether that's Publix, Hobby Lobby, Chick-fil-A, Ollie, so top tier retailers in this country. The bottom line is tenants in the noninvestment grade are unrated that aren't, I would tell you, probably BB or better, especially the smaller operators and, even more acutely, the private equity-sponsored retailers.\n\nThe cap rates on those assets are blowing up. And they should. I mean those assets today, those sponsored tenants have balance sheets that have variable rate debt, have near-term maturities. They're generally single-purpose boxes in nature.\n\nIt's nearly impossible to put a residual or terminal value on the underlying real estate. They have limited access to capital. And their funding source is predominantly net lease REIT on a sale leaseback basis who tend to be their largest unsecured creditors or among their largest unsecured creditors. We have no interest in playing in that space.\n\nI think it's imprudent, given the macroeconomic outlook that we see today over the potential ranges of outcome. But we've never played in that space. And so, I can't give you specific instances of the cap rates because, frankly, we don't spend time there.\n\nRavi Vaidya -- Mizuho Securities -- Analyst\n\nGot it. Appreciate the color, guys.\n\nJoey Agree -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question will come from Tayo Okusanya of Credit Suisse. Please go ahead.\n\nTayo Okusanya -- Credit Suisse -- Analyst\n\nYes, good morning, everyone. Congrats on a solid quarter. Joey, could you -- I mean, your earlier comment just about, again, rising cost of debt, you know, bad balance sheets, creating opportunities for you. You know, could you talk on the flip side with your retailers who are also going through that rising cost of capital and kind of, you know, bad balance sheets, if any? And just talk a little bit about the watch list, where you see going, you know, any particular REIT categories you become a little bit more concerned about with just what's going on with the overall macroeconomic backdrop in the U.S.\n\nJoey Agree -- President and Chief Executive Officer\n\nYeah, good morning, Tayo. I think in terms of categories, we don't have exposure to categories where we have concerned. Again, we just don't have the discretionary component, the recreational component, the luxury component in this portfolio. We are focused specifically at those core durable, generally recession-resistant tenants, and the leading operators in their respective sectors.\n\nSo, that's really not -- now, every property in our portfolio is on our website. If you want transparency, go to our website. All 1,706 properties as of 9/30 are on our website. We have three Bed Bath & Beyond in the portfolio.\n\nWe bought them all for the real estate. They are all tremendous pieces of real estate. Feel free to Google Earth them. We have one At Home in our portfolio in Provo, Utah.\n\nIt is a critical piece of real estate on the main thoroughfare in Provo. We'd love to get it back one day and have had multiple offers on it. So, at the end of the day, you know, we will get every asset and on a singular case-by-case basis. And we just, really, outside of a couple of few movie theaters that we have in the portfolio, just don't have those challenges.\n\nTayo Okusanya -- Credit Suisse -- Analyst\n\nGreat. That's helpful. And then, in the transactions markets, are you seem to be look a little bit different for ground lease-type transactions versus kind of, you know, standard fee simple triple net buildings out there.\n\nJoey Agree -- President and Chief Executive Officer\n\nNo. As I mentioned before, generally the same. It's transaction specific. Now the ground lease market is nowhere near as deep or as large as the standard debt lease market.\n\nSo, there are, of course, aberrations. But generally, the same. Nothing overly -- both markets today are in a stare-down for the, you know, general -- a general stare-down, I'll say, in terms of buyers and sellers and gaps there.\n\nTayo Okusanya -- Credit Suisse -- Analyst\n\nGreat, thank you.\n\nJoey Agree -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Next question will be coming from Linda Tsai of Jefferies. Please go ahead.\n\nLinda Tsai -- Jefferies -- Analyst\n\nHi, good morning. The high single-digit earnings growth in 2022 and high teens on a two-year stack, you know, as you look at your pipeline and given the view that cap rates move higher, you know, what type of earnings growth might be achievable next year?\n\nJoey Agree -- President and Chief Executive Officer\n\nGood morning, Linda. It's a great question. A lot of it is going to depend, obviously, on the sources and uses if and when the debt markets come back, where cap rates move to. I think the thought of net lease REITs growing in the upper single digits in terms of AFFO growth or double digits probably isn't overly prudent if there's any thought of that next year.\n\nAnd so, we're going to see -- the macroeconomic circumstances are really going to drive, obviously, the sources of capital in terms of the cost there. And then, what happens in the overall cap rate environment and pricing environment is going to be the second piece there. And I wish I had the crystal ball to be able to tell you that today. But we, unfortunately, don't have it.\n\nLinda Tsai -- Jefferies -- Analyst\n\nThanks. And then has the tone or tenure change from retailers as it relates to their store growth outlooks?\n\nJoey Agree -- President and Chief Executive Officer\n\nNo. I would tell you that the conversations we have with retailers -- again, we're not in the luxury or discretionary space. So, I can't speak to those retailers. The conversations that we're having with retailers today revolve around the inability of developers to perform on their new store strategies.\n\nTheir story strategies for 2023 are generally already built out with those -- with pipelines. Now, it comes down to execution. And so, I'll give you an example. We talked to a large farm and rural supply retailer recently with a developer who had 50 stores in the pipeline, then down to 30 stores, three ended up hurtling.\n\nSo, generally speaking, the retailers in our portfolio have promised new store openings to the street. They are in growth mode. And now, they have challenges getting constituents and stakeholders to actually execute on that new store growth due to rising costs, both labor, obviously, and materials, rising interest rates, the lack of availability of construction loans. And then most importantly, now for a merchant builder, I tell you, the lack of clarity on what their exit cap rate will be.\n\nAnd so, we're working with those partners to see if there's a solution that makes sense for both of us in terms of deploying all three of our platforms.\n\nLinda Tsai -- Jefferies -- Analyst\n\nThanks. That's really helpful. Just one last one. What's driving G&A lower?\n\nPeter Coughenour -- Chief Financial Officer\n\nLinda, this is Peter. In terms of decrease in G&A during the quarter, it was spread across several different areas, including accounting and tax, IT and stock-based compensation expense where there was a one-time decline due to some employee forfeitures. I would note that our guidance for 2022 implies a 40 to 50 basis point deceleration in G&A to approximately 6.5% of total adjusted revenue. And that guidance assumes that G&A in the fourth quarter returns to a level more similar to the expense that we saw during the first and second quarters of this year.\n\nLinda Tsai -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Next question comes from Wes Golladay, Baird. Please go ahead.\n\nWes Golladay -- Robert W. Baird and Company -- Analyst\n\nHey, good morning, everyone. Has there ever been a time where your cost of equity has been less than your cost of debt for a prolonged period like we're seeing now? And then, you did make a comment about no short-term debt. Is that to read no term loans, always going to target tenure debt, looking for a clarification on that.\n\nJoey Agree -- President and Chief Executive Officer\n\nYeah, not my tenure, Wes. I mean, our cost of capital is effectively inverted today. And we anticipate to remain inverted for a while here as the tenure remains elevated and spreads remain extremely elevated. When we talk about short-term debt, we're talking about carrying extended balances on the credit facility, either on a variable basis or on a swap basis.\n\nWe have looked at the term loan market and executed specifically in the seven-year term loan market historically. Most recently, we've been obviously an unsecured issuer in the public bonds space at 10- and 12-year levels here. But we'll look at all available options here, which makes sense in terms of our capital stack debt maturities. But we're not going to take any variable rate risk, or any tenure risk.\n\nWes Golladay -- Robert W. Baird and Company -- Analyst\n\nOK. Got it. And then, when we look at the merchant builders situation, do you get the sense there are retailers who are willing to pay higher rent to help the merchant builders absorb a little bit higher cap rate on their exit? And when you look at your pipeline, this year was really a lot of Gerber Collisions, you made a good headway there. In the background, you have a bunch of retailers or handset retailers that you're potentially going to have dropped next year where we see, you know, maybe this pipeline just swell.\n\nJoey Agree -- President and Chief Executive Officer\n\nSo, retailers are looking for all different types of solutions today. The team has been to a number of retailers headquarters meeting with their heads of real estate in their respective departments. They're looking at increasing rent. They're looking at internalizing development.\n\nThey're looking at fee-based programs to keep it on balance sheet. They're looking at more term, larger increases. I think all different types of solutions are being looked at so they can get new stores opening in the ground. To your second question, we're always talking to retailers, and we're always looking for opportunities to grow commensurate with their pipelines.\n\nAgain, it just really has to hurdle for us across all three platforms from an economic basis.\n\nWes Golladay -- Robert W. Baird and Company -- Analyst\n\nGot it. And just a follow-up on that, I mean, was there something specific about Gerber where you're just going to probably maybe provide them a little bit more, I guess, platform value when they said, \"Hey, we want to just grow with you quite a bit. And you're the one that we want to work with where, you know, maybe others are just doing one-offs.\" I just wonder if there's anything special about that one? Because it really was a lot of Gerbers this year.\n\nJoey Agree -- President and Chief Executive Officer\n\nYeah. Well, we've been talking to Gerber, I would say, for upwards of six years. And we had identified Gerber specifically because they're the only public company traded on the Toronto Stock Exchange owned by Boyd Group. They're the only public company in the collision space.\n\nAnd so, as we saw Caliber and Service King, both private equity-sponsored, continue to gobble up independent operators, as well as open net new stores, you know, we were very attracted the collision space because of the cost of repairs, the third-party payment, cost of repairs because of the cameras and the sensors. As I mentioned before, you can't just go to your traditional Buckstop. You need a technician and a computer wizard to fix everything on your car today. So, we were very attracted to this space.\n\nWe identified Gerber again because of their well-levered balance sheet, which everybody can see online. Those conversations culminated with Gerber entering into a significant growth phase obviously from an organic perspective rather than M&A perspective. And so, the collision space was dominated by M&A, by the big three operators. As I mentioned, Gerber being the only public one acquiring one-off and small collision repair chains.\n\nIt then became cost prohibitive or, frankly, lack of opportunities out there. So, they flipped to greenfield and brownfield development. And that's where we finally hit a chord and found a partnership there that worked for both of us. And so, we're very active, obviously, with Gerber.\n\nThey have over 725 locations across the country. And we love the business, the direction of the business, and, frankly, their relationships with auto insurers with direct clients that took over.\n\nWes Golladay -- Robert W. Baird and Company -- Analyst\n\nGot it. Thanks, everyone.\n\nOperator\n\nThank you. Next question will be from Ronald Kamdem, Morgan Stanley. Please go ahead.\n\nRonald Kamdem -- Morgan Stanley -- Analyst\n\nHey, two quick ones. Just coming back to sort of the acquisition pipeline, you know, there's sort of two factors, right? There's volumes, and then there's pricing. And then, you sort of talked about that, you know, cap rates 6.2 in the quarter, that should be going up. As we're sort of thinking about next year, should we expect sort of the same amount of volume at those high cap rate levels, right? Because I think what your messaging is that cap rates are rising, but they're probably rising a little bit slower than cost of capital.\n\nSo, is this a scenario where, yeah, we should be expecting higher cap rates coming through? But are the volumes, is there a give or take there? Or is there just enough sort of to go around, if that makes sense?\n\nJoey Agree -- President and Chief Executive Officer\n\nNo, I think you hit it dead on. And if we don't see cap rates rise, where they hurdle for us quantitatively, then you will see volumes slow down. I mean, there's obviously no doubt about it. And as cap rates move, we will be careful with -- or don't move, frankly, we'll be careful with how we put our pedal to the metal, or frankly, we lay off.\n\nAnd so, again, we have to be -- take every transaction on a discrete basis, look at the qualitative and quantitative aspects of both of them, and then decide whether it makes sense relative in the broader market for us. And so, we are going -- we are in a read and react mode. I think it's fair to say everybody is in a read and react mode. And we will not get ahead of our skis, that's for sure.\n\nRonald Kamdem -- Morgan Stanley -- Analyst\n\nGreat. And then just moving on to tenant health, tenant risk. Maybe can you just remind us just what bad debt has been this year? Obviously, you guys have a super clean portfolio. So, it's pretty small.\n\nBut the real question is, obviously, as we're thinking about the next year or the next two or three years, are you seeing anything that suggests that there's going to be more pain coming down the retail pipeline? Like, what are you hearing on that front? Thanks.\n\nJoey Agree -- President and Chief Executive Officer\n\nI'll take it. From a high level, yeah, I anticipate pain. Not specific to this company because the portfolio is so strong. But I think a lot of balance sheets were repaired -- retail or balance sheets will repaired during COVID.\n\nThey either -- they ought to be [Inaudible] sales or, frankly, the ability to access low-cost capital. And so, a lot of balance sheets, ironically, were repaired during COVID. I think we're seeing the deterioration of those balance sheets today, back to a more normalized pattern based upon their overall businesses. And so, over the next two or three years, I think we're going to see -- and I think maybe even a shorter period of time, we're going to see more and more distress in the broader retail environment.\n\nAgain, a lot of this is dependent upon the consumer and macroeconomic conditions. But COVID was an outlier. COVID -- and I told people consistently, COVID was not a proxy for recession. COVID was not a proxy for retailer distress.\n\nIt was a timeout. And during a timeout, a lot of people and a lot of retailers got to eat, and, frankly, got some free things or very cheap things. And so, now, we're seeing a normalization of sales levels across most retail sectors today. And the normalized sales patterns of a lot of these retailers, pre-COVID, didn't make much sense to be sustainable in terms of an ongoing retail operations.\n\nAnd so, I think we're going to see that normalization. And actually, we're seeing it today. We're seeing the tip of the iceberg today. Peter, if you can talk specifically about the bad debt.\n\nPeter Coughenour -- Chief Financial Officer\n\nYeah, in terms of bad debt, year to date, we've only recorded approximately $300,000 of bad debt expense, which is roughly 10% -- sorry, 10 basis points of revenue on a year-to-date basis. So, very minimal bad debt expense recorded year to date. Looking forward, we specifically identify tenants or instances of bad debt. So, it's difficult to predict exactly what level of bad debt we will have moving forward.\n\nBut again, as Joey referenced, we think our portfolio is in great shape today.\n\nRonald Kamdem -- Morgan Stanley -- Analyst\n\nThank you so much.\n\nJoey Agree -- President and Chief Executive Officer\n\nThanks, Ron.\n\nOperator\n\nThank you. Next question will come from Chris Lucas, Capital One. Please go ahead.\n\nChris Lucas -- Capital One Securities -- Analyst\n\nHey, good morning, guys. Just a couple of quick questions. Joey, if we take a step back and think about the buckets of transaction opportunities that you guys look at. So, you've got direct-to-tenant deals, and then you've got sort of, you know, existing lease deals that are out there that you might acquire.\n\nAre you seeing any differential in terms of the sellers in these cases, either one side or the other, adjusting to the capital market pricing today faster than the other at all?\n\nJoey Agree -- President and Chief Executive Officer\n\nIt's a great question. I think the direct to sellers, those conversations generally and those thoughts are moving a little bit quicker, inclusive of direct to retailers than either marketed opportunities and/or off-market opportunities that are out there shopping. So, I think those direct conversations are cutting through to today's reality a little bit quicker, generally speaking, than some of the circuitous, kind of hopeful conversations that are out there.\n\nChris Lucas -- Capital One Securities -- Analyst\n\nOK. Thank you for that. And then, Peter, I guess, maybe just taking the prior question one step further, any sense as to what year fully swapped seven-year or five-year term loan all-in costs would look like today?\n\nPeter Coughenour -- Chief Financial Officer\n\nYes, Chris, I guess to answer that, I would say, this year has progressed. Obviously, there's been a lot of volatility in the debt capital markets, specifically the public bond markets. And as a result, I think more issuers have looked to the term loan market rather than the public bond market. We had the swaps in place earlier this year, where it made sense for us to access the public bond markets at an all-in rate below 4%.\n\nIn terms of accessing the term loan markets today, I think as banks have issued more term loans this year to issuers, you've seen bank balance sheets grow and less of an appetite to issue term loans, particularly five- and seven-year term loans. And so, it's difficult to say exactly where we can price a five- or seven-year term loan today. I think we're seeing banks push companies toward the shorter-term term loans, one or two years with options to extend.\n\nChris Lucas -- Capital One Securities -- Analyst\n\nOK. That's helpful. And last question for me, Joey. Just curious as to your thoughts about how you feel about Kroger as a credit given the Kroger and Albertsons merger announcement, and how you're thinking about your portfolio there.\n\nAny risk to regulatory sales or anything like that, that you, you know, you have to worry about?\n\nJoey Agree -- President and Chief Executive Officer\n\nNo, nothing there concerns me in terms of credit. There's no release provisions in any of our Kroger release. I think the more interesting fact -- or I think the more interesting thing, frankly, is Kroger's desire to actually acquire Albertsons. You know, we've been talking for a long time about how we only will invest in the top tier grocers in the country.\n\nAnd that grocery has been thought of as a safe haven generally, both in the net lease space, as well as the shopping center space in the broader retail environment. And we continue to remind people that grocery has been a 2% business historically. When you have to pick it off of the floor, paying associates $20 an hour, some of them loaded wages even higher on the union basis, the margins quickly deteriorate. And so, what we're seeing and I think we're seeing with the Kroger-Albertsons is a move to increase scale even further because of margin deterioration capex spend in terms of Ocado and Fulfillment.\n\nAnd so, no concern on our end. All of our Kroger deals have, again, full Kroger guarantees. No release provisions there. I would anticipate a spin-off being really consolidated in the existing Albertsons stores.\n\nI think it's going to be interesting to see what the FTC does here. We obviously track the Tractor Orscheln FTC approval process, which I believe extended 18 or more months. And only it was in the farm and rural supply business with 180 stores that Tractor was buying, you know, that consisted of the entire company for Orscheln. They had to divest of approximately 50%.\n\nSo, as we watch the FTC here, it's going to be very interesting when it comes to something, such as food, especially with the inflationary pressures we've seen on food, what that approval process is going to look like. But I think there's no doubt that we're going to continue to see grocers search for scale. And so, we're going to stay at the top end of the grocery spectrum because I just truly don't believe it's actually the safe haven than investors have generally perceived.\n\nChris Lucas -- Capital One Securities -- Analyst\n\nGreat, thank you. That's all I had this morning.\n\nJoey Agree -- President and Chief Executive Officer\n\nThanks, Chris.\n\nOperator\n\nThank you. Next, will be a follow-up question from Tayo Okusanya of Credit Suisse. Please go ahead.\n\nTayo Okusanya -- Credit Suisse -- Analyst\n\nHi, yes. Just a very quick one. The cap -- the 6.2 cap rate this quarter, the gap cap rate, could you give us a sense of what the cash [Technical Difficulty] are on your most recent transactions. I'm trying to get a sense if you feel a gap in the cash yield spread between the investment-grade and the noninvestment-grade market, but the other two gap out again because it had kind of collapsed over a while.\n\n[Inaudible] gap out again at this point.\n\nJoey Agree -- President and Chief Executive Officer\n\nTayo, you're breaking up. To your -- the part that came through, really, the spread between investment-grade and noninvestment-grade or unrated for us is really close. You know, again, some of our favorite retailers, Ollie, Hobby Lobby, Chick-fil-A, Publix traded at very aggressive cap rates. They are unrated.\n\nSome of them are closely held, private family owned companies, but they are -- but they trade as if they were investment grade because of the perceived credit profile, although they don't carry a third-party rating. And so, there really isn't that wide of a dispersion. I'll tell you, there's probably, given term, credit, real estate, and in a number of other factors, probably about a 75 to 85 basis-point dispersion across cap rates of where we invest capital. In this quarter, average of 6.2.\n\nAnd again, we anticipate that ticking up in Q4 as we see more opportunities really driven by the merchant builder space.\n\nTayo Okusanya -- Credit Suisse -- Analyst\n\nAnd then, your cash yields were probably like mid five?\n\nJoey Agree -- President and Chief Executive Officer\n\nExcuse me. You're breaking up again.\n\nTayo Okusanya -- Credit Suisse -- Analyst\n\nCash yield. And so, your gap yields were 6.2. Your cash yield for the quarter?\n\nJoey Agree -- President and Chief Executive Officer\n\nNo. Closer. Around 6%.\n\nTayo Okusanya -- Credit Suisse -- Analyst\n\nThe cash yields are around six.\n\nJoey Agree -- President and Chief Executive Officer\n\nYes.\n\nTayo Okusanya -- Credit Suisse -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. That concludes our question-and-answer session. We'll turn the conference back over to Mr. Joey Agree for closing remarks.\n\nJoey Agree -- President and Chief Executive Officer\n\nWell, thank you everybody for joining us today. I'm going to get the opportunity to go blow my nose, and we look forward to catching up in NAREIT in a couple of weeks. Appreciate it. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nReuben Treatman -- Director, Corporate Finance\n\nJoey Agree -- President and Chief Executive Officer\n\nPeter Coughenour -- Chief Financial Officer\n\nR.J. Milligan -- Raymond James -- Analyst\n\nBrad Heffern -- RBC Capital Markets -- Analyst\n\nJosh Dennerlein -- Bank of America Merrill Lynch -- Analyst\n\nKi Bin Kim -- Truist Securities -- Analyst\n\nNick Joseph -- Citi -- Analyst\n\nRavi Vaidya -- Mizuho Securities -- Analyst\n\nTayo Okusanya -- Credit Suisse -- Analyst\n\nLinda Tsai -- Jefferies -- Analyst\n\nWes Golladay -- Robert W. Baird and Company -- Analyst\n\nRonald Kamdem -- Morgan Stanley -- Analyst\n\nChris Lucas -- Capital One Securities -- Analyst\n\nMore ADC analysis\n\nAll earnings call transcripts"
}