{
  "companyName": "Stoneco LTD",
  "companyTicker": "STNE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/stoneco-ltd-stne-q3-2022-earnings-call-transcript/",
  "content": "Stoneco LTD (STNE -0.63%)\nQ3 2022 Earnings Call\nNov 17, 2022, 5:00 p.m. ET\n\nOperator\n\nGood evening, ladies and gentlemen, and thank you for standing by. Welcome to the StoneCo third quarter 2022 earnings conference call. By now, everyone should have access to our earnings release. The company also posted a presentation to go along with its call.\n\nAll materials can be found online at investors.stone.co. Throughout this conference call, the company will be presenting non-IFRS financial information, including adjusted net income and adjusted net cash. These are important financial measures for the company but are not financial measures as defined by IFRS. Reconciliations of the company's non-IFRS financial information to the IFRS financial information appear in today's press release.\n\nFinally, before we begin our formal remarks, I would like to remind everyone that today's discussion may include forward-looking statements. These forward-looking statements are not guarantees of future performance, and therefore, you should not put undue reliance on them. These statements are subject to numerous risks and uncertainties that could cause actual results to differ materially from the company's expectations. Please refer to the forward-looking statements disclosure in the company's earnings press release.\n\nIn addition, many of the risks regarding the business are disclosed in the company's Form 20-F filed with the Securities and Exchange Commission, which is available at www.sec.gov. I would now like to turn the conference over to your host, Rafael Martins, vice president of finance and investor relations officer at StoneCo. Please proceed, sir.\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nThank you, operator, and good evening, everyone. Joining us today on the call, we have our CEO, Thiago Piau; and our chief strategy officer, Lia Matos. Today, we will present our third-quarter 2022 results, discuss some recent trends and provide an updated outlook for our business. I will now pass it over to Thiago, so he can share some highlights of our performance.\n\nThiago?\n\nThiago Piau -- Chief Executive Officer\n\nThank you, Rafa, and good evening, everyone. This quarter, we had strong growth with market share gains, doubled our profit sequentially, accelerated our net addition of clients, and generated strong liquidity with improving adjusted net cash. Our profitability recovery is also gaining momentum. Five things that I would like you to keep in mind about this quarter.\n\nFirst, our business is growing at a very strong pace. Our revenue grew 71% year over year. We accelerated quarterly MSMB net additions to reach 2.3 million clients, and we accelerated our market share gains in payments. Two, we saw a consistent improvement in our profitability.\n\nWe doubled our profit versus last quarter, with strong margin improvement and an adjusted EBT of 211 million in the quarter, significantly above our guidance of over 125 million. Three, our banking business continues to perform very well. We accelerated the growth of active banking clients and the volume of our client deposits, resulting in an increase in the average revenue per client. Fourth, growth in our software business exceeded 20% year over year, driven by our core POS and ERP solutions.\n\nThe adjusted EBITDA margin in this segment increased significantly year over year and was stable quarter over quarter. We expect our adjusted EBITDA margin in software to improve in the fourth quarter. Finally, our business continues to generate cash. Our adjusted net cash balance grew faster, increasing by 350 million reais this quarter and 813 million year to date.\n\nI will now pass it over to Lia, who will provide more details about our third-quarter performance and strategic updates. Lia?\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nThank you, Thiago, and good evening, everyone. I'd like to jump straight to Slide 6, where we show the performance of our Financial Services segment. We're growing at a very strong pace, with revenue up 84% year over year and adjusted EBT up 70% or 111% quarter over quarter, resulting in over 400 basis points of margin expansion in the quarter. These strong results were driven by TPV growth, higher monetization of clients, and more efficiency in cost and expenses as we will detail further.\n\nMoving to Slide 7. This quarter, we reached more than 2.3 million active MSMB clients with net adds increasing to 248,000. As we have been explaining over the last two quarters, this performance in net adds reflects the continued optimization of our commercial strategy to offer stone and stone products for each client segment needs resulting in positive net adds in both micro and SMB segments. I think this is a key indicator of the success we're having in our two brands and multichannel go-to-market strategy.\n\nThis strong growth in our client base was the main driver of our MSMB TPV growth. As shown on Slide 8, MSMB TPV grew 45% year over year to 74.7 billion reais, above our guidance range of between 73 billion and 74 billion reais. I'm particularly encouraged that this growth resulted in MSMB market share gains of 66 basis points compared to the total industry. Our MSMB take rates increased 11 basis points quarter over quarter, reaching 2.21%, mainly a result of more repricing in the third quarter.\n\nMoving to Slide 9. Our banking active client base increased 33% year over year, reaching 561,000 clients with deposits from MSMBs, more than doubling to 2.7 billion reais. We also increased the monetization on a per-client basis with ARPAC reaching 44 reais compared with 39 reais last quarter. I want to highlight an important trend in our banking business that will begin to take effect, especially in 2023.\n\nAs we sell more banking into our TON client base, we expect to see a significant increase in our number of accounts, total accounts balance, and overall banking revenues. Although the average revenue per client should decrease as micro merchants have naturally smaller revenue contribution. I also wanted to give you a brief update on credit. We have started testing our new credit product, and Gregor, our new head of credit, is already on board.\n\nOur focus with the new credit product is to enhance our understanding of clients' ability to pay on one hand and at the same time, enable our clients to better manage their cash flows when they use our credit solutions. Some of the elements that we're currently testing include an increased set of variables within our credit models, automated processes that makes it easier to renegotiate the credit, and the inclusion of our hub operations in the credit life cycle of clients. We will start with the working capital and the credit card-related products, but we expect to expand our portfolio to provide a broader set of products in the future. We will take a conservative approach given the credit cycle the market is facing and expect to ramp up our credit client base in 2023.\n\nMoving to Slide 10. I want to remind you that over the last year, we have been continuously deprioritizing sub-acquired volumes because of their low profitability, but we remain focused on platform services. As a result, sub-acquired volumes decreased 56%, while platform services TPV grew 63% year over year. The net result was that key accounts total TPV decreased 20% year over year.\n\nWe expect key accounts TPV growth to trend upwards once we have rolled off more sub-acquired volumes. Due to this mix shift and higher prepayment prices, take rates increased sequentially to 0.95% from 0.86% in the second quarter of 2022. I will now shift to software on Slide 11. Software revenues increased 22% year over year, reaching 366 million reais.\n\nAdjusted EBITDA more than doubled year over year to 55 million reais with a margin of 15%, relatively stable versus last quarter and approximately 830 basis points higher year over year. This quarter, software margin was affected by nonrecurring cloud costs, which we expect to normalize in the fourth quarter of '22. We expect our EBITDA margins to improve in the short term. On Page 12, I want to highlight a few points on the evolution of software.\n\nCore POS and ERP solutions continue to drive the growth in the segment, increasing revenue by 23% year over year mainly due to the increase of the number of POS and ERP locations, as well as average ticket. Digital solutions returned to growth this quarter, increasing revenues by 10% year over year, benefiting in part from the acquisition of Plugg.To, a solution that helps clients sell online through integration with marketplaces. The integration of our financial services and software products continues to progress. We integrated payments and fixed acceptance in all software verticals and Stone banking into the ERPs of 12 verticals.\n\nWhile we're still evolving our go-to-market strategy, I believe that this will be a strong differentiator in the way we bring financial services and software to our clients, and we're monitoring our progress here very closely. Now, I want to pass it over to Rafa, so he can discuss in more detail some of our key financial metrics. Rafa?\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nThanks, Lia. In Slide 13, I would like to highlight our trajectory of solid growth, combined with a strong recovery in our profitability. Our revenue grew 71% year over year to 2.5 billion reais, and our adjusted net income more than doubled sequentially to 163 million reais. As Lia mentioned, our MSMB TPV grew faster than the industry, but we also gained market share on a consolidated TPV basis even though we continue to deprioritize sub-acquire volumes.\n\nBased on industry data, our MSMB segment gained 66 basis points of share this quarter, and our consolidated payment business, including key accounts, gained 41 basis points of share. As shown in Slide 14, our adjusted EBT reached 211 million reais, 69% above our guidance, representing significant year-over-year and quarter-over-quarter growth. The outperformance relative to our guidance was mainly driven by better-than-expected revenue net of funding costs in financial services including a successful repricing strategy. In Slide 15, I'll talk about our costs and expenses, focused mainly on quarter-over-quarter trends.\n\nCost of services as a percentage of revenue decreased 40 basis points to 26.8%. This gain in efficiency was driven by strong growth in revenue, which more than offset a nominal increase of 45 million reais in cost of services in the quarter. The increase was a result of higher investments in technology and logistics, increased costs with cloud and data center, and depreciation and amortization. Cost of services include upfront costs related to acquisition of new clients and despite strong growth in our client base, this line reduced as a percentage of revenues, both year over year and quarter over quarter.\n\nAdministrative expenses as a percentage of revenue had a slight decrease to 10%. Nominally, it grew 20 million reais sequentially mainly due to higher personnel expenses. Selling expenses had an increase of around 80 basis points as a percentage of revenue mainly due to investments in the sales team, largely focused on the hubs, as well as marketing expenses. Finally, financial expenses decreased 1.4% quarter over quarter.\n\nThis was mainly due to a lower and more normalized duration of receivables sold to fund the prepayment business and the use of cash generated by our operations to pay down debt, reducing debt levels from 6.8 billion reais in the second quarter to 6 billion reais in the third quarter. Those two factors more than offset the higher prepayment volumes and higher interest rates quarter over quarter. In addition to our P&L evolution, this quarter, we continued to generate cash and improve our liquidity. Our adjusted net cash balance improved by around 350 million reais in the quarter, reaching 3.1 billion reais.\n\nIn the first nine months of 2022, adjusted net cash increased by 813 million reais. As I just mentioned, we have used cash generated by our business year-to-date to pay down part of our debt given our already very strong cash position. With that, let me turn back to Thiago, so he can comment a bit on our performance since the IPO, talk about the recent changes in our management and our outlook for the fourth quarter 2022. Thiago?\n\nThiago Piau -- Chief Executive Officer\n\nThank you, Rafa. This quarter, we are completing four years as a public company. I think that what the team has accomplished since then is remarkable. As shown on Slide 16, in the last four years, our active client base increased tenfold, reaching 2.4 million clients.\n\nDespite that growth, we still have only 11% market share in payments in Brazil, and we see an addressable market of more than 13.5 million MSMBs in the country. So, there's still plenty of room to grow. Over that same period, we grew TPV by four times our revenue, six times our adjusted net income by 83%. In four years, we've also created our banking business from scratch and currently have over 560,000 clients actively using our banking solutions.\n\nThere's still a lot to do in banking in terms of new products and features and we have a big opportunity with our credit products. While we are in the early days of our financial platform evolution, I'm very excited for the future of this business. Since 2018, we have also evolved from having a very small presence in software to becoming the No. 1 player for retail workflow tools in Brazil, reaching approximately 1.5 billion reais in annualized revenue.\n\nThe combination of our financial solutions and software is a powerful differentiator in the market and puts us in a unique position to offer a superior value proposition to our clients. While we have expanded our business significantly, we have kept our devotion to serving clients with the highest standards of service. We also believe that our people and our culture are our most valuable assets. As you can see on Slide 17, we have continued to enhance our team to support our expansion, attracting more talent and strengthening our company for the next decade.\n\nThis quarter, we are pleased to welcome Andre Monteiro as our chief risk officer; and Pedro Zinner, our next CEO. As we previously announced, I will become a board member of StoneCo next year to focus my attention on developing key strategic and financial initiatives to drive the future expansion of the company. Pedro Zinner will join the executive team no later than March 31, 2023, and he will begin working closely with me and the management team in a transition period before taking on the CEO role. I have a deep trust in Pedro, and I'm excited to work with him as we continue to evolve the business.\n\nI remain strongly committed to Stone as a partner and look forward to supporting the team in this new part of our journey. With that said, I wanted to move to our fourth-quarter outlook. While the World Cup and the macroeconomic environment may impact our results, we continue to expect strong core growth and improving profitability in our business. We expect a total revenue and income above 2.6 billion reais, representing a year-over-year growth above 38.8%.\n\nFor MSMB TPV, we expect volumes between 78 billion and 79 billion reais, compared with 74.7 billion in the third quarter. Finally, we expect adjusted EBT of more than 250 million reais, compared with 211 million for the third quarter. With that said, operator, can you please open the call up to questions?\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] And it looks like our first question here will come from Geoffrey Elliott with Autonomous. Please go ahead.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nWell, hello. Thanks very much for the call and for taking the question. Could we get a little bit into the TPV numbers and outlook? Maybe first of all, could you just confirm the TPV numbers that you report? Do they contain PIX? And what's the contribution from PIX in the third quarter? And then thinking about MSMB TPV growth going forward, there's clearly a bit of a slowdown implied by the guidance for the fourth quarter if we look at the year-on-year growth rate. Can you give us any preliminary thoughts about what sort of MSMB TPV growth we should be expecting in 2023?\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nThank you, Geoffrey. Rafael here. Thanks for the question. I will start the answer, and then I will move it to Lia to complement the answer.\n\nSo, regarding the second part of your question of the MSMB TPV, as we have mentioned in our release, our guidance does have some negative impact from the World Cup between 2 billion and 3 billion reais. And I think that if you look at a year-over-year perspective, last year, in the fourth quarter, we had a very strong comp as we grew TPV by 87%. So, it's natural to see that slowdown that you mentioned. Looking ahead, we expect that the growth in 2023 should stabilize at a higher level than in the fourth quarter as we will continue to balance growth and profitability and do not anticipate further headwinds such as the World Cup.\n\nSo, I think that is, looking quarter over quarter, we continue to see continued growth in our MSMB TPV. Lia, do you want to add?\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nYeah. Just complementing on the question related to PIX, Geoffrey. So, this number does not contain PIX. And just a few words about big trends within our base, the -- we see two main groups when we talk about PIX.\n\nFirst is the PIX substitute wire transfers, which we do not monetize. And second is PIX that we see as a payment method as an acceptance method, which can be reconciled and is integrated to the POS, and this mode of PIX we do monetize. We see it gaining significant traction in our base. It's growing a lot.\n\nAnd in terms of monetization, it's more or less in line with debit net MDRs. It's still small compared to overall credit card TPV, but we see it gaining a lot of traction.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nGreat. Thanks very much.\n\nOperator\n\nThank you. And our next question will come from Josh Siegler with Cantor Fitzgerald. Please go ahead.\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nYes. Hi. Good afternoon. Thanks for taking my question.\n\nI'd love to start by diving a little deeper onto what you're seeing in the competitive landscape, specifically for MSMB. I'm curious if you could provide some more color on the drivers behind your market share gains this quarter while the entire industry continues to experience higher take rates. Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nJosh, Thiago here. Thank you very much for your question. We see no big changes here in terms of competition from what we said in the previous quarters. We see that the market is much more rational, and the industry still adjusted prices in the third quarter, given the level of the volatility in interest rates.\n\nWe continue to be very disciplined in terms of making pricing decisions based on minimum unit economic hurdles, and we are always balancing growth and profitability. I think that over this year, we have built new distribution channels. We have access in new markets like the micro merchant segment, and we are focused on improving our speed of growth in the MSMB. So, I think that the combination of focusing ourselves is on creating more distribution channels and having the discipline to create the minimum return hurdle in the way that we allocate capital toward growth has produced these results.\n\nAnd in terms of competition, I think it's more of the same, but the industry is being very rational and paying attention to interest rates volatility and adjusting prices as I think that happened last quarter.\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nUnderstood. That's very helpful. Thank you. And how are you thinking about the M&A environment right now in Brazil, specifically in the software vertical? Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nJosh, Thiago here back again. I think that in terms of software, we have opportunities in terms of the core POS and ERP solution in new verticals. But we think that valuations still have to adjust in this new interest rate environment. In order to produce returns, we think that we still have to wait for valuations to adjust.\n\nAnd while we are observing the market, we are focused on our organic evolution. So, basically, the growth that you saw this quarter was based on organic execution. So, we'll keep paying attention, but we still have to see valuations adjusting better here in Brazil.\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nGot it. Thank you for answering my question.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, Josh.\n\nOperator\n\nOur next question will come from Sheriq Sumar with Evercore ISI. Please go ahead.\n\nSheriq Sumar -- Evercore ISI -- Analyst\n\nHi. Thanks a lot for taking my question. I have a question on financial expenses. It came down sequentially.\n\nJust wanted to get a sense as to how should we think about going forward. And a second part to that question is that on the last call, you had mentioned lower capex in the second half of the year. So, can we assume that you would be using this cash to pay down your debt? And how should we think about the use of cash in 2023 versus -- in capex versus paying down debt? Thank you.\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nThank you, Sheriq, for your question. Rafael here. So, regarding financial expenses, we have a decrease this quarter, as you mentioned, for two main reasons. As we said in our last earnings call, last quarter, we have decided to increase the duration of our funding.\n\nAnd in this quarter, we have a more normalized level of duration. And also, we have paid down debt, which reduced financial expenses. We believe that in the short term, there is still space to have financial expenses growing less than revenue. Over the medium term, like we said, our financial expenses should grow more in line with prepaid TPV and average interest rates.\n\nWe always optimize our funding cost, the most efficient for any lines, so it's natural that in our business, we sell shorter or longer duration receivables from quarter to quarter. Over time, such fluctuations should not be relevant. So, I think that -- and to your second point of your question about capex, as we anticipated previously, the capex levels for 2022 should be lower than last year, 2021. Of course, next year, this tends to normalize.\n\nWe have decided to use part of our cash generation over the last year to pay down some debt, as you said, given that we have already a very strong cash position in our balance sheet. We will continue to invest in the growth of our business development of new solutions next year, but we'll always evaluate those type of decisions and financial decisions depending on the cost of interest rates and our debt so we can become more and more efficient.\n\nThiago Piau -- Chief Executive Officer\n\nRafa, Thiago here. Can I complement?\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nOf course.\n\nThiago Piau -- Chief Executive Officer\n\nSo, Sheriq, Thiago here. Just to give a little bit more color on 2023. Although we will continue to invest heavily on our growth, we think that the company will continue to generate cash additionally to the investments we are making to grow, and we will use that cash generation to strengthen our capital structure next year. So, I think that this effect or maybe decreasing a little bit, the level of liabilities of the company will continue because we expect strong cash flow generation next year.\n\nSheriq Sumar -- Evercore ISI -- Analyst\n\nThank you so much. And just one follow-up. On the macro front, it seems like, obviously, the forecast for Brazil GDP and inflation has been improving, I would say, slightly though. But can you talk about as to where are you seeing trends change? And where are you seeing still weaknesses happen in the spending pattern in Brazil?\n\nThiago Piau -- Chief Executive Officer\n\nSheriq, it's very difficult for us to comment on that front right now. I think that the macroeconomic environment changed a lot in the last three weeks. What I can say is that we are paying attention very closely to inflation in order to adjust our contracts in software, and we are paying a lot of attention to interest rates to adjust the price in our financial segment solutions, and we will reflect the macroeconomic environment in our pricing immediately. So, we are managing prices very closely, and we will create much more dynamic into the next quarters.\n\nBut I think that now it's a time to paying attention and move as fast as we can to adjust the entire company, but difficult to say where this will end. We have to wait and see a little more.\n\nSheriq Sumar -- Evercore ISI -- Analyst\n\nThank you so much. Appreciate it.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, Sheriq.\n\nOperator\n\nAnd our next question will come from Tito Labarta with Goldman Sachs. Please go ahead.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nHi. Good evening, everyone. Thank you for the call and taking my question. I wanted to get some more color on sort of the credit's outlook, and you talked about some kind of in pilot mode.\n\nBut can you talk to us a little bit some of those pilots? When do you think credit could become an important part of the business again? What would you need to see to get more aggressive there? Just to understand when that can be a contributor at some point. And then just second question, just any color you can give in with the cap on the prepaid interchange, do you expect to realize all the benefits of that? How much could you benefit from it? Would you give some of that to your customers to help offset sort of the lower interchange in any way? Thank you.\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nTito, Lia here for the question. So, first, regarding credit, I think no big update other than what I just said in the call and what we also highlighted last quarter. We're still in test mode, and we'll keep you posted as we have more updates. Our plan looking ahead is really to be ready to relaunch toward the first half of next year.\n\nBut we really want to take a conservative approach to be able to test the full credit cycle with clients before making the decision to scale further, which will probably happen more toward the second half of next year. Now, we have Gregor on board, which is really great, and the team is in place and working really hard toward this plan. So, I think that's the update that we can give regarding credit. We still think that that's a big opportunity ahead, like Thiago said, and we're really focused on implementing this plan.\n\nI think regarding interchange cap, the impact is really going to be very dependent on competitive dynamics. We do believe that players will be more rational, and it will take some more time until the full effect of this is passed to merchants. With that said, we believe that this benefit could be somewhere between 100 million and 200 million in our EBT for 2023.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nThank you. That's helpful.\n\nThiago Piau -- Chief Executive Officer\n\nTito, Thiago here just to complement Lia's answer about the interchange changes. I think that if we pass anything to our clients, it will be a small amount. We are focusing on improving margins with that. I think that we gave away our margins in order to benefit our client base over time.\n\nI think that this change creates a more balance in the industry and should be recognized as an improvement in terms of margins for our industry. So, we'll be focused here on trying to keep as much as we can to benefit our margins.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nGreat. Thanks, Thiago. If I could, one follow-up on the credit. Any update on the receivables market? And do you plan to eventually ever use that, the collateral to back the credit? Have all those issues been resolved? Is that something that you won't consider again? Just curious, any updates on that?\n\nThiago Piau -- Chief Executive Officer\n\nTito, Thiago here. Yes, they are part of our execution and our plans, but I think that the big evolution we are doing here is increasing the level of data that we can take from other providers of our clients and including the information relationship that we have in our hubs. So, yes, we are considering the receivables as collateral. We've defined our strategy previously based on that.\n\nI think that what we are doing is improving our ability to access the ability of our clients to pay back the loans and improving the data that we can take from third-party partners and improving our ability to access our clients through the hubs.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nGreat. Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, Tito.\n\nOperator\n\nOur next question will come from Kaio Prato with UBS. Please go ahead.\n\nKaio Prato -- UBS -- Analyst\n\nHello, everyone. Good night. Thanks for the opportunity for questions. I have just one here on my side, please.\n\nI would like to talk a little bit more about the future trends. So, I think this year, you were vocal about mentioning that net income and profitability would gradually recover throughout the year. So, I just would like to understand if this speech is maintained for 2023, if we should continue to see higher profit sequentially also in 2023. And what should be the drivers for this going forward, please? Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nKaio, Thiago here. Yes, I think that this continues -- this trend will continue to 2023 based on two effects. We continue to allocate capital toward growth. And we are finalizing a very -- how can I say, there's a very straight zero-based budget made by our team that is rationalizing the way that we see COGS and SG&A.\n\nSo, I think that the discipline in terms of opex of the company is improving a lot. So, revenue should grow faster than opex. And I think that this operational leverage will take place in 2023 better than what we did this year. So, we expect that the trend of improving overall results and margins continues for 2023.\n\nKaio Prato -- UBS -- Analyst\n\nOK. Thank you. And just a quick follow-up on your answer. You mentioned like cost discipline.\n\nJust to have a view, if you can talk a little bit more your hub strategy for next year, if you foresee any additional investments to spot market share gains, or given what you said you consider that at this current stage, you are able to continue to gain share without accelerating investments. Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nKaio, yes, we see space to continue to invest in our hubs. I think that we are creating more density in the locations that we already have presence. With this discipline that we said that we are calculating minimum hurdles of return and pricing is something that we are using to adjust our speed of growth. But in the balance that we have today, we see space to continue to allocate capital toward the growth of the SMB using our hubs as the main strategy.\n\nSo, we will create more density next year and continue to grow.\n\nKaio Prato -- UBS -- Analyst\n\nOK. Thank you very much.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, Kaio.\n\nOperator\n\nAnd our next question will come from Mario Pierry with Bank of America. Please go ahead.\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nHi, everybody. First of all, congratulations on the results. Let me ask you two questions, OK? The first one is, when we look at your guidance, you met your guidance for revenues in TPV. But basically, those are two variables where you don't have much control.\n\nAnd you surprised us on COGS and opex, so -- and that's what you control. So, I'm trying to understand like why were you surprised on COGS and opex. Are there any specific initiatives to -- that you have underway here to improve efficiency? Or are we seeing any synergies from the Linx transaction? And then I'll ask my second question.\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nHi, Mario. Rafael here. Thank you for the question. So, I think that when we look to the outperformance versus our guidance, I think the main driver of that was that we underestimated a little bit the level of impact of the repricing waves we have done in the quarter.\n\nSo, I think it was less related to costs and expenses, but more related to the extent of the pricing wave as we have done. We have even done some additional pricing in September. So, I think that that was reason behind the outperformance of the guidance, which led to a revenue net funding costs higher than we expected.\n\nThiago Piau -- Chief Executive Officer\n\nRafa, if I may complement. Mario, just regarding synergies with Linx. We are doing two things here in terms of opex. One is integrating the portfolio of companies that we have invested over time into the Linx management system and the other one is integrating the back office of Linx into Stone.\n\nSo, I think that this is creating more efficiency, and we will see more results of that next year. So, those are the things in terms of opex that we are focused right now.\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nOK. And then my second question then, Thiago, is related right to the change that you're going to the board, you're bringing in Pedro, someone that has a very different experience, right, like in a completely different industry. So, what attracted you guys to look for Pedro? How do you think the strategy changes? And as you guys pointed right on Page 16 of the presentation, fairly successful last four years since the IPO, we have overdelivered. So, how should we see the strategy change? And what exactly do you think Pedro brings to Stone given that the experience is completely different from what you guys do?\n\nThiago Piau -- Chief Executive Officer\n\nGreat, Mario. I met Pedro in March, between March and April, and it created a very strong relationship with him since he joined the board, seeking his advices, talking about the opportunities and the challenges of our company. And I think that over that time, it was clear to me that Pedro has the capabilities and the personal values required for the next phase of our company. I trust him a lot.\n\nI will remain committed as a partner to support the company and the team in this new role as a board member. And I think that we are always trying to evolve, bringing in new people with additional capabilities to support the expansion of the company. And that's what we are doing. I think that we are adding more talents.\n\nPedro will be, I think, a very good leader for the company. And I think that we will be stronger, so we are very happy with this movement. And basically, that is the rationale of it. He has the capabilities and the personal values for this next phase.\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nAnd how do you think the strategy changes then? Again, as you highlighted on Page 16, you increased the presence in software, you were able to grow market share. What -- if you were to think about the next like three years, how do you see the company evolving in which segments?\n\nThiago Piau -- Chief Executive Officer\n\nGreat, Mario. I think that we evolved a lot both in financial platform and software, and I think that we will continue to execute on our growth plans but with more discipline. And I think that the capabilities in terms of leadership, management, we move over a lot, and Pedro will be a very big contribution on that front. I think that in terms of strategy, once Pedro is here, 100% on board, I think that you will be able to listen from him.\n\nBut I think that the company is well set in terms of the results we are delivering and the direction we are heading, but always evolving. So, I think that we will continue to evolve. Once we have our investor day, we will be able to give more color about what we are planning for the next five years. We are just finalizing our five-year plan revision now.\n\nSo, I'm very excited with the business. And I think that we will be happy to listen more about this from Pedro in the next coming months when he is here 100% on board.\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nOK. No, that's perfect. Thank you very much. And good luck with your new role on the board.\n\nThank you.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, Mario. \n\nOperator\n\nAnd our next question will come from James Friedman with Susquehanna. Please go ahead.\n\nJames Friedman -- Susquehanna International Group -- Analyst\n\nHi. Thiago, let me congratulate you. It's been a great four years, and we appreciated your leadership and accomplishments. So, I had two questions, first for Lia and then for Rafa.\n\nSo, Lia, did you -- I heard you say the call-outs about Pagar.me key accounts. But did you -- I don't see it in here, maybe I missed it, I apologize, but did you decompose the relative growth rates of Stone, TON, and the key accounts? And if not, could you just talk qualitatively about the relative growth rates?\n\nThiago Piau -- Chief Executive Officer\n\nHi, James. Thiago here. I would just like to say thank you very much for your kind words, and I'll pass it on to Lia.\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nHi, James. Yeah. So, regarding TPV growth and breakdown, so the TPV growth in MSMB contains both TON and Stone products. And key accounts, we break down between sub-acquire volumes, which had a decrease as we've been communicating over the last quarter that we've deprioritized sub-acquire volumes within key accounts.\n\nAnd the other part of key accounts is platform services. So, platform services contains our integrated partnerships that are software providers, that sell software integrated to our payments platforms, marketplaces, e-commerce platforms. So, a lot of those platform integration solutions and embedded payment solutions are contained within platform services TPV. So, I think that's the breakdown that I just wanted to clarify.\n\nJames Friedman -- Susquehanna International Group -- Analyst\n\nOK. Thank you. And then -- I'm sorry. Go ahead.\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nJust a couple of -- James, sorry, to your question is that, when we look at our client tiers, SMBs and micro, we continue to grow the client base in all those years. So, I think that although we report MSMB, we do have a focus to offer the right product for the right clients, the best-suited products for them. And I think that sort of a dual brand strategy has been very successful, and we have been able to grow both in SMBs and micro.\n\nJames Friedman -- Susquehanna International Group -- Analyst\n\nAnd then, Rafa, if I could just follow up. So, when you're expanding the financial and credit-specific products again. How do you view the relative importance of margin as you lean into the credit business next year? [Technical difficulty]\n\nOperator\n\nPardon me. Ladies and gentlemen, it appears we have lost connection to our speaker line. Please stand by while we reconnect. Thank you very much for your patience.\n\nExcuse me. This is the conference operator. I'm sorry, everyone. It looks like there was a technical difficulty.\n\nI'll go ahead and hand the conference back over to the presenters for the StoneCo.\n\nThiago Piau -- Chief Executive Officer\n\nHello, everyone. I'm sorry. We're disconnected through the call, but now we are back. Let's continue.\n\nOperator\n\nAll right. Once again, it's from James Friedman. Mr. James Friedman, if you'd like to continue with your follow-up there.\n\nJames Friedman -- Susquehanna International Group -- Analyst\n\nThank you. And thank you for that prior answer. And I was just going to ask Rafa, as you lean into credit next year, how should we think about the importance of margin? Is that a key criteria for you as you roll that out further? Thank you.\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nHi, James. I think that, as Lia said, the -- we are being very conservative with the credit relaunch rate, so I don't think that credit will be relevant to our results next year if you look on a -- like a bottom-line perspective. I think that one of the measures, of course, is we have to have good quality credit with the NPLs that we want. So, I think this is important.\n\nThat, of course, should lead to margin contributions to our business. But I think that what is important for us is to see the credit cycle of clients, good quality, us helping the client to manage their cash flows and have very healthy cohorts of credit clients. So, I think that over time, this should bring additional contribution margin to the company.\n\nThiago Piau -- Chief Executive Officer\n\nHi, James. Thiago here just to help to complement. So, in summary, low impact on margins on 2023, almost no impact on margin of 2023 from credit. Margins should continue to improve because of the trends we are already seeing.\n\nAnd then we expect positive contribution for 2024, 2025, and onwards.\n\nJames Friedman -- Susquehanna International Group -- Analyst\n\nUnderstood. Thank you. Thank you, Thiago. Thank you, Rafa.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, James.\n\nOperator\n\nAnd our next question will come from Soomit Datta with New Street Research. Please go ahead.\n\nSoomit Datta -- New Street Research -- Analyst\n\nTwo for me, please. One is just on the funding cost. I think you've talked about normalizing the duration of receivables. I mean, this seems to make quite a big difference to the funding cost.\n\nI wondered just whether there was any difference in the level of kind of prepayment of TPV. And also wondered, I think when you talked about adjusting the duration of receivables in the second quarter have been around a slightly more cautious macro outlook. But when I look at your TPV guidance, we've kind of discussed on this call and when I take into account what's happened to the acquiring TPV market in Q3, which I think was down on Q2, it feels like there's a cautious outlook on the macro. But again, that doesn't seem reflected quite in the way you're kind of funding the prepayment.\n\nSo, it would be helpful just to get some clarity around that, please.\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nSure, Soomit. Rafael here. So, I think that first, if we look at our liabilities, they have longer duration than our assets in prepayment business. So, I think we are already conservative in the way we deal with our capital structure.\n\nAlso, we have generated significant cash over the last year. And if we think about the amount of cash balance we had sit on balance sheet was a little over 6 billion last quarter, and I think that we had, and we saw a space to keep being conservative and high liquidity levels but also be a little more efficient in the way we fund the prepayment business. So, I think that we're always looking at to be more efficient in that capital structure management. And of course, in the fourth quarter TPV trends that we saw, it does have some effects that shouldn't be recurring effects regarding World Cup.\n\nSo, I think that this is sort of the financial expenses dynamics this quarter. I don't know, Thiago, do you like to add?\n\nThiago Piau -- Chief Executive Officer\n\nYes, Rafa, please. So, Soomit, Thiago here. Just to help you understand trends, our prepayment business continued to perform very well. And as Rafa said, we think that in the short term, we still have space for funding cost to grow less than revenue from prepayments.\n\nBut over time, we think that the funding cost should grow in line with TPV and the CDI rate. So, short term, we think that it will grow less in revenue. Over the medium term, it should grow in line with TPV and CDI rates.\n\nSoomit Datta -- New Street Research -- Analyst\n\nOK. That's very helpful. Thank you.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much.\n\nOperator\n\nAnd our next question will come from Pedro Leduc with Itau BBA. Please go ahead.\n\nPedro Leduc -- Itau BBA -- Analyst\n\nThank you. Good evening. Thanks for taking the question. A little bit on the banking side of things, thinking about your broader ecosystem there for SMEs.\n\nYou've mentioned deposits, 2.7 billion. If you can give us a little bit of color on what the profile is, how fast they turn. And of course, you reinforced the banking team, you will increase product features as we think about Stone bank in 2023, what do we think about products, the client profile, SMEs I imagine? And you also reignited your credit, you're still piloting it. But if you can give us a rough sense on how big of a loan book it could be in 2023 by the end, assuming it goes well, that'll be much appreciated.\n\nThank you.\n\nThiago Piau -- Chief Executive Officer\n\nPedro, Thiago here. I will start, and then I will pass it over. Thank you for the question. I think that regarding banking, what we can say is that today, banking is basically focused on the SMBs.\n\nWe still have space to continue to grow our banking client base in the SMB space because of the client base we have in payments, and we still have room to increase the engagement of our clients with our solutions as we rolled over more functionalities. Today, our clients, they still have to use bank accounts from other players because we are still lacking some functionalities. I think that once we have the full feature that we have planned to the segment, the engagement will increase, and this will produce better results. More than this, we are now moving our attention to provide more banking solutions to micro merchant space.\n\nBecause Stone today has a very limited account, so we are not taking account in our numbers, clients from micro-merchants. Once we expand our offering of banking to micro-merchants that we create positive effects both on total standing balance revenues from interchange from the cards and activation of PIX. So, there is a positive movement toward next year of moving banking toward the micro merchant space. So, we see this as a very big avenue of growth for 2023.\n\nLia, do you want to complement, please?\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nYeah. Just some quick additional comments. I think Thiago said most of this, Pedro. The evolution in deposits came from naturally the growth in the number of accounts, but also average outstanding balance per client increasing as well.\n\nSo, a lot of work to do there to increase the feature set, to increase engagement that we're already seeing very positive traction within SMB. I think one additional color regarding opportunity is we're excited about the opportunity within Linx space, so integrating banking to the ERP of Linx clients. It's still early stages. So, although the absolute number of clients is small, we're seeing very positive feedback from clients because this is an integration that really adds tangible value to facilitating client workflows, helping them better manage cash flows, automate their financial processes in a much better way.\n\nSo, that's the only additional color that I would give. I think our focus -- our big focus right now is on SMB client base and selling banking into TON client base, but we see a big future opportunity within PIX client base as well.\n\nPedro Leduc -- Itau BBA -- Analyst\n\nThat's very helpful. And a quick follow-up just on the potential number if you guys have budgeted loan book target for 2023 already. But on the banking side as well, understood very interesting. Thank you.\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nPedro, yes, no specific guidance on that. I think that the message that we gave on credit is the way that we see how '23 will play out right now. Of course, we'll give more color as we evolve. So, I think that's the message there.\n\nPedro Leduc -- Itau BBA -- Analyst\n\nSuper. Thank you, guys, so much.\n\nThiago Piau -- Chief Executive Officer\n\nThank you, Pedro.\n\nOperator\n\nOur next question will come from Domingos Falavina with Banco JPMorgan. Please go ahead.\n\nDomingos Falavina -- JPMorgan Chase and Company -- Analyst\n\nYes. Hi, everyone. Thanks for taking the question as well. First, congrats, very nice to see the -- I guess the pricing dynamics.\n\nIt's been a while we see TPV growing 3% Q on Q and revenues growing 16%, I mean, a massive increase, especially adding the cost of funding. We see basically a 20 bps improvement in implied take rate, all-inclusive, Q on Q. My question on that front is, I know things are pretty spread, but if you had to simplify when did you pass the price adjustments, especially on the prepayments, like in which month of the quarter so that we kind of can estimate how much has been baked in, in the overall quarterly volumes. Second one is on taxes.\n\nLike you guys reached a 20% tax. You mentioned basically the mark-to-market had an impact. We're removing valuation from the EBT, and we get to like 36% tax, which seems pretty high. And when we look at the tax reconciliation, we actually see a line-seeing effect of tax creep on mark-to-market of equity, about 37.9 million, 38 million.\n\nSo, I'm just a little curious like what exactly is the moving parts around this tax bracket that looks high if you remove, I guess, it.\n\nThiago Piau -- Chief Executive Officer\n\nDomingos, Thiago here. I think that the price initiatives we did were spread around the quarter. We see space for some slight increase for fourth quarter, but we are not focusing on that. I think that the spreads will continue to evolve on fourth quarter because as we said, we think that cost of funding should grow less than revenue, so that can produce better spreads for fourth quarter.\n\nThat's why we're giving stronger guidance for 4Q. And we still have to see the dynamics in the industry between debit and credit as a very seasonal quarter. But I think that the trend of improving spreads will continue from fourth quarter and to 2023. And regarding tax, I think that you are right in your analysis.\n\nSo, we're seeing exactly the same way. We think that we still have space to improve our efficiency, both on our entities and our treasury. So, we'll be focused on that. And we have a specific plan in terms of tax in our zero-based budget.\n\nSo, we are paying attention to that line very much. But we are seeing exactly the way you see it.\n\nDomingos Falavina -- JPMorgan Chase and Company -- Analyst\n\nPerfect. And just to confirm, so you're basically saying you're starting in August -- July, August, and September. So, it was equally spread, it was not concentrated toward the end of the quarter -- price adjustments, I mean?\n\nThiago Piau -- Chief Executive Officer\n\nYes, you're right.\n\nDomingos Falavina -- JPMorgan Chase and Company -- Analyst\n\nAll right. Thank you, guys. Congrats on the results.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, Domingos.\n\nOperator\n\nAnd our last question today will come from Nicolas Riva with Bank of America. Please go ahead.\n\nNicolas Riva -- Bank of America Merrill Lynch -- Analyst\n\nThanks for the chance to ask questions. So, my first question is on the decline in your cash position by 1.4 billion reais. So, you mentioned you paid down some debt in the quarter. If you can discuss what type of debt it was, if it was bank debt, debt to insurers.\n\nAnd if it was basically because you couldn't refinance this debt at a good rate. And if you're paying down debt, then my question would be, why not buy back some of the 2028 bonds given they're trading well below par? If you can talk about the way you think about buying back debt. And finally, on your adjusted cash position, so you make a lot of adjustments to the cash and their position. But I notice a new adjustment this quarter, which is included in the cash position, the deposits from the banking customers, which has an offset liability for roughly -- for basically, the same amount.\n\nSo, there's no impact on the net debt position. But my question is why this adjust -- why this new adjustment? Why the change in disclosure now? Thanks.\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nHi, Nicolas. Rafael here. Let me try to answer all parts of your question. So, first, when you think about the decrease in the cash position, as I said, this was our decision to be more efficient in capital structure, right? So, if you think about one of the debts that we have prepaid was 400 million of our debenture on the beginning of July, right? And also, some other CCBs that we haven't prepaid.\n\nIt has nothing to do with our ability to refinance. By the opposite, I think that as the company has generated more liquidity, we have more and more funding lines from different counterparties. So, I think that was -- it was really a decision to be more efficient there. And if -- as you said, the adjusted net cash position that we have has increased.\n\nThat adjustment that you mentioned about the banking is actually, our decision to be even more conservative in the way we look internally and managerially about that cash because we have banking deposits with us. We do consider this as our adjusted debt, right? And we have banking assets as well that we consider as an asset. There is a technicality that part of the banking deposits that are in transit, we do have the ability, for example, to take that cash for ourselves. We don't need regulatory wise to put that in treasury.\n\nBut when we look at the adjusted net cash position, we do consider this as a debt. So, I think that we decided to do that way not to like have the illusion that cash that belong to the client in transit is our cash. So, I think that we can go in detail with you, but this reflects our approach internally of how we manage the liquidity.\n\nNicolas Riva -- Bank of America Merrill Lynch -- Analyst\n\nThanks very much. Yeah, go ahead, Thiago.\n\nThiago Piau -- Chief Executive Officer\n\nI'm sorry, Nicolas, just to complement and trying to summarize a little bit, in the end of last year, during the third quarter and fourth quarter when we see our margins decreasing, we decided to increase our cash position in order to give comfort for our debt holders. And I think that that was a very good strategy. But in the other way, we created some inefficiency carrying a very big cash position. We decided to better manage and better balance these at this quarter.\n\nSo, we are very comfortable with the level of cash and the capital structure we have. And actually, what is happening today as our results are improving is that the spreads that debt holders and the liability lines we have today, they are decreasing. So, I think that as the results of the company are improving, we are accessing more lines with better prices, and that's why we are comfortable to decrease a little bit the cash position and better balance to carry too much inefficiency on our treasury. But it's a very conservative approach.\n\nNicolas Riva -- Bank of America Merrill Lynch -- Analyst\n\nThanks very much for that, Thiago, Rafael. Just one follow-up then if I may. As you pay down some of this debt in the quarter, was there any thought given to buying back some of the 28s given they're trading at 0.75?\n\nThiago Piau -- Chief Executive Officer\n\nNot yet. We are paying attention to the opportunities regarding our bonds, but we are not -- we didn't started to buy back our bonds yet.\n\nNicolas Riva -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thanks very much, everyone.\n\nThiago Piau -- Chief Executive Officer\n\nThank you very much, Nicolas.\n\nOperator\n\nThis concludes our question-and-answer session. I'd like to turn the conference back over to Thiago for any closing remarks.\n\nThiago Piau -- Chief Executive Officer\n\nHello, everyone. Thiago here. I'd just like to say thank you very much for your support. I'm very happy to see the evolution of our business.\n\nAnd today, I would like to pass the final remarks to Lia. Lia?\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nThank you, Thiago. I want to say thank you for everyone for listening in. Big thank you to our investors for their continued support. And I just want to say that the team is happy with the results this quarter and really looking ahead for a great 2023.\n\nThank you, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRafael Martins -- Vice President, Finance, and Investor Relations Officer\n\nThiago Piau -- Chief Executive Officer\n\nLia Matos -- Chief Operating Officer and Chief Strategy Officer\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nJosh Siegler -- Cantor Fitzgerald -- Analyst\n\nSheriq Sumar -- Evercore ISI -- Analyst\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nKaio Prato -- UBS -- Analyst\n\nMario Pierry -- Bank of America Merrill Lynch -- Analyst\n\nJames Friedman -- Susquehanna International Group -- Analyst\n\nSoomit Datta -- New Street Research -- Analyst\n\nPedro Leduc -- Itau BBA -- Analyst\n\nDomingos Falavina -- JPMorgan Chase and Company -- Analyst\n\nNicolas Riva -- Bank of America Merrill Lynch -- Analyst\n\nMore STNE analysis\n\nAll earnings call transcripts"
}