{
  "companyName": "Walmart Inc.",
  "companyTicker": "WMT",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/walmart-inc-wmt-q2-2023-earnings-call-transcript/",
  "content": "Walmart Inc. (WMT -0.25%)\nQ2 2023 Earnings Call\nAug 16, 2022, 8:00 a.m. ET\n\nOperator\n\nGreetings. Welcome to the Walmart fiscal year 2023 second-quarter earnings call. [Operator instructions] Please note, this conference is being recorded. At this time, I'll turn the conference over to Dan Binder, senior vice president, investor relations.\n\nDan, you may begin.\n\nDan Binder -- Senior Vice President, Investor Relations\n\nThank you, Rob. Good morning, and welcome to Walmart's second quarter fiscal 2023 earnings call. I'm joined by members of our executive team, including Doug McMillon, CEO; and John David Rainey, executive vice president and chief financial officer; John Furner, president and CEO of Walmart U.S.; Judith McKenna, president and CEO of Walmart International; and Kath McLay, president and CEO of Sam's Club. In a few moments, Doug and John David will provide you an update on the business and discuss second-quarter results.\n\nThat will be followed by our question-and-answer session. Before I turn the call over to Doug, let me remind you that today's call is being recorded and will include forward-looking statements. These statements are subject to risks and uncertainties that could cause actual results to differ materially from these statements. These risks and uncertainties include, but are not limited to, the factors identified in our filings with the SEC.\n\nPlease review our press release and accompanying slide presentation for a cautionary statement regarding forward-looking statements as well our entire safe harbor statement and non-GAAP reconciliations on our website at stock.walmart.com. It's now my pleasure to turn the call over to Doug McMillon.\n\nDoug McMillon -- Chief Executive Officer\n\nGood morning, and thanks for joining us. A few weeks ago, we updated you on our expectations for how we would perform in Q2 and for the year. The second quarter finished stronger than we had anticipated, and John David will touch on that in a moment and provide more detail for the back half of the year. Our sales were well ahead of plan with inflation lifting our average transaction size, but we know that the amount and persistence of inflation is negatively affecting many families.\n\nFrom the U.S. to Mexico to Canada to Chile, they're prioritizing how they spend their money. We're pleased to see more families from a variety of income levels choose us as they look for value. Our purpose is to save people money and help them live better, and that's especially important right now.\n\nAfter the first quarter, we shared how the environment had changed. The cost of food and fuel, a heavier mix of sales in food and consumables, and excess inventory in general merchandise categories were among the most challenging items for us at the time. As we move through Q2, food inflation continued to tick up, and we continue to see a heavier mix of sales in food and consumables in many of our markets, and that put pressure on margins overall. Food comps in the U.S.\n\nwere up mid-teens for the quarter with units in food slightly negative and about flat exiting the quarter even with double-digit inflation. Another weight on margins has been the number of markdowns we've taken. Starting back in March, we knew we needed to act quickly and aggressively in some categories, and we have. We've made good progress to reduce inventory levels where we focused and taken markdowns.\n\nThe aggressive approach we took to move through apparel, in particular, put financial pressure on us, but it helped relieve pressure on our stores and through our supply chain. We're making good progress to reduce costs. We've reduced the number of shipping containers in our system, for example, by more than half from the Q1 level and are now much closer to our historical averages. We're also managing pricing to reflect our fully landed costs.\n\nThe merchants are adjusting by category to reflect where we expect demand to be. We had our U.S. store manager meeting last week and among other topics, we shared examples of items where we're holding prices down or rolling them back. Those tend to be opening price point, private brand, food, and consumables items.\n\nWe want to help families put meals on the table with great value in our other private brands to relieve the pressure they're feeling. The quality, value, and convenience we offer make Walmart a smart choice, and we're seeing more middle and higher-income shoppers choose us. As I've been in U.S. stores recently, I'm pleased with how we've executed back to school.\n\nAs we finish it off in some markets, we've transitioned back to college in the appropriate stores with items like mini refrigerators, floor-length mirrors, and futons. In July, I got to visit our associates in India. After visits to Flipkart, Mantra, and PhonePe, a Flipkart fulfillment center, and a [Inaudible] to see how they're using PhonePe, I left even more excited about what's happening in these businesses and what's to come. Having visited several of our international markets this year, I'm pleased by how connected we are now and how so much of what we're building is common across markets as we scale marketplace businesses and fulfillment advertising and financial services take steps to make a bigger difference in healthcare.\n\nAs I look ahead, I expect a strong finish to the back-to-school season, and we'll quickly transition to the holidays. Our fall and holiday products look great. There's a lot of newnesses, and we've got a strong position in opening price points across categories. From Halloween to Christmas to Flipkart's big billion days, we'll be ready.\n\nWe'll have a cleaner inventory position and will have a strong seasonal presence. We expect inflation to continue influence the choices that families make, and we're adjusting to that reality so we can help them more. Regardless of the inflation level and as we work through the places we have too much inventory, we continue to make progress on our strategy. We're becoming more digital, even more relevant as an omnichannel retailer, and the related businesses, like fulfillment and advertising, continue to grow.\n\nWe're building a different business, and we're making progress. Let's move on to our operating segments. I'll start with Walmart U.S. The strong comps we see in food and consumables are leading to market share gains.\n\nPickup and delivery are strong. Growth is improving on Walmart.com, including the marketplace. And more people are choosing to be a Walmart Plus member, or step up to in-home. Walmart Plus is an important component of our plan, and we announced the addition of a streaming benefit.\n\nWalmart Plus members will receive a Paramount Plus subscription at no additional cost as part of their Walmart Plus membership in September. The premium streaming service offers a broad content offering with original series, movies, family shows, and live sports. We're excited about the coming launch, and we know our members will be too. Beyond membership, the team is also working on getting items to customers faster, while lowering the cost of delivery through a significant increase in the number of orders fulfilled by stores.\n\nWe've increased this volume by nearly 40% from a year ago. Speed matters, whether it's how quickly we get items to customers or how quickly we scale new businesses. Our white label delivery platform service, Walmart Go Local, will celebrate its one-year anniversary later this month. Powered by our Spark Driver platform, I'm excited about the growth I've seen so far and the expectations looking ahead.\n\nWe passed 1 million deliveries so far with Go Local. We expect to have about 5,000 pickup locations by year end and client satisfaction scores are strong. We continue to sign up larger-scale customers, and we're making strides on the bigger unlock, which are small and medium-sized businesses. Our technology and expertise will help so many of these businesses grow while contributing to our operating margins over time.\n\nAdvertising is also performing well. In Walmart U.S., the Connect team continues to deliver more value to the suppliers and sellers who advertise with us. Improvements to search and our large first-party shopper data have led to performance improvements for our advertisers, both year over year and sequentially. We've seen the number of active advertisers investing with us increase 121% over last year.\n\nEven more encouraging, these improvements have supported the overall site experience for our customers by helping them find the right products or discover new ones that are most relevant to them. As you've heard us say before, advertising is a global priority for us. We continue to see strong growth in markets outside the U.S., like India and Mexico. Turning to Sam's Club in the U.S.\n\nComp sales were strong again for Q2, up 10%. And marking the tenth consecutive quarter of double-digit comp growth. Similar to Walmart, gross profit was pressured for the quarter on higher-than-normal markdown activity to clear through excess inventory. We'll continue to make progress as we move through Q3, and we'll be in good shape as we enter the holiday season.\n\nWe like what we see in terms of membership. Total accounts are up about 9% over last year, and the penetration of Plus members continues to climb. Moving on to Walmart International, where we performed well again in Q2 with sales up nearly 10%, including double-digit comps in the three largest markets of Mexico, Canada, and China. We're also accelerating our digital businesses, including strong e-commerce growth over the last two years.\n\nMexico is up 31%; Canada, 32%; and China 152%. We see this growth even as customers choose to do more in-person shopping. It really shows the power of operating across multiple channels. Like the U.S., we see the effects of inflation come through in how people are shopping.\n\nIn Mexico, we saw all formats perform well, and Bodega was especially strong with comps above the overall Walmex average. We widened our price gaps for Bodega by 140 basis points in Q2, and we're seeing more customers shopping this format. While inflation remains high, most of our markets are growing comps ahead of inflation. I'm proud that we're helping families access the things they need at more affordable prices.\n\nI'll close today by thanking our associates for all they do every day to support customers and members. I'd also like to welcome John David for his first earnings call with us. And with that, I'll turn it over to him.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nThanks, Doug. I'd like to start by thanking our customers, associates, and partners for helping us deliver another strong sales quarter. We're moving a lot of volume through our business, and I'm proud of how our associate team has responded and serving customers as we manage through this unique period. We delivered strong top-line growth with total constant currency revenue up more than 9% in the second quarter.\n\nSales were strong across all segments, particularly in food and consumables. Customers are increasingly choosing Walmart to help them save money as they deal with broad inflationary pressures. As we navigate the current environment, we know that we're not immune to large macroeconomic shifts. We're facing similar cost pressures that others are seeing related to excess inventory, fuel prices, and supply chain.\n\nBut our business model is structurally sound and our market position is strong. As the year has progressed, we've seen more pronounced consumer shifts and trade-down activity. As an example, instead of deli meats at higher price points, customers are increasing purchases of hotdogs as well as canned tuna or chicken. Private brand penetration has also inflected higher.\n\nAnd in food category, specifically, the private brand growth rate doubled compared to Q1 levels. We'll continue to manage pricing for customers in a way that preserves our price gaps and allows us to earn market share profitably. We've been very focused on managing controllable costs and consequently achieved expense leverage across all three segments in Q2, even though we haven't fully lapped the wage investments implemented last year. During the quarter, we also made progress reducing inventory, managing prices to reflect certain supply chain costs and inflation and reducing storage costs associated with the backlog of shipping containers.\n\nWe're encouraged by the initial steps taken by some suppliers to help us reduce product acquisition costs. We've taken similar steps to manage our support and overhead cost, too, and we're achieving significant savings in the procurement of goods, not for resale. In our stores and fulfillment and distribution centers, we've seen labor productivity metrics improve. We're finding efficiencies and reducing expenses while still focusing on operational excellence.\n\nI want to spend a moment discussing inventory. As a backdrop, the shifts that we've seen in consumer behavior through the pandemic, shifting from in-store to online, along with big swings in the purchase of goods versus services. and then the reversion back to pre-pandemic norms has been sharp and difficult to predict. These trends have been exacerbated by inflationary pressure on the consumer that many of us have not experienced in our lifetime, the effect of which has recently changed consumption patterns in certain categories for us, notably general merchandise.\n\nThe result of all of this put pressure on our inventory levels that peaked in the last quarter. Importantly, the team has a deep understanding of our inventory levels and content have made a lot of progress during the last quarter. In-stock levels have improved about 250 basis points since Q1 in our grocery business alone, despite the heavy sales volumes we're experiencing. We also made progress selling through excess inventory, especially in hardline categories.\n\nAt the end of Q2, Walmart U.S. inventory growth was 26% versus last year, reflecting over 750 basis points of improvement from Q1 levels. Notably, about 40% of the year-over-year increase relates to inflation. General merchandise inventory growth rates are down more than 15 percentage points from Q1, but still with work to do.\n\nWe've cleared most summer seasonal inventory, but we are still focused on reducing exposure to other areas such as electronics, home and sporting goods. We've also canceled billions of dollars in orders to help align inventory levels with expected demand. We estimate that only about 15% of our total inventory growth in Q2 is still above optimal levels, and our actions in Q3 will allow us to make significant progress toward rationalizing absolute levels and mix, which will enable our stores to be well positioned ahead of the holiday season. Despite the short-term challenges we're facing this year, we continue to advance our flywheel strategy and diversify our income streams.\n\nFor example, the global advertising business grew nearly 30% in Q2, led by Walmart Connect and Flipkart, as new advertisers turn to Walmart to deepen relationships with customers. We now have over 240 million items in our U.S. e-commerce assortment, and our marketplace seller count has increased about 60% year over year. We continue to sign on more customers to our data ventures offering and the number of Walmart Plus memberships continues to grow.\n\nWe're also excited about the build-out of automation and technology throughout our business and how it will continue to help drive greater efficiency. Through my first couple of months here, I've been able to get out and visit our stores and see our distribution and fulfillment centers and witness the supply chain automation and technology that we're putting in our stores and centers. One example is the VizPick technology that we've rolled out to our associates across U.S. stores.\n\nThis tool uses augmented reality to speed the inventory management process, enabling associates to get needed product from the back room to the sales floor more efficiently. This not only saves associate time but also helps avoid missing sales through side counter out of stocks. It's a win-win. In summary, our business is resilient.\n\nAnd with the omni capabilities we've built, we're better positioned now than we were in prior periods of economic softness. Now let's get to some additional Q2 financial details. As mentioned previously, each of our segments delivered strong sales growth. Walmart U.S.\n\ncomp sales accelerated to 6.5% growth, reflecting strong grocery sales at a higher average ticket size. International constant currency sales were up 9.9% with strength in Mexico, Canada, and China, while Sam's Club U.S. delivered comps of 10%, excluding fuel and tobacco. Consolidated gross margin rate decreased 132 basis points, reflecting increased markdowns and unfavorable mix shifts in our U.S.\n\nbusinesses. Sam's Club gross profit was also negatively affected by a LIFO charge due to higher inflation. On the expense side, selling, general, and administrative expenses leveraged 45 basis points, helped by higher sales, partially offset by the U.S. wage investments implemented last year.\n\nOperating income decreased 6.8% and adjusted EPS was $1.77. Two discrete items positively affected our results. Operating income benefited from a favorable insurance settlement of $173 million during the quarter. Adjusted EPS also benefited from this as well as a $182 million special dividend from one of our equity investments.\n\nOperating cash flow was $9.2 billion, reflecting lower operating income, higher inventory amounts due in part to inflation and the timing of certain payments. During the quarter, we returned $4.9 billion to shareholders through dividend and share repurchase. Through Q2, we are ahead of pace on our original share repurchase plan for this year and now expect to repurchase $10 billion to $11 billion in shares for fiscal year 2023. Now let's discuss segment results.\n\nWalmart U.S. comp sales momentum continued with growth excluding fuel of 11.7% on a two-year stack. Food sales were especially strong with mid-teens growth while general merchandise sales were soft, particularly in electronics, apparel, and home. Transactions increased 1%, while average ticket increased 5.5%.\n\nWe were pleased to see e-commerce sales growth improve sequentially, up 12% year over year in Q2 and 18% on a two-year stack. SG&A expenses leveraged 21 basis points, reflecting higher sales and lower COVID costs, partially offset by the wage investments. The team did a nice job pivoting the expense structure, so the scheduling challenges from Q1 did not repeat. Gross margin pressure led to a decline in operating income of about 7%.\n\nInternational had another really good quarter. Sales were strong, up 9.9% in constant currency. Currency headwinds negatively affected reported sales results by about $1 billion. Each of our major markets delivered positive comp sales with Mexico and China leading the way.\n\nE-commerce sales on a constant currency basis grew 15% on top of strong gains last year. Comp sales in Mexico increased nearly 11% with strong growth in stores as well as e-commerce sales, which grew 18%. The team is doing a good job reinforcing our price message and positioning as customers manage through this inflationary period. In China, comp sales were up more than 14% with strong growth in e-commerce sales, which increased 77% in the quarter and more than 150% on a two-year stack.\n\nE-commerce penetration continues to climb in both our Sam's Clubs and hypermarket stores as customers increasingly choose omni solutions to meet their shopping needs. Canada comp sales increased more than 10% even as higher levels of inflation are starting to pressure consumer spending in discretionary and general merchandise categories. Flipkart continues to meet our expectations, and the team is gearing up for big billion days. I traveled to India last month and was impressed by how the Flipkart and PhonePe teams are innovating for the customer and driving growth.\n\nPhonePe continued to see strong growth with annualized TPV of over $830 billion, reaching a record level of monthly transactions of about $3.1 billion. International operating income in constant currency increased more than 28%, partially attributable to the previously mentioned insurance recovery for prior operational disruptions in Chile. Sam's Club had another strong sales quarter with comp up 10%, excluding fuel and tobacco, an increase of more than 20% on a two-year stack. Transactions increased 9.8%.\n\nE-commerce sales grew 25%, with strong contributions from both curbside and ship-to-home orders. Membership income was up nearly 9% with another record high quarter in overall member counts and continued growth in Plus member penetration. Sam's added more new members in Q2 than any other quarter in recent years, benefiting from membership campaigns. expenses 131 basis points, including fuel and 72 basis points excluding fuel, due primarily to higher sales and lower COVID costs.\n\nBut gross margins were down as elevated markdowns, supply chain, and fulfillment cost, and a 70 basis point inflation-related LIFO charge pressured profitability. As a result, operating income declined about 35%. Now let's turn to guidance. With the updated financial guidance we released last month, we outlined the pressures that led us to take a more conservative outlook for the current year profitability.\n\nLet me take a minute to provide you with more detail. When we provided guidance three months ago, we didn't expect food and fuel inflation to accelerate to the levels that we experienced in Q2. In fact, Walmart U.S. food inflation was up double digits year over year, and we saw a nearly 400 basis points step-up as the quarter progressed compared to levels at the end of Q1.\n\nThe rising cost for essential items and customers' reprioritization of spending led to significant mix shifts in our business. Grocery sales mix increased nearly 300 basis points, whereas general merchandise sales mix decreased more than 350 basis points. This resulted in additional general merchandise markdowns in our U.S. business, particularly in apparel at a time when inventory clearance was already higher than expected in the industry.\n\nHigher fuel prices also pressured our supply chain expense. We finished the quarter on a strong note, however, and ahead of our updated Q2 guidance provided last month, and the Q3 back-to-school season is off to a solid start. Contributing factors to the better performance included strong sales at the end of the month with good flow-through to the bottom line and lower-than-expected supply chain cost. We're taking additional pricing actions in Q3 to improve inventory levels in the back half of the year, and we built in more conservative category mix assumptions within our guidance.\n\nOur sales and profit view reflects trends we've seen year to date as well as the uncertainty around inflation and consumer spending in the coming quarters. We've updated our fiscal year '23 guidance to reflect the better Q2 results versus the guidance we provided in July. We continue to believe the sales and profit guidance we provided at the time for the back half of the year appropriately reflects elevated uncertainty in this environment and is our best view of expected performance. For Q3, we expect net sales growth of about 5%, including comp sales growth of about 3% for Walmart U.S.\n\nWe're expecting operating income to decline 8% to 10% and adjusted EPS to decline 9% to 11%. For fiscal year '23, we expect net sales growth of about 4.5%, including comp sales growth of about 4% for Walmart U.S. We expect adjusted operating income and EPS to decline 9% to 11%. Excluding the effect of divestitures, this would translate into net sales growth of 5.5% and a decline in adjusted operating income and EPS of 8% to 10%.\n\nBefore I close, I'd like to share my perspective as someone that is new to Walmart and meeting many of you for the first time. I'm excited to join the company at such an opportunistic and transformational time. Certainly, retail broadly is being pressured right now, but that shouldn't detract from the incredible opportunity that we have in front of us. It starts with our mission of helping people save money so they can live better.\n\nWe do that every day at a scale that is unmatched by helping people be able to buy the things that they want and they need. This mission permeates our culture in everything that we do. I've joined an exceptional leadership team. Their history of operational excellence, their strategy, the drive to win is simply something that I wanted to be a part of.\n\nAnd you combine that with the resources we have and the investments we're making in things like supply chain automation, improving our e-commerce capabilities and diversifying our portfolio with higher-margin products and services like data and advertising that will result in more durable earnings streams as they scale. We have the potential to not only be relevant in the next chapter of retail but help define it. And when we execute on these things, we have the ability to appreciably increase our shareholder value over time. I believe that some of the best days of Walmart are in front of us.\n\nI look forward to working with you, and now we'd be happy to take any of your questions. Thank you.\n\nOperator\n\n[Operator instructions] And our first question is from the line of Bob Drbul with Guggenheim Securities.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nGood morning, and, John David, welcome. Congratulations.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nThank you.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nMaybe two quick questions, if I could. The first one, I think, Doug, you mentioned that sort of middle and higher-income shoppers are choosing Walmart. Just wondering if you can elaborate some more on the trade into Walmart that is allowing you to take market share in grocery. And the second question is just wondering if you could give us a little bit more flavor on what you're seeing, what you saw sort of with sales late in the quarter and what you're really seeing so far in early Q3.\n\nDoug McMillon -- Chief Executive Officer\n\nBob, this is Doug. I'll kick it off and then ask John to comment. In Walmart U.S. business, we have seen mid- to higher-income customers come to Walmart looking for value, as you would expect, food and consumables, in particular, are places where they're looking to save some money.\n\nThat's not a total surprise. I think the strength of it is encouraging. And then as it relates to the end of the quarter, there were several things going on. Fuel prices started to move a little bit.\n\nBack to school was strong. And then this income phenomenon that you pointed to also provided some strength to the last week or so of the last month of the quarter, which was a little different than the pattern that we had seen in the first two months of the quarter.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nYes, Doug. It was a bit different than May and June, for sure, and it led -- it has led to the beginning of Q3 being stronger in places like back to school. Food and consumables continue their momentum. And I think the [Inaudible] really changed in late Q3, early -- sorry, late Q2, early Q3 was traffic count was a bit stronger than what we've seen in the [Inaudible] in two months.\n\nDoug McMillon -- Chief Executive Officer\n\nWe were laughing before the call started today about some of the anecdotal stuff that's going on. It won't surprise you that backpacks are strong, for example, but it does surprise us how strong men's panel is. And we've got a program that's just under $12. I bought two of them personally, and it's a great value.\n\nAnd at the same time, some of our clearance price points have gotten really low. We're trying to work through what we would call season code two apparel, and we've got new stuff selling well. So it's almost like you can point to different areas to kind of make the case for what you want the sales story to be.\n\nOperator\n\nOur next question is from the line of Kate McShane with Goldman Sachs.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for taking our question. Our question is centered around markdowns.\n\nWe're curious if the level of markdowns that plan to be taken in Q3 will at a similar level as what you did for Q2. And it sounds like inventory will be much cleaner by Q4, but it seems like there's still a lot of inventory in the industry and consumer that might need to be motivated by promotions given the amount of inflation. How should we think about the markdown environment then in Q4 even in the context of cleaner inventory at Walmart?\n\nDoug McMillon -- Chief Executive Officer\n\nKate, this is Doug. Thanks for the question. I think what we should do is hear from all three segments as it relates to that. We've made progress.\n\nJohn, why don't you go first, but let's also hear from Kath and Judith.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nI start with the second quarter from the end of Q1 to beginning of Q2, there was some definite progress in inventory, about 750 basis points of improvement. We view Q2 as being most urgent to clear through the apparel and some are seasonal that we needed out of the way and sold before Q3 really began to arrive. We certainly made progress in apparel. There's more work to be done in inventory general with a 25% increase and about 40% of that inflation, then the remaining, there's two things.\n\nOne, it helps us in terms of in-stock, we were out of stock last year all throughout the year. So we have made improvements on in stock. I think our results in many categories reflect improvements in availability in in-stock. But then there is some backlog that we continue to work through.\n\nAt the end of Q1, we said this would take a couple of quarters to work through. I would just reiterate, that that remains true. And we'll continue to leave room to make sure we manage our inventory levels well and head into a position in Q4 at the end of the year that we'll be proud of.\n\nDoug McMillon -- Chief Executive Officer\n\nI think the fact that we were so lean last year, combined with how much inflation impacted the number, has kind of been lost in the story a bit. It's true that we've got too much inventory and that, that created a markdown pressure, particularly in Walmart U.S. apparel. But when we look at the overall inventory, as John David has already commented today, it's not like the vast majority of it is merchandise that we didn't want.\n\nWe just were turning goods one year ago and the year before that, frankly, at such a high level that we needed that inventory just to fill side counters and our features.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nThat's right. In 2020, 2021, we would have had sell-throughs in seasonal categories with very few markdowns at the end of season. And so of course, there is some normalization to get back to where we might have been before the pandemic would be in. But again, we still have -- we're still doing some time to work on the remaining excess inventory.\n\nDoug McMillon -- Chief Executive Officer\n\nWe're repeating ourselves, but the level of and the pace at which inflation changed in the first quarter, and that continued in food and consumables into the second, just caused the behavior to flip fast, and that caused apparel to be more difficult than what we anticipated, and that's where the dollars markdown pressure came from. Kath, do you want to go next?\n\nKath McLay -- President and Chief Executive Officer, Sam's Club\n\nYes. I'd really just say, if I look at our inventory position at the moment, for the last two years, like we talked about, we've had 10 quarters of double-digit comps. For the last two years, we've struggled to stay in front of having enough inventory. And then so we're off a deflated base when you look at what our current position is.\n\nThis year, then obviously have the contraction with inflation. But what we've seen is that we've got really good quality inventory. We're really happy with the seasonal sets we've got. Halloween looks fantastic back to back to school, college has been good.\n\nTailgating has been great. I think what I would say is in our number in this quarter, a portion of it has been markdowns and portion of it is actually inventory reserve because we wanted to get in front of it and just make sure that we put aside the money for Q3 so that we can have a really strong Q3 kind of results. So that's how we've addressed markdowns in Q2.\n\nJudith McKenna -- President and Chief Executive Officer, Walmart International\n\nFor international, we saw some good progress on inventory quarter on quarter. Some of that helped by the FX position on that, but underlying as well. I think as look at it, about our increase year on year is absolutely planning for. And as you've heard that leanness that we had last year is really coming through.\n\nAnd I think that's the theme for everybody. We just didn't have enough inventory at that time. That leaves about 25% of it, which is some GM categories in a couple of markets, specifically, which would be Chile and Canada. But I'm very comfortable with the way that the market has with that.\n\nAnd just as a reminder, for at least Chile, our quarter end is a month earlier than the enterprise quarter end. So we're already seeing some of that clearance happening for the market.\n\nOperator\n\nThe next question comes from the line of Peter Benedict with Baird.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nHi. Good morning, guys. Thanks for taking the question. Just want to talk a little bit about grocery, the strength there, particularly in food.\n\nCan you talk about pricing, how you're managing that? I know units, it looks like they were down for the quarter, but improving to, I guess, flattish as you exited the quarter. Just how are you thinking about pricing relative to units? What's the promotional environment you're seeing within grocery and just how the grocery strength is split in store versus online and curbside?\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nPeter, it's John. Let me take your question in parts for just a second here. I mean, first, value is always top of mind when it comes to us and deciding how we want to serve customers. So we'll always lean on the value for the customers above other things.\n\nAnd what we want to do and what we try to do throughout this entire period is go up as late as possible. We certainly have been passing prices through when we see things like landed cost of goods going up, those have to be passed through. We're managing our supply costs as well as we can. Units did strengthen throughout the quarter, particularly in July and late July.\n\nI think you heard that earlier. So seeing some positive units there was refreshing given how we had started the quarter. Fuel prices were coming down. So we think that could have had some of an impact as well.\n\nIn terms of the market, we're really focused on everyday low price. We have a strong rollback campaign all across the store, which would include food, consumables, and general merchandise. And then in general, just across the food categories, our availability improvements, I think you can see in stores more consistently and across categories. Just you remember this time last year, we had pockets about of stocks that kept emerging the only 1 that we really faced in the second quarter in a big way was baby formula, which is now improving.\n\nDoug McMillon -- Chief Executive Officer\n\nThe unit story is, one, the transaction count being up a little in this environment is also important to call out. The average basket was way up, but it's great to see transactions grow in the Walmart U.S. business also.\n\nOperator\n\nOur next question is from the line of Steph Wissink with Jefferies.\n\nSteph Wissink -- Jefferies -- Analyst\n\nThank you. Good day, everyone. I wanted to follow up, Doug, on your comments regarding how the basket is shifting for consumers. I think you mentioned in the proteins category and even some areas of private label then.\n\nMaybe take us into the household budgeting that you're seeing with respect to your transaction structure. And then as you're looking at your guidance for the back half, maybe a follow-up would be what you're assuming in terms of the basket composition class of goods or even within private label versus national brands?\n\nDoug McMillon -- Chief Executive Officer\n\nYes, John. You jump in here, too. I think what you should take away from Q3 and Q4 guidance is that we're expecting the environment to look a lot like Q2. And as it relates to the choices people are making, the thing I would call out John's variety is that you've got all kinds of income levels shopping in different ways and we've seen strength in some categories.\n\nIt's really encouraging. For those that are under the most pressure, that are most price-sensitive, private brands are stronger, pack sizes are different. Opening price points, John, you might talk a little bit about what you saw at the holiday meeting, looking at for things like the Thanksgiving meal. The team's doing a great job of protecting opening price points for people that are most price conscious.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nSteph, as thinking back, one of the meetings we had in New York in 2020, we talked a lot about serving customers flexibly as we develop the different businesses. And so just to tag on to Doug's comments, serving customers in store is something we have pressed ourselves on a long time. Our pickup business continues. Delivery is growing with Walmart.\n\nSo the variety of ways that we can serve customers, I think it's been helpful, especially given the number of ships customers that have had in their lives the last couple of years from working at home and then in many cases, back out into the workplace. So as customers change, we can serve them in a number of ways. When you then click into products, our wide portfolio of products, both in e-commerce and in stores, including the numbers you heard from John David earlier in Marketplace, gives us the ability to serve a wide range of customers. And then as Doug mentioned last week, we had all of our managers together in Denver, which is always a fun exciting experience to get the team together.\n\nBut what I heard consistently is as the team is doing a very nice job balancing out how to improve quality and sell higher price points and remaining focused on opening price points. So having Thanksgiving meals in a position where you can buy an entire meal for under $50 for a family of four is exciting. So there's a value play, and there's a quality play. And wherever the customer goes and how things shifts, we'll be ready to serve them and we're building the capabilities to be able to do that at will.\n\nSteph, I would just add. This is John David. As it relates to our guidance in the back half of the year, the swings that we've seen in consumer behavior have been difficult to predict and the pace at which they've happened has been sharp. And so our guidance for the back half really just assumes no change in what we're seeing in the second quarter in terms of mix changes in our business.\n\nOperator\n\nOur next question is from the line of Michael Lasser with UBS.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning, and thanks for taking my question, and welcome, John David. Walmart's been experiencing some discrete and arguably temporary factors that are weighing on its profitability this year, including staffing issues in 1Q and the well-documented inventory issues. So looking toward next year, when some of these inflationary pressures, inflationary cost pressures are going to seemingly roll back and you'll have moved through some of the challenges and the underlying drivers of the operating, alternative operating profit growth should continue, why wouldn't Walmart be in a position to generate growth above its long-term algorithm in 2023?\n\nDoug McMillon -- Chief Executive Officer\n\nSure. I'll take that, Michael. Thanks for the question. You're right.\n\nCertainly, we've incurred some costs this year that are more, call it, onetime in nature related to the supply chain and higher inflation, but it's difficult to predict how long that will persist. Certainly, the inventory situation has gotten better. But the effect on the mix changes in our business are largely the result of higher inflation, and that may persist for some time. And so we're being cautious with respect to the outlook.\n\nWe're obviously not giving guidance for next year right now. But look, what I'd point you to is the conviction that we have in our long-term plan has not changed, has not wavered. When you look at the long-term plan that was laid out by the management team previously in terms of what we're doing with the flywheel strategy, the ability to grow operating income faster than revenue. And you look at that over a multiyear basis, we have as much conviction today as we did when we laid that out.\n\nSo very excited about the future. But the short-term period, this is a moment in time, and we're being cautious with respect to the outlook because there's a lot that we don't know.\n\nOperator\n\nOur next question is from the line of Edward Yruma with Piper Sandler.Ed YrumaHey. Good morning. Thanks for taking the question. John David, curious on your perspective, given your most recent stop on Walmart's advertising and fintech businesses, you have a lot of experience from PayPal on that.\n\nHow do you assess kind of where they're at today? And kind of how do you think about the longer-term growth opportunity?\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nSure. I appreciate the question. Well, certainly, I am a believer in what's happening digital payments, fintech broadly, and the secular tailwinds that exist there with consumer behavior, moving more digital, online. And if you look at the investments that Walmart has been making, they're in those areas, whether it be expanding their e-commerce capabilities, their marketplaces, even getting into financial services.\n\nAs I have an early peek into what the company is doing, I've got to say I'm very impressed with the broad capabilities and the resources devoted to this. And so I think it's a huge opportunity for Walmart going forward. And frankly, one of the reasons that I'm so excited to join, to be part of this and help shape this outcome.\n\nJudith McKenna -- President and Chief Executive Officer, Walmart International\n\nMaybe it's worth adding on financial services PhonePe in India. You heard that we were there recently, and John David, you with us as well and got to visit the business there. It was -- you'll have seen from the scripts that we had today that they grew their annualized TransAct TPV to 830 billion. Last quarter, that was 770 billion.\n\nSo really good progress there, and they're also now got monthly transactions of 3.1 billion a month, which is incredible. I think what's really encouraging way that they're approaching this space is looking not only at payments, but also merchant services, and that two-sided network is an important part of that. But equally, starting to expand into financial services as well with a real focus at the moment on insurance and pushing that. Their knowledge and the ability to share that knowledge around the world to help other markets such as Mexico from best practices, what they should be looking at, has been incredibly invaluable and one of the real benefits of being a global company.\n\nDoug McMillon -- Chief Executive Officer\n\nI'll just add, Judith, that I shared the excitement that we all had when we went to India and met with the team. To put it in perspective what PhonePe is doing and if you look at the largest digital payments companies outside of China and the world, PhonePe, after a very brief history, is already roughly two-thirds of the size of that, and what is going to be the largest market in the world in a very short period of time. So it's a really exciting opportunity.\n\nSure. I think you also asked about advertising. The relationship between digital growth, marketplace growth, advertising is something that we're trying to take advantage of. In the case of the U.S.\n\nbusiness, the ability to attribute sales later on to in-store transactions makes us uniquely positioned. And we've made a few enhancements lately for people that are consuming advertising from us.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nWe have, and knowing more about customers and the way they shop, knowing more about them in retail is important, and the growth in pickup and delivery and the growth in Plus, the growth in marketplace and e-commerce all help us be able to identify the right sellers and suppliers that we can connect, hence the term -- name Walmart Connect. We can connect them together to have an environment where not only is it accretive to the profit and loss statement, but more importantly, accretive to the customer experience and help them get to exactly what they're looking for. I can't remember a business with the margin structure of the advertising business here at Walmart and having 30% growth for the quarter was nice to have.\n\nOperator\n\nOur next question is from the line of Kelly Bania with BMO Capital Markets.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nHi. Good morning, and I'll add my welcome to you, John David.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nThank you, Kelly.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nA lot of comments on the inventory, but just had a couple of more. Can you clarify the dollar amount of inventory that you estimate would be excess? And can you help us understand how much of that is in apparel or other categories and the magnitude of markdown that you expect to clear through that and the timing of when you expect to get back to a clean position? And I guess to follow up on that, do you at all think that this discounting from you and others in the industry could pull forward some demand from the second half? And have you considered that into your second-half guidance?\n\nDoug McMillon -- Chief Executive Officer\n\nSure. I'll take a stab at that, Kelly. So if think about -- just take the U.S. inventory increase in the second quarter of $11 billion.\n\nIf you decompose that, about 40% of that is due to inflation. So don't think units, think just dollars. And then you look, as Doug noted, at things like the fact that we're growing as a company that we've got less in stock next year and you normalize for all of that, you really whittle that down to about $1.5 billion of inventory that if we can just wave a magic wand, we'd make go away today. And the fact is we'll sell that.\n\nBut if we were to start from scratch, that's what get rid of. In terms of the types, as John noted, the inventory issues were most acute in in apparel the second quarter. As we look into the third quarter, I'd say it's home electronics and apparel are probably the areas that stand out the most.\n\nOperator\n\nOur next question is coming from the line of Simeon Gutman with Morgan Stanley.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood morning, everyone. Still focusing on gross margin. The U.S. gross was down about 106 or so or 107 in the second quarter.\n\nCan you comment how much is mix versus markdown? And to us, it looks like the mix is not getting any worse, if that's fair. And then the clearance levels in Q3 versus Q2, will the clearance/markdown occupy a greater proportion in the third quarter versus the second?\n\nDoug McMillon -- Chief Executive Officer\n\nSure. Simeon, I'll take a stab at that as well, and John might want to jump in. So if -- I'll just point you to the 132 basis point decline overall in gross margins. And there's really three things that I would say in order of magnitude that contributed to about call it, two-thirds to 75% of that.\n\nSo number one would be markdowns, number two is mix, and number three is the LIFO charge that we talked about in Sam's. And then there's all the various puts and takes that round out the balance of that. As it relates to markdowns in the third quarter, look, we feel like we're in a better inventory position and those are obviously very related. And so we would hope that not going to see the level of markdowns that we experienced in the second quarter.\n\nBut we also -- that's assuming that nothing changes with the consumer. So as we noted, we're being cautious on the outlook, and we'll wait and see what happens.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nIn the U.S., Simeon, this is John. In the U.S., we did not have the LIFO charge, so a larger percentage of our markdown issue would have been in apparel. We still have a bit more to work through, but we're close if you compare to where we might have been before two years ago. So we're getting close to a position where apparel is behind us, and that was the issue that throughout Q2, we spent the most time worrying about because we need to move through it because the goods have been purchased a long way out.\n\nRegarding the rest, in Q1 and then in Q2, as the backlog of containers work itself through, that has created a lot of what the issue is today, where we felt good that we would have liked to have had months ago, and then this season is all here at the same time. So we've ingested all that inventory. We've largely gotten out of the container storage and movement business. We have the inventory in the network.\n\nSo we have a good handle on what we own, where it is. And then as I said earlier in the call, the end of Q1, we need a couple of quarters to work through it, and that's exactly what we do. So John David's right. We'll sell it.\n\nWe'll work through it. Yes. There will be some liability in But apparel was definitely the issue that we had that was most queued and would have really hurt us had we not addressed it.\n\nDan Binder -- Senior Vice President, Investor Relations\n\nI was going to say, Simeon, on your mix question, if you go into our filings, you'll see our mix change year over year, and you'll see that in Q2 as well when we file our Q, at the end of Q1, it was a fairly significant shift as we were lapping stimulus spending. We recalibrated our expectations at the end of Q1, and then it was even worse than we expected for Q2. So that's what you're seeing get reflected in our view as we look to the back half, we don't want to kind of get ahead of ourselves just because sales have been strengthening at the end of the quarter.\n\nDoug McMillon -- Chief Executive Officer\n\nYes. I was going to kind of double-click on that a little bit more, too. Fuel coming down in recent weeks is helpful. It's still about 27% inflated per gallon versus one year ago nationally.\n\nSo the absolute spend that an American family is deploying the fuel is still high [Inaudible] is the amount of food inflation. And I think Q4 last year is the moment where we started to see U.S. food inflation tick up. It was kind of low to mid-single digits.\n\nSo when you get to Q4, you start to anniversary a food inflation number against inflation number. So the two-year stack of food inflation will be something that we'll be keeping an eye on. If you told us that fuel was going to to continue tick down and that food inflation was going to moderate, that influences how we think about general merchandise inventory. And as we worked with the merchants over the last few weeks, it's been kind of fascinating to think through how you make choices on it and category by category because you don't want to go into too much of a defensive mode, and we were looking at Halloween decor last week, John, and there are some things, outdoor decor, particularly like inflatables, that are really fun, cool, new items.\n\nAnd when you see them, you're like, we can sell. Oh, you can buy that. Like we're going to blow out of some of those. And we want the buyers in some categories to have that mentality and be aggressive.\n\nIn other places, we want to be more conservative so that we don't repeat the mistakes that we've had in the first half of this year. That's such an interesting thing to work through. It takes a lot more leadership from our merchant team, for example, that it might ordinarily, we think we have made some good decisions subcategory by subcategory for the back half of this year, canceled some orders, trying to get that right area by area so that we don't end up being too conservative in places where we shouldn't be.\n\nOperator\n\nOur next question comes from the line of Robby Ohmes from Bank of America.\n\nRobert Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning. Thanks for taking my question. I think a follow-up on that, Doug.\n\nI think it's probably harder for you guys to predict where fuel prices are going, but you have some visibility on food inflation given how large you are a player in that. It accelerated a lot in the second quarter. Has that continued in the third quarter? And I guess, does the guidance, it assumes it stays at the level of the second quarter? Or do you think it could be up more in 3Q before maybe it fades against the comparisons in the fourth? Any kind of color on what you're assuming would be great. And a quick second for Kath is just the home and apparel comps were much stronger at CMs.\n\nWas that all clearance? Or is there something different between Sam's and Walmart U.S. in terms of home apparel sales?\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nRobby, it's John. I'll take the first part of your question. In relation to -- as it relates to food inflation, it definitely moved up in the second quarter and months of the quarter. So July was higher than June.\n\nJune was higher than May. I think it's too early into the third quarter to try to make a call if this is where we'll be, if it will go higher or go down. So for now, we're assuming that this is the level we're at and it could continue. And some of the factors though to consider is one of the costs that are part of the way we price food is the cost of moving food.\n\nSo diesel fuel continue to move down, that could be a tailwind related to inflation. However, there's still some commodities up. We do see a few categories in the store where prices are starting to come down, but there are other categories where we're still rising. So I think it's just too early to call in the quarter.\n\nCertainly hope that some of these larger macroeconomic conditions would lead to lower prices in food, but we're not able to say that we see that happening just yet.\n\nKath McLay -- President and Chief Executive Officer, Sam's Club\n\nAnd it's Kathryn, Sam's. On the home and apparel, what I would say is it's actually a multi-year story. So it's not clearance. It's been the investments we've made in the quality that we've had in home, apparel, and seasonal, and we're seeing better quality brands, and we've seen that resonate with our member base, and that has continued through into this year.\n\nDoug McMillon -- Chief Executive Officer\n\nAlso a higher income member than the profile you see in Walmart U.S.\n\nOperator\n\nNext question is from the line of Rupesh Parikh with Oppenheimer.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nSo first on the markdown front, I was curious if you can at all comment on what view excess markdowns as we try to think about next year. And then secondly, on Sam's Club gross margins declined nearly 300 basis points. I want to get a sense of if you expect any of that to be structural. Or do you expect that to recover the margin decline over time?\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nIn markdowns, kind of break it into pieces. Last year and the year before, there weren't really many markdowns to speak of because we were chasing demand and in many cases, at the end of seasons were very clean. So returning to a point where there are in the season markdowns is a pretty normal thing that we would experience. And the way we're trying to manage the sell-through season by as compared to historical rates back in 2018, 2019.\n\nAnd of course, things are always going to be different, but it's a good barometer to determine where we land. The second the business is much larger than it was in 2019. So these volume levels continue to improve, which then leads to the dynamic of how much you purchase, which ultimately amount you purchase versus demand will lead you to your sell-through and markdown numbers. So for the fourth quarter, we mentioned we've canceled billions in orders.\n\nWe feel much better about the back half of the year. We still have inventory to work through and ingest from the backlogs, as we said. So we need a couple of quarters to do that. And then heading into the next year, we'll have purchasing levels that are more in line with the way we see demand as it's going today.\n\nOf course, a lot can change. We need to know more about fuel pricing and inflation in the state of the consumers we get there, but we have definitely had more time and success in in getting purchasing line with our current inventory levels and the way we see demand going in terms of mix today.\n\nKath McLay -- President and Chief Executive Officer, Sam's Club\n\nAnd for Sam's part of the question, I would say if you look at our GP rate, there's two major things going on there. One is the LIFO charge of $123 million, and the other one is what we had called markdowns. But there's two things at a player there. The largest part of that amount is a strategic decision we made to create an inventory reserve for Q3.\n\nAnd so that's really pulling forward those markdowns from Q3 into Q2 to set ourselves up for success and make sure that we're really competitive going into Q3. So I don't see that as a trend. I see that as just this quarter, the impact on this quarter.\n\nOperator\n\nOur next question is coming from the line of Joe Feldman with Telsey Advisory Group.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nHey, guys. Thanks for taking the question. Wanted to check in on what you're seeing with the supply chain these days. I mean I know fuel cost has come down, and we're hearing container cost prices have come down.\n\nBut are you getting a more regular flow of inventory as you need at this point? Or just your view of the global supply team would be really helpful.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nJoe, it's John. First, let me just say a big thank you to our supply chain team, our merchants. They have been through a lot. The environment has been extremely dynamic, and they have really just made a huge difference for the entire company.\n\nIn the last couple of quarters, what's it been like? There was the backlog of containers that really started last fall when the ports backed up. We've worked those through. In terms of container costs, they are down from where they were, but they are still higher than were a year ago and was higher than -- it's higher than they were the year before that. So still inflated, and those costs are flowing through.\n\nFuel costing, as Doug said earlier, fuel has come down from its peak at the end of Q1, early Q2, but it still remains elevated. And those are real costs that are passed through and customers will see those prices at the counter and on the site. So in general, we see better flow. We see better availability.\n\nOur availability rates in food, consumables and then our consumable portions of general merchandise are much better than they were a year ago. But I still think we have work to do to get back to where we were back in 2019, but still uneven in places. And any time in retail, that inventories back up the way they did. It does cause pressure on being able to get the right inventory at right location in front of the customer.\n\nSo optimistic that can improve as these inventories come down, but it's going to take a few more months to work through the backlog of inventory that's in the network.\n\nDoug McMillon -- Chief Executive Officer\n\nJoe, I would just add from a P&L perspective and you think about the cadence of earnings from 3Q to 4Q, we started experiencing more pronounced supply chain costs in 4Q last year. So from a cost side that makes the comps a little bit easier. And if you're thinking about operating income in the fourth quarter versus the third quarter.\n\nOperator\n\nOur next question is from the line of Chuck Grom with Gordon Haskett.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey. Thanks very much, and welcome, David. When you unpack the factors behind the better back-to-school and strong finish in July, and it sounds like in August so far, I guess how would you rank the key contributors? Lower gas prices, there was a big uptick in state tax holidays this year versus last. And I guess has the improvement altered your view of the upcoming holiday season in any way in terms of how you think the consumer is going to react?\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nI think there are three factors that stand out, and you'll see this in the numbers. One is there are more customers shopping in the brand than we've seen previously, including better traffic numbers. fuel prices did come down throughout the month of July. And I think the third that's important is school attendance levels, we think, will be higher.\n\nThere are very few instances of schools that are remote at this point, and there were some of those last year. So things like backpacks and lunch boxes. And then there are other programs where some school lunches were paid for last year that this year will be funded by families and parents. So there's a shift in all of those factors that are leading to more spending late in July and early in the third quarter.\n\nAs far as how it relates to the rest of the year, again, so a lot of unknowns as we get into the rest of the year. Fuel prices are still moving, but they continue to move down, that would be a great thing. And we'll have to watch the shape of consumer and see how they're buying. But I would just reiterate what John David said earlier, we are really committed to the long-term plan and our long-term view of the business.\n\nAnd it's been great to see some of the improvements in the areas on the flywheel that are adjacent to retail that will help the overall business over the long term.\n\nDoug McMillon -- Chief Executive Officer\n\nJohn, I would add as it relates to better-than-expected performance for 2Q. As noted, supply chain cost better than we expected. And in any quarter, when you close, you're going to have some puts and takes at the end of the quarter. Some may fall in your favor.\n\nSome may work against you. In the first quarter, supply chain costs came in worse than what we expected when we closed the quarter. And so when we updated our guidance at the end of last month, we had a similar expectation. It actually fell the other way in our favor.\n\nAnd so that contributes to the better-than-expected performance relative to our guidance at the end of last month.\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nI would just add, when you're thinking about supply chain costs, and we're getting invoices all quarter end to end, a lot of the things that we were experiencing these last several quarters have been unusual, container fines and excess fuel charges and things like that. So there was -- it was a higher -- an expectation of higher cost and it just came -- it felt favorably.\n\nOperator\n\nOur final question will be from the line of Ben Bienvenu with Stephens.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nHey. Thanks. Good morning. I want to ask when you move through a cycle like this with consumers trading down and between the price and you gain market share and pick up new customers, how sticky does that share end up being on the other side of this inflation? Might we see this bolster your long-term share position and maybe leave you guys coming out of this environment in a stronger position with the consumer? And then as a follow-up, you noted you're seeing middle end and some helpful trading into Walmart.\n\nWhat are you seeing you seeing from lower-income households? Are any trading down away from Walmart?\n\nDoug McMillon -- Chief Executive Officer\n\nYes. We certainly hope to hold share around the world, and I think this inflationary environment is going to last for a while. So people are going to be value conscious, which plays to our strengths. The e-commerce experience end to end is a focus of ours.\n\nWe want to continue to grow our pickup and delivery businesses around the world. We, of course, want to grow and maintain share of customer spend in the stores as well. Moving away, I think if any of you want to comment, you can, I think we are holding at the lower end and adding at the upper end, generally speaking.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nI think that's exactly right. And in relation to the first part of your question, Ben, what have we seen in previous cycles? We did see some pickup in the last cycle. That was a downturn in 2008, '09. But there are a few things that are different now that I think I'd like to point out.\n\nAnd in that time period, we had our store business and a small e-commerce business. We did not have food pickup. We didn't do delivery from stores. We didn't deliver groceries.\n\nWe did not have Walmart in Home. We didn't have Walmart Plus. So our ability to serve customers more flexibly in a more flexible manner than what we could have 13, 14 years ago was pretty dramatic. So definitely a lot of work to do to ensure that we're taking care of those customers and we're focused every week on satisfaction scores and accuracy of delivery and things like first-time pick rate, which is an indicator of did we get your entire order right at the very first time we try to deliver it.\n\nThose will all be important in terms of being able to hold on to new customers. But we definitely have a number of ways that we can serve customers today that just, quite frankly, did not exist the last time we went through a downturn.\n\nDoug McMillon -- Chief Executive Officer\n\nPlanning to sell some more Walmart Plus memberships to help solidify those relationships, and the Paramount announcement should help us do that.\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nYes. We're excited about the announcement, Doug. The brand Paramount has a lot of programming for kids. It has live sports.\n\nThere are other movies and drama. So it's a wide variety of content that I think our members will enjoy. And that was, quite frankly, a member-led research when we talk to members and ask what are the benefits they were looking for, the No. 1 feature outside of delivery of product from both stores and e-commerce was an entertainment benefit.\n\nAnd there were others they talked about, but entertainment was at the top of the list, and that's what led to the decision to add this benefit to the program.\n\nOperator\n\nAt this time, we've reached the end of our question-and-answer session. And I'll turn the call over to Doug McMillon for closing remarks.\n\nDoug McMillon -- Chief Executive Officer\n\nYes. As usual, thanks for your attention. We appreciate you focusing on our company. I'll just wrap up with maybe three points.\n\nThe first one is hopefully, you're seeing in the results and hearing from us that we're making progress. We're addressing our inventory issues. We're pricing to reflect our cost structure. Secondly, more people are choosing Walmart and Sam's Club and our brands around the world.\n\nBodega business in Mexico, for example, is really strong. So being able to attract more and customers and a more diverse set of customers is a positive for us. And then third, we're continuing to change the business and execute our strategy, our e-commerce growth, our digital transformation, growing the marketplace, growing these related businesses that are unlocked by this digital transformation that's happening in the company is something that we're focused on. Regardless of the short-term pressures, we're making progress toward the longer term.\n\nWe certainly hope to put the pressures that we've had in the first half behind us as quickly as we can, claw back the operating income percentage delta that we've experienced in the first half to the extent possible, as fast as possible. But as you can see in our guidance, we acknowledge reality. The world around -- around the world is feeling various pressures, most pronounced from inflation, of course. So we think we put ourselves in a good spot to continue to make progress and value when customers and members are focused on values is something that plays to our strengths.\n\nSo we'll take full advantage of that. Thank you, all.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDan Binder -- Senior Vice President, Investor Relations\n\nDoug McMillon -- Chief Executive Officer\n\nJohn David Rainey -- Executive Vice President, Chief Financial Officer\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nKate McShane -- Goldman Sachs -- Analyst\n\nJohn Furner -- President and Chief Executive Officer, Walmart U.S.\n\nKath McLay -- President and Chief Executive Officer, Sam's Club\n\nJudith McKenna -- President and Chief Executive Officer, Walmart International\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nSteph Wissink -- Jefferies -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nRobert Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nMore WMT analysis\n\nAll earnings call transcripts"
}