{
  "companyName": "Bionano Genomics, Inc",
  "companyTicker": "BNGO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/bionano-genomics-inc-bngo-q3-2022-earnings-call-tr/",
  "content": "Bionano Genomics, Inc (BNGO -0.68%)\nQ3 2022 Earnings Call\nNov 03, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Bionano Genomics third quarter 2022 earnings conference call. Today's conference is being recorded. At this time, I would like to turn the conference over to Amy Conrad from investor relations. Please go ahead, ma'am.\n\nAmy Conrad -- Investor Relations\n\nThank you, Cynthia, and good afternoon, everyone. Welcome to the Bionano Genomics third quarter 2022 financial results conference call. Leading the call today is Dr. Erik Holmlin, CEO of Bionano.\n\nHe is joined by Chris Stewart, CFO of Bionano. After market closed today, Bionano issued a press release announcing its financial results for the third quarter of 2022. A copy of the release can be found on the Investor Relations page of the company's website. I would like to remind everyone that certain statements made during this conference call may be forward-looking, including statements about Bionano's revenue outlook, strategic and commercialization plans, anticipated benefits or improvements to Bionano's products, including the Sapphire system and MX clinical software, anticipated milestones for 2022, including progress on Elevate and each pillar of Elevate the advantages of the PACCAR system over current technologies and fan expectations regarding study results and anticipated benefits of these studies and their ability to drive adoption of OGM.\n\nSuch forward-looking statements are based upon current expectations, and there can be no assurances that the results contemplated in these statements will be realized. Actual results may differ materially from such statements due to a number of factors and risks, some of which are identified in Bionano's press release and Biomate reports filed with the SEC. These forward-looking statements are based on information available to Bionano today, and the company assumes no obligation to update statements as circumstances change. In addition, to supplement Bionano's financial results reported in accordance with U.S.\n\ngenerally accepted accounting principles or GAAP, the company is reporting non-GAAP operating expense. This non-GAAP financial measure is not meant to be considered in isolation or as a substitute for comparable GAAP measures should be read in conjunction with the company's consolidated financial statements prepared in accordance with GAAP has no standardized meaning prescribed by GAAP and is not prepared under any comprehensive set of accounting rules or principles. A description of non-GAAP operating expense and reconciliation of non-GAAP operating expense to GAAP operating expense are included at the end of the company's earnings release issued earlier today, which has been posted on the IR page of the company's website. An audio recording and webcast replay for today's conference call will also be made available online on the company's IR page.\n\nWith that, I will turn the call over to Erik. Erik?\n\nErik Holmlin -- Chief Executive Officer\n\nThank you, Amy, and thank you, everyone, for joining the call today. We had another outstanding quarter -- third quarter for 2022, and Chris and I are excited to provide you with key results and an overview of the quarter as well as to give you an update on our growth strategy, Elevate. And we want to take this opportunity to also talk to you a little bit more about the market areas where we see the highest potential for the adoption of optical genome mapping. Now turning to our third quarter results.\n\nTotal revenue was $7.2 million for the quarter, which represents another record revenue for the company and an increase of 55% over the third quarter in 2021. We've seen revenue growth compared to the same time last year across APAC, Europe, Middle East, Africa, and Americas. And so we're very pleased with this progress. We sold 3,975 flow cells in the quarter, which is a record for the number of flow cells sold in any quarter in the company's history, and that represents a 17% sequential increase over the second quarter of this year, and it's comparable to the 3,969 flow cells we sold a year ago in 2021.\n\nWe analyzed 369 samples in our laboratories, which represents 19% growth over the third quarter in 2021, and we ended the quarter with an installed base of 2017 Sapphire systems, which is a growth of 54% over the 141 systems installed at the end of the third quarter in 2021 and an 11% sequential increase over the second quarter of this year. Another area where we saw significant progress was in Bionano Laboratories, which officially launched this quarter. Bionano Labs is a new organization that combines our optical genome mapping data services with the clinical testing services that were previously known as Lineage. We've also launched the first optical genome-based mapping-based laboratory-developed test out of Bionano Labs, and we received CLIA certification for the San Diego lab.\n\nNow this certification is important because it enables Bionano laboratories to offer services to customers who seek to implement optical genome mapping into their clinical routines and for research applications with hospitals, pharmaceutical companies, and other groups that require a more robust regulatory structure for their projects. At this point, I'd like to turn the call over to Chris, so he can go a little deeper into the financials for the quarter. After Chris' remarks, I will provide updates to the five strategic pillars in the growth strategy and then discuss the market potential we see for optical genome mapping in key areas, including Cytogenomics discovery research and something we haven't been talking a lot about, but is really exciting called cell bioprocessing QC. Chris?\n\nChris Stewart -- Chief Financial Officer\n\nThanks, Erik. The third quarter of 2022 was another outstanding quarter for Bionano. As Erik mentioned, we recorded significant year-over-year revenue growth and continued growth in the installed base of our Sapphire systems. We believe the building excitement in the market about the capabilities of our products is driving the revenue momentum we are seeing.\n\nRevenue in the third quarter of 2022 was $7.2 million, representing an increase of 55% over the third quarter of 2021 and our highest quarterly revenue to date. We came in just above our previous guidance range of $6.7 million to $7.1 million, mainly due to stronger-than-expected sales of NX clinical software. Gross margins for the third quarter came in at 25%, in line with the third quarter of 2021 and a 3% improvement over the 22% we saw in the second quarter of 2022 due to improvements in chip production yields and the favorable product mix in the quarter. We are making good progress on improving yields, and we expect to see continued gross margin improvements in the coming quarters.\n\nQ3 2022 GAAP operating expense was $34 million, compared to $21.8 million in the third quarter of the prior year. Q3 2022 non-GAAP operating expense was $26.4 million, compared to $18.7 million in Q3 of 2021 and roughly flat to the $26.3 million in Q2 2022. I Q3 2022 non-GAAP operating expense includes $6.1 million in stock-based compensation, $1.4 million in amortization of intangibles, and $100,000 of transaction-related expenses. The year-over-year increase in opex was primarily due to increased headcount and related spending.\n\nOur capitalization remained strong with $180.2 million in cash, cash equivalents, and available-for-sale securities as of September 30th, 2022. That includes $22.5 million in net proceeds raised through the sale of 6.6 million shares in Q3 2022 under our ATM facility. Looking forward, we expect revenues in the fourth quarter to be in the range of $7.5 million to $8 million, which would imply full year revenue in the range of $27.1 million to $27.6 million. This number is slightly above the top end of our prior full year guidance range of $24 million to $27 million.\n\nBefore I turn it back over to Erik, I want to quickly mention that we plan to hold our first Strategy Day this coming February. More information will be forthcoming in the near future. With that, I'll turn it back to Erik.\n\nErik Holmlin -- Chief Executive Officer\n\nThanks, Chris. Our strategy for growth, which we call Elevate is based on five key pillars. -- to expand commercial traction and validation of optical genome mapping with Sapphire to delight our customers with robust products to clear the path for reimbursement of OGM-based tests and change medical practice to include optical genome mapping and medical society guidelines to advance our products to enable and support higher market adoption and entry into new markets; and lastly, to make software a strategic driver of our solutions. Now recently, we've added a six pillar, and that's that we focus on doing all of these things in a way that's scalable to meet the demands of our growth environment.\n\nWe've seen great momentum in the adoption of OGM and its validation for use this last quarter. Last week at the Association of the Society for Human Genetics or ASHG Conference, they featured the first dedicated scientific session on genome mapping technologies, where researchers from around the world highlighted optical genome mapping as a technique that has the potential to revolutionize molecular and cytogenetic research. And Bionano recently held its first scientific meet the user event in the company's history where we brought together over 50 researchers who are curious about optical genome mapping seeking to find out where it fit into their lab and what applications they could run on it. These folks came to San Diego from all around the world and visited Bionano Laboratories, which is now a showcase for excellence in optical genome mapping and they were able to see demonstrations of the Bionano Sapphire system and its workflow as well as our NX clinical software.\n\nWe've continued our previously announced collaboration with Hamilton to release an automated sample prep solution for customers. In support of this effort, we've been developing new chemistries, which will be part of the world's first walk-away automation for ultra-high molecular weight DNA extraction with the Hamilton Longstreg Vantage system. That system has the potential to double throughput and deliver increased confidence in sample yields and DNA quality, making it easier than ever to adopt optical genome mapping at scale. And last week at ASHG, we were excited to announce, together with Hamilton that this platform will be shipping commercially in early 2023.\n\nNow regarding the progress in reimbursement, our plans for a Category 1 CPT code reapplication remain on track. And we have seen significant progress in the field for sites with laboratory-developed tests or LDTs that are based on optical genome mapping who have gone and applied for reimbursement codes known as PLA codes or proprietary laboratory analysis codes. They have been reporting that these codes now have established pricing. The 2022 gap fill recommendations were released by the Center for Medicare and Medicaid Services, or CMS, for use in constitutional genetic testing with OGM and they include reimbursements of $1,263.53 for two PLA codes and reimbursement for $6,739.33 for another PLA code.\n\nThe first two codes that I mentioned are for use of OGM and whole genome analysis for constitutional genetic disease. And the second one that I mentioned is for the combination of optical genome mapping and next-generation sequencing. And so we're very gratified to see that reimbursement for optical genome mapping is now possible, and we see optical genome mapping on the clinical diagnostic laboratory fee schedule. This is very significant progress for us.\n\nThe clinical studies that we are working on remain the backbone of our evidence to support OGM in changing medical practice through revising medical guidelines. We remain on track to meet our previously outlined milestones for this year, and we have made progress on a new version of our NX clinical software, which will integrate optical genome mapping data alongside other data types. And then finally, we remain on track to have a pre-commercial version of the next-generation mapping instrument in the field before the end of this year. Now during this quarter, Soheil Shams who has been our chief commercial -- sorry, chief informatics officer since the acquisition of BioDiscovery transitioned out of his day-to-day activities and became the CIO Emeritus, which means that he is a consultant to the company for assistance and guidance in software development.\n\nDuring the 25 years since forming BioDiscovery; so Hill has established himself and his team as global thought leaders in genome analysis, the products and services they created, including NX Clinical are recognized around the world is providing powerful solutions for visualization, interpretation, and reporting of genome variation. And now Bionano will take it forward to finalize the addition of structural variation and create a tool that will really transform the way the world sees the genome. Now in closing, I would like to spend some time discussing the market opportunities for optical genome mapping, which we see as approximately valued at about $8 billion across the areas of Cytogenomics discovery research, QC for cell bioprocessing and a handful of other applications. We estimate the number of cytogenetic labs on a worldwide basis to be approximately 6,000 and the number of samples that they are analyzing to be approximately $4.2 million per year.\n\nWe also know that there are about 15,000 sequencers installed worldwide. And so we think when we think about the opportunity to transform the cytogenetic workflow by adding Sapphire and OGM as well as complementing sequencing with optical genome mapping. We estimate that these two opportunities amount to a market potential of about $4 billion. Insider genetics and molecular pathology, optical genome mapping is not only supported by emerging reimbursement.\n\nBut now by a number of studies that validate its use as a replacement for traditional methods like karyotyping, fluorescence in situ hybridization or FISH, chromosomal microarray or as a complement to the next-generation sequencing. We believe that this ability to detect structural variations is well suited in cancer and genetic disease applications. This quarter, we saw several research studies validating OGMs use in solid tumor and hematologic malignancy applications. And they all indicated that optical genome mapping workflows could lead to changes in important information used in patient management like prognostic scoring and treatment recommendations in a variety of areas, including leukemias, lymphomas, myelodysplastic syndrome, and others.\n\nWe believe the use of optical genome mapping may provide cancer researchers for a better understanding of the causes of cancer, which could lead to new diagnoses and therapies. Evidence for these views has been published four peer-reviewed studies in the third quarter from researchers at sites, including MD Anderson Cancer Center, Avesta University as well as a multisite study in Europe, all validated optical genome mapping ability to not only see what traditional methods see, but find additional pathogenic variants in MDS, acute myeloid leukemia, chronic lymphocytic leukemia as well as myeloid malignancies, suggesting that the identification of these previously undetected variants may impact prognosis and offer improved insight into the genomic architecture of heme malignancies and tumors in a way that would provide for better classification, risk stratification, and therapy selection. Genetic disease as well, we see growing support for OGM. Two recent studies from researchers in China showed progress in this area.\n\nOne study this quarter used optical genome mapping to detect balanced chromosomal rearrangements that were not detected by traditional methods, but found in subjects who had experienced recurrent pregnancy loss. A recent study successfully evaluated optical genome mapping for investigation of abnormal noninvasive prenatal testing suggesting that optical genome mapping could be used as a reflex test for positive NIPT tests as well as ambiguous ones. And these are very powerful applications for optical genome mapping in genetic disease. We also saw the publication of the first study to evaluate OGM in the analysis of certain repeat expansion disorders where researchers successfully use optical genome mapping to replace southern blot, which has been the gold standard for sizing these repeat expansions historically.\n\nRepeat expansion disorders are a class that impact approximately one and 3,000 people. And so they have a significant incidence in the population. OGM also has great potential in discovery research as we've been talking about, either as a stand-alone tool or with sequencing. We believe discovery research is an area of such enormous potential because structural variations are highly biologically and clinically relevant.\n\nBut historically, there hasn't been a tool capable of the kind of comprehensive and sensitivity for detection of structural variations that optical genome mapping offers. With such a tool, we believe that optical genome mapping could become a new gold standard for structural variation detection 500 base pairs and bigger throughout genome analysis. I want to talk about an area of the market that is increasingly significant and interesting as well as one that's pretty unique to optical genome mapping. And that's this area that we call cell bioprocessing QC or quality control.\n\nAnd this methodology entails evaluating intended and unintended modifications to genes in cells used for therapeutic applications, such as immune cell therapy, stem cell therapy, and other areas where gene editing has a therapeutic benefit. Two studies this reshowed -- this quarter showed OGMs utility in evolving induced pluripotent stem cell lines, one with potential application for autologous cell therapy and one for allogeneic cell therapy, autologous cell therapy uses an individual's cells cultures them engineers them to transform and modify them. They're then expanded in vivo and introduced back into the patient. Allogenic follows a similar process but based on universal cell lines.\n\nOne study validated OGMs ability to detect SVs that had not been seen by traditional methods. Now, this is really important because these off-target or spurious events may impact the genome integrity of these cells that are used in therapy and bring about poor performance or poor safety. The other study used optical genome mapping as part of a quality control workflow to evaluate iPSC quality and genomic integrity in allogeneic therapies, again, to minimize the potential for immune rejection of donor cells by the recipient. We're excited to see the support for OGM as a new method in this space, and we believe this validation helps Bionano expand beyond the research and clinical diagnostics areas into uses of OGM for drug development and cell therapy applications.\n\nNow in closing, I just want to reiterate that we are excited about our continued growth in 2022. I want to emphasize that we are on track to meet all of our outlined elevate milestones, and we look forward to updating you on our progress during the Q4 call. As Chris mentioned and I want to reiterate that we would also like to share that we will be hosting an investor and analyst event in February of 2023. This is what we call our Strategy Day, and we'll give you more specifics on that in due time.\n\nAnd so with that, operator, we are now ready to open the floor for questions.\n\nOperator\n\n[Operator instructions] We will take our first question from Jeffrey Cohen with Ladenburg Thalmann. Please go ahead.\n\nJeffrey Cohen -- Ladenburg Thalmann -- Analyst\n\nHi, Erik and Chris. How are you?\n\nErik Holmlin -- Chief Executive Officer\n\nHi, Jeff.\n\nChris Stewart -- Chief Financial Officer\n\nHi, Jeff.\n\nJeffrey Cohen -- Ladenburg Thalmann -- Analyst\n\nSo a few questions first. Firstly, on the services and other number, which was strong for the quarter, very strong. Should I assume that that includes some money from the San Diego CLIA lab?\n\nChris Stewart -- Chief Financial Officer\n\nYes. That number does include all of our services, which, yes, includes revenue from the San Diego CLIA lab which is continuing to process samples as we have for the last several years now.\n\nJeffrey Cohen -- Ladenburg Thalmann -- Analyst\n\nGot it. OK. And then, Erik, talk a little bit about Hamilton and Vantage and the launch of this new product line. I understand that you'll be supporting them as far as the units and all the reagent kits.\n\nCould you talk about perhaps the size of that market as they see it or you see it in some of the competitive advantages that the system has out there in the marketplace?\n\nErik Holmlin -- Chief Executive Officer\n\nYep. Sure, happy to. So a couple of things. As you know, Hamilton is one of the handful of very, very small number of global leaders and workflow automation.\n\nAnd for them to create this program and invest in it, I think, is really a significant validation of the emergence of optical genome mapping as mainstream technique throughout genomics. I don't think that they would put the resources behind this project that they didn't see the potential. And so we're excited about that. If you think about the market size for ultra-high molecular weight DNA isolation, which this robot is expressly developed for.\n\nWe talked about these 6,000 cytogenetic labs worldwide. We talked about 15,000 sequencers worldwide. And so I've got to believe that Hamilton views the potential of putting automation in many of those labs as we view the potential for putting sapphires in all of those labs. Not every lab is going to need automation, but it certainly simplifies the workflow makes it more consistent and more robust.\n\nAnd what we see in labs is that their throughput is beginning to consistently ramp up, especially in Europe where they've been going through a phase of validation and beginning to build a menu of applications. And so automation at this time makes a lot of sense. If you ask me, do I think every site is going to want to have automation, I think that there will be sites that continue to process samples manually, but the opportunity is very significant. Otherwise, Hamilton wouldn't get behind it.\n\nJeffrey Cohen -- Ladenburg Thalmann -- Analyst\n\nGot it. And then secondly from us, congratulations on the news with CMS, right? This is the gap fill final recommendations. Has that gone into effect? Or when does that go into effect for the two codes you outlined?\n\nErik Holmlin -- Chief Executive Officer\n\nThere's three of them, to in constitutional genetic disorders. And then one -- well, they're all in constitutional, but one is two of them are for OGM alone and then one is for the combination of optical genome mapping and sequencing. They are in effect now, and I think that's in the last week or so. And now you got to keep in mind, and this is important for everybody to be clear about.\n\nThese are what we call -- or what CMS calls proprietary laboratory analysis codes, and they are unique to the lab that has developed the LDT and applied for the code. But I will tell you that having CMS go through the process to study and analyze and discuss at the panel level and then go through a process of gap fill to price these codes that the next steps for other labs following the same path will be more straightforward. And so I think we're finally in a period where we can say that there is reimbursement for OGM. Early days, but it exists.\n\nJeffrey Cohen -- Ladenburg Thalmann -- Analyst\n\nFantastic. I know you've been working on that for a number of years. So that does it for us. Thanks for taking the questions.\n\nErik Holmlin -- Chief Executive Officer\n\nThank you, Jeff.\n\nOperator\n\nWe will take our next question from Francois Brisebois with Oppenheimer. Please go ahead.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nAll right. Thanks for taking the question. Just congrats again on the CMS and the reimbursement progress and kind of hope or just the fact that it's out there now for OGM a little more here. So I was just wondering, in terms of practices changing what they do is reimbursement -- is that probably the main driver of a potential hockey stick kind of growth in terms of top line? Or is it more a combination of publications and more validation getting the word out? Or was this really kind of one of the key drivers here?\n\nErik Holmlin -- Chief Executive Officer\n\nWell, I think that you really do need to think in terms of a combination or multifactorial process of demand creation through illustration of utility that's validated in the publications, combined with pulling down barriers to adoption, such as reimbursement. And so all of these things are ongoing in parallel, but they accelerate continuously. So one -- we're here at the Association for Molecular Pathology meeting, AMP in Phoenix. And we were talking about the number of human genomes that have been analyzed and published.\n\n-- in the last year or so. And it's a little over 1,000. At this point last year in the history of the company, it was $300, right? So 300 for the history of the company up until October 2021, from October 2021 until October of 2022, triple that in one year. So these things accelerate as we're moving through time and pushing forward on all of these different fronts.\n\nAnd as a result, that's what really drives the revenue growth. You said hockey stick, I'll just say the revenue growth. And I know that down the road, you're going to expect us to continue the revenue growth. And so when we see this initial reimbursement, that's going to pull some folks in who are on the sideline.\n\nWhen we see this automation that comes out, we'll see some people come in from the sidelines who are waiting for the automation. They will do work in published papers, which will, in turn, drive some additional folks in from the sidelines, then we'll see things like we hope or we believe we will see things like private payers coming on board, so on and so forth. So it really is multifactorial, but I can tell you that the process is accelerating on all fronts.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nOK. That's very helpful. And then maybe can you touch on -- do you see any seasonality in the business? Or is it not -- does it not affect the business as much as maybe others in summer months. And then also maybe just touch on -- in the press release, there's a couple of publications that are mentioned and talked about.\n\nI'm just wondering in terms of the research, if there's one in particular or again, it's kind of multifactorial where all of these are extremely helpful or some more important than others.\n\nChris Stewart -- Chief Financial Officer\n\nI'll start by answering the seasonality question and then let Erik weigh in on publications. We have seen over the past several years, typically, we're stronger in the second half of the year as companies get their arms around their budget. And then in Q4, typically, they're spending their budgets before they lose it. Seasonality is a little bit slower in Q1 with, among other things, Chinese New Year, and then people kind of getting slow back to work after the holidays.\n\nSo yes, that's what we've seen typically seasonal strength in the second half of the year, a little bit seasonally weaker in the first half of the year.\n\nErik Holmlin -- Chief Executive Officer\n\nYes. I mean I think -- listen, we've seen a number of significant publications that have come out certainly in the third quarter. And I think one of the most impactful ones and we talked about it during our last call. So I don't want to seem like I'm diminishing the impact of the others, but the paper from Dr.\n\nRashmi Kanagal-Shamanna from MD Anderson Cancer Center, I don't think that we can really understate or overstate how significant that is because she touched on a number of different areas in that publication where optical genome mapping really dramatically impacts the patient management workflow in myelodysplastic syndrome, which was the topic of her paper. But I think it's reasonable to extend that through our hematologic malignancies. And there are other aspects of that publication, which go into depth about the relationship between new findings that optical genome mapping revealed and existing clinical trials for treatment. So when you begin to put together and kind of connect all the dots in that paper, you realize that, that's a seminal work that really highlights -- number one, the impact of optical genome mapping, but number two, the importance of driving these new methods forward.\n\nOf course, we're doing this here in Bionano Genomics because we have an incredible platform and we know we can build a great company behind it. But we really have to be focused on the importance of innovation in healthcare because at the end of the day, this changes people's lives and it certainly helps them in some of their most desperate times. So, I think that's the most significant paper that really was published this quarter.\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nOK. Great. Thank you very much.\n\nErik Holmlin -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThere are no further questions at this time. Dr. Holmlin, I will turn the conference back to you for any additional or closing remarks.\n\nErik Holmlin -- Chief Executive Officer\n\nOK, Cynthia. I want to thank everybody for joining the call, and we look forward to updating you on the fourth quarter call after the first of the year. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAmy Conrad -- Investor Relations\n\nErik Holmlin -- Chief Executive Officer\n\nChris Stewart -- Chief Financial Officer\n\nJeffrey Cohen -- Ladenburg Thalmann -- Analyst\n\nFrancois Brisebois -- Oppenheimer and Company -- Analyst\n\nMore BNGO analysis\n\nAll earnings call transcripts"
}