{
  "companyName": "AerCap Holdings",
  "companyTicker": "AER",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/aercap-holdings-aer-q2-2022-earnings-call-transcri/",
  "content": "AerCap Holdings (AER 0.78%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to AerCap's second quarter 2022 financial results. Today's conference is being recorded, and a transcript will be available following the call on the company's website. At this time, I would like to turn the conference over to Joseph McGinley, head of investor relations. Please go ahead, sir.\n\nJoseph McGinley -- Head of Investor Relations\n\nThank you, operator, and hello, everyone. Welcome to our second quarter 2022 conference call. With me today is our chief executive officer, Aengus Kelly; and our chief financial officer, Pete Juhas. Before we begin today's call, I would like to remind you that some statements made during this conference call, which are not historical facts, may be forward-looking statements.\n\nForward-looking statements involve risks and uncertainties that may cause actual results or events to differ materially from those expressed or implied in such statements. AerCap undertakes no obligation other than that imposed by law to publicly update or revise any forward-looking statements to reflect future events, information, or circumstances that arise after this call. Further information concerning issues that could materially affect performance can be found in AerCap's earnings release dated August 11th, 2022. A copy of our earnings release and conference call presentation are available on our website at aercap.com.\n\nThis call is open to the public and is being webcast simultaneously at aercap.com and will be archived for replay. We will shortly run through our earnings presentation, and we'll allow time at the end for Q&A. [Operator instructions] I will now turn the call over to Aengus Kelly.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nThank you for joining us for our second quarter 2022 earnings call. I am pleased to report another quarter of strong earnings and profitability for AerCap. During the second quarter, we generated $1.91 of adjusted earnings per share and adjusted net income of $464 million as we continue to capitalize on the increasing global demand for aircraft. It is, of course, AerCap's platform and its people that underpins our success.\n\nDuring the quarter, the AerCap team executed 184 transactions, which included 125 long-term lease agreements, 16 purchases and 43 sales. This was a tremendous achievement and gives us an unparalleled level of information about both global and regional supply and demand. This unrivaled knowledge, combined with the skill sets and know-how of our new colleagues, keeps AerCap in its market-leading position. Global passenger traffic continues to increase with approximately 75,000 daily flights taking place in the four major regions at the beginning of August.\n\nThis is up nearly 20% or 12,000 flights per day in the last three months alone. As you'll see from Slide 4, this increase was driven by China predominantly, which grew by approximately 7,000 daily flights in that period of time as a result of the loosening of quarantine restrictions. China is currently taking its biggest steps toward loosening COVID controls since the pandemic began. We have seen a relaxation of quarantine length and PCR testing requirements.\n\nEncouragingly, the U.S. and Europe, and the rest of Asia have also continued to make progress despite numerous issues around staffing for airlines and airports in many parts of the world. Ryanair, as one example, flew 9% more passengers in the second quarter of '22 versus the second quarter of 2019. Many airlines have underestimated the underlying strength of travel demand having overcorrected on the way down and are now playing catch-up.\n\nThis again demonstrates how much people want and need to travel. Domestic travel continues to lead the way with international travel still lagging somewhat behind. So this too is improving. As you can see from Slide 5, of the 190 countries where we track travel patterns, 103 of them have now surpassed 80% of 2019 total traffic, with a particular acceleration from February of this year.\n\nFurthermore, the number of countries which have already surpassed 2019 traffic levels has more than doubled since the start of the year to 25. This shows that the recovery is truly global in nature. I firmly believe that as borders fully reopen, we will see the same rebound in international travel that we saw in the domestic markets. Given the level of inquiry and demand we are seeing for wide-body aircraft, it is clear that the airlines are also convinced of this.\n\nTo this end, we added a further five Boeing-787 orders at the Farnborough Airshow, which we'll deliver in 2024. This takes our total 787s to 125, of which 99 have already delivered. Following the positive developments between the FAA and Boeing, regarding the resumption of 787 deliveries, we expect to receive one 787 this year. Of course, we would not have placed orders for further equipment unless we were confident that Boeing would solve certification issues on the 787 and that the aircraft will form the backbone of the long-haul market for many years to come.\n\nWe fully expect that when international travel to China is permitted to fully reopen, there will be a massive surge in demand, which will further bolster both wide-body and narrow-body aircraft demand. We saw this a few months ago on the transatlantic market, where the United States removed the COVID entry test requirements, and bookings were reported to be off the charts according to United's CEO. This strong demand for long-haul travel was also confirmed by Lufthansa last week when they reported that their bookings are strong through the end of the year. Moving on to supply.\n\nAs I referenced last quarter, there are approximately 2,000 fewer aircraft flying today relative to the OEMs' expectations in 2018, which is more than a whole year's narrow-body production. This is due to a number of factors, including supply chain disruption, certification, and production issues as well as staffing problems, none of which are likely to be resolved quickly. It is clear to me that many airlines share this view, which is manifesting itself in greater demand for lease extensions and feeding into higher lease rates. The supply chain disruptions are challenging the OEMs to find a balance between supporting the in-service fleet of aircraft, i.e., those aircraft already delivered to airline customers, and new equipment deliveries.\n\nFor example, there is a shortage of spare engines at the moment as a result of increasing aircraft production rates, new technology maturation issues, and labor-related supply of spare parts. This means airlines with aircraft on the ground are requesting spare engines to be diverted from new aircraft deliveries, thereby limiting new aircraft delivery rates from Boeing and Airbus. The engine manufacturers are working through demand scenarios to appropriately allocate their limited supply chain resources: Firstly, to support the in-service fleet of aircraft; and secondly, to meet their production obligations to Boeing and Airbus. Airbus recently delayed their plans to get to a monthly production rate of 65 on the A320neo family to early 2024 from mid-2023.\n\nBut even that seems somewhat optimistic given all that is going on. Likewise, as I referenced earlier, Boeing hasn't delivered a 787 for 21 months, and they are also being held back by the engine manufacturers from increasing their 737 MAX deliveries beyond their current 31-a-month rate. So what do airlines do in the meantime? They turn to the leasing companies where delivery certainty is higher as we have closer in-time delivery slots or we provide already built aircraft. You have seen from the Farnborough Airshow a few weeks ago that the level of orders was relatively muted.\n\nThis is not from lack of demand, rather lack of availability. As a result, lease rates are going up and demand for used aircraft is robust. AerCap's spare engine leasing business is well-positioned to support both our airline and OEM customers in this climate of new technology maturation, supply chain constraints, and post-COVID cash management at the airlines. AerCap has the largest spare engine leasing portfolio in the world.\n\nwhich positions us well to capitalize on both current and future engine shortages. Cargo airlines, especially wide-body freight operators, continue to achieve unprecedented high returns as a legacy of the pandemic-induced capacity shortages. We expect this level of cargo demand to be sustained, although macroeconomic factors have the potential to temper the rate of growth we've seen in recent years. Singapore Airlines, as one example, spoke about the recovery in cargo demand it has seen from Asia and expect yields to remain higher than pre-COVID levels in the near to medium term as air cargo capacity remains tight on key trade lanes to and from Asia, particularly between Europe and Asia.\n\nWe are virtually fully placed on our original firm order of 20 777-300 ER freighters. And we are also seeing strong demand on the narrow-body freighter side. We recently announced a number of deals for the long-term lease of 737-800 freighters to GOL in Brazil who will operate them on behalf of Mercado Libre, a $50 billion e-commerce business in South America as one example. On the helicopter side, we continue to see positive momentum with leasing activity improving across all sectors.\n\nThere is clear demand from operators to lock in contracts earlier as the supply picture continues to tighten. This has been driven by strong demand for oil and gas, high renewal rates in helicopter emergency medical services, and, of course, limited production from the OEMs. Given AerCap's market-leading position in the global helicopter business, we have been able to take advantage of these trends and drive our returns higher. So in summary, this was another very solid quarter for AerCap with earnings and cash flows remaining strong throughout the business.\n\nThe market environment continues to improve, and as the market leader, we are well placed to capitalize on this strong demand for both new and used aircraft and engines. Our balance sheet continues to delever, and we continue to maintain a strong liquidity position despite the impact of COVID and Russia, and the business continues to generate strong and consistent earnings and cash flows for our investors. With that, I will hand the call over to Pete for a detailed review of our financial performance. Thank you all.\n\nPete Juhas -- Chief Financial Officer\n\nThanks, Gus. Good morning, everyone. Overall, this was a strong quarter for AerCap. We continue to see an expansion of the global travel recovery as traffic is picking up in more regions around the world.\n\nWe're also seeing high utilization of aircraft that are on power by the hour arrangements. These factors, along with supply constraints that continue to affect the OEMs are contributing to higher demand for leased aircraft and improving lease rates. We're also seeing very good performance from our new business areas, including engines, cargo, and helicopters. This led to strong earnings and cash flows this quarter and deleveraging faster than we had expected.\n\nFor the second quarter, our adjusted net income was $464 million or $1.91 per share. The impact of purchase accounting adjustments which include lease premium amortization and maintenance rights amortization in the second quarter was $132 million, including a reduction to revenue of $105 million and increase in leasing expenses of $27 million. We also had transaction and integration-related expenses of $9 million for the quarter. Taking all those into account, our GAAP net income for the quarter was $340 million or $1.40 per share.\n\nI'll spend a few minutes going through the main drivers that affected our results for the second quarter. Basic lease rents were $1.462 billion for the quarter. Once again, we saw strong cash collections this quarter. However, overall, basic lease rents were down given the loss of revenues from the aircraft and engines that were previously unleased to Russian airlines.\n\nWe continue to see positive momentum with our customers from the global recovery in air travel. During the quarter, our cash collections rate exceeded 100% because, in addition to the regular rent and maintenance payments for the quarter, we also received repayments of deferral balances. Our deferral notes receivable balance increased by $38 million to $538 million as of June 30th. And that was a continuation of a trend that we've seen over the past several quarters of these balances coming down.\n\nOur basic lease rents also reflect $52 million of lease premium amortization during the second quarter. As I've mentioned previously, the lease premium asset is amortized over the remaining term of the lease and reduces basic lease rents. Maintenance revenues for the quarter were $103 million, and that reflects $53 million of maintenance rights assets that were amortized to revenue during the quarter. In other words, maintenance revenues would have been $53 million higher or $156 million without this amortization.\n\nNet gain on sale of assets was $35 million for the second quarter. During the quarter, we sold 20 of our owned aircraft, five of our owned engines or helicopters for a total of $386 million, so that represents a gain a margin of approximately 10% for the quarter. Other income was $71 million for the quarter, which included $39 million of proceeds from unsecured claims. This represents the final portion of our LATAM airlines claim that we monetized during the quarter.\n\nAs we discussed previously, we agreed on the sale of our LATAM claim last year, but the final portion of the sale didn't close until the second quarter when the claim was approved by the bankruptcy court. Our leasing expenses were $193 million during the quarter, including $27 million of purchase accounting amortization expenses. So when you add the $52 million of lease premium amortization, the $53 million of maintenance rights in relation to revenue, and the $27 million of amortization running through leasing expenses, you get to the total of $132 million of purchase accounting adjustments that I mentioned on the previous slide. That's $105 million that affected revenue during the quarter and $27 million that affected leasing expenses.\n\nEquity and net earnings of investments under the equity method was $33 million for the second quarter. This was mainly driven by strong earnings from Shannon Engine Support, our joint venture with Safran, which is our largest equity investment. SES has been generating strong performance driven by many of the same factors that have been affecting our wholly owned engine leasing business. We continue to maintain a strong liquidity position.\n\nAs of June 30th, our total sources of liquidity were approximately $17 billion, which resulted in the next 12 months' sources to use a coverage ratio of 2.1 times. That's well above our current target of 1.5 times and gives us excess cash coverage of approximately $9 billion. We ended the second quarter with a leverage ratio of 2.8:1, which is down from 2.9:1 last quarter. And that's a result of strong earnings and cash generation during the quarter.\n\nOur total operating cash flow was $1.2 billion for the quarter or $2.5 billion for the first half of the year. Our secured debt-to-total assets ratio was approximately 15%, the same as last quarter, and our average cost of debt for the second quarter was 3%, also the same as last quarter. In June, Fitch revised its rating outlook for AerCap to positive, which is a positive development for us. We continue to target mid-BBB ratings from all three rating agencies, and we're encouraged by this move as well as from some of the positive commentary we've heard recently from Moody's.\n\nSo overall, a strong quarter in terms of earnings, cash flows, and deleveraging, and we remain confident in our ability to achieve our EPS guidance for the year. With that, operator, we can open up the call for Q&A.\n\nOperator\n\nThank you. [Operator instructions] And our first question will come from Mark DeVries with Barclays. Please go ahead.\n\nMark DeVries -- Barclays -- Analyst\n\nYeah. Thank you. So you've got about $6 billion of contracted capex over the next two years, how should we think about uses of capital and also your guided $2 billion of annual sales if the OEM delays continue to affect you?\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nLook, I think we've always been very careful stewards of the shareholders' capital. And if we do see delays, which I think there will be some delays, of course, and the business continues to perform on the track that it's on, which we're very confident in, then that will open up other opportunities for the business, and we'll deploy that capital into what we believe is in the best long-term interest of our shareholders.\n\nMark DeVries -- Barclays -- Analyst\n\nOK. Fair enough. And then I think a lot of us expected given some of the new balance sheet constraints, a lot of the airlines exited this pandemic with that we'd see an increase in kind of their propensity to lease versus finance their fleet themselves. What have you been observing this year in some of the conversations you've been having with your clients around that?\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nThere is no question that leasing is growing much faster than I had expected before the pandemic. The OEMs between sale-leasebacks and direct lessor orders, we're probably looking at 65% of all deliveries will end up in the leasing channels. So the airlines have seen the benefits of leasing to the pandemic because in the pandemic if you own the aircraft, that was it, you had it, you were stuck with it forever. And I think they've become to appreciate the benefits of the flexibility that leasing brings more and more airlines.\n\nAnd so at one point, I did not believe that leasing would surpass 50% of the global market. We're way past that now in terms of value, and it's only going one way.\n\nMark DeVries -- Barclays -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nAll right. And our next question will come from Moshe Orenbuch with Credit Suisse. Please go ahead.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGreat. Gus, you mentioned that increased narrow-body demand and ongoing and expected to increase wide-body demand, resulting in and the supply constraints resulting in kind of lease extensions and higher lease rates. Could you talk a little bit about how you're going to see that we're going to see that in the results at AerCap over the coming quarters?\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nWell, look, I think you're going to see us over the medium to long -- the medium term. You'll see the short term through aircraft sales, of course. But as we place an airplane today, it goes on lease, let's say, it's up 30,000 month from where it was a couple of years ago, you will see that extra incremental revenue falls through the P&L as the airplane goes on lease and then every month thereafter. But what reprices is what's subject to repricing.\n\nSo stuff that we're leasing today are stuff that we're putting on in our forward order book as well. But fundamentally, it also reflected itself in the value of the assets, too.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nRight. and Pete, clearly, it looks like this quarter seems to be significantly higher than if you took the remainder of your guidance for 2022 and divided it by three, certainly seems to be well above that. I know that you mentioned the claims that now from LATAM that were in the revenue about because it looked like you also had expenses that were lower than at least we were looking for. So can you kind of talk about how to think about your guidance for the year and the level of your major kind of expense items as we go forward?\n\nPete Juhas -- Chief Financial Officer\n\nSure, Moshe. So we feel very confident about our guidance for the rest of the year. As you mentioned, there were some onetime items like the LATAM proceeds that we got this quarter. First quarter, we had that mark-to-market of $36 million, right, on the caps.\n\nSo we did have some of those things affecting it. And I think if you look at the leasing expenses, those were a little lower because we had some maintenance events that we expected to happen in the second quarter that now are really pushed out to the third. And that doesn't have a big impact on the adjusted numbers but it does on GAAP. So I think it's more pronounced there.\n\nAnd that's another reason why we think it makes much more sense to focus on adjusted because you don't have those -- you just have less in the way of quarterly swings than you do on GAAP because of purchase accounting things, less volatility.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nOK. Thank you.\n\nOperator\n\nAll right. We'll take our next question from Ross Harvey with Davy. Please go ahead.\n\nRoss Harvey -- Davy Research -- Analyst\n\nHi. Thanks, guys for taking my question. I've got two. So the first one is in relation to the Shannon engine support seems to have driven pretty strong income from cites in Q2.\n\nJust wondering, is that a fair recurring figure, just given it was filed from Q4 and Q1? And secondly, I will just give my second question. In terms of the secondary market, it seems very positive just based on gain on sale, the asset disposals through Q2, the margin you achieved there. Is there any qualifications you would give? And would that type of backdrop tempt you into launching a larger sales program as was done post ILFC? Thanks.\n\nPete Juhas -- Chief Financial Officer\n\nWell, maybe I'll take the first one, Ross. So for SES, you're right, it was higher this quarter's $33 million contribution First quarter, it was a very low contribution basically because they had some impairments that they took as a result of Russia. So that's why you really didn't see a contribution in the first quarter I think that this is closer to a run rate there. It might be -- have been a little high this quarter because there was some catch-up there.\n\nBut I think you're looking more about 25% is what I would say, a quarter.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nAnd on the sales, yes, you're right. Well, we did achieve healthy margins. And certainly, as we look forward, we see the sales market as being robust. No surprise that in April, May of this quarter, following the Russian invasion of Ukraine, there was a pause on buyers coming into the market, but that's changed dramatically now.\n\nAnd we have a good few assets in the pipeline already for the second half.\n\nRoss Harvey -- Davy Research -- Analyst\n\nGreat. Thanks for the time.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nSure.\n\nOperator\n\nAll right. And our next question will come from Hillary Cacanando with Deutsche Bank. Please go ahead.\n\nHillary Cacanando -- Deutsche Bank -- Analyst\n\nHi. Thank you for taking my question. I just wanted to ask you about the $35 million gain on sale. Last quarter, you mentioned that legacy GCAS aircraft that were contracted to be sold prior to the acquisition were already mark-to-market, and therefore, there were no gains reported on those assets.\n\nCould you just see any of those legacy GCAS assets sold this quarter? And should -- are you expecting that going forward as well or no? I mean the numbers were good. So I'm thinking maybe not, but if you could kind of elaborate on that.\n\nPete Juhas -- Chief Financial Officer\n\nActually, Hillary, we did have a couple of those this quarter. So it would have been a higher gain on sale number. It was about -- it was two assets. So the gain on sale would have been several million dollars higher if you didn't have that purchase accounting impact.\n\nAnd we will see some of that through the rest of the year. But I think what this highlighted really this quarter is you still had a high margin even taking that into account.\n\nHillary Cacanando -- Deutsche Bank -- Analyst\n\nGot it. And then I just wanted to ask about your helicopter business. Obviously, there's a positive momentum supporting that business. Just wanted to find out your longer-term plan for that business.\n\nAre you planning to maybe sell some of those assets to take advantage of the strong demand in the market right now or maybe to just grow the business? And also -- yes, that's about it. Thank you, and we look forward to seeing you at the Deutsche Bank conference next month.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nThank you. On the helicopter business, to answer your question, look, it's going well. We're happy with the business. Clearly, we've seen an improvement in the demand for helicopters.\n\nAnd it's not just oil and gas. It's outside of that as well, in emergency services that we do a lot of work into.\n\nOperator\n\nOK. And Hillary, any other questions?\n\nHillary Cacanando -- Deutsche Bank -- Analyst\n\nThat's it. It was very helpful. Thanks.\n\nOperator\n\nAll right. And we'll move on to Helane Becker with Cowen. Please go ahead.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nThanks very much, operator. Hi, everybody. Thanks for the time. Have you had a chance to look at the pending tax changes in the U.S.? And would that all impact your propensity to acquire shares when the time comes?\n\nPete Juhas -- Chief Financial Officer\n\nSo we're looking at the new legislation, Helane, but no, I don't think that that's going to affect that we're looking at more broadly in terms of what the implications could be. I mean I think, overall, and I think we've talked about this before, the movement toward the global minimum tax is likely to take our tax rate up a little bit in the future toward the -- we're now we estimate 14% for the year. And would that go up a couple of percentage points a couple of years down the road? I think it probably would. But that's really what we're thinking the impact would be of all of this, if I think of all of the OECD countries broadly, that's probably the impact that we're looking at.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nI think we have to -- obviously, there'll be some discount on that as well given the -- where to get through Congress to get all that done as well at the moment. I'm not so sure that we'll see that global minimum tax rate anytime soon.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nRight. Gotcha. OK. That's helpful.\n\nAnd then have you thought differently about leasing into China? And is there -- how are you thinking about that market going forward given the issues that exist in Russia?\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nI think China is a very different market to Russia, to be fair. You've got to realize that China makes up almost 25% of everything Boeing and Airbus sell. And we've had a great relationship with China with the airlines there. And so it doesn't represent a force anywhere near 25% of our book, but the Chinese airlines have been great partners of ours for a long time.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nThat's very helpful. Thank you very much.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nSure.\n\nOperator\n\nAll right. Up next, we'll hear from Jamie Baker with J.P. Morgan. Please go ahead.\n\nUnknown speaker\n\nHi. Thanks, operator. This is James on for Jamie and Mark. I think you already mentioned it in your pared remarks, but just wondering if your view on ordering speculative aircraft has changed at all given the ongoing shortages, you mentioned strong cargo demand and international recovery, so particularly with the widebodies, has already changed there on buying executive aircraft?\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nCould you just -- you just broke up at the start of the question.\n\nUnknown speaker\n\nOh, I'm sorry. Can you hear me now?\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nYes.\n\nUnknown speaker\n\nI was just asking on your view on ordering speculative aircraft, has that changed at all, just given the strong cargo demand you mentioned and international recovery?\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nI think the thing about buying airplanes is buying the right airplane at the right time. If you look at AerCap's history of buying -- ordering airplanes, the last major order Boeing or Airbus got at the very beginning of the pandemic was from AerCap. We had an option to exercise on 50 A320neos. Nobody was buying airplanes.\n\nThat's the time to buy. If you're going to queue up outside the tent at the airshow with every other clown and keep ordering airplanes, then you're going to overpay. You're going to get bad delivery positions. You're going to order airplanes five or six years away from the delivery date.\n\nEscalation will kill you. You want to be buying aircraft when there is a transaction that makes sense for you and for the seller and that there's a reasonable time frame of delivery. Telling someone you're going to buy airplanes in 2030, that's pretty crazy stuff. It's eight years away.\n\nThe escalation in any contract in today's world will not be good for you. Now we did order 5 787s in a transaction with Boeing and a customer at the airshow. These 5 787s are airplanes we're highly confident in. We know there's a very strong demand for those airplanes and has been for the last two years.\n\nThat's because of our global position as being the biggest player in the world. We knew where the demand was. We knew where the customer was, and we had it all done in 24 hours. So as I [Inaudible] that, that means all the aircraft replaced when we bought them.\n\nUnknown speaker\n\nThat's great. I appreciate the color. And then just for my second question, congrats on the positive outlook at Fitch. Can you just remind me what the bogeys are from Fitch and Moody's for your leverage and to either be upgraded or placed in [Inaudible] and Moody's?\n\nPete Juhas -- Chief Financial Officer\n\nSure. So as you know, we target -- our target is to have 2.7 times debt to equity, and that's what we've conveyed to the rating agencies. And I think in order to get an upgrade, I think that we could achieve that at that leverage target. So I don't think that we would necessarily have to go below that target in order to do it.\n\nAnd really, that's because what we have demonstrated to the rating agencies and talked to them about is the resilience that the business showed throughout COVID, plus having done the GCAS acquisition, how much stronger that's made the company. And so I think the two of those things are a pretty compelling argument for it. I think that the -- if you look at what could -- what are kind of the gating items, I would say, toward getting an upgrade, I think part of that is seeing the recovery progress more globally and seeing some of the issues around Russia and things like that recede into the distance. I think that's more important.\n\nObviously, we're going to be delevering. You can see that we were at 2.8 times debt to equity this quarter. We had targeted 2.7 times by the end of the year. I think we're a little ahead of schedule on that.\n\nSo that's all positive. And I think we're positioned well for that to happen.\n\nUnknown speaker\n\nGot it. I appreciate the color. Thanks.\n\nOperator\n\nAll right. Now we'll take a question from Ron Epstein with Bank of America. Please go ahead.\n\nUnknown speaker\n\nThis is actually Andre on for Ron. I wanted to ask about the GE lockup period on sales. The first tranche opened up August 1st. Have you guys had any conversations with those investors? Like any expectation for any sale? Or any color you could provide there would be helpful.\n\nThanks.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nOn that, that's really a question for GE.\n\nUnknown speaker\n\nSo you guys haven't had a conversation with those investors at all. It's all just GE.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nWell, it's just GE when they decide to sell and with Quantum they decide to sell. That's -- we talk to investors, of course, all the time about the business. But the decision about what's going to happen with the shares is completely in the hands of GE. Our focus can only be on running the business as well as we possibly can.\n\nUnknown speaker\n\nFair enough. All right. Yeah. I'll leave it to one.\n\nThanks, guys.\n\nOperator\n\nAnd now we'll take a follow-up question from Moshe Orenbuch with Credit Suisse.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGreat. Thanks. Maybe just recognizing that your leverage did go from, I think, 2.94 down to 2.8, fairly close to that 2.7. And Pete, I think you just said in the response to an earlier question that you don't really need to go below that.\n\nI mean it seems likely that you would reach that target during Q3, if you haven't already. Can you just talk a little bit about what that flexibility would give AerCap?\n\nPete Juhas -- Chief Financial Officer\n\nSure. So look, I think, Moshe, it is possible that we could get there earlier than we expected. As I said, we're running somewhat ahead of schedule. We'll have to see how that plays out during the rest of the course of the year.\n\nAnd look, obviously, I mean, 2.7 is a gating item in terms of, once you get there, then you have capital. You're starting to create excess capital that you can deploy. And so we'll have to look at it at that point. But that would -- that obviously would give us more flexibility there.\n\nAnd similarly, I think there was a question earlier about sales. So if we're able to do more in sales. I think I'm confident that we can get $2 billion done this year. But going forward, if we can do more in the future than we had targeted.\n\nThat's helpful, too, for that. I guess I should also say that from a balance sheet perspective, we're in a very strong position now. We have a lot of liquidity. As you can see, we have very low debt maturities for the rest of this year.\n\nWe actually have a -- we have one bond that comes due this year, and we're paying that off next week. So very little to do. I don't think we would have to do any issuance on the debt side this year. And that's really because of those limited maturities, capex profile of $2.2 billion for the remainder of the year, and strong operating cash flow.\n\nSo I think we're in a good position on all of those fronts to have more flexibility as we get toward the end of the year and into next year.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nYes. And I'd also add to that. As Pete said, we have no need to raise any funding for the remainder of the year. And indeed, our interest line is pretty much fixed.\n\nThe average duration of our fixed rate debt is 6.5-odd years. So that's how long 90% of our debt is fixed for.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nThanks, guys.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nSure.\n\nOperator\n\nAnd we have no additional questions in the queue. I will now turn the call back to Aengus Kelly for closing remarks.\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nThank you, and thank you all for joining us for the call. We look forward to seeing you shortly at the Deutsche Bank conference in September. I'm meeting many of you there. So thank you for your time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoseph McGinley -- Head of Investor Relations\n\nAengus Kelly -- Chief Executive Officer and Executive Director\n\nPete Juhas -- Chief Financial Officer\n\nMark DeVries -- Barclays -- Analyst\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nRoss Harvey -- Davy Research -- Analyst\n\nHillary Cacanando -- Deutsche Bank -- Analyst\n\nHelane Becker -- Cowen and Company -- Analyst\n\nUnknown speaker\n\nMore AER analysis\n\nAll earnings call transcripts"
}