{
  "companyName": "Smith & Wesson Brands, Inc.",
  "companyTicker": "SWBI",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/smith-wesson-brands-inc-swbi-q4-2022-earnings-call/",
  "content": "Smith & Wesson Brands, Inc. (SWBI -1.14%)\nQ4 2022 Earnings Call\nAug 23, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to Smith & Wesson Brands, Inc. fourth quarter and full fiscal 2022 financial results conference call. This call is being recorded. At this time, I would like to turn the call over to Kevin Maxwell, Smith & Wesson's general counsel, who will give us some information about today's call.\n\nKevin Maxwell -- General Counsel\n\nThank you, and good afternoon. Our comments today may contain forward-looking statements. Our use of the words anticipate, project, estimate, expect, intend, believe and other similar expressions are intended to identify forward-looking statements. Forward-looking statements may also include statements on topics such as our product development, objectives, strategies, market share, demand, consumer preferences, inventory conditions for our products, growth opportunities and trends and industry conditions in general.\n\nForward-looking statements represent our current judgment about the future and are subject to risks and uncertainties that could cause our actual results to differ materially from those expressed or implied by our statements today. These risks and uncertainties are described in our SEC filings, which are available on our website, along with a replay of today's call. We have no obligation to update forward-looking statements. We reference certain non-GAAP financial results.\n\nOur non-GAAP financial results exclude costs related to the planned relocation of our headquarters and certain manufacturing and distribution operations to Tennessee, the spin-off of the outdoor products and accessories business in fiscal 2021, COVID-19-related expenses and other costs. Reconciliations of GAAP financial measures to non-GAAP financial measures can be found in our SEC filings and in today's earnings press release, each of which is available on our website. Also, when we reference EPS, we are always referencing fully diluted EPS. Finally, when we discuss NICS results, we are referring to adjusted NICS, a metric published by the National Shooting Sports Foundation based on FBI NICS data.\n\nAdjusted NICS removes those background checks conducted for purposes other than firearms purchases. Please remember that adjusted NICS is generally considered the best available proxy for consumer firearm demand at the retail counter. Because we transfer firearms only to law enforcement agencies and federally licensed distributors and retailers and not to end consumers, NICS generally does not directly correlate to our shipments or market share in any given time period, we believe, mostly due to inventory levels in the channel. Before I hand the call over to our speakers, I would like to remind you that any reference to income statement items refers to results from continuing operations unless otherwise indicated in any reference to EBITDAs is to adjusted EBITDAs.\n\nJoining us on today's call are Mark Smith, our president and CEO, and Deana McPherson, our CFO. With that, I will turn the call over to Mark.\n\nMark Smith -- President and Chief Executive Officer\n\nThank you, Kevin, and thanks, everyone, for joining us today. Before we discuss our results, I want to express the deep sorrow that all of us at Smith & Wesson feel for the victims of the unthinkable acts of evil that had befallen our nation recently. It is impossible to rationalize the actions of these perpetrators of violence, especially those who show such disregard for the lives of the most innocent among us. Smith & Wesson continues to work closely with the ATF, industry partners, lawmakers and law enforcement to find real solutions and to augment existing programs that will have a meaningful impact in making our communities safer by keeping firearms out of the hands of criminals and the mentally unstable while always respecting the constitutional rights of law abiding Americans.\n\nPlease join me in offering prayers for our nation and our communities, but most of all, for the families facing unimaginable loss. Our top and bottom line results for the fourth quarter were in line with expectations. Our fourth quarter revenue was up approximately 2% on a sequential basis, reflecting slightly higher volumes despite adjusted NICS being down 3% over the same time frame. Compared to the prior year period, we faced very difficult comps.\n\nAs 12 months ago, we were in the height of the pandemic surge and we were able to leverage our flexible manufacturing model to significantly outpace the competition. Therefore, and as expected, in comparison to last year's fourth quarter, our revenue this year was significantly impacted by the overall normalization of consumer demand for firearms. As I have mentioned before in the past, during the surge, we were able to make long overdue pricing and product portfolio adjustments, which has resulted in ASPs rising by nearly 12%. Although our fourth quarter results benefited from these adjustments, their impact was not enough to offset unit volumes being down approximately 50% from prior year.\n\nTurning to profitability. The strength of our flexible manufacturing model was again evident in our latest quarterly results. As we've pointed out many times before, not only does this model allow us to rapidly react to upswings in market demand, but it also allows us to maintain strong profitability during periods of sharp declines in revenue by keeping fixed costs low and manufacturing cost absorption rates high. In the fourth quarter, our gross margin improved by 20 basis points sequentially and was still near the upper end of our long-term financial model despite a significant deceleration in year-over-year net sales.\n\nSimilarly, EBITDAS margin in the fourth quarter improved 260 basis points sequentially, driven by higher gross margins and lower operating expenses. Looking forward, we expect that throughout the remainder of FY '23, market demand will continue to be down significantly from the pandemic surge levels of last year. While interest in the shooting sports remains healthy, and we are encouraged to hear from our channel partners that many first-time consumers are returning to purchase additional firearms with the offsetting impact of record inflationary pressures on the pocket books of Main Street American households, we are anticipating that demand in the firearms market this year will look a lot like calendar 2019, which, as a reminder, would have encompassed the second half of our fiscal '19 and the first half of our fiscal '20. Like all companies today, we face challenges with managing the impact of inflationary factors.\n\nPricing actions have helped, but with the pace of inflation accelerating at near record levels in recent months for key inputs like material costs, transportation and labor, there is potential risk to our margin over the near term. That said, we feel good about the relative position of our products and pricing versus our competitors' offerings, and so we do not see heavy promotional activity as a significant risk. Additionally, our brand is a real asset, and we are comfortable that we could take pricing actions in the future, if needed. All told, we remain confident in our ability to deliver full year results that are within the long-term financial model we shared last year during our investor day, which, as a reminder, includes gross margins of 32% to 42%, EBITDAs margins of 20% to 30% and generating more than $75 million in cash each year.\n\nBut again, we expect that this will come on unit volumes and top line revenue that will be much more in line with the traditional normal year, which at this point is tracking closer to calendar 2019 rather than calendar 2021. From a product development perspective, consistent with our past communications, we expect to release approximately half a dozen new products by the end of fiscal 2023. And in terms of our relocation to Maryville, Tennessee, we have no significant updates. We continue to make steady progress and remain on track for completion in the second half of calendar 2023.\n\nTurning to capital allocation. Last year, we spent $90 million to repurchase 4.8 million shares, and we paid $15 million in dividends. We estimate that our share repurchases over the last two years were accretive to EPS in FY '22 by $0.65, and we are committed to this strategy that rewards long-term stockholders. As a matter of fact, today, we are announcing that our board has approved a 25% increase in our quarterly dividend to $0.10 per share.\n\nIn summary, we believe that we remain well positioned for long-term growth. With an agile business model designed to quickly adapt to changes in the marketplace and deliver strong, consistent levels of profitability no matter what, driving value for our stockholders. With that, I'll hand the call over to Deana to cover the financial details.\n\nDeana McPherson -- Chief Financial Officer\n\nThanks, Mark. Net sales for our fourth quarter of $181.3 million was $141.6 million or 43.9% below the prior year comparable quarter and $11.7 million lower than the fourth quarter of fiscal 2020 when the pandemic-related surge began. During our fourth quarter last year, we achieved record net sales due to a nearly 60% increase in production capacity, combined with strong demand that allowed every unit produced to be quickly sold. During our current fourth quarter, however, demand as evidenced by NICS checks was 14.5% lower than the prior year.\n\nThis combined with plenty of inventory in the distribution channel resulted in an expected decline in our shipments at a faster rate than the reduction in mix. As we have been reporting, the unprecedented 18-month surge in demand for firearms began to moderate last summer as we saw adjusted NICS checks begin to no longer hit record levels and inventory in the channel begin to grow. Our ability to achieve record production and unit shipments throughout this time naturally has resulted in lower year-over-year sales in more recent quarters. Gross margin in the fourth quarter of 39.8% was 530 basis points below the 45.1% realized in the prior year comparable quarter but 760 basis points above the 32.2% realized in the fourth quarter of fiscal 2020.\n\nThe decrease in margin from last year was due primarily to reduced volume and a shift in mix to certain lower-priced long guns and was only partially offset by the impact of two price increases, reduced spending and lower inventory reserve adjustments. In addition, last year included a $1.9 million accrual related to a special bonus that we paid to our employees in recognition of their efforts in helping us to achieve $1 billion in annual sales. Operating expenses of $25.6 million for our fourth quarter were $4.1 million lower than the prior year comparable quarter, primarily due to reduced profit sharing and incentives, a reduction in wage and benefits due to vacant positions, lower distribution costs associated with lower shipments and reduced legal expenses. Partially offsetting these cost reductions was an increase of $0.5 million associated with our relocation and increased spending on co-op advertising, local territorial promotion costs and digital advertising.\n\nNet income of $36.1 million in the fourth quarter compared to $89.2 million in the prior year comparable quarter, reflecting lower net sales and gross margin, slightly offset by reduced operating expenses. However, when compared to the fourth quarter of fiscal 2020, in spite of slightly lower sales, net income was $15.2 million higher this quarter due to improved gross margins and nearly $5.6 million of lower operating expenses. GAAP earnings per share of $0.79 in the fourth quarter was down from $1.70 last year, but more than double the $0.38 we reported in the fourth quarter of 2020. Non-GAAP earnings per share of $0.82 was $0.89 lower than in fiscal 2021 but $0.32 higher than in fiscal 2020.\n\nEBITDAs of $57.7 million remained strong at 31.8% of sales. Turning to a review of the full year. Sales of $864.1 million were 18.4% below the record $1.1 billion we achieved in fiscal 2021 but 63.2% above fiscal 2020. Our ability to grow our production capacity during the second half of 2021 enabled us to respond to the significant demand that lasted through much of the first half of fiscal 2022.\n\nAs demand began to soften, our second half shipments were lower, but still resulted in the second highest fiscal year sales in company history. Gross margin of 43.3% for fiscal 2022 was 90 basis points above fiscal 2021 and 1,200 basis points higher than fiscal 2020. The increase in margins resulted primarily from higher average selling prices due to the elimination of most promotions and two price increases, combined with a shift in product mix away from lower priced or less profitable products. The increased ASPs were partially offset by lower production levels and units shipped.\n\nFor the full year, our profitability was the second highest in company history, including net income of $194.5 million, GAAP earnings per share of $4.08, non-GAAP earnings per share of $4.25 and EBITDAS of $299.6 million, which translates to an EBITDAS margin of 34.7% of sales, slightly above our record year last year, again, reflecting the strength of our operating model. Turning to cash flows. During the fourth quarter, we generated $25.5 million in cash from operations and spent $8.9 million on capital equipment, resulting in $16.6 million in free cash. We paid $3.6 million in dividends, resulting in the company ending the quarter with $120.7 million of cash and no bank debt.\n\nDuring our full year, we generated $137.8 million in cash from operations and spent $24.1 million on capital equipment, which resulted in $113.7 million in free cash. Executing the capital allocation priorities that we have described over the past two years, we used this free cash to repurchase 4.8 million shares of our common stock for $90 million and paid $15 million in dividends to our stockholders. As a reminder, since we completed the spin in August 2020, we have repurchased nearly 10.9 million shares and reduced our share count by nearly 20%. We will not be able to repurchase any additional shares prior to the two-year anniversary of the spin in August 2022.\n\nConsistent with our capital allocation strategy, and as Mark noted, our board has authorized a 25% increase in our quarterly dividend to $0.10 per share. This quarter's dividend will be paid to shareholders of record on July 7 with payment to be made July 21. Looking forward into fiscal 2023, as Mark noted, the firearm market has returned to more normalized levels of demand over the past few quarters. We've been pleased to see inventory levels of distribution drop from approximately 18 weeks in March to approximately 13 weeks at this time.\n\nWhile still above our average target of eight weeks, our experience tells us that the number of weeks at any given time varies based on seasonality, mix and many other factors, and our distributors appear to feel comfortable with the levels of inventory that they are maintaining. With inventory now available in the channel, inflationary headwinds are offsetting the increased market demand for firearms. And so, from a top line perspective, we believe calendar 2019 provides a good framework for modeling demand for our fiscal 2023. For the full year, this implies a 20% to 25% reduction in units from fiscal 2022 and our expectation that ASPs will hold between 90% and 95% of our fiscal Q4 2022 levels.\n\nLooking at seasonality by quarter, we expect fiscal 2023 to follow normal historical patterns. We expect Q1 to be our lowest volume quarter, accounting for between 10% to 20% of our total unit sales. We then expect Q2 to pick up as hunting season begins, accounting for roughly 20% to 30% of our unit volume. Then leading into the holiday season, we expect to see a slightly higher Q3 but still within 20% to 30% of the total unit volumes.\n\nFinally, following pre-pandemic patterns, we believe Q4 will be our largest quarter with roughly 30% to 40% of our unit volume. Given inflationary pressures and the costs associated with recruitment and our relocation to Tennessee, we expect gross margin in fiscal 2023 to decline from 2022 levels but remain within our long-term target range. We expect the first quarter will be a bit lower than our recently completed fourth quarter on lower volume, but depending on inflation, they will grow in later quarters. With regard to operating expenses in fiscal 2023, we expect full year levels to be higher relative to 2022, reflecting approximately $10 million to $12 million in costs associated with the relocation, as well as higher wage costs as our staffing overhead recovers toward normal levels.\n\nFinally, our effective tax rate is expected to be approximately 24%. With that, operator, can we please open the call to questions from our analysts?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Mark Smith of Lake Street Capital Markets. Your line is open.\n\nMark Smith -- President and Chief Executive Officer\n\nHey, guys. First question, I just wanted to ask something kind of broad here. If you had any commentary on today's Supreme Court ruling? And then maybe if you can speak to how important kind of this concealed carry market is to your business today?\n\nSure. So just broadly on the ruling, I mean, it simply clarifies that responsible law abiding citizens don't need to ask the government's permission to exercise their constitutional rights. We obviously agree with this. And insofar as impact to concealed carry in our products, concealed carry is a pretty big portion of our market.\n\nWe expect as it expands the access of those products to those law abiding citizens that that will have a positive impact on us, what that is probably too early to tell.\n\nOK. And then, you guys talked a fair amount about the inventory levels that are out there. But any additional insight into kind of your comfort levels with inventory today? And if there's anything that you're seeing kind of shift in this inventory, if there's anything that's kind of getting more aged that's out there in the channel today?\n\nSure. As we've talked about many times before, inventory for us in this industry is not necessarily such a bad thing. We go through, as you well know, we go through ups and downs and in order to be prepared and allow enough time for our flexible manufacturing model to kick in, we need inventory both in the channel and in our warehouses. So I would say that overall, Mark, our inventory levels that we're holding at the end of the year were probably still under what we want them to be.\n\nSo expect a little bit of growth in the inventory. And then, just remember, as we come into a normal year where Q1 is typically our lowest, it's typically the quarter where we build a little bit of inventory in preparation for the rest of the year. In terms of the inventory levels in the channel, obviously, there's mix there where certain categories like revolvers are continuing to be sold out when -- and really just a week's worth and then there's obviously with 13 weeks of on average as other categories that are higher than that. But there's nothing really out there that kind of makes us getting heartburn or heartache.\n\nThe inventory, as you saw, dropped throughout -- from March to today, so that's a good sign. It's pulling through even in some of our slower times.\n\nOK. And then, the last question for me is just you did talk about inflationary pressures that you're seeing out there. Any additional insight into price increases? Maybe talk about kind of last time that you took price? And is there anything set that normally you would take? Or are you looking at taking any additional price in the near term?\n\nSure. As you know, we took several adjustments throughout the pandemic. And not only was it pricing adjustments, it was also portfolio adjustments to kind of -- that's really what's driven the ASP changes and the increase really given a benefit to our ASPs overall, and I think that's going to carry forward. In terms of pricing, now as we look at it, we're trying to be very judicious with that just because we're not the only one seeing inflationary impact.\n\nOur consumers are seeing it as well. So we're trying to balance that not pricing yourself out of the market but also offsetting some of the pressures we've seen. As you can see from our profitability, we still remain extremely profitable. And you know we have a very, very strong brand.\n\nSo we can take pricing actions if we see the need in the future. Right now, our usual cadence is we do a price increase kind of as we -- near the end of the calendar year, November, December time frame. Right now, the jury is still out on what we'll do there. But again, we feel very comfortable we can take one if we need to.\n\nOK. Maybe I'll squeeze in just one follow up on that. I think you said you've got maybe half a dozen or so new products you expect to come over this next year. Has that been a place where you've been able to maybe drive higher ASP is with some of these new product releases? And would that be kind of the plan going forward?\n\n100% yes. So our pricing -- our overall pricing for the portfolio of products that we offer was definitely impacted by the price increases that we took throughout the pandemic, but I'd tell you that the bigger impact was probably by making product -- fundamental product line adjustments and new products were a huge part of that and will continue to be a huge part of that going forward.\n\nExcellent. Thank you, guys. Thanks, Mark.\n\nOperator\n\nThank you. [Operator instructions] And at this time, I'd like to turn the call back over to President and CEO, Mark Smith, for closing remarks. Sir?\n\nMark Smith -- President and Chief Executive Officer\n\nThank you, and thank you, everyone, for joining us today. We'll talk to you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin Maxwell -- General Counsel\n\nMark Smith -- President and Chief Executive Officer\n\nDeana McPherson -- Chief Financial Officer\n\nMore SWBI analysis\n\nAll earnings call transcripts"
}