{
  "companyName": "Otis Worldwide Corporation",
  "companyTicker": "OTIS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/otis-worldwide-corporation-otis-q3-2022-earnings-c/",
  "content": "Otis Worldwide Corporation (OTIS -0.96%)\nQ3 2022 Earnings Call\nOct 26, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Otis' third quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Michael Rednor, senior director of investor relations.\n\nPlease go ahead, sir.\n\nMichael Rednor -- Senior Director, Investor Relations\n\nThank you, Norma. Welcome to Otis' third quarter 2022 earnings conference call. On the call with me today are Judy Marks, chair, CEO, and president; and Anurag Maheshwari, executive vice president and CFO. Please note, except where otherwise noted, the company will speak to results from continuing operations, excluding restructuring and significant nonrecurring items.\n\nA reconciliation of these measures can be found in the appendix of the webcast. We also remind listeners that the presentation contains forward-looking statements, which are subject to risks and uncertainties. Otis' SEC filings, including our Form 10-K and quarterly reports on Form 10-Q, provide details on important factors that could cause actual results to differ materially. With that, I'd like to turn the call over to Judy.\n\nJudy Marks -- President and Chief Executive Officer\n\nThank you, Mike, and thank you, everyone, for joining us. We hope everyone listening is safe and well. Starting with Q3 highlights on Slide 3. Otis delivered a solid third quarter and strong year-to-date results, especially considering the macro headwinds we're facing.\n\nWe grew organic sales, expanded margins, and achieved mid-single-digit adjusted EPS growth, all largely driven by strong performance of our resilient service business. By executing our strategy, we continue to set ourselves up for the future. This quarter, we demonstrated that performance through accelerating maintenance portfolio growth, which was up 3.8% in the quarter, growing modernization backlog 7%, and gaining about one point of new equipment share year to date, with share about flat in the quarter. Year to date, the new equipment market was down mid-single digits, driven by China, which was down about 15%.\n\nIn the Americas, we are honored to be selected for a modernization project at the iconic space needle in Seattle. Otis installed the original elevator in the early 1960s and has been maintaining the units ever since. We will now modernize the landmarks three elevators, including introducing new technologies such as custom design cabs and Compass 360. In Suzhou, part of the greater Shanghai Metropolitan area, the urban rail network is being expanded once again with the support of Otis.\n\nThe new line aid will be served by nearly 140 Otis escalators and 38 Gen 3 and SkyRise elevators when it begins operations in late 2024. In London, Otis was selected to help modernize an office block into a modern mixed-use development that strives to be the first net zero carbon-enabled office development in London. Otis will provide vertical transportation solutions, including several escalators and elevators equipped with Compass 360 destination dispatching to allow tenants and visitors seamless and efficient access to the buildings floors. And lastly, in Korea, we're extending an over 30-year relationship with GS Engineering & Construction to provide more than 55 elevators to the Oppo XI apartment complex.\n\nThese units will be outfitted with ReGen drive technology, helping to maximize energy efficiency for the elevator serving 1,500 apartments in the complex. Year to date, free cash flow conversion was 106% of GAAP net income, and we kept our capital allocation plans on track with another $300 million of share repurchases in the quarter, completing the $700 million in repurchases we had planned for 2022. With a quarter to go, we feel confident in our cash flow outlook and are increasing our full-year share repurchase outlook to $850 million. And we continue to drive important ESG initiatives, a key priority for Otis.\n\nThis quarter, our efforts resulted in achieving a gold rating with EcoVadis. Now moving to Slide 4, Q3 results and 2022 outlook. New equipment orders were down 0.8% at constant currency in the third quarter. Excluding China, orders were up 7.4% with growth in all regions.\n\nOn a rolling 12-month basis, total Otis orders were up 7.6%. Organic sales were up 0.8%, and adjusted operating profit was up $35 million at constant currency with 60 basis points of margin expansion driven by segment mix and strong performance in the service business. In the quarter, we generated $215 million of free cash flow, which was down versus prior year, driven by an increase in inventory to support backlog conversion and the timing of supplier payments. This brings us to $1 billion year to date with 106% conversion of GAAP net income.\n\nLooking ahead to our 2022 outlook. We're revising our full-year outlook and now expect organic sales growth of 2% to 2.5%, with net sales in the range of $13.4 million to $13.5 billion. Adjusted operating profit is expected to be approximately $2.1 billion, up $120 million to $140 million, excluding the impacts from foreign exchange. After approximately $175 million in headwinds from foreign exchange translation, adjusted operating profit at actual currency is expected to be down $35 million to $55 million.\n\nAdjusted EPS is expected in the range of $3.11 to $3.15, up 5% to 7% versus the prior year. Lastly, we still expect free cash flow to be robust between $1.5 billion and $1.6 billion or approximately 125% conversion of GAAP net income. We will remain disciplined and balanced on our capital allocation, advancing our bolt-on M&A strategy where it makes sense and returning cash to shareholders through dividends and share repurchases expected to be $850 million versus the $700 million target announced previously. With that, I'll turn it over to Anurag to walk through our Q3 results in more detail.\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nThank you, Judy, and good morning, everyone. Starting with third-quarter results on Slide 5. Net sales of $3.3 billion were down 7.6%, driven by the broad strengthening of the U.S. dollar, a 7.2% headwind in the quarter.\n\nOrganically, sales were up 80 basis points, the eighth consecutive quarter of growth driven by service, which increased over 6%. Adjusted operating profit, excluding a $50 million foreign exchange translation headwind, was up $35 million. Drop-through on higher service volume, favorable service pricing strong SG&A cost control and the benefit from productivity in both segments was partially offset by impact of lower new equipment volume, commodity price increases, and annual wage inflation. Adjusted SG&A expense was down 90 basis points as a percentage of sales as we continue to drive cost reduction and containment to help mitigate the inflationary headwinds.\n\nDespite the challenging environment, we maintained investment in the business and R&D spend and other strategic investments were about flat versus the prior year. Overall, adjusted operating profit margin expanded 60 basis points, driven by segment mix, strong service performance and cost containment. Adjusted EPS was up 5% or $0.04. An $0.08 headwind from foreign exchange translation was more than offset by strong operational performance, driven by the service segment, accretion from the Zardoya transaction and a benefit of $700 million in share repurchases completed year to date.\n\nMoving to Slide 6. Q3 new equipment orders were down slightly at constant currency and up 7.4%, excluding China. Orders in the Americas were up 3% with solid growth in multifamily residential and infrastructure. EMEA orders were up 11% with growth in both Europe and the Middle East, and orders in Asia outside of China were up approximately 10%, driven by strong growth in South Korea and India.\n\nThe strong orders growth over the last 12 months contributed to new equipment backlog, increasing 12% at constant currency with growth in all regions, including China, which was up slightly. Backlog in Americas, EMEA, and Asia, outside of China, was up teens. Pricing trends improved year over year in all regions, excluding China, where pricing was flat. Globally, pricing on new equipment orders continues to accelerate and was up 4%, leading to sequential backlog margin improvement.\n\nNew equipment organic sales were down 5% in the quarter as mid-single-digit growth in EMEA and low teens growth in Asia, excluding China, was more than offset by a 4% decline in the Americas due to a tough compare and delays in building construction, and a high-teens decline in China, driven by the challenging market conditions. Sales declined $191 million, and adjusted operating profit declined $23 million largely from the impact of lower volume and related underabsorption. Commodity inflation of $18 million that was in line with prior expectations was more than offset by productivity and lower SG&A expense. Service segment results on Slide 7.\n\nMaintenance portfolio units were up 3.8% with recaptured units more than offsetting cancellations in the quarter. Conversion rate continues to show improvement this year in China, which contributed to mid-teens portfolio growth in the region. Modernization orders growth accelerated to 18% in the quarter with growth in all regions driven by good traction on newer more packaged offerings and several major project wins. Backlog was up 7% at constant currency.\n\nService organic sales grew for the seventh consecutive quarter, up 6.2% with growth in all lines of business. Maintenance and repair grew 5.4% from the benefit of high single-digit repair volume and growth in contractual maintenance sales that outpaced our unit growth due to improved pricing, which was up three points on a like-for-like basis. Modernization sales continued the recovery that started in Q4 of '21 and were up 10% in the quarter with growth in every region. Service profit at constant FX was up $49 million, driven by the drop-through on higher volume favorable pricing and productivity, which more than offset the headwinds from annual wage increases.\n\nAs a result of this, margins were up 50 basis points, the 11th consecutive quarter of margin improvement. Overall, despite the significant macro headwinds, our year-to-date results are strong. We gained approximately one point of new equipment share, delivered the best portfolio growth in over a decade and more than mitigated $195 million of headwinds from FX and commodity inflation through strong execution to achieve an 8.5% EPS growth. Moving to Slide 8 and the revised outlook.\n\nThese changes reflect revised expectations in the China market outlook, the continued strengthening of the U.S. dollar and our focus on productivity initiatives to offset the headwinds. Starting with sales. We are expecting organic sales to be up 2% to 2.5% versus 2.5% to 3.5% previously.\n\nThis 75-basis-point reduction is driven by lower expectations for China new equipment, partially offset by an improved modernization outlook and service. The new equipment margin outlook is down 10 basis points at the midpoint from the impact of lower volume in China, offset by cost containment. Service margins are now expected to be up approximately 50 basis points, a 10-basis-point reduction from the prior outlook, reflecting the mix impact of modernization sales growing faster than the maintenance and repair business. The overall margin outlook remains unchanged versus the prior outlook and is expected to be up approximately 30 basis points to 15.7%.\n\nAdjusted EPS is expected to be in the range of $3.11 to $3.15, up 5% to 7% versus the prior year. This adjusted EPS growth is driven by strong operational execution accretion from the Zardoya transaction, progress on reducing our tax rate and a lower share count that more than offsets $0.47 of headwind from foreign exchange translation and commodity inflation. We now expect free cash flow to be in a range of $1.5 billion to $1.6 billion versus approximately $1.6 billion previously. Foreign exchange translation continues to weigh on cash flow generation, and we anticipate a moderate build in inventory heading into 2023 to support project execution on the growing backlog.\n\nOn capital deployment, we are increasing the share repurchase target to $850 million, having already completed our previous outlook of $700 million in the first three quarters. This is an over two times increase from the $300 million to $500 million guidance we had given in the beginning of the year, and combined with a 20% dividend increase, underscores our commitment to return cash to shareholders. Taking a further look at the organic sales outlook on Slide 9. The new equipment business is projected to be down approximately 2.5% versus down 0.5% to 1% previously.\n\nWe now expect Asia to be down approximately 6% from down low single digits previously driven by China. Despite our backlog being up slightly versus prior year and up from the end of '21, we now expect Otis China organic sales to be down 10%, driven by the shift of project execution to the right and lower market expectations now expected to be down roughly 15%. This has been partially offset by improved outlook in Asia Pacific from the benefit of strong orders growth momentum in India and South Korea. The new equipment outlook in the Americas and EMEA is unchanged, expected to be flat and up low to mid-single digits, respectively.\n\nTurning to service. We now expect organic sales to be up 6% to 6.5%, an improvement of 50 basis points at the low end, driven by a conversion of modernization backlog that is up 7%. Moving to Slide 10. We expect adjusted EPS growth of 5% to 7%, an $0.18 increase at the midpoint.\n\nWe expect to more than offset the $110 million headwind from commodities with $230 million to $250 million of operational improvement from higher service volume and pricing, productivity in both segments and other cost containment actions, resulting in profit growth of $120 million to $140 million at constant currency. This is $5 million lower than our prior outlook at the midpoint, driven by reduced China new equipment volume expectations that we are partially mitigating through better cost containment and productivity. Accretion from the Zardoya transaction, over two points of tax rate reduction versus last year and the benefit from over $1.5 billion of share repurchases since spin, partially offsets the $0.29 or $175 million headwind from the significant strengthening of the U.S. dollar.\n\nWe have now assumed the euro at $0.97 for the fourth quarter or $1.04 for the full year. Overall, since 2019, this outlook represents 50 basis points of annual margin expansion and low teens three-year adjusted EPS CAGR, reflecting the execution of our long-term strategy and our ability to mitigate the macro challenges we have faced. We feel confident that this momentum, along with our growing backlog and service portfolio sets us up well to deliver strong financial performance in 2023 and beyond. And with that, I will request Norma to please open the line for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Nigel Coe with Wolfe Research.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nSo obviously -- China is obviously the sort of the big issue. But just wanted to talk about the Americas because it -- you mentioned some project and construction delays in the Americas. I'm just wondering if you could just give us some context on the geographies there. I'm assuming it's the U.S., but if there's anything else going on there, please let us know.\n\nAnd any verticals of standout where you've seen delays?\n\nJudy Marks -- President and Chief Executive Officer\n\nNigel, it's Judy. So it is primarily the U.S. It's not rate driven. It really is availability of construction labor outside of the elevator part.\n\nWe're feeling very confident in our ability to be at job sites at the right time. We recognize we're in the critical path, but it's all the other trades from getting the hoistway poured to really just directing the building. So that's really what we're seeing, and it's a delay, it's a slowdown, but it's not going to go away. The buildings are going to get built, but it's going to move some revenue into '23 even from the fourth quarter.\n\nSo we're watching that carefully. There's really no unique vertical that, that's happening. The verticals are really still strong. And if you look at ABI is at 51 7, Dodge construction starts.\n\nThe biggest growth we're seeing is in multifamily residential. And year to date, Dodge construction starts for multifamily residential is up 28%. So demand is still strong. Orders are strong, 24.3% year to date in the Americas, and we're just seeing a little bit of delay in terms of being able to deliver and record that revenue.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nYes. I agree with that. And then my second question is really on, I think Anurag, you mentioned 4% pricing on orders, if I caught that right? What is the realized price today? Is it still trending negative today? So I'm just wondering of that 4% as we convert that backlog into 2023, if we have a little bit of good news on commodities, is there a path to expanding new equipment margins in 2023.\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nThanks for the question. So, yes, the price increase, firstly, it's coming through on the backlog margins, as I mentioned, right? So this quarter, we did see the backlog margins kind of flattish sequentially relative to -- sorry, VPY, it was kind of flattish. Now I'm talking about flowing it through. If you look at the third quarter on the new equipment side, the flow-through to the bottom line, it was essentially volume.\n\nSo we have about $100 million VPI in terms of decline in terms of revenue and $20 million of that should flow through to the bottom line. And that is what the VPY is on the new equipment side. So we're kind of hitting the price-cost neutrality in the quarter itself, right? And as backlog margins improve from now to the end of the year, you should see that expansion coming into 2023 as well.\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. Nigel, just one other thing. What I watch is that early trend as well. And we were up two points in the second quarter on new equipment pricing and now four points this quarter.\n\nAs a long cycle, it's going to take some time to get through the backlog, but it's going to come through. In terms of commodities flipping, really the only place we've seen that significantly already is China. And I would say Europe is a question mark there in terms of -- because of energy prices and everything else going on. But we would welcome commodities coming down as soon as possible, and you'll see that flow through.\n\nThat, again, during our long cycle, gives us the opportunity to drive material productivity, supply chain, everything in our backlog.\n\nOperator\n\nOur next question comes from Jeffrey Sprague with Vertical Research.\n\nJeffrey Sprague -- Vertical Research Partners -- Analyst\n\nCan we just delve a little deeper now into China? Maybe just frame the order decline, kind of speaking to order declines ex China, I guess we can all try to do that math, but I'd love to maybe have you frame that up for us. And maybe more importantly, just kind of speak to what's in backlog and sort of your visibility on China revenues over the next two to four quarters or so?\n\nJudy Marks -- President and Chief Executive Officer\n\nSure. Let me start, and then, Anurag, feel free to jump in. So we now view full year '22 China market growth estimates down 15%, roughly. Some of this is driven to the lockdown.\n\nSome of it is driven by the property market confidence. And clearly, the market won't recover in '22. Q1 was down 5%. Q2, the segment was down 20%.\n\nQ3, we believe it was down 20% as well. And last quarter, we assumed COVID would be relieved. There'd be somewhat of a return to normal. And while this might not be as visible to everyone outside China, the COVID lockdowns are absolutely continuing, especially in Tier 3 and below cities.\n\nSo those constraints are really constraining us from being able to do final shipments in terms of delivering them on the trucks and then installing them. Having said that, Jeff, I'm feeling good about the health of our business in China. When we talked about new equipment pricing just a second ago, we're net price cost neutral to favorable in China this quarter, which is just a testament to the resiliency and the tenacity of Harry and our China team to be able to do that. The market segment was down about 20%.\n\nWe were down pretty close to that in orders. So we didn't -- there was not a share gain there for us this quarter, although we've had them in the first two quarters. Our strategy and our initiatives are on track and new equipment. We've gained share year to date.\n\nThe only segment that was up in China in the third quarter was infrastructure. All of the others were down. All of the tier cities were down as well, but they were down -- Tier 1 was down the least, Tier 2 next and then it degraded from there in terms of larger down in terms of segment. While all this was happening, our teams still delivered.\n\nModernization grew and service grew again. It was our fifth consecutive quarter where we had mid-teens or above portfolio growth. where recaptures outpaced cancellations. And so they were all really good positive contributors.\n\nAs I look into '23 without -- we're not going to give a guide right now. But as we look out at it, especially in China, the segment, if you go back to our first Investor Day in February of 2020, we shared we thought the China segment would be about 550,000 units a year and be flattish. That's where it was in early '20 pre-COVID. It spiked and got up to 650,000 last year.\n\nIf you assume the segment is down 15%, it gets you to a 540,000 kind of number. Our early assessment for '23 is the segment is going to be between 500,000 and 525,000. And again, the pricing we've seen is rational, and we're driving costs down, commodities are down and material productivity is doing a great job. So on the new equipment side, I actually think we're in a good position.\n\nWe've got some limited backlog in China, fourth quarter will drive that as well as we go into the rest of the year. But the rest of the -- total company-wise, we're up 12% on new equipment orders. Everybody is growing in mod as well. And I will remind everyone that there are 8 million units at the end of this year in service in China.\n\nSo that's going to be the key growth lever. We're still going to be gaining share in new equipment, executing our strategy, but our service growth and portfolio growth will continue. Anurag?\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nYes. Thanks, Judy. I mean, overall, we feel very good about the market over there. In terms of the backlog, today, Jeff, right, so as Judy said in the prepared comments, we're up 12% on the backlog.\n\nAnd China is slightly up as well relative to last year. We have a good line of sight over the next few quarters, not only in China and the other regions for the backlog. As you are aware, 2/3our revenue for next year will come from the ending backlog. So given where we are today and the pipeline that we have seen on the new order side, good line of sight to convert that into shipment next year.\n\nJeffrey Sprague -- Vertical Research Partners -- Analyst\n\nMaybe just -- that was very helpful. Just to maybe shift gears back to mod and maybe it's more of a global question now. But any indication of just kind of economic weakness coloring some of the forward demand around mod, he's a great deal that can certainly be discretionary, at least temporarily discretionary.\n\nJudy Marks -- President and Chief Executive Officer\n\nJeff, the challenge is this would be the third or fourth year of discretionary. So all of a sudden, there's modernization projects, especially the ones that are technology insertion versus just aesthetics, have really started coming to the forefront. 7 million of the units in the world are over 20 years old. So it's a huge mod market, and the team really delivered 18% up in orders, year to date, up 6.5%.\n\nWe got a 7% backlog. So I actually think we're seeing the pent-up demand. And again, for those who don't modernize, and the elevators will tend to break down, especially 20 years old, more frequently, which drives our repair business. And between that and just people returning to office hotels, our repair business is up really nicely.\n\nOperator\n\nAnd the next question comes from Julian Mitchell with Barclays.\n\nJulian Mitchell -- Barclays -- Analyst\n\nMaybe just wanted to start with the fourth-quarter guidance. So it looks as if you're dialing in a pretty severe sequential margin decline. And I realize maybe there's some deleveraging with fixed cost under absorption because of the China calendar and also the market weakness there. Maybe just highlight if there's anything else driving that big sequential decremental margin.\n\nAnd also just to put a finer point on it in Q4, China new equipment, I think your sales were down high teens in the third quarter. Are we expecting a steeper rate of decline year on year in the fourth?\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nThanks, Julian. This is Anurag here. Let me answer the second question first. On the channel, the rate of decline is actually reducing in the fourth quarter.\n\nYou're right, it was double digit in the third quarter, but we see it to be low single digit in the fourth quarter, right? Now going back to -- on the fourth quarter, where you see the margin is essentially on the new equipment side of the business, right? If you go back the past few years, seasonally, Q4 has been a lower margin for us. We've been around the 5% so margin level. And that is the big difference between the year-to-date run rate on new equipment margin versus the fourth quarter. And when we gave guidance in July, at that point in time, that was calibrated.\n\nWe said that the guidance margin for the second half of the year for new equipment would be closer to 6.2%. I mean, clearly -- and that was assuming that China would kind of return back to more normal times. But as you can see in our guide, the revenue is down by about $100 million, largely because of China, and that flows through at 20% -- $20 million. So if that has flown through to the bottom line, it would have been a 50 basis points margin degradation from 6.2% to 5.7%.\n\nBut through productivity to other cost containment, we were able to mitigate it and get it back to 6%. And clearly, a lot of it was overdriven in the third quarter, both in terms of closeout in terms of productivity, in terms of cost containment. As we go into the fourth quarter, in terms of volume, in terms of commodities, that is pretty much constant run rate where we see a little bit is on the regional mix, and that kind of makes the margin go down. Having said that, we'll continue to work on the SG&A side of productivity, and it was a little bit more upside on new equipment.\n\nWe'll kind of drive that through. So that is the big one. And lastly is just FX, right? We had a $5 million FX headwind in the third quarter. That steps up to about $67 million, $68 million.\n\nSo that's $17 million, $18 million. So in between new equipment and FX, which is kind of causing the Q4 versus Q3 margins.\n\nJulian Mitchell -- Barclays -- Analyst\n\nThat's very helpful. And then just my follow-up would be around not so much modernization specifically, which I think came up. But more broadly on kind of Europe pricing. I think people are very nervous because of the macro data that you might get deep and possibly a long European construction slowdown fairly soon.\n\nThe last time that happened, there was pricing pressure in a number of areas, including elevator service 14 or 13 years ago. Just wondered your thoughts today on the sort of fragmentation of the Europe service market and maybe how Otis' kind of practices might be different there? And how does it work in terms of inflation feeding through to your new service contracts for next year in Europe?\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. Let me start with that one. So service pricing in general, just for -- we know, one like-for-like pricing increased three points in the third quarter. It was very solid and really was strongest in the developed mature markets globally where the majority of our portfolio resides.\n\nSo that hits right to the heart of your question, Julian, in terms of really how is Europe doing on service pricing. The majority of renewals are pretty much up. When you think about how the year rolls out, our largest renewals happened in the first quarter and then over time. So we should finish the year with that like-for-like pricing, especially in Europe.\n\nWe do have inflationary clauses. Most of them tied to labor, especially in Europe and North America. So we have the ability to raise prices again when the new year starts. And what encourages me is that it will be indexed based on 21 -- '22 inflation this year when we start '23.\n\nSo the inflation indices will be even higher. And now it's up to us to go get that because it's in our contracts and our sales teams are trained to do that. So we've been offsetting the labor inflation is the labor inflation, as you can see, even in Europe based on the margin expansion we've had. On the general macroeconomics in Europe, so far, I got to tell you, especially on the new equipment side, it looks good in '22.\n\nOrders are up this quarter, 11%, 10.3% for the 12-month roll. We're watching the headwinds but building permits are still holding. So we haven't seen that change. And so our goal, again, is to gain share and build backlog, and that's exactly what Bernardo and our EMEA team have been doing.\n\nOn your last part about comparing to 13 or 14 years ago, it's a very different time now. Back then, we were 10 points differentiation between ourselves and our closest OEM maintenance service providers in terms of margins. And that was what was driving the Otis machine at the time. Right now, we're much closer, very close, pricing is rational.\n\nThere's not an oversupply of labor like we experienced after the '08 financial crisis and all those new equipment installers became ISPs, and there wasn't a technology like Otis ONE that gives us that advanced stickiness that customers are really believing in now and seeing and it's giving us productivity. So it's a different world, and I think our performance over the last 10 or 11 quarters shows that.\n\nOperator\n\nAnd our next question comes from Stephen Tusa with J.P. Morgan.\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nSo where do you expect to end the -- I'm not sure if you said it's four, I wasn't on in the first 10, 15 minutes, but where do you expect to end the year with backlog? I mean is book-to-bill still above one and -- or can it be above one in the fourth quarter? Maybe just talk about kind of the regional expectations for orders in the fourth quarter.\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. So really strong orders year to date. I mean I love what we've been doing, and it's been -- it's really been kind of fulsome across Americas, EMEA, and Asia. Obviously, China orders are down as the segment is down.\n\nWe're not losing share there. We were flattish this year, Steve. But we've got 12% backlog right now on new equipment orders, and we're doing mod orders or my backlog is almost 7%. So that's the strongest we've had in a really long time.\n\nOrders are -- they're going to be lumpy. We had a great mold orders quarter this quarter. We expect mod to continue to be strong now in the whole medium-term forecast, a medium-term guide. But they will -- there's times that new equipment orders with major projects will get lumpy.\n\nBut I would say kind of watch where we end the year, be it now at 12%, where we've gotten to on backlog conversion, we should be really strong going into '23. I'm feeling pretty good about line of sight for '23. We know the backlog on the new equipment side. We'll know the backlog on mod.\n\nAnd our service portfolio is -- yes, so I would -- if you were going to calibrate backlog for fourth quarter -- as we exit fourth quarter, I think high single digit. I think you could feel good doing that. But then on the service side, repair is up, mod is up, and maintenance is up because our portfolio is up 3.8% last quarter. It was just under 3.5% the quarter before.\n\nWe hope and plan for that to start with a 4% when we talk to you the next time. And that volume is driving -- is going to drive really good backlog in service.\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nRight. So high single-digit constant currency year over year is what you're saying for the equipment backlog end of the year? Is that what you're saying?\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. Correct.\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nAnd one follow-up, just on the '23. Can you just maybe give us some color around anything that's more mechanical for '23 in the bridge, whether it's four times snapping the line here, cost inflation? And any of that stuff that you'd highlight as part of the bridge for '23, just using the prevailing rates today?\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nSteve, Anurag here. You mean on the FX side, on the ForEx side?\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nYes. Just anything else more mechanical, whether it's raws or anything like that, that on the '23 bridge that you have good visibility on today that you want to just get out there?\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nYes. So if we snap the line on foreign exchange today, we'll be -- of at the headwind of this year that we would see next year. So it will be around $75 million to $100 million, right? On the below-the-line stuff, we have a quarter of the Zardoya accretion, which will come through next year. We did very well on tax this year.\n\nIt should come down a little bit more next year. But nothing materially different over there, right? So that, I would say, is on the FX and year. And just on the '23 as going -- as what Judy said, we're going to end the year with a very good backlog, both on service as well as on new equipment side on service more than maintenance growth. And where we are on pricing that we're seeing in the backlog today, that should kind of flow through next year as a tailwind.\n\nCommodity as well. If you look at it, I mean we take them already, but it's a little bit different dynamics in the four regions. China. We started seeing it coming down.\n\nAmericas as well, we've seen it stabilizing coming down. So those should be tailwinds as we go into next year. In the case of Asia Pacific, ex China, we buy from second-tier supplies majority that should also be a tailwind going to next year, maybe in the second half. It's Europe, right? But just given the -- what's happening with energy prices, the conflict over there, the prices are still kind of flattish, that may not be so much of a tailwind going into next year, right?\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. Steve, the only other thing I'd add is we are watching labor inflation. I think in our case, the great news is more than half of our field workforce is covered by collective bargaining. We shared that we do have a new agreement here with the International Union of Elevator Constructors, the multi-employer union in the U.S.\n\nthat goes into effect in January. So we've got five years of predictability here. was a fair agreement, and it looks very similar to the last five years. And with a little increase as it should as is appropriate.\n\nBut we've got predictability. So now it comes back to us to be able to offset that with price and productivity. And we're watching labor in Europe. We've got some more negotiations coming up.\n\nBut again, we will note that our backlog, it takes that 12-plus months to work its way through in most countries. So we know what we need to do in terms of productivity and price to offset that. The last part of labor we're watching, just for you to know is or to be aware of are the subcontractors, mainly on the -- they're on the installation side outside the U.S. in several countries.\n\nAnd we've got to offset those increases with price and productivity. We know what we need to do.\n\nOperator\n\nAnd our next question comes from John Walsh with Credit Suisse.\n\nJohn Walsh -- Credit Suisse -- Analyst\n\nMaybe just building off of Steve's question there, just looking more at it from a cash flow perspective. As you think about into next year, obviously, you're carrying higher working capital than normal. I'm curious what you might think normal is and if we actually revert to that next year? And then maybe just on the supplier timing payments that were called out in this quarter, do those all get made up in Q4? Or is that also a bridge item into '23 for the cash flow?\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nYes. John, Anurag here. So just on cash flow, as you kind of think about going forward, we will grow cash pretty much with earnings, right, as to where -- and that should be the biggest driver of cash flow. Now to your second question.\n\nYes we -- if you look at this quarter, Quarter 3, we used about $150 million of cash, and it was around three different buckets. The first bucket was getting ready to execute, second was around receivables, and third was around a timing between cash and book taxes. So on the first part, we have -- our backlog is up 12%. We need to be in a position to deliver product and execute on time.\n\nSo to do that, we built up some inventory, prepaid certain suppliers to lock in price as well as critical supply, right? On the second on receivables, the modernization grew a little bit more faster, which comes in with more back-end payment and also because of the delays in projects moving to the right, there was a few new equipment collections. And on tax, we've done a very good job, as you saw in the second quarter on bringing the tax rate down. There's just some timing difference between cash and book taxes. So these three things should more or less unwind in the fourth quarter.\n\nSo as we get into fourth quarter, so which is why we will get to the $1.5 billion to $1.6 billion guide. So they all unwind. So as we look into next year, it should be mainly earnings, which should be driving the free cash flow growth.\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. John, as part of our customer focus, we understand we are in the critical path of every new construction job. That hoistway has to go in. And one of our differentiators in the market is general contractors know we will deliver on time.\n\nAnd to do that, we increased inventory. We locked in some suppliers just to make sure we would have that ability. I probably would have liked some better backlog conversion, if you ask me. But we'll get there and -- but we just needed to make sure we weren't going to let a job site or a customer fail on the new equipment side.\n\nJohn Walsh -- Credit Suisse -- Analyst\n\nGreat. That's a very helpful answer. And then if I could just circle back to modernization? Just curious if there's a particular driver to call out if you're seeing -- I mean, you talked about deferred or deferrals earlier. But what about like taking an office and converting it into multi-tenant? Are you seeing that? Or customers, buildings trying to make sustainability commitments.\n\nWe don't always think of the elevators as a big energy user. But are you hearing customers talk about that? Just any more color around why the customers are moving ahead with these modernizations would be helpful?\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. So it's a variety of reasons. You've called out a few. The other one I would add would be is part of return to office.\n\nPeople are trying to make the offices more attractive as well, especially those that -- again, there are so many buildings where the elevators are over 20 years old. So now that really people have choices, they want to create a more engaging workplace. They want people to come in. We're seeing it really across the board.\n\nSome of it is pent-up demand, some of it is delayed, some of it's just dramatic need. But the rest is by choice, and we think that's going to continue.\n\nOperator\n\nAnd our next question comes from Joseph O'Dea with Wells Fargo.\n\nJoseph O'Dea -- Wells Fargo Securities -- Analyst\n\nI'll give you the address of my building because the modernization wouldn't be bad there.\n\nJudy Marks -- President and Chief Executive Officer\n\nHappy to.\n\nJoseph O'Dea -- Wells Fargo Securities -- Analyst\n\nI wanted to ask on the Americas, just project experience and delays. And just how that's been trending as it been an issue now for some time? Whether there are any indications of seeing some improvement there over the past, call it, six to nine months? And then as well, just what you're hearing from folks in terms of expectations moving forward and where we get some better project activity or just execution?\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. I think we're going to see it get better, Joe. I think it's absolutely correlated to employment in the rest of the trades. And as things change in the global -- in the economy in the U.S., we're starting to see it get better.\n\nBut again, it's job by job, and it's local. Construction is local everywhere. So there's no national provider like someone like us in all the other trades that come together to build a building. We anticipate it improving, and we anticipate better backlog conversion from our Americas team, especially in North America.\n\nWe're watching the same trends you are, but we expect that. And we haven't seen the indicators change yet. I mean the billing -- architect's billing index is still over 50, and Dodge is still up. So will it be at the -- will the new starts be at the same amazing rate we've had probably for the last couple of years? Probably not at the same great rate, but it will be at a good rate.\n\nAnd we've got really good share there and team -- our team will deliver.\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nYes. And if I could just add to that. I mean, we see all these underlying secular drivers being very strong. And if you look at the sites, they are actually started gradually opening up.\n\nOur guidance for the full year still remains what was as per the prior guide, which is flat on new equipment for Americas, so sometime in Q3 and Q4. So we should see Q4 as kind of a turning point as we convert this backlog into revenue. So you should start seeing indicators starting for itself.\n\nJoseph O'Dea -- Wells Fargo Securities -- Analyst\n\nThat's helpful. And then I wanted to circle back on fourth-quarter margins and specifically on service and then corporate and other. Corporate and other was a little bit lighter than we expected in the third quarter. Just kind of what you're anticipating in the fourth quarter? And then coming off of a 23.9% service margin in the third quarter, how to think about kind of the bridge into the fourth quarter and some of the moving items there?\n\nJudy Marks -- President and Chief Executive Officer\n\nYes, Joe. I hope you saw our sustained zealous approach to reducing G&A down 90 bps in this quarter. Anurag's come on board and he is looking, together, we are looking, but he is certainly taking a hard look at G&A structure, what do we need especially in corporate functions. So I'll turn it over to him to talk about fourth quarter, but know that everything that can be contained is being contained in terms of cost without risking investment for our future.\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nThanks, Judy. Absolutely. I mean, cost is something we control. We will continue to take a look at it.\n\nOn the service margin side, if you look at Quarter 3, we grew 50 basis points. Year to date on service, we are growing at 50 basis points. There's really good performance in terms of pricing for sure, in terms of productivity, in terms of cost. So that's kind of what got us to a very good performance in Q3.\n\nWe see similar performance in Q4 as well. We'll be at similar margins of 23.9%, 24%, 50 basis points more than last year, right? We will see some catch-up on the cost side because we did contain it very closely in the third quarter. There will be some part of it was permanent part of it was temporary that we contained. There'll be some snapback in Q4, but we'll continue to look at that.\n\nAnd that should be a tailwind as we enter into the fourth quarter. But just on the service side, I think the trend, if you look at revenue growth and margin expansion, it is pretty linear through the course of the year, and we expect to see the same in fourth quarter.\n\nOperator\n\nAnd our next question comes from Gautam Khanna with Cowen.\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nHad a couple of questions, just to follow up on some of the pricing comments. On the inflation clauses in Europe, North America, etc., where is the magnitude of the opportunity greatest by region in terms of repricing service? Is it Europe followed by North America? Just where do you -- can you speak to the magnitude by region?\n\nJudy Marks -- President and Chief Executive Officer\n\nI would place Europe as the highest followed by North America.\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nAnd then when you roll it up, do you have a view on kind of price cost and service next year, what that could be? I mean it's positive, but is it -- can you frame the magnitude?\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nGautam, yes, it's -- listen, it's going to be positive. I mean our medium-term guidance, what we said is service should be up 40 to 50 basis points, right? This year, we have 50 basis points. We we've increased price age, inflation managed wage costs, as Judy earlier spoke about, be it Americas and other places. As we go into next year, I think we feel good about being on track for the medium-term guidance in terms of expansion of margins.\n\nAnd we're expanding margins with also modernization business growing at a faster clip, right, which is a headwind to the overall margin on the service business. So we'll give more specificity as we get into the January, February call for the guidance for next year, but continue to kind of see that margin expansion trajectory that we are on today.\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. It will be a service play, Gautam, next year. As we said in our medium-term guidance. And I think in Year 1, since we did the Investor Day just this past February, I think we've proven that.\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nAnd then last one on China pricing. Kind of what are your expectations as you move through the next couple of quarters given it looks like the market's long capacity. Do you get a sense of the magnitude of new equipment pricing pressures next year?\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. We think it looks like it looked this quarter, which will be relatively flat kind of neutral. That will certainly be what we do. We're not seeing irrational pricing, and we get to see it on the infrastructure, their public bids.\n\nAnd so we think it will be flat.\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nYes. And, Gautam, just to add, in the quarter, even the market being down, we are very happy with the way it is right now, price cost. And if that continues, it's going to be very positive for us.\n\nJudy Marks -- President and Chief Executive Officer\n\nYes.\n\nOperator\n\nAnd our next question comes from Joel Spungin with Berenberg.\n\nJoel Spungin -- Berenberg Capital Markets -- Analyst\n\nMaybe I could just start by talking about the growth in the maintenance reported 3.8% was it in Q3. Is there any sort of color you can give us around the differences by region in terms of where you're seeing the growth in your maintenance units?\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. The largest growth we're seeing, and I think I mentioned this, it's our fifth consecutive quarter in China with mid-teens plus growth. So that's the largest followed by Asia Pacific, but all four regions are growing. But those two are the biggest hitters in terms of growth rates.\n\nJoel Spungin -- Berenberg Capital Markets -- Analyst\n\nOK. But all regions are growing, that was the main thing.\n\nJudy Marks -- President and Chief Executive Officer\n\nYes.\n\nJoel Spungin -- Berenberg Capital Markets -- Analyst\n\nOK. Understood. And then maybe just changing tax slightly on -- just coming back on your comment earlier, Judy, about the field workforce, you mentioned that half of the field workforce is covered by collective bargaining. Just so I understand, is that across both service and new equipment? And then sort of related to that, is it sort of reasonable to think that the split of that labor force is broadly in line with your regional split?\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. So when you think about -- so yes, it's both -- it's our field workforce. So to me, field is -- there's -- we have 41,000 field professionals. Some are in new equipment, the majority are in service because we do use subcontractors to help us with installations in parts of the world.\n\nIt's clearly collective bargaining works councils is clearly the way we do business in Europe. We have had a unionized workforce in the United States for a long time, think about Korea, Japan. So it's the field workforce. And in many locations, it's our factory workforces as well as well as some of our professionals.\n\nIt really depends on the country. And we have -- I think we have been operating under this for so many decades to us, it's the way we go to market and it's the way we lead our company and so the way our colleagues show up for work every day. So it's very normal for us. We understand the headwinds when they happen and when we understand the opportunities when they happen, and we believe we give 68,000 colleagues a great place to work and a great career.\n\nJoel Spungin -- Berenberg Capital Markets -- Analyst\n\nThat's great. Maybe just one very quick follow-up. You mentioned, obviously, subcontracted costs being a factor. You're probably aware, obviously, that they were calling subcontracted costs out as a potential risk in 2023.\n\nAre you able to give us a bit more detail about how important subcontracting costs are on the installation side?\n\nJudy Marks -- President and Chief Executive Officer\n\nSo again, we only use them in countries where it makes sense to us. We do have thousands of our own installers and all of our supervisors who are on the job sites are Otis colleagues. The majority of where we use them, as you can imagine, is China, Asia and Europe, and it gives us flexibility in terms of surge because new equipment has more variability as we've seen over the past few years significantly than the service business. So it gives us the opportunity to manage and lead our workforce while being able to provide solutions.\n\nAnurag, anything you want to --\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nI think you said it, Judy. I mean these are the markets where we work with subcontractors. We work through this year as well. I mean they are also seeing inflation, but we work on installation productivity with them, right, how we can reduce the hours that it takes to install an elevator? We'll continue doing that, but they've been great partners for us in these regions and will continue to be so.\n\nSo net-net, if you look at new equipment for next year, both on the top line as well as on the bottom line, it should do better than the medium-term guidance that we set up.\n\nJudy Marks -- President and Chief Executive Officer\n\nYes. and they're an extension of us, Joel. They really -- they take our -- they -- our ethics, our safety program, our methods, our tools, you won't know the difference. The challenge we have, which our teams are dealing very well with is ensuring we have a robust available workforce at a good price, and that includes these subcontractors.\n\nJoel Spungin -- Berenberg Capital Markets -- Analyst\n\nGot it. And are those costs booked within cost of goods? Is that as opposed to labor costs?\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nSorry, what was the question?\n\nJudy Marks -- President and Chief Executive Officer\n\nAre they with the cost book, subcontractors?\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nYes. Yes, that is correct, yes.\n\nOperator\n\nAnd I'm currently showing no further questions at this time. I'd like to hand the conference back over to Ms. Judy Marks for closing comments.\n\nJudy Marks -- President and Chief Executive Officer\n\nThank you, Norma, and thank you all for joining us today. This solid year-to-date performance, the advancement of our long-term strategy and continued growth in new equipment backlog and maintenance portfolio units positions us well to deliver on our 2022 outlook and build on the outlook and build on that and beyond. Thank you for joining us. Stay safe and well.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Rednor -- Senior Director, Investor Relations\n\nJudy Marks -- President and Chief Executive Officer\n\nAnurag Maheshwari -- Executive Vice President and Chief Financial Officer\n\nNigel Coe -- Wolfe Research -- Analyst\n\nJeffrey Sprague -- Vertical Research Partners -- Analyst\n\nJulian Mitchell -- Barclays -- Analyst\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nJohn Walsh -- Credit Suisse -- Analyst\n\nJoseph O'Dea -- Wells Fargo Securities -- Analyst\n\nJoseph ODea -- Wells Fargo Securities -- Analyst\n\nGautam Khanna -- Cowen and Company -- Analyst\n\nJoel Spungin -- Berenberg Capital Markets -- Analyst\n\nMore OTIS analysis\n\nAll earnings call transcripts"
}