{
  "companyName": "Norwegian Cruise Line Holdings",
  "companyTicker": "NCLH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/norwegian-cruise-line-holdings-nclh-q2-2022-earnin/",
  "content": "Norwegian Cruise Line Holdings (NCLH -1.84%)\nQ2 2022 Earnings Call\nAug 09, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Norwegian Cruise Line Holdings business update and second quarter 2022 earnings conference call. My name is Darryl, and I will be your operator. [Operator instructions] As a reminder to all participants, this conference call is being recorded. I would now like to turn the conference over to your host, Jessica John, vice president of investor relations, ESG and corporate communications.\n\nMs. John, please proceed.\n\nJessica John -- Vice President, Investor Relations, ESG, and Corporate Communications\n\nThank you, Darryl, and good morning, everyone. Thank you for joining us for our second quarter 2022 earnings and business update call. I'm joined today by Frank Del Rio, president and chief executive officer of Norwegian Cruise Line Holdings, and Mark Kempa, executive vice president and chief financial officer. Frank will begin the call with opening commentary.\n\nAfter which, Mark will follow to discuss our financials before handing the call back to Frank for closing remarks. We will then open the call for your questions. As a reminder, this conference call is being simultaneously webcast on the company's investor relations website at www.nclhltd.com/investors. We will also make reference to a slide presentation during this call, which may be found on our investor relations website.\n\nBoth the conference call and presentation will be available for replay for 30 days following today's call. Before we begin, I would like to cover a few items. Our press release with second quarter 2022 results was issued this morning and is available on our investor relations website. This call includes forward-looking statements that involve risks and uncertainties that could cause our actual results to differ materially from such statements.\n\nThese statements should be considered in conjunction with the cautionary statement contained in our earnings release. Our comments may also reference non-GAAP financial measures. A reconciliation to the most directly comparable GAAP financial measures and other associated disclosures are contained in our earnings release and presentation. With that, I'd like to turn the call over to Frank Del Rio.\n\nFrank?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nThank you, Jessica, and good morning, everyone, and thank you for joining us today. Over the past several quarters, we have reached many pivotal milestones as we continue the steady march of our post-pandemic recovery. On our last call, we had just welcomed the last ship in our fleet back to service, becoming the first major cruise operator to be fully operational. This quarter, we are pleased to report that we have reached another key milestone with operating cash flow turning positive for the second quarter.\n\nWhile our focus is on our profitable future, when I take a moment to reflect on the tremendous progress we have made since launching our Great Cruise Comeback just over a year ago, I can't help but be immensely proud of the entire team in Norwegian for rising to the occasion time and again and delivering impressive results. Working well alongside us has been the travel agent community who more than anyone can appreciate the challenges that we as an industry have overcome, and more importantly, can also see the tremendous opportunities that lie ahead. We thank them for their unyielding support throughout this journey. We have been disciplined and methodical in our ramp-up and have maintained a clear and consistent mindset focused on our core market strategy of market to fill and emphasizing value over price by continuing to expand and refine our bundling strategy.\n\nOur guiding principle has been a focus on the long-term profitability of the company, particularly for 2023 and beyond, by protecting our long-term brand equity and building on our industry-leading pricing. This means making intentional tactical sacrifices in the short term in favor of long-term sustainable results. With this ethos at the forefront of our business plan, we also continue to be opportunistic, exploring all options to accelerate our recovery. As I serve in the current landscape, I see several tailwinds and catalysts for our company, which are outlined on slide four.\n\nFirst, since we last spoke, we have seen further improvement in the public health and regulatory environments, which has allowed us to relax COVID-related protocols and align us more to the rest of the hospitality industry. Last month, the CDC discontinued its voluntary COVID-19 program for cruise ships. This was a strong signal of confidence by the CDC that the industry's COVID-19 mitigation and management plans are robust and effective. This very positive development has paved the way for us to begin removing barriers for our guests.\n\nWe're committed by local regulations, bringing us not quite an equal footing with land-based vacation and leisure alternatives, but significantly closer. Just yesterday, we announced a number of changes to our own health and safety protocols, which are effective September 3, and as always, are subject to local regulations. We will no longer have a mandatory vaccination requirement in any of our ships and have relaxed testing protocols regardless of sailing length. To put it simply, vaccinated individuals, including those embarking on NCLH ships from U.S.\n\nports, will no longer have any pre-cruise-related protocols. And those who are unvaccinated or choose not to provide proof of vaccination will be required to test negative within 72 hours prior to embarkation. In addition, all guests 11 years old and younger will be exempt from vaccination and testing requirements of any kind. There remain a few jurisdictions with strict requirements, including Canada, Greece, and Bermuda where we will continue to comply with local mandates.\n\nThese modifications or protocols are meaningful and give us additional flexibility to reach a wider cruising population, reduce friction and travel-related hassles for our guests and bring greater variety to our itineraries. In fact, yesterday's announcement was an instant catalyst, resulting in one of our top three best booking days of the year. Our top priority remains the health, safety and well-being of our guests, crew and communities we visit. And this commitment to -- is unwavering even as we are evolving our SailSAFE protocols to adapt to the changing public health environment.\n\nAcross the globe, we continue to see the easing of travel restrictions and reopening of ports to cruise, bringing us closer to a normal operating environment. One significant example of this easing is the lifting in June of the onerous one-day testing requirement to enter the U.S. While the decision was too late to have a meaningful impact on ship sailing in a second, and to a lesser degree, third quarters of this year. The change resulted in an immediate and sustained boost in booking volumes for future periods in the weeks following the announcement.\n\nSecond, and despite recession and economic slowdown fears abounding in the broad marketplace, we continue to see a strong upmarket consumer, with booking trends continuing to show steady improvement week-over-week, which I will touch on in more detail later in the call. But at a high level, to evaluate the extent and willingness of consumers to spend on cruise travel, we typically monitor two key indicators. First is the booking window, which provides a peek into the consumer psyche about the future, given that cruise is a long lead time and relatively high ticket purchase. To be clear, we have not seen any cracks emerge in the dynamics of the booking window.\n\nAnd it remains both within historical range and our own expectations. Second is our onboard revenue generation, which is a real-time now indicator of how our guests are feeling about their financial situation right now and while onboard our ships. Onboard revenue generation has continued to be impressive, even as we continue to ramp up occupancy carrying more guests across all ships and cabin classes. In the second quarter, onboard revenue per passenger cruise day was approximately 30% higher than during the comparable 2019 period.\n\nWe continue to focus on enhancing our market-leading bundled offerings and increasing quality touch points with our guests starting from the time of booking to capture even more revenue pre-cruise, allowing guests to arrive on board with an ever fresher wallet, which ultimately results in higher overall spend. In fact, our pre-cruise revenue on a per passenger day basis for second quarter '22 is up over 50% versus 2019 levels. At a high level, guests who make pre-cruise purchases tend to spend approximately double that of guests who do not pre-book onboard activities. And while the broader economy has experienced a pullback in consumer spending for physical goods, we continue to see strong propensity for spending on travel and experiences, particularly from the affluent consumer.\n\nHotel average daily rates and airline fares remain at or near record levels, with occupancies reaching pandemic peaks. Consumers want a vacation even during economic downturns. And we believe cruises are much better positioned than land-based alternatives to capture the strong demand given our unmatched value proposition. While consumer appetite for experiences bodes well to the entire cruise industry, we believe our company in particular is best positioned to outperform in this environment.\n\nOur three brands focus on providing upscale experiences relative to their respective industry categories, and therefore, skewed toward the higher-end consumer, which while not immune, have proven more resilient than other cohorts in previous downturns. And all indications are that the intent to travel for this demographic has not abated. The last and arguably most exciting catalyst I want to touch on is our attractive pipeline of new builds, outlined on slide five, which will greatly enhance our already world-class fleet and drive significant contributions to the top and bottom line. I just came back from Italy last week where we took delivery of Norwegian Prima, the first of six next-generation Norwegian Cruise Line ships, bringing our total fleet to 29 vessels with approximately 62,000 berths.\n\nWe are excited to celebrate her christening ceremony later this month in Reykjavik, Iceland. And I encourage all of you to experience her firsthand as she is truly incredible. In fact, our shipbuilding partners, Fincantieri, has said Prima is the clients' most demanding and most complex vessel they have ever built. The Prima Class marks an evolution for Norwegian Cruise Line as every aspect of the design and guests' experience has been elevated.\n\nLast week, we also celebrate the float-out Norwegian Viva, the second vessel in this groundbreaking new class, which is expected to debut in summer of 2023, as seen on slide six. The Prima Class will further differentiate Norwegian Cruise Lines compared to our cruise peers and reinforce the positioning of our brands as the leaders in providing upscale experiences in each of the major cruise categories. In addition to the new Norwegian vessels, we are also gearing up for the delivery of Oceania Vista in spring of '23 and Regent Seven Seas Grandeur later that year. These new additions will further add to our dominance in the flourishing upper premium and luxury segments.\n\nI often get asked whether we are confident that we can profitably absorb the capacity growth we are expecting for the next few years. And the answer is a resounding yes. Given our relatively small base of only 29 ships, we still have many unserved and underserved markets around the world. We are continually innovating and enhancing our product offerings through our new builds and refurbishment upgrades to our existing fleet and making enhancements to our bundled offering to provide even more value and attract even more high-paying guests to our brands.\n\nI can't emphasize this enough. So I will show you once again on slide seven, how we've proven our ability over the years to absorb capacity and deliver outsized revenue, adjusted EBITDA and operating cash flow contributions relative to our capacity growth, and we fully expect to continue this trend. Turning now to our booking demand and pricing trends summarized on slide eight. We continue to see sequential improvement as we remain disciplined and focused on laying the foundation for a record 2023 and beyond.\n\nIn the second quarter, our load factor was approximately 65%, in line with our expectations and a significant improvement versus the prior quarter of 48%. We expect load factors to increase to the low 80% range in the third quarter, with July already coming in at 85%. This steady sequential ramp is expected to continue until we reach historical 100%-plus levels beginning for the second quarter of 2023. In terms of pricing, as you can see on slide nine, our net per diem growth in the first half of 2022 over the first half of 2019 pricing was significant at 18%.\n\nThese results are consistent with our strategy of holding firm on our go-to-market strategy, outlined on slide 10, of market to fill versus discount to fill and maintaining pricing integrity by emphasizing high value over low price. We absolutely believe this is the optimal path to continually deliver high-quality and sustainable profitability once we return to a fully normalized environment post-pandemic. As expected, our second half 2022 book position remains below, an extraordinarily strong 2019, driven primarily by the lasting impacts of Omicron and the Russia-Ukraine conflict. That said, pricing for the second half of 2022 continues to be higher when compared to 2019, even when taking into consideration of the dilutive effect of future cruise credits and the impact of premium priced Baltic itineraries from the Ukraine conflict, which is primarily concentrated in the third quarter.\n\nAs we move beyond this transition year and focus on 2023, our full year book position is in line with 2019's record performance. And our booking pace in recent weeks has reached the level needed to consistently sail full. Pricing is also significantly higher for 2023. And while we typically would not provide this level of detail, our performance in this area is so extraordinary that I just had to share it with you this one time.\n\nPricing for 2023 is currently running in excess of 20% above 2019's record pricing and is higher by double digits across all three brands. And while pricing will naturally tend to level off as we continue to build our book for 2023, it is nevertheless a testament that our steadfast strategy of focusing on long-term price increases over short-term load factors is indeed working as intended. Another onetime proof point that I will provide is ticket sales already on the books for 2023 sailings. When compared to the same time in 2018 for 2019 sailings and taking into account capacity growth of approximately 20%, 2023 sales are a whopping 40% higher.\n\nIn addition, the quality and stickiness of our ticket sales for '23 sailings is also expected to improve, as a significantly higher proportion of bookings, four times the level seen in 2019, include air travel booked through our own air program, which in the past has proven to be indeed stickier. Another positive indicator demonstrating strong consumer demand is our advanced ticket sales bill. As you can see on slide 11, our advanced ticket sales balance stood at $2.5 billion as of the end of the second quarter, up over $300 million versus the prior quarter despite approximately $1 billion of revenue recognized. This represents an all-time record-high ATS balance for the company.\n\nOn a gross basis, advanced ticket sales build increased by over 40% to $1.5 billion in the quarter, the highest level in three years. In addition, approximately $1.5 billion of the total ATS balance at quarter end is associated with bookings that are already within the final payment window, and therefore, subject to cancellation penalties. The bottom line is that our entire team is more energized now than ever before. We are striving to reach our goal of record net yields and record adjusted EBITDA in 2023, welcoming eight additional ships to our fleet through 2027 after Prima this year and leveraging all opportunities to maximize value for our stakeholders.\n\nThis will not be an easy feat, especially as we continue to navigate an uncertain macroeconomic, but an increasingly encouraging public health and regulatory environment. We are prepared for all scenarios. And I'm confident that we are taking the right steps today to set us up for future success. I'll be back with closing comments a little later.\n\nBut for now, I'll turn the call over to Mark for his commentary on our financial position. Mark?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nThank you, Frank, and good morning, everyone. Before I begin my commentary on our financial results and outlook, I would be remiss if I did not take a moment to thank our team of nearly 35,000 team members across the globe for their continued dedication, passion and commitment to excellence. Their collective efforts are propelling us forward as we continue to execute on our operational and financial recovery plan. We have made tremendous progress to date, which has led to the significant financial inflection point of generating positive operating cash flow in the quarter for the first time since the start of the pandemic.\n\nTurning to our second quarter results. During the quarter, we returned our full fleet back to service with the relaunch of Norwegian Spirit in early May. Our load factor for the quarter was 65%, in line with our prior guidance, which reflects our methodical approach to ramping up occupancy while maximizing pricing. Numerous sailings across key regions and markets achieved over 90% and 100% occupancy, with particular strength in recent months in the Caribbean and Bermuda markets.\n\nWe continue to expect sequential quarterly increases in occupancies, with load factors returning to historical levels for the second quarter of 2023. Strong ticket pricing and onboard revenue generation drove total revenue per passenger cruise day in the quarter up approximately 20% versus 2019. As we look to the third quarter, we expect this metric to increase by high single digits compared to 2019 levels. This is impressive considering the impact in 2022 of the Russia-Ukraine conflict on premium-priced European, in particular, Baltic, itineraries, which are heavily weighted to the third quarter.\n\nAs a reminder, three ships were redeployed entirely as a result of the conflict, including one for each brand, and a total of 60 sailings across our fleet were canceled or modified. In addition, crew-related capacity constraints on the high-yielding Pride of America are a further headwind to overcome. Turning to costs. Like every company across the globe, we continue to experience pressures from inflation and global supply chain constraints.\n\nFuel prices remain a headwind, but our hedge program, as seen on slide 12, provides partial protection. And more recently, we have also seen prices beginning to moderate. We have opportunistically added to our hedge position during the quarter and are now approximately 40% hedged for the remainder of '22 and approximately 30% for 2023. We are also experiencing pressure on food costs, although we have recently seen green shoots, prices moderating for certain commodities, such as beef and pork.\n\nIn addition, we are starting to see shipping and logistical costs moderating from their highs experienced in 2021 and early '22. Our supply chain and logistics teams continue to work around the clock to find measures to minimize this impact. Lastly, in the first half of 2022, we continued to incur additional costs associated with our COVID-19 health and safety protocols, primarily related to testing. As the industry continues to align its protocols with the broader travel and leisure space, we expect these costs to ramp down in the future.\n\nTaken together, we expect adjusted net cruise cost, excluding fuel per capacity day, to decrease approximately 10% in the second half of 2022 compared to the first half. Guided by our core market to fill strategy, we will continue to make disciplined demand-generating investments in marketing in the near term, with a focus on laying the foundation for a strong 2023. Looking ahead, while it is still too early to provide concrete guidance, we expect net cruise costs, excluding fuel per capacity day, in 2023 to exceed 2019 levels. Aside from the fact of three or four years of both normal and now hyperinflation, remember that we have the youngest fleet of the major operators.\n\nWe have not disposed of any ships during the pandemic, and therefore, will not receive the unit cost benefit from the removal of less efficient capacity. To help with modeling, we have also provided additional guidance on key metrics, like capacity days, revenue expectations depreciation and amortization, interest expense, fuel consumption and capital expenditures. All of which can be found on slide 13. Shifting to our financial performance.\n\nSlide 14 lays out the key financial milestones already achieved, as well as our expectations for the upcoming quarters. As previously stated, we generated approximately $260 million of operating cash flow for the second quarter after first turning positive for the month of March. Given that just over a year ago, we were just beginning the herculean task of returning our ships to service after 500 days on the sidelines, this is no small accomplishment. The next milestone we are aiming to achieve is slightly positive adjusted EBITDA for the second half of 2022, leading to positive adjusted free cash flow for the fourth quarter.\n\nAll of these stepping stones are consistent with our return to service plan and position us extremely well for 2023, where a return to a more normal operating environment, along with our focus on pricing discipline, is expected to lead to record net yields and record adjusted EBITDA for the full year. Moving to liquidity and our balance sheet. Our overall liquidity position remains strong, totaling approximately $2.9 billion at quarter end, which consisted of cash of approximately $1.9 billion and an undrawn $1 billion commitment. This existing $1 billion commitment, originally entered into in November 2021, was recently extended through March 2023.\n\nWe have been clear that we view this facility as a backstop, and we currently do not intend to draw on it. However, given the volatility in the capital markets in recent months, we felt extending the facility was the prudent choice to enhance our financial flexibility. Based on our current projections and trajectory, we continue to believe we will be able to meet our liquidity needs organically. Slide 15 demonstrates the result of the proactive and deliberate measures we undertook throughout the pandemic to optimize our debt maturity profile.\n\nWe resumed debt amortization payments in April, which were previously deferred during the pandemic. For the remainder of 2022 and for full year 2023, we have approximately $500 million and $900 million of debt payments coming due, respectively. The vast majority of which is related to our export credit agency-backed ship financing. While on the surface, 2024 maturities appear high, approximately $2.4 billion is related to our operating credit facility, consisting of our revolver and term loan A.\n\nBoth of which we expect to refinance well prior to maturity. This positions us well as we continue to ramp up and return to a more normal operating environment. For additional detail on the breakdown of our upcoming debt payments through 2027, we also provide a detailed schedule on our investor relations website. After taking delivery of Prima less than two weeks ago, with fixed rate financing that was secured back in 2017, our debt portfolio is approximately 75% fixed rate today.\n\nThis fixed rate -- fixed ratio is expected to increase to approximately 80% by year-end 2023, with the addition of three new builds next year, positioning us well in a rising rate environment. The weighted average cost of debt for the portfolio is approximately 5%. We took out, as a reminder, all of the high-cost double-digit debt we incurred during the pandemic at an opportune time prior to the current dislocation we are seeing in the markets by completing balance sheet optimization transactions in November '21 and February 2022. Turning to slide 16.\n\nAs I've said this before and will repeat it today, we believe the transformational growth we have in the pipeline over the next few years, representing 50% growth in capacity by 2027 as compared to 2019, is an underappreciated component of our company's investment thesis. Our new ships have very favorable and efficient financing structures, resulting in an expected and immediate boost to profitability. For all new builds on order, our financing is committed at fixed rates averaging approximately 2.5% over the portfolio. To help you better understand the mechanics of the cash inflows and outflows associated with the new ship, slide 17 lays out an illustrative scenario demonstrating the typical timeline.\n\nIn general, approximately 20% of the ships cost is due in four installments tied to various milestones preconstruction beginning at contract signing. Typically, 80% of the cost is then due upon taking delivery of the ship. However, while this looks like a large capital expenditure outlay in the financial statements, we also received very efficient export credit agency-backed financing at the same time. This ECA-backed financing covers approximately 80% of the ship cost, which, as I mentioned earlier, is committed prior to contract signing and at extremely attractive rates.\n\nIn certain cases, we also structure predelivery financing in order to better map the timing of cash flows. Amortization payments on this deck began six months after delivery of each vessel and continue over 12 years. An often overlooked but incredibly important facet in the cash flow mechanics of a new build timeline is that well prior to a delivery of a vessel, we are already receiving significant cash inflows in the form of advanced ticket sales and onboard presales. Given that final payments from our guests are typically due 120 days prior to a sailing, this is when the cash engine begins to come to life.\n\nAs a rough estimate, we typically receive in the range of $100 million to $150 million of cash inflow from future bookings prior to a vessel's first revenue sailing, resulting in a cash infusion into the business that continues to build over time as final payments for future voyages also become due. So while we often hear concerns surrounding the industry's capacity growth, we welcome and are excited for new capacity we have coming online. We have a high degree of visibility into the supply chain, supply pipeline for the industry, with only four major shipyards globally who can build cruise ships of scale. This, coupled with the incredibly efficient cost and financing structure of the new builds are a unique differentiator for us and the industry at large.\n\nSo in summary, I am pleased with the progress we have made so far, but more importantly, how we have positioned our company for the future. While there continue to be challenges facing our business and we are keeping a close eye on how the macroeconomic environment evolves, we also have significant tailwinds, including a continued post-pandemic return to normalcy and the industry-leading capacity growth that I just discussed. All of which bode well for our future prospects. With that, I'll turn it back over to Frank for closing comments.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nThank you, Mark. And before we wrap up our prepared remarks, I'd like to provide an update on our global sustainability program, Sail & Sustain, which slide 18 outlines key accomplishments and milestones. Since we last spoke, we published our second annual comprehensive ESG report and SASB align disclosure on World Oceans Day in June. The report highlights our progress and commitments on our top ESG priorities.\n\nAs we strive to provide critical transparency to our stakeholders this year, we focused on expanding and improving the data disclosed in our report, including expanding Scope 3 greenhouse gas emissions reporting, providing climate risk and resiliency data through our TCFD assessment, and strengthening human capital disclosure, including with data related to diversity, as well as training and development. We also increased the scope of our third-party assurance to include many of these new data points. Earlier this year, we also announced that we are pursuing net zero greenhouse gas emissions by 2050. This ambition spans our entire operation and value chain as we aim to bring all of our key partners along with us on this important journey.\n\nAs we have said previously, a key driver to achieve our net zero ambition is the development of alternative fuels along with the associated critical infrastructure at destinations globally to support the creation, distribution, storage and usage of these fuels. Methanol is one of the fuels we are actively exploring. And we recently joined the Methanol Institute to collaborate, share and adapt solutions alongside the institute's members of methanol producers, distributors and technology providers. We will continue to evaluate a variety of alternative fuels and share learnings with other companies as we collectively try to find a viable long-term solution.\n\nAnd before I turn the call over to Q&A, I'd like to leave you with some key takeaways that you can find on slide 19. First, we continue to execute on our return to service plan and are achieving key milestones as a return to normalcy. The improving public health and regulatory environment, including our recent relaxation of testing and vaccination protocols, are a tailwind. And our entire team is focused on setting the stage for long-term sustainable profitability in '23 and beyond.\n\nSecond, we are seeing a strong consumer with a healthy desire to spend on travel and experiences, particularly in the upscale demographics, our brands' target. This strength is demonstrated by our improving booking trends, robust pricing and strong onboard revenue generation. Lastly, we are excited for the transformational and highly profitable growth we have in store over the next five years as we welcome eight additional ships to our fleet after Norwegian Prima. We've covered a lot today, so I'll conclude our commentary here and open up the call for your questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Dan Politzer with Wells Fargo. Please proceed with your question.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nHey. Good morning, everyone, and thanks for taking my questions.So you guys certainly had some positive commentary on 2023. I think, Frank, you gave the first time -- the sales are pacing 40% higher than this time historically. I'm just trying to bridge to 2023 EBITDA, which you said is going to be a record.\n\nDoes that assume pricing is going to continue to accelerate? Or is that more of a function of cruise costs moderating from that second-half pace which you guys have set?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nDan, and welcome to the cruise industry. Look, I think it's everything. I think we're going to see occupancies return to normal levels. We expect that to begin certainly by second quarter of '23.\n\nWe expect pricing to be higher in '23 than 2019. We have more capacity -- more high-price capacity. Remember, in 2019, we took delivery of Encore literally in the last few weeks of the year. We had no contribution from the Regent Splendor, which was delivered in February of 2020.\n\nBoth of those vessels will have a full year in '23. We'll have a full year of Prima. We'll have roughly seven months of Vista, six months or so of Viva and a little bit of grandeur toward the end. So we've got new ship deliveries that are extraordinary, high-priced.\n\nWe have -- as of today and trending better every day. I really think that our announcement yesterday of relaxing protocols is really going to be a tailwind. We saw it instantly yesterday, and it accelerated throughout the day. Today is also gangbusters compared to a typical Tuesday.\n\nThe last thing we have control over is overall inflation. But if you believe the experts, and we are seeing, as Mark mentioned in his prepared remarks, some green shoots, where costs are already coming down, including fuel, including food costs, that's strong. And so, today, we sit here telling you that we have record load, record pricing, record capacity days that we're absorbing very easily. And therefore, we strongly believe that we will have a record net yield in '23, which results in record EBITDA.\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nAnd Dan, just to highlight, further to what Frank's saying, it's not only the top line growth and the profitability of the new ships we have coming online, we are focused on costs. Obviously, 2022 has been a very lumpy year. It will continue to be a bit lumpy for the second half given where our load factors are expected to be. You have to remember that a lot of our costs are fixed in nature.\n\nSo when you look at it on a unit basis, yes, they are a little bit higher in the second half in -- for 2022. But, again, we expect normalization of that as we go into 2023. And we've stated very clearly, we are spending dollars on demand-generating initiatives, i.e., marketing, building a very strong 2023 book across the board. So we're making the investment today.\n\nWe're not chasing the incremental load factor for next quarter. We are focused on a very profitable, high-yielding, lower cost 2023, which we believe will result in a record EBITDA year next year.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nGot it. And then, just for my follow-up. For the third quarter, I know you guys have talked about pricing tracking up high single digits. Any additional color, or if you could unpack that, just given, obviously, Europe, I would assume is a headwind this year.\n\nSo to the extent you've seen strength in other regions, just kind of a lay of the land would be helpful.\n\nFrank Del Rio -- President and Chief Executive Officer\n\nYes. Look, Alaska is very, very strong. Our Caribbean product is also selling well. We took a large vessel out of the Baltic, very last minute, repositioned to Port Everglades, which she's doing very, very well.\n\nBermuda is doing great. Europe isn't doing all that back considering what's going on over there with the Ukraine conflict. We are leaning more on European source business, which typically underperforms in terms of both ticket price and onboard revenue. And still, overall, our yields are better in Q3.\n\nSo I think we're going through, like Mark mentioned, some lumpiness. We've had protocol situations that are improving. The elimination of the testing requirement to get back into the country was huge. Americans simply didn't want to take the chance to be stuck in Europe should they contact COVID.\n\nThat's had an impact over the short, medium term. Remember, one of the wonderful things about the cruise industry is you have great visibility because of the booking curve, people book way in advance. So when these things occur, it impact the short term, which is why we simply don't want to chase short-term occupancy at the expense of long-term pricing. Pricing has a long tail.\n\nThe occupancy, the load factor of any given sailing, once it's -- that sailing is finished, it's finished. It has no impact on the long run or no cumulative impact. But pricing does. So for us, it's incredibly important, especially since we target that high-quality, high-paying consumer to maintain pricing discipline, as you can see, across the board to be up in pricing, 20% for 2023 is truly extraordinary.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nGot it. Thanks so much for all the color.\n\nOperator\n\nOur next question comes from the line of Brandt Montour with Barclays. Please proceed with your question.\n\nBrandt Montour -- Barclays -- Analyst\n\nHey, good morning, everyone, and thanks for taking my questions. So maybe just on the back of that, and apologies for the -- to the near-term question. I feel like I'm splitting hairs a little bit here. But when I look in your deck now versus last quarter, it looks like the back half in terms of when you sort of were looking for positive adjusted EBITDA, may have down shifted a little bit.\n\nAnd I think maybe you just covered it, Frank, in talking about not giving up occupancy for price. But I want to know if there was anything else in there that you just weren't really expecting three months ago that maybe impacted that?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nNo, I don't think so. It's just the cumulative sustained lasting issues on -- related around Omicron. It's only been in the last six weeks that, number 1, the Biden Administration took down the requirement to test negative to get back into the U.S., No. 1.\n\nNo. 2, the CDC dropping the cruise guidelines, which occurred about three weeks ago. And just yesterday, us announcing the relaxation of our own protocol. I think those three items, each one of them had a positive impact on bookings.\n\nAnd as we said in our prepared remarks, each one of those events triggered an improvement in booking volumes. But remember, booking -- the booking curve on average is about seven months out. So when you say that all this happened around midyear, whether it was late June, mid-July, now early August and you look seven months into the future, that's where you get, you get to 2023. We could -- we could like others chase short-term occupancy and sell cruises for crazy prices, but we don't want to do that.\n\nWe never have done that. That is not our strategy. I remind you what happened back in '08 and '09, when the Great Recession, certain cruise companies did drop their prices to ridiculous levels. And it took them, in some cases, 10-plus years, and in some cases, they've not yet reached those pre-Great Recession yields.\n\nI'm not willing to mortgage the company for 10-plus years in order to window dress the next quarter results, just won't do it. We're here for the long term. We're managing the business on a long-term basis. COVID had a major impact.\n\nWe were shut down for 18 months or so. And the recovery is not instant mash potatoes. If you want instant mash potatoes, you got to go elsewhere because we're here for the long run. And our pricing strategy, how disciplined it is proof of that.\n\nTo be -- to have 40% more ticket sales on the books right now compared to 2018 despite a 20% increase in capacity is formidable. And I've been doing this for 30 years. I've managed cruise companies in good times and in bad times, that I am convinced, beyond a shadow of a doubt, that you don't sacrifice the long-term pricing power of your brand in order to achieve short-term load factor gains.\n\nBrandt Montour -- Barclays -- Analyst\n\nThanks for that, Frank. We don't like instant mash potatoes either. And maybe just a quick modeling question on -- from -- in terms of gross revenue, you gave us a little bit of guidance for the 3Q. And I was just curious if you could just walk us through that to sort of net revenue per PCD.\n\nAnd the only reason I bring that up is because it looks like the commission in transportation line in the 2Q was a little bit elevated. I don't know if that was a higher flight costs that you guys are passing through or whatnot. But maybe you can unpack that a little bit for us?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nBrandt, it's Mark. So yes, when you compare our gross in Q2 versus Q1, you will see -- gross to net, you will see a slightly elevated cost structure. And that's going to be representative of more of the ongoing cost structure. I think Q1, given all the dynamics where we had many sailings, many cancellations, we had quite a bit of ancillary revenue coming through in the gross line, which may have bumped up the next, so to speak.\n\nBut as we stated in our prepared remarks, we have now embarked on our air program that we've been working on for many years. So you are starting to see the costs of that come through. And so, I think you're going to see these more -- these are going to be the more norm level, so to speak. But it's coming through in both the gross.\n\nAnd obviously, when you look at the net, and again, considering the fact that in Q3, we were heavily weighted, particularly in Europe, and we're still having very strong pricing, I think it's a pretty impressive result.\n\nBrandt Montour -- Barclays -- Analyst\n\nPerfect. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from the line of Steve Wieczynski with Stifel. Please proceed with your question.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nHey, guys. Good morning. So one of the questions we've gotten a bunch this morning, and Frank, you've already talked a little bit about this, but it's the change in the '23 book position today versus kind of where you were back in May. And obviously, pricing has actually improved a good bit, but the level of bookings have potentially flowed a bit.\n\nAnd I would assume this is all going to stem from your go-to-market strategy, which you've already discussed a lot. So, I guess, the question here is, should we expect moving forward that pricing should continue to basically push north, but we, us, investors have to be prepared that the book position could get moved around more than what we've been accustomed to in the past? And then the second part of this question also, if you guys could -- I don't know if you will give this or not, but give us a sense of where you think you'll turn the calendar year in terms of being booked for '23 versus where you would be historically?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nSteve, there was a lot there in your question, so I'll try to remember it all, remind me if I miss something. You can't be ahead significantly forever, because at some point, the timelines converge. So we're very, very pleased where we are today for 2023 in terms of cumulative book position. As the calendar goes forward and we get closer to '23, I would expect us to stay more or less where we are today.\n\nBecause if you recall, back in 2018, I think it was -- this very call in early August, where I said we had now reached the optimal balance between advanced bookings and pricing. If you book too fast, you leave money on the table. If you book too slow, you'll pay the price later by having to discount to fill, and we don't want to go there. So we're very happy with the pace that we're at.\n\nWe don't want to accelerate it much more than we have. We're instead focusing on price. We think that the tailwinds that I described so far this morning is going to help. But we don't want to be ahead any more than we are today because we had reached that point in '18 where we thought we were optimum, and we want to maintain it.\n\nIt all has to do with the booking curve and different itineraries. So I'm pleased where we are today. Not looking to push load factors, to accelerate load factors, although, again, I do believe that two or three tailwinds that we discussed this morning are going to have a natural tailwind to bookings. Did I miss one of your questions, Steve?\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nNo. That pretty much covers it all, Frank. And then, the second question actually is going to be probably for Mark here, and it's going to be a liquidity question, which I'm sure you're tired of talking about. But Mark, I fully understand your comments you made in your prepared remarks, that we've seen some -- but at this point, we've seen some of your competitors say their liquidity profile was fine.\n\nAnd the next thing you know, we turn around and see them raise equity or do some kind of debt deal. So I just -- I want to be clear here that -- and I know we can never say that -- we shouldn't expect any type of dilutive raise over the near term given I think you said your cash flows at this point should be able to take care of pretty much all your near-term maturities.\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nSteve, yes. So look, based on everything we see today, and I'll repeat it again, we believe we can meet all of our liquidity needs organically. What you've seen from some of the competitors and more recently was really around refinancings of more near-term maturities. And specifically, what I called out in my prepared remarks is that was something we were focused on over the course of the pandemic.\n\nSo as you look at our maturity power and if you put aside the -- our normal operating facilities, our revolver and our term loan A, which we plan to amend and extend by the end of this year, we have a very clean path during our recovery. So with that, we still have debt capacity should we need to go to the markets. We have no plans on raising liquidity via equity. We've said that before.\n\nWe've diluted our shareholders enough through this pandemic. So we feel good where we are, and we'll continue to watch that. But more importantly, we have a relatively clean path going forward. So we feel good today.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. Very clear. Thanks, Mark.\n\nOperator\n\nThank you. Our next questions come from the line of Patrick Scholes with Truist. Please proceed with your question.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nHey. Good morning, everyone. With your pricing strategy, and I completely understand the rationale for that, but I wonder how much does the current staffing market play into perhaps giving up some occupancy but holding pricing. And I relate this to some news that just came out with Diamond Princess canceling some itineraries due to not enough staffing.\n\nSo again, how much does -- possible issues with staffing play into that strategy? And also maybe just some -- if you could give us just an update on the general staffing environment for you folks?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nYeah. Patrick, this is Frank. Look, the internationally sourced crew that makes up the abundance of our staffing on board, it's pretty back to normal. Quite frankly, I was surprised to see what you mentioned happen to another company.\n\nBut we're not immune to it. We have challenges in that area that -- but it's not keeping us from filling the vessels, except for one, and that's Pride of America, which as you know is the only American flag vessel that requires us to have 75% of our crew to be American citizens. And we are having issues sourcing labor and crew for that vessel. And that vessel, which unfortunately is also our highest yielding vessel at the Norwegian brand.\n\nWe've purposely kept the load factor since she's returned to service at 40%. So would our overall load factors be higher in Q3 and Q4? Yes. And pricing would be higher. But we're purposely keeping it at that lower level because of labor shortages.\n\nWe believe we have a road which, by year-end, we should see that vessel return to full occupancy. Certainly, the demand is there. It's disheartening every time we have to go and cancel and -- people who are booked and expect to go, and we have to keep that load factor in the 40% range. But that's around the edges.\n\nAnd like I said, we expect to be back at 100% occupancy on that vessel by year-end.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next questions come from the line of Vince Ciepiel with Cleveland Research. Please proceed with your question.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nGreat. Thanks for taking my question. I wanted to -- kind of the cost perspective from maybe a different angle. Obviously, a lot of puts and takes here, with restart costs, maybe some pull forward of marketing, and you have elevated fuel prices to deal with as well.\n\nYou go back to pre-COVID, the business was pretty well dialed in with EBITDA margins in the low 30s. And as you're thinking about the business longer term and planning for years ahead, and maybe you just assume that fuel prices at some point get back to what I'll call more normal range, is there any reason to think that margins don't get back to the neighborhood that they were before? I guess another way of asking it is, has something changed in the relationship between operating costs and the pricing that you're seeing out in the market today?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nVince, so the short answer to your question is no. While we are seeing some near-term headwinds with the cost pressures like every other business is seeing, longer term, we still believe that we have a very strong operating leverage. And the simplest example of that is it's almost a two for one relationship. Every point of yield is generally two times a point of cost in terms of monetary value.\n\nSo we still believe that to be intact as we look out into 2023. Obviously, it's very early to give any sort of concrete guidance around that. But apart from taking -- when we look at 2022, and internally, we try to normalize what the cost structure is, you have to remember that we have the full burden of cost today, yet we don't have the full complement of passengers on board. We're doing that purposely.\n\nSo when you look at the metrics, like I said earlier, it's lumpy. But as you look into '23 and then beyond, that operating leverage is fully intact, setting aside fuel, which we think we've mitigated reasonably with our hedge program. But we think there's a very, very real near-term path to getting back to historical margins. We just have to be able to operate consistently, operate our vessels at historical load factors, which we said we expect to be doing for second quarter of 2023.\n\nAnd I think you're going to start to see the normalcy appear very quickly.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nThat's really helpful. And maybe separately, on the bookings commentary, it sounded really encouraging with sequential improvement, a record day yesterday, a strong morning. And just thinking about the occupancy guide for the third quarter. And I guess less short-term focus, but maybe more of an update on where the booking curve is at.\n\nCan you help us understand where close-in bookings are versus where they are historically and where the booking curve is at from a length perspective?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nThere's a lot there as well, Vince. Look, historically, the booking curve at the edge level, knowing that each brand has slightly different nuances, it's about seven months. And today, it's slightly more elongated than that, I would say, closer to nine months, primarily because of our focus on 2023 bookings versus 2022. If you gave me a choice of selling a cabin or a booking for a '22 departure versus a '23 departure, I'll take a '23 departure.\n\nSo our marketing is all geared toward 2023. We'll take '22 bookings, of course. But we're not pushing it. And certainly, we're not discounting to attract that kind of business.\n\nWe believe investors are focused on '23 and beyond and not necessarily '22. So for us, '22 is a transition year. We're very pleased that we got the entire fleet operating. We're very pleased we took delivery of Prima.\n\nWe're very pleased that we've now turned cash positive. But in terms of pedal-to-the-metal focus, getting back to normal on margin, on yields, on EBITDA, on profitability, it's all about 2023 and beyond.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next questions come from the line of Robin Farley with UBS. Please proceed with your question.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thank you. Most of my questions have been addressed already. Just one on -- so much of your maturities in the next 18 months look like they're ECA-related.\n\nAnd I wonder if you could talk about the potential there for those to be extended or pushed back in some way without you having to go to the capital markets and borrow for that?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nRobin. Look, our ECA and all of our lenders have been phenomenal over the pandemic and really -- have been really flexible. But they too are commercial organizations, right? So while we're going to work -- continue to work closely with them, first and foremost, as I've said, we believe that we can meet all of our needs -- liquidity needs organically. We have 20% more capacity coming online next year, which is driving significant growth.\n\nAnd so, as we'll look -- as we look forward, if there are any near-term significant headwinds, we're going to look at all the options that are available out there. I would not want to point specifically to the ECAs or any other lender, but we're going to look at all options. And as we've seen in the past, I think there's a strong tailwind, so to speak, to make sure that the industry is thriving. So -- but more importantly, we don't think we need to do that.\n\nWe don't think the industry needs to do that. And the industry is recovering. Let's keep in mind where we were this time last year. We were just starting to operate.\n\nAnd a year later, over the course of time, we are now turning positive cash flow. We're generating positive EBITDA. So the machine has started and the flywheel is going. We just have to let it keep percolating, so to speak.\n\nSo we feel good. But look, we're going to look at all options should the need ever arise.\n\nRobin Farley -- UBS -- Analyst\n\nOK. No. Great. That's helpful.\n\nAnd then, just one clarification as a follow-up. You talked about onboard revenue being 30% higher, I think, it was compared to Q2 '19, which is a remarkable increase. Can you talk about how that's bundling? Do you have a higher percent of bundling in than you did in Q2? Or kind of what adjustment is in there for the fact that -- some of that, I guess, is like in ticket price that you kind of allocate to onboard revenue for accounting purposes versus -- or is that 30% increase just purely what is spent once people get on board?\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nWell, it's certainly generating from what we're seeing on today's consumer, what they're spending on board. I will remind everybody on the call that we have been bundling now probably since late 2016, 2017. We started that in the industry. So our numbers on a comparable basis are relatively clean.\n\nThere's always some nuances between the two buckets. But we are not having any sort of any apples and oranges comparison in our '22 versus 2019 results. So we raised -- as we've said, we've raised prices. In terms of all of our offerings on board, consumers are spending.\n\nWe've gotten smarter in the pre-marketing of our products, creating that sense of urgency before the consumer steps on board. We talked about the consumer who -- those consumers who have a stronger propensity for presales, they also spend more, about 30% or 40% more once they're on board. So it's a combination of all those. But the numbers are strong.\n\nWe're seeing a strong consumer today, spending today's dollars. And we feel that bodes well for ourselves and the industry.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. OK, great. Thanks very much.\n\nOperator\n\nThank you. Our next question comes from the line of Jaime Katz with Morningstar. Please proceed with your question.\n\nJaime Katz -- Morningstar -- Analyst\n\nHi. Thanks for squeezing me in. I guess, my question primarily is around sourcing strategy and maybe how you guys have altered that given the weakness that we've been hearing in European consumers and how you're using that as a competitive advantage. And then, just any details you have on marketing plans ahead of the Wave season given the strong demand that you're seeing?\n\nFrank Del Rio -- President and Chief Executive Officer\n\nYeah. We're not going to share with you our marketing plans for Wave. I do believe that this coming Q1 will be the first true Wave since 2020, which was cut short by the beginning of the pandemic. In terms of sourcing, look, we prefer an American consumer onboard all our vessels regardless of where the itinerary is operating.\n\nAmericans book earlier, book a higher cabin category, and as Mark mentioned, spend more money on board. And that is still our basic go-to-market strategy. But for European sailings, partly because of the hesitancy by many Americans to travel to Europe until the mandate to test negative to come back to the U.S. is lifted, we leaned a little heavier on our European sourcing.\n\nOur European sales and marketing team did a fantastic job of accelerating demand from European marketplaces. But pricing suffered a bit. And in spite of that overall pricing suffering a bit, we still posted higher pricing in Q2, expect higher pricing in Q3, going forward. So I think overall, the European consumer has improved a bit or we've done a better job of sourcing those high-quality consumers out of Europe like we do in the States.\n\nBut make no mistake, we rely on the American consumer perhaps more so than others, because at the end of the day, we think they're the most resilient, certainly the wealthiest, understand our product best, and we'll continue to do that. OK. Well, as always, thank you so much for your time this morning and for your support. The entire team here at Norwegian Cruise Line Holdings will be available today to answer any of your questions.\n\nHave a great day, and stay safe, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJessica John -- Vice President, Investor Relations, ESG, and Corporate Communications\n\nFrank Del Rio -- President and Chief Executive Officer\n\nMark Kempa -- Executive Vice President and Chief Financial Officer\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nBrandt Montour -- Barclays -- Analyst\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nRobin Farley -- UBS -- Analyst\n\nJaime Katz -- Morningstar -- Analyst\n\nMore NCLH analysis\n\nAll earnings call transcripts"
}