{
  "companyName": "Northwest Natural Holding Company",
  "companyTicker": "NWN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/northwest-natural-holding-company-nwn-q3-2022-earn/",
  "content": "Northwest Natural Holding Company (NWN -1.41%)\nQ3 2022 Earnings Call\nNov 08, 2022, 11:00 a.m. ET\n\nOperator\n\nHello, and welcome to today's NW Natural Holding Company Q3 2022 earnings call. [Operator instructions] I would now like to hand over to our host, Nikki Sparley, with NW Natural Holding. The floor is yours. Please go ahead.\n\nNikki Sparley -- Director, Investor Relations\n\nThank you, Elliot. Good morning, and welcome to our third quarter 2022 earnings call. As a reminder, some things that will be said this morning contain forward-looking statements. They are based on management's assumptions, which may or may not occur.\n\nFor a complete list of our cautionary statements, refer to the language at the end of our press release. We expect to file our 10-Q later today. As mentioned, this teleconference is being recorded and will be available on our website following the call. Please note, these calls are designed for the financial community.\n\nIf you are an investor and have additional questions after the call, please contact me directly at 503-721-2530. News media may contact David Roy at 503-610-7157. Speaking this morning are David Anderson, president and chief executive officer; and Frank Burkhartsmeyer, senior vice president and chief financial officer. David and Frank have prepared remarks and then will be available along with other members of our executive team to answer your questions.\n\nWith that, I will turn it over to David.\n\nDavid Anderson -- Chief Executive Officer\n\nThanks, Nikki, and good morning, everybody, and welcome. We continue to see strong financial results and expect the year to be in line with the guidance that we previously provided. Frank will go through more of the detailed financial results here in a moment. This morning, I'll walk through some economic indicators and provide a summary of Northwest Natural's Oregon general rate case order.\n\nI'll wrap up with an update on hydrogen projects at the gas utility and recent news from our water and competitive renewables business. Turning to a few comments on the economy. In our gas utility service territory in Oregon and Washington, we continue to see strength in employment numbers, while the housing market moderates from its highs in 2021. Overall, Oregon is trending similar to national averages, but we continue to carefully monitor economic conditions.\n\nThe labor market remains stable. In Oregon, for example, unemployment was 3.8% in September 2022. As expected, single-family health and activity is cooling as interest rates rise. Single-family permitting has moderated off the elevated levels in 2021.\n\nThe median sales price of a home was down about 4.7% for the third quarter of this year. The inventory of homes for sale in the Portland Metro area remains very tight at only 2.2 months of supply. Overall growth is roughly in line with our expectations. So far, we've seen the decline in mixed-use multifamily projects but expect several developments to come online in the fourth quarter.\n\nIn addition, supply chain issues have put customer -- conversion projects on a longer runway. Despite these factors, we added nearly 8,800 new customers during the last 12 months, which equates to a growth rate of about 1.1%. Our water and wastewater utilities continued to operate in areas that have a very solid economic footing. Unemployment rates in our largest water service territories range from 2.8% in Idaho, to 4% in Texas.\n\nWe experienced growth across our water utilities with several pockets of outperformance. Texas remains an extraordinarily -- a extraordinary market with our water and wastewater utilities posting nearly 11% organic growth. The housing market in Idaho is strong with our Falls Water utility providing 5% growth. On a consolidated basis, our water and wastewater utilities grew over 3% over the last 12 months.\n\nIn addition to this organic growth, our recent acquisition of Far West in Arizona increased our water customer base by 70% to 61,000 customers. On a consolidated basis, our collective gas and water utility customer base grew 5.3%, including our recent acquisitions. Moving to a summary of our Oregon general rate case for the gas utility. In October, the Oregon Public Utility Commission issued an order approving several multiparty settlements.\n\nUnder the order, Northwest Natural's revenue requirement increased $59.4 million beginning November 1. This was based on a 50-50 capital structure, an ROE of 9.4%, and an overall cost of capital of 6.8%. Rate base increased $320 million and now stands at $1.7 billion. A number of other items were approved as part of the rate case, including full recovery of our COVID deferral, enhancements to our low-income energy efficiency program, the recovery of our Lexington RNG facility and a new automatic adjustment clause for new RNG investments.\n\nDuring the quarter, we filed for our annual purchase gas adjustment also in both states, which updates rates for the projected gas cost in the coming year. In October, we received approval from both Oregon and Washington for those increases in new rates, for those also went into effect November 1. Despite these recent increases, it's important to note that customers are paying less today for their total natural gas service in our area than they did 15 years ago. With that, let me turn it over to Frank to go a little bit deeper into the financials.\n\nFrank?\n\nFrank Burkhartsmeyer -- Senior Vice President and Chief Financial Officer\n\nThank you, David, and good morning, everyone. I will begin by discussing the highlights of the quarter and year-to-date results and conclude with guidance for the year. I'll describe the earnings drivers on an after-tax basis using the statutory tax rate of 26.5%. As a reminder, Northwest Natural's earnings are seasonal with the majority of revenues and earnings in the first and fourth quarters during the winter heating months.\n\nFor the third quarter, we reported a net loss of $19.6 million or $0.56 per share compared to a net loss of $20.7 million or $0.67 per share for the same period in 2021. That's an improvement in results of $0.11 per share. On a quarter-over-quarter basis, our gas utility provided $300,000 of higher earnings related to increased margin and lower pension expense. Net income from our other businesses increased $800,000 for the third quarter of 2022 related to higher asset management revenues, offset by higher interest expenses.\n\nFor the first nine months of 2022, we reported net income of $38.4 million or $1.14 per share compared to net income of $38.1 million or $1.24 for the same period in 2021. The $200,000 increase in net income for the nine-month period reflects an improvement at the gas utility of $3.3 million, while results from our other businesses declined $3.1 million, as the prior period benefited from the higher asset management revenues related to the February 2021 cold weather event. Higher earnings at the gas utility were primarily related to customer growth, new rates in Washington, and colder weather in 2022 compared to 2021. As a result of these factors, utility margin increased $6.6 million.\n\nUtility O&M increased $8.2 million, reflecting higher levels of contract and professional services and IT upgrades. Utility depreciation and general taxes increased $1.5 million due to higher property, plant, and equipment as we continue to invest in our system. Other income increased $6.4 million, driven by lower pension costs. For 2022, cash provided by operating activities was $166 million.\n\nWe invested $257 million into the business, most of which was for gas utility capital expenditures. Our credit ratings remain unchanged with a stable outlook. That includes Northwest Natural's senior secured long-term debt rating of AA- for S&P and A2 for Moody's. Our objective remains to keep our balance sheet strong with ample liquidity.\n\nMoving on to financial guidance. The company reaffirmed 2022 earnings guidance today for net income in the range of $2.45 to $2.65 per share. Guidance assumes continued customer growth, average weather conditions, and no significant changes in prevailing regulatory policies, mechanisms, or outcomes or significant changes in laws, legislation, or regulations. We continue to target a long-term earnings-per-share growth rate of 4% to 6%.\n\nWith that, I'll turn the call back over to David.\n\nDavid Anderson -- Chief Executive Officer\n\nThanks, Frank. Turning to a few updates on our key long-term objectives. Our long-standing core value of environmental stewardship is a driving force behind the choices we make every day in our operations and in planning for the future. We believe climate change requires rapid innovation and collective action, which is why we're committed to reimagining the role of our system and the fuel that we deliver.\n\nIn September, we filed our Integrated Resource Plan with the Oregon and Washington commissions outlining long-range resource plans and pathways to reduce emissions. The plan incorporates complex modeling to arrive at a variety of scenarios to achieve the lowest cost best options to meet safety, reliability, and decarbonization needs. We expect these proceedings to conclude next year. But we are not just planning for the future, we're taking tangible steps forward.\n\nOur engineering team has completed 5% hydrogen blend tests at our Sherwood operations and training center and plans to increase to 10% blends in the coming weeks with a goal of 15% by the end of the year, pending system and equipment testing results. We're also continuing to work on an exciting turquoise hydrogen pilot project to turn methane into clean hydrogen and solid carbon. We'll be testing this groundbreaking technology at our Portland operations facility. This project is in partnership with Modern Electron, and we expect the project to go live in the spring of next year.\n\nFor a couple of our commercial customers, we're working on a pilot using Carbon X equipment. The equipment captures carbon from existing furnaces and boilers to reduce both energy use and greenhouse gas emissions. The carbon dioxide is converted to potassium carbonate, which is blended into soap products. Each unit has the potential to reduce CO2 emissions by nearly 18,000 pounds annually.\n\nWe're not alone in looking at this equipment. It has already been installed in a variety of facilities in Canada and Minneapolis. Several other direct capture technologies are approaching commercialization, and we expect adoption rates to continue to grow and are excited to be on the cutting edge of this innovation. Moving now to an update on our competitive renewable natural gas business that we launched last year.\n\nAs you know, through that business, we're focused on providing cost-effective solutions to help a variety of sectors decarbonize using existing waste streams and renewable energy sources. Construction on our first two RNG facilities that we're investing in are on track to be completed and producing gas in the spring of 2023. As we have discussed in the past, we strive to provide stable and growing gas and water utility earnings while seeking to add growth opportunities that fit our conservative strategy. The renewable natural gas business represents a significant opportunity for us to add earnings and cash flows in a fast-growing market segment.\n\nAt the same time, most RNG projects are sized right for us to effectively transact. The recent interest and transaction activity in the RNG space has validated our thesis to enter this business. We believe we have a competitive edge due to our size, which allows us to be nimble and tailor our approach for each project. I continue to be excited about the growth potential of this business and look forward to adding new projects and pursuing additional opportunities.\n\nTurning to our water and wastewater utility businesses. I'm excited to announce that we closed our largest acquisition to date, Far West water and wastewater utilities in Yuma, Arizona. These utilities are in a fast-growing region which currently serves approximately 25,000 customers. We also believe there are incremental opportunities to grow our presence in Arizona.\n\nIn fact, just this past week, we signed and closed a tuck-in acquisition in Idaho and also signed an agreement for another Washington utility. We remain excited about the investment potential for this business also. And I'm happy to announce we released our 2021 ESG report in late August, outlining our progress on some of our most important sustainability initiatives. And then finally, this morning, the Board approved a dividend increase for the fourth quarter, making this the 67th consecutive year of annual dividend increases.\n\nNorthwest Natural Holdings is one of only three companies on the New York Stock Exchange with this outstanding record. So, in conclusion, we are pleased with where we are for the year. We've got a big quarter coming up and look forward to executing on behalf of our customers and all of you. Thanks for joining us this morning.\n\nAnd Elliot, I think if there's any questions out there, we're ready to open it up for those.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Chris Ellinghaus from Siebert Williams. Your line is open.\n\nChris Ellinghaus -- Siebert Williams -- Analyst\n\nHi, everybody. How are you?\n\nDavid Anderson -- Chief Executive Officer\n\nGood.\n\nChris Ellinghaus -- Siebert Williams -- Analyst\n\nCan you give us a little more color on -- you talked about this new hydrogen project. But can you give us a little color on sort of what your broader aspirations are for hydrogen?\n\nDavid Anderson -- Chief Executive Officer\n\nYeah. I think, as we've been very vocal, we believe that there's different products that can go through our pipeline. And if you're going to decarbonize, obviously, the first thing you work on is energy efficiency. The second thing is renewable natural gases from biogenic resources like wastewater and landfill.\n\nBut we also do believe, like Europe has been doing for a period of time here, putting hydrogen on the system. And there's different forms of hydrogen, and this area is well positioned for green hydrogen, and that's the purpose of testing what level of mix that we can put into the system and, frankly, replicate what they're doing in Europe. And that really allows us to decarbonize what's already a very clean product flowing through the pipeline even further. So -- the main focus is on the utility.\n\nI do believe long term, Chris, there's going to be other investment opportunities for companies, especially after the Inflation Reduction Act was passed. There's tremendous funding from Congress now to push hydrogen forward, which is a good outcome.\n\nChris Ellinghaus -- Siebert Williams -- Analyst\n\nAnd the -- you talked about the consolidation that's been taking place in RNG. Do you see that as enhancing or speeding up development or your ability to transact? Or do you think some of these transactions maybe has a temporary slowing effect?\n\nDavid Anderson -- Chief Executive Officer\n\nWell, I think overall, the transactions show that people see the same thesis that we're seeing, that this is important. If we really are going to address climate change, we have to get more renewable natural gas on the systems. I think a lot of people are trying to gain footholds and it's really good that we've already established a small piece, and we're not going to try to compete against these bigger guys. But it does allow us to focus.\n\nAnd it's just a -- Chris, I would call it a reaffirmation that we're on the right path here. It's a competitive market. We believe that we can compete in it just because of our size, very much like what we're doing in water, that we can transact and be a little bit more nimble than maybe the big guys are doing. So, I don't know if that fully answers your question or not.\n\nChris Ellinghaus -- Siebert Williams -- Analyst\n\nThat was sort of my next question. Does that mean you think some of these behemoth oil and gas companies coming into the space, do you think that means they're going to be looking for the larger transactions, and that will leave maybe some of the smaller stuff more available to you than maybe some of the public RNG companies would have in retrospect?\n\nDavid Anderson -- Chief Executive Officer\n\nThat is exactly what we're -- what we believe will happen, and it makes sense. If these bigger companies are spending a lot of time on the smaller projects, I'm not sure the returns are going to be what they want them to be. And this is very similar to what we're seeing in the water sector.\n\nChris Ellinghaus -- Siebert Williams -- Analyst\n\nRight. And lastly, you talked about having some additional transactions in water. What's your thought process or what are you seeing in the water business today? Are you seeing a pretty active environment?\n\nDavid Anderson -- Chief Executive Officer\n\nWhy don't I get our president of water to answer that? Justin?\n\nJustin Palfreyman -- Vice President, Strategy and Business Development\n\nYeah. Thank you. We're seeing a pretty steady pipeline of activity, Chris, in the water space. It's very difficult to predict.\n\nThere's larger transactions that will occur from time to time, but a pretty steady flow of tuck-in acquisitions. We mentioned earlier in the call that we just signed two in the past week, and one in Washington and one in Idaho. And that's pretty indicative of what we're seeing out there just building on our existing positions and then as larger new markets -- new market-related acquisitions become available, we will execute on that.\n\nChris Ellinghaus -- Siebert Williams -- Analyst\n\nOK. One last thing. Can you give us a little color on how you see the RNG tracker working from the rate case?\n\nFrank Burkhartsmeyer -- Senior Vice President and Chief Financial Officer\n\nHey, Chris, it's Frank. Good to hear from you. Yes, the RNG tracker, this is where we are able to invest in renewable natural gas assets and put them into rate base. And the way it will work is pretty straightforward.\n\nWe will invest, we will close, we will build, bring it online, and then we will incorporate it into rates each November 1 with the -- when we update rates for the PGA. So, there's a little bit of lag, but it's -- in between rate cases, we can pick it up in rates every year. So, to the extent we can, if there's opportunities, we would optimize that a little bit as they came online. But we'll have a little bit of lag within a year depending upon when they're ready to begin producing.\n\nSo -- \n\nDavid Anderson -- Chief Executive Officer\n\nVery similar, Chris, if you remember, our bare steel and cast-iron replacement program, that's how it worked, as we would make the investment for the year. And then every November 1, which is when we update the gas portion of our bill, that rates will be adjusted to reflect the increase in rate base and the associated cost.\n\nChris Ellinghaus -- Siebert Williams -- Analyst\n\nRight. It's limited by the revenue percentage? \n\nFrank Burkhartsmeyer -- Senior Vice President and Chief Financial Officer\n\nYeah. We still -- under SB98, still have that 5% of our revenue requirement per year, which up $35-plus million of incremental cost. Yes. So, we still have quite a bit of room to continue to invest in renewable natural gas at the gas utility.\n\nChris Ellinghaus -- Siebert Williams -- Analyst\n\nOK, great. Thanks so much for the details. Appreciate it.\n\nDavid Anderson -- Chief Executive Officer\n\nThanks, Chris.\n\nOperator\n\n[Operator instructions] Our next question comes from Selman Akyol from Stifel. Your line is open.\n\nSelman Akyol -- Stifel Financial Corp. -- Analyst\n\nThank you. Let me just start off on RNG there and just a few follow-ups. So, you referenced in your comments that you have two that are coming online in early '23. Maybe you could just talk about the outlook for additional projects and how quickly they could come online.\n\nDavid Anderson -- Chief Executive Officer\n\nYeah. We're actively -- so Mike Kotyk is our President of the Renewables business based out of Michigan. He's got a team that is actively looking at projects across the country. Selman, this is everything from landfill opportunities to dairies and things like that and even potential contractual arrangements.\n\nSo, it's a little -- that's about all the information I can give to you right now. There's a lot of projects that we're looking at in terms of development and things like that and, of course, also trying to line up customers for the product. So, it's still early stages. We just started this business.\n\nBut I think what you'll hear us do probably early next year is provide a little bit more on what we see in terms of the marketplace and then how we're attacking the market. But his team is actively looking at various projects around the country.\n\nSelman Akyol -- Stifel Financial Corp. -- Analyst\n\nGot it. And then just looking over to carbon capture. Maybe you could just explain that a little bit more on exactly where your participation is going to be in that on the transportation side or actually on the capture side? Could you just help me understand that a little bit better?\n\nDavid Anderson -- Chief Executive Officer\n\nYes. Kim, do you want to take that one?\n\nKim Rush -- Senior Vice President of Operations and Chief Marketing Officer\n\nGreat. Yeah. Why don't I start with the Carbon X project? Our long-term view, as David said, is displacing conventional gas with RNG and then clean and renewable hydrogen. We also do believe carbon capture, utilization and sequestration are going to be really important.\n\nAnd I think, again, you see that in the Inflation Reduction Act and some of the funding flowing to those technologies. So, we have two projects, the Carbon X is one where we're partnered with some of our bigger commercial customers. And it's -- basically, the equipment is designed to fit onto existing natural gas furnaces and boilers. It reduces the energy use and then it captures the carbon dioxide exhaust from those appliances.\n\nAnd then it's converted into potassium carbonate and that can then be used in a secondary market to create soap. This is just one example of this technology. We know that it is being piloted, as David mentioned, in Minneapolis and in Canada. But we're really excited about it.\n\nAs we mentioned, it has the potential to reduce emissions annually by 18,000 pounds per unit. And it's very flexible. You can -- as this proves out, you can put it on a variety of customer accounts and it allows them to meet some of their climate goals individually along with the system. The other project that we're really excited about is a turquoise hydrogen, so a methane pyrolysis, project with Modern Electron.\n\nAnd if you followed in the news, there's a lot of excitement about turquoise hydrogen because it has potential to be one of the lowest cost low-carbon fuels. Monolith has a $1 billion project that they're getting DOE spending on this technology. For our project, we are anticipating that this kind of equipment, if it proves out, really has the flexibility to be located in a variety of areas on our system. It would allow us to produce distributed hydrogen wherever or whenever we need it.\n\nAnd so, we're exploring the pilot. We want to prove out the technology. We're really interested in the price point. And we're part of a consortium in North America of other utilities that are sort of sharing the learnings on these kinds of pilots and part of HyDeploy, which is an international hydrogen consortium, again, looking both at these kinds of technologies, but also some work on our hydrogen blending, as David mentioned before.\n\nSo, we are exploring a lot of different avenues. And I think it's a reflection of the versatility of hydrogen for gas networks, but also the carbon capture opportunities.\n\nSelman Akyol -- Stifel Financial Corp. -- Analyst\n\nDo you see opportunities to deploy inside the utility and outside the utility? Or would it be all outside the utility?\n\nDavid Anderson -- Chief Executive Officer\n\nI think the focus for us right now, what Kim is talking about, is inside the utility. I think one of our -- I think it is one of our main goals is to decarbonize our gas utility, and we even have a net-zero view that we can get there by 2050, and this would be part of that process. The more we learn about it, just like we learned about RNG in the utility business, I think it will also provide investment opportunities outside the utility. But right now, the focus is inside the utility. \n\nSelman Akyol -- Stifel Financial Corp. -- Analyst\n\nGot it. Very helpful. Thank you. And then just last one for me.\n\nO&M seemed to come in lower than we were expecting. I was wondering if there was anything there you could talk about maybe just the way this shapes up for the fourth quarter relative to taking a look at the first two quarters of the year.\n\nFrank Burkhartsmeyer -- Senior Vice President and Chief Financial Officer\n\nWe have had some initiatives underway this year. Selman, it's a great question, of course. That, too -- we've been, I'd say, slowly doing backfills and we've been monitoring and trying to keep a bit of a lid on unnecessary or non, say, mandatory cost expenditures during the year. And I think you're seeing a little bit of that dampening the trajectory.\n\nWe're up at the utility about 8% for the year, which is really not too far from where we expected to be. I think it -- our view is it will kind of level off for the rest of the year and we're kind of on track where we thought we would be for the year. But it's really -- so far, what we've been -- it's been driven by some inflation in our contract work and then IT maintenance and cloud costs, but it's -- I'd say, in general, it's in line with where we would expect it to be, but just kind of reflecting a little bit extra management action to keep it a little dampened from maybe where you were expecting it to be.\n\nSelman Akyol -- Stifel Financial Corp. -- Analyst\n\nAll right. Thank you very much.\n\nDavid Anderson -- Chief Executive Officer\n\nThanks. Elliot?\n\nOperator\n\nThis concludes our Q&A. I'll now hand over to David Anderson, president and CEO, for final remarks.\n\nDavid Anderson -- Chief Executive Officer\n\nThanks, Elliot, and thanks, everybody, for joining us. Obviously, if you have any questions, get a hold of Nikki or media, get a hold of David Roy as Nikki said in her prepared remarks. We know it's a busy day, and I hope all the -- hope you get out there and vote. We'll talk to you soon.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNikki Sparley -- Director, Investor Relations\n\nDavid Anderson -- Chief Executive Officer\n\nFrank Burkhartsmeyer -- Senior Vice President and Chief Financial Officer\n\nChris Ellinghaus -- Siebert Williams -- Analyst\n\nJustin Palfreyman -- Vice President, Strategy and Business Development\n\nSelman Akyol -- Stifel Financial Corp. -- Analyst\n\nKim Rush -- Senior Vice President of Operations and Chief Marketing Officer\n\nMore NWN analysis\n\nAll earnings call transcripts"
}